TMS320C2000 Assembler PC v6.2.5 Fri Oct 13 15:05:13 2017

Tools Copyright (c) 1996-2014 Texas Instruments Incorporated
C:\Users\wmj\AppData\Local\Temp\1391212                              PAGE    1

       1              ;***************************************************************
       2              ;* TMS320C2000 C/C++ Codegen                         PC v6.2.5 *
       3              ;* Date/Time created: Fri Oct 13 15:05:12 2017                 *
       4              ;***************************************************************
       5                      .compiler_opts --float_support=softlib --hll_source=on --mem_model:code=flat --mem_model:data=large -
       6        0002  FP      .set    XAR2
       7              
       8              $C$DW$CU        .dwtag  DW_TAG_compile_unit
       9                      .dwattr $C$DW$CU, DW_AT_name("D:/BM1000/sw/modules/ctrl/src/32b/ctrl.c")
      10                      .dwattr $C$DW$CU, DW_AT_producer("TMS320C2000 C/C++ Codegen PC v6.2.5 Copyright (c) 1996-2014 Texas I
      11                      .dwattr $C$DW$CU, DW_AT_TI_version(0x01)
      12                      .dwattr $C$DW$CU, DW_AT_comp_dir("D:\BM1000\sw\solutions\instaspin_foc\boards\hvkit_rev1p1\f28x\f2802
      13              
      14              ;**************************************************************
      15              ;* FUNCTION SYNONYMS                                          *

    6795              $C$DW$639       .dwtag  DW_TAG_enumerator, DW_AT_name("USER_ErrorCode_trajFreq_Hz_Low"), DW_AT_const_value(0x
    6796              $C$DW$640       .dwtag  DW_TAG_enumerator, DW_AT_name("USER_ErrorCode_ctrlPeriod_sec_High"), DW_AT_const_valu
    6797              $C$DW$641       .dwtag  DW_TAG_enumerator, DW_AT_name("USER_ErrorCode_ctrlPeriod_sec_Low"), DW_AT_const_value
    6798              $C$DW$642       .dwtag  DW_TAG_enumerator, DW_AT_name("USER_ErrorCode_maxNegativeIdCurrent_a_High"), DW_AT_co
    6799              $C$DW$643       .dwtag  DW_TAG_enumerator, DW_AT_name("USER_ErrorCode_maxNegativeIdCurrent_a_Low"), DW_AT_con
    6800              $C$DW$644       .dwtag  DW_TAG_enumerator, DW_AT_name("USER_numErrorCodes"), DW_AT_const_value(0x6a)
    6801                      .dwendtag $C$DW$T$173
    6802              
    6803              $C$DW$T$174     .dwtag  DW_TAG_typedef, DW_AT_name("USER_ErrorCode_e")
    6804                      .dwattr $C$DW$T$174, DW_AT_type(*$C$DW$T$173)
    6805                      .dwattr $C$DW$T$174, DW_AT_language(DW_LANG_C)
    6806              
    6807              $C$DW$T$183     .dwtag  DW_TAG_enumeration_type
    6808                      .dwattr $C$DW$T$183, DW_AT_byte_size(0x01)
    6809              $C$DW$645       .dwtag  DW_TAG_enumerator, DW_AT_name("EST_State_Error"), DW_AT_const_value(0x00)
    6810              $C$DW$646       .dwtag  DW_TAG_enumerator, DW_AT_name("EST_State_Idle"), DW_AT_const_value(0x01)
    6811              $C$DW$647       .dwtag  DW_TAG_enumerator, DW_AT_name("EST_State_RoverL"), DW_AT_const_value(0x02)
    6812              $C$DW$648       .dwtag  DW_TAG_enumerator, DW_AT_name("EST_State_Rs"), DW_AT_const_value(0x03)
    6813              $C$DW$649       .dwtag  DW_TAG_enumerator, DW_AT_name("EST_State_RampUp"), DW_AT_const_value(0x04)
    6814              $C$DW$650       .dwtag  DW_TAG_enumerator, DW_AT_name("EST_State_IdRated"), DW_AT_const_value(0x05)
    6815              $C$DW$651       .dwtag  DW_TAG_enumerator, DW_AT_name("EST_State_RatedFlux_OL"), DW_AT_const_value(0x06)
    6816              $C$DW$652       .dwtag  DW_TAG_enumerator, DW_AT_name("EST_State_RatedFlux"), DW_AT_const_value(0x07)
    6817              $C$DW$653       .dwtag  DW_TAG_enumerator, DW_AT_name("EST_State_RampDown"), DW_AT_const_value(0x08)
    6818              $C$DW$654       .dwtag  DW_TAG_enumerator, DW_AT_name("EST_State_LockRotor"), DW_AT_const_value(0x09)
    6819              $C$DW$655       .dwtag  DW_TAG_enumerator, DW_AT_name("EST_State_Ls"), DW_AT_const_value(0x0a)
    6820              $C$DW$656       .dwtag  DW_TAG_enumerator, DW_AT_name("EST_State_Rr"), DW_AT_const_value(0x0b)
    6821              $C$DW$657       .dwtag  DW_TAG_enumerator, DW_AT_name("EST_State_MotorIdentified"), DW_AT_const_value(0x0c)
    6822              $C$DW$658       .dwtag  DW_TAG_enumerator, DW_AT_name("EST_State_OnLine"), DW_AT_const_value(0x0d)
    6823              $C$DW$659       .dwtag  DW_TAG_enumerator, DW_AT_name("EST_numStates"), DW_AT_const_value(0x0e)
    6824                      .dwendtag $C$DW$T$183
    6825              
    6826              $C$DW$T$184     .dwtag  DW_TAG_typedef, DW_AT_name("EST_State_e")
    6827                      .dwattr $C$DW$T$184, DW_AT_type(*$C$DW$T$183)
    6828                      .dwattr $C$DW$T$184, DW_AT_language(DW_LANG_C)
    6829              
    6830              $C$DW$T$188     .dwtag  DW_TAG_enumeration_type
    6831                      .dwattr $C$DW$T$188, DW_AT_byte_size(0x01)
    6832              $C$DW$660       .dwtag  DW_TAG_enumerator, DW_AT_name("CTRL_Type_PID_spd"), DW_AT_const_value(0x00)
    6833              $C$DW$661       .dwtag  DW_TAG_enumerator, DW_AT_name("CTRL_Type_PID_Id"), DW_AT_const_value(0x01)
    6834              $C$DW$662       .dwtag  DW_TAG_enumerator, DW_AT_name("CTRL_Type_PID_Iq"), DW_AT_const_value(0x02)
    6835                      .dwendtag $C$DW$T$188
    6836              
    6837              $C$DW$T$189     .dwtag  DW_TAG_typedef, DW_AT_name("CTRL_Type_e")
    6838                      .dwattr $C$DW$T$189, DW_AT_type(*$C$DW$T$188)
    6839                      .dwattr $C$DW$T$189, DW_AT_language(DW_LANG_C)
    6840              $C$DW$663       .dwtag  DW_TAG_TI_far_type
    6841                      .dwattr $C$DW$663, DW_AT_type(*$C$DW$T$189)
TMS320C2000 Assembler PC v6.2.5 Fri Oct 13 15:05:13 2017

Tools Copyright (c) 1996-2014 Texas Instruments Incorporated
C:\Users\wmj\AppData\Local\Temp\1391212                              PAGE  132

    6842              $C$DW$T$190     .dwtag  DW_TAG_const_type
    6843                      .dwattr $C$DW$T$190, DW_AT_type(*$C$DW$663)
    6844              
    6845              $C$DW$T$19      .dwtag  DW_TAG_structure_type
    6846                      .dwattr $C$DW$T$19, DW_AT_name("I2C_Obj")
    6847                      .dwattr $C$DW$T$19, DW_AT_declaration
    6848                      .dwendtag $C$DW$T$19
    6849              
    6850              $C$DW$T$116     .dwtag  DW_TAG_pointer_type
    6851                      .dwattr $C$DW$T$116, DW_AT_type(*$C$DW$T$19)
    6852                      .dwattr $C$DW$T$116, DW_AT_address_class(0x16)
    6853              $C$DW$T$117     .dwtag  DW_TAG_typedef, DW_AT_name("I2C_Handle")
    6854                      .dwattr $C$DW$T$117, DW_AT_type(*$C$DW$T$116)
    6855                      .dwattr $C$DW$T$117, DW_AT_language(DW_LANG_C)
    6856              
    6857              $C$DW$T$31      .dwtag  DW_TAG_structure_type
    6858                      .dwattr $C$DW$T$31, DW_AT_name("_ADC_Obj_")
    6859                      .dwattr $C$DW$T$31, DW_AT_byte_size(0x6650)
    6860              $C$DW$664       .dwtag  DW_TAG_member
    6861                      .dwattr $C$DW$664, DW_AT_type(*$C$DW$T$25)
    6862                      .dwattr $C$DW$664, DW_AT_name("ADCRESULT")
    6863                      .dwattr $C$DW$664, DW_AT_TI_symbol_name("_ADCRESULT")
    6864                      .dwattr $C$DW$664, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    6865                      .dwattr $C$DW$664, DW_AT_accessibility(DW_ACCESS_public)
    6866              $C$DW$665       .dwtag  DW_TAG_member
    6867                      .dwattr $C$DW$665, DW_AT_type(*$C$DW$T$26)
    6868                      .dwattr $C$DW$665, DW_AT_name("resvd_1")
    6869                      .dwattr $C$DW$665, DW_AT_TI_symbol_name("_resvd_1")
    6870                      .dwattr $C$DW$665, DW_AT_data_member_location[DW_OP_plus_uconst 0x10]
    6871                      .dwattr $C$DW$665, DW_AT_accessibility(DW_ACCESS_public)
    6872              $C$DW$666       .dwtag  DW_TAG_member
    6873                      .dwattr $C$DW$666, DW_AT_type(*$C$DW$T$24)
    6874                      .dwattr $C$DW$666, DW_AT_name("ADCCTL1")
    6875                      .dwattr $C$DW$666, DW_AT_TI_symbol_name("_ADCCTL1")
    6876                      .dwattr $C$DW$666, DW_AT_data_member_location[DW_OP_plus_uconst 0x6600]
    6877                      .dwattr $C$DW$666, DW_AT_accessibility(DW_ACCESS_public)
    6878              $C$DW$667       .dwtag  DW_TAG_member
    6879                      .dwattr $C$DW$667, DW_AT_type(*$C$DW$T$24)
    6880                      .dwattr $C$DW$667, DW_AT_name("ADCCTL2")
    6881                      .dwattr $C$DW$667, DW_AT_TI_symbol_name("_ADCCTL2")
    6882                      .dwattr $C$DW$667, DW_AT_data_member_location[DW_OP_plus_uconst 0x6601]
    6883                      .dwattr $C$DW$667, DW_AT_accessibility(DW_ACCESS_public)
    6884              $C$DW$668       .dwtag  DW_TAG_member
    6885                      .dwattr $C$DW$668, DW_AT_type(*$C$DW$T$27)
    6886                      .dwattr $C$DW$668, DW_AT_name("rsvd_2")
    6887                      .dwattr $C$DW$668, DW_AT_TI_symbol_name("_rsvd_2")
    6888                      .dwattr $C$DW$668, DW_AT_data_member_location[DW_OP_plus_uconst 0x6602]
    6889                      .dwattr $C$DW$668, DW_AT_accessibility(DW_ACCESS_public)
    6890              $C$DW$669       .dwtag  DW_TAG_member
    6891                      .dwattr $C$DW$669, DW_AT_type(*$C$DW$T$24)
    6892                      .dwattr $C$DW$669, DW_AT_name("ADCINTFLG")
    6893                      .dwattr $C$DW$669, DW_AT_TI_symbol_name("_ADCINTFLG")
    6894                      .dwattr $C$DW$669, DW_AT_data_member_location[DW_OP_plus_uconst 0x6604]
    6895                      .dwattr $C$DW$669, DW_AT_accessibility(DW_ACCESS_public)
    6896              $C$DW$670       .dwtag  DW_TAG_member
TMS320C2000 Assembler PC v6.2.5 Fri Oct 13 15:05:13 2017

Tools Copyright (c) 1996-2014 Texas Instruments Incorporated
C:\Users\wmj\AppData\Local\Temp\1391212                              PAGE  133

    6897                      .dwattr $C$DW$670, DW_AT_type(*$C$DW$T$24)
    6898                      .dwattr $C$DW$670, DW_AT_name("ADCINTFLGCLR")
    6899                      .dwattr $C$DW$670, DW_AT_TI_symbol_name("_ADCINTFLGCLR")
    6900                      .dwattr $C$DW$670, DW_AT_data_member_location[DW_OP_plus_uconst 0x6605]
    6901                      .dwattr $C$DW$670, DW_AT_accessibility(DW_ACCESS_public)
    6902              $C$DW$671       .dwtag  DW_TAG_member
    6903                      .dwattr $C$DW$671, DW_AT_type(*$C$DW$T$24)
    6904                      .dwattr $C$DW$671, DW_AT_name("ADCINTOVF")
    6905                      .dwattr $C$DW$671, DW_AT_TI_symbol_name("_ADCINTOVF")
    6906                      .dwattr $C$DW$671, DW_AT_data_member_location[DW_OP_plus_uconst 0x6606]
    6907                      .dwattr $C$DW$671, DW_AT_accessibility(DW_ACCESS_public)
    6908              $C$DW$672       .dwtag  DW_TAG_member
    6909                      .dwattr $C$DW$672, DW_AT_type(*$C$DW$T$24)
    6910                      .dwattr $C$DW$672, DW_AT_name("ADCINTOVFCLR")
    6911                      .dwattr $C$DW$672, DW_AT_TI_symbol_name("_ADCINTOVFCLR")
    6912                      .dwattr $C$DW$672, DW_AT_data_member_location[DW_OP_plus_uconst 0x6607]
    6913                      .dwattr $C$DW$672, DW_AT_accessibility(DW_ACCESS_public)
    6914              $C$DW$673       .dwtag  DW_TAG_member
    6915                      .dwattr $C$DW$673, DW_AT_type(*$C$DW$T$28)
    6916                      .dwattr $C$DW$673, DW_AT_name("INTSELxNy")
    6917                      .dwattr $C$DW$673, DW_AT_TI_symbol_name("_INTSELxNy")
    6918                      .dwattr $C$DW$673, DW_AT_data_member_location[DW_OP_plus_uconst 0x6608]
    6919                      .dwattr $C$DW$673, DW_AT_accessibility(DW_ACCESS_public)
    6920              $C$DW$674       .dwtag  DW_TAG_member
    6921                      .dwattr $C$DW$674, DW_AT_type(*$C$DW$T$29)
    6922                      .dwattr $C$DW$674, DW_AT_name("rsvd_3")
    6923                      .dwattr $C$DW$674, DW_AT_TI_symbol_name("_rsvd_3")
    6924                      .dwattr $C$DW$674, DW_AT_data_member_location[DW_OP_plus_uconst 0x660d]
    6925                      .dwattr $C$DW$674, DW_AT_accessibility(DW_ACCESS_public)
    6926              $C$DW$675       .dwtag  DW_TAG_member
    6927                      .dwattr $C$DW$675, DW_AT_type(*$C$DW$T$24)
    6928                      .dwattr $C$DW$675, DW_AT_name("SOCPRICTRL")
    6929                      .dwattr $C$DW$675, DW_AT_TI_symbol_name("_SOCPRICTRL")
    6930                      .dwattr $C$DW$675, DW_AT_data_member_location[DW_OP_plus_uconst 0x6610]
    6931                      .dwattr $C$DW$675, DW_AT_accessibility(DW_ACCESS_public)
    6932              $C$DW$676       .dwtag  DW_TAG_member
    6933                      .dwattr $C$DW$676, DW_AT_type(*$C$DW$T$24)
    6934                      .dwattr $C$DW$676, DW_AT_name("rsvd_4")
    6935                      .dwattr $C$DW$676, DW_AT_TI_symbol_name("_rsvd_4")
    6936                      .dwattr $C$DW$676, DW_AT_data_member_location[DW_OP_plus_uconst 0x6611]
    6937                      .dwattr $C$DW$676, DW_AT_accessibility(DW_ACCESS_public)
    6938              $C$DW$677       .dwtag  DW_TAG_member
    6939                      .dwattr $C$DW$677, DW_AT_type(*$C$DW$T$24)
    6940                      .dwattr $C$DW$677, DW_AT_name("ADCSAMPLEMODE")
    6941                      .dwattr $C$DW$677, DW_AT_TI_symbol_name("_ADCSAMPLEMODE")
    6942                      .dwattr $C$DW$677, DW_AT_data_member_location[DW_OP_plus_uconst 0x6612]
    6943                      .dwattr $C$DW$677, DW_AT_accessibility(DW_ACCESS_public)
    6944              $C$DW$678       .dwtag  DW_TAG_member
    6945                      .dwattr $C$DW$678, DW_AT_type(*$C$DW$T$24)
    6946                      .dwattr $C$DW$678, DW_AT_name("rsvd_5")
    6947                      .dwattr $C$DW$678, DW_AT_TI_symbol_name("_rsvd_5")
    6948                      .dwattr $C$DW$678, DW_AT_data_member_location[DW_OP_plus_uconst 0x6613]
    6949                      .dwattr $C$DW$678, DW_AT_accessibility(DW_ACCESS_public)
    6950              $C$DW$679       .dwtag  DW_TAG_member
    6951                      .dwattr $C$DW$679, DW_AT_type(*$C$DW$T$24)
TMS320C2000 Assembler PC v6.2.5 Fri Oct 13 15:05:13 2017

Tools Copyright (c) 1996-2014 Texas Instruments Incorporated
C:\Users\wmj\AppData\Local\Temp\1391212                              PAGE  134

    6952                      .dwattr $C$DW$679, DW_AT_name("ADCINTSOCSEL1")
    6953                      .dwattr $C$DW$679, DW_AT_TI_symbol_name("_ADCINTSOCSEL1")
    6954                      .dwattr $C$DW$679, DW_AT_data_member_location[DW_OP_plus_uconst 0x6614]
    6955                      .dwattr $C$DW$679, DW_AT_accessibility(DW_ACCESS_public)
    6956              $C$DW$680       .dwtag  DW_TAG_member
    6957                      .dwattr $C$DW$680, DW_AT_type(*$C$DW$T$24)
    6958                      .dwattr $C$DW$680, DW_AT_name("ADCINTSOCSEL2")
    6959                      .dwattr $C$DW$680, DW_AT_TI_symbol_name("_ADCINTSOCSEL2")
    6960                      .dwattr $C$DW$680, DW_AT_data_member_location[DW_OP_plus_uconst 0x6615]
    6961                      .dwattr $C$DW$680, DW_AT_accessibility(DW_ACCESS_public)
    6962              $C$DW$681       .dwtag  DW_TAG_member
    6963                      .dwattr $C$DW$681, DW_AT_type(*$C$DW$T$27)
    6964                      .dwattr $C$DW$681, DW_AT_name("rsvd_6")
    6965                      .dwattr $C$DW$681, DW_AT_TI_symbol_name("_rsvd_6")
    6966                      .dwattr $C$DW$681, DW_AT_data_member_location[DW_OP_plus_uconst 0x6616]
    6967                      .dwattr $C$DW$681, DW_AT_accessibility(DW_ACCESS_public)
    6968              $C$DW$682       .dwtag  DW_TAG_member
    6969                      .dwattr $C$DW$682, DW_AT_type(*$C$DW$T$24)
    6970                      .dwattr $C$DW$682, DW_AT_name("ADCSOCFLG1")
    6971                      .dwattr $C$DW$682, DW_AT_TI_symbol_name("_ADCSOCFLG1")
    6972                      .dwattr $C$DW$682, DW_AT_data_member_location[DW_OP_plus_uconst 0x6618]
    6973                      .dwattr $C$DW$682, DW_AT_accessibility(DW_ACCESS_public)
    6974              $C$DW$683       .dwtag  DW_TAG_member
    6975                      .dwattr $C$DW$683, DW_AT_type(*$C$DW$T$24)
    6976                      .dwattr $C$DW$683, DW_AT_name("rsvd_7")
    6977                      .dwattr $C$DW$683, DW_AT_TI_symbol_name("_rsvd_7")
    6978                      .dwattr $C$DW$683, DW_AT_data_member_location[DW_OP_plus_uconst 0x6619]
    6979                      .dwattr $C$DW$683, DW_AT_accessibility(DW_ACCESS_public)
    6980              $C$DW$684       .dwtag  DW_TAG_member
    6981                      .dwattr $C$DW$684, DW_AT_type(*$C$DW$T$24)
    6982                      .dwattr $C$DW$684, DW_AT_name("ADCSOCFRC1")
    6983                      .dwattr $C$DW$684, DW_AT_TI_symbol_name("_ADCSOCFRC1")
    6984                      .dwattr $C$DW$684, DW_AT_data_member_location[DW_OP_plus_uconst 0x661a]
    6985                      .dwattr $C$DW$684, DW_AT_accessibility(DW_ACCESS_public)
    6986              $C$DW$685       .dwtag  DW_TAG_member
    6987                      .dwattr $C$DW$685, DW_AT_type(*$C$DW$T$24)
    6988                      .dwattr $C$DW$685, DW_AT_name("rsvd_8")
    6989                      .dwattr $C$DW$685, DW_AT_TI_symbol_name("_rsvd_8")
    6990                      .dwattr $C$DW$685, DW_AT_data_member_location[DW_OP_plus_uconst 0x661b]
    6991                      .dwattr $C$DW$685, DW_AT_accessibility(DW_ACCESS_public)
    6992              $C$DW$686       .dwtag  DW_TAG_member
    6993                      .dwattr $C$DW$686, DW_AT_type(*$C$DW$T$24)
    6994                      .dwattr $C$DW$686, DW_AT_name("ADCSOCOVF1")
    6995                      .dwattr $C$DW$686, DW_AT_TI_symbol_name("_ADCSOCOVF1")
    6996                      .dwattr $C$DW$686, DW_AT_data_member_location[DW_OP_plus_uconst 0x661c]
    6997                      .dwattr $C$DW$686, DW_AT_accessibility(DW_ACCESS_public)
    6998              $C$DW$687       .dwtag  DW_TAG_member
    6999                      .dwattr $C$DW$687, DW_AT_type(*$C$DW$T$24)
    7000                      .dwattr $C$DW$687, DW_AT_name("rsvd_9")
    7001                      .dwattr $C$DW$687, DW_AT_TI_symbol_name("_rsvd_9")
    7002                      .dwattr $C$DW$687, DW_AT_data_member_location[DW_OP_plus_uconst 0x661d]
    7003                      .dwattr $C$DW$687, DW_AT_accessibility(DW_ACCESS_public)
    7004              $C$DW$688       .dwtag  DW_TAG_member
    7005                      .dwattr $C$DW$688, DW_AT_type(*$C$DW$T$24)
    7006                      .dwattr $C$DW$688, DW_AT_name("ADCSOCOVFCLR1")
TMS320C2000 Assembler PC v6.2.5 Fri Oct 13 15:05:13 2017

Tools Copyright (c) 1996-2014 Texas Instruments Incorporated
C:\Users\wmj\AppData\Local\Temp\1391212                              PAGE  135

    7007                      .dwattr $C$DW$688, DW_AT_TI_symbol_name("_ADCSOCOVFCLR1")
    7008                      .dwattr $C$DW$688, DW_AT_data_member_location[DW_OP_plus_uconst 0x661e]
    7009                      .dwattr $C$DW$688, DW_AT_accessibility(DW_ACCESS_public)
    7010              $C$DW$689       .dwtag  DW_TAG_member
    7011                      .dwattr $C$DW$689, DW_AT_type(*$C$DW$T$24)
    7012                      .dwattr $C$DW$689, DW_AT_name("rsvd_10")
    7013                      .dwattr $C$DW$689, DW_AT_TI_symbol_name("_rsvd_10")
    7014                      .dwattr $C$DW$689, DW_AT_data_member_location[DW_OP_plus_uconst 0x661f]
    7015                      .dwattr $C$DW$689, DW_AT_accessibility(DW_ACCESS_public)
    7016              $C$DW$690       .dwtag  DW_TAG_member
    7017                      .dwattr $C$DW$690, DW_AT_type(*$C$DW$T$25)
    7018                      .dwattr $C$DW$690, DW_AT_name("ADCSOCxCTL")
    7019                      .dwattr $C$DW$690, DW_AT_TI_symbol_name("_ADCSOCxCTL")
    7020                      .dwattr $C$DW$690, DW_AT_data_member_location[DW_OP_plus_uconst 0x6620]
    7021                      .dwattr $C$DW$690, DW_AT_accessibility(DW_ACCESS_public)
    7022              $C$DW$691       .dwtag  DW_TAG_member
    7023                      .dwattr $C$DW$691, DW_AT_type(*$C$DW$T$25)
    7024                      .dwattr $C$DW$691, DW_AT_name("rsvd_11")
    7025                      .dwattr $C$DW$691, DW_AT_TI_symbol_name("_rsvd_11")
    7026                      .dwattr $C$DW$691, DW_AT_data_member_location[DW_OP_plus_uconst 0x6630]
    7027                      .dwattr $C$DW$691, DW_AT_accessibility(DW_ACCESS_public)
    7028              $C$DW$692       .dwtag  DW_TAG_member
    7029                      .dwattr $C$DW$692, DW_AT_type(*$C$DW$T$24)
    7030                      .dwattr $C$DW$692, DW_AT_name("ADCREFTRIM")
    7031                      .dwattr $C$DW$692, DW_AT_TI_symbol_name("_ADCREFTRIM")
    7032                      .dwattr $C$DW$692, DW_AT_data_member_location[DW_OP_plus_uconst 0x6640]
    7033                      .dwattr $C$DW$692, DW_AT_accessibility(DW_ACCESS_public)
    7034              $C$DW$693       .dwtag  DW_TAG_member
    7035                      .dwattr $C$DW$693, DW_AT_type(*$C$DW$T$24)
    7036                      .dwattr $C$DW$693, DW_AT_name("ADCOFFTRIM")
    7037                      .dwattr $C$DW$693, DW_AT_TI_symbol_name("_ADCOFFTRIM")
    7038                      .dwattr $C$DW$693, DW_AT_data_member_location[DW_OP_plus_uconst 0x6641]
    7039                      .dwattr $C$DW$693, DW_AT_accessibility(DW_ACCESS_public)
    7040              $C$DW$694       .dwtag  DW_TAG_member
    7041                      .dwattr $C$DW$694, DW_AT_type(*$C$DW$T$30)
    7042                      .dwattr $C$DW$694, DW_AT_name("resvd_12")
    7043                      .dwattr $C$DW$694, DW_AT_TI_symbol_name("_resvd_12")
    7044                      .dwattr $C$DW$694, DW_AT_data_member_location[DW_OP_plus_uconst 0x6642]
    7045                      .dwattr $C$DW$694, DW_AT_accessibility(DW_ACCESS_public)
    7046              $C$DW$695       .dwtag  DW_TAG_member
    7047                      .dwattr $C$DW$695, DW_AT_type(*$C$DW$T$24)
    7048                      .dwattr $C$DW$695, DW_AT_name("ADCREV")
    7049                      .dwattr $C$DW$695, DW_AT_TI_symbol_name("_ADCREV")
    7050                      .dwattr $C$DW$695, DW_AT_data_member_location[DW_OP_plus_uconst 0x664f]
    7051                      .dwattr $C$DW$695, DW_AT_accessibility(DW_ACCESS_public)
    7052                      .dwendtag $C$DW$T$31
    7053              
    7054              $C$DW$T$87      .dwtag  DW_TAG_pointer_type
    7055                      .dwattr $C$DW$T$87, DW_AT_type(*$C$DW$T$31)
    7056                      .dwattr $C$DW$T$87, DW_AT_address_class(0x16)
    7057              $C$DW$T$88      .dwtag  DW_TAG_typedef, DW_AT_name("ADC_Handle")
    7058                      .dwattr $C$DW$T$88, DW_AT_type(*$C$DW$T$87)
    7059                      .dwattr $C$DW$T$88, DW_AT_language(DW_LANG_C)
    7060              
    7061              $C$DW$T$35      .dwtag  DW_TAG_structure_type
TMS320C2000 Assembler PC v6.2.5 Fri Oct 13 15:05:13 2017

Tools Copyright (c) 1996-2014 Texas Instruments Incorporated
C:\Users\wmj\AppData\Local\Temp\1391212                              PAGE  136

    7062                      .dwattr $C$DW$T$35, DW_AT_name("_BRAKE_Obj_")
    7063                      .dwattr $C$DW$T$35, DW_AT_byte_size(0x08)
    7064              $C$DW$696       .dwtag  DW_TAG_member
    7065                      .dwattr $C$DW$696, DW_AT_type(*$C$DW$T$32)
    7066                      .dwattr $C$DW$696, DW_AT_name("angle_pu")
    7067                      .dwattr $C$DW$696, DW_AT_TI_symbol_name("_angle_pu")
    7068                      .dwattr $C$DW$696, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    7069                      .dwattr $C$DW$696, DW_AT_accessibility(DW_ACCESS_public)
    7070              $C$DW$697       .dwtag  DW_TAG_member
    7071                      .dwattr $C$DW$697, DW_AT_type(*$C$DW$T$33)
    7072                      .dwattr $C$DW$697, DW_AT_name("Idq_brake")
    7073                      .dwattr $C$DW$697, DW_AT_TI_symbol_name("_Idq_brake")
    7074                      .dwattr $C$DW$697, DW_AT_data_member_location[DW_OP_plus_uconst 0x2]
    7075                      .dwattr $C$DW$697, DW_AT_accessibility(DW_ACCESS_public)
    7076              $C$DW$698       .dwtag  DW_TAG_member
    7077                      .dwattr $C$DW$698, DW_AT_type(*$C$DW$T$34)
    7078                      .dwattr $C$DW$698, DW_AT_name("brake_enable")
    7079                      .dwattr $C$DW$698, DW_AT_TI_symbol_name("_brake_enable")
    7080                      .dwattr $C$DW$698, DW_AT_data_member_location[DW_OP_plus_uconst 0x6]
    7081                      .dwattr $C$DW$698, DW_AT_accessibility(DW_ACCESS_public)
    7082                      .dwendtag $C$DW$T$35
    7083              
    7084              $C$DW$T$74      .dwtag  DW_TAG_typedef, DW_AT_name("BRAKE_Obj")
    7085                      .dwattr $C$DW$T$74, DW_AT_type(*$C$DW$T$35)
    7086                      .dwattr $C$DW$T$74, DW_AT_language(DW_LANG_C)
    7087              $C$DW$T$72      .dwtag  DW_TAG_pointer_type
    7088                      .dwattr $C$DW$T$72, DW_AT_type(*$C$DW$T$35)
    7089                      .dwattr $C$DW$T$72, DW_AT_address_class(0x16)
    7090              $C$DW$T$73      .dwtag  DW_TAG_typedef, DW_AT_name("BRAKE_Handle")
    7091                      .dwattr $C$DW$T$73, DW_AT_type(*$C$DW$T$72)
    7092                      .dwattr $C$DW$T$73, DW_AT_language(DW_LANG_C)
    7093              
    7094              $C$DW$T$37      .dwtag  DW_TAG_structure_type
    7095                      .dwattr $C$DW$T$37, DW_AT_name("_CLARKE_Obj_")
    7096                      .dwattr $C$DW$T$37, DW_AT_byte_size(0x06)
    7097              $C$DW$699       .dwtag  DW_TAG_member
    7098                      .dwattr $C$DW$699, DW_AT_type(*$C$DW$T$32)
    7099                      .dwattr $C$DW$699, DW_AT_name("alpha_sf")
    7100                      .dwattr $C$DW$699, DW_AT_TI_symbol_name("_alpha_sf")
    7101                      .dwattr $C$DW$699, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    7102                      .dwattr $C$DW$699, DW_AT_accessibility(DW_ACCESS_public)
    7103              $C$DW$700       .dwtag  DW_TAG_member
    7104                      .dwattr $C$DW$700, DW_AT_type(*$C$DW$T$32)
    7105                      .dwattr $C$DW$700, DW_AT_name("beta_sf")
    7106                      .dwattr $C$DW$700, DW_AT_TI_symbol_name("_beta_sf")
    7107                      .dwattr $C$DW$700, DW_AT_data_member_location[DW_OP_plus_uconst 0x2]
    7108                      .dwattr $C$DW$700, DW_AT_accessibility(DW_ACCESS_public)
    7109              $C$DW$701       .dwtag  DW_TAG_member
    7110                      .dwattr $C$DW$701, DW_AT_type(*$C$DW$T$36)
    7111                      .dwattr $C$DW$701, DW_AT_name("numSensors")
    7112                      .dwattr $C$DW$701, DW_AT_TI_symbol_name("_numSensors")
    7113                      .dwattr $C$DW$701, DW_AT_data_member_location[DW_OP_plus_uconst 0x4]
    7114                      .dwattr $C$DW$701, DW_AT_accessibility(DW_ACCESS_public)
    7115                      .dwendtag $C$DW$T$37
    7116              
TMS320C2000 Assembler PC v6.2.5 Fri Oct 13 15:05:13 2017

Tools Copyright (c) 1996-2014 Texas Instruments Incorporated
C:\Users\wmj\AppData\Local\Temp\1391212                              PAGE  137

    7117              $C$DW$T$48      .dwtag  DW_TAG_typedef, DW_AT_name("CLARKE_Obj")
    7118                      .dwattr $C$DW$T$48, DW_AT_type(*$C$DW$T$37)
    7119                      .dwattr $C$DW$T$48, DW_AT_language(DW_LANG_C)
    7120              $C$DW$T$196     .dwtag  DW_TAG_pointer_type
    7121                      .dwattr $C$DW$T$196, DW_AT_type(*$C$DW$T$48)
    7122                      .dwattr $C$DW$T$196, DW_AT_address_class(0x16)
    7123              $C$DW$T$46      .dwtag  DW_TAG_pointer_type
    7124                      .dwattr $C$DW$T$46, DW_AT_type(*$C$DW$T$37)
    7125                      .dwattr $C$DW$T$46, DW_AT_address_class(0x16)
    7126              $C$DW$T$47      .dwtag  DW_TAG_typedef, DW_AT_name("CLARKE_Handle")
    7127                      .dwattr $C$DW$T$47, DW_AT_type(*$C$DW$T$46)
    7128                      .dwattr $C$DW$T$47, DW_AT_language(DW_LANG_C)
    7129              
    7130              $C$DW$T$39      .dwtag  DW_TAG_structure_type
    7131                      .dwattr $C$DW$T$39, DW_AT_name("_CLK_Obj_")
    7132                      .dwattr $C$DW$T$39, DW_AT_byte_size(0x11)
    7133              $C$DW$702       .dwtag  DW_TAG_member
    7134                      .dwattr $C$DW$702, DW_AT_type(*$C$DW$T$24)
    7135                      .dwattr $C$DW$702, DW_AT_name("XCLK")
    7136                      .dwattr $C$DW$702, DW_AT_TI_symbol_name("_XCLK")
    7137                      .dwattr $C$DW$702, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    7138                      .dwattr $C$DW$702, DW_AT_accessibility(DW_ACCESS_public)
    7139              $C$DW$703       .dwtag  DW_TAG_member
    7140                      .dwattr $C$DW$703, DW_AT_type(*$C$DW$T$24)
    7141                      .dwattr $C$DW$703, DW_AT_name("rsvd_1")
    7142                      .dwattr $C$DW$703, DW_AT_TI_symbol_name("_rsvd_1")
    7143                      .dwattr $C$DW$703, DW_AT_data_member_location[DW_OP_plus_uconst 0x1]
    7144                      .dwattr $C$DW$703, DW_AT_accessibility(DW_ACCESS_public)
    7145              $C$DW$704       .dwtag  DW_TAG_member
    7146                      .dwattr $C$DW$704, DW_AT_type(*$C$DW$T$24)
    7147                      .dwattr $C$DW$704, DW_AT_name("CLKCTL")
    7148                      .dwattr $C$DW$704, DW_AT_TI_symbol_name("_CLKCTL")
    7149                      .dwattr $C$DW$704, DW_AT_data_member_location[DW_OP_plus_uconst 0x2]
    7150                      .dwattr $C$DW$704, DW_AT_accessibility(DW_ACCESS_public)
    7151              $C$DW$705       .dwtag  DW_TAG_member
    7152                      .dwattr $C$DW$705, DW_AT_type(*$C$DW$T$38)
    7153                      .dwattr $C$DW$705, DW_AT_name("rsvd_2")
    7154                      .dwattr $C$DW$705, DW_AT_TI_symbol_name("_rsvd_2")
    7155                      .dwattr $C$DW$705, DW_AT_data_member_location[DW_OP_plus_uconst 0x3]
    7156                      .dwattr $C$DW$705, DW_AT_accessibility(DW_ACCESS_public)
    7157              $C$DW$706       .dwtag  DW_TAG_member
    7158                      .dwattr $C$DW$706, DW_AT_type(*$C$DW$T$24)
    7159                      .dwattr $C$DW$706, DW_AT_name("LOSPCP")
    7160                      .dwattr $C$DW$706, DW_AT_TI_symbol_name("_LOSPCP")
    7161                      .dwattr $C$DW$706, DW_AT_data_member_location[DW_OP_plus_uconst 0xb]
    7162                      .dwattr $C$DW$706, DW_AT_accessibility(DW_ACCESS_public)
    7163              $C$DW$707       .dwtag  DW_TAG_member
    7164                      .dwattr $C$DW$707, DW_AT_type(*$C$DW$T$24)
    7165                      .dwattr $C$DW$707, DW_AT_name("PCLKCR0")
    7166                      .dwattr $C$DW$707, DW_AT_TI_symbol_name("_PCLKCR0")
    7167                      .dwattr $C$DW$707, DW_AT_data_member_location[DW_OP_plus_uconst 0xc]
    7168                      .dwattr $C$DW$707, DW_AT_accessibility(DW_ACCESS_public)
    7169              $C$DW$708       .dwtag  DW_TAG_member
    7170                      .dwattr $C$DW$708, DW_AT_type(*$C$DW$T$24)
    7171                      .dwattr $C$DW$708, DW_AT_name("PCLKCR1")
TMS320C2000 Assembler PC v6.2.5 Fri Oct 13 15:05:13 2017

Tools Copyright (c) 1996-2014 Texas Instruments Incorporated
C:\Users\wmj\AppData\Local\Temp\1391212                              PAGE  138

    7172                      .dwattr $C$DW$708, DW_AT_TI_symbol_name("_PCLKCR1")
    7173                      .dwattr $C$DW$708, DW_AT_data_member_location[DW_OP_plus_uconst 0xd]
    7174                      .dwattr $C$DW$708, DW_AT_accessibility(DW_ACCESS_public)
    7175              $C$DW$709       .dwtag  DW_TAG_member
    7176                      .dwattr $C$DW$709, DW_AT_type(*$C$DW$T$27)
    7177                      .dwattr $C$DW$709, DW_AT_name("rsvd_3")
    7178                      .dwattr $C$DW$709, DW_AT_TI_symbol_name("_rsvd_3")
    7179                      .dwattr $C$DW$709, DW_AT_data_member_location[DW_OP_plus_uconst 0xe]
    7180                      .dwattr $C$DW$709, DW_AT_accessibility(DW_ACCESS_public)
    7181              $C$DW$710       .dwtag  DW_TAG_member
    7182                      .dwattr $C$DW$710, DW_AT_type(*$C$DW$T$24)
    7183                      .dwattr $C$DW$710, DW_AT_name("PCLKCR3")
    7184                      .dwattr $C$DW$710, DW_AT_TI_symbol_name("_PCLKCR3")
    7185                      .dwattr $C$DW$710, DW_AT_data_member_location[DW_OP_plus_uconst 0x10]
    7186                      .dwattr $C$DW$710, DW_AT_accessibility(DW_ACCESS_public)
    7187                      .dwendtag $C$DW$T$39
    7188              
    7189              $C$DW$T$89      .dwtag  DW_TAG_pointer_type
    7190                      .dwattr $C$DW$T$89, DW_AT_type(*$C$DW$T$39)
    7191                      .dwattr $C$DW$T$89, DW_AT_address_class(0x16)
    7192              $C$DW$T$90      .dwtag  DW_TAG_typedef, DW_AT_name("CLK_Handle")
    7193                      .dwattr $C$DW$T$90, DW_AT_type(*$C$DW$T$89)
    7194                      .dwattr $C$DW$T$90, DW_AT_language(DW_LANG_C)
    7195              
    7196              $C$DW$T$40      .dwtag  DW_TAG_structure_type
    7197                      .dwattr $C$DW$T$40, DW_AT_name("_CPU_Obj_")
    7198                      .dwattr $C$DW$T$40, DW_AT_byte_size(0x01)
    7199              $C$DW$711       .dwtag  DW_TAG_member
    7200                      .dwattr $C$DW$711, DW_AT_type(*$C$DW$T$36)
    7201                      .dwattr $C$DW$711, DW_AT_name("tmp")
    7202                      .dwattr $C$DW$711, DW_AT_TI_symbol_name("_tmp")
    7203                      .dwattr $C$DW$711, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    7204                      .dwattr $C$DW$711, DW_AT_accessibility(DW_ACCESS_public)
    7205                      .dwendtag $C$DW$T$40
    7206              
    7207              $C$DW$T$91      .dwtag  DW_TAG_pointer_type
    7208                      .dwattr $C$DW$T$91, DW_AT_type(*$C$DW$T$40)
    7209                      .dwattr $C$DW$T$91, DW_AT_address_class(0x16)
    7210              $C$DW$T$92      .dwtag  DW_TAG_typedef, DW_AT_name("CPU_Handle")
    7211                      .dwattr $C$DW$T$92, DW_AT_type(*$C$DW$T$91)
    7212                      .dwattr $C$DW$T$92, DW_AT_language(DW_LANG_C)
    7213              
    7214              $C$DW$T$75      .dwtag  DW_TAG_structure_type
    7215                      .dwattr $C$DW$T$75, DW_AT_name("_CTRL_Obj_")
    7216                      .dwattr $C$DW$T$75, DW_AT_byte_size(0x112)
    7217              $C$DW$712       .dwtag  DW_TAG_member
    7218                      .dwattr $C$DW$712, DW_AT_type(*$C$DW$T$41)
    7219                      .dwattr $C$DW$712, DW_AT_name("version")
    7220                      .dwattr $C$DW$712, DW_AT_TI_symbol_name("_version")
    7221                      .dwattr $C$DW$712, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    7222                      .dwattr $C$DW$712, DW_AT_accessibility(DW_ACCESS_public)
    7223              $C$DW$713       .dwtag  DW_TAG_member
    7224                      .dwattr $C$DW$713, DW_AT_type(*$C$DW$T$43)
    7225                      .dwattr $C$DW$713, DW_AT_name("state")
    7226                      .dwattr $C$DW$713, DW_AT_TI_symbol_name("_state")
TMS320C2000 Assembler PC v6.2.5 Fri Oct 13 15:05:13 2017

Tools Copyright (c) 1996-2014 Texas Instruments Incorporated
C:\Users\wmj\AppData\Local\Temp\1391212                              PAGE  139

    7227                      .dwattr $C$DW$713, DW_AT_data_member_location[DW_OP_plus_uconst 0x4]
    7228                      .dwattr $C$DW$713, DW_AT_accessibility(DW_ACCESS_public)
    7229              $C$DW$714       .dwtag  DW_TAG_member
    7230                      .dwattr $C$DW$714, DW_AT_type(*$C$DW$T$43)
    7231                      .dwattr $C$DW$714, DW_AT_name("prevState")
    7232                      .dwattr $C$DW$714, DW_AT_TI_symbol_name("_prevState")
    7233                      .dwattr $C$DW$714, DW_AT_data_member_location[DW_OP_plus_uconst 0x5]
    7234                      .dwattr $C$DW$714, DW_AT_accessibility(DW_ACCESS_public)
    7235              $C$DW$715       .dwtag  DW_TAG_member
    7236                      .dwattr $C$DW$715, DW_AT_type(*$C$DW$T$45)
    7237                      .dwattr $C$DW$715, DW_AT_name("errorCode")
    7238                      .dwattr $C$DW$715, DW_AT_TI_symbol_name("_errorCode")
    7239                      .dwattr $C$DW$715, DW_AT_data_member_location[DW_OP_plus_uconst 0x6]
    7240                      .dwattr $C$DW$715, DW_AT_accessibility(DW_ACCESS_public)
    7241              $C$DW$716       .dwtag  DW_TAG_member
    7242                      .dwattr $C$DW$716, DW_AT_type(*$C$DW$T$47)
    7243                      .dwattr $C$DW$716, DW_AT_name("clarkeHandle_I")
    7244                      .dwattr $C$DW$716, DW_AT_TI_symbol_name("_clarkeHandle_I")
    7245                      .dwattr $C$DW$716, DW_AT_data_member_location[DW_OP_plus_uconst 0x8]
    7246                      .dwattr $C$DW$716, DW_AT_accessibility(DW_ACCESS_public)
    7247              $C$DW$717       .dwtag  DW_TAG_member
    7248                      .dwattr $C$DW$717, DW_AT_type(*$C$DW$T$48)
    7249                      .dwattr $C$DW$717, DW_AT_name("clarke_I")
    7250                      .dwattr $C$DW$717, DW_AT_TI_symbol_name("_clarke_I")
    7251                      .dwattr $C$DW$717, DW_AT_data_member_location[DW_OP_plus_uconst 0xa]
    7252                      .dwattr $C$DW$717, DW_AT_accessibility(DW_ACCESS_public)
    7253              $C$DW$718       .dwtag  DW_TAG_member
    7254                      .dwattr $C$DW$718, DW_AT_type(*$C$DW$T$47)
    7255                      .dwattr $C$DW$718, DW_AT_name("clarkeHandle_V")
    7256                      .dwattr $C$DW$718, DW_AT_TI_symbol_name("_clarkeHandle_V")
    7257                      .dwattr $C$DW$718, DW_AT_data_member_location[DW_OP_plus_uconst 0x10]
    7258                      .dwattr $C$DW$718, DW_AT_accessibility(DW_ACCESS_public)
    7259              $C$DW$719       .dwtag  DW_TAG_member
    7260                      .dwattr $C$DW$719, DW_AT_type(*$C$DW$T$48)
    7261                      .dwattr $C$DW$719, DW_AT_name("clarke_V")
    7262                      .dwattr $C$DW$719, DW_AT_TI_symbol_name("_clarke_V")
    7263                      .dwattr $C$DW$719, DW_AT_data_member_location[DW_OP_plus_uconst 0x12]
    7264                      .dwattr $C$DW$719, DW_AT_accessibility(DW_ACCESS_public)
    7265              $C$DW$720       .dwtag  DW_TAG_member
    7266                      .dwattr $C$DW$720, DW_AT_type(*$C$DW$T$50)
    7267                      .dwattr $C$DW$720, DW_AT_name("estHandle")
    7268                      .dwattr $C$DW$720, DW_AT_TI_symbol_name("_estHandle")
    7269                      .dwattr $C$DW$720, DW_AT_data_member_location[DW_OP_plus_uconst 0x18]
    7270                      .dwattr $C$DW$720, DW_AT_accessibility(DW_ACCESS_public)
    7271              $C$DW$721       .dwtag  DW_TAG_member
    7272                      .dwattr $C$DW$721, DW_AT_type(*$C$DW$T$52)
    7273                      .dwattr $C$DW$721, DW_AT_name("parkHandle")
    7274                      .dwattr $C$DW$721, DW_AT_TI_symbol_name("_parkHandle")
    7275                      .dwattr $C$DW$721, DW_AT_data_member_location[DW_OP_plus_uconst 0x1a]
    7276                      .dwattr $C$DW$721, DW_AT_accessibility(DW_ACCESS_public)
    7277              $C$DW$722       .dwtag  DW_TAG_member
    7278                      .dwattr $C$DW$722, DW_AT_type(*$C$DW$T$53)
    7279                      .dwattr $C$DW$722, DW_AT_name("park")
    7280                      .dwattr $C$DW$722, DW_AT_TI_symbol_name("_park")
    7281                      .dwattr $C$DW$722, DW_AT_data_member_location[DW_OP_plus_uconst 0x1c]
TMS320C2000 Assembler PC v6.2.5 Fri Oct 13 15:05:13 2017

Tools Copyright (c) 1996-2014 Texas Instruments Incorporated
C:\Users\wmj\AppData\Local\Temp\1391212                              PAGE  140

    7282                      .dwattr $C$DW$722, DW_AT_accessibility(DW_ACCESS_public)
    7283              $C$DW$723       .dwtag  DW_TAG_member
    7284                      .dwattr $C$DW$723, DW_AT_type(*$C$DW$T$55)
    7285                      .dwattr $C$DW$723, DW_AT_name("pidHandle_Id")
    7286                      .dwattr $C$DW$723, DW_AT_TI_symbol_name("_pidHandle_Id")
    7287                      .dwattr $C$DW$723, DW_AT_data_member_location[DW_OP_plus_uconst 0x20]
    7288                      .dwattr $C$DW$723, DW_AT_accessibility(DW_ACCESS_public)
    7289              $C$DW$724       .dwtag  DW_TAG_member
    7290                      .dwattr $C$DW$724, DW_AT_type(*$C$DW$T$56)
    7291                      .dwattr $C$DW$724, DW_AT_name("pid_Id")
    7292                      .dwattr $C$DW$724, DW_AT_TI_symbol_name("_pid_Id")
    7293                      .dwattr $C$DW$724, DW_AT_data_member_location[DW_OP_plus_uconst 0x22]
    7294                      .dwattr $C$DW$724, DW_AT_accessibility(DW_ACCESS_public)
    7295              $C$DW$725       .dwtag  DW_TAG_member
    7296                      .dwattr $C$DW$725, DW_AT_type(*$C$DW$T$55)
    7297                      .dwattr $C$DW$725, DW_AT_name("pidHandle_Iq")
    7298                      .dwattr $C$DW$725, DW_AT_TI_symbol_name("_pidHandle_Iq")
    7299                      .dwattr $C$DW$725, DW_AT_data_member_location[DW_OP_plus_uconst 0x32]
    7300                      .dwattr $C$DW$725, DW_AT_accessibility(DW_ACCESS_public)
    7301              $C$DW$726       .dwtag  DW_TAG_member
    7302                      .dwattr $C$DW$726, DW_AT_type(*$C$DW$T$56)
    7303                      .dwattr $C$DW$726, DW_AT_name("pid_Iq")
    7304                      .dwattr $C$DW$726, DW_AT_TI_symbol_name("_pid_Iq")
    7305                      .dwattr $C$DW$726, DW_AT_data_member_location[DW_OP_plus_uconst 0x34]
    7306                      .dwattr $C$DW$726, DW_AT_accessibility(DW_ACCESS_public)
    7307              $C$DW$727       .dwtag  DW_TAG_member
    7308                      .dwattr $C$DW$727, DW_AT_type(*$C$DW$T$55)
    7309                      .dwattr $C$DW$727, DW_AT_name("pidHandle_spd")
    7310                      .dwattr $C$DW$727, DW_AT_TI_symbol_name("_pidHandle_spd")
    7311                      .dwattr $C$DW$727, DW_AT_data_member_location[DW_OP_plus_uconst 0x44]
    7312                      .dwattr $C$DW$727, DW_AT_accessibility(DW_ACCESS_public)
    7313              $C$DW$728       .dwtag  DW_TAG_member
    7314                      .dwattr $C$DW$728, DW_AT_type(*$C$DW$T$56)
    7315                      .dwattr $C$DW$728, DW_AT_name("pid_spd")
    7316                      .dwattr $C$DW$728, DW_AT_TI_symbol_name("_pid_spd")
    7317                      .dwattr $C$DW$728, DW_AT_data_member_location[DW_OP_plus_uconst 0x46]
    7318                      .dwattr $C$DW$728, DW_AT_accessibility(DW_ACCESS_public)
    7319              $C$DW$729       .dwtag  DW_TAG_member
    7320                      .dwattr $C$DW$729, DW_AT_type(*$C$DW$T$58)
    7321                      .dwattr $C$DW$729, DW_AT_name("iparkHandle")
    7322                      .dwattr $C$DW$729, DW_AT_TI_symbol_name("_iparkHandle")
    7323                      .dwattr $C$DW$729, DW_AT_data_member_location[DW_OP_plus_uconst 0x56]
    7324                      .dwattr $C$DW$729, DW_AT_accessibility(DW_ACCESS_public)
    7325              $C$DW$730       .dwtag  DW_TAG_member
    7326                      .dwattr $C$DW$730, DW_AT_type(*$C$DW$T$59)
    7327                      .dwattr $C$DW$730, DW_AT_name("ipark")
    7328                      .dwattr $C$DW$730, DW_AT_TI_symbol_name("_ipark")
    7329                      .dwattr $C$DW$730, DW_AT_data_member_location[DW_OP_plus_uconst 0x58]
    7330                      .dwattr $C$DW$730, DW_AT_accessibility(DW_ACCESS_public)
    7331              $C$DW$731       .dwtag  DW_TAG_member
    7332                      .dwattr $C$DW$731, DW_AT_type(*$C$DW$T$61)
    7333                      .dwattr $C$DW$731, DW_AT_name("svgenHandle")
    7334                      .dwattr $C$DW$731, DW_AT_TI_symbol_name("_svgenHandle")
    7335                      .dwattr $C$DW$731, DW_AT_data_member_location[DW_OP_plus_uconst 0x5c]
    7336                      .dwattr $C$DW$731, DW_AT_accessibility(DW_ACCESS_public)
TMS320C2000 Assembler PC v6.2.5 Fri Oct 13 15:05:13 2017

Tools Copyright (c) 1996-2014 Texas Instruments Incorporated
C:\Users\wmj\AppData\Local\Temp\1391212                              PAGE  141

    7337              $C$DW$732       .dwtag  DW_TAG_member
    7338                      .dwattr $C$DW$732, DW_AT_type(*$C$DW$T$62)
    7339                      .dwattr $C$DW$732, DW_AT_name("svgen")
    7340                      .dwattr $C$DW$732, DW_AT_TI_symbol_name("_svgen")
    7341                      .dwattr $C$DW$732, DW_AT_data_member_location[DW_OP_plus_uconst 0x5e]
    7342                      .dwattr $C$DW$732, DW_AT_accessibility(DW_ACCESS_public)
    7343              $C$DW$733       .dwtag  DW_TAG_member
    7344                      .dwattr $C$DW$733, DW_AT_type(*$C$DW$T$64)
    7345                      .dwattr $C$DW$733, DW_AT_name("trajHandle_Id")
    7346                      .dwattr $C$DW$733, DW_AT_TI_symbol_name("_trajHandle_Id")
    7347                      .dwattr $C$DW$733, DW_AT_data_member_location[DW_OP_plus_uconst 0x60]
    7348                      .dwattr $C$DW$733, DW_AT_accessibility(DW_ACCESS_public)
    7349              $C$DW$734       .dwtag  DW_TAG_member
    7350                      .dwattr $C$DW$734, DW_AT_type(*$C$DW$T$65)
    7351                      .dwattr $C$DW$734, DW_AT_name("traj_Id")
    7352                      .dwattr $C$DW$734, DW_AT_TI_symbol_name("_traj_Id")
    7353                      .dwattr $C$DW$734, DW_AT_data_member_location[DW_OP_plus_uconst 0x62]
    7354                      .dwattr $C$DW$734, DW_AT_accessibility(DW_ACCESS_public)
    7355              $C$DW$735       .dwtag  DW_TAG_member
    7356                      .dwattr $C$DW$735, DW_AT_type(*$C$DW$T$64)
    7357                      .dwattr $C$DW$735, DW_AT_name("trajHandle_spd")
    7358                      .dwattr $C$DW$735, DW_AT_TI_symbol_name("_trajHandle_spd")
    7359                      .dwattr $C$DW$735, DW_AT_data_member_location[DW_OP_plus_uconst 0x6c]
    7360                      .dwattr $C$DW$735, DW_AT_accessibility(DW_ACCESS_public)
    7361              $C$DW$736       .dwtag  DW_TAG_member
    7362                      .dwattr $C$DW$736, DW_AT_type(*$C$DW$T$65)
    7363                      .dwattr $C$DW$736, DW_AT_name("traj_spd")
    7364                      .dwattr $C$DW$736, DW_AT_TI_symbol_name("_traj_spd")
    7365                      .dwattr $C$DW$736, DW_AT_data_member_location[DW_OP_plus_uconst 0x6e]
    7366                      .dwattr $C$DW$736, DW_AT_accessibility(DW_ACCESS_public)
    7367              $C$DW$737       .dwtag  DW_TAG_member
    7368                      .dwattr $C$DW$737, DW_AT_type(*$C$DW$T$64)
    7369                      .dwattr $C$DW$737, DW_AT_name("trajHandle_spdMax")
    7370                      .dwattr $C$DW$737, DW_AT_TI_symbol_name("_trajHandle_spdMax")
    7371                      .dwattr $C$DW$737, DW_AT_data_member_location[DW_OP_plus_uconst 0x78]
    7372                      .dwattr $C$DW$737, DW_AT_accessibility(DW_ACCESS_public)
    7373              $C$DW$738       .dwtag  DW_TAG_member
    7374                      .dwattr $C$DW$738, DW_AT_type(*$C$DW$T$65)
    7375                      .dwattr $C$DW$738, DW_AT_name("traj_spdMax")
    7376                      .dwattr $C$DW$738, DW_AT_TI_symbol_name("_traj_spdMax")
    7377                      .dwattr $C$DW$738, DW_AT_data_member_location[DW_OP_plus_uconst 0x7a]
    7378                      .dwattr $C$DW$738, DW_AT_accessibility(DW_ACCESS_public)
    7379              $C$DW$739       .dwtag  DW_TAG_member
    7380                      .dwattr $C$DW$739, DW_AT_type(*$C$DW$T$66)
    7381                      .dwattr $C$DW$739, DW_AT_name("motorParams")
    7382                      .dwattr $C$DW$739, DW_AT_TI_symbol_name("_motorParams")
    7383                      .dwattr $C$DW$739, DW_AT_data_member_location[DW_OP_plus_uconst 0x84]
    7384                      .dwattr $C$DW$739, DW_AT_accessibility(DW_ACCESS_public)
    7385              $C$DW$740       .dwtag  DW_TAG_member
    7386                      .dwattr $C$DW$740, DW_AT_type(*$C$DW$T$69)
    7387                      .dwattr $C$DW$740, DW_AT_name("waitTimes")
    7388                      .dwattr $C$DW$740, DW_AT_TI_symbol_name("_waitTimes")
    7389                      .dwattr $C$DW$740, DW_AT_data_member_location[DW_OP_plus_uconst 0x92]
    7390                      .dwattr $C$DW$740, DW_AT_accessibility(DW_ACCESS_public)
    7391              $C$DW$741       .dwtag  DW_TAG_member
TMS320C2000 Assembler PC v6.2.5 Fri Oct 13 15:05:13 2017

Tools Copyright (c) 1996-2014 Texas Instruments Incorporated
C:\Users\wmj\AppData\Local\Temp\1391212                              PAGE  142

    7392                      .dwattr $C$DW$741, DW_AT_type(*$C$DW$T$68)
    7393                      .dwattr $C$DW$741, DW_AT_name("counter_state")
    7394                      .dwattr $C$DW$741, DW_AT_TI_symbol_name("_counter_state")
    7395                      .dwattr $C$DW$741, DW_AT_data_member_location[DW_OP_plus_uconst 0x9a]
    7396                      .dwattr $C$DW$741, DW_AT_accessibility(DW_ACCESS_public)
    7397              $C$DW$742       .dwtag  DW_TAG_member
    7398                      .dwattr $C$DW$742, DW_AT_type(*$C$DW$T$70)
    7399                      .dwattr $C$DW$742, DW_AT_name("numIsrTicksPerCtrlTick")
    7400                      .dwattr $C$DW$742, DW_AT_TI_symbol_name("_numIsrTicksPerCtrlTick")
    7401                      .dwattr $C$DW$742, DW_AT_data_member_location[DW_OP_plus_uconst 0x9c]
    7402                      .dwattr $C$DW$742, DW_AT_accessibility(DW_ACCESS_public)
    7403              $C$DW$743       .dwtag  DW_TAG_member
    7404                      .dwattr $C$DW$743, DW_AT_type(*$C$DW$T$70)
    7405                      .dwattr $C$DW$743, DW_AT_name("numCtrlTicksPerCurrentTick")
    7406                      .dwattr $C$DW$743, DW_AT_TI_symbol_name("_numCtrlTicksPerCurrentTick")
    7407                      .dwattr $C$DW$743, DW_AT_data_member_location[DW_OP_plus_uconst 0x9d]
    7408                      .dwattr $C$DW$743, DW_AT_accessibility(DW_ACCESS_public)
    7409              $C$DW$744       .dwtag  DW_TAG_member
    7410                      .dwattr $C$DW$744, DW_AT_type(*$C$DW$T$70)
    7411                      .dwattr $C$DW$744, DW_AT_name("numCtrlTicksPerSpeedTick")
    7412                      .dwattr $C$DW$744, DW_AT_TI_symbol_name("_numCtrlTicksPerSpeedTick")
    7413                      .dwattr $C$DW$744, DW_AT_data_member_location[DW_OP_plus_uconst 0x9e]
    7414                      .dwattr $C$DW$744, DW_AT_accessibility(DW_ACCESS_public)
    7415              $C$DW$745       .dwtag  DW_TAG_member
    7416                      .dwattr $C$DW$745, DW_AT_type(*$C$DW$T$70)
    7417                      .dwattr $C$DW$745, DW_AT_name("numCtrlTicksPerTrajTick")
    7418                      .dwattr $C$DW$745, DW_AT_TI_symbol_name("_numCtrlTicksPerTrajTick")
    7419                      .dwattr $C$DW$745, DW_AT_data_member_location[DW_OP_plus_uconst 0x9f]
    7420                      .dwattr $C$DW$745, DW_AT_accessibility(DW_ACCESS_public)
    7421              $C$DW$746       .dwtag  DW_TAG_member
    7422                      .dwattr $C$DW$746, DW_AT_type(*$C$DW$T$68)
    7423                      .dwattr $C$DW$746, DW_AT_name("ctrlFreq_Hz")
    7424                      .dwattr $C$DW$746, DW_AT_TI_symbol_name("_ctrlFreq_Hz")
    7425                      .dwattr $C$DW$746, DW_AT_data_member_location[DW_OP_plus_uconst 0xa0]
    7426                      .dwattr $C$DW$746, DW_AT_accessibility(DW_ACCESS_public)
    7427              $C$DW$747       .dwtag  DW_TAG_member
    7428                      .dwattr $C$DW$747, DW_AT_type(*$C$DW$T$68)
    7429                      .dwattr $C$DW$747, DW_AT_name("trajFreq_Hz")
    7430                      .dwattr $C$DW$747, DW_AT_TI_symbol_name("_trajFreq_Hz")
    7431                      .dwattr $C$DW$747, DW_AT_data_member_location[DW_OP_plus_uconst 0xa2]
    7432                      .dwattr $C$DW$747, DW_AT_accessibility(DW_ACCESS_public)
    7433              $C$DW$748       .dwtag  DW_TAG_member
    7434                      .dwattr $C$DW$748, DW_AT_type(*$C$DW$T$32)
    7435                      .dwattr $C$DW$748, DW_AT_name("trajPeriod_sec")
    7436                      .dwattr $C$DW$748, DW_AT_TI_symbol_name("_trajPeriod_sec")
    7437                      .dwattr $C$DW$748, DW_AT_data_member_location[DW_OP_plus_uconst 0xa4]
    7438                      .dwattr $C$DW$748, DW_AT_accessibility(DW_ACCESS_public)
    7439              $C$DW$749       .dwtag  DW_TAG_member
    7440                      .dwattr $C$DW$749, DW_AT_type(*$C$DW$T$71)
    7441                      .dwattr $C$DW$749, DW_AT_name("ctrlPeriod_sec")
    7442                      .dwattr $C$DW$749, DW_AT_TI_symbol_name("_ctrlPeriod_sec")
    7443                      .dwattr $C$DW$749, DW_AT_data_member_location[DW_OP_plus_uconst 0xa6]
    7444                      .dwattr $C$DW$749, DW_AT_accessibility(DW_ACCESS_public)
    7445              $C$DW$750       .dwtag  DW_TAG_member
    7446                      .dwattr $C$DW$750, DW_AT_type(*$C$DW$T$32)
TMS320C2000 Assembler PC v6.2.5 Fri Oct 13 15:05:13 2017

Tools Copyright (c) 1996-2014 Texas Instruments Incorporated
C:\Users\wmj\AppData\Local\Temp\1391212                              PAGE  143

    7447                      .dwattr $C$DW$750, DW_AT_name("maxVsMag_pu")
    7448                      .dwattr $C$DW$750, DW_AT_TI_symbol_name("_maxVsMag_pu")
    7449                      .dwattr $C$DW$750, DW_AT_data_member_location[DW_OP_plus_uconst 0xa8]
    7450                      .dwattr $C$DW$750, DW_AT_accessibility(DW_ACCESS_public)
    7451              $C$DW$751       .dwtag  DW_TAG_member
    7452                      .dwattr $C$DW$751, DW_AT_type(*$C$DW$T$33)
    7453                      .dwattr $C$DW$751, DW_AT_name("Iab_in")
    7454                      .dwattr $C$DW$751, DW_AT_TI_symbol_name("_Iab_in")
    7455                      .dwattr $C$DW$751, DW_AT_data_member_location[DW_OP_plus_uconst 0xaa]
    7456                      .dwattr $C$DW$751, DW_AT_accessibility(DW_ACCESS_public)
    7457              $C$DW$752       .dwtag  DW_TAG_member
    7458                      .dwattr $C$DW$752, DW_AT_type(*$C$DW$T$33)
    7459                      .dwattr $C$DW$752, DW_AT_name("Iab_filt")
    7460                      .dwattr $C$DW$752, DW_AT_TI_symbol_name("_Iab_filt")
    7461                      .dwattr $C$DW$752, DW_AT_data_member_location[DW_OP_plus_uconst 0xae]
    7462                      .dwattr $C$DW$752, DW_AT_accessibility(DW_ACCESS_public)
    7463              $C$DW$753       .dwtag  DW_TAG_member
    7464                      .dwattr $C$DW$753, DW_AT_type(*$C$DW$T$33)
    7465                      .dwattr $C$DW$753, DW_AT_name("Idq_in")
    7466                      .dwattr $C$DW$753, DW_AT_TI_symbol_name("_Idq_in")
    7467                      .dwattr $C$DW$753, DW_AT_data_member_location[DW_OP_plus_uconst 0xb2]
    7468                      .dwattr $C$DW$753, DW_AT_accessibility(DW_ACCESS_public)
    7469              $C$DW$754       .dwtag  DW_TAG_member
    7470                      .dwattr $C$DW$754, DW_AT_type(*$C$DW$T$33)
    7471                      .dwattr $C$DW$754, DW_AT_name("Vab_in")
    7472                      .dwattr $C$DW$754, DW_AT_TI_symbol_name("_Vab_in")
    7473                      .dwattr $C$DW$754, DW_AT_data_member_location[DW_OP_plus_uconst 0xb6]
    7474                      .dwattr $C$DW$754, DW_AT_accessibility(DW_ACCESS_public)
    7475              $C$DW$755       .dwtag  DW_TAG_member
    7476                      .dwattr $C$DW$755, DW_AT_type(*$C$DW$T$32)
    7477                      .dwattr $C$DW$755, DW_AT_name("spd_out")
    7478                      .dwattr $C$DW$755, DW_AT_TI_symbol_name("_spd_out")
    7479                      .dwattr $C$DW$755, DW_AT_data_member_location[DW_OP_plus_uconst 0xba]
    7480                      .dwattr $C$DW$755, DW_AT_accessibility(DW_ACCESS_public)
    7481              $C$DW$756       .dwtag  DW_TAG_member
    7482                      .dwattr $C$DW$756, DW_AT_type(*$C$DW$T$33)
    7483                      .dwattr $C$DW$756, DW_AT_name("Vab_out")
    7484                      .dwattr $C$DW$756, DW_AT_TI_symbol_name("_Vab_out")
    7485                      .dwattr $C$DW$756, DW_AT_data_member_location[DW_OP_plus_uconst 0xbc]
    7486                      .dwattr $C$DW$756, DW_AT_accessibility(DW_ACCESS_public)
    7487              $C$DW$757       .dwtag  DW_TAG_member
    7488                      .dwattr $C$DW$757, DW_AT_type(*$C$DW$T$33)
    7489                      .dwattr $C$DW$757, DW_AT_name("Vdq_out")
    7490                      .dwattr $C$DW$757, DW_AT_TI_symbol_name("_Vdq_out")
    7491                      .dwattr $C$DW$757, DW_AT_data_member_location[DW_OP_plus_uconst 0xc0]
    7492                      .dwattr $C$DW$757, DW_AT_accessibility(DW_ACCESS_public)
    7493              $C$DW$758       .dwtag  DW_TAG_member
    7494                      .dwattr $C$DW$758, DW_AT_type(*$C$DW$T$71)
    7495                      .dwattr $C$DW$758, DW_AT_name("Rhf")
    7496                      .dwattr $C$DW$758, DW_AT_TI_symbol_name("_Rhf")
    7497                      .dwattr $C$DW$758, DW_AT_data_member_location[DW_OP_plus_uconst 0xc4]
    7498                      .dwattr $C$DW$758, DW_AT_accessibility(DW_ACCESS_public)
    7499              $C$DW$759       .dwtag  DW_TAG_member
    7500                      .dwattr $C$DW$759, DW_AT_type(*$C$DW$T$71)
    7501                      .dwattr $C$DW$759, DW_AT_name("Lhf")
TMS320C2000 Assembler PC v6.2.5 Fri Oct 13 15:05:13 2017

Tools Copyright (c) 1996-2014 Texas Instruments Incorporated
C:\Users\wmj\AppData\Local\Temp\1391212                              PAGE  144

    7502                      .dwattr $C$DW$759, DW_AT_TI_symbol_name("_Lhf")
    7503                      .dwattr $C$DW$759, DW_AT_data_member_location[DW_OP_plus_uconst 0xc6]
    7504                      .dwattr $C$DW$759, DW_AT_accessibility(DW_ACCESS_public)
    7505              $C$DW$760       .dwtag  DW_TAG_member
    7506                      .dwattr $C$DW$760, DW_AT_type(*$C$DW$T$71)
    7507                      .dwattr $C$DW$760, DW_AT_name("RoverL")
    7508                      .dwattr $C$DW$760, DW_AT_TI_symbol_name("_RoverL")
    7509                      .dwattr $C$DW$760, DW_AT_data_member_location[DW_OP_plus_uconst 0xc8]
    7510                      .dwattr $C$DW$760, DW_AT_accessibility(DW_ACCESS_public)
    7511              $C$DW$761       .dwtag  DW_TAG_member
    7512                      .dwattr $C$DW$761, DW_AT_type(*$C$DW$T$32)
    7513                      .dwattr $C$DW$761, DW_AT_name("Kp_Id")
    7514                      .dwattr $C$DW$761, DW_AT_TI_symbol_name("_Kp_Id")
    7515                      .dwattr $C$DW$761, DW_AT_data_member_location[DW_OP_plus_uconst 0xca]
    7516                      .dwattr $C$DW$761, DW_AT_accessibility(DW_ACCESS_public)
    7517              $C$DW$762       .dwtag  DW_TAG_member
    7518                      .dwattr $C$DW$762, DW_AT_type(*$C$DW$T$32)
    7519                      .dwattr $C$DW$762, DW_AT_name("Kp_Iq")
    7520                      .dwattr $C$DW$762, DW_AT_TI_symbol_name("_Kp_Iq")
    7521                      .dwattr $C$DW$762, DW_AT_data_member_location[DW_OP_plus_uconst 0xcc]
    7522                      .dwattr $C$DW$762, DW_AT_accessibility(DW_ACCESS_public)
    7523              $C$DW$763       .dwtag  DW_TAG_member
    7524                      .dwattr $C$DW$763, DW_AT_type(*$C$DW$T$32)
    7525                      .dwattr $C$DW$763, DW_AT_name("Kp_spd")
    7526                      .dwattr $C$DW$763, DW_AT_TI_symbol_name("_Kp_spd")
    7527                      .dwattr $C$DW$763, DW_AT_data_member_location[DW_OP_plus_uconst 0xce]
    7528                      .dwattr $C$DW$763, DW_AT_accessibility(DW_ACCESS_public)
    7529              $C$DW$764       .dwtag  DW_TAG_member
    7530                      .dwattr $C$DW$764, DW_AT_type(*$C$DW$T$32)
    7531                      .dwattr $C$DW$764, DW_AT_name("Ki_Id")
    7532                      .dwattr $C$DW$764, DW_AT_TI_symbol_name("_Ki_Id")
    7533                      .dwattr $C$DW$764, DW_AT_data_member_location[DW_OP_plus_uconst 0xd0]
    7534                      .dwattr $C$DW$764, DW_AT_accessibility(DW_ACCESS_public)
    7535              $C$DW$765       .dwtag  DW_TAG_member
    7536                      .dwattr $C$DW$765, DW_AT_type(*$C$DW$T$32)
    7537                      .dwattr $C$DW$765, DW_AT_name("Ki_Iq")
    7538                      .dwattr $C$DW$765, DW_AT_TI_symbol_name("_Ki_Iq")
    7539                      .dwattr $C$DW$765, DW_AT_data_member_location[DW_OP_plus_uconst 0xd2]
    7540                      .dwattr $C$DW$765, DW_AT_accessibility(DW_ACCESS_public)
    7541              $C$DW$766       .dwtag  DW_TAG_member
    7542                      .dwattr $C$DW$766, DW_AT_type(*$C$DW$T$32)
    7543                      .dwattr $C$DW$766, DW_AT_name("Ki_spd")
    7544                      .dwattr $C$DW$766, DW_AT_TI_symbol_name("_Ki_spd")
    7545                      .dwattr $C$DW$766, DW_AT_data_member_location[DW_OP_plus_uconst 0xd4]
    7546                      .dwattr $C$DW$766, DW_AT_accessibility(DW_ACCESS_public)
    7547              $C$DW$767       .dwtag  DW_TAG_member
    7548                      .dwattr $C$DW$767, DW_AT_type(*$C$DW$T$32)
    7549                      .dwattr $C$DW$767, DW_AT_name("Kd_Id")
    7550                      .dwattr $C$DW$767, DW_AT_TI_symbol_name("_Kd_Id")
    7551                      .dwattr $C$DW$767, DW_AT_data_member_location[DW_OP_plus_uconst 0xd6]
    7552                      .dwattr $C$DW$767, DW_AT_accessibility(DW_ACCESS_public)
    7553              $C$DW$768       .dwtag  DW_TAG_member
    7554                      .dwattr $C$DW$768, DW_AT_type(*$C$DW$T$32)
    7555                      .dwattr $C$DW$768, DW_AT_name("Kd_Iq")
    7556                      .dwattr $C$DW$768, DW_AT_TI_symbol_name("_Kd_Iq")
TMS320C2000 Assembler PC v6.2.5 Fri Oct 13 15:05:13 2017

Tools Copyright (c) 1996-2014 Texas Instruments Incorporated
C:\Users\wmj\AppData\Local\Temp\1391212                              PAGE  145

    7557                      .dwattr $C$DW$768, DW_AT_data_member_location[DW_OP_plus_uconst 0xd8]
    7558                      .dwattr $C$DW$768, DW_AT_accessibility(DW_ACCESS_public)
    7559              $C$DW$769       .dwtag  DW_TAG_member
    7560                      .dwattr $C$DW$769, DW_AT_type(*$C$DW$T$32)
    7561                      .dwattr $C$DW$769, DW_AT_name("Kd_spd")
    7562                      .dwattr $C$DW$769, DW_AT_TI_symbol_name("_Kd_spd")
    7563                      .dwattr $C$DW$769, DW_AT_data_member_location[DW_OP_plus_uconst 0xda]
    7564                      .dwattr $C$DW$769, DW_AT_accessibility(DW_ACCESS_public)
    7565              $C$DW$770       .dwtag  DW_TAG_member
    7566                      .dwattr $C$DW$770, DW_AT_type(*$C$DW$T$32)
    7567                      .dwattr $C$DW$770, DW_AT_name("Ui_Id")
    7568                      .dwattr $C$DW$770, DW_AT_TI_symbol_name("_Ui_Id")
    7569                      .dwattr $C$DW$770, DW_AT_data_member_location[DW_OP_plus_uconst 0xdc]
    7570                      .dwattr $C$DW$770, DW_AT_accessibility(DW_ACCESS_public)
    7571              $C$DW$771       .dwtag  DW_TAG_member
    7572                      .dwattr $C$DW$771, DW_AT_type(*$C$DW$T$32)
    7573                      .dwattr $C$DW$771, DW_AT_name("Ui_Iq")
    7574                      .dwattr $C$DW$771, DW_AT_TI_symbol_name("_Ui_Iq")
    7575                      .dwattr $C$DW$771, DW_AT_data_member_location[DW_OP_plus_uconst 0xde]
    7576                      .dwattr $C$DW$771, DW_AT_accessibility(DW_ACCESS_public)
    7577              $C$DW$772       .dwtag  DW_TAG_member
    7578                      .dwattr $C$DW$772, DW_AT_type(*$C$DW$T$32)
    7579                      .dwattr $C$DW$772, DW_AT_name("Ui_spd")
    7580                      .dwattr $C$DW$772, DW_AT_TI_symbol_name("_Ui_spd")
    7581                      .dwattr $C$DW$772, DW_AT_data_member_location[DW_OP_plus_uconst 0xe0]
    7582                      .dwattr $C$DW$772, DW_AT_accessibility(DW_ACCESS_public)
    7583              $C$DW$773       .dwtag  DW_TAG_member
    7584                      .dwattr $C$DW$773, DW_AT_type(*$C$DW$T$33)
    7585                      .dwattr $C$DW$773, DW_AT_name("Idq_ref")
    7586                      .dwattr $C$DW$773, DW_AT_TI_symbol_name("_Idq_ref")
    7587                      .dwattr $C$DW$773, DW_AT_data_member_location[DW_OP_plus_uconst 0xe2]
    7588                      .dwattr $C$DW$773, DW_AT_accessibility(DW_ACCESS_public)
    7589              $C$DW$774       .dwtag  DW_TAG_member
    7590                      .dwattr $C$DW$774, DW_AT_type(*$C$DW$T$32)
    7591                      .dwattr $C$DW$774, DW_AT_name("IdRated")
    7592                      .dwattr $C$DW$774, DW_AT_TI_symbol_name("_IdRated")
    7593                      .dwattr $C$DW$774, DW_AT_data_member_location[DW_OP_plus_uconst 0xe6]
    7594                      .dwattr $C$DW$774, DW_AT_accessibility(DW_ACCESS_public)
    7595              $C$DW$775       .dwtag  DW_TAG_member
    7596                      .dwattr $C$DW$775, DW_AT_type(*$C$DW$T$32)
    7597                      .dwattr $C$DW$775, DW_AT_name("spd_ref")
    7598                      .dwattr $C$DW$775, DW_AT_TI_symbol_name("_spd_ref")
    7599                      .dwattr $C$DW$775, DW_AT_data_member_location[DW_OP_plus_uconst 0xe8]
    7600                      .dwattr $C$DW$775, DW_AT_accessibility(DW_ACCESS_public)
    7601              $C$DW$776       .dwtag  DW_TAG_member
    7602                      .dwattr $C$DW$776, DW_AT_type(*$C$DW$T$32)
    7603                      .dwattr $C$DW$776, DW_AT_name("spd_max")
    7604                      .dwattr $C$DW$776, DW_AT_TI_symbol_name("_spd_max")
    7605                      .dwattr $C$DW$776, DW_AT_data_member_location[DW_OP_plus_uconst 0xea]
    7606                      .dwattr $C$DW$776, DW_AT_accessibility(DW_ACCESS_public)
    7607              $C$DW$777       .dwtag  DW_TAG_member
    7608                      .dwattr $C$DW$777, DW_AT_type(*$C$DW$T$70)
    7609                      .dwattr $C$DW$777, DW_AT_name("counter_current")
    7610                      .dwattr $C$DW$777, DW_AT_TI_symbol_name("_counter_current")
    7611                      .dwattr $C$DW$777, DW_AT_data_member_location[DW_OP_plus_uconst 0xec]
TMS320C2000 Assembler PC v6.2.5 Fri Oct 13 15:05:13 2017

Tools Copyright (c) 1996-2014 Texas Instruments Incorporated
C:\Users\wmj\AppData\Local\Temp\1391212                              PAGE  146

    7612                      .dwattr $C$DW$777, DW_AT_accessibility(DW_ACCESS_public)
    7613              $C$DW$778       .dwtag  DW_TAG_member
    7614                      .dwattr $C$DW$778, DW_AT_type(*$C$DW$T$70)
    7615                      .dwattr $C$DW$778, DW_AT_name("counter_isr")
    7616                      .dwattr $C$DW$778, DW_AT_TI_symbol_name("_counter_isr")
    7617                      .dwattr $C$DW$778, DW_AT_data_member_location[DW_OP_plus_uconst 0xed]
    7618                      .dwattr $C$DW$778, DW_AT_accessibility(DW_ACCESS_public)
    7619              $C$DW$779       .dwtag  DW_TAG_member
    7620                      .dwattr $C$DW$779, DW_AT_type(*$C$DW$T$70)
    7621                      .dwattr $C$DW$779, DW_AT_name("counter_speed")
    7622                      .dwattr $C$DW$779, DW_AT_TI_symbol_name("_counter_speed")
    7623                      .dwattr $C$DW$779, DW_AT_data_member_location[DW_OP_plus_uconst 0xee]
    7624                      .dwattr $C$DW$779, DW_AT_accessibility(DW_ACCESS_public)
    7625              $C$DW$780       .dwtag  DW_TAG_member
    7626                      .dwattr $C$DW$780, DW_AT_type(*$C$DW$T$70)
    7627                      .dwattr $C$DW$780, DW_AT_name("counter_traj")
    7628                      .dwattr $C$DW$780, DW_AT_TI_symbol_name("_counter_traj")
    7629                      .dwattr $C$DW$780, DW_AT_data_member_location[DW_OP_plus_uconst 0xef]
    7630                      .dwattr $C$DW$780, DW_AT_accessibility(DW_ACCESS_public)
    7631              $C$DW$781       .dwtag  DW_TAG_member
    7632                      .dwattr $C$DW$781, DW_AT_type(*$C$DW$T$34)
    7633                      .dwattr $C$DW$781, DW_AT_name("flag_enableCtrl")
    7634                      .dwattr $C$DW$781, DW_AT_TI_symbol_name("_flag_enableCtrl")
    7635                      .dwattr $C$DW$781, DW_AT_data_member_location[DW_OP_plus_uconst 0xf0]
    7636                      .dwattr $C$DW$781, DW_AT_accessibility(DW_ACCESS_public)
    7637              $C$DW$782       .dwtag  DW_TAG_member
    7638                      .dwattr $C$DW$782, DW_AT_type(*$C$DW$T$34)
    7639                      .dwattr $C$DW$782, DW_AT_name("flag_enableDcBusComp")
    7640                      .dwattr $C$DW$782, DW_AT_TI_symbol_name("_flag_enableDcBusComp")
    7641                      .dwattr $C$DW$782, DW_AT_data_member_location[DW_OP_plus_uconst 0xf1]
    7642                      .dwattr $C$DW$782, DW_AT_accessibility(DW_ACCESS_public)
    7643              $C$DW$783       .dwtag  DW_TAG_member
    7644                      .dwattr $C$DW$783, DW_AT_type(*$C$DW$T$34)
    7645                      .dwattr $C$DW$783, DW_AT_name("flag_enablePowerWarp")
    7646                      .dwattr $C$DW$783, DW_AT_TI_symbol_name("_flag_enablePowerWarp")
    7647                      .dwattr $C$DW$783, DW_AT_data_member_location[DW_OP_plus_uconst 0xf2]
    7648                      .dwattr $C$DW$783, DW_AT_accessibility(DW_ACCESS_public)
    7649              $C$DW$784       .dwtag  DW_TAG_member
    7650                      .dwattr $C$DW$784, DW_AT_type(*$C$DW$T$34)
    7651                      .dwattr $C$DW$784, DW_AT_name("flag_enableOffset")
    7652                      .dwattr $C$DW$784, DW_AT_TI_symbol_name("_flag_enableOffset")
    7653                      .dwattr $C$DW$784, DW_AT_data_member_location[DW_OP_plus_uconst 0xf3]
    7654                      .dwattr $C$DW$784, DW_AT_accessibility(DW_ACCESS_public)
    7655              $C$DW$785       .dwtag  DW_TAG_member
    7656                      .dwattr $C$DW$785, DW_AT_type(*$C$DW$T$34)
    7657                      .dwattr $C$DW$785, DW_AT_name("flag_enableSpeedCtrl")
    7658                      .dwattr $C$DW$785, DW_AT_TI_symbol_name("_flag_enableSpeedCtrl")
    7659                      .dwattr $C$DW$785, DW_AT_data_member_location[DW_OP_plus_uconst 0xf4]
    7660                      .dwattr $C$DW$785, DW_AT_accessibility(DW_ACCESS_public)
    7661              $C$DW$786       .dwtag  DW_TAG_member
    7662                      .dwattr $C$DW$786, DW_AT_type(*$C$DW$T$34)
    7663                      .dwattr $C$DW$786, DW_AT_name("flag_enableUserMotorParams")
    7664                      .dwattr $C$DW$786, DW_AT_TI_symbol_name("_flag_enableUserMotorParams")
    7665                      .dwattr $C$DW$786, DW_AT_data_member_location[DW_OP_plus_uconst 0xf5]
    7666                      .dwattr $C$DW$786, DW_AT_accessibility(DW_ACCESS_public)
TMS320C2000 Assembler PC v6.2.5 Fri Oct 13 15:05:13 2017

Tools Copyright (c) 1996-2014 Texas Instruments Incorporated
C:\Users\wmj\AppData\Local\Temp\1391212                              PAGE  147

    7667              $C$DW$787       .dwtag  DW_TAG_member
    7668                      .dwattr $C$DW$787, DW_AT_type(*$C$DW$T$33)
    7669                      .dwattr $C$DW$787, DW_AT_name("Idq_offset_pu")
    7670                      .dwattr $C$DW$787, DW_AT_TI_symbol_name("_Idq_offset_pu")
    7671                      .dwattr $C$DW$787, DW_AT_data_member_location[DW_OP_plus_uconst 0xf6]
    7672                      .dwattr $C$DW$787, DW_AT_accessibility(DW_ACCESS_public)
    7673              $C$DW$788       .dwtag  DW_TAG_member
    7674                      .dwattr $C$DW$788, DW_AT_type(*$C$DW$T$33)
    7675                      .dwattr $C$DW$788, DW_AT_name("Vdq_offset_pu")
    7676                      .dwattr $C$DW$788, DW_AT_TI_symbol_name("_Vdq_offset_pu")
    7677                      .dwattr $C$DW$788, DW_AT_data_member_location[DW_OP_plus_uconst 0xfa]
    7678                      .dwattr $C$DW$788, DW_AT_accessibility(DW_ACCESS_public)
    7679              $C$DW$789       .dwtag  DW_TAG_member
    7680                      .dwattr $C$DW$789, DW_AT_type(*$C$DW$T$32)
    7681                      .dwattr $C$DW$789, DW_AT_name("angle_pu")
    7682                      .dwattr $C$DW$789, DW_AT_TI_symbol_name("_angle_pu")
    7683                      .dwattr $C$DW$789, DW_AT_data_member_location[DW_OP_plus_uconst 0xfe]
    7684                      .dwattr $C$DW$789, DW_AT_accessibility(DW_ACCESS_public)
    7685              $C$DW$790       .dwtag  DW_TAG_member
    7686                      .dwattr $C$DW$790, DW_AT_type(*$C$DW$T$32)
    7687                      .dwattr $C$DW$790, DW_AT_name("speed_ref_pu")
    7688                      .dwattr $C$DW$790, DW_AT_TI_symbol_name("_speed_ref_pu")
    7689                      .dwattr $C$DW$790, DW_AT_data_member_location[DW_OP_plus_uconst 0x100]
    7690                      .dwattr $C$DW$790, DW_AT_accessibility(DW_ACCESS_public)
    7691              $C$DW$791       .dwtag  DW_TAG_member
    7692                      .dwattr $C$DW$791, DW_AT_type(*$C$DW$T$32)
    7693                      .dwattr $C$DW$791, DW_AT_name("speed_fb_pu")
    7694                      .dwattr $C$DW$791, DW_AT_TI_symbol_name("_speed_fb_pu")
    7695                      .dwattr $C$DW$791, DW_AT_data_member_location[DW_OP_plus_uconst 0x102]
    7696                      .dwattr $C$DW$791, DW_AT_accessibility(DW_ACCESS_public)
    7697              $C$DW$792       .dwtag  DW_TAG_member
    7698                      .dwattr $C$DW$792, DW_AT_type(*$C$DW$T$32)
    7699                      .dwattr $C$DW$792, DW_AT_name("speed_outMax_pu")
    7700                      .dwattr $C$DW$792, DW_AT_TI_symbol_name("_speed_outMax_pu")
    7701                      .dwattr $C$DW$792, DW_AT_data_member_location[DW_OP_plus_uconst 0x104]
    7702                      .dwattr $C$DW$792, DW_AT_accessibility(DW_ACCESS_public)
    7703              $C$DW$793       .dwtag  DW_TAG_member
    7704                      .dwattr $C$DW$793, DW_AT_type(*$C$DW$T$34)
    7705                      .dwattr $C$DW$793, DW_AT_name("flag_enableCurrentCtrl")
    7706                      .dwattr $C$DW$793, DW_AT_TI_symbol_name("_flag_enableCurrentCtrl")
    7707                      .dwattr $C$DW$793, DW_AT_data_member_location[DW_OP_plus_uconst 0x106]
    7708                      .dwattr $C$DW$793, DW_AT_accessibility(DW_ACCESS_public)
    7709              $C$DW$794       .dwtag  DW_TAG_member
    7710                      .dwattr $C$DW$794, DW_AT_type(*$C$DW$T$73)
    7711                      .dwattr $C$DW$794, DW_AT_name("brakeHandle")
    7712                      .dwattr $C$DW$794, DW_AT_TI_symbol_name("_brakeHandle")
    7713                      .dwattr $C$DW$794, DW_AT_data_member_location[DW_OP_plus_uconst 0x108]
    7714                      .dwattr $C$DW$794, DW_AT_accessibility(DW_ACCESS_public)
    7715              $C$DW$795       .dwtag  DW_TAG_member
    7716                      .dwattr $C$DW$795, DW_AT_type(*$C$DW$T$74)
    7717                      .dwattr $C$DW$795, DW_AT_name("brake")
    7718                      .dwattr $C$DW$795, DW_AT_TI_symbol_name("_brake")
    7719                      .dwattr $C$DW$795, DW_AT_data_member_location[DW_OP_plus_uconst 0x10a]
    7720                      .dwattr $C$DW$795, DW_AT_accessibility(DW_ACCESS_public)
    7721                      .dwendtag $C$DW$T$75
TMS320C2000 Assembler PC v6.2.5 Fri Oct 13 15:05:13 2017

Tools Copyright (c) 1996-2014 Texas Instruments Incorporated
C:\Users\wmj\AppData\Local\Temp\1391212                              PAGE  148

    7722              
    7723              $C$DW$T$197     .dwtag  DW_TAG_typedef, DW_AT_name("CTRL_Obj")
    7724                      .dwattr $C$DW$T$197, DW_AT_type(*$C$DW$T$75)
    7725                      .dwattr $C$DW$T$197, DW_AT_language(DW_LANG_C)
    7726              $C$DW$T$178     .dwtag  DW_TAG_pointer_type
    7727                      .dwattr $C$DW$T$178, DW_AT_type(*$C$DW$T$75)
    7728                      .dwattr $C$DW$T$178, DW_AT_address_class(0x16)
    7729              $C$DW$T$179     .dwtag  DW_TAG_typedef, DW_AT_name("CTRL_Handle")
    7730                      .dwattr $C$DW$T$179, DW_AT_type(*$C$DW$T$178)
    7731                      .dwattr $C$DW$T$179, DW_AT_language(DW_LANG_C)
    7732              $C$DW$796       .dwtag  DW_TAG_TI_far_type
    7733                      .dwattr $C$DW$796, DW_AT_type(*$C$DW$T$179)
    7734              $C$DW$T$198     .dwtag  DW_TAG_const_type
    7735                      .dwattr $C$DW$T$198, DW_AT_type(*$C$DW$796)
    7736              
    7737              $C$DW$T$78      .dwtag  DW_TAG_structure_type
    7738                      .dwattr $C$DW$T$78, DW_AT_name("_CTRL_Version_")
    7739                      .dwattr $C$DW$T$78, DW_AT_byte_size(0x04)
    7740              $C$DW$797       .dwtag  DW_TAG_member
    7741                      .dwattr $C$DW$797, DW_AT_type(*$C$DW$T$23)
    7742                      .dwattr $C$DW$797, DW_AT_name("rsvd")
    7743                      .dwattr $C$DW$797, DW_AT_TI_symbol_name("_rsvd")
    7744                      .dwattr $C$DW$797, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    7745                      .dwattr $C$DW$797, DW_AT_accessibility(DW_ACCESS_public)
    7746              $C$DW$798       .dwtag  DW_TAG_member
    7747                      .dwattr $C$DW$798, DW_AT_type(*$C$DW$T$77)
    7748                      .dwattr $C$DW$798, DW_AT_name("targetProc")
    7749                      .dwattr $C$DW$798, DW_AT_TI_symbol_name("_targetProc")
    7750                      .dwattr $C$DW$798, DW_AT_data_member_location[DW_OP_plus_uconst 0x1]
    7751                      .dwattr $C$DW$798, DW_AT_accessibility(DW_ACCESS_public)
    7752              $C$DW$799       .dwtag  DW_TAG_member
    7753                      .dwattr $C$DW$799, DW_AT_type(*$C$DW$T$23)
    7754                      .dwattr $C$DW$799, DW_AT_name("major")
    7755                      .dwattr $C$DW$799, DW_AT_TI_symbol_name("_major")
    7756                      .dwattr $C$DW$799, DW_AT_data_member_location[DW_OP_plus_uconst 0x2]
    7757                      .dwattr $C$DW$799, DW_AT_accessibility(DW_ACCESS_public)
    7758              $C$DW$800       .dwtag  DW_TAG_member
    7759                      .dwattr $C$DW$800, DW_AT_type(*$C$DW$T$23)
    7760                      .dwattr $C$DW$800, DW_AT_name("minor")
    7761                      .dwattr $C$DW$800, DW_AT_TI_symbol_name("_minor")
    7762                      .dwattr $C$DW$800, DW_AT_data_member_location[DW_OP_plus_uconst 0x3]
    7763                      .dwattr $C$DW$800, DW_AT_accessibility(DW_ACCESS_public)
    7764                      .dwendtag $C$DW$T$78
    7765              
    7766              $C$DW$T$41      .dwtag  DW_TAG_typedef, DW_AT_name("CTRL_Version")
    7767                      .dwattr $C$DW$T$41, DW_AT_type(*$C$DW$T$78)
    7768                      .dwattr $C$DW$T$41, DW_AT_language(DW_LANG_C)
    7769              
    7770              $C$DW$T$20      .dwtag  DW_TAG_structure_type
    7771                      .dwattr $C$DW$T$20, DW_AT_name("_EST_Obj_")
    7772                      .dwattr $C$DW$T$20, DW_AT_declaration
    7773                      .dwendtag $C$DW$T$20
    7774              
    7775              $C$DW$T$49      .dwtag  DW_TAG_pointer_type
    7776                      .dwattr $C$DW$T$49, DW_AT_type(*$C$DW$T$20)
TMS320C2000 Assembler PC v6.2.5 Fri Oct 13 15:05:13 2017

Tools Copyright (c) 1996-2014 Texas Instruments Incorporated
C:\Users\wmj\AppData\Local\Temp\1391212                              PAGE  149

    7777                      .dwattr $C$DW$T$49, DW_AT_address_class(0x16)
    7778              $C$DW$T$50      .dwtag  DW_TAG_typedef, DW_AT_name("EST_Handle")
    7779                      .dwattr $C$DW$T$50, DW_AT_type(*$C$DW$T$49)
    7780                      .dwattr $C$DW$T$50, DW_AT_language(DW_LANG_C)
    7781              
    7782              $C$DW$T$79      .dwtag  DW_TAG_structure_type
    7783                      .dwattr $C$DW$T$79, DW_AT_name("_FILTER_FO_")
    7784                      .dwattr $C$DW$T$79, DW_AT_byte_size(0x0a)
    7785              $C$DW$801       .dwtag  DW_TAG_member
    7786                      .dwattr $C$DW$801, DW_AT_type(*$C$DW$T$32)
    7787                      .dwattr $C$DW$801, DW_AT_name("a1")
    7788                      .dwattr $C$DW$801, DW_AT_TI_symbol_name("_a1")
    7789                      .dwattr $C$DW$801, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    7790                      .dwattr $C$DW$801, DW_AT_accessibility(DW_ACCESS_public)
    7791              $C$DW$802       .dwtag  DW_TAG_member
    7792                      .dwattr $C$DW$802, DW_AT_type(*$C$DW$T$32)
    7793                      .dwattr $C$DW$802, DW_AT_name("b0")
    7794                      .dwattr $C$DW$802, DW_AT_TI_symbol_name("_b0")
    7795                      .dwattr $C$DW$802, DW_AT_data_member_location[DW_OP_plus_uconst 0x2]
    7796                      .dwattr $C$DW$802, DW_AT_accessibility(DW_ACCESS_public)
    7797              $C$DW$803       .dwtag  DW_TAG_member
    7798                      .dwattr $C$DW$803, DW_AT_type(*$C$DW$T$32)
    7799                      .dwattr $C$DW$803, DW_AT_name("b1")
    7800                      .dwattr $C$DW$803, DW_AT_TI_symbol_name("_b1")
    7801                      .dwattr $C$DW$803, DW_AT_data_member_location[DW_OP_plus_uconst 0x4]
    7802                      .dwattr $C$DW$803, DW_AT_accessibility(DW_ACCESS_public)
    7803              $C$DW$804       .dwtag  DW_TAG_member
    7804                      .dwattr $C$DW$804, DW_AT_type(*$C$DW$T$32)
    7805                      .dwattr $C$DW$804, DW_AT_name("x1")
    7806                      .dwattr $C$DW$804, DW_AT_TI_symbol_name("_x1")
    7807                      .dwattr $C$DW$804, DW_AT_data_member_location[DW_OP_plus_uconst 0x6]
    7808                      .dwattr $C$DW$804, DW_AT_accessibility(DW_ACCESS_public)
    7809              $C$DW$805       .dwtag  DW_TAG_member
    7810                      .dwattr $C$DW$805, DW_AT_type(*$C$DW$T$32)
    7811                      .dwattr $C$DW$805, DW_AT_name("y1")
    7812                      .dwattr $C$DW$805, DW_AT_TI_symbol_name("_y1")
    7813                      .dwattr $C$DW$805, DW_AT_data_member_location[DW_OP_plus_uconst 0x8]
    7814                      .dwattr $C$DW$805, DW_AT_accessibility(DW_ACCESS_public)
    7815                      .dwendtag $C$DW$T$79
    7816              
    7817              $C$DW$T$140     .dwtag  DW_TAG_typedef, DW_AT_name("FILTER_FO_Obj")
    7818                      .dwattr $C$DW$T$140, DW_AT_type(*$C$DW$T$79)
    7819                      .dwattr $C$DW$T$140, DW_AT_language(DW_LANG_C)
    7820              $C$DW$T$200     .dwtag  DW_TAG_pointer_type
    7821                      .dwattr $C$DW$T$200, DW_AT_type(*$C$DW$T$140)
    7822                      .dwattr $C$DW$T$200, DW_AT_address_class(0x16)
    7823              
    7824              $C$DW$T$21      .dwtag  DW_TAG_structure_type
    7825                      .dwattr $C$DW$T$21, DW_AT_name("_FILTER_FO_Obj_")
    7826                      .dwattr $C$DW$T$21, DW_AT_declaration
    7827                      .dwendtag $C$DW$T$21
    7828              
    7829              $C$DW$T$141     .dwtag  DW_TAG_pointer_type
    7830                      .dwattr $C$DW$T$141, DW_AT_type(*$C$DW$T$21)
    7831                      .dwattr $C$DW$T$141, DW_AT_address_class(0x16)
TMS320C2000 Assembler PC v6.2.5 Fri Oct 13 15:05:13 2017

Tools Copyright (c) 1996-2014 Texas Instruments Incorporated
C:\Users\wmj\AppData\Local\Temp\1391212                              PAGE  150

    7832              $C$DW$T$142     .dwtag  DW_TAG_typedef, DW_AT_name("FILTER_FO_Handle")
    7833                      .dwattr $C$DW$T$142, DW_AT_type(*$C$DW$T$141)
    7834                      .dwattr $C$DW$T$142, DW_AT_language(DW_LANG_C)
    7835              
    7836              $C$DW$T$80      .dwtag  DW_TAG_structure_type
    7837                      .dwattr $C$DW$T$80, DW_AT_name("_FLASH_Obj_")
    7838                      .dwattr $C$DW$T$80, DW_AT_byte_size(0x08)
    7839              $C$DW$806       .dwtag  DW_TAG_member
    7840                      .dwattr $C$DW$806, DW_AT_type(*$C$DW$T$24)
    7841                      .dwattr $C$DW$806, DW_AT_name("FOPT")
    7842                      .dwattr $C$DW$806, DW_AT_TI_symbol_name("_FOPT")
    7843                      .dwattr $C$DW$806, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    7844                      .dwattr $C$DW$806, DW_AT_accessibility(DW_ACCESS_public)
    7845              $C$DW$807       .dwtag  DW_TAG_member
    7846                      .dwattr $C$DW$807, DW_AT_type(*$C$DW$T$24)
    7847                      .dwattr $C$DW$807, DW_AT_name("rsvd_1")
    7848                      .dwattr $C$DW$807, DW_AT_TI_symbol_name("_rsvd_1")
    7849                      .dwattr $C$DW$807, DW_AT_data_member_location[DW_OP_plus_uconst 0x1]
    7850                      .dwattr $C$DW$807, DW_AT_accessibility(DW_ACCESS_public)
    7851              $C$DW$808       .dwtag  DW_TAG_member
    7852                      .dwattr $C$DW$808, DW_AT_type(*$C$DW$T$24)
    7853                      .dwattr $C$DW$808, DW_AT_name("FPWR")
    7854                      .dwattr $C$DW$808, DW_AT_TI_symbol_name("_FPWR")
    7855                      .dwattr $C$DW$808, DW_AT_data_member_location[DW_OP_plus_uconst 0x2]
    7856                      .dwattr $C$DW$808, DW_AT_accessibility(DW_ACCESS_public)
    7857              $C$DW$809       .dwtag  DW_TAG_member
    7858                      .dwattr $C$DW$809, DW_AT_type(*$C$DW$T$24)
    7859                      .dwattr $C$DW$809, DW_AT_name("FSTATUS")
    7860                      .dwattr $C$DW$809, DW_AT_TI_symbol_name("_FSTATUS")
    7861                      .dwattr $C$DW$809, DW_AT_data_member_location[DW_OP_plus_uconst 0x3]
    7862                      .dwattr $C$DW$809, DW_AT_accessibility(DW_ACCESS_public)
    7863              $C$DW$810       .dwtag  DW_TAG_member
    7864                      .dwattr $C$DW$810, DW_AT_type(*$C$DW$T$24)
    7865                      .dwattr $C$DW$810, DW_AT_name("FSTDBYWAIT")
    7866                      .dwattr $C$DW$810, DW_AT_TI_symbol_name("_FSTDBYWAIT")
    7867                      .dwattr $C$DW$810, DW_AT_data_member_location[DW_OP_plus_uconst 0x4]
    7868                      .dwattr $C$DW$810, DW_AT_accessibility(DW_ACCESS_public)
    7869              $C$DW$811       .dwtag  DW_TAG_member
    7870                      .dwattr $C$DW$811, DW_AT_type(*$C$DW$T$24)
    7871                      .dwattr $C$DW$811, DW_AT_name("FACTIVEWAIT")
    7872                      .dwattr $C$DW$811, DW_AT_TI_symbol_name("_FACTIVEWAIT")
    7873                      .dwattr $C$DW$811, DW_AT_data_member_location[DW_OP_plus_uconst 0x5]
    7874                      .dwattr $C$DW$811, DW_AT_accessibility(DW_ACCESS_public)
    7875              $C$DW$812       .dwtag  DW_TAG_member
    7876                      .dwattr $C$DW$812, DW_AT_type(*$C$DW$T$24)
    7877                      .dwattr $C$DW$812, DW_AT_name("FBANKWAIT")
    7878                      .dwattr $C$DW$812, DW_AT_TI_symbol_name("_FBANKWAIT")
    7879                      .dwattr $C$DW$812, DW_AT_data_member_location[DW_OP_plus_uconst 0x6]
    7880                      .dwattr $C$DW$812, DW_AT_accessibility(DW_ACCESS_public)
    7881              $C$DW$813       .dwtag  DW_TAG_member
    7882                      .dwattr $C$DW$813, DW_AT_type(*$C$DW$T$24)
    7883                      .dwattr $C$DW$813, DW_AT_name("FOTPWAIT")
    7884                      .dwattr $C$DW$813, DW_AT_TI_symbol_name("_FOTPWAIT")
    7885                      .dwattr $C$DW$813, DW_AT_data_member_location[DW_OP_plus_uconst 0x7]
    7886                      .dwattr $C$DW$813, DW_AT_accessibility(DW_ACCESS_public)
TMS320C2000 Assembler PC v6.2.5 Fri Oct 13 15:05:13 2017

Tools Copyright (c) 1996-2014 Texas Instruments Incorporated
C:\Users\wmj\AppData\Local\Temp\1391212                              PAGE  151

    7887                      .dwendtag $C$DW$T$80
    7888              
    7889              $C$DW$T$93      .dwtag  DW_TAG_pointer_type
    7890                      .dwattr $C$DW$T$93, DW_AT_type(*$C$DW$T$80)
    7891                      .dwattr $C$DW$T$93, DW_AT_address_class(0x16)
    7892              $C$DW$T$94      .dwtag  DW_TAG_typedef, DW_AT_name("FLASH_Handle")
    7893                      .dwattr $C$DW$T$94, DW_AT_type(*$C$DW$T$93)
    7894                      .dwattr $C$DW$T$94, DW_AT_language(DW_LANG_C)
    7895              
    7896              $C$DW$T$84      .dwtag  DW_TAG_structure_type
    7897                      .dwattr $C$DW$T$84, DW_AT_name("_GPIO_Obj_")
    7898                      .dwattr $C$DW$T$84, DW_AT_byte_size(0x6a)
    7899              $C$DW$814       .dwtag  DW_TAG_member
    7900                      .dwattr $C$DW$814, DW_AT_type(*$C$DW$T$81)
    7901                      .dwattr $C$DW$814, DW_AT_name("GPACTRL")
    7902                      .dwattr $C$DW$814, DW_AT_TI_symbol_name("_GPACTRL")
    7903                      .dwattr $C$DW$814, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    7904                      .dwattr $C$DW$814, DW_AT_accessibility(DW_ACCESS_public)
    7905              $C$DW$815       .dwtag  DW_TAG_member
    7906                      .dwattr $C$DW$815, DW_AT_type(*$C$DW$T$81)
    7907                      .dwattr $C$DW$815, DW_AT_name("GPAQSEL1")
    7908                      .dwattr $C$DW$815, DW_AT_TI_symbol_name("_GPAQSEL1")
    7909                      .dwattr $C$DW$815, DW_AT_data_member_location[DW_OP_plus_uconst 0x2]
    7910                      .dwattr $C$DW$815, DW_AT_accessibility(DW_ACCESS_public)
    7911              $C$DW$816       .dwtag  DW_TAG_member
    7912                      .dwattr $C$DW$816, DW_AT_type(*$C$DW$T$81)
    7913                      .dwattr $C$DW$816, DW_AT_name("GPAQSEL2")
    7914                      .dwattr $C$DW$816, DW_AT_TI_symbol_name("_GPAQSEL2")
    7915                      .dwattr $C$DW$816, DW_AT_data_member_location[DW_OP_plus_uconst 0x4]
    7916                      .dwattr $C$DW$816, DW_AT_accessibility(DW_ACCESS_public)
    7917              $C$DW$817       .dwtag  DW_TAG_member
    7918                      .dwattr $C$DW$817, DW_AT_type(*$C$DW$T$81)
    7919                      .dwattr $C$DW$817, DW_AT_name("GPAMUX1")
    7920                      .dwattr $C$DW$817, DW_AT_TI_symbol_name("_GPAMUX1")
    7921                      .dwattr $C$DW$817, DW_AT_data_member_location[DW_OP_plus_uconst 0x6]
    7922                      .dwattr $C$DW$817, DW_AT_accessibility(DW_ACCESS_public)
    7923              $C$DW$818       .dwtag  DW_TAG_member
    7924                      .dwattr $C$DW$818, DW_AT_type(*$C$DW$T$81)
    7925                      .dwattr $C$DW$818, DW_AT_name("GPAMUX2")
    7926                      .dwattr $C$DW$818, DW_AT_TI_symbol_name("_GPAMUX2")
    7927                      .dwattr $C$DW$818, DW_AT_data_member_location[DW_OP_plus_uconst 0x8]
    7928                      .dwattr $C$DW$818, DW_AT_accessibility(DW_ACCESS_public)
    7929              $C$DW$819       .dwtag  DW_TAG_member
    7930                      .dwattr $C$DW$819, DW_AT_type(*$C$DW$T$81)
    7931                      .dwattr $C$DW$819, DW_AT_name("GPADIR")
    7932                      .dwattr $C$DW$819, DW_AT_TI_symbol_name("_GPADIR")
    7933                      .dwattr $C$DW$819, DW_AT_data_member_location[DW_OP_plus_uconst 0xa]
    7934                      .dwattr $C$DW$819, DW_AT_accessibility(DW_ACCESS_public)
    7935              $C$DW$820       .dwtag  DW_TAG_member
    7936                      .dwattr $C$DW$820, DW_AT_type(*$C$DW$T$81)
    7937                      .dwattr $C$DW$820, DW_AT_name("GPAPUD")
    7938                      .dwattr $C$DW$820, DW_AT_TI_symbol_name("_GPAPUD")
    7939                      .dwattr $C$DW$820, DW_AT_data_member_location[DW_OP_plus_uconst 0xc]
    7940                      .dwattr $C$DW$820, DW_AT_accessibility(DW_ACCESS_public)
    7941              $C$DW$821       .dwtag  DW_TAG_member
TMS320C2000 Assembler PC v6.2.5 Fri Oct 13 15:05:13 2017

Tools Copyright (c) 1996-2014 Texas Instruments Incorporated
C:\Users\wmj\AppData\Local\Temp\1391212                              PAGE  152

    7942                      .dwattr $C$DW$821, DW_AT_type(*$C$DW$T$27)
    7943                      .dwattr $C$DW$821, DW_AT_name("rsvd_1")
    7944                      .dwattr $C$DW$821, DW_AT_TI_symbol_name("_rsvd_1")
    7945                      .dwattr $C$DW$821, DW_AT_data_member_location[DW_OP_plus_uconst 0xe]
    7946                      .dwattr $C$DW$821, DW_AT_accessibility(DW_ACCESS_public)
    7947              $C$DW$822       .dwtag  DW_TAG_member
    7948                      .dwattr $C$DW$822, DW_AT_type(*$C$DW$T$81)
    7949                      .dwattr $C$DW$822, DW_AT_name("GPBCTRL")
    7950                      .dwattr $C$DW$822, DW_AT_TI_symbol_name("_GPBCTRL")
    7951                      .dwattr $C$DW$822, DW_AT_data_member_location[DW_OP_plus_uconst 0x10]
    7952                      .dwattr $C$DW$822, DW_AT_accessibility(DW_ACCESS_public)
    7953              $C$DW$823       .dwtag  DW_TAG_member
    7954                      .dwattr $C$DW$823, DW_AT_type(*$C$DW$T$81)
    7955                      .dwattr $C$DW$823, DW_AT_name("GPBQSEL1")
    7956                      .dwattr $C$DW$823, DW_AT_TI_symbol_name("_GPBQSEL1")
    7957                      .dwattr $C$DW$823, DW_AT_data_member_location[DW_OP_plus_uconst 0x12]
    7958                      .dwattr $C$DW$823, DW_AT_accessibility(DW_ACCESS_public)
    7959              $C$DW$824       .dwtag  DW_TAG_member
    7960                      .dwattr $C$DW$824, DW_AT_type(*$C$DW$T$27)
    7961                      .dwattr $C$DW$824, DW_AT_name("rsvd_2")
    7962                      .dwattr $C$DW$824, DW_AT_TI_symbol_name("_rsvd_2")
    7963                      .dwattr $C$DW$824, DW_AT_data_member_location[DW_OP_plus_uconst 0x14]
    7964                      .dwattr $C$DW$824, DW_AT_accessibility(DW_ACCESS_public)
    7965              $C$DW$825       .dwtag  DW_TAG_member
    7966                      .dwattr $C$DW$825, DW_AT_type(*$C$DW$T$81)
    7967                      .dwattr $C$DW$825, DW_AT_name("GPBMUX1")
    7968                      .dwattr $C$DW$825, DW_AT_TI_symbol_name("_GPBMUX1")
    7969                      .dwattr $C$DW$825, DW_AT_data_member_location[DW_OP_plus_uconst 0x16]
    7970                      .dwattr $C$DW$825, DW_AT_accessibility(DW_ACCESS_public)
    7971              $C$DW$826       .dwtag  DW_TAG_member
    7972                      .dwattr $C$DW$826, DW_AT_type(*$C$DW$T$27)
    7973                      .dwattr $C$DW$826, DW_AT_name("rsvd_3")
    7974                      .dwattr $C$DW$826, DW_AT_TI_symbol_name("_rsvd_3")
    7975                      .dwattr $C$DW$826, DW_AT_data_member_location[DW_OP_plus_uconst 0x18]
    7976                      .dwattr $C$DW$826, DW_AT_accessibility(DW_ACCESS_public)
    7977              $C$DW$827       .dwtag  DW_TAG_member
    7978                      .dwattr $C$DW$827, DW_AT_type(*$C$DW$T$81)
    7979                      .dwattr $C$DW$827, DW_AT_name("GPBDIR")
    7980                      .dwattr $C$DW$827, DW_AT_TI_symbol_name("_GPBDIR")
    7981                      .dwattr $C$DW$827, DW_AT_data_member_location[DW_OP_plus_uconst 0x1a]
    7982                      .dwattr $C$DW$827, DW_AT_accessibility(DW_ACCESS_public)
    7983              $C$DW$828       .dwtag  DW_TAG_member
    7984                      .dwattr $C$DW$828, DW_AT_type(*$C$DW$T$81)
    7985                      .dwattr $C$DW$828, DW_AT_name("GPBPUD")
    7986                      .dwattr $C$DW$828, DW_AT_TI_symbol_name("_GPBPUD")
    7987                      .dwattr $C$DW$828, DW_AT_data_member_location[DW_OP_plus_uconst 0x1c]
    7988                      .dwattr $C$DW$828, DW_AT_accessibility(DW_ACCESS_public)
    7989              $C$DW$829       .dwtag  DW_TAG_member
    7990                      .dwattr $C$DW$829, DW_AT_type(*$C$DW$T$82)
    7991                      .dwattr $C$DW$829, DW_AT_name("rsvd_4")
    7992                      .dwattr $C$DW$829, DW_AT_TI_symbol_name("_rsvd_4")
    7993                      .dwattr $C$DW$829, DW_AT_data_member_location[DW_OP_plus_uconst 0x1e]
    7994                      .dwattr $C$DW$829, DW_AT_accessibility(DW_ACCESS_public)
    7995              $C$DW$830       .dwtag  DW_TAG_member
    7996                      .dwattr $C$DW$830, DW_AT_type(*$C$DW$T$81)
TMS320C2000 Assembler PC v6.2.5 Fri Oct 13 15:05:13 2017

Tools Copyright (c) 1996-2014 Texas Instruments Incorporated
C:\Users\wmj\AppData\Local\Temp\1391212                              PAGE  153

    7997                      .dwattr $C$DW$830, DW_AT_name("AIOMUX1")
    7998                      .dwattr $C$DW$830, DW_AT_TI_symbol_name("_AIOMUX1")
    7999                      .dwattr $C$DW$830, DW_AT_data_member_location[DW_OP_plus_uconst 0x36]
    8000                      .dwattr $C$DW$830, DW_AT_accessibility(DW_ACCESS_public)
