TMS320C2000 Assembler PC v6.2.5 Fri Oct 13 15:05:15 2017

Tools Copyright (c) 1996-2014 Texas Instruments Incorporated
C:\Users\wmj\AppData\Local\Temp\1509611                              PAGE    1

       1              ;***************************************************************
       2              ;* TMS320C2000 C/C++ Codegen                         PC v6.2.5 *
       3              ;* Date/Time created: Fri Oct 13 15:05:14 2017                 *
       4              ;***************************************************************
       5                      .compiler_opts --float_support=softlib --hll_source=on --mem_model:code=flat --mem_model:data=large -
       6        0002  FP      .set    XAR2
       7              
       8              $C$DW$CU        .dwtag  DW_TAG_compile_unit
       9                      .dwattr $C$DW$CU, DW_AT_name("D:/BM1000/sw/modules/hal/boards/hvkit_rev1p1/f28x/f2802x/src/hal.c")
      10                      .dwattr $C$DW$CU, DW_AT_producer("TMS320C2000 C/C++ Codegen PC v6.2.5 Copyright (c) 1996-2014 Texas I
      11                      .dwattr $C$DW$CU, DW_AT_TI_version(0x01)
      12                      .dwattr $C$DW$CU, DW_AT_comp_dir("D:\BM1000\sw\solutions\instaspin_foc\boards\hvkit_rev1p1\f28x\f2802
      13              
      14              $C$DW$1 .dwtag  DW_TAG_subprogram, DW_AT_name("SPI_setMode")
      15                      .dwattr $C$DW$1, DW_AT_TI_symbol_name("_SPI_setMode")

   10253              $C$DW$1826      .dwtag  DW_TAG_enumerator, DW_AT_name("SCI_CharLength_8_Bits"), DW_AT_const_value(0x07)
   10254                      .dwendtag $C$DW$T$320
   10255              
   10256              $C$DW$T$321     .dwtag  DW_TAG_typedef, DW_AT_name("SCI_CharLength_e")
   10257                      .dwattr $C$DW$T$321, DW_AT_type(*$C$DW$T$320)
   10258                      .dwattr $C$DW$T$321, DW_AT_language(DW_LANG_C)
   10259              $C$DW$1827      .dwtag  DW_TAG_TI_far_type
   10260                      .dwattr $C$DW$1827, DW_AT_type(*$C$DW$T$321)
   10261              $C$DW$T$322     .dwtag  DW_TAG_const_type
   10262                      .dwattr $C$DW$T$322, DW_AT_type(*$C$DW$1827)
   10263              
   10264              $C$DW$T$323     .dwtag  DW_TAG_enumeration_type
   10265                      .dwattr $C$DW$T$323, DW_AT_byte_size(0x01)
   10266              $C$DW$1828      .dwtag  DW_TAG_enumerator, DW_AT_name("SCI_Mode_IdleLine"), DW_AT_const_value(0x00)
   10267              $C$DW$1829      .dwtag  DW_TAG_enumerator, DW_AT_name("SCI_Mode_AddressBit"), DW_AT_const_value(0x08)
   10268                      .dwendtag $C$DW$T$323
   10269              
   10270              $C$DW$T$324     .dwtag  DW_TAG_typedef, DW_AT_name("SCI_Mode_e")
   10271                      .dwattr $C$DW$T$324, DW_AT_type(*$C$DW$T$323)
   10272                      .dwattr $C$DW$T$324, DW_AT_language(DW_LANG_C)
   10273              $C$DW$1830      .dwtag  DW_TAG_TI_far_type
   10274                      .dwattr $C$DW$1830, DW_AT_type(*$C$DW$T$324)
   10275              $C$DW$T$325     .dwtag  DW_TAG_const_type
   10276                      .dwattr $C$DW$T$325, DW_AT_type(*$C$DW$1830)
   10277              
   10278              $C$DW$T$326     .dwtag  DW_TAG_enumeration_type
   10279                      .dwattr $C$DW$T$326, DW_AT_byte_size(0x01)
   10280              $C$DW$1831      .dwtag  DW_TAG_enumerator, DW_AT_name("SCI_NumStopBits_One"), DW_AT_const_value(0x00)
   10281              $C$DW$1832      .dwtag  DW_TAG_enumerator, DW_AT_name("SCI_NumStopBits_Two"), DW_AT_const_value(0x80)
   10282                      .dwendtag $C$DW$T$326
   10283              
   10284              $C$DW$T$327     .dwtag  DW_TAG_typedef, DW_AT_name("SCI_NumStopBits_e")
   10285                      .dwattr $C$DW$T$327, DW_AT_type(*$C$DW$T$326)
   10286                      .dwattr $C$DW$T$327, DW_AT_language(DW_LANG_C)
   10287              $C$DW$1833      .dwtag  DW_TAG_TI_far_type
   10288                      .dwattr $C$DW$1833, DW_AT_type(*$C$DW$T$327)
   10289              $C$DW$T$328     .dwtag  DW_TAG_const_type
   10290                      .dwattr $C$DW$T$328, DW_AT_type(*$C$DW$1833)
   10291              
   10292              $C$DW$T$329     .dwtag  DW_TAG_enumeration_type
   10293                      .dwattr $C$DW$T$329, DW_AT_byte_size(0x01)
   10294              $C$DW$1834      .dwtag  DW_TAG_enumerator, DW_AT_name("SCI_Parity_Odd"), DW_AT_const_value(0x00)
   10295              $C$DW$1835      .dwtag  DW_TAG_enumerator, DW_AT_name("SCI_Parity_Even"), DW_AT_const_value(0x40)
   10296                      .dwendtag $C$DW$T$329
   10297              
TMS320C2000 Assembler PC v6.2.5 Fri Oct 13 15:05:15 2017

Tools Copyright (c) 1996-2014 Texas Instruments Incorporated
C:\Users\wmj\AppData\Local\Temp\1509611                              PAGE  198

   10298              $C$DW$T$330     .dwtag  DW_TAG_typedef, DW_AT_name("SCI_Parity_e")
   10299                      .dwattr $C$DW$T$330, DW_AT_type(*$C$DW$T$329)
   10300                      .dwattr $C$DW$T$330, DW_AT_language(DW_LANG_C)
   10301              $C$DW$1836      .dwtag  DW_TAG_TI_far_type
   10302                      .dwattr $C$DW$1836, DW_AT_type(*$C$DW$T$330)
   10303              $C$DW$T$331     .dwtag  DW_TAG_const_type
   10304                      .dwattr $C$DW$T$331, DW_AT_type(*$C$DW$1836)
   10305              
   10306              $C$DW$T$332     .dwtag  DW_TAG_enumeration_type
   10307                      .dwattr $C$DW$T$332, DW_AT_byte_size(0x01)
   10308              $C$DW$1837      .dwtag  DW_TAG_enumerator, DW_AT_name("HAL_SensorType_Current"), DW_AT_const_value(0x00)
   10309              $C$DW$1838      .dwtag  DW_TAG_enumerator, DW_AT_name("HAL_SensorType_Voltage"), DW_AT_const_value(0x01)
   10310                      .dwendtag $C$DW$T$332
   10311              
   10312              $C$DW$T$333     .dwtag  DW_TAG_typedef, DW_AT_name("HAL_SensorType_e")
   10313                      .dwattr $C$DW$T$333, DW_AT_type(*$C$DW$T$332)
   10314                      .dwattr $C$DW$T$333, DW_AT_language(DW_LANG_C)
   10315              
   10316              $C$DW$T$19      .dwtag  DW_TAG_structure_type
   10317                      .dwattr $C$DW$T$19, DW_AT_name("I2C_Obj")
   10318                      .dwattr $C$DW$T$19, DW_AT_declaration
   10319                      .dwendtag $C$DW$T$19
   10320              
   10321              $C$DW$T$79      .dwtag  DW_TAG_pointer_type
   10322                      .dwattr $C$DW$T$79, DW_AT_type(*$C$DW$T$19)
   10323                      .dwattr $C$DW$T$79, DW_AT_address_class(0x16)
   10324              $C$DW$T$80      .dwtag  DW_TAG_typedef, DW_AT_name("I2C_Handle")
   10325                      .dwattr $C$DW$T$80, DW_AT_type(*$C$DW$T$79)
   10326                      .dwattr $C$DW$T$80, DW_AT_language(DW_LANG_C)
   10327              
   10328              $C$DW$T$30      .dwtag  DW_TAG_structure_type
   10329                      .dwattr $C$DW$T$30, DW_AT_name("_ADC_Obj_")
   10330                      .dwattr $C$DW$T$30, DW_AT_byte_size(0x6650)
   10331              $C$DW$1839      .dwtag  DW_TAG_member
   10332                      .dwattr $C$DW$1839, DW_AT_type(*$C$DW$T$24)
   10333                      .dwattr $C$DW$1839, DW_AT_name("ADCRESULT")
   10334                      .dwattr $C$DW$1839, DW_AT_TI_symbol_name("_ADCRESULT")
   10335                      .dwattr $C$DW$1839, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
   10336                      .dwattr $C$DW$1839, DW_AT_accessibility(DW_ACCESS_public)
   10337              $C$DW$1840      .dwtag  DW_TAG_member
   10338                      .dwattr $C$DW$1840, DW_AT_type(*$C$DW$T$25)
   10339                      .dwattr $C$DW$1840, DW_AT_name("resvd_1")
   10340                      .dwattr $C$DW$1840, DW_AT_TI_symbol_name("_resvd_1")
   10341                      .dwattr $C$DW$1840, DW_AT_data_member_location[DW_OP_plus_uconst 0x10]
   10342                      .dwattr $C$DW$1840, DW_AT_accessibility(DW_ACCESS_public)
   10343              $C$DW$1841      .dwtag  DW_TAG_member
   10344                      .dwattr $C$DW$1841, DW_AT_type(*$C$DW$T$23)
   10345                      .dwattr $C$DW$1841, DW_AT_name("ADCCTL1")
   10346                      .dwattr $C$DW$1841, DW_AT_TI_symbol_name("_ADCCTL1")
   10347                      .dwattr $C$DW$1841, DW_AT_data_member_location[DW_OP_plus_uconst 0x6600]
   10348                      .dwattr $C$DW$1841, DW_AT_accessibility(DW_ACCESS_public)
   10349              $C$DW$1842      .dwtag  DW_TAG_member
   10350                      .dwattr $C$DW$1842, DW_AT_type(*$C$DW$T$23)
   10351                      .dwattr $C$DW$1842, DW_AT_name("ADCCTL2")
   10352                      .dwattr $C$DW$1842, DW_AT_TI_symbol_name("_ADCCTL2")
TMS320C2000 Assembler PC v6.2.5 Fri Oct 13 15:05:15 2017

Tools Copyright (c) 1996-2014 Texas Instruments Incorporated
C:\Users\wmj\AppData\Local\Temp\1509611                              PAGE  199

   10353                      .dwattr $C$DW$1842, DW_AT_data_member_location[DW_OP_plus_uconst 0x6601]
   10354                      .dwattr $C$DW$1842, DW_AT_accessibility(DW_ACCESS_public)
   10355              $C$DW$1843      .dwtag  DW_TAG_member
   10356                      .dwattr $C$DW$1843, DW_AT_type(*$C$DW$T$26)
   10357                      .dwattr $C$DW$1843, DW_AT_name("rsvd_2")
   10358                      .dwattr $C$DW$1843, DW_AT_TI_symbol_name("_rsvd_2")
   10359                      .dwattr $C$DW$1843, DW_AT_data_member_location[DW_OP_plus_uconst 0x6602]
   10360                      .dwattr $C$DW$1843, DW_AT_accessibility(DW_ACCESS_public)
   10361              $C$DW$1844      .dwtag  DW_TAG_member
   10362                      .dwattr $C$DW$1844, DW_AT_type(*$C$DW$T$23)
   10363                      .dwattr $C$DW$1844, DW_AT_name("ADCINTFLG")
   10364                      .dwattr $C$DW$1844, DW_AT_TI_symbol_name("_ADCINTFLG")
   10365                      .dwattr $C$DW$1844, DW_AT_data_member_location[DW_OP_plus_uconst 0x6604]
   10366                      .dwattr $C$DW$1844, DW_AT_accessibility(DW_ACCESS_public)
   10367              $C$DW$1845      .dwtag  DW_TAG_member
   10368                      .dwattr $C$DW$1845, DW_AT_type(*$C$DW$T$23)
   10369                      .dwattr $C$DW$1845, DW_AT_name("ADCINTFLGCLR")
   10370                      .dwattr $C$DW$1845, DW_AT_TI_symbol_name("_ADCINTFLGCLR")
   10371                      .dwattr $C$DW$1845, DW_AT_data_member_location[DW_OP_plus_uconst 0x6605]
   10372                      .dwattr $C$DW$1845, DW_AT_accessibility(DW_ACCESS_public)
   10373              $C$DW$1846      .dwtag  DW_TAG_member
   10374                      .dwattr $C$DW$1846, DW_AT_type(*$C$DW$T$23)
   10375                      .dwattr $C$DW$1846, DW_AT_name("ADCINTOVF")
   10376                      .dwattr $C$DW$1846, DW_AT_TI_symbol_name("_ADCINTOVF")
   10377                      .dwattr $C$DW$1846, DW_AT_data_member_location[DW_OP_plus_uconst 0x6606]
   10378                      .dwattr $C$DW$1846, DW_AT_accessibility(DW_ACCESS_public)
   10379              $C$DW$1847      .dwtag  DW_TAG_member
   10380                      .dwattr $C$DW$1847, DW_AT_type(*$C$DW$T$23)
   10381                      .dwattr $C$DW$1847, DW_AT_name("ADCINTOVFCLR")
   10382                      .dwattr $C$DW$1847, DW_AT_TI_symbol_name("_ADCINTOVFCLR")
   10383                      .dwattr $C$DW$1847, DW_AT_data_member_location[DW_OP_plus_uconst 0x6607]
   10384                      .dwattr $C$DW$1847, DW_AT_accessibility(DW_ACCESS_public)
   10385              $C$DW$1848      .dwtag  DW_TAG_member
   10386                      .dwattr $C$DW$1848, DW_AT_type(*$C$DW$T$27)
   10387                      .dwattr $C$DW$1848, DW_AT_name("INTSELxNy")
   10388                      .dwattr $C$DW$1848, DW_AT_TI_symbol_name("_INTSELxNy")
   10389                      .dwattr $C$DW$1848, DW_AT_data_member_location[DW_OP_plus_uconst 0x6608]
   10390                      .dwattr $C$DW$1848, DW_AT_accessibility(DW_ACCESS_public)
   10391              $C$DW$1849      .dwtag  DW_TAG_member
   10392                      .dwattr $C$DW$1849, DW_AT_type(*$C$DW$T$28)
   10393                      .dwattr $C$DW$1849, DW_AT_name("rsvd_3")
   10394                      .dwattr $C$DW$1849, DW_AT_TI_symbol_name("_rsvd_3")
   10395                      .dwattr $C$DW$1849, DW_AT_data_member_location[DW_OP_plus_uconst 0x660d]
   10396                      .dwattr $C$DW$1849, DW_AT_accessibility(DW_ACCESS_public)
   10397              $C$DW$1850      .dwtag  DW_TAG_member
   10398                      .dwattr $C$DW$1850, DW_AT_type(*$C$DW$T$23)
   10399                      .dwattr $C$DW$1850, DW_AT_name("SOCPRICTRL")
   10400                      .dwattr $C$DW$1850, DW_AT_TI_symbol_name("_SOCPRICTRL")
   10401                      .dwattr $C$DW$1850, DW_AT_data_member_location[DW_OP_plus_uconst 0x6610]
   10402                      .dwattr $C$DW$1850, DW_AT_accessibility(DW_ACCESS_public)
   10403              $C$DW$1851      .dwtag  DW_TAG_member
   10404                      .dwattr $C$DW$1851, DW_AT_type(*$C$DW$T$23)
   10405                      .dwattr $C$DW$1851, DW_AT_name("rsvd_4")
   10406                      .dwattr $C$DW$1851, DW_AT_TI_symbol_name("_rsvd_4")
   10407                      .dwattr $C$DW$1851, DW_AT_data_member_location[DW_OP_plus_uconst 0x6611]
TMS320C2000 Assembler PC v6.2.5 Fri Oct 13 15:05:15 2017

Tools Copyright (c) 1996-2014 Texas Instruments Incorporated
C:\Users\wmj\AppData\Local\Temp\1509611                              PAGE  200

   10408                      .dwattr $C$DW$1851, DW_AT_accessibility(DW_ACCESS_public)
   10409              $C$DW$1852      .dwtag  DW_TAG_member
   10410                      .dwattr $C$DW$1852, DW_AT_type(*$C$DW$T$23)
   10411                      .dwattr $C$DW$1852, DW_AT_name("ADCSAMPLEMODE")
   10412                      .dwattr $C$DW$1852, DW_AT_TI_symbol_name("_ADCSAMPLEMODE")
   10413                      .dwattr $C$DW$1852, DW_AT_data_member_location[DW_OP_plus_uconst 0x6612]
   10414                      .dwattr $C$DW$1852, DW_AT_accessibility(DW_ACCESS_public)
   10415              $C$DW$1853      .dwtag  DW_TAG_member
   10416                      .dwattr $C$DW$1853, DW_AT_type(*$C$DW$T$23)
   10417                      .dwattr $C$DW$1853, DW_AT_name("rsvd_5")
   10418                      .dwattr $C$DW$1853, DW_AT_TI_symbol_name("_rsvd_5")
   10419                      .dwattr $C$DW$1853, DW_AT_data_member_location[DW_OP_plus_uconst 0x6613]
   10420                      .dwattr $C$DW$1853, DW_AT_accessibility(DW_ACCESS_public)
   10421              $C$DW$1854      .dwtag  DW_TAG_member
   10422                      .dwattr $C$DW$1854, DW_AT_type(*$C$DW$T$23)
   10423                      .dwattr $C$DW$1854, DW_AT_name("ADCINTSOCSEL1")
   10424                      .dwattr $C$DW$1854, DW_AT_TI_symbol_name("_ADCINTSOCSEL1")
   10425                      .dwattr $C$DW$1854, DW_AT_data_member_location[DW_OP_plus_uconst 0x6614]
   10426                      .dwattr $C$DW$1854, DW_AT_accessibility(DW_ACCESS_public)
   10427              $C$DW$1855      .dwtag  DW_TAG_member
   10428                      .dwattr $C$DW$1855, DW_AT_type(*$C$DW$T$23)
   10429                      .dwattr $C$DW$1855, DW_AT_name("ADCINTSOCSEL2")
   10430                      .dwattr $C$DW$1855, DW_AT_TI_symbol_name("_ADCINTSOCSEL2")
   10431                      .dwattr $C$DW$1855, DW_AT_data_member_location[DW_OP_plus_uconst 0x6615]
   10432                      .dwattr $C$DW$1855, DW_AT_accessibility(DW_ACCESS_public)
   10433              $C$DW$1856      .dwtag  DW_TAG_member
   10434                      .dwattr $C$DW$1856, DW_AT_type(*$C$DW$T$26)
   10435                      .dwattr $C$DW$1856, DW_AT_name("rsvd_6")
   10436                      .dwattr $C$DW$1856, DW_AT_TI_symbol_name("_rsvd_6")
   10437                      .dwattr $C$DW$1856, DW_AT_data_member_location[DW_OP_plus_uconst 0x6616]
   10438                      .dwattr $C$DW$1856, DW_AT_accessibility(DW_ACCESS_public)
   10439              $C$DW$1857      .dwtag  DW_TAG_member
   10440                      .dwattr $C$DW$1857, DW_AT_type(*$C$DW$T$23)
   10441                      .dwattr $C$DW$1857, DW_AT_name("ADCSOCFLG1")
   10442                      .dwattr $C$DW$1857, DW_AT_TI_symbol_name("_ADCSOCFLG1")
   10443                      .dwattr $C$DW$1857, DW_AT_data_member_location[DW_OP_plus_uconst 0x6618]
   10444                      .dwattr $C$DW$1857, DW_AT_accessibility(DW_ACCESS_public)
   10445              $C$DW$1858      .dwtag  DW_TAG_member
   10446                      .dwattr $C$DW$1858, DW_AT_type(*$C$DW$T$23)
   10447                      .dwattr $C$DW$1858, DW_AT_name("rsvd_7")
   10448                      .dwattr $C$DW$1858, DW_AT_TI_symbol_name("_rsvd_7")
   10449                      .dwattr $C$DW$1858, DW_AT_data_member_location[DW_OP_plus_uconst 0x6619]
   10450                      .dwattr $C$DW$1858, DW_AT_accessibility(DW_ACCESS_public)
   10451              $C$DW$1859      .dwtag  DW_TAG_member
   10452                      .dwattr $C$DW$1859, DW_AT_type(*$C$DW$T$23)
   10453                      .dwattr $C$DW$1859, DW_AT_name("ADCSOCFRC1")
   10454                      .dwattr $C$DW$1859, DW_AT_TI_symbol_name("_ADCSOCFRC1")
   10455                      .dwattr $C$DW$1859, DW_AT_data_member_location[DW_OP_plus_uconst 0x661a]
   10456                      .dwattr $C$DW$1859, DW_AT_accessibility(DW_ACCESS_public)
   10457              $C$DW$1860      .dwtag  DW_TAG_member
   10458                      .dwattr $C$DW$1860, DW_AT_type(*$C$DW$T$23)
   10459                      .dwattr $C$DW$1860, DW_AT_name("rsvd_8")
   10460                      .dwattr $C$DW$1860, DW_AT_TI_symbol_name("_rsvd_8")
   10461                      .dwattr $C$DW$1860, DW_AT_data_member_location[DW_OP_plus_uconst 0x661b]
   10462                      .dwattr $C$DW$1860, DW_AT_accessibility(DW_ACCESS_public)
TMS320C2000 Assembler PC v6.2.5 Fri Oct 13 15:05:15 2017

Tools Copyright (c) 1996-2014 Texas Instruments Incorporated
C:\Users\wmj\AppData\Local\Temp\1509611                              PAGE  201

   10463              $C$DW$1861      .dwtag  DW_TAG_member
   10464                      .dwattr $C$DW$1861, DW_AT_type(*$C$DW$T$23)
   10465                      .dwattr $C$DW$1861, DW_AT_name("ADCSOCOVF1")
   10466                      .dwattr $C$DW$1861, DW_AT_TI_symbol_name("_ADCSOCOVF1")
   10467                      .dwattr $C$DW$1861, DW_AT_data_member_location[DW_OP_plus_uconst 0x661c]
   10468                      .dwattr $C$DW$1861, DW_AT_accessibility(DW_ACCESS_public)
   10469              $C$DW$1862      .dwtag  DW_TAG_member
   10470                      .dwattr $C$DW$1862, DW_AT_type(*$C$DW$T$23)
   10471                      .dwattr $C$DW$1862, DW_AT_name("rsvd_9")
   10472                      .dwattr $C$DW$1862, DW_AT_TI_symbol_name("_rsvd_9")
   10473                      .dwattr $C$DW$1862, DW_AT_data_member_location[DW_OP_plus_uconst 0x661d]
   10474                      .dwattr $C$DW$1862, DW_AT_accessibility(DW_ACCESS_public)
   10475              $C$DW$1863      .dwtag  DW_TAG_member
   10476                      .dwattr $C$DW$1863, DW_AT_type(*$C$DW$T$23)
   10477                      .dwattr $C$DW$1863, DW_AT_name("ADCSOCOVFCLR1")
   10478                      .dwattr $C$DW$1863, DW_AT_TI_symbol_name("_ADCSOCOVFCLR1")
   10479                      .dwattr $C$DW$1863, DW_AT_data_member_location[DW_OP_plus_uconst 0x661e]
   10480                      .dwattr $C$DW$1863, DW_AT_accessibility(DW_ACCESS_public)
   10481              $C$DW$1864      .dwtag  DW_TAG_member
   10482                      .dwattr $C$DW$1864, DW_AT_type(*$C$DW$T$23)
   10483                      .dwattr $C$DW$1864, DW_AT_name("rsvd_10")
   10484                      .dwattr $C$DW$1864, DW_AT_TI_symbol_name("_rsvd_10")
   10485                      .dwattr $C$DW$1864, DW_AT_data_member_location[DW_OP_plus_uconst 0x661f]
   10486                      .dwattr $C$DW$1864, DW_AT_accessibility(DW_ACCESS_public)
   10487              $C$DW$1865      .dwtag  DW_TAG_member
   10488                      .dwattr $C$DW$1865, DW_AT_type(*$C$DW$T$24)
   10489                      .dwattr $C$DW$1865, DW_AT_name("ADCSOCxCTL")
   10490                      .dwattr $C$DW$1865, DW_AT_TI_symbol_name("_ADCSOCxCTL")
   10491                      .dwattr $C$DW$1865, DW_AT_data_member_location[DW_OP_plus_uconst 0x6620]
   10492                      .dwattr $C$DW$1865, DW_AT_accessibility(DW_ACCESS_public)
   10493              $C$DW$1866      .dwtag  DW_TAG_member
   10494                      .dwattr $C$DW$1866, DW_AT_type(*$C$DW$T$24)
   10495                      .dwattr $C$DW$1866, DW_AT_name("rsvd_11")
   10496                      .dwattr $C$DW$1866, DW_AT_TI_symbol_name("_rsvd_11")
   10497                      .dwattr $C$DW$1866, DW_AT_data_member_location[DW_OP_plus_uconst 0x6630]
   10498                      .dwattr $C$DW$1866, DW_AT_accessibility(DW_ACCESS_public)
   10499              $C$DW$1867      .dwtag  DW_TAG_member
   10500                      .dwattr $C$DW$1867, DW_AT_type(*$C$DW$T$23)
   10501                      .dwattr $C$DW$1867, DW_AT_name("ADCREFTRIM")
   10502                      .dwattr $C$DW$1867, DW_AT_TI_symbol_name("_ADCREFTRIM")
   10503                      .dwattr $C$DW$1867, DW_AT_data_member_location[DW_OP_plus_uconst 0x6640]
   10504                      .dwattr $C$DW$1867, DW_AT_accessibility(DW_ACCESS_public)
   10505              $C$DW$1868      .dwtag  DW_TAG_member
   10506                      .dwattr $C$DW$1868, DW_AT_type(*$C$DW$T$23)
   10507                      .dwattr $C$DW$1868, DW_AT_name("ADCOFFTRIM")
   10508                      .dwattr $C$DW$1868, DW_AT_TI_symbol_name("_ADCOFFTRIM")
   10509                      .dwattr $C$DW$1868, DW_AT_data_member_location[DW_OP_plus_uconst 0x6641]
   10510                      .dwattr $C$DW$1868, DW_AT_accessibility(DW_ACCESS_public)
   10511              $C$DW$1869      .dwtag  DW_TAG_member
   10512                      .dwattr $C$DW$1869, DW_AT_type(*$C$DW$T$29)
   10513                      .dwattr $C$DW$1869, DW_AT_name("resvd_12")
   10514                      .dwattr $C$DW$1869, DW_AT_TI_symbol_name("_resvd_12")
   10515                      .dwattr $C$DW$1869, DW_AT_data_member_location[DW_OP_plus_uconst 0x6642]
   10516                      .dwattr $C$DW$1869, DW_AT_accessibility(DW_ACCESS_public)
   10517              $C$DW$1870      .dwtag  DW_TAG_member
TMS320C2000 Assembler PC v6.2.5 Fri Oct 13 15:05:15 2017

Tools Copyright (c) 1996-2014 Texas Instruments Incorporated
C:\Users\wmj\AppData\Local\Temp\1509611                              PAGE  202

   10518                      .dwattr $C$DW$1870, DW_AT_type(*$C$DW$T$23)
   10519                      .dwattr $C$DW$1870, DW_AT_name("ADCREV")
   10520                      .dwattr $C$DW$1870, DW_AT_TI_symbol_name("_ADCREV")
   10521                      .dwattr $C$DW$1870, DW_AT_data_member_location[DW_OP_plus_uconst 0x664f]
   10522                      .dwattr $C$DW$1870, DW_AT_accessibility(DW_ACCESS_public)
   10523                      .dwendtag $C$DW$T$30
   10524              
   10525              $C$DW$T$340     .dwtag  DW_TAG_typedef, DW_AT_name("ADC_Obj")
   10526                      .dwattr $C$DW$T$340, DW_AT_type(*$C$DW$T$30)
   10527                      .dwattr $C$DW$T$340, DW_AT_language(DW_LANG_C)
   10528              $C$DW$T$50      .dwtag  DW_TAG_pointer_type
   10529                      .dwattr $C$DW$T$50, DW_AT_type(*$C$DW$T$30)
   10530                      .dwattr $C$DW$T$50, DW_AT_address_class(0x16)
   10531              $C$DW$T$51      .dwtag  DW_TAG_typedef, DW_AT_name("ADC_Handle")
   10532                      .dwattr $C$DW$T$51, DW_AT_type(*$C$DW$T$50)
   10533                      .dwattr $C$DW$T$51, DW_AT_language(DW_LANG_C)
   10534              
   10535              $C$DW$T$32      .dwtag  DW_TAG_structure_type
   10536                      .dwattr $C$DW$T$32, DW_AT_name("_CLK_Obj_")
   10537                      .dwattr $C$DW$T$32, DW_AT_byte_size(0x11)
   10538              $C$DW$1871      .dwtag  DW_TAG_member
   10539                      .dwattr $C$DW$1871, DW_AT_type(*$C$DW$T$23)
   10540                      .dwattr $C$DW$1871, DW_AT_name("XCLK")
   10541                      .dwattr $C$DW$1871, DW_AT_TI_symbol_name("_XCLK")
   10542                      .dwattr $C$DW$1871, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
   10543                      .dwattr $C$DW$1871, DW_AT_accessibility(DW_ACCESS_public)
   10544              $C$DW$1872      .dwtag  DW_TAG_member
   10545                      .dwattr $C$DW$1872, DW_AT_type(*$C$DW$T$23)
   10546                      .dwattr $C$DW$1872, DW_AT_name("rsvd_1")
   10547                      .dwattr $C$DW$1872, DW_AT_TI_symbol_name("_rsvd_1")
   10548                      .dwattr $C$DW$1872, DW_AT_data_member_location[DW_OP_plus_uconst 0x1]
   10549                      .dwattr $C$DW$1872, DW_AT_accessibility(DW_ACCESS_public)
   10550              $C$DW$1873      .dwtag  DW_TAG_member
   10551                      .dwattr $C$DW$1873, DW_AT_type(*$C$DW$T$23)
   10552                      .dwattr $C$DW$1873, DW_AT_name("CLKCTL")
   10553                      .dwattr $C$DW$1873, DW_AT_TI_symbol_name("_CLKCTL")
   10554                      .dwattr $C$DW$1873, DW_AT_data_member_location[DW_OP_plus_uconst 0x2]
   10555                      .dwattr $C$DW$1873, DW_AT_accessibility(DW_ACCESS_public)
   10556              $C$DW$1874      .dwtag  DW_TAG_member
   10557                      .dwattr $C$DW$1874, DW_AT_type(*$C$DW$T$31)
   10558                      .dwattr $C$DW$1874, DW_AT_name("rsvd_2")
   10559                      .dwattr $C$DW$1874, DW_AT_TI_symbol_name("_rsvd_2")
   10560                      .dwattr $C$DW$1874, DW_AT_data_member_location[DW_OP_plus_uconst 0x3]
   10561                      .dwattr $C$DW$1874, DW_AT_accessibility(DW_ACCESS_public)
   10562              $C$DW$1875      .dwtag  DW_TAG_member
   10563                      .dwattr $C$DW$1875, DW_AT_type(*$C$DW$T$23)
   10564                      .dwattr $C$DW$1875, DW_AT_name("LOSPCP")
   10565                      .dwattr $C$DW$1875, DW_AT_TI_symbol_name("_LOSPCP")
   10566                      .dwattr $C$DW$1875, DW_AT_data_member_location[DW_OP_plus_uconst 0xb]
   10567                      .dwattr $C$DW$1875, DW_AT_accessibility(DW_ACCESS_public)
   10568              $C$DW$1876      .dwtag  DW_TAG_member
   10569                      .dwattr $C$DW$1876, DW_AT_type(*$C$DW$T$23)
   10570                      .dwattr $C$DW$1876, DW_AT_name("PCLKCR0")
   10571                      .dwattr $C$DW$1876, DW_AT_TI_symbol_name("_PCLKCR0")
   10572                      .dwattr $C$DW$1876, DW_AT_data_member_location[DW_OP_plus_uconst 0xc]
TMS320C2000 Assembler PC v6.2.5 Fri Oct 13 15:05:15 2017

Tools Copyright (c) 1996-2014 Texas Instruments Incorporated
C:\Users\wmj\AppData\Local\Temp\1509611                              PAGE  203

   10573                      .dwattr $C$DW$1876, DW_AT_accessibility(DW_ACCESS_public)
   10574              $C$DW$1877      .dwtag  DW_TAG_member
   10575                      .dwattr $C$DW$1877, DW_AT_type(*$C$DW$T$23)
   10576                      .dwattr $C$DW$1877, DW_AT_name("PCLKCR1")
   10577                      .dwattr $C$DW$1877, DW_AT_TI_symbol_name("_PCLKCR1")
   10578                      .dwattr $C$DW$1877, DW_AT_data_member_location[DW_OP_plus_uconst 0xd]
   10579                      .dwattr $C$DW$1877, DW_AT_accessibility(DW_ACCESS_public)
   10580              $C$DW$1878      .dwtag  DW_TAG_member
   10581                      .dwattr $C$DW$1878, DW_AT_type(*$C$DW$T$26)
   10582                      .dwattr $C$DW$1878, DW_AT_name("rsvd_3")
   10583                      .dwattr $C$DW$1878, DW_AT_TI_symbol_name("_rsvd_3")
   10584                      .dwattr $C$DW$1878, DW_AT_data_member_location[DW_OP_plus_uconst 0xe]
   10585                      .dwattr $C$DW$1878, DW_AT_accessibility(DW_ACCESS_public)
   10586              $C$DW$1879      .dwtag  DW_TAG_member
   10587                      .dwattr $C$DW$1879, DW_AT_type(*$C$DW$T$23)
   10588                      .dwattr $C$DW$1879, DW_AT_name("PCLKCR3")
   10589                      .dwattr $C$DW$1879, DW_AT_TI_symbol_name("_PCLKCR3")
   10590                      .dwattr $C$DW$1879, DW_AT_data_member_location[DW_OP_plus_uconst 0x10]
   10591                      .dwattr $C$DW$1879, DW_AT_accessibility(DW_ACCESS_public)
   10592                      .dwendtag $C$DW$T$32
   10593              
   10594              $C$DW$T$52      .dwtag  DW_TAG_pointer_type
   10595                      .dwattr $C$DW$T$52, DW_AT_type(*$C$DW$T$32)
   10596                      .dwattr $C$DW$T$52, DW_AT_address_class(0x16)
   10597              $C$DW$T$53      .dwtag  DW_TAG_typedef, DW_AT_name("CLK_Handle")
   10598                      .dwattr $C$DW$T$53, DW_AT_type(*$C$DW$T$52)
   10599                      .dwattr $C$DW$T$53, DW_AT_language(DW_LANG_C)
   10600              
   10601              $C$DW$T$34      .dwtag  DW_TAG_structure_type
   10602                      .dwattr $C$DW$T$34, DW_AT_name("_CPU_Obj_")
   10603                      .dwattr $C$DW$T$34, DW_AT_byte_size(0x01)
   10604              $C$DW$1880      .dwtag  DW_TAG_member
   10605                      .dwattr $C$DW$1880, DW_AT_type(*$C$DW$T$33)
   10606                      .dwattr $C$DW$1880, DW_AT_name("tmp")
   10607                      .dwattr $C$DW$1880, DW_AT_TI_symbol_name("_tmp")
   10608                      .dwattr $C$DW$1880, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
   10609                      .dwattr $C$DW$1880, DW_AT_accessibility(DW_ACCESS_public)
   10610                      .dwendtag $C$DW$T$34
   10611              
   10612              $C$DW$T$347     .dwtag  DW_TAG_typedef, DW_AT_name("CPU_Obj")
   10613                      .dwattr $C$DW$T$347, DW_AT_type(*$C$DW$T$34)
   10614                      .dwattr $C$DW$T$347, DW_AT_language(DW_LANG_C)
   10615              $C$DW$T$54      .dwtag  DW_TAG_pointer_type
   10616                      .dwattr $C$DW$T$54, DW_AT_type(*$C$DW$T$34)
   10617                      .dwattr $C$DW$T$54, DW_AT_address_class(0x16)
   10618              $C$DW$T$55      .dwtag  DW_TAG_typedef, DW_AT_name("CPU_Handle")
   10619                      .dwattr $C$DW$T$55, DW_AT_type(*$C$DW$T$54)
   10620                      .dwattr $C$DW$T$55, DW_AT_language(DW_LANG_C)
   10621              
   10622              $C$DW$T$36      .dwtag  DW_TAG_structure_type
   10623                      .dwattr $C$DW$T$36, DW_AT_name("_FILTER_FO_")
   10624                      .dwattr $C$DW$T$36, DW_AT_byte_size(0x0a)
   10625              $C$DW$1881      .dwtag  DW_TAG_member
   10626                      .dwattr $C$DW$1881, DW_AT_type(*$C$DW$T$35)
   10627                      .dwattr $C$DW$1881, DW_AT_name("a1")
TMS320C2000 Assembler PC v6.2.5 Fri Oct 13 15:05:15 2017

Tools Copyright (c) 1996-2014 Texas Instruments Incorporated
C:\Users\wmj\AppData\Local\Temp\1509611                              PAGE  204

   10628                      .dwattr $C$DW$1881, DW_AT_TI_symbol_name("_a1")
   10629                      .dwattr $C$DW$1881, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
   10630                      .dwattr $C$DW$1881, DW_AT_accessibility(DW_ACCESS_public)
   10631              $C$DW$1882      .dwtag  DW_TAG_member
   10632                      .dwattr $C$DW$1882, DW_AT_type(*$C$DW$T$35)
   10633                      .dwattr $C$DW$1882, DW_AT_name("b0")
   10634                      .dwattr $C$DW$1882, DW_AT_TI_symbol_name("_b0")
   10635                      .dwattr $C$DW$1882, DW_AT_data_member_location[DW_OP_plus_uconst 0x2]
   10636                      .dwattr $C$DW$1882, DW_AT_accessibility(DW_ACCESS_public)
   10637              $C$DW$1883      .dwtag  DW_TAG_member
   10638                      .dwattr $C$DW$1883, DW_AT_type(*$C$DW$T$35)
   10639                      .dwattr $C$DW$1883, DW_AT_name("b1")
   10640                      .dwattr $C$DW$1883, DW_AT_TI_symbol_name("_b1")
   10641                      .dwattr $C$DW$1883, DW_AT_data_member_location[DW_OP_plus_uconst 0x4]
   10642                      .dwattr $C$DW$1883, DW_AT_accessibility(DW_ACCESS_public)
   10643              $C$DW$1884      .dwtag  DW_TAG_member
   10644                      .dwattr $C$DW$1884, DW_AT_type(*$C$DW$T$35)
   10645                      .dwattr $C$DW$1884, DW_AT_name("x1")
   10646                      .dwattr $C$DW$1884, DW_AT_TI_symbol_name("_x1")
   10647                      .dwattr $C$DW$1884, DW_AT_data_member_location[DW_OP_plus_uconst 0x6]
   10648                      .dwattr $C$DW$1884, DW_AT_accessibility(DW_ACCESS_public)
   10649              $C$DW$1885      .dwtag  DW_TAG_member
   10650                      .dwattr $C$DW$1885, DW_AT_type(*$C$DW$T$35)
   10651                      .dwattr $C$DW$1885, DW_AT_name("y1")
   10652                      .dwattr $C$DW$1885, DW_AT_TI_symbol_name("_y1")
   10653                      .dwattr $C$DW$1885, DW_AT_data_member_location[DW_OP_plus_uconst 0x8]
   10654                      .dwattr $C$DW$1885, DW_AT_accessibility(DW_ACCESS_public)
   10655                      .dwendtag $C$DW$T$36
   10656              
   10657              $C$DW$T$96      .dwtag  DW_TAG_typedef, DW_AT_name("FILTER_FO_Obj")
   10658                      .dwattr $C$DW$T$96, DW_AT_type(*$C$DW$T$36)
   10659                      .dwattr $C$DW$T$96, DW_AT_language(DW_LANG_C)
   10660              
   10661              $C$DW$T$20      .dwtag  DW_TAG_structure_type
   10662                      .dwattr $C$DW$T$20, DW_AT_name("_FILTER_FO_Obj_")
   10663                      .dwattr $C$DW$T$20, DW_AT_declaration
   10664                      .dwendtag $C$DW$T$20
   10665              
   10666              $C$DW$T$97      .dwtag  DW_TAG_pointer_type
   10667                      .dwattr $C$DW$T$97, DW_AT_type(*$C$DW$T$20)
   10668                      .dwattr $C$DW$T$97, DW_AT_address_class(0x16)
   10669              $C$DW$T$98      .dwtag  DW_TAG_typedef, DW_AT_name("FILTER_FO_Handle")
   10670                      .dwattr $C$DW$T$98, DW_AT_type(*$C$DW$T$97)
   10671                      .dwattr $C$DW$T$98, DW_AT_language(DW_LANG_C)
   10672              
   10673              $C$DW$T$37      .dwtag  DW_TAG_structure_type
   10674                      .dwattr $C$DW$T$37, DW_AT_name("_FLASH_Obj_")
   10675                      .dwattr $C$DW$T$37, DW_AT_byte_size(0x08)
   10676              $C$DW$1886      .dwtag  DW_TAG_member
   10677                      .dwattr $C$DW$1886, DW_AT_type(*$C$DW$T$23)
   10678                      .dwattr $C$DW$1886, DW_AT_name("FOPT")
   10679                      .dwattr $C$DW$1886, DW_AT_TI_symbol_name("_FOPT")
   10680                      .dwattr $C$DW$1886, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
   10681                      .dwattr $C$DW$1886, DW_AT_accessibility(DW_ACCESS_public)
   10682              $C$DW$1887      .dwtag  DW_TAG_member
TMS320C2000 Assembler PC v6.2.5 Fri Oct 13 15:05:15 2017

Tools Copyright (c) 1996-2014 Texas Instruments Incorporated
C:\Users\wmj\AppData\Local\Temp\1509611                              PAGE  205

   10683                      .dwattr $C$DW$1887, DW_AT_type(*$C$DW$T$23)
   10684                      .dwattr $C$DW$1887, DW_AT_name("rsvd_1")
   10685                      .dwattr $C$DW$1887, DW_AT_TI_symbol_name("_rsvd_1")
   10686                      .dwattr $C$DW$1887, DW_AT_data_member_location[DW_OP_plus_uconst 0x1]
   10687                      .dwattr $C$DW$1887, DW_AT_accessibility(DW_ACCESS_public)
   10688              $C$DW$1888      .dwtag  DW_TAG_member
   10689                      .dwattr $C$DW$1888, DW_AT_type(*$C$DW$T$23)
   10690                      .dwattr $C$DW$1888, DW_AT_name("FPWR")
   10691                      .dwattr $C$DW$1888, DW_AT_TI_symbol_name("_FPWR")
   10692                      .dwattr $C$DW$1888, DW_AT_data_member_location[DW_OP_plus_uconst 0x2]
   10693                      .dwattr $C$DW$1888, DW_AT_accessibility(DW_ACCESS_public)
   10694              $C$DW$1889      .dwtag  DW_TAG_member
   10695                      .dwattr $C$DW$1889, DW_AT_type(*$C$DW$T$23)
   10696                      .dwattr $C$DW$1889, DW_AT_name("FSTATUS")
   10697                      .dwattr $C$DW$1889, DW_AT_TI_symbol_name("_FSTATUS")
   10698                      .dwattr $C$DW$1889, DW_AT_data_member_location[DW_OP_plus_uconst 0x3]
   10699                      .dwattr $C$DW$1889, DW_AT_accessibility(DW_ACCESS_public)
   10700              $C$DW$1890      .dwtag  DW_TAG_member
   10701                      .dwattr $C$DW$1890, DW_AT_type(*$C$DW$T$23)
   10702                      .dwattr $C$DW$1890, DW_AT_name("FSTDBYWAIT")
   10703                      .dwattr $C$DW$1890, DW_AT_TI_symbol_name("_FSTDBYWAIT")
   10704                      .dwattr $C$DW$1890, DW_AT_data_member_location[DW_OP_plus_uconst 0x4]
   10705                      .dwattr $C$DW$1890, DW_AT_accessibility(DW_ACCESS_public)
   10706              $C$DW$1891      .dwtag  DW_TAG_member
   10707                      .dwattr $C$DW$1891, DW_AT_type(*$C$DW$T$23)
   10708                      .dwattr $C$DW$1891, DW_AT_name("FACTIVEWAIT")
   10709                      .dwattr $C$DW$1891, DW_AT_TI_symbol_name("_FACTIVEWAIT")
   10710                      .dwattr $C$DW$1891, DW_AT_data_member_location[DW_OP_plus_uconst 0x5]
   10711                      .dwattr $C$DW$1891, DW_AT_accessibility(DW_ACCESS_public)
   10712              $C$DW$1892      .dwtag  DW_TAG_member
   10713                      .dwattr $C$DW$1892, DW_AT_type(*$C$DW$T$23)
   10714                      .dwattr $C$DW$1892, DW_AT_name("FBANKWAIT")
   10715                      .dwattr $C$DW$1892, DW_AT_TI_symbol_name("_FBANKWAIT")
   10716                      .dwattr $C$DW$1892, DW_AT_data_member_location[DW_OP_plus_uconst 0x6]
   10717                      .dwattr $C$DW$1892, DW_AT_accessibility(DW_ACCESS_public)
   10718              $C$DW$1893      .dwtag  DW_TAG_member
   10719                      .dwattr $C$DW$1893, DW_AT_type(*$C$DW$T$23)
   10720                      .dwattr $C$DW$1893, DW_AT_name("FOTPWAIT")
   10721                      .dwattr $C$DW$1893, DW_AT_TI_symbol_name("_FOTPWAIT")
   10722                      .dwattr $C$DW$1893, DW_AT_data_member_location[DW_OP_plus_uconst 0x7]
   10723                      .dwattr $C$DW$1893, DW_AT_accessibility(DW_ACCESS_public)
   10724                      .dwendtag $C$DW$T$37
   10725              
   10726              $C$DW$T$56      .dwtag  DW_TAG_pointer_type
   10727                      .dwattr $C$DW$T$56, DW_AT_type(*$C$DW$T$37)
   10728                      .dwattr $C$DW$T$56, DW_AT_address_class(0x16)
   10729              $C$DW$T$57      .dwtag  DW_TAG_typedef, DW_AT_name("FLASH_Handle")
   10730                      .dwattr $C$DW$T$57, DW_AT_type(*$C$DW$T$56)
   10731                      .dwattr $C$DW$T$57, DW_AT_language(DW_LANG_C)
   10732              
   10733              $C$DW$T$42      .dwtag  DW_TAG_structure_type
   10734                      .dwattr $C$DW$T$42, DW_AT_name("_GPIO_Obj_")
   10735                      .dwattr $C$DW$T$42, DW_AT_byte_size(0x6a)
   10736              $C$DW$1894      .dwtag  DW_TAG_member
   10737                      .dwattr $C$DW$1894, DW_AT_type(*$C$DW$T$39)
TMS320C2000 Assembler PC v6.2.5 Fri Oct 13 15:05:15 2017

Tools Copyright (c) 1996-2014 Texas Instruments Incorporated
C:\Users\wmj\AppData\Local\Temp\1509611                              PAGE  206

   10738                      .dwattr $C$DW$1894, DW_AT_name("GPACTRL")
   10739                      .dwattr $C$DW$1894, DW_AT_TI_symbol_name("_GPACTRL")
   10740                      .dwattr $C$DW$1894, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
   10741                      .dwattr $C$DW$1894, DW_AT_accessibility(DW_ACCESS_public)
   10742              $C$DW$1895      .dwtag  DW_TAG_member
   10743                      .dwattr $C$DW$1895, DW_AT_type(*$C$DW$T$39)
   10744                      .dwattr $C$DW$1895, DW_AT_name("GPAQSEL1")
   10745                      .dwattr $C$DW$1895, DW_AT_TI_symbol_name("_GPAQSEL1")
   10746                      .dwattr $C$DW$1895, DW_AT_data_member_location[DW_OP_plus_uconst 0x2]
   10747                      .dwattr $C$DW$1895, DW_AT_accessibility(DW_ACCESS_public)
   10748              $C$DW$1896      .dwtag  DW_TAG_member
   10749                      .dwattr $C$DW$1896, DW_AT_type(*$C$DW$T$39)
   10750                      .dwattr $C$DW$1896, DW_AT_name("GPAQSEL2")
   10751                      .dwattr $C$DW$1896, DW_AT_TI_symbol_name("_GPAQSEL2")
   10752                      .dwattr $C$DW$1896, DW_AT_data_member_location[DW_OP_plus_uconst 0x4]
   10753                      .dwattr $C$DW$1896, DW_AT_accessibility(DW_ACCESS_public)
   10754              $C$DW$1897      .dwtag  DW_TAG_member
   10755                      .dwattr $C$DW$1897, DW_AT_type(*$C$DW$T$39)
   10756                      .dwattr $C$DW$1897, DW_AT_name("GPAMUX1")
   10757                      .dwattr $C$DW$1897, DW_AT_TI_symbol_name("_GPAMUX1")
   10758                      .dwattr $C$DW$1897, DW_AT_data_member_location[DW_OP_plus_uconst 0x6]
   10759                      .dwattr $C$DW$1897, DW_AT_accessibility(DW_ACCESS_public)
   10760              $C$DW$1898      .dwtag  DW_TAG_member
   10761                      .dwattr $C$DW$1898, DW_AT_type(*$C$DW$T$39)
   10762                      .dwattr $C$DW$1898, DW_AT_name("GPAMUX2")
   10763                      .dwattr $C$DW$1898, DW_AT_TI_symbol_name("_GPAMUX2")
   10764                      .dwattr $C$DW$1898, DW_AT_data_member_location[DW_OP_plus_uconst 0x8]
   10765                      .dwattr $C$DW$1898, DW_AT_accessibility(DW_ACCESS_public)
   10766              $C$DW$1899      .dwtag  DW_TAG_member
   10767                      .dwattr $C$DW$1899, DW_AT_type(*$C$DW$T$39)
   10768                      .dwattr $C$DW$1899, DW_AT_name("GPADIR")
   10769                      .dwattr $C$DW$1899, DW_AT_TI_symbol_name("_GPADIR")
   10770                      .dwattr $C$DW$1899, DW_AT_data_member_location[DW_OP_plus_uconst 0xa]
   10771                      .dwattr $C$DW$1899, DW_AT_accessibility(DW_ACCESS_public)
   10772              $C$DW$1900      .dwtag  DW_TAG_member
   10773                      .dwattr $C$DW$1900, DW_AT_type(*$C$DW$T$39)
   10774                      .dwattr $C$DW$1900, DW_AT_name("GPAPUD")
   10775                      .dwattr $C$DW$1900, DW_AT_TI_symbol_name("_GPAPUD")
   10776                      .dwattr $C$DW$1900, DW_AT_data_member_location[DW_OP_plus_uconst 0xc]
   10777                      .dwattr $C$DW$1900, DW_AT_accessibility(DW_ACCESS_public)
   10778              $C$DW$1901      .dwtag  DW_TAG_member
   10779                      .dwattr $C$DW$1901, DW_AT_type(*$C$DW$T$26)
   10780                      .dwattr $C$DW$1901, DW_AT_name("rsvd_1")
   10781                      .dwattr $C$DW$1901, DW_AT_TI_symbol_name("_rsvd_1")
   10782                      .dwattr $C$DW$1901, DW_AT_data_member_location[DW_OP_plus_uconst 0xe]
   10783                      .dwattr $C$DW$1901, DW_AT_accessibility(DW_ACCESS_public)
   10784              $C$DW$1902      .dwtag  DW_TAG_member
   10785                      .dwattr $C$DW$1902, DW_AT_type(*$C$DW$T$39)
   10786                      .dwattr $C$DW$1902, DW_AT_name("GPBCTRL")
   10787                      .dwattr $C$DW$1902, DW_AT_TI_symbol_name("_GPBCTRL")
   10788                      .dwattr $C$DW$1902, DW_AT_data_member_location[DW_OP_plus_uconst 0x10]
   10789                      .dwattr $C$DW$1902, DW_AT_accessibility(DW_ACCESS_public)
   10790              $C$DW$1903      .dwtag  DW_TAG_member
   10791                      .dwattr $C$DW$1903, DW_AT_type(*$C$DW$T$39)
   10792                      .dwattr $C$DW$1903, DW_AT_name("GPBQSEL1")
TMS320C2000 Assembler PC v6.2.5 Fri Oct 13 15:05:15 2017

Tools Copyright (c) 1996-2014 Texas Instruments Incorporated
C:\Users\wmj\AppData\Local\Temp\1509611                              PAGE  207

   10793                      .dwattr $C$DW$1903, DW_AT_TI_symbol_name("_GPBQSEL1")
   10794                      .dwattr $C$DW$1903, DW_AT_data_member_location[DW_OP_plus_uconst 0x12]
   10795                      .dwattr $C$DW$1903, DW_AT_accessibility(DW_ACCESS_public)
   10796              $C$DW$1904      .dwtag  DW_TAG_member
   10797                      .dwattr $C$DW$1904, DW_AT_type(*$C$DW$T$26)
   10798                      .dwattr $C$DW$1904, DW_AT_name("rsvd_2")
   10799                      .dwattr $C$DW$1904, DW_AT_TI_symbol_name("_rsvd_2")
   10800                      .dwattr $C$DW$1904, DW_AT_data_member_location[DW_OP_plus_uconst 0x14]
   10801                      .dwattr $C$DW$1904, DW_AT_accessibility(DW_ACCESS_public)
   10802              $C$DW$1905      .dwtag  DW_TAG_member
   10803                      .dwattr $C$DW$1905, DW_AT_type(*$C$DW$T$39)
   10804                      .dwattr $C$DW$1905, DW_AT_name("GPBMUX1")
   10805                      .dwattr $C$DW$1905, DW_AT_TI_symbol_name("_GPBMUX1")
   10806                      .dwattr $C$DW$1905, DW_AT_data_member_location[DW_OP_plus_uconst 0x16]
   10807                      .dwattr $C$DW$1905, DW_AT_accessibility(DW_ACCESS_public)
   10808              $C$DW$1906      .dwtag  DW_TAG_member
   10809                      .dwattr $C$DW$1906, DW_AT_type(*$C$DW$T$26)
   10810                      .dwattr $C$DW$1906, DW_AT_name("rsvd_3")
   10811                      .dwattr $C$DW$1906, DW_AT_TI_symbol_name("_rsvd_3")
   10812                      .dwattr $C$DW$1906, DW_AT_data_member_location[DW_OP_plus_uconst 0x18]
   10813                      .dwattr $C$DW$1906, DW_AT_accessibility(DW_ACCESS_public)
   10814              $C$DW$1907      .dwtag  DW_TAG_member
   10815                      .dwattr $C$DW$1907, DW_AT_type(*$C$DW$T$39)
   10816                      .dwattr $C$DW$1907, DW_AT_name("GPBDIR")
   10817                      .dwattr $C$DW$1907, DW_AT_TI_symbol_name("_GPBDIR")
   10818                      .dwattr $C$DW$1907, DW_AT_data_member_location[DW_OP_plus_uconst 0x1a]
   10819                      .dwattr $C$DW$1907, DW_AT_accessibility(DW_ACCESS_public)
   10820              $C$DW$1908      .dwtag  DW_TAG_member
   10821                      .dwattr $C$DW$1908, DW_AT_type(*$C$DW$T$39)
   10822                      .dwattr $C$DW$1908, DW_AT_name("GPBPUD")
   10823                      .dwattr $C$DW$1908, DW_AT_TI_symbol_name("_GPBPUD")
   10824                      .dwattr $C$DW$1908, DW_AT_data_member_location[DW_OP_plus_uconst 0x1c]
   10825                      .dwattr $C$DW$1908, DW_AT_accessibility(DW_ACCESS_public)
   10826              $C$DW$1909      .dwtag  DW_TAG_member
   10827                      .dwattr $C$DW$1909, DW_AT_type(*$C$DW$T$40)
   10828                      .dwattr $C$DW$1909, DW_AT_name("rsvd_4")
   10829                      .dwattr $C$DW$1909, DW_AT_TI_symbol_name("_rsvd_4")
   10830                      .dwattr $C$DW$1909, DW_AT_data_member_location[DW_OP_plus_uconst 0x1e]
   10831                      .dwattr $C$DW$1909, DW_AT_accessibility(DW_ACCESS_public)
   10832              $C$DW$1910      .dwtag  DW_TAG_member
   10833                      .dwattr $C$DW$1910, DW_AT_type(*$C$DW$T$39)
   10834                      .dwattr $C$DW$1910, DW_AT_name("AIOMUX1")
   10835                      .dwattr $C$DW$1910, DW_AT_TI_symbol_name("_AIOMUX1")
   10836                      .dwattr $C$DW$1910, DW_AT_data_member_location[DW_OP_plus_uconst 0x36]
   10837                      .dwattr $C$DW$1910, DW_AT_accessibility(DW_ACCESS_public)
   10838              $C$DW$1911      .dwtag  DW_TAG_member
   10839                      .dwattr $C$DW$1911, DW_AT_type(*$C$DW$T$26)
   10840                      .dwattr $C$DW$1911, DW_AT_name("rsvd_5")
   10841                      .dwattr $C$DW$1911, DW_AT_TI_symbol_name("_rsvd_5")
   10842                      .dwattr $C$DW$1911, DW_AT_data_member_location[DW_OP_plus_uconst 0x38]
   10843                      .dwattr $C$DW$1911, DW_AT_accessibility(DW_ACCESS_public)
   10844              $C$DW$1912      .dwtag  DW_TAG_member
   10845                      .dwattr $C$DW$1912, DW_AT_type(*$C$DW$T$39)
   10846                      .dwattr $C$DW$1912, DW_AT_name("AIODIR")
   10847                      .dwattr $C$DW$1912, DW_AT_TI_symbol_name("_AIODIR")
TMS320C2000 Assembler PC v6.2.5 Fri Oct 13 15:05:15 2017

Tools Copyright (c) 1996-2014 Texas Instruments Incorporated
C:\Users\wmj\AppData\Local\Temp\1509611                              PAGE  208

   10848                      .dwattr $C$DW$1912, DW_AT_data_member_location[DW_OP_plus_uconst 0x3a]
   10849                      .dwattr $C$DW$1912, DW_AT_accessibility(DW_ACCESS_public)
   10850              $C$DW$1913      .dwtag  DW_TAG_member
   10851                      .dwattr $C$DW$1913, DW_AT_type(*$C$DW$T$41)
   10852                      .dwattr $C$DW$1913, DW_AT_name("rsvd_6")
   10853                      .dwattr $C$DW$1913, DW_AT_TI_symbol_name("_rsvd_6")
   10854                      .dwattr $C$DW$1913, DW_AT_data_member_location[DW_OP_plus_uconst 0x3c]
   10855                      .dwattr $C$DW$1913, DW_AT_accessibility(DW_ACCESS_public)
   10856              $C$DW$1914      .dwtag  DW_TAG_member
   10857                      .dwattr $C$DW$1914, DW_AT_type(*$C$DW$T$39)
   10858                      .dwattr $C$DW$1914, DW_AT_name("GPADAT")
   10859                      .dwattr $C$DW$1914, DW_AT_TI_symbol_name("_GPADAT")
   10860                      .dwattr $C$DW$1914, DW_AT_data_member_location[DW_OP_plus_uconst 0x40]
   10861                      .dwattr $C$DW$1914, DW_AT_accessibility(DW_ACCESS_public)
   10862              $C$DW$1915      .dwtag  DW_TAG_member
   10863                      .dwattr $C$DW$1915, DW_AT_type(*$C$DW$T$39)
   10864                      .dwattr $C$DW$1915, DW_AT_name("GPASET")
   10865                      .dwattr $C$DW$1915, DW_AT_TI_symbol_name("_GPASET")
   10866                      .dwattr $C$DW$1915, DW_AT_data_member_location[DW_OP_plus_uconst 0x42]
   10867                      .dwattr $C$DW$1915, DW_AT_accessibility(DW_ACCESS_public)
   10868              $C$DW$1916      .dwtag  DW_TAG_member
   10869                      .dwattr $C$DW$1916, DW_AT_type(*$C$DW$T$39)
   10870                      .dwattr $C$DW$1916, DW_AT_name("GPACLEAR")
   10871                      .dwattr $C$DW$1916, DW_AT_TI_symbol_name("_GPACLEAR")
   10872                      .dwattr $C$DW$1916, DW_AT_data_member_location[DW_OP_plus_uconst 0x44]
   10873                      .dwattr $C$DW$1916, DW_AT_accessibility(DW_ACCESS_public)
   10874              $C$DW$1917      .dwtag  DW_TAG_member
   10875                      .dwattr $C$DW$1917, DW_AT_type(*$C$DW$T$39)
   10876                      .dwattr $C$DW$1917, DW_AT_name("GPATOGGLE")
   10877                      .dwattr $C$DW$1917, DW_AT_TI_symbol_name("_GPATOGGLE")
   10878                      .dwattr $C$DW$1917, DW_AT_data_member_location[DW_OP_plus_uconst 0x46]
   10879                      .dwattr $C$DW$1917, DW_AT_accessibility(DW_ACCESS_public)
   10880              $C$DW$1918      .dwtag  DW_TAG_member
   10881                      .dwattr $C$DW$1918, DW_AT_type(*$C$DW$T$39)
   10882                      .dwattr $C$DW$1918, DW_AT_name("GPBDAT")
   10883                      .dwattr $C$DW$1918, DW_AT_TI_symbol_name("_GPBDAT")
   10884                      .dwattr $C$DW$1918, DW_AT_data_member_location[DW_OP_plus_uconst 0x48]
   10885                      .dwattr $C$DW$1918, DW_AT_accessibility(DW_ACCESS_public)
   10886              $C$DW$1919      .dwtag  DW_TAG_member
   10887                      .dwattr $C$DW$1919, DW_AT_type(*$C$DW$T$39)
   10888                      .dwattr $C$DW$1919, DW_AT_name("GPBSET")
   10889                      .dwattr $C$DW$1919, DW_AT_TI_symbol_name("_GPBSET")
   10890                      .dwattr $C$DW$1919, DW_AT_data_member_location[DW_OP_plus_uconst 0x4a]
   10891                      .dwattr $C$DW$1919, DW_AT_accessibility(DW_ACCESS_public)
   10892              $C$DW$1920      .dwtag  DW_TAG_member
   10893                      .dwattr $C$DW$1920, DW_AT_type(*$C$DW$T$39)
   10894                      .dwattr $C$DW$1920, DW_AT_name("GPBCLEAR")
   10895                      .dwattr $C$DW$1920, DW_AT_TI_symbol_name("_GPBCLEAR")
   10896                      .dwattr $C$DW$1920, DW_AT_data_member_location[DW_OP_plus_uconst 0x4c]
   10897                      .dwattr $C$DW$1920, DW_AT_accessibility(DW_ACCESS_public)
   10898              $C$DW$1921      .dwtag  DW_TAG_member
   10899                      .dwattr $C$DW$1921, DW_AT_type(*$C$DW$T$39)
   10900                      .dwattr $C$DW$1921, DW_AT_name("GPBTOGGLE")
   10901                      .dwattr $C$DW$1921, DW_AT_TI_symbol_name("_GPBTOGGLE")
   10902                      .dwattr $C$DW$1921, DW_AT_data_member_location[DW_OP_plus_uconst 0x4e]
TMS320C2000 Assembler PC v6.2.5 Fri Oct 13 15:05:15 2017

Tools Copyright (c) 1996-2014 Texas Instruments Incorporated
C:\Users\wmj\AppData\Local\Temp\1509611                              PAGE  209

   10903                      .dwattr $C$DW$1921, DW_AT_accessibility(DW_ACCESS_public)
   10904              $C$DW$1922      .dwtag  DW_TAG_member
   10905                      .dwattr $C$DW$1922, DW_AT_type(*$C$DW$T$31)
   10906                      .dwattr $C$DW$1922, DW_AT_name("rsvd_7")
   10907                      .dwattr $C$DW$1922, DW_AT_TI_symbol_name("_rsvd_7")
   10908                      .dwattr $C$DW$1922, DW_AT_data_member_location[DW_OP_plus_uconst 0x50]
   10909                      .dwattr $C$DW$1922, DW_AT_accessibility(DW_ACCESS_public)
   10910              $C$DW$1923      .dwtag  DW_TAG_member
   10911                      .dwattr $C$DW$1923, DW_AT_type(*$C$DW$T$39)
   10912                      .dwattr $C$DW$1923, DW_AT_name("AIODAT")
   10913                      .dwattr $C$DW$1923, DW_AT_TI_symbol_name("_AIODAT")
   10914                      .dwattr $C$DW$1923, DW_AT_data_member_location[DW_OP_plus_uconst 0x58]
   10915                      .dwattr $C$DW$1923, DW_AT_accessibility(DW_ACCESS_public)
   10916              $C$DW$1924      .dwtag  DW_TAG_member
   10917                      .dwattr $C$DW$1924, DW_AT_type(*$C$DW$T$39)
   10918                      .dwattr $C$DW$1924, DW_AT_name("AIOSET")
   10919                      .dwattr $C$DW$1924, DW_AT_TI_symbol_name("_AIOSET")
   10920                      .dwattr $C$DW$1924, DW_AT_data_member_location[DW_OP_plus_uconst 0x5a]
   10921                      .dwattr $C$DW$1924, DW_AT_accessibility(DW_ACCESS_public)
   10922              $C$DW$1925      .dwtag  DW_TAG_member
   10923                      .dwattr $C$DW$1925, DW_AT_type(*$C$DW$T$39)
   10924                      .dwattr $C$DW$1925, DW_AT_name("AIOCLEAR")
   10925                      .dwattr $C$DW$1925, DW_AT_TI_symbol_name("_AIOCLEAR")
   10926                      .dwattr $C$DW$1925, DW_AT_data_member_location[DW_OP_plus_uconst 0x5c]
   10927                      .dwattr $C$DW$1925, DW_AT_accessibility(DW_ACCESS_public)
   10928              $C$DW$1926      .dwtag  DW_TAG_member
   10929                      .dwattr $C$DW$1926, DW_AT_type(*$C$DW$T$39)
   10930                      .dwattr $C$DW$1926, DW_AT_name("AIOTOGGLE")
   10931                      .dwattr $C$DW$1926, DW_AT_TI_symbol_name("_AIOTOGGLE")
   10932                      .dwattr $C$DW$1926, DW_AT_data_member_location[DW_OP_plus_uconst 0x5e]
   10933                      .dwattr $C$DW$1926, DW_AT_accessibility(DW_ACCESS_public)
   10934              $C$DW$1927      .dwtag  DW_TAG_member
   10935                      .dwattr $C$DW$1927, DW_AT_type(*$C$DW$T$28)
   10936                      .dwattr $C$DW$1927, DW_AT_name("GPIOXINTnSEL")
   10937                      .dwattr $C$DW$1927, DW_AT_TI_symbol_name("_GPIOXINTnSEL")
   10938                      .dwattr $C$DW$1927, DW_AT_data_member_location[DW_OP_plus_uconst 0x60]
   10939                      .dwattr $C$DW$1927, DW_AT_accessibility(DW_ACCESS_public)
   10940              $C$DW$1928      .dwtag  DW_TAG_member
   10941                      .dwattr $C$DW$1928, DW_AT_type(*$C$DW$T$27)
   10942                      .dwattr $C$DW$1928, DW_AT_name("rsvd_8")
   10943                      .dwattr $C$DW$1928, DW_AT_TI_symbol_name("_rsvd_8")
   10944                      .dwattr $C$DW$1928, DW_AT_data_member_location[DW_OP_plus_uconst 0x63]
   10945                      .dwattr $C$DW$1928, DW_AT_accessibility(DW_ACCESS_public)
   10946              $C$DW$1929      .dwtag  DW_TAG_member
   10947                      .dwattr $C$DW$1929, DW_AT_type(*$C$DW$T$39)
   10948                      .dwattr $C$DW$1929, DW_AT_name("GPIOLPMSEL")
   10949                      .dwattr $C$DW$1929, DW_AT_TI_symbol_name("_GPIOLPMSEL")
   10950                      .dwattr $C$DW$1929, DW_AT_data_member_location[DW_OP_plus_uconst 0x68]
   10951                      .dwattr $C$DW$1929, DW_AT_accessibility(DW_ACCESS_public)
   10952                      .dwendtag $C$DW$T$42
   10953              
   10954              $C$DW$T$58      .dwtag  DW_TAG_pointer_type
   10955                      .dwattr $C$DW$T$58, DW_AT_type(*$C$DW$T$42)
   10956                      .dwattr $C$DW$T$58, DW_AT_address_class(0x16)
   10957              $C$DW$T$59      .dwtag  DW_TAG_typedef, DW_AT_name("GPIO_Handle")
TMS320C2000 Assembler PC v6.2.5 Fri Oct 13 15:05:15 2017

Tools Copyright (c) 1996-2014 Texas Instruments Incorporated
C:\Users\wmj\AppData\Local\Temp\1509611                              PAGE  210

   10958                      .dwattr $C$DW$T$59, DW_AT_type(*$C$DW$T$58)
   10959                      .dwattr $C$DW$T$59, DW_AT_language(DW_LANG_C)
   10960              
   10961              $C$DW$T$44      .dwtag  DW_TAG_structure_type
   10962                      .dwattr $C$DW$T$44, DW_AT_name("_HAL_AdcData_t_")
   10963                      .dwattr $C$DW$T$44, DW_AT_byte_size(0x16)
   10964              $C$DW$1930      .dwtag  DW_TAG_member
   10965                      .dwattr $C$DW$1930, DW_AT_type(*$C$DW$T$43)
   10966                      .dwattr $C$DW$1930, DW_AT_name("I")
   10967                      .dwattr $C$DW$1930, DW_AT_TI_symbol_name("_I")
   10968                      .dwattr $C$DW$1930, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
   10969                      .dwattr $C$DW$1930, DW_AT_accessibility(DW_ACCESS_public)
   10970              $C$DW$1931      .dwtag  DW_TAG_member
   10971                      .dwattr $C$DW$1931, DW_AT_type(*$C$DW$T$43)
   10972                      .dwattr $C$DW$1931, DW_AT_name("V")
   10973                      .dwattr $C$DW$1931, DW_AT_TI_symbol_name("_V")
   10974                      .dwattr $C$DW$1931, DW_AT_data_member_location[DW_OP_plus_uconst 0x6]
   10975                      .dwattr $C$DW$1931, DW_AT_accessibility(DW_ACCESS_public)
   10976              $C$DW$1932      .dwtag  DW_TAG_member
   10977                      .dwattr $C$DW$1932, DW_AT_type(*$C$DW$T$35)
   10978                      .dwattr $C$DW$1932, DW_AT_name("dcBus")
   10979                      .dwattr $C$DW$1932, DW_AT_TI_symbol_name("_dcBus")
   10980                      .dwattr $C$DW$1932, DW_AT_data_member_location[DW_OP_plus_uconst 0xc]
   10981                      .dwattr $C$DW$1932, DW_AT_accessibility(DW_ACCESS_public)
   10982              $C$DW$1933      .dwtag  DW_TAG_member
   10983                      .dwattr $C$DW$1933, DW_AT_type(*$C$DW$T$35)
   10984                      .dwattr $C$DW$1933, DW_AT_name("analogSensor1")
   10985                      .dwattr $C$DW$1933, DW_AT_TI_symbol_name("_analogSensor1")
   10986                      .dwattr $C$DW$1933, DW_AT_data_member_location[DW_OP_plus_uconst 0xe]
   10987                      .dwattr $C$DW$1933, DW_AT_accessibility(DW_ACCESS_public)
   10988              $C$DW$1934      .dwtag  DW_TAG_member
   10989                      .dwattr $C$DW$1934, DW_AT_type(*$C$DW$T$35)
   10990                      .dwattr $C$DW$1934, DW_AT_name("analogSensor2")
   10991                      .dwattr $C$DW$1934, DW_AT_TI_symbol_name("_analogSensor2")
   10992                      .dwattr $C$DW$1934, DW_AT_data_member_location[DW_OP_plus_uconst 0x10]
   10993                      .dwattr $C$DW$1934, DW_AT_accessibility(DW_ACCESS_public)
   10994              $C$DW$1935      .dwtag  DW_TAG_member
   10995                      .dwattr $C$DW$1935, DW_AT_type(*$C$DW$T$35)
   10996                      .dwattr $C$DW$1935, DW_AT_name("igbtNTC")
   10997                      .dwattr $C$DW$1935, DW_AT_TI_symbol_name("_igbtNTC")
   10998                      .dwattr $C$DW$1935, DW_AT_data_member_location[DW_OP_plus_uconst 0x12]
   10999                      .dwattr $C$DW$1935, DW_AT_accessibility(DW_ACCESS_public)
   11000              $C$DW$1936      .dwtag  DW_TAG_member
   11001                      .dwattr $C$DW$1936, DW_AT_type(*$C$DW$T$35)
   11002                      .dwattr $C$DW$1936, DW_AT_name("boardAddr")
   11003                      .dwattr $C$DW$1936, DW_AT_TI_symbol_name("_boardAddr")
   11004                      .dwattr $C$DW$1936, DW_AT_data_member_location[DW_OP_plus_uconst 0x14]
   11005                      .dwattr $C$DW$1936, DW_AT_accessibility(DW_ACCESS_public)
   11006                      .dwendtag $C$DW$T$44
   11007              
   11008              $C$DW$T$87      .dwtag  DW_TAG_typedef, DW_AT_name("HAL_AdcData_t")
   11009                      .dwattr $C$DW$T$87, DW_AT_type(*$C$DW$T$44)
   11010                      .dwattr $C$DW$T$87, DW_AT_language(DW_LANG_C)
   11011              
   11012              $C$DW$T$49      .dwtag  DW_TAG_structure_type
TMS320C2000 Assembler PC v6.2.5 Fri Oct 13 15:05:15 2017

Tools Copyright (c) 1996-2014 Texas Instruments Incorporated
C:\Users\wmj\AppData\Local\Temp\1509611                              PAGE  211

   11013                      .dwattr $C$DW$T$49, DW_AT_name("_HAL_DacData_t_")
   11014                      .dwattr $C$DW$T$49, DW_AT_byte_size(0x22)
   11015              $C$DW$1937      .dwtag  DW_TAG_member
   11016                      .dwattr $C$DW$1937, DW_AT_type(*$C$DW$T$22)
   11017                      .dwattr $C$DW$1937, DW_AT_name("PeriodMax")
   11018                      .dwattr $C$DW$1937, DW_AT_TI_symbol_name("_PeriodMax")
   11019                      .dwattr $C$DW$1937, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
   11020                      .dwattr $C$DW$1937, DW_AT_accessibility(DW_ACCESS_public)
   11021              $C$DW$1938      .dwtag  DW_TAG_member
   11022                      .dwattr $C$DW$1938, DW_AT_type(*$C$DW$T$47)
   11023                      .dwattr $C$DW$1938, DW_AT_name("ptrData")
   11024                      .dwattr $C$DW$1938, DW_AT_TI_symbol_name("_ptrData")
   11025                      .dwattr $C$DW$1938, DW_AT_data_member_location[DW_OP_plus_uconst 0x2]
   11026                      .dwattr $C$DW$1938, DW_AT_accessibility(DW_ACCESS_public)
   11027              $C$DW$1939      .dwtag  DW_TAG_member
   11028                      .dwattr $C$DW$1939, DW_AT_type(*$C$DW$T$48)
   11029                      .dwattr $C$DW$1939, DW_AT_name("value")
   11030                      .dwattr $C$DW$1939, DW_AT_TI_symbol_name("_value")
   11031                      .dwattr $C$DW$1939, DW_AT_data_member_location[DW_OP_plus_uconst 0xa]
   11032                      .dwattr $C$DW$1939, DW_AT_accessibility(DW_ACCESS_public)
   11033              $C$DW$1940      .dwtag  DW_TAG_member
   11034                      .dwattr $C$DW$1940, DW_AT_type(*$C$DW$T$48)
   11035                      .dwattr $C$DW$1940, DW_AT_name("offset")
   11036                      .dwattr $C$DW$1940, DW_AT_TI_symbol_name("_offset")
   11037                      .dwattr $C$DW$1940, DW_AT_data_member_location[DW_OP_plus_uconst 0x12]
   11038                      .dwattr $C$DW$1940, DW_AT_accessibility(DW_ACCESS_public)
   11039              $C$DW$1941      .dwtag  DW_TAG_member
   11040                      .dwattr $C$DW$1941, DW_AT_type(*$C$DW$T$48)
   11041                      .dwattr $C$DW$1941, DW_AT_name("gain")
   11042                      .dwattr $C$DW$1941, DW_AT_TI_symbol_name("_gain")
   11043                      .dwattr $C$DW$1941, DW_AT_data_member_location[DW_OP_plus_uconst 0x1a]
   11044                      .dwattr $C$DW$1941, DW_AT_accessibility(DW_ACCESS_public)
   11045                      .dwendtag $C$DW$T$49
   11046              
   11047              $C$DW$T$357     .dwtag  DW_TAG_typedef, DW_AT_name("HAL_DacData_t")
   11048                      .dwattr $C$DW$T$357, DW_AT_type(*$C$DW$T$49)
   11049                      .dwattr $C$DW$T$357, DW_AT_language(DW_LANG_C)
   11050              $C$DW$T$358     .dwtag  DW_TAG_pointer_type
   11051                      .dwattr $C$DW$T$358, DW_AT_type(*$C$DW$T$357)
   11052                      .dwattr $C$DW$T$358, DW_AT_address_class(0x16)
   11053              $C$DW$1942      .dwtag  DW_TAG_TI_far_type
   11054                      .dwattr $C$DW$1942, DW_AT_type(*$C$DW$T$358)
   11055              $C$DW$T$359     .dwtag  DW_TAG_const_type
   11056                      .dwattr $C$DW$T$359, DW_AT_type(*$C$DW$1942)
   11057              
   11058              $C$DW$T$93      .dwtag  DW_TAG_structure_type
   11059                      .dwattr $C$DW$T$93, DW_AT_name("_HAL_Obj_")
   11060                      .dwattr $C$DW$T$93, DW_AT_byte_size(0xbe)
   11061              $C$DW$1943      .dwtag  DW_TAG_member
   11062                      .dwattr $C$DW$1943, DW_AT_type(*$C$DW$T$51)
   11063                      .dwattr $C$DW$1943, DW_AT_name("adcHandle")
   11064                      .dwattr $C$DW$1943, DW_AT_TI_symbol_name("_adcHandle")
   11065                      .dwattr $C$DW$1943, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
   11066                      .dwattr $C$DW$1943, DW_AT_accessibility(DW_ACCESS_public)
   11067              $C$DW$1944      .dwtag  DW_TAG_member
TMS320C2000 Assembler PC v6.2.5 Fri Oct 13 15:05:15 2017

Tools Copyright (c) 1996-2014 Texas Instruments Incorporated
C:\Users\wmj\AppData\Local\Temp\1509611                              PAGE  212

   11068                      .dwattr $C$DW$1944, DW_AT_type(*$C$DW$T$53)
   11069                      .dwattr $C$DW$1944, DW_AT_name("clkHandle")
   11070                      .dwattr $C$DW$1944, DW_AT_TI_symbol_name("_clkHandle")
   11071                      .dwattr $C$DW$1944, DW_AT_data_member_location[DW_OP_plus_uconst 0x2]
   11072                      .dwattr $C$DW$1944, DW_AT_accessibility(DW_ACCESS_public)
   11073              $C$DW$1945      .dwtag  DW_TAG_member
   11074                      .dwattr $C$DW$1945, DW_AT_type(*$C$DW$T$55)
   11075                      .dwattr $C$DW$1945, DW_AT_name("cpuHandle")
   11076                      .dwattr $C$DW$1945, DW_AT_TI_symbol_name("_cpuHandle")
   11077                      .dwattr $C$DW$1945, DW_AT_data_member_location[DW_OP_plus_uconst 0x4]
   11078                      .dwattr $C$DW$1945, DW_AT_accessibility(DW_ACCESS_public)
   11079              $C$DW$1946      .dwtag  DW_TAG_member
   11080                      .dwattr $C$DW$1946, DW_AT_type(*$C$DW$T$57)
   11081                      .dwattr $C$DW$1946, DW_AT_name("flashHandle")
   11082                      .dwattr $C$DW$1946, DW_AT_TI_symbol_name("_flashHandle")
   11083                      .dwattr $C$DW$1946, DW_AT_data_member_location[DW_OP_plus_uconst 0x6]
   11084                      .dwattr $C$DW$1946, DW_AT_accessibility(DW_ACCESS_public)
   11085              $C$DW$1947      .dwtag  DW_TAG_member
   11086                      .dwattr $C$DW$1947, DW_AT_type(*$C$DW$T$59)
   11087                      .dwattr $C$DW$1947, DW_AT_name("gpioHandle")
   11088                      .dwattr $C$DW$1947, DW_AT_TI_symbol_name("_gpioHandle")
   11089                      .dwattr $C$DW$1947, DW_AT_data_member_location[DW_OP_plus_uconst 0x8]
   11090                      .dwattr $C$DW$1947, DW_AT_accessibility(DW_ACCESS_public)
   11091              $C$DW$1948      .dwtag  DW_TAG_member
   11092                      .dwattr $C$DW$1948, DW_AT_type(*$C$DW$T$62)
   11093                      .dwattr $C$DW$1948, DW_AT_name("offsetHandle_I")
   11094                      .dwattr $C$DW$1948, DW_AT_TI_symbol_name("_offsetHandle_I")
   11095                      .dwattr $C$DW$1948, DW_AT_data_member_location[DW_OP_plus_uconst 0xa]
   11096                      .dwattr $C$DW$1948, DW_AT_accessibility(DW_ACCESS_public)
   11097              $C$DW$1949      .dwtag  DW_TAG_member
   11098                      .dwattr $C$DW$1949, DW_AT_type(*$C$DW$T$64)
   11099                      .dwattr $C$DW$1949, DW_AT_name("offset_I")
   11100                      .dwattr $C$DW$1949, DW_AT_TI_symbol_name("_offset_I")
   11101                      .dwattr $C$DW$1949, DW_AT_data_member_location[DW_OP_plus_uconst 0x10]
   11102                      .dwattr $C$DW$1949, DW_AT_accessibility(DW_ACCESS_public)
   11103              $C$DW$1950      .dwtag  DW_TAG_member
   11104                      .dwattr $C$DW$1950, DW_AT_type(*$C$DW$T$62)
   11105                      .dwattr $C$DW$1950, DW_AT_name("offsetHandle_V")
   11106                      .dwattr $C$DW$1950, DW_AT_TI_symbol_name("_offsetHandle_V")
   11107                      .dwattr $C$DW$1950, DW_AT_data_member_location[DW_OP_plus_uconst 0x40]
   11108                      .dwattr $C$DW$1950, DW_AT_accessibility(DW_ACCESS_public)
   11109              $C$DW$1951      .dwtag  DW_TAG_member
   11110                      .dwattr $C$DW$1951, DW_AT_type(*$C$DW$T$64)
   11111                      .dwattr $C$DW$1951, DW_AT_name("offset_V")
   11112                      .dwattr $C$DW$1951, DW_AT_TI_symbol_name("_offset_V")
   11113                      .dwattr $C$DW$1951, DW_AT_data_member_location[DW_OP_plus_uconst 0x46]
   11114                      .dwattr $C$DW$1951, DW_AT_accessibility(DW_ACCESS_public)
   11115              $C$DW$1952      .dwtag  DW_TAG_member
   11116                      .dwattr $C$DW$1952, DW_AT_type(*$C$DW$T$66)
   11117                      .dwattr $C$DW$1952, DW_AT_name("oscHandle")
   11118                      .dwattr $C$DW$1952, DW_AT_TI_symbol_name("_oscHandle")
   11119                      .dwattr $C$DW$1952, DW_AT_data_member_location[DW_OP_plus_uconst 0x76]
   11120                      .dwattr $C$DW$1952, DW_AT_accessibility(DW_ACCESS_public)
   11121              $C$DW$1953      .dwtag  DW_TAG_member
   11122                      .dwattr $C$DW$1953, DW_AT_type(*$C$DW$T$68)
TMS320C2000 Assembler PC v6.2.5 Fri Oct 13 15:05:15 2017

Tools Copyright (c) 1996-2014 Texas Instruments Incorporated
C:\Users\wmj\AppData\Local\Temp\1509611                              PAGE  213

   11123                      .dwattr $C$DW$1953, DW_AT_name("pieHandle")
   11124                      .dwattr $C$DW$1953, DW_AT_TI_symbol_name("_pieHandle")
   11125                      .dwattr $C$DW$1953, DW_AT_data_member_location[DW_OP_plus_uconst 0x78]
   11126                      .dwattr $C$DW$1953, DW_AT_accessibility(DW_ACCESS_public)
   11127              $C$DW$1954      .dwtag  DW_TAG_member
   11128                      .dwattr $C$DW$1954, DW_AT_type(*$C$DW$T$70)
   11129                      .dwattr $C$DW$1954, DW_AT_name("pllHandle")
   11130                      .dwattr $C$DW$1954, DW_AT_TI_symbol_name("_pllHandle")
   11131                      .dwattr $C$DW$1954, DW_AT_data_member_location[DW_OP_plus_uconst 0x7a]
   11132                      .dwattr $C$DW$1954, DW_AT_accessibility(DW_ACCESS_public)
   11133              $C$DW$1955      .dwtag  DW_TAG_member
   11134                      .dwattr $C$DW$1955, DW_AT_type(*$C$DW$T$73)
   11135                      .dwattr $C$DW$1955, DW_AT_name("pwmHandle")
   11136                      .dwattr $C$DW$1955, DW_AT_TI_symbol_name("_pwmHandle")
   11137                      .dwattr $C$DW$1955, DW_AT_data_member_location[DW_OP_plus_uconst 0x7c]
   11138                      .dwattr $C$DW$1955, DW_AT_accessibility(DW_ACCESS_public)
   11139              $C$DW$1956      .dwtag  DW_TAG_member
   11140                      .dwattr $C$DW$1956, DW_AT_type(*$C$DW$T$73)
   11141                      .dwattr $C$DW$1956, DW_AT_name("pwmDacHandle")
   11142                      .dwattr $C$DW$1956, DW_AT_TI_symbol_name("_pwmDacHandle")
   11143                      .dwattr $C$DW$1956, DW_AT_data_member_location[DW_OP_plus_uconst 0x82]
   11144                      .dwattr $C$DW$1956, DW_AT_accessibility(DW_ACCESS_public)
   11145              $C$DW$1957      .dwtag  DW_TAG_member
   11146                      .dwattr $C$DW$1957, DW_AT_type(*$C$DW$T$75)
   11147                      .dwattr $C$DW$1957, DW_AT_name("pwrHandle")
   11148                      .dwattr $C$DW$1957, DW_AT_TI_symbol_name("_pwrHandle")
   11149                      .dwattr $C$DW$1957, DW_AT_data_member_location[DW_OP_plus_uconst 0x88]
   11150                      .dwattr $C$DW$1957, DW_AT_accessibility(DW_ACCESS_public)
   11151              $C$DW$1958      .dwtag  DW_TAG_member
   11152                      .dwattr $C$DW$1958, DW_AT_type(*$C$DW$T$78)
   11153                      .dwattr $C$DW$1958, DW_AT_name("timerHandle")
   11154                      .dwattr $C$DW$1958, DW_AT_TI_symbol_name("_timerHandle")
   11155                      .dwattr $C$DW$1958, DW_AT_data_member_location[DW_OP_plus_uconst 0x8a]
   11156                      .dwattr $C$DW$1958, DW_AT_accessibility(DW_ACCESS_public)
   11157              $C$DW$1959      .dwtag  DW_TAG_member
   11158                      .dwattr $C$DW$1959, DW_AT_type(*$C$DW$T$80)
   11159                      .dwattr $C$DW$1959, DW_AT_name("i2cHandle")
   11160                      .dwattr $C$DW$1959, DW_AT_TI_symbol_name("_i2cHandle")
   11161                      .dwattr $C$DW$1959, DW_AT_data_member_location[DW_OP_plus_uconst 0x90]
   11162                      .dwattr $C$DW$1959, DW_AT_accessibility(DW_ACCESS_public)
   11163              $C$DW$1960      .dwtag  DW_TAG_member
   11164                      .dwattr $C$DW$1960, DW_AT_type(*$C$DW$T$82)
   11165                      .dwattr $C$DW$1960, DW_AT_name("spiAHandle")
   11166                      .dwattr $C$DW$1960, DW_AT_TI_symbol_name("_spiAHandle")
   11167                      .dwattr $C$DW$1960, DW_AT_data_member_location[DW_OP_plus_uconst 0x92]
   11168                      .dwattr $C$DW$1960, DW_AT_accessibility(DW_ACCESS_public)
   11169              $C$DW$1961      .dwtag  DW_TAG_member
   11170                      .dwattr $C$DW$1961, DW_AT_type(*$C$DW$T$84)
   11171                      .dwattr $C$DW$1961, DW_AT_name("wdogHandle")
   11172                      .dwattr $C$DW$1961, DW_AT_TI_symbol_name("_wdogHandle")
   11173                      .dwattr $C$DW$1961, DW_AT_data_member_location[DW_OP_plus_uconst 0x94]
   11174                      .dwattr $C$DW$1961, DW_AT_accessibility(DW_ACCESS_public)
   11175              $C$DW$1962      .dwtag  DW_TAG_member
   11176                      .dwattr $C$DW$1962, DW_AT_type(*$C$DW$T$86)
   11177                      .dwattr $C$DW$1962, DW_AT_name("sciHandle")
TMS320C2000 Assembler PC v6.2.5 Fri Oct 13 15:05:15 2017

Tools Copyright (c) 1996-2014 Texas Instruments Incorporated
C:\Users\wmj\AppData\Local\Temp\1509611                              PAGE  214

   11178                      .dwattr $C$DW$1962, DW_AT_TI_symbol_name("_sciHandle")
   11179                      .dwattr $C$DW$1962, DW_AT_data_member_location[DW_OP_plus_uconst 0x96]
   11180                      .dwattr $C$DW$1962, DW_AT_accessibility(DW_ACCESS_public)
   11181              $C$DW$1963      .dwtag  DW_TAG_member
   11182                      .dwattr $C$DW$1963, DW_AT_type(*$C$DW$T$87)
   11183                      .dwattr $C$DW$1963, DW_AT_name("adcBias")
   11184                      .dwattr $C$DW$1963, DW_AT_TI_symbol_name("_adcBias")
   11185                      .dwattr $C$DW$1963, DW_AT_data_member_location[DW_OP_plus_uconst 0x98]
   11186                      .dwattr $C$DW$1963, DW_AT_accessibility(DW_ACCESS_public)
   11187              $C$DW$1964      .dwtag  DW_TAG_member
   11188                      .dwattr $C$DW$1964, DW_AT_type(*$C$DW$T$35)
   11189                      .dwattr $C$DW$1964, DW_AT_name("current_sf")
   11190                      .dwattr $C$DW$1964, DW_AT_TI_symbol_name("_current_sf")
   11191                      .dwattr $C$DW$1964, DW_AT_data_member_location[DW_OP_plus_uconst 0xae]
   11192                      .dwattr $C$DW$1964, DW_AT_accessibility(DW_ACCESS_public)
   11193              $C$DW$1965      .dwtag  DW_TAG_member
   11194                      .dwattr $C$DW$1965, DW_AT_type(*$C$DW$T$35)
   11195                      .dwattr $C$DW$1965, DW_AT_name("voltage_sf")
   11196                      .dwattr $C$DW$1965, DW_AT_TI_symbol_name("_voltage_sf")
   11197                      .dwattr $C$DW$1965, DW_AT_data_member_location[DW_OP_plus_uconst 0xb0]
   11198                      .dwattr $C$DW$1965, DW_AT_accessibility(DW_ACCESS_public)
   11199              $C$DW$1966      .dwtag  DW_TAG_member
   11200                      .dwattr $C$DW$1966, DW_AT_type(*$C$DW$T$33)
   11201                      .dwattr $C$DW$1966, DW_AT_name("numCurrentSensors")
   11202                      .dwattr $C$DW$1966, DW_AT_TI_symbol_name("_numCurrentSensors")
   11203                      .dwattr $C$DW$1966, DW_AT_data_member_location[DW_OP_plus_uconst 0xb2]
   11204                      .dwattr $C$DW$1966, DW_AT_accessibility(DW_ACCESS_public)
   11205              $C$DW$1967      .dwtag  DW_TAG_member
   11206                      .dwattr $C$DW$1967, DW_AT_type(*$C$DW$T$33)
   11207                      .dwattr $C$DW$1967, DW_AT_name("numVoltageSensors")
   11208                      .dwattr $C$DW$1967, DW_AT_TI_symbol_name("_numVoltageSensors")
   11209                      .dwattr $C$DW$1967, DW_AT_data_member_location[DW_OP_plus_uconst 0xb3]
   11210                      .dwattr $C$DW$1967, DW_AT_accessibility(DW_ACCESS_public)
   11211              $C$DW$1968      .dwtag  DW_TAG_member
   11212                      .dwattr $C$DW$1968, DW_AT_type(*$C$DW$T$89)
   11213                      .dwattr $C$DW$1968, DW_AT_name("boardAddress")
   11214                      .dwattr $C$DW$1968, DW_AT_TI_symbol_name("_boardAddress")
   11215                      .dwattr $C$DW$1968, DW_AT_data_member_location[DW_OP_plus_uconst 0xb4]
   11216                      .dwattr $C$DW$1968, DW_AT_accessibility(DW_ACCESS_public)
   11217              $C$DW$1969      .dwtag  DW_TAG_member
   11218                      .dwattr $C$DW$1969, DW_AT_type(*$C$DW$T$90)
   11219                      .dwattr $C$DW$1969, DW_AT_name("pca9555")
   11220                      .dwattr $C$DW$1969, DW_AT_TI_symbol_name("_pca9555")
   11221                      .dwattr $C$DW$1969, DW_AT_data_member_location[DW_OP_plus_uconst 0xb6]
   11222                      .dwattr $C$DW$1969, DW_AT_accessibility(DW_ACCESS_public)
   11223              $C$DW$1970      .dwtag  DW_TAG_member
   11224                      .dwattr $C$DW$1970, DW_AT_type(*$C$DW$T$92)
   11225                      .dwattr $C$DW$1970, DW_AT_name("pca955xHandle")
   11226                      .dwattr $C$DW$1970, DW_AT_TI_symbol_name("_pca955xHandle")
   11227                      .dwattr $C$DW$1970, DW_AT_data_member_location[DW_OP_plus_uconst 0xbc]
   11228                      .dwattr $C$DW$1970, DW_AT_accessibility(DW_ACCESS_public)
   11229                      .dwendtag $C$DW$T$93
   11230              
   11231              $C$DW$T$362     .dwtag  DW_TAG_typedef, DW_AT_name("HAL_Obj")
   11232                      .dwattr $C$DW$T$362, DW_AT_type(*$C$DW$T$93)
TMS320C2000 Assembler PC v6.2.5 Fri Oct 13 15:05:15 2017

Tools Copyright (c) 1996-2014 Texas Instruments Incorporated
C:\Users\wmj\AppData\Local\Temp\1509611                              PAGE  215

   11233                      .dwattr $C$DW$T$362, DW_AT_language(DW_LANG_C)
   11234              $C$DW$T$363     .dwtag  DW_TAG_pointer_type
   11235                      .dwattr $C$DW$T$363, DW_AT_type(*$C$DW$T$362)
   11236                      .dwattr $C$DW$T$363, DW_AT_address_class(0x16)
   11237              $C$DW$T$364     .dwtag  DW_TAG_pointer_type
   11238                      .dwattr $C$DW$T$364, DW_AT_type(*$C$DW$T$93)
   11239                      .dwattr $C$DW$T$364, DW_AT_address_class(0x16)
   11240              $C$DW$T$365     .dwtag  DW_TAG_typedef, DW_AT_name("HAL_Handle")
   11241                      .dwattr $C$DW$T$365, DW_AT_type(*$C$DW$T$364)
   11242                      .dwattr $C$DW$T$365, DW_AT_language(DW_LANG_C)
   11243              $C$DW$1971      .dwtag  DW_TAG_TI_far_type
   11244                      .dwattr $C$DW$1971, DW_AT_type(*$C$DW$T$365)
   11245              $C$DW$T$366     .dwtag  DW_TAG_const_type
   11246                      .dwattr $C$DW$T$366, DW_AT_type(*$C$DW$1971)
   11247              
   11248              $C$DW$T$95      .dwtag  DW_TAG_structure_type
   11249                      .dwattr $C$DW$T$95, DW_AT_name("_MATH_vec3_")
   11250                      .dwattr $C$DW$T$95, DW_AT_byte_size(0x06)
   11251              $C$DW$1972      .dwtag  DW_TAG_member
   11252                      .dwattr $C$DW$1972, DW_AT_type(*$C$DW$T$94)
   11253                      .dwattr $C$DW$1972, DW_AT_name("value")
   11254                      .dwattr $C$DW$1972, DW_AT_TI_symbol_name("_value")
   11255                      .dwattr $C$DW$1972, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
   11256                      .dwattr $C$DW$1972, DW_AT_accessibility(DW_ACCESS_public)
   11257                      .dwendtag $C$DW$T$95
   11258              
   11259              $C$DW$T$43      .dwtag  DW_TAG_typedef, DW_AT_name("MATH_vec3")
   11260                      .dwattr $C$DW$T$43, DW_AT_type(*$C$DW$T$95)
   11261                      .dwattr $C$DW$T$43, DW_AT_language(DW_LANG_C)
   11262              
   11263              $C$DW$T$99      .dwtag  DW_TAG_structure_type
   11264                      .dwattr $C$DW$T$99, DW_AT_name("_OFFSET_")
   11265                      .dwattr $C$DW$T$99, DW_AT_byte_size(0x10)
   11266              $C$DW$1973      .dwtag  DW_TAG_member
   11267                      .dwattr $C$DW$1973, DW_AT_type(*$C$DW$T$35)
   11268                      .dwattr $C$DW$1973, DW_AT_name("value")
   11269                      .dwattr $C$DW$1973, DW_AT_TI_symbol_name("_value")
   11270                      .dwattr $C$DW$1973, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
   11271                      .dwattr $C$DW$1973, DW_AT_accessibility(DW_ACCESS_public)
   11272              $C$DW$1974      .dwtag  DW_TAG_member
   11273                      .dwattr $C$DW$1974, DW_AT_type(*$C$DW$T$35)
   11274                      .dwattr $C$DW$1974, DW_AT_name("bias")
   11275                      .dwattr $C$DW$1974, DW_AT_TI_symbol_name("_bias")
   11276                      .dwattr $C$DW$1974, DW_AT_data_member_location[DW_OP_plus_uconst 0x2]
   11277                      .dwattr $C$DW$1974, DW_AT_accessibility(DW_ACCESS_public)
   11278              $C$DW$1975      .dwtag  DW_TAG_member
   11279                      .dwattr $C$DW$1975, DW_AT_type(*$C$DW$T$96)
   11280                      .dwattr $C$DW$1975, DW_AT_name("filter")
   11281                      .dwattr $C$DW$1975, DW_AT_TI_symbol_name("_filter")
   11282                      .dwattr $C$DW$1975, DW_AT_data_member_location[DW_OP_plus_uconst 0x4]
   11283                      .dwattr $C$DW$1975, DW_AT_accessibility(DW_ACCESS_public)
   11284              $C$DW$1976      .dwtag  DW_TAG_member
   11285                      .dwattr $C$DW$1976, DW_AT_type(*$C$DW$T$98)
   11286                      .dwattr $C$DW$1976, DW_AT_name("filterHandle")
   11287                      .dwattr $C$DW$1976, DW_AT_TI_symbol_name("_filterHandle")
TMS320C2000 Assembler PC v6.2.5 Fri Oct 13 15:05:15 2017

Tools Copyright (c) 1996-2014 Texas Instruments Incorporated
C:\Users\wmj\AppData\Local\Temp\1509611                              PAGE  216

   11288                      .dwattr $C$DW$1976, DW_AT_data_member_location[DW_OP_plus_uconst 0xe]
   11289                      .dwattr $C$DW$1976, DW_AT_accessibility(DW_ACCESS_public)
   11290                      .dwendtag $C$DW$T$99
   11291              
   11292              $C$DW$T$63      .dwtag  DW_TAG_typedef, DW_AT_name("OFFSET_Obj")
   11293                      .dwattr $C$DW$T$63, DW_AT_type(*$C$DW$T$99)
   11294                      .dwattr $C$DW$T$63, DW_AT_language(DW_LANG_C)
   11295              
   11296              $C$DW$T$64      .dwtag  DW_TAG_array_type
   11297                      .dwattr $C$DW$T$64, DW_AT_type(*$C$DW$T$63)
   11298                      .dwattr $C$DW$T$64, DW_AT_language(DW_LANG_C)
   11299                      .dwattr $C$DW$T$64, DW_AT_byte_size(0x30)
   11300              $C$DW$1977      .dwtag  DW_TAG_subrange_type
   11301                      .dwattr $C$DW$1977, DW_AT_upper_bound(0x02)
   11302                      .dwendtag $C$DW$T$64
   11303              
   11304              
   11305              $C$DW$T$21      .dwtag  DW_TAG_structure_type
   11306                      .dwattr $C$DW$T$21, DW_AT_name("_OFFSET_Obj_")
   11307                      .dwattr $C$DW$T$21, DW_AT_declaration
   11308                      .dwendtag $C$DW$T$21
   11309              
   11310              $C$DW$T$60      .dwtag  DW_TAG_pointer_type
   11311                      .dwattr $C$DW$T$60, DW_AT_type(*$C$DW$T$21)
   11312                      .dwattr $C$DW$T$60, DW_AT_address_class(0x16)
   11313              $C$DW$T$61      .dwtag  DW_TAG_typedef, DW_AT_name("OFFSET_Handle")
   11314                      .dwattr $C$DW$T$61, DW_AT_type(*$C$DW$T$60)
   11315                      .dwattr $C$DW$T$61, DW_AT_language(DW_LANG_C)
   11316              
   11317              $C$DW$T$62      .dwtag  DW_TAG_array_type
   11318                      .dwattr $C$DW$T$62, DW_AT_type(*$C$DW$T$61)
   11319                      .dwattr $C$DW$T$62, DW_AT_language(DW_LANG_C)
   11320                      .dwattr $C$DW$T$62, DW_AT_byte_size(0x06)
   11321              $C$DW$1978      .dwtag  DW_TAG_subrange_type
   11322                      .dwattr $C$DW$1978, DW_AT_upper_bound(0x02)
   11323                      .dwendtag $C$DW$T$62
   11324              
   11325              
   11326              $C$DW$T$100     .dwtag  DW_TAG_structure_type
   11327                      .dwattr $C$DW$T$100, DW_AT_name("_OSC_Obj_")
   11328                      .dwattr $C$DW$T$100, DW_AT_byte_size(0x03)
   11329              $C$DW$1979      .dwtag  DW_TAG_member
   11330                      .dwattr $C$DW$1979, DW_AT_type(*$C$DW$T$23)
   11331                      .dwattr $C$DW$1979, DW_AT_name("INTOSC1TRIM")
   11332                      .dwattr $C$DW$1979, DW_AT_TI_symbol_name("_INTOSC1TRIM")
   11333                      .dwattr $C$DW$1979, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
   11334                      .dwattr $C$DW$1979, DW_AT_accessibility(DW_ACCESS_public)
   11335              $C$DW$1980      .dwtag  DW_TAG_member
   11336                      .dwattr $C$DW$1980, DW_AT_type(*$C$DW$T$23)
   11337                      .dwattr $C$DW$1980, DW_AT_name("rsvd_1")
   11338                      .dwattr $C$DW$1980, DW_AT_TI_symbol_name("_rsvd_1")
   11339                      .dwattr $C$DW$1980, DW_AT_data_member_location[DW_OP_plus_uconst 0x1]
   11340                      .dwattr $C$DW$1980, DW_AT_accessibility(DW_ACCESS_public)
   11341              $C$DW$1981      .dwtag  DW_TAG_member
   11342                      .dwattr $C$DW$1981, DW_AT_type(*$C$DW$T$23)
TMS320C2000 Assembler PC v6.2.5 Fri Oct 13 15:05:15 2017

Tools Copyright (c) 1996-2014 Texas Instruments Incorporated
C:\Users\wmj\AppData\Local\Temp\1509611                              PAGE  217

   11343                      .dwattr $C$DW$1981, DW_AT_name("INTOSC2TRIM")
   11344                      .dwattr $C$DW$1981, DW_AT_TI_symbol_name("_INTOSC2TRIM")
   11345                      .dwattr $C$DW$1981, DW_AT_data_member_location[DW_OP_plus_uconst 0x2]
   11346                      .dwattr $C$DW$1981, DW_AT_accessibility(DW_ACCESS_public)
   11347                      .dwendtag $C$DW$T$100
   11348              
   11349              $C$DW$T$65      .dwtag  DW_TAG_pointer_type
   11350                      .dwattr $C$DW$T$65, DW_AT_type(*$C$DW$T$100)
   11351                      .dwattr $C$DW$T$65, DW_AT_address_class(0x16)
   11352              $C$DW$T$66      .dwtag  DW_TAG_typedef, DW_AT_name("OSC_Handle")
   11353                      .dwattr $C$DW$T$66, DW_AT_type(*$C$DW$T$65)
   11354                      .dwattr $C$DW$T$66, DW_AT_language(DW_LANG_C)
   11355              
   11356              $C$DW$T$103     .dwtag  DW_TAG_structure_type
   11357                      .dwattr $C$DW$T$103, DW_AT_name("_PCA955x_Obj_")
   11358                      .dwattr $C$DW$T$103, DW_AT_byte_size(0x06)
   11359              $C$DW$1982      .dwtag  DW_TAG_member
   11360                      .dwattr $C$DW$1982, DW_AT_type(*$C$DW$T$80)
   11361                      .dwattr $C$DW$1982, DW_AT_name("i2cHandle")
   11362                      .dwattr $C$DW$1982, DW_AT_TI_symbol_name("_i2cHandle")
   11363                      .dwattr $C$DW$1982, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
   11364                      .dwattr $C$DW$1982, DW_AT_accessibility(DW_ACCESS_public)
   11365              $C$DW$1983      .dwtag  DW_TAG_member
   11366                      .dwattr $C$DW$1983, DW_AT_type(*$C$DW$T$101)
   11367                      .dwattr $C$DW$1983, DW_AT_name("PortData")
   11368                      .dwattr $C$DW$1983, DW_AT_TI_symbol_name("_PortData")
   11369                      .dwattr $C$DW$1983, DW_AT_data_member_location[DW_OP_plus_uconst 0x2]
   11370                      .dwattr $C$DW$1983, DW_AT_accessibility(DW_ACCESS_public)
   11371              $C$DW$1984      .dwtag  DW_TAG_member
   11372                      .dwattr $C$DW$1984, DW_AT_type(*$C$DW$T$102)
   11373                      .dwattr $C$DW$1984, DW_AT_name("RxTimeOut")
   11374                      .dwattr $C$DW$1984, DW_AT_TI_symbol_name("_RxTimeOut")
   11375                      .dwattr $C$DW$1984, DW_AT_data_member_location[DW_OP_plus_uconst 0x3]
   11376                      .dwattr $C$DW$1984, DW_AT_accessibility(DW_ACCESS_public)
   11377              $C$DW$1985      .dwtag  DW_TAG_member
   11378                      .dwattr $C$DW$1985, DW_AT_type(*$C$DW$T$102)
   11379                      .dwattr $C$DW$1985, DW_AT_name("TxTimeOut")
   11380                      .dwattr $C$DW$1985, DW_AT_TI_symbol_name("_TxTimeOut")
   11381                      .dwattr $C$DW$1985, DW_AT_data_member_location[DW_OP_plus_uconst 0x4]
   11382                      .dwattr $C$DW$1985, DW_AT_accessibility(DW_ACCESS_public)
   11383                      .dwendtag $C$DW$T$103
   11384              
   11385              $C$DW$T$90      .dwtag  DW_TAG_typedef, DW_AT_name("PCA955x_Obj")
   11386                      .dwattr $C$DW$T$90, DW_AT_type(*$C$DW$T$103)
   11387                      .dwattr $C$DW$T$90, DW_AT_language(DW_LANG_C)
   11388              $C$DW$T$91      .dwtag  DW_TAG_pointer_type
   11389                      .dwattr $C$DW$T$91, DW_AT_type(*$C$DW$T$103)
   11390                      .dwattr $C$DW$T$91, DW_AT_address_class(0x16)
   11391              $C$DW$T$92      .dwtag  DW_TAG_typedef, DW_AT_name("PCA955x_Handle")
   11392                      .dwattr $C$DW$T$92, DW_AT_type(*$C$DW$T$91)
   11393                      .dwattr $C$DW$T$92, DW_AT_language(DW_LANG_C)
   11394              
   11395              $C$DW$T$104     .dwtag  DW_TAG_structure_type
   11396                      .dwattr $C$DW$T$104, DW_AT_name("_PIE_IERIFR_t")
   11397                      .dwattr $C$DW$T$104, DW_AT_byte_size(0x02)
TMS320C2000 Assembler PC v6.2.5 Fri Oct 13 15:05:15 2017

Tools Copyright (c) 1996-2014 Texas Instruments Incorporated
C:\Users\wmj\AppData\Local\Temp\1509611                              PAGE  218

   11398              $C$DW$1986      .dwtag  DW_TAG_member
   11399                      .dwattr $C$DW$1986, DW_AT_type(*$C$DW$T$23)
   11400                      .dwattr $C$DW$1986, DW_AT_name("IER")
   11401                      .dwattr $C$DW$1986, DW_AT_TI_symbol_name("_IER")
   11402                      .dwattr $C$DW$1986, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
   11403                      .dwattr $C$DW$1986, DW_AT_accessibility(DW_ACCESS_public)
   11404              $C$DW$1987      .dwtag  DW_TAG_member
   11405                      .dwattr $C$DW$1987, DW_AT_type(*$C$DW$T$23)
   11406                      .dwattr $C$DW$1987, DW_AT_name("IFR")
   11407                      .dwattr $C$DW$1987, DW_AT_TI_symbol_name("_IFR")
   11408                      .dwattr $C$DW$1987, DW_AT_data_member_location[DW_OP_plus_uconst 0x1]
   11409                      .dwattr $C$DW$1987, DW_AT_accessibility(DW_ACCESS_public)
   11410                      .dwendtag $C$DW$T$104
   11411              
   11412              $C$DW$T$105     .dwtag  DW_TAG_typedef, DW_AT_name("PIE_IERIFR_t")
   11413                      .dwattr $C$DW$T$105, DW_AT_type(*$C$DW$T$104)
   11414                      .dwattr $C$DW$T$105, DW_AT_language(DW_LANG_C)
   11415              $C$DW$1988      .dwtag  DW_TAG_TI_far_type
   11416                      .dwattr $C$DW$1988, DW_AT_type(*$C$DW$T$105)
   11417              $C$DW$T$106     .dwtag  DW_TAG_volatile_type
   11418                      .dwattr $C$DW$T$106, DW_AT_type(*$C$DW$1988)
   11419              
   11420              $C$DW$T$107     .dwtag  DW_TAG_array_type
   11421                      .dwattr $C$DW$T$107, DW_AT_type(*$C$DW$T$106)
   11422                      .dwattr $C$DW$T$107, DW_AT_language(DW_LANG_C)
   11423                      .dwattr $C$DW$T$107, DW_AT_byte_size(0x18)
   11424              $C$DW$1989      .dwtag  DW_TAG_subrange_type
   11425                      .dwattr $C$DW$1989, DW_AT_upper_bound(0x0b)
   11426                      .dwendtag $C$DW$T$107
   11427              
   11428              
   11429              $C$DW$T$114     .dwtag  DW_TAG_structure_type
   11430                      .dwattr $C$DW$T$114, DW_AT_name("_PIE_Obj_")
   11431                      .dwattr $C$DW$T$114, DW_AT_byte_size(0x639c)
   11432              $C$DW$1990      .dwtag  DW_TAG_member
   11433                      .dwattr $C$DW$1990, DW_AT_type(*$C$DW$T$23)
   11434                      .dwattr $C$DW$1990, DW_AT_name("PIECTRL")
   11435                      .dwattr $C$DW$1990, DW_AT_TI_symbol_name("_PIECTRL")
   11436                      .dwattr $C$DW$1990, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
   11437                      .dwattr $C$DW$1990, DW_AT_accessibility(DW_ACCESS_public)
   11438              $C$DW$1991      .dwtag  DW_TAG_member
   11439                      .dwattr $C$DW$1991, DW_AT_type(*$C$DW$T$23)
   11440                      .dwattr $C$DW$1991, DW_AT_name("PIEACK")
   11441                      .dwattr $C$DW$1991, DW_AT_TI_symbol_name("_PIEACK")
   11442                      .dwattr $C$DW$1991, DW_AT_data_member_location[DW_OP_plus_uconst 0x1]
   11443                      .dwattr $C$DW$1991, DW_AT_accessibility(DW_ACCESS_public)
   11444              $C$DW$1992      .dwtag  DW_TAG_member
   11445                      .dwattr $C$DW$1992, DW_AT_type(*$C$DW$T$107)
   11446                      .dwattr $C$DW$1992, DW_AT_name("PIEIER_PIEIFR")
   11447                      .dwattr $C$DW$1992, DW_AT_TI_symbol_name("_PIEIER_PIEIFR")
   11448                      .dwattr $C$DW$1992, DW_AT_data_member_location[DW_OP_plus_uconst 0x2]
   11449                      .dwattr $C$DW$1992, DW_AT_accessibility(DW_ACCESS_public)
   11450              $C$DW$1993      .dwtag  DW_TAG_member
   11451                      .dwattr $C$DW$1993, DW_AT_type(*$C$DW$T$108)
   11452                      .dwattr $C$DW$1993, DW_AT_name("rsvd_1")
TMS320C2000 Assembler PC v6.2.5 Fri Oct 13 15:05:15 2017

Tools Copyright (c) 1996-2014 Texas Instruments Incorporated
C:\Users\wmj\AppData\Local\Temp\1509611                              PAGE  219

   11453                      .dwattr $C$DW$1993, DW_AT_TI_symbol_name("_rsvd_1")
   11454                      .dwattr $C$DW$1993, DW_AT_data_member_location[DW_OP_plus_uconst 0x1a]
   11455                      .dwattr $C$DW$1993, DW_AT_accessibility(DW_ACCESS_public)
   11456              $C$DW$1994      .dwtag  DW_TAG_member
   11457                      .dwattr $C$DW$1994, DW_AT_type(*$C$DW$T$112)
   11458                      .dwattr $C$DW$1994, DW_AT_name("Reset")
   11459                      .dwattr $C$DW$1994, DW_AT_TI_symbol_name("_Reset")
   11460                      .dwattr $C$DW$1994, DW_AT_data_member_location[DW_OP_plus_uconst 0x20]
   11461                      .dwattr $C$DW$1994, DW_AT_accessibility(DW_ACCESS_public)
   11462              $C$DW$1995      .dwtag  DW_TAG_member
   11463                      .dwattr $C$DW$1995, DW_AT_type(*$C$DW$T$112)
   11464                      .dwattr $C$DW$1995, DW_AT_name("INT1")
   11465                      .dwattr $C$DW$1995, DW_AT_TI_symbol_name("_INT1")
   11466                      .dwattr $C$DW$1995, DW_AT_data_member_location[DW_OP_plus_uconst 0x22]
   11467                      .dwattr $C$DW$1995, DW_AT_accessibility(DW_ACCESS_public)
   11468              $C$DW$1996      .dwtag  DW_TAG_member
   11469                      .dwattr $C$DW$1996, DW_AT_type(*$C$DW$T$112)
   11470                      .dwattr $C$DW$1996, DW_AT_name("INT2")
   11471                      .dwattr $C$DW$1996, DW_AT_TI_symbol_name("_INT2")
   11472                      .dwattr $C$DW$1996, DW_AT_data_member_location[DW_OP_plus_uconst 0x24]
   11473                      .dwattr $C$DW$1996, DW_AT_accessibility(DW_ACCESS_public)
   11474              $C$DW$1997      .dwtag  DW_TAG_member
   11475                      .dwattr $C$DW$1997, DW_AT_type(*$C$DW$T$112)
   11476                      .dwattr $C$DW$1997, DW_AT_name("INT3")
   11477                      .dwattr $C$DW$1997, DW_AT_TI_symbol_name("_INT3")
   11478                      .dwattr $C$DW$1997, DW_AT_data_member_location[DW_OP_plus_uconst 0x26]
   11479                      .dwattr $C$DW$1997, DW_AT_accessibility(DW_ACCESS_public)
   11480              $C$DW$1998      .dwtag  DW_TAG_member
   11481                      .dwattr $C$DW$1998, DW_AT_type(*$C$DW$T$112)
   11482                      .dwattr $C$DW$1998, DW_AT_name("INT4")
   11483                      .dwattr $C$DW$1998, DW_AT_TI_symbol_name("_INT4")
   11484                      .dwattr $C$DW$1998, DW_AT_data_member_location[DW_OP_plus_uconst 0x28]
   11485                      .dwattr $C$DW$1998, DW_AT_accessibility(DW_ACCESS_public)
