TMS320C2000 Assembler PC v6.2.5 Fri Oct 13 15:05:16 2017

Tools Copyright (c) 1996-2014 Texas Instruments Incorporated
C:\Users\wmj\AppData\Local\Temp\1488411                              PAGE    1

       1              ;***************************************************************
       2              ;* TMS320C2000 C/C++ Codegen                         PC v6.2.5 *
       3              ;* Date/Time created: Fri Oct 13 15:05:15 2017                 *
       4              ;***************************************************************
       5                      .compiler_opts --float_support=softlib --hll_source=on --mem_model:code=flat --mem_model:data=large -
       6        0002  FP      .set    XAR2
       7              
       8              $C$DW$CU        .dwtag  DW_TAG_compile_unit
       9                      .dwattr $C$DW$CU, DW_AT_name("D:/BM1000/sw/modules/user/src/32b/user.c")
      10                      .dwattr $C$DW$CU, DW_AT_producer("TMS320C2000 C/C++ Codegen PC v6.2.5 Copyright (c) 1996-2014 Texas I
      11                      .dwattr $C$DW$CU, DW_AT_TI_version(0x01)
      12                      .dwattr $C$DW$CU, DW_AT_comp_dir("D:\BM1000\sw\solutions\instaspin_foc\boards\hvkit_rev1p1\f28x\f2802
      13              
      14              $C$DW$1 .dwtag  DW_TAG_subprogram, DW_AT_name("EST_setLs_qFmt")
      15                      .dwattr $C$DW$1, DW_AT_TI_symbol_name("_EST_setLs_qFmt")

    6415              $C$DW$612       .dwtag  DW_TAG_enumerator, DW_AT_name("USER_ErrorCode_maxCurrentSlope_High"), DW_AT_const_val
    6416              $C$DW$613       .dwtag  DW_TAG_enumerator, DW_AT_name("USER_ErrorCode_maxCurrentSlope_Low"), DW_AT_const_valu
    6417              $C$DW$614       .dwtag  DW_TAG_enumerator, DW_AT_name("USER_ErrorCode_maxCurrentSlope_powerWarp_High"), DW_AT
    6418              $C$DW$615       .dwtag  DW_TAG_enumerator, DW_AT_name("USER_ErrorCode_maxCurrentSlope_powerWarp_Low"), DW_AT_
    6419              $C$DW$616       .dwtag  DW_TAG_enumerator, DW_AT_name("USER_ErrorCode_IdRated_High"), DW_AT_const_value(0x54)
TMS320C2000 Assembler PC v6.2.5 Fri Oct 13 15:05:16 2017

Tools Copyright (c) 1996-2014 Texas Instruments Incorporated
C:\Users\wmj\AppData\Local\Temp\1488411                              PAGE  131

    6420              $C$DW$617       .dwtag  DW_TAG_enumerator, DW_AT_name("USER_ErrorCode_IdRated_Low"), DW_AT_const_value(0x55)
    6421              $C$DW$618       .dwtag  DW_TAG_enumerator, DW_AT_name("USER_ErrorCode_IdRatedFraction_indEst_High"), DW_AT_co
    6422              $C$DW$619       .dwtag  DW_TAG_enumerator, DW_AT_name("USER_ErrorCode_IdRatedFraction_indEst_Low"), DW_AT_con
    6423              $C$DW$620       .dwtag  DW_TAG_enumerator, DW_AT_name("USER_ErrorCode_IdRatedFraction_ratedFlux_High"), DW_AT
    6424              $C$DW$621       .dwtag  DW_TAG_enumerator, DW_AT_name("USER_ErrorCode_IdRatedFraction_ratedFlux_Low"), DW_AT_
    6425              $C$DW$622       .dwtag  DW_TAG_enumerator, DW_AT_name("USER_ErrorCode_IdRated_delta_High"), DW_AT_const_value
    6426              $C$DW$623       .dwtag  DW_TAG_enumerator, DW_AT_name("USER_ErrorCode_IdRated_delta_Low"), DW_AT_const_value(
    6427              $C$DW$624       .dwtag  DW_TAG_enumerator, DW_AT_name("USER_ErrorCode_fluxEstFreq_Hz_High"), DW_AT_const_valu
    6428              $C$DW$625       .dwtag  DW_TAG_enumerator, DW_AT_name("USER_ErrorCode_fluxEstFreq_Hz_Low"), DW_AT_const_value
    6429              $C$DW$626       .dwtag  DW_TAG_enumerator, DW_AT_name("USER_ErrorCode_ctrlFreq_Hz_High"), DW_AT_const_value(0
    6430              $C$DW$627       .dwtag  DW_TAG_enumerator, DW_AT_name("USER_ErrorCode_ctrlFreq_Hz_Low"), DW_AT_const_value(0x
    6431              $C$DW$628       .dwtag  DW_TAG_enumerator, DW_AT_name("USER_ErrorCode_estFreq_Hz_High"), DW_AT_const_value(0x
    6432              $C$DW$629       .dwtag  DW_TAG_enumerator, DW_AT_name("USER_ErrorCode_estFreq_Hz_Low"), DW_AT_const_value(0x6
    6433              $C$DW$630       .dwtag  DW_TAG_enumerator, DW_AT_name("USER_ErrorCode_RoverL_estFreq_Hz_High"), DW_AT_const_v
    6434              $C$DW$631       .dwtag  DW_TAG_enumerator, DW_AT_name("USER_ErrorCode_RoverL_estFreq_Hz_Low"), DW_AT_const_va
    6435              $C$DW$632       .dwtag  DW_TAG_enumerator, DW_AT_name("USER_ErrorCode_trajFreq_Hz_High"), DW_AT_const_value(0
    6436              $C$DW$633       .dwtag  DW_TAG_enumerator, DW_AT_name("USER_ErrorCode_trajFreq_Hz_Low"), DW_AT_const_value(0x
    6437              $C$DW$634       .dwtag  DW_TAG_enumerator, DW_AT_name("USER_ErrorCode_ctrlPeriod_sec_High"), DW_AT_const_valu
    6438              $C$DW$635       .dwtag  DW_TAG_enumerator, DW_AT_name("USER_ErrorCode_ctrlPeriod_sec_Low"), DW_AT_const_value
    6439              $C$DW$636       .dwtag  DW_TAG_enumerator, DW_AT_name("USER_ErrorCode_maxNegativeIdCurrent_a_High"), DW_AT_co
    6440              $C$DW$637       .dwtag  DW_TAG_enumerator, DW_AT_name("USER_ErrorCode_maxNegativeIdCurrent_a_Low"), DW_AT_con
    6441              $C$DW$638       .dwtag  DW_TAG_enumerator, DW_AT_name("USER_numErrorCodes"), DW_AT_const_value(0x6a)
    6442                      .dwendtag $C$DW$T$78
    6443              
    6444              $C$DW$T$79      .dwtag  DW_TAG_typedef, DW_AT_name("USER_ErrorCode_e")
    6445                      .dwattr $C$DW$T$79, DW_AT_type(*$C$DW$T$78)
    6446                      .dwattr $C$DW$T$79, DW_AT_language(DW_LANG_C)
    6447              $C$DW$639       .dwtag  DW_TAG_TI_far_type
    6448                      .dwattr $C$DW$639, DW_AT_type(*$C$DW$T$79)
    6449              $C$DW$T$83      .dwtag  DW_TAG_const_type
    6450                      .dwattr $C$DW$T$83, DW_AT_type(*$C$DW$639)
    6451              
    6452              $C$DW$T$88      .dwtag  DW_TAG_enumeration_type
    6453                      .dwattr $C$DW$T$88, DW_AT_byte_size(0x01)
    6454              $C$DW$640       .dwtag  DW_TAG_enumerator, DW_AT_name("CTRL_Type_PID_spd"), DW_AT_const_value(0x00)
    6455              $C$DW$641       .dwtag  DW_TAG_enumerator, DW_AT_name("CTRL_Type_PID_Id"), DW_AT_const_value(0x01)
    6456              $C$DW$642       .dwtag  DW_TAG_enumerator, DW_AT_name("CTRL_Type_PID_Iq"), DW_AT_const_value(0x02)
    6457                      .dwendtag $C$DW$T$88
    6458              
    6459              $C$DW$T$89      .dwtag  DW_TAG_typedef, DW_AT_name("CTRL_Type_e")
    6460                      .dwattr $C$DW$T$89, DW_AT_type(*$C$DW$T$88)
    6461                      .dwattr $C$DW$T$89, DW_AT_language(DW_LANG_C)
    6462              $C$DW$643       .dwtag  DW_TAG_TI_far_type
    6463                      .dwattr $C$DW$643, DW_AT_type(*$C$DW$T$89)
    6464              $C$DW$T$90      .dwtag  DW_TAG_const_type
    6465                      .dwattr $C$DW$T$90, DW_AT_type(*$C$DW$643)
    6466              
    6467              $C$DW$T$23      .dwtag  DW_TAG_structure_type
    6468                      .dwattr $C$DW$T$23, DW_AT_name("_BRAKE_Obj_")
    6469                      .dwattr $C$DW$T$23, DW_AT_byte_size(0x08)
    6470              $C$DW$644       .dwtag  DW_TAG_member
    6471                      .dwattr $C$DW$644, DW_AT_type(*$C$DW$T$20)
    6472                      .dwattr $C$DW$644, DW_AT_name("angle_pu")
    6473                      .dwattr $C$DW$644, DW_AT_TI_symbol_name("_angle_pu")
    6474                      .dwattr $C$DW$644, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
TMS320C2000 Assembler PC v6.2.5 Fri Oct 13 15:05:16 2017

Tools Copyright (c) 1996-2014 Texas Instruments Incorporated
C:\Users\wmj\AppData\Local\Temp\1488411                              PAGE  132

    6475                      .dwattr $C$DW$644, DW_AT_accessibility(DW_ACCESS_public)
    6476              $C$DW$645       .dwtag  DW_TAG_member
    6477                      .dwattr $C$DW$645, DW_AT_type(*$C$DW$T$21)
    6478                      .dwattr $C$DW$645, DW_AT_name("Idq_brake")
    6479                      .dwattr $C$DW$645, DW_AT_TI_symbol_name("_Idq_brake")
    6480                      .dwattr $C$DW$645, DW_AT_data_member_location[DW_OP_plus_uconst 0x2]
    6481                      .dwattr $C$DW$645, DW_AT_accessibility(DW_ACCESS_public)
    6482              $C$DW$646       .dwtag  DW_TAG_member
    6483                      .dwattr $C$DW$646, DW_AT_type(*$C$DW$T$22)
    6484                      .dwattr $C$DW$646, DW_AT_name("brake_enable")
    6485                      .dwattr $C$DW$646, DW_AT_TI_symbol_name("_brake_enable")
    6486                      .dwattr $C$DW$646, DW_AT_data_member_location[DW_OP_plus_uconst 0x6]
    6487                      .dwattr $C$DW$646, DW_AT_accessibility(DW_ACCESS_public)
    6488                      .dwendtag $C$DW$T$23
    6489              
    6490              $C$DW$T$60      .dwtag  DW_TAG_typedef, DW_AT_name("BRAKE_Obj")
    6491                      .dwattr $C$DW$T$60, DW_AT_type(*$C$DW$T$23)
    6492                      .dwattr $C$DW$T$60, DW_AT_language(DW_LANG_C)
    6493              $C$DW$T$58      .dwtag  DW_TAG_pointer_type
    6494                      .dwattr $C$DW$T$58, DW_AT_type(*$C$DW$T$23)
    6495                      .dwattr $C$DW$T$58, DW_AT_address_class(0x16)
    6496              $C$DW$T$59      .dwtag  DW_TAG_typedef, DW_AT_name("BRAKE_Handle")
    6497                      .dwattr $C$DW$T$59, DW_AT_type(*$C$DW$T$58)
    6498                      .dwattr $C$DW$T$59, DW_AT_language(DW_LANG_C)
    6499              
    6500              $C$DW$T$26      .dwtag  DW_TAG_structure_type
    6501                      .dwattr $C$DW$T$26, DW_AT_name("_CLARKE_Obj_")
    6502                      .dwattr $C$DW$T$26, DW_AT_byte_size(0x06)
    6503              $C$DW$647       .dwtag  DW_TAG_member
    6504                      .dwattr $C$DW$647, DW_AT_type(*$C$DW$T$20)
    6505                      .dwattr $C$DW$647, DW_AT_name("alpha_sf")
    6506                      .dwattr $C$DW$647, DW_AT_TI_symbol_name("_alpha_sf")
    6507                      .dwattr $C$DW$647, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    6508                      .dwattr $C$DW$647, DW_AT_accessibility(DW_ACCESS_public)
    6509              $C$DW$648       .dwtag  DW_TAG_member
    6510                      .dwattr $C$DW$648, DW_AT_type(*$C$DW$T$20)
    6511                      .dwattr $C$DW$648, DW_AT_name("beta_sf")
    6512                      .dwattr $C$DW$648, DW_AT_TI_symbol_name("_beta_sf")
    6513                      .dwattr $C$DW$648, DW_AT_data_member_location[DW_OP_plus_uconst 0x2]
    6514                      .dwattr $C$DW$648, DW_AT_accessibility(DW_ACCESS_public)
    6515              $C$DW$649       .dwtag  DW_TAG_member
    6516                      .dwattr $C$DW$649, DW_AT_type(*$C$DW$T$25)
    6517                      .dwattr $C$DW$649, DW_AT_name("numSensors")
    6518                      .dwattr $C$DW$649, DW_AT_TI_symbol_name("_numSensors")
    6519                      .dwattr $C$DW$649, DW_AT_data_member_location[DW_OP_plus_uconst 0x4]
    6520                      .dwattr $C$DW$649, DW_AT_accessibility(DW_ACCESS_public)
    6521                      .dwendtag $C$DW$T$26
    6522              
    6523              $C$DW$T$34      .dwtag  DW_TAG_typedef, DW_AT_name("CLARKE_Obj")
    6524                      .dwattr $C$DW$T$34, DW_AT_type(*$C$DW$T$26)
    6525                      .dwattr $C$DW$T$34, DW_AT_language(DW_LANG_C)
    6526              $C$DW$T$32      .dwtag  DW_TAG_pointer_type
    6527                      .dwattr $C$DW$T$32, DW_AT_type(*$C$DW$T$26)
    6528                      .dwattr $C$DW$T$32, DW_AT_address_class(0x16)
    6529              $C$DW$T$33      .dwtag  DW_TAG_typedef, DW_AT_name("CLARKE_Handle")
TMS320C2000 Assembler PC v6.2.5 Fri Oct 13 15:05:16 2017

Tools Copyright (c) 1996-2014 Texas Instruments Incorporated
C:\Users\wmj\AppData\Local\Temp\1488411                              PAGE  133

    6530                      .dwattr $C$DW$T$33, DW_AT_type(*$C$DW$T$32)
    6531                      .dwattr $C$DW$T$33, DW_AT_language(DW_LANG_C)
    6532              
    6533              $C$DW$T$61      .dwtag  DW_TAG_structure_type
    6534                      .dwattr $C$DW$T$61, DW_AT_name("_CTRL_Obj_")
    6535                      .dwattr $C$DW$T$61, DW_AT_byte_size(0x112)
    6536              $C$DW$650       .dwtag  DW_TAG_member
    6537                      .dwattr $C$DW$650, DW_AT_type(*$C$DW$T$27)
    6538                      .dwattr $C$DW$650, DW_AT_name("version")
    6539                      .dwattr $C$DW$650, DW_AT_TI_symbol_name("_version")
    6540                      .dwattr $C$DW$650, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    6541                      .dwattr $C$DW$650, DW_AT_accessibility(DW_ACCESS_public)
    6542              $C$DW$651       .dwtag  DW_TAG_member
    6543                      .dwattr $C$DW$651, DW_AT_type(*$C$DW$T$29)
    6544                      .dwattr $C$DW$651, DW_AT_name("state")
    6545                      .dwattr $C$DW$651, DW_AT_TI_symbol_name("_state")
    6546                      .dwattr $C$DW$651, DW_AT_data_member_location[DW_OP_plus_uconst 0x4]
    6547                      .dwattr $C$DW$651, DW_AT_accessibility(DW_ACCESS_public)
    6548              $C$DW$652       .dwtag  DW_TAG_member
    6549                      .dwattr $C$DW$652, DW_AT_type(*$C$DW$T$29)
    6550                      .dwattr $C$DW$652, DW_AT_name("prevState")
    6551                      .dwattr $C$DW$652, DW_AT_TI_symbol_name("_prevState")
    6552                      .dwattr $C$DW$652, DW_AT_data_member_location[DW_OP_plus_uconst 0x5]
    6553                      .dwattr $C$DW$652, DW_AT_accessibility(DW_ACCESS_public)
    6554              $C$DW$653       .dwtag  DW_TAG_member
    6555                      .dwattr $C$DW$653, DW_AT_type(*$C$DW$T$31)
    6556                      .dwattr $C$DW$653, DW_AT_name("errorCode")
    6557                      .dwattr $C$DW$653, DW_AT_TI_symbol_name("_errorCode")
    6558                      .dwattr $C$DW$653, DW_AT_data_member_location[DW_OP_plus_uconst 0x6]
    6559                      .dwattr $C$DW$653, DW_AT_accessibility(DW_ACCESS_public)
    6560              $C$DW$654       .dwtag  DW_TAG_member
    6561                      .dwattr $C$DW$654, DW_AT_type(*$C$DW$T$33)
    6562                      .dwattr $C$DW$654, DW_AT_name("clarkeHandle_I")
    6563                      .dwattr $C$DW$654, DW_AT_TI_symbol_name("_clarkeHandle_I")
    6564                      .dwattr $C$DW$654, DW_AT_data_member_location[DW_OP_plus_uconst 0x8]
    6565                      .dwattr $C$DW$654, DW_AT_accessibility(DW_ACCESS_public)
    6566              $C$DW$655       .dwtag  DW_TAG_member
    6567                      .dwattr $C$DW$655, DW_AT_type(*$C$DW$T$34)
    6568                      .dwattr $C$DW$655, DW_AT_name("clarke_I")
    6569                      .dwattr $C$DW$655, DW_AT_TI_symbol_name("_clarke_I")
    6570                      .dwattr $C$DW$655, DW_AT_data_member_location[DW_OP_plus_uconst 0xa]
    6571                      .dwattr $C$DW$655, DW_AT_accessibility(DW_ACCESS_public)
    6572              $C$DW$656       .dwtag  DW_TAG_member
    6573                      .dwattr $C$DW$656, DW_AT_type(*$C$DW$T$33)
    6574                      .dwattr $C$DW$656, DW_AT_name("clarkeHandle_V")
    6575                      .dwattr $C$DW$656, DW_AT_TI_symbol_name("_clarkeHandle_V")
    6576                      .dwattr $C$DW$656, DW_AT_data_member_location[DW_OP_plus_uconst 0x10]
    6577                      .dwattr $C$DW$656, DW_AT_accessibility(DW_ACCESS_public)
    6578              $C$DW$657       .dwtag  DW_TAG_member
    6579                      .dwattr $C$DW$657, DW_AT_type(*$C$DW$T$34)
    6580                      .dwattr $C$DW$657, DW_AT_name("clarke_V")
    6581                      .dwattr $C$DW$657, DW_AT_TI_symbol_name("_clarke_V")
    6582                      .dwattr $C$DW$657, DW_AT_data_member_location[DW_OP_plus_uconst 0x12]
    6583                      .dwattr $C$DW$657, DW_AT_accessibility(DW_ACCESS_public)
    6584              $C$DW$658       .dwtag  DW_TAG_member
TMS320C2000 Assembler PC v6.2.5 Fri Oct 13 15:05:16 2017

Tools Copyright (c) 1996-2014 Texas Instruments Incorporated
C:\Users\wmj\AppData\Local\Temp\1488411                              PAGE  134

    6585                      .dwattr $C$DW$658, DW_AT_type(*$C$DW$T$36)
    6586                      .dwattr $C$DW$658, DW_AT_name("estHandle")
    6587                      .dwattr $C$DW$658, DW_AT_TI_symbol_name("_estHandle")
    6588                      .dwattr $C$DW$658, DW_AT_data_member_location[DW_OP_plus_uconst 0x18]
    6589                      .dwattr $C$DW$658, DW_AT_accessibility(DW_ACCESS_public)
    6590              $C$DW$659       .dwtag  DW_TAG_member
    6591                      .dwattr $C$DW$659, DW_AT_type(*$C$DW$T$38)
    6592                      .dwattr $C$DW$659, DW_AT_name("parkHandle")
    6593                      .dwattr $C$DW$659, DW_AT_TI_symbol_name("_parkHandle")
    6594                      .dwattr $C$DW$659, DW_AT_data_member_location[DW_OP_plus_uconst 0x1a]
    6595                      .dwattr $C$DW$659, DW_AT_accessibility(DW_ACCESS_public)
    6596              $C$DW$660       .dwtag  DW_TAG_member
    6597                      .dwattr $C$DW$660, DW_AT_type(*$C$DW$T$39)
    6598                      .dwattr $C$DW$660, DW_AT_name("park")
    6599                      .dwattr $C$DW$660, DW_AT_TI_symbol_name("_park")
    6600                      .dwattr $C$DW$660, DW_AT_data_member_location[DW_OP_plus_uconst 0x1c]
    6601                      .dwattr $C$DW$660, DW_AT_accessibility(DW_ACCESS_public)
    6602              $C$DW$661       .dwtag  DW_TAG_member
    6603                      .dwattr $C$DW$661, DW_AT_type(*$C$DW$T$41)
    6604                      .dwattr $C$DW$661, DW_AT_name("pidHandle_Id")
    6605                      .dwattr $C$DW$661, DW_AT_TI_symbol_name("_pidHandle_Id")
    6606                      .dwattr $C$DW$661, DW_AT_data_member_location[DW_OP_plus_uconst 0x20]
    6607                      .dwattr $C$DW$661, DW_AT_accessibility(DW_ACCESS_public)
    6608              $C$DW$662       .dwtag  DW_TAG_member
    6609                      .dwattr $C$DW$662, DW_AT_type(*$C$DW$T$42)
    6610                      .dwattr $C$DW$662, DW_AT_name("pid_Id")
    6611                      .dwattr $C$DW$662, DW_AT_TI_symbol_name("_pid_Id")
    6612                      .dwattr $C$DW$662, DW_AT_data_member_location[DW_OP_plus_uconst 0x22]
    6613                      .dwattr $C$DW$662, DW_AT_accessibility(DW_ACCESS_public)
    6614              $C$DW$663       .dwtag  DW_TAG_member
    6615                      .dwattr $C$DW$663, DW_AT_type(*$C$DW$T$41)
    6616                      .dwattr $C$DW$663, DW_AT_name("pidHandle_Iq")
    6617                      .dwattr $C$DW$663, DW_AT_TI_symbol_name("_pidHandle_Iq")
    6618                      .dwattr $C$DW$663, DW_AT_data_member_location[DW_OP_plus_uconst 0x32]
    6619                      .dwattr $C$DW$663, DW_AT_accessibility(DW_ACCESS_public)
    6620              $C$DW$664       .dwtag  DW_TAG_member
    6621                      .dwattr $C$DW$664, DW_AT_type(*$C$DW$T$42)
    6622                      .dwattr $C$DW$664, DW_AT_name("pid_Iq")
    6623                      .dwattr $C$DW$664, DW_AT_TI_symbol_name("_pid_Iq")
    6624                      .dwattr $C$DW$664, DW_AT_data_member_location[DW_OP_plus_uconst 0x34]
    6625                      .dwattr $C$DW$664, DW_AT_accessibility(DW_ACCESS_public)
    6626              $C$DW$665       .dwtag  DW_TAG_member
    6627                      .dwattr $C$DW$665, DW_AT_type(*$C$DW$T$41)
    6628                      .dwattr $C$DW$665, DW_AT_name("pidHandle_spd")
    6629                      .dwattr $C$DW$665, DW_AT_TI_symbol_name("_pidHandle_spd")
    6630                      .dwattr $C$DW$665, DW_AT_data_member_location[DW_OP_plus_uconst 0x44]
    6631                      .dwattr $C$DW$665, DW_AT_accessibility(DW_ACCESS_public)
    6632              $C$DW$666       .dwtag  DW_TAG_member
    6633                      .dwattr $C$DW$666, DW_AT_type(*$C$DW$T$42)
    6634                      .dwattr $C$DW$666, DW_AT_name("pid_spd")
    6635                      .dwattr $C$DW$666, DW_AT_TI_symbol_name("_pid_spd")
    6636                      .dwattr $C$DW$666, DW_AT_data_member_location[DW_OP_plus_uconst 0x46]
    6637                      .dwattr $C$DW$666, DW_AT_accessibility(DW_ACCESS_public)
    6638              $C$DW$667       .dwtag  DW_TAG_member
    6639                      .dwattr $C$DW$667, DW_AT_type(*$C$DW$T$44)
TMS320C2000 Assembler PC v6.2.5 Fri Oct 13 15:05:16 2017

Tools Copyright (c) 1996-2014 Texas Instruments Incorporated
C:\Users\wmj\AppData\Local\Temp\1488411                              PAGE  135

    6640                      .dwattr $C$DW$667, DW_AT_name("iparkHandle")
    6641                      .dwattr $C$DW$667, DW_AT_TI_symbol_name("_iparkHandle")
    6642                      .dwattr $C$DW$667, DW_AT_data_member_location[DW_OP_plus_uconst 0x56]
    6643                      .dwattr $C$DW$667, DW_AT_accessibility(DW_ACCESS_public)
    6644              $C$DW$668       .dwtag  DW_TAG_member
    6645                      .dwattr $C$DW$668, DW_AT_type(*$C$DW$T$45)
    6646                      .dwattr $C$DW$668, DW_AT_name("ipark")
    6647                      .dwattr $C$DW$668, DW_AT_TI_symbol_name("_ipark")
    6648                      .dwattr $C$DW$668, DW_AT_data_member_location[DW_OP_plus_uconst 0x58]
    6649                      .dwattr $C$DW$668, DW_AT_accessibility(DW_ACCESS_public)
    6650              $C$DW$669       .dwtag  DW_TAG_member
    6651                      .dwattr $C$DW$669, DW_AT_type(*$C$DW$T$47)
    6652                      .dwattr $C$DW$669, DW_AT_name("svgenHandle")
    6653                      .dwattr $C$DW$669, DW_AT_TI_symbol_name("_svgenHandle")
    6654                      .dwattr $C$DW$669, DW_AT_data_member_location[DW_OP_plus_uconst 0x5c]
    6655                      .dwattr $C$DW$669, DW_AT_accessibility(DW_ACCESS_public)
    6656              $C$DW$670       .dwtag  DW_TAG_member
    6657                      .dwattr $C$DW$670, DW_AT_type(*$C$DW$T$48)
    6658                      .dwattr $C$DW$670, DW_AT_name("svgen")
    6659                      .dwattr $C$DW$670, DW_AT_TI_symbol_name("_svgen")
    6660                      .dwattr $C$DW$670, DW_AT_data_member_location[DW_OP_plus_uconst 0x5e]
    6661                      .dwattr $C$DW$670, DW_AT_accessibility(DW_ACCESS_public)
    6662              $C$DW$671       .dwtag  DW_TAG_member
    6663                      .dwattr $C$DW$671, DW_AT_type(*$C$DW$T$50)
    6664                      .dwattr $C$DW$671, DW_AT_name("trajHandle_Id")
    6665                      .dwattr $C$DW$671, DW_AT_TI_symbol_name("_trajHandle_Id")
    6666                      .dwattr $C$DW$671, DW_AT_data_member_location[DW_OP_plus_uconst 0x60]
    6667                      .dwattr $C$DW$671, DW_AT_accessibility(DW_ACCESS_public)
    6668              $C$DW$672       .dwtag  DW_TAG_member
    6669                      .dwattr $C$DW$672, DW_AT_type(*$C$DW$T$51)
    6670                      .dwattr $C$DW$672, DW_AT_name("traj_Id")
    6671                      .dwattr $C$DW$672, DW_AT_TI_symbol_name("_traj_Id")
    6672                      .dwattr $C$DW$672, DW_AT_data_member_location[DW_OP_plus_uconst 0x62]
    6673                      .dwattr $C$DW$672, DW_AT_accessibility(DW_ACCESS_public)
    6674              $C$DW$673       .dwtag  DW_TAG_member
    6675                      .dwattr $C$DW$673, DW_AT_type(*$C$DW$T$50)
    6676                      .dwattr $C$DW$673, DW_AT_name("trajHandle_spd")
    6677                      .dwattr $C$DW$673, DW_AT_TI_symbol_name("_trajHandle_spd")
    6678                      .dwattr $C$DW$673, DW_AT_data_member_location[DW_OP_plus_uconst 0x6c]
    6679                      .dwattr $C$DW$673, DW_AT_accessibility(DW_ACCESS_public)
    6680              $C$DW$674       .dwtag  DW_TAG_member
    6681                      .dwattr $C$DW$674, DW_AT_type(*$C$DW$T$51)
    6682                      .dwattr $C$DW$674, DW_AT_name("traj_spd")
    6683                      .dwattr $C$DW$674, DW_AT_TI_symbol_name("_traj_spd")
    6684                      .dwattr $C$DW$674, DW_AT_data_member_location[DW_OP_plus_uconst 0x6e]
    6685                      .dwattr $C$DW$674, DW_AT_accessibility(DW_ACCESS_public)
    6686              $C$DW$675       .dwtag  DW_TAG_member
    6687                      .dwattr $C$DW$675, DW_AT_type(*$C$DW$T$50)
    6688                      .dwattr $C$DW$675, DW_AT_name("trajHandle_spdMax")
    6689                      .dwattr $C$DW$675, DW_AT_TI_symbol_name("_trajHandle_spdMax")
    6690                      .dwattr $C$DW$675, DW_AT_data_member_location[DW_OP_plus_uconst 0x78]
    6691                      .dwattr $C$DW$675, DW_AT_accessibility(DW_ACCESS_public)
    6692              $C$DW$676       .dwtag  DW_TAG_member
    6693                      .dwattr $C$DW$676, DW_AT_type(*$C$DW$T$51)
    6694                      .dwattr $C$DW$676, DW_AT_name("traj_spdMax")
TMS320C2000 Assembler PC v6.2.5 Fri Oct 13 15:05:16 2017

Tools Copyright (c) 1996-2014 Texas Instruments Incorporated
C:\Users\wmj\AppData\Local\Temp\1488411                              PAGE  136

    6695                      .dwattr $C$DW$676, DW_AT_TI_symbol_name("_traj_spdMax")
    6696                      .dwattr $C$DW$676, DW_AT_data_member_location[DW_OP_plus_uconst 0x7a]
    6697                      .dwattr $C$DW$676, DW_AT_accessibility(DW_ACCESS_public)
    6698              $C$DW$677       .dwtag  DW_TAG_member
    6699                      .dwattr $C$DW$677, DW_AT_type(*$C$DW$T$52)
    6700                      .dwattr $C$DW$677, DW_AT_name("motorParams")
    6701                      .dwattr $C$DW$677, DW_AT_TI_symbol_name("_motorParams")
    6702                      .dwattr $C$DW$677, DW_AT_data_member_location[DW_OP_plus_uconst 0x84]
    6703                      .dwattr $C$DW$677, DW_AT_accessibility(DW_ACCESS_public)
    6704              $C$DW$678       .dwtag  DW_TAG_member
    6705                      .dwattr $C$DW$678, DW_AT_type(*$C$DW$T$55)
    6706                      .dwattr $C$DW$678, DW_AT_name("waitTimes")
    6707                      .dwattr $C$DW$678, DW_AT_TI_symbol_name("_waitTimes")
    6708                      .dwattr $C$DW$678, DW_AT_data_member_location[DW_OP_plus_uconst 0x92]
    6709                      .dwattr $C$DW$678, DW_AT_accessibility(DW_ACCESS_public)
    6710              $C$DW$679       .dwtag  DW_TAG_member
    6711                      .dwattr $C$DW$679, DW_AT_type(*$C$DW$T$54)
    6712                      .dwattr $C$DW$679, DW_AT_name("counter_state")
    6713                      .dwattr $C$DW$679, DW_AT_TI_symbol_name("_counter_state")
    6714                      .dwattr $C$DW$679, DW_AT_data_member_location[DW_OP_plus_uconst 0x9a]
    6715                      .dwattr $C$DW$679, DW_AT_accessibility(DW_ACCESS_public)
    6716              $C$DW$680       .dwtag  DW_TAG_member
    6717                      .dwattr $C$DW$680, DW_AT_type(*$C$DW$T$56)
    6718                      .dwattr $C$DW$680, DW_AT_name("numIsrTicksPerCtrlTick")
    6719                      .dwattr $C$DW$680, DW_AT_TI_symbol_name("_numIsrTicksPerCtrlTick")
    6720                      .dwattr $C$DW$680, DW_AT_data_member_location[DW_OP_plus_uconst 0x9c]
    6721                      .dwattr $C$DW$680, DW_AT_accessibility(DW_ACCESS_public)
    6722              $C$DW$681       .dwtag  DW_TAG_member
    6723                      .dwattr $C$DW$681, DW_AT_type(*$C$DW$T$56)
    6724                      .dwattr $C$DW$681, DW_AT_name("numCtrlTicksPerCurrentTick")
    6725                      .dwattr $C$DW$681, DW_AT_TI_symbol_name("_numCtrlTicksPerCurrentTick")
    6726                      .dwattr $C$DW$681, DW_AT_data_member_location[DW_OP_plus_uconst 0x9d]
    6727                      .dwattr $C$DW$681, DW_AT_accessibility(DW_ACCESS_public)
    6728              $C$DW$682       .dwtag  DW_TAG_member
    6729                      .dwattr $C$DW$682, DW_AT_type(*$C$DW$T$56)
    6730                      .dwattr $C$DW$682, DW_AT_name("numCtrlTicksPerSpeedTick")
    6731                      .dwattr $C$DW$682, DW_AT_TI_symbol_name("_numCtrlTicksPerSpeedTick")
    6732                      .dwattr $C$DW$682, DW_AT_data_member_location[DW_OP_plus_uconst 0x9e]
    6733                      .dwattr $C$DW$682, DW_AT_accessibility(DW_ACCESS_public)
    6734              $C$DW$683       .dwtag  DW_TAG_member
    6735                      .dwattr $C$DW$683, DW_AT_type(*$C$DW$T$56)
    6736                      .dwattr $C$DW$683, DW_AT_name("numCtrlTicksPerTrajTick")
    6737                      .dwattr $C$DW$683, DW_AT_TI_symbol_name("_numCtrlTicksPerTrajTick")
    6738                      .dwattr $C$DW$683, DW_AT_data_member_location[DW_OP_plus_uconst 0x9f]
    6739                      .dwattr $C$DW$683, DW_AT_accessibility(DW_ACCESS_public)
    6740              $C$DW$684       .dwtag  DW_TAG_member
    6741                      .dwattr $C$DW$684, DW_AT_type(*$C$DW$T$54)
    6742                      .dwattr $C$DW$684, DW_AT_name("ctrlFreq_Hz")
    6743                      .dwattr $C$DW$684, DW_AT_TI_symbol_name("_ctrlFreq_Hz")
    6744                      .dwattr $C$DW$684, DW_AT_data_member_location[DW_OP_plus_uconst 0xa0]
    6745                      .dwattr $C$DW$684, DW_AT_accessibility(DW_ACCESS_public)
    6746              $C$DW$685       .dwtag  DW_TAG_member
    6747                      .dwattr $C$DW$685, DW_AT_type(*$C$DW$T$54)
    6748                      .dwattr $C$DW$685, DW_AT_name("trajFreq_Hz")
    6749                      .dwattr $C$DW$685, DW_AT_TI_symbol_name("_trajFreq_Hz")
TMS320C2000 Assembler PC v6.2.5 Fri Oct 13 15:05:16 2017

Tools Copyright (c) 1996-2014 Texas Instruments Incorporated
C:\Users\wmj\AppData\Local\Temp\1488411                              PAGE  137

    6750                      .dwattr $C$DW$685, DW_AT_data_member_location[DW_OP_plus_uconst 0xa2]
    6751                      .dwattr $C$DW$685, DW_AT_accessibility(DW_ACCESS_public)
    6752              $C$DW$686       .dwtag  DW_TAG_member
    6753                      .dwattr $C$DW$686, DW_AT_type(*$C$DW$T$20)
    6754                      .dwattr $C$DW$686, DW_AT_name("trajPeriod_sec")
    6755                      .dwattr $C$DW$686, DW_AT_TI_symbol_name("_trajPeriod_sec")
    6756                      .dwattr $C$DW$686, DW_AT_data_member_location[DW_OP_plus_uconst 0xa4]
    6757                      .dwattr $C$DW$686, DW_AT_accessibility(DW_ACCESS_public)
    6758              $C$DW$687       .dwtag  DW_TAG_member
    6759                      .dwattr $C$DW$687, DW_AT_type(*$C$DW$T$57)
    6760                      .dwattr $C$DW$687, DW_AT_name("ctrlPeriod_sec")
    6761                      .dwattr $C$DW$687, DW_AT_TI_symbol_name("_ctrlPeriod_sec")
    6762                      .dwattr $C$DW$687, DW_AT_data_member_location[DW_OP_plus_uconst 0xa6]
    6763                      .dwattr $C$DW$687, DW_AT_accessibility(DW_ACCESS_public)
    6764              $C$DW$688       .dwtag  DW_TAG_member
    6765                      .dwattr $C$DW$688, DW_AT_type(*$C$DW$T$20)
    6766                      .dwattr $C$DW$688, DW_AT_name("maxVsMag_pu")
    6767                      .dwattr $C$DW$688, DW_AT_TI_symbol_name("_maxVsMag_pu")
    6768                      .dwattr $C$DW$688, DW_AT_data_member_location[DW_OP_plus_uconst 0xa8]
    6769                      .dwattr $C$DW$688, DW_AT_accessibility(DW_ACCESS_public)
    6770              $C$DW$689       .dwtag  DW_TAG_member
    6771                      .dwattr $C$DW$689, DW_AT_type(*$C$DW$T$21)
    6772                      .dwattr $C$DW$689, DW_AT_name("Iab_in")
    6773                      .dwattr $C$DW$689, DW_AT_TI_symbol_name("_Iab_in")
    6774                      .dwattr $C$DW$689, DW_AT_data_member_location[DW_OP_plus_uconst 0xaa]
    6775                      .dwattr $C$DW$689, DW_AT_accessibility(DW_ACCESS_public)
    6776              $C$DW$690       .dwtag  DW_TAG_member
    6777                      .dwattr $C$DW$690, DW_AT_type(*$C$DW$T$21)
    6778                      .dwattr $C$DW$690, DW_AT_name("Iab_filt")
    6779                      .dwattr $C$DW$690, DW_AT_TI_symbol_name("_Iab_filt")
    6780                      .dwattr $C$DW$690, DW_AT_data_member_location[DW_OP_plus_uconst 0xae]
    6781                      .dwattr $C$DW$690, DW_AT_accessibility(DW_ACCESS_public)
    6782              $C$DW$691       .dwtag  DW_TAG_member
    6783                      .dwattr $C$DW$691, DW_AT_type(*$C$DW$T$21)
    6784                      .dwattr $C$DW$691, DW_AT_name("Idq_in")
    6785                      .dwattr $C$DW$691, DW_AT_TI_symbol_name("_Idq_in")
    6786                      .dwattr $C$DW$691, DW_AT_data_member_location[DW_OP_plus_uconst 0xb2]
    6787                      .dwattr $C$DW$691, DW_AT_accessibility(DW_ACCESS_public)
    6788              $C$DW$692       .dwtag  DW_TAG_member
    6789                      .dwattr $C$DW$692, DW_AT_type(*$C$DW$T$21)
    6790                      .dwattr $C$DW$692, DW_AT_name("Vab_in")
    6791                      .dwattr $C$DW$692, DW_AT_TI_symbol_name("_Vab_in")
    6792                      .dwattr $C$DW$692, DW_AT_data_member_location[DW_OP_plus_uconst 0xb6]
    6793                      .dwattr $C$DW$692, DW_AT_accessibility(DW_ACCESS_public)
    6794              $C$DW$693       .dwtag  DW_TAG_member
    6795                      .dwattr $C$DW$693, DW_AT_type(*$C$DW$T$20)
    6796                      .dwattr $C$DW$693, DW_AT_name("spd_out")
    6797                      .dwattr $C$DW$693, DW_AT_TI_symbol_name("_spd_out")
    6798                      .dwattr $C$DW$693, DW_AT_data_member_location[DW_OP_plus_uconst 0xba]
    6799                      .dwattr $C$DW$693, DW_AT_accessibility(DW_ACCESS_public)
    6800              $C$DW$694       .dwtag  DW_TAG_member
    6801                      .dwattr $C$DW$694, DW_AT_type(*$C$DW$T$21)
    6802                      .dwattr $C$DW$694, DW_AT_name("Vab_out")
    6803                      .dwattr $C$DW$694, DW_AT_TI_symbol_name("_Vab_out")
    6804                      .dwattr $C$DW$694, DW_AT_data_member_location[DW_OP_plus_uconst 0xbc]
TMS320C2000 Assembler PC v6.2.5 Fri Oct 13 15:05:16 2017

Tools Copyright (c) 1996-2014 Texas Instruments Incorporated
C:\Users\wmj\AppData\Local\Temp\1488411                              PAGE  138

    6805                      .dwattr $C$DW$694, DW_AT_accessibility(DW_ACCESS_public)
    6806              $C$DW$695       .dwtag  DW_TAG_member
    6807                      .dwattr $C$DW$695, DW_AT_type(*$C$DW$T$21)
    6808                      .dwattr $C$DW$695, DW_AT_name("Vdq_out")
    6809                      .dwattr $C$DW$695, DW_AT_TI_symbol_name("_Vdq_out")
    6810                      .dwattr $C$DW$695, DW_AT_data_member_location[DW_OP_plus_uconst 0xc0]
    6811                      .dwattr $C$DW$695, DW_AT_accessibility(DW_ACCESS_public)
    6812              $C$DW$696       .dwtag  DW_TAG_member
    6813                      .dwattr $C$DW$696, DW_AT_type(*$C$DW$T$57)
    6814                      .dwattr $C$DW$696, DW_AT_name("Rhf")
    6815                      .dwattr $C$DW$696, DW_AT_TI_symbol_name("_Rhf")
    6816                      .dwattr $C$DW$696, DW_AT_data_member_location[DW_OP_plus_uconst 0xc4]
    6817                      .dwattr $C$DW$696, DW_AT_accessibility(DW_ACCESS_public)
    6818              $C$DW$697       .dwtag  DW_TAG_member
    6819                      .dwattr $C$DW$697, DW_AT_type(*$C$DW$T$57)
    6820                      .dwattr $C$DW$697, DW_AT_name("Lhf")
    6821                      .dwattr $C$DW$697, DW_AT_TI_symbol_name("_Lhf")
    6822                      .dwattr $C$DW$697, DW_AT_data_member_location[DW_OP_plus_uconst 0xc6]
    6823                      .dwattr $C$DW$697, DW_AT_accessibility(DW_ACCESS_public)
    6824              $C$DW$698       .dwtag  DW_TAG_member
    6825                      .dwattr $C$DW$698, DW_AT_type(*$C$DW$T$57)
    6826                      .dwattr $C$DW$698, DW_AT_name("RoverL")
    6827                      .dwattr $C$DW$698, DW_AT_TI_symbol_name("_RoverL")
    6828                      .dwattr $C$DW$698, DW_AT_data_member_location[DW_OP_plus_uconst 0xc8]
    6829                      .dwattr $C$DW$698, DW_AT_accessibility(DW_ACCESS_public)
    6830              $C$DW$699       .dwtag  DW_TAG_member
    6831                      .dwattr $C$DW$699, DW_AT_type(*$C$DW$T$20)
    6832                      .dwattr $C$DW$699, DW_AT_name("Kp_Id")
    6833                      .dwattr $C$DW$699, DW_AT_TI_symbol_name("_Kp_Id")
    6834                      .dwattr $C$DW$699, DW_AT_data_member_location[DW_OP_plus_uconst 0xca]
    6835                      .dwattr $C$DW$699, DW_AT_accessibility(DW_ACCESS_public)
    6836              $C$DW$700       .dwtag  DW_TAG_member
    6837                      .dwattr $C$DW$700, DW_AT_type(*$C$DW$T$20)
    6838                      .dwattr $C$DW$700, DW_AT_name("Kp_Iq")
    6839                      .dwattr $C$DW$700, DW_AT_TI_symbol_name("_Kp_Iq")
    6840                      .dwattr $C$DW$700, DW_AT_data_member_location[DW_OP_plus_uconst 0xcc]
    6841                      .dwattr $C$DW$700, DW_AT_accessibility(DW_ACCESS_public)
    6842              $C$DW$701       .dwtag  DW_TAG_member
    6843                      .dwattr $C$DW$701, DW_AT_type(*$C$DW$T$20)
    6844                      .dwattr $C$DW$701, DW_AT_name("Kp_spd")
    6845                      .dwattr $C$DW$701, DW_AT_TI_symbol_name("_Kp_spd")
    6846                      .dwattr $C$DW$701, DW_AT_data_member_location[DW_OP_plus_uconst 0xce]
    6847                      .dwattr $C$DW$701, DW_AT_accessibility(DW_ACCESS_public)
    6848              $C$DW$702       .dwtag  DW_TAG_member
    6849                      .dwattr $C$DW$702, DW_AT_type(*$C$DW$T$20)
    6850                      .dwattr $C$DW$702, DW_AT_name("Ki_Id")
    6851                      .dwattr $C$DW$702, DW_AT_TI_symbol_name("_Ki_Id")
    6852                      .dwattr $C$DW$702, DW_AT_data_member_location[DW_OP_plus_uconst 0xd0]
    6853                      .dwattr $C$DW$702, DW_AT_accessibility(DW_ACCESS_public)
    6854              $C$DW$703       .dwtag  DW_TAG_member
    6855                      .dwattr $C$DW$703, DW_AT_type(*$C$DW$T$20)
    6856                      .dwattr $C$DW$703, DW_AT_name("Ki_Iq")
    6857                      .dwattr $C$DW$703, DW_AT_TI_symbol_name("_Ki_Iq")
    6858                      .dwattr $C$DW$703, DW_AT_data_member_location[DW_OP_plus_uconst 0xd2]
    6859                      .dwattr $C$DW$703, DW_AT_accessibility(DW_ACCESS_public)
TMS320C2000 Assembler PC v6.2.5 Fri Oct 13 15:05:16 2017

Tools Copyright (c) 1996-2014 Texas Instruments Incorporated
C:\Users\wmj\AppData\Local\Temp\1488411                              PAGE  139

    6860              $C$DW$704       .dwtag  DW_TAG_member
    6861                      .dwattr $C$DW$704, DW_AT_type(*$C$DW$T$20)
    6862                      .dwattr $C$DW$704, DW_AT_name("Ki_spd")
    6863                      .dwattr $C$DW$704, DW_AT_TI_symbol_name("_Ki_spd")
    6864                      .dwattr $C$DW$704, DW_AT_data_member_location[DW_OP_plus_uconst 0xd4]
    6865                      .dwattr $C$DW$704, DW_AT_accessibility(DW_ACCESS_public)
    6866              $C$DW$705       .dwtag  DW_TAG_member
    6867                      .dwattr $C$DW$705, DW_AT_type(*$C$DW$T$20)
    6868                      .dwattr $C$DW$705, DW_AT_name("Kd_Id")
    6869                      .dwattr $C$DW$705, DW_AT_TI_symbol_name("_Kd_Id")
    6870                      .dwattr $C$DW$705, DW_AT_data_member_location[DW_OP_plus_uconst 0xd6]
    6871                      .dwattr $C$DW$705, DW_AT_accessibility(DW_ACCESS_public)
    6872              $C$DW$706       .dwtag  DW_TAG_member
    6873                      .dwattr $C$DW$706, DW_AT_type(*$C$DW$T$20)
    6874                      .dwattr $C$DW$706, DW_AT_name("Kd_Iq")
    6875                      .dwattr $C$DW$706, DW_AT_TI_symbol_name("_Kd_Iq")
    6876                      .dwattr $C$DW$706, DW_AT_data_member_location[DW_OP_plus_uconst 0xd8]
    6877                      .dwattr $C$DW$706, DW_AT_accessibility(DW_ACCESS_public)
    6878              $C$DW$707       .dwtag  DW_TAG_member
    6879                      .dwattr $C$DW$707, DW_AT_type(*$C$DW$T$20)
    6880                      .dwattr $C$DW$707, DW_AT_name("Kd_spd")
    6881                      .dwattr $C$DW$707, DW_AT_TI_symbol_name("_Kd_spd")
    6882                      .dwattr $C$DW$707, DW_AT_data_member_location[DW_OP_plus_uconst 0xda]
    6883                      .dwattr $C$DW$707, DW_AT_accessibility(DW_ACCESS_public)
    6884              $C$DW$708       .dwtag  DW_TAG_member
    6885                      .dwattr $C$DW$708, DW_AT_type(*$C$DW$T$20)
    6886                      .dwattr $C$DW$708, DW_AT_name("Ui_Id")
    6887                      .dwattr $C$DW$708, DW_AT_TI_symbol_name("_Ui_Id")
    6888                      .dwattr $C$DW$708, DW_AT_data_member_location[DW_OP_plus_uconst 0xdc]
    6889                      .dwattr $C$DW$708, DW_AT_accessibility(DW_ACCESS_public)
    6890              $C$DW$709       .dwtag  DW_TAG_member
    6891                      .dwattr $C$DW$709, DW_AT_type(*$C$DW$T$20)
    6892                      .dwattr $C$DW$709, DW_AT_name("Ui_Iq")
    6893                      .dwattr $C$DW$709, DW_AT_TI_symbol_name("_Ui_Iq")
    6894                      .dwattr $C$DW$709, DW_AT_data_member_location[DW_OP_plus_uconst 0xde]
    6895                      .dwattr $C$DW$709, DW_AT_accessibility(DW_ACCESS_public)
    6896              $C$DW$710       .dwtag  DW_TAG_member
    6897                      .dwattr $C$DW$710, DW_AT_type(*$C$DW$T$20)
    6898                      .dwattr $C$DW$710, DW_AT_name("Ui_spd")
    6899                      .dwattr $C$DW$710, DW_AT_TI_symbol_name("_Ui_spd")
    6900                      .dwattr $C$DW$710, DW_AT_data_member_location[DW_OP_plus_uconst 0xe0]
    6901                      .dwattr $C$DW$710, DW_AT_accessibility(DW_ACCESS_public)
    6902              $C$DW$711       .dwtag  DW_TAG_member
    6903                      .dwattr $C$DW$711, DW_AT_type(*$C$DW$T$21)
    6904                      .dwattr $C$DW$711, DW_AT_name("Idq_ref")
    6905                      .dwattr $C$DW$711, DW_AT_TI_symbol_name("_Idq_ref")
    6906                      .dwattr $C$DW$711, DW_AT_data_member_location[DW_OP_plus_uconst 0xe2]
    6907                      .dwattr $C$DW$711, DW_AT_accessibility(DW_ACCESS_public)
    6908              $C$DW$712       .dwtag  DW_TAG_member
    6909                      .dwattr $C$DW$712, DW_AT_type(*$C$DW$T$20)
    6910                      .dwattr $C$DW$712, DW_AT_name("IdRated")
    6911                      .dwattr $C$DW$712, DW_AT_TI_symbol_name("_IdRated")
    6912                      .dwattr $C$DW$712, DW_AT_data_member_location[DW_OP_plus_uconst 0xe6]
    6913                      .dwattr $C$DW$712, DW_AT_accessibility(DW_ACCESS_public)
    6914              $C$DW$713       .dwtag  DW_TAG_member
TMS320C2000 Assembler PC v6.2.5 Fri Oct 13 15:05:16 2017

Tools Copyright (c) 1996-2014 Texas Instruments Incorporated
C:\Users\wmj\AppData\Local\Temp\1488411                              PAGE  140

    6915                      .dwattr $C$DW$713, DW_AT_type(*$C$DW$T$20)
    6916                      .dwattr $C$DW$713, DW_AT_name("spd_ref")
    6917                      .dwattr $C$DW$713, DW_AT_TI_symbol_name("_spd_ref")
    6918                      .dwattr $C$DW$713, DW_AT_data_member_location[DW_OP_plus_uconst 0xe8]
    6919                      .dwattr $C$DW$713, DW_AT_accessibility(DW_ACCESS_public)
    6920              $C$DW$714       .dwtag  DW_TAG_member
    6921                      .dwattr $C$DW$714, DW_AT_type(*$C$DW$T$20)
    6922                      .dwattr $C$DW$714, DW_AT_name("spd_max")
    6923                      .dwattr $C$DW$714, DW_AT_TI_symbol_name("_spd_max")
    6924                      .dwattr $C$DW$714, DW_AT_data_member_location[DW_OP_plus_uconst 0xea]
    6925                      .dwattr $C$DW$714, DW_AT_accessibility(DW_ACCESS_public)
    6926              $C$DW$715       .dwtag  DW_TAG_member
    6927                      .dwattr $C$DW$715, DW_AT_type(*$C$DW$T$56)
    6928                      .dwattr $C$DW$715, DW_AT_name("counter_current")
    6929                      .dwattr $C$DW$715, DW_AT_TI_symbol_name("_counter_current")
    6930                      .dwattr $C$DW$715, DW_AT_data_member_location[DW_OP_plus_uconst 0xec]
    6931                      .dwattr $C$DW$715, DW_AT_accessibility(DW_ACCESS_public)
    6932              $C$DW$716       .dwtag  DW_TAG_member
    6933                      .dwattr $C$DW$716, DW_AT_type(*$C$DW$T$56)
    6934                      .dwattr $C$DW$716, DW_AT_name("counter_isr")
    6935                      .dwattr $C$DW$716, DW_AT_TI_symbol_name("_counter_isr")
    6936                      .dwattr $C$DW$716, DW_AT_data_member_location[DW_OP_plus_uconst 0xed]
    6937                      .dwattr $C$DW$716, DW_AT_accessibility(DW_ACCESS_public)
    6938              $C$DW$717       .dwtag  DW_TAG_member
    6939                      .dwattr $C$DW$717, DW_AT_type(*$C$DW$T$56)
    6940                      .dwattr $C$DW$717, DW_AT_name("counter_speed")
    6941                      .dwattr $C$DW$717, DW_AT_TI_symbol_name("_counter_speed")
    6942                      .dwattr $C$DW$717, DW_AT_data_member_location[DW_OP_plus_uconst 0xee]
    6943                      .dwattr $C$DW$717, DW_AT_accessibility(DW_ACCESS_public)
    6944              $C$DW$718       .dwtag  DW_TAG_member
    6945                      .dwattr $C$DW$718, DW_AT_type(*$C$DW$T$56)
    6946                      .dwattr $C$DW$718, DW_AT_name("counter_traj")
    6947                      .dwattr $C$DW$718, DW_AT_TI_symbol_name("_counter_traj")
    6948                      .dwattr $C$DW$718, DW_AT_data_member_location[DW_OP_plus_uconst 0xef]
    6949                      .dwattr $C$DW$718, DW_AT_accessibility(DW_ACCESS_public)
    6950              $C$DW$719       .dwtag  DW_TAG_member
    6951                      .dwattr $C$DW$719, DW_AT_type(*$C$DW$T$22)
    6952                      .dwattr $C$DW$719, DW_AT_name("flag_enableCtrl")
    6953                      .dwattr $C$DW$719, DW_AT_TI_symbol_name("_flag_enableCtrl")
    6954                      .dwattr $C$DW$719, DW_AT_data_member_location[DW_OP_plus_uconst 0xf0]
    6955                      .dwattr $C$DW$719, DW_AT_accessibility(DW_ACCESS_public)
    6956              $C$DW$720       .dwtag  DW_TAG_member
    6957                      .dwattr $C$DW$720, DW_AT_type(*$C$DW$T$22)
    6958                      .dwattr $C$DW$720, DW_AT_name("flag_enableDcBusComp")
    6959                      .dwattr $C$DW$720, DW_AT_TI_symbol_name("_flag_enableDcBusComp")
    6960                      .dwattr $C$DW$720, DW_AT_data_member_location[DW_OP_plus_uconst 0xf1]
    6961                      .dwattr $C$DW$720, DW_AT_accessibility(DW_ACCESS_public)
    6962              $C$DW$721       .dwtag  DW_TAG_member
    6963                      .dwattr $C$DW$721, DW_AT_type(*$C$DW$T$22)
    6964                      .dwattr $C$DW$721, DW_AT_name("flag_enablePowerWarp")
    6965                      .dwattr $C$DW$721, DW_AT_TI_symbol_name("_flag_enablePowerWarp")
    6966                      .dwattr $C$DW$721, DW_AT_data_member_location[DW_OP_plus_uconst 0xf2]
    6967                      .dwattr $C$DW$721, DW_AT_accessibility(DW_ACCESS_public)
    6968              $C$DW$722       .dwtag  DW_TAG_member
    6969                      .dwattr $C$DW$722, DW_AT_type(*$C$DW$T$22)
TMS320C2000 Assembler PC v6.2.5 Fri Oct 13 15:05:16 2017

Tools Copyright (c) 1996-2014 Texas Instruments Incorporated
C:\Users\wmj\AppData\Local\Temp\1488411                              PAGE  141

    6970                      .dwattr $C$DW$722, DW_AT_name("flag_enableOffset")
    6971                      .dwattr $C$DW$722, DW_AT_TI_symbol_name("_flag_enableOffset")
    6972                      .dwattr $C$DW$722, DW_AT_data_member_location[DW_OP_plus_uconst 0xf3]
    6973                      .dwattr $C$DW$722, DW_AT_accessibility(DW_ACCESS_public)
    6974              $C$DW$723       .dwtag  DW_TAG_member
    6975                      .dwattr $C$DW$723, DW_AT_type(*$C$DW$T$22)
    6976                      .dwattr $C$DW$723, DW_AT_name("flag_enableSpeedCtrl")
    6977                      .dwattr $C$DW$723, DW_AT_TI_symbol_name("_flag_enableSpeedCtrl")
    6978                      .dwattr $C$DW$723, DW_AT_data_member_location[DW_OP_plus_uconst 0xf4]
    6979                      .dwattr $C$DW$723, DW_AT_accessibility(DW_ACCESS_public)
    6980              $C$DW$724       .dwtag  DW_TAG_member
    6981                      .dwattr $C$DW$724, DW_AT_type(*$C$DW$T$22)
    6982                      .dwattr $C$DW$724, DW_AT_name("flag_enableUserMotorParams")
    6983                      .dwattr $C$DW$724, DW_AT_TI_symbol_name("_flag_enableUserMotorParams")
    6984                      .dwattr $C$DW$724, DW_AT_data_member_location[DW_OP_plus_uconst 0xf5]
    6985                      .dwattr $C$DW$724, DW_AT_accessibility(DW_ACCESS_public)
    6986              $C$DW$725       .dwtag  DW_TAG_member
    6987                      .dwattr $C$DW$725, DW_AT_type(*$C$DW$T$21)
    6988                      .dwattr $C$DW$725, DW_AT_name("Idq_offset_pu")
    6989                      .dwattr $C$DW$725, DW_AT_TI_symbol_name("_Idq_offset_pu")
    6990                      .dwattr $C$DW$725, DW_AT_data_member_location[DW_OP_plus_uconst 0xf6]
    6991                      .dwattr $C$DW$725, DW_AT_accessibility(DW_ACCESS_public)
    6992              $C$DW$726       .dwtag  DW_TAG_member
    6993                      .dwattr $C$DW$726, DW_AT_type(*$C$DW$T$21)
    6994                      .dwattr $C$DW$726, DW_AT_name("Vdq_offset_pu")
    6995                      .dwattr $C$DW$726, DW_AT_TI_symbol_name("_Vdq_offset_pu")
    6996                      .dwattr $C$DW$726, DW_AT_data_member_location[DW_OP_plus_uconst 0xfa]
    6997                      .dwattr $C$DW$726, DW_AT_accessibility(DW_ACCESS_public)
    6998              $C$DW$727       .dwtag  DW_TAG_member
    6999                      .dwattr $C$DW$727, DW_AT_type(*$C$DW$T$20)
    7000                      .dwattr $C$DW$727, DW_AT_name("angle_pu")
    7001                      .dwattr $C$DW$727, DW_AT_TI_symbol_name("_angle_pu")
    7002                      .dwattr $C$DW$727, DW_AT_data_member_location[DW_OP_plus_uconst 0xfe]
    7003                      .dwattr $C$DW$727, DW_AT_accessibility(DW_ACCESS_public)
    7004              $C$DW$728       .dwtag  DW_TAG_member
    7005                      .dwattr $C$DW$728, DW_AT_type(*$C$DW$T$20)
    7006                      .dwattr $C$DW$728, DW_AT_name("speed_ref_pu")
    7007                      .dwattr $C$DW$728, DW_AT_TI_symbol_name("_speed_ref_pu")
    7008                      .dwattr $C$DW$728, DW_AT_data_member_location[DW_OP_plus_uconst 0x100]
    7009                      .dwattr $C$DW$728, DW_AT_accessibility(DW_ACCESS_public)
    7010              $C$DW$729       .dwtag  DW_TAG_member
    7011                      .dwattr $C$DW$729, DW_AT_type(*$C$DW$T$20)
    7012                      .dwattr $C$DW$729, DW_AT_name("speed_fb_pu")
    7013                      .dwattr $C$DW$729, DW_AT_TI_symbol_name("_speed_fb_pu")
    7014                      .dwattr $C$DW$729, DW_AT_data_member_location[DW_OP_plus_uconst 0x102]
    7015                      .dwattr $C$DW$729, DW_AT_accessibility(DW_ACCESS_public)
    7016              $C$DW$730       .dwtag  DW_TAG_member
    7017                      .dwattr $C$DW$730, DW_AT_type(*$C$DW$T$20)
    7018                      .dwattr $C$DW$730, DW_AT_name("speed_outMax_pu")
    7019                      .dwattr $C$DW$730, DW_AT_TI_symbol_name("_speed_outMax_pu")
    7020                      .dwattr $C$DW$730, DW_AT_data_member_location[DW_OP_plus_uconst 0x104]
    7021                      .dwattr $C$DW$730, DW_AT_accessibility(DW_ACCESS_public)
    7022              $C$DW$731       .dwtag  DW_TAG_member
    7023                      .dwattr $C$DW$731, DW_AT_type(*$C$DW$T$22)
    7024                      .dwattr $C$DW$731, DW_AT_name("flag_enableCurrentCtrl")
TMS320C2000 Assembler PC v6.2.5 Fri Oct 13 15:05:16 2017

Tools Copyright (c) 1996-2014 Texas Instruments Incorporated
C:\Users\wmj\AppData\Local\Temp\1488411                              PAGE  142

    7025                      .dwattr $C$DW$731, DW_AT_TI_symbol_name("_flag_enableCurrentCtrl")
    7026                      .dwattr $C$DW$731, DW_AT_data_member_location[DW_OP_plus_uconst 0x106]
    7027                      .dwattr $C$DW$731, DW_AT_accessibility(DW_ACCESS_public)
    7028              $C$DW$732       .dwtag  DW_TAG_member
    7029                      .dwattr $C$DW$732, DW_AT_type(*$C$DW$T$59)
    7030                      .dwattr $C$DW$732, DW_AT_name("brakeHandle")
    7031                      .dwattr $C$DW$732, DW_AT_TI_symbol_name("_brakeHandle")
    7032                      .dwattr $C$DW$732, DW_AT_data_member_location[DW_OP_plus_uconst 0x108]
    7033                      .dwattr $C$DW$732, DW_AT_accessibility(DW_ACCESS_public)
    7034              $C$DW$733       .dwtag  DW_TAG_member
    7035                      .dwattr $C$DW$733, DW_AT_type(*$C$DW$T$60)
    7036                      .dwattr $C$DW$733, DW_AT_name("brake")
    7037                      .dwattr $C$DW$733, DW_AT_TI_symbol_name("_brake")
    7038                      .dwattr $C$DW$733, DW_AT_data_member_location[DW_OP_plus_uconst 0x10a]
    7039                      .dwattr $C$DW$733, DW_AT_accessibility(DW_ACCESS_public)
    7040                      .dwendtag $C$DW$T$61
    7041              
    7042              $C$DW$T$91      .dwtag  DW_TAG_typedef, DW_AT_name("CTRL_Obj")
    7043                      .dwattr $C$DW$T$91, DW_AT_type(*$C$DW$T$61)
    7044                      .dwattr $C$DW$T$91, DW_AT_language(DW_LANG_C)
    7045              $C$DW$T$92      .dwtag  DW_TAG_pointer_type
    7046                      .dwattr $C$DW$T$92, DW_AT_type(*$C$DW$T$61)
    7047                      .dwattr $C$DW$T$92, DW_AT_address_class(0x16)
    7048              $C$DW$T$93      .dwtag  DW_TAG_typedef, DW_AT_name("CTRL_Handle")
    7049                      .dwattr $C$DW$T$93, DW_AT_type(*$C$DW$T$92)
    7050                      .dwattr $C$DW$T$93, DW_AT_language(DW_LANG_C)
    7051              $C$DW$734       .dwtag  DW_TAG_TI_far_type
    7052                      .dwattr $C$DW$734, DW_AT_type(*$C$DW$T$93)
    7053              $C$DW$T$94      .dwtag  DW_TAG_const_type
    7054                      .dwattr $C$DW$T$94, DW_AT_type(*$C$DW$734)
    7055              
    7056              $C$DW$T$64      .dwtag  DW_TAG_structure_type
    7057                      .dwattr $C$DW$T$64, DW_AT_name("_CTRL_Version_")
    7058                      .dwattr $C$DW$T$64, DW_AT_byte_size(0x04)
    7059              $C$DW$735       .dwtag  DW_TAG_member
    7060                      .dwattr $C$DW$735, DW_AT_type(*$C$DW$T$24)
    7061                      .dwattr $C$DW$735, DW_AT_name("rsvd")
    7062                      .dwattr $C$DW$735, DW_AT_TI_symbol_name("_rsvd")
    7063                      .dwattr $C$DW$735, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    7064                      .dwattr $C$DW$735, DW_AT_accessibility(DW_ACCESS_public)
    7065              $C$DW$736       .dwtag  DW_TAG_member
    7066                      .dwattr $C$DW$736, DW_AT_type(*$C$DW$T$63)
    7067                      .dwattr $C$DW$736, DW_AT_name("targetProc")
    7068                      .dwattr $C$DW$736, DW_AT_TI_symbol_name("_targetProc")
    7069                      .dwattr $C$DW$736, DW_AT_data_member_location[DW_OP_plus_uconst 0x1]
    7070                      .dwattr $C$DW$736, DW_AT_accessibility(DW_ACCESS_public)
    7071              $C$DW$737       .dwtag  DW_TAG_member
    7072                      .dwattr $C$DW$737, DW_AT_type(*$C$DW$T$24)
    7073                      .dwattr $C$DW$737, DW_AT_name("major")
    7074                      .dwattr $C$DW$737, DW_AT_TI_symbol_name("_major")
    7075                      .dwattr $C$DW$737, DW_AT_data_member_location[DW_OP_plus_uconst 0x2]
    7076                      .dwattr $C$DW$737, DW_AT_accessibility(DW_ACCESS_public)
    7077              $C$DW$738       .dwtag  DW_TAG_member
    7078                      .dwattr $C$DW$738, DW_AT_type(*$C$DW$T$24)
    7079                      .dwattr $C$DW$738, DW_AT_name("minor")
TMS320C2000 Assembler PC v6.2.5 Fri Oct 13 15:05:16 2017

Tools Copyright (c) 1996-2014 Texas Instruments Incorporated
C:\Users\wmj\AppData\Local\Temp\1488411                              PAGE  143

    7080                      .dwattr $C$DW$738, DW_AT_TI_symbol_name("_minor")
    7081                      .dwattr $C$DW$738, DW_AT_data_member_location[DW_OP_plus_uconst 0x3]
    7082                      .dwattr $C$DW$738, DW_AT_accessibility(DW_ACCESS_public)
    7083                      .dwendtag $C$DW$T$64
    7084              
    7085              $C$DW$T$27      .dwtag  DW_TAG_typedef, DW_AT_name("CTRL_Version")
    7086                      .dwattr $C$DW$T$27, DW_AT_type(*$C$DW$T$64)
    7087                      .dwattr $C$DW$T$27, DW_AT_language(DW_LANG_C)
    7088              
    7089              $C$DW$T$19      .dwtag  DW_TAG_structure_type
    7090                      .dwattr $C$DW$T$19, DW_AT_name("_EST_Obj_")
    7091                      .dwattr $C$DW$T$19, DW_AT_declaration
    7092                      .dwendtag $C$DW$T$19
    7093              
    7094              $C$DW$T$35      .dwtag  DW_TAG_pointer_type
    7095                      .dwattr $C$DW$T$35, DW_AT_type(*$C$DW$T$19)
    7096                      .dwattr $C$DW$T$35, DW_AT_address_class(0x16)
    7097              $C$DW$T$36      .dwtag  DW_TAG_typedef, DW_AT_name("EST_Handle")
    7098                      .dwattr $C$DW$T$36, DW_AT_type(*$C$DW$T$35)
    7099                      .dwattr $C$DW$T$36, DW_AT_language(DW_LANG_C)
    7100              
    7101              $C$DW$T$65      .dwtag  DW_TAG_structure_type
    7102                      .dwattr $C$DW$T$65, DW_AT_name("_IPARK_Obj_")
    7103                      .dwattr $C$DW$T$65, DW_AT_byte_size(0x04)
    7104              $C$DW$739       .dwtag  DW_TAG_member
    7105                      .dwattr $C$DW$739, DW_AT_type(*$C$DW$T$20)
    7106                      .dwattr $C$DW$739, DW_AT_name("sinTh")
    7107                      .dwattr $C$DW$739, DW_AT_TI_symbol_name("_sinTh")
    7108                      .dwattr $C$DW$739, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    7109                      .dwattr $C$DW$739, DW_AT_accessibility(DW_ACCESS_public)
    7110              $C$DW$740       .dwtag  DW_TAG_member
    7111                      .dwattr $C$DW$740, DW_AT_type(*$C$DW$T$20)
    7112                      .dwattr $C$DW$740, DW_AT_name("cosTh")
    7113                      .dwattr $C$DW$740, DW_AT_TI_symbol_name("_cosTh")
    7114                      .dwattr $C$DW$740, DW_AT_data_member_location[DW_OP_plus_uconst 0x2]
    7115                      .dwattr $C$DW$740, DW_AT_accessibility(DW_ACCESS_public)
    7116                      .dwendtag $C$DW$T$65
    7117              
    7118              $C$DW$T$45      .dwtag  DW_TAG_typedef, DW_AT_name("IPARK_Obj")
    7119                      .dwattr $C$DW$T$45, DW_AT_type(*$C$DW$T$65)
    7120                      .dwattr $C$DW$T$45, DW_AT_language(DW_LANG_C)
    7121              $C$DW$T$43      .dwtag  DW_TAG_pointer_type
    7122                      .dwattr $C$DW$T$43, DW_AT_type(*$C$DW$T$65)
    7123                      .dwattr $C$DW$T$43, DW_AT_address_class(0x16)
    7124              $C$DW$T$44      .dwtag  DW_TAG_typedef, DW_AT_name("IPARK_Handle")
    7125                      .dwattr $C$DW$T$44, DW_AT_type(*$C$DW$T$43)
    7126                      .dwattr $C$DW$T$44, DW_AT_language(DW_LANG_C)
    7127              
    7128              $C$DW$T$67      .dwtag  DW_TAG_structure_type
    7129                      .dwattr $C$DW$T$67, DW_AT_name("_MATH_vec2_")
    7130                      .dwattr $C$DW$T$67, DW_AT_byte_size(0x04)
    7131              $C$DW$741       .dwtag  DW_TAG_member
    7132                      .dwattr $C$DW$741, DW_AT_type(*$C$DW$T$66)
    7133                      .dwattr $C$DW$741, DW_AT_name("value")
    7134                      .dwattr $C$DW$741, DW_AT_TI_symbol_name("_value")
TMS320C2000 Assembler PC v6.2.5 Fri Oct 13 15:05:16 2017

Tools Copyright (c) 1996-2014 Texas Instruments Incorporated
C:\Users\wmj\AppData\Local\Temp\1488411                              PAGE  144

    7135                      .dwattr $C$DW$741, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    7136                      .dwattr $C$DW$741, DW_AT_accessibility(DW_ACCESS_public)
    7137                      .dwendtag $C$DW$T$67
    7138              
    7139              $C$DW$T$21      .dwtag  DW_TAG_typedef, DW_AT_name("MATH_vec2")
    7140                      .dwattr $C$DW$T$21, DW_AT_type(*$C$DW$T$67)
    7141                      .dwattr $C$DW$T$21, DW_AT_language(DW_LANG_C)
    7142              
    7143              $C$DW$T$70      .dwtag  DW_TAG_structure_type
    7144                      .dwattr $C$DW$T$70, DW_AT_name("_MOTOR_Params_")
    7145                      .dwattr $C$DW$T$70, DW_AT_byte_size(0x0e)
    7146              $C$DW$742       .dwtag  DW_TAG_member
    7147                      .dwattr $C$DW$742, DW_AT_type(*$C$DW$T$69)
    7148                      .dwattr $C$DW$742, DW_AT_name("type")
    7149                      .dwattr $C$DW$742, DW_AT_TI_symbol_name("_type")
    7150                      .dwattr $C$DW$742, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    7151                      .dwattr $C$DW$742, DW_AT_accessibility(DW_ACCESS_public)
    7152              $C$DW$743       .dwtag  DW_TAG_member
    7153                      .dwattr $C$DW$743, DW_AT_type(*$C$DW$T$56)
    7154                      .dwattr $C$DW$743, DW_AT_name("numPolePairs")
    7155                      .dwattr $C$DW$743, DW_AT_TI_symbol_name("_numPolePairs")
    7156                      .dwattr $C$DW$743, DW_AT_data_member_location[DW_OP_plus_uconst 0x1]
    7157                      .dwattr $C$DW$743, DW_AT_accessibility(DW_ACCESS_public)
    7158              $C$DW$744       .dwtag  DW_TAG_member
    7159                      .dwattr $C$DW$744, DW_AT_type(*$C$DW$T$57)
    7160                      .dwattr $C$DW$744, DW_AT_name("Lr_H")
    7161                      .dwattr $C$DW$744, DW_AT_TI_symbol_name("_Lr_H")
    7162                      .dwattr $C$DW$744, DW_AT_data_member_location[DW_OP_plus_uconst 0x2]
    7163                      .dwattr $C$DW$744, DW_AT_accessibility(DW_ACCESS_public)
    7164              $C$DW$745       .dwtag  DW_TAG_member
    7165                      .dwattr $C$DW$745, DW_AT_type(*$C$DW$T$57)
    7166                      .dwattr $C$DW$745, DW_AT_name("Ls_d_H")
    7167                      .dwattr $C$DW$745, DW_AT_TI_symbol_name("_Ls_d_H")
    7168                      .dwattr $C$DW$745, DW_AT_data_member_location[DW_OP_plus_uconst 0x4]
    7169                      .dwattr $C$DW$745, DW_AT_accessibility(DW_ACCESS_public)
    7170              $C$DW$746       .dwtag  DW_TAG_member
    7171                      .dwattr $C$DW$746, DW_AT_type(*$C$DW$T$57)
    7172                      .dwattr $C$DW$746, DW_AT_name("Ls_q_H")
    7173                      .dwattr $C$DW$746, DW_AT_TI_symbol_name("_Ls_q_H")
    7174                      .dwattr $C$DW$746, DW_AT_data_member_location[DW_OP_plus_uconst 0x6]
    7175                      .dwattr $C$DW$746, DW_AT_accessibility(DW_ACCESS_public)
    7176              $C$DW$747       .dwtag  DW_TAG_member
    7177                      .dwattr $C$DW$747, DW_AT_type(*$C$DW$T$57)
    7178                      .dwattr $C$DW$747, DW_AT_name("Rr_Ohm")
    7179                      .dwattr $C$DW$747, DW_AT_TI_symbol_name("_Rr_Ohm")
    7180                      .dwattr $C$DW$747, DW_AT_data_member_location[DW_OP_plus_uconst 0x8]
    7181                      .dwattr $C$DW$747, DW_AT_accessibility(DW_ACCESS_public)
    7182              $C$DW$748       .dwtag  DW_TAG_member
    7183                      .dwattr $C$DW$748, DW_AT_type(*$C$DW$T$57)
    7184                      .dwattr $C$DW$748, DW_AT_name("Rs_Ohm")
    7185                      .dwattr $C$DW$748, DW_AT_TI_symbol_name("_Rs_Ohm")
    7186                      .dwattr $C$DW$748, DW_AT_data_member_location[DW_OP_plus_uconst 0xa]
    7187                      .dwattr $C$DW$748, DW_AT_accessibility(DW_ACCESS_public)
    7188              $C$DW$749       .dwtag  DW_TAG_member
    7189                      .dwattr $C$DW$749, DW_AT_type(*$C$DW$T$57)
TMS320C2000 Assembler PC v6.2.5 Fri Oct 13 15:05:16 2017

Tools Copyright (c) 1996-2014 Texas Instruments Incorporated
C:\Users\wmj\AppData\Local\Temp\1488411                              PAGE  145

    7190                      .dwattr $C$DW$749, DW_AT_name("ratedFlux_VpHz")
    7191                      .dwattr $C$DW$749, DW_AT_TI_symbol_name("_ratedFlux_VpHz")
    7192                      .dwattr $C$DW$749, DW_AT_data_member_location[DW_OP_plus_uconst 0xc]
    7193                      .dwattr $C$DW$749, DW_AT_accessibility(DW_ACCESS_public)
    7194                      .dwendtag $C$DW$T$70
    7195              
    7196              $C$DW$T$52      .dwtag  DW_TAG_typedef, DW_AT_name("MOTOR_Params")
    7197                      .dwattr $C$DW$T$52, DW_AT_type(*$C$DW$T$70)
    7198                      .dwattr $C$DW$T$52, DW_AT_language(DW_LANG_C)
    7199              
    7200              $C$DW$T$71      .dwtag  DW_TAG_structure_type
    7201                      .dwattr $C$DW$T$71, DW_AT_name("_PARK_Obj_")
    7202                      .dwattr $C$DW$T$71, DW_AT_byte_size(0x04)
    7203              $C$DW$750       .dwtag  DW_TAG_member
    7204                      .dwattr $C$DW$750, DW_AT_type(*$C$DW$T$20)
    7205                      .dwattr $C$DW$750, DW_AT_name("sinTh")
    7206                      .dwattr $C$DW$750, DW_AT_TI_symbol_name("_sinTh")
    7207                      .dwattr $C$DW$750, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    7208                      .dwattr $C$DW$750, DW_AT_accessibility(DW_ACCESS_public)
    7209              $C$DW$751       .dwtag  DW_TAG_member
    7210                      .dwattr $C$DW$751, DW_AT_type(*$C$DW$T$20)
    7211                      .dwattr $C$DW$751, DW_AT_name("cosTh")
    7212                      .dwattr $C$DW$751, DW_AT_TI_symbol_name("_cosTh")
    7213                      .dwattr $C$DW$751, DW_AT_data_member_location[DW_OP_plus_uconst 0x2]
    7214                      .dwattr $C$DW$751, DW_AT_accessibility(DW_ACCESS_public)
    7215                      .dwendtag $C$DW$T$71
    7216              
    7217              $C$DW$T$39      .dwtag  DW_TAG_typedef, DW_AT_name("PARK_Obj")
    7218                      .dwattr $C$DW$T$39, DW_AT_type(*$C$DW$T$71)
    7219                      .dwattr $C$DW$T$39, DW_AT_language(DW_LANG_C)
    7220              $C$DW$T$37      .dwtag  DW_TAG_pointer_type
    7221                      .dwattr $C$DW$T$37, DW_AT_type(*$C$DW$T$71)
    7222                      .dwattr $C$DW$T$37, DW_AT_address_class(0x16)
    7223              $C$DW$T$38      .dwtag  DW_TAG_typedef, DW_AT_name("PARK_Handle")
    7224                      .dwattr $C$DW$T$38, DW_AT_type(*$C$DW$T$37)
    7225                      .dwattr $C$DW$T$38, DW_AT_language(DW_LANG_C)
    7226              
    7227              $C$DW$T$72      .dwtag  DW_TAG_structure_type
    7228                      .dwattr $C$DW$T$72, DW_AT_name("_PID_Obj_")
    7229                      .dwattr $C$DW$T$72, DW_AT_byte_size(0x10)
    7230              $C$DW$752       .dwtag  DW_TAG_member
    7231                      .dwattr $C$DW$752, DW_AT_type(*$C$DW$T$20)
    7232                      .dwattr $C$DW$752, DW_AT_name("Kp")
    7233                      .dwattr $C$DW$752, DW_AT_TI_symbol_name("_Kp")
    7234                      .dwattr $C$DW$752, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    7235                      .dwattr $C$DW$752, DW_AT_accessibility(DW_ACCESS_public)
    7236              $C$DW$753       .dwtag  DW_TAG_member
    7237                      .dwattr $C$DW$753, DW_AT_type(*$C$DW$T$20)
    7238                      .dwattr $C$DW$753, DW_AT_name("Ki")
    7239                      .dwattr $C$DW$753, DW_AT_TI_symbol_name("_Ki")
    7240                      .dwattr $C$DW$753, DW_AT_data_member_location[DW_OP_plus_uconst 0x2]
    7241                      .dwattr $C$DW$753, DW_AT_accessibility(DW_ACCESS_public)
    7242              $C$DW$754       .dwtag  DW_TAG_member
    7243                      .dwattr $C$DW$754, DW_AT_type(*$C$DW$T$20)
    7244                      .dwattr $C$DW$754, DW_AT_name("Kd")
TMS320C2000 Assembler PC v6.2.5 Fri Oct 13 15:05:16 2017

Tools Copyright (c) 1996-2014 Texas Instruments Incorporated
C:\Users\wmj\AppData\Local\Temp\1488411                              PAGE  146

    7245                      .dwattr $C$DW$754, DW_AT_TI_symbol_name("_Kd")
    7246                      .dwattr $C$DW$754, DW_AT_data_member_location[DW_OP_plus_uconst 0x4]
    7247                      .dwattr $C$DW$754, DW_AT_accessibility(DW_ACCESS_public)
    7248              $C$DW$755       .dwtag  DW_TAG_member
    7249                      .dwattr $C$DW$755, DW_AT_type(*$C$DW$T$20)
    7250                      .dwattr $C$DW$755, DW_AT_name("Ui")
    7251                      .dwattr $C$DW$755, DW_AT_TI_symbol_name("_Ui")
    7252                      .dwattr $C$DW$755, DW_AT_data_member_location[DW_OP_plus_uconst 0x6]
    7253                      .dwattr $C$DW$755, DW_AT_accessibility(DW_ACCESS_public)
    7254              $C$DW$756       .dwtag  DW_TAG_member
    7255                      .dwattr $C$DW$756, DW_AT_type(*$C$DW$T$20)
    7256                      .dwattr $C$DW$756, DW_AT_name("refValue")
    7257                      .dwattr $C$DW$756, DW_AT_TI_symbol_name("_refValue")
    7258                      .dwattr $C$DW$756, DW_AT_data_member_location[DW_OP_plus_uconst 0x8]
    7259                      .dwattr $C$DW$756, DW_AT_accessibility(DW_ACCESS_public)
    7260              $C$DW$757       .dwtag  DW_TAG_member
    7261                      .dwattr $C$DW$757, DW_AT_type(*$C$DW$T$20)
    7262                      .dwattr $C$DW$757, DW_AT_name("fbackValue")
    7263                      .dwattr $C$DW$757, DW_AT_TI_symbol_name("_fbackValue")
    7264                      .dwattr $C$DW$757, DW_AT_data_member_location[DW_OP_plus_uconst 0xa]
    7265                      .dwattr $C$DW$757, DW_AT_accessibility(DW_ACCESS_public)
    7266              $C$DW$758       .dwtag  DW_TAG_member
    7267                      .dwattr $C$DW$758, DW_AT_type(*$C$DW$T$20)
    7268                      .dwattr $C$DW$758, DW_AT_name("outMin")
    7269                      .dwattr $C$DW$758, DW_AT_TI_symbol_name("_outMin")
    7270                      .dwattr $C$DW$758, DW_AT_data_member_location[DW_OP_plus_uconst 0xc]
    7271                      .dwattr $C$DW$758, DW_AT_accessibility(DW_ACCESS_public)
    7272              $C$DW$759       .dwtag  DW_TAG_member
    7273                      .dwattr $C$DW$759, DW_AT_type(*$C$DW$T$20)
    7274                      .dwattr $C$DW$759, DW_AT_name("outMax")
    7275                      .dwattr $C$DW$759, DW_AT_TI_symbol_name("_outMax")
    7276                      .dwattr $C$DW$759, DW_AT_data_member_location[DW_OP_plus_uconst 0xe]
    7277                      .dwattr $C$DW$759, DW_AT_accessibility(DW_ACCESS_public)
    7278                      .dwendtag $C$DW$T$72
    7279              
    7280              $C$DW$T$42      .dwtag  DW_TAG_typedef, DW_AT_name("PID_Obj")
    7281                      .dwattr $C$DW$T$42, DW_AT_type(*$C$DW$T$72)
    7282                      .dwattr $C$DW$T$42, DW_AT_language(DW_LANG_C)
    7283              $C$DW$T$40      .dwtag  DW_TAG_pointer_type
    7284                      .dwattr $C$DW$T$40, DW_AT_type(*$C$DW$T$72)
    7285                      .dwattr $C$DW$T$40, DW_AT_address_class(0x16)
    7286              $C$DW$T$41      .dwtag  DW_TAG_typedef, DW_AT_name("PID_Handle")
    7287                      .dwattr $C$DW$T$41, DW_AT_type(*$C$DW$T$40)
    7288                      .dwattr $C$DW$T$41, DW_AT_language(DW_LANG_C)
    7289              
    7290              $C$DW$T$73      .dwtag  DW_TAG_structure_type
    7291                      .dwattr $C$DW$T$73, DW_AT_name("_SVGEN_Obj_")
    7292                      .dwattr $C$DW$T$73, DW_AT_byte_size(0x02)
    7293              $C$DW$760       .dwtag  DW_TAG_member
    7294                      .dwattr $C$DW$760, DW_AT_type(*$C$DW$T$20)
    7295                      .dwattr $C$DW$760, DW_AT_name("maxModulation")
    7296                      .dwattr $C$DW$760, DW_AT_TI_symbol_name("_maxModulation")
    7297                      .dwattr $C$DW$760, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    7298                      .dwattr $C$DW$760, DW_AT_accessibility(DW_ACCESS_public)
    7299                      .dwendtag $C$DW$T$73
TMS320C2000 Assembler PC v6.2.5 Fri Oct 13 15:05:16 2017

Tools Copyright (c) 1996-2014 Texas Instruments Incorporated
C:\Users\wmj\AppData\Local\Temp\1488411                              PAGE  147

    7300              
    7301              $C$DW$T$48      .dwtag  DW_TAG_typedef, DW_AT_name("SVGEN_Obj")
    7302                      .dwattr $C$DW$T$48, DW_AT_type(*$C$DW$T$73)
    7303                      .dwattr $C$DW$T$48, DW_AT_language(DW_LANG_C)
    7304              $C$DW$T$46      .dwtag  DW_TAG_pointer_type
    7305                      .dwattr $C$DW$T$46, DW_AT_type(*$C$DW$T$73)
    7306                      .dwattr $C$DW$T$46, DW_AT_address_class(0x16)
    7307              $C$DW$T$47      .dwtag  DW_TAG_typedef, DW_AT_name("SVGEN_Handle")
    7308                      .dwattr $C$DW$T$47, DW_AT_type(*$C$DW$T$46)
    7309                      .dwattr $C$DW$T$47, DW_AT_language(DW_LANG_C)
    7310              
    7311              $C$DW$T$74      .dwtag  DW_TAG_structure_type
    7312                      .dwattr $C$DW$T$74, DW_AT_name("_TRAJ_Obj_")
    7313                      .dwattr $C$DW$T$74, DW_AT_byte_size(0x0a)
    7314              $C$DW$761       .dwtag  DW_TAG_member
    7315                      .dwattr $C$DW$761, DW_AT_type(*$C$DW$T$20)
    7316                      .dwattr $C$DW$761, DW_AT_name("targetValue")
    7317                      .dwattr $C$DW$761, DW_AT_TI_symbol_name("_targetValue")
    7318                      .dwattr $C$DW$761, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    7319                      .dwattr $C$DW$761, DW_AT_accessibility(DW_ACCESS_public)
    7320              $C$DW$762       .dwtag  DW_TAG_member
    7321                      .dwattr $C$DW$762, DW_AT_type(*$C$DW$T$20)
    7322                      .dwattr $C$DW$762, DW_AT_name("intValue")
    7323                      .dwattr $C$DW$762, DW_AT_TI_symbol_name("_intValue")
    7324                      .dwattr $C$DW$762, DW_AT_data_member_location[DW_OP_plus_uconst 0x2]
    7325                      .dwattr $C$DW$762, DW_AT_accessibility(DW_ACCESS_public)
    7326              $C$DW$763       .dwtag  DW_TAG_member
    7327                      .dwattr $C$DW$763, DW_AT_type(*$C$DW$T$20)
    7328                      .dwattr $C$DW$763, DW_AT_name("minValue")
    7329                      .dwattr $C$DW$763, DW_AT_TI_symbol_name("_minValue")
    7330                      .dwattr $C$DW$763, DW_AT_data_member_location[DW_OP_plus_uconst 0x4]
    7331                      .dwattr $C$DW$763, DW_AT_accessibility(DW_ACCESS_public)
    7332              $C$DW$764       .dwtag  DW_TAG_member
    7333                      .dwattr $C$DW$764, DW_AT_type(*$C$DW$T$20)
    7334                      .dwattr $C$DW$764, DW_AT_name("maxValue")
    7335                      .dwattr $C$DW$764, DW_AT_TI_symbol_name("_maxValue")
    7336                      .dwattr $C$DW$764, DW_AT_data_member_location[DW_OP_plus_uconst 0x6]
    7337                      .dwattr $C$DW$764, DW_AT_accessibility(DW_ACCESS_public)
    7338              $C$DW$765       .dwtag  DW_TAG_member
    7339                      .dwattr $C$DW$765, DW_AT_type(*$C$DW$T$20)
    7340                      .dwattr $C$DW$765, DW_AT_name("maxDelta")
    7341                      .dwattr $C$DW$765, DW_AT_TI_symbol_name("_maxDelta")
    7342                      .dwattr $C$DW$765, DW_AT_data_member_location[DW_OP_plus_uconst 0x8]
    7343                      .dwattr $C$DW$765, DW_AT_accessibility(DW_ACCESS_public)
    7344                      .dwendtag $C$DW$T$74
    7345              
    7346              $C$DW$T$51      .dwtag  DW_TAG_typedef, DW_AT_name("TRAJ_Obj")
    7347                      .dwattr $C$DW$T$51, DW_AT_type(*$C$DW$T$74)
    7348                      .dwattr $C$DW$T$51, DW_AT_language(DW_LANG_C)
    7349              $C$DW$T$49      .dwtag  DW_TAG_pointer_type
    7350                      .dwattr $C$DW$T$49, DW_AT_type(*$C$DW$T$74)
    7351                      .dwattr $C$DW$T$49, DW_AT_address_class(0x16)
    7352              $C$DW$T$50      .dwtag  DW_TAG_typedef, DW_AT_name("TRAJ_Handle")
    7353                      .dwattr $C$DW$T$50, DW_AT_type(*$C$DW$T$49)
    7354                      .dwattr $C$DW$T$50, DW_AT_language(DW_LANG_C)
TMS320C2000 Assembler PC v6.2.5 Fri Oct 13 15:05:16 2017

Tools Copyright (c) 1996-2014 Texas Instruments Incorporated
C:\Users\wmj\AppData\Local\Temp\1488411                              PAGE  148

    7355              
    7356              $C$DW$T$80      .dwtag  DW_TAG_structure_type
    7357                      .dwattr $C$DW$T$80, DW_AT_name("_USER_Params_")
    7358                      .dwattr $C$DW$T$80, DW_AT_byte_size(0xac)
    7359              $C$DW$766       .dwtag  DW_TAG_member
    7360                      .dwattr $C$DW$766, DW_AT_type(*$C$DW$T$57)
    7361                      .dwattr $C$DW$766, DW_AT_name("iqFullScaleCurrent_A")
    7362                      .dwattr $C$DW$766, DW_AT_TI_symbol_name("_iqFullScaleCurrent_A")
    7363                      .dwattr $C$DW$766, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    7364                      .dwattr $C$DW$766, DW_AT_accessibility(DW_ACCESS_public)
    7365              $C$DW$767       .dwtag  DW_TAG_member
    7366                      .dwattr $C$DW$767, DW_AT_type(*$C$DW$T$57)
    7367                      .dwattr $C$DW$767, DW_AT_name("iqFullScaleVoltage_V")
    7368                      .dwattr $C$DW$767, DW_AT_TI_symbol_name("_iqFullScaleVoltage_V")
    7369                      .dwattr $C$DW$767, DW_AT_data_member_location[DW_OP_plus_uconst 0x2]
    7370                      .dwattr $C$DW$767, DW_AT_accessibility(DW_ACCESS_public)
    7371              $C$DW$768       .dwtag  DW_TAG_member
    7372                      .dwattr $C$DW$768, DW_AT_type(*$C$DW$T$57)
    7373                      .dwattr $C$DW$768, DW_AT_name("iqFullScaleFreq_Hz")
    7374                      .dwattr $C$DW$768, DW_AT_TI_symbol_name("_iqFullScaleFreq_Hz")
    7375                      .dwattr $C$DW$768, DW_AT_data_member_location[DW_OP_plus_uconst 0x4]
    7376                      .dwattr $C$DW$768, DW_AT_accessibility(DW_ACCESS_public)
    7377              $C$DW$769       .dwtag  DW_TAG_member
    7378                      .dwattr $C$DW$769, DW_AT_type(*$C$DW$T$56)
    7379                      .dwattr $C$DW$769, DW_AT_name("numIsrTicksPerCtrlTick")
    7380                      .dwattr $C$DW$769, DW_AT_TI_symbol_name("_numIsrTicksPerCtrlTick")
    7381                      .dwattr $C$DW$769, DW_AT_data_member_location[DW_OP_plus_uconst 0x6]
    7382                      .dwattr $C$DW$769, DW_AT_accessibility(DW_ACCESS_public)
    7383              $C$DW$770       .dwtag  DW_TAG_member
    7384                      .dwattr $C$DW$770, DW_AT_type(*$C$DW$T$56)
    7385                      .dwattr $C$DW$770, DW_AT_name("numCtrlTicksPerCurrentTick")
    7386                      .dwattr $C$DW$770, DW_AT_TI_symbol_name("_numCtrlTicksPerCurrentTick")
    7387                      .dwattr $C$DW$770, DW_AT_data_member_location[DW_OP_plus_uconst 0x7]
    7388                      .dwattr $C$DW$770, DW_AT_accessibility(DW_ACCESS_public)
    7389              $C$DW$771       .dwtag  DW_TAG_member
    7390                      .dwattr $C$DW$771, DW_AT_type(*$C$DW$T$56)
    7391                      .dwattr $C$DW$771, DW_AT_name("numCtrlTicksPerEstTick")
    7392                      .dwattr $C$DW$771, DW_AT_TI_symbol_name("_numCtrlTicksPerEstTick")
    7393                      .dwattr $C$DW$771, DW_AT_data_member_location[DW_OP_plus_uconst 0x8]
    7394                      .dwattr $C$DW$771, DW_AT_accessibility(DW_ACCESS_public)
    7395              $C$DW$772       .dwtag  DW_TAG_member
    7396                      .dwattr $C$DW$772, DW_AT_type(*$C$DW$T$56)
    7397                      .dwattr $C$DW$772, DW_AT_name("numCtrlTicksPerSpeedTick")
    7398                      .dwattr $C$DW$772, DW_AT_TI_symbol_name("_numCtrlTicksPerSpeedTick")
    7399                      .dwattr $C$DW$772, DW_AT_data_member_location[DW_OP_plus_uconst 0x9]
    7400                      .dwattr $C$DW$772, DW_AT_accessibility(DW_ACCESS_public)
    7401              $C$DW$773       .dwtag  DW_TAG_member
    7402                      .dwattr $C$DW$773, DW_AT_type(*$C$DW$T$56)
    7403                      .dwattr $C$DW$773, DW_AT_name("numCtrlTicksPerTrajTick")
    7404                      .dwattr $C$DW$773, DW_AT_TI_symbol_name("_numCtrlTicksPerTrajTick")
    7405                      .dwattr $C$DW$773, DW_AT_data_member_location[DW_OP_plus_uconst 0xa]
    7406                      .dwattr $C$DW$773, DW_AT_accessibility(DW_ACCESS_public)
    7407              $C$DW$774       .dwtag  DW_TAG_member
    7408                      .dwattr $C$DW$774, DW_AT_type(*$C$DW$T$25)
    7409                      .dwattr $C$DW$774, DW_AT_name("numCurrentSensors")
TMS320C2000 Assembler PC v6.2.5 Fri Oct 13 15:05:16 2017

Tools Copyright (c) 1996-2014 Texas Instruments Incorporated
C:\Users\wmj\AppData\Local\Temp\1488411                              PAGE  149

    7410                      .dwattr $C$DW$774, DW_AT_TI_symbol_name("_numCurrentSensors")
    7411                      .dwattr $C$DW$774, DW_AT_data_member_location[DW_OP_plus_uconst 0xb]
    7412                      .dwattr $C$DW$774, DW_AT_accessibility(DW_ACCESS_public)
    7413              $C$DW$775       .dwtag  DW_TAG_member
    7414                      .dwattr $C$DW$775, DW_AT_type(*$C$DW$T$25)
    7415                      .dwattr $C$DW$775, DW_AT_name("numVoltageSensors")
    7416                      .dwattr $C$DW$775, DW_AT_TI_symbol_name("_numVoltageSensors")
    7417                      .dwattr $C$DW$775, DW_AT_data_member_location[DW_OP_plus_uconst 0xc]
    7418                      .dwattr $C$DW$775, DW_AT_accessibility(DW_ACCESS_public)
    7419              $C$DW$776       .dwtag  DW_TAG_member
    7420                      .dwattr $C$DW$776, DW_AT_type(*$C$DW$T$57)
    7421                      .dwattr $C$DW$776, DW_AT_name("offsetPole_rps")
    7422                      .dwattr $C$DW$776, DW_AT_TI_symbol_name("_offsetPole_rps")
    7423                      .dwattr $C$DW$776, DW_AT_data_member_location[DW_OP_plus_uconst 0xe]
    7424                      .dwattr $C$DW$776, DW_AT_accessibility(DW_ACCESS_public)
    7425              $C$DW$777       .dwtag  DW_TAG_member
    7426                      .dwattr $C$DW$777, DW_AT_type(*$C$DW$T$57)
    7427                      .dwattr $C$DW$777, DW_AT_name("fluxPole_rps")
    7428                      .dwattr $C$DW$777, DW_AT_TI_symbol_name("_fluxPole_rps")
    7429                      .dwattr $C$DW$777, DW_AT_data_member_location[DW_OP_plus_uconst 0x10]
    7430                      .dwattr $C$DW$777, DW_AT_accessibility(DW_ACCESS_public)
    7431              $C$DW$778       .dwtag  DW_TAG_member
    7432                      .dwattr $C$DW$778, DW_AT_type(*$C$DW$T$57)
    7433                      .dwattr $C$DW$778, DW_AT_name("zeroSpeedLimit")
    7434                      .dwattr $C$DW$778, DW_AT_TI_symbol_name("_zeroSpeedLimit")
    7435                      .dwattr $C$DW$778, DW_AT_data_member_location[DW_OP_plus_uconst 0x12]
    7436                      .dwattr $C$DW$778, DW_AT_accessibility(DW_ACCESS_public)
    7437              $C$DW$779       .dwtag  DW_TAG_member
    7438                      .dwattr $C$DW$779, DW_AT_type(*$C$DW$T$57)
    7439                      .dwattr $C$DW$779, DW_AT_name("forceAngleFreq_Hz")
    7440                      .dwattr $C$DW$779, DW_AT_TI_symbol_name("_forceAngleFreq_Hz")
    7441                      .dwattr $C$DW$779, DW_AT_data_member_location[DW_OP_plus_uconst 0x14]
    7442                      .dwattr $C$DW$779, DW_AT_accessibility(DW_ACCESS_public)
    7443              $C$DW$780       .dwtag  DW_TAG_member
    7444                      .dwattr $C$DW$780, DW_AT_type(*$C$DW$T$57)
    7445                      .dwattr $C$DW$780, DW_AT_name("maxAccel_Hzps")
    7446                      .dwattr $C$DW$780, DW_AT_TI_symbol_name("_maxAccel_Hzps")
    7447                      .dwattr $C$DW$780, DW_AT_data_member_location[DW_OP_plus_uconst 0x16]
    7448                      .dwattr $C$DW$780, DW_AT_accessibility(DW_ACCESS_public)
    7449              $C$DW$781       .dwtag  DW_TAG_member
    7450                      .dwattr $C$DW$781, DW_AT_type(*$C$DW$T$57)
    7451                      .dwattr $C$DW$781, DW_AT_name("maxAccel_est_Hzps")
    7452                      .dwattr $C$DW$781, DW_AT_TI_symbol_name("_maxAccel_est_Hzps")
    7453                      .dwattr $C$DW$781, DW_AT_data_member_location[DW_OP_plus_uconst 0x18]
    7454                      .dwattr $C$DW$781, DW_AT_accessibility(DW_ACCESS_public)
    7455              $C$DW$782       .dwtag  DW_TAG_member
    7456                      .dwattr $C$DW$782, DW_AT_type(*$C$DW$T$57)
    7457                      .dwattr $C$DW$782, DW_AT_name("directionPole_rps")
    7458                      .dwattr $C$DW$782, DW_AT_TI_symbol_name("_directionPole_rps")
    7459                      .dwattr $C$DW$782, DW_AT_data_member_location[DW_OP_plus_uconst 0x1a]
    7460                      .dwattr $C$DW$782, DW_AT_accessibility(DW_ACCESS_public)
    7461              $C$DW$783       .dwtag  DW_TAG_member
    7462                      .dwattr $C$DW$783, DW_AT_type(*$C$DW$T$57)
    7463                      .dwattr $C$DW$783, DW_AT_name("speedPole_rps")
    7464                      .dwattr $C$DW$783, DW_AT_TI_symbol_name("_speedPole_rps")
TMS320C2000 Assembler PC v6.2.5 Fri Oct 13 15:05:16 2017

Tools Copyright (c) 1996-2014 Texas Instruments Incorporated
C:\Users\wmj\AppData\Local\Temp\1488411                              PAGE  150

    7465                      .dwattr $C$DW$783, DW_AT_data_member_location[DW_OP_plus_uconst 0x1c]
    7466                      .dwattr $C$DW$783, DW_AT_accessibility(DW_ACCESS_public)
    7467              $C$DW$784       .dwtag  DW_TAG_member
    7468                      .dwattr $C$DW$784, DW_AT_type(*$C$DW$T$57)
    7469                      .dwattr $C$DW$784, DW_AT_name("dcBusPole_rps")
    7470                      .dwattr $C$DW$784, DW_AT_TI_symbol_name("_dcBusPole_rps")
    7471                      .dwattr $C$DW$784, DW_AT_data_member_location[DW_OP_plus_uconst 0x1e]
    7472                      .dwattr $C$DW$784, DW_AT_accessibility(DW_ACCESS_public)
    7473              $C$DW$785       .dwtag  DW_TAG_member
    7474                      .dwattr $C$DW$785, DW_AT_type(*$C$DW$T$57)
    7475                      .dwattr $C$DW$785, DW_AT_name("fluxFraction")
    7476                      .dwattr $C$DW$785, DW_AT_TI_symbol_name("_fluxFraction")
    7477                      .dwattr $C$DW$785, DW_AT_data_member_location[DW_OP_plus_uconst 0x20]
    7478                      .dwattr $C$DW$785, DW_AT_accessibility(DW_ACCESS_public)
    7479              $C$DW$786       .dwtag  DW_TAG_member
    7480                      .dwattr $C$DW$786, DW_AT_type(*$C$DW$T$57)
    7481                      .dwattr $C$DW$786, DW_AT_name("indEst_speedMaxFraction")
    7482                      .dwattr $C$DW$786, DW_AT_TI_symbol_name("_indEst_speedMaxFraction")
    7483                      .dwattr $C$DW$786, DW_AT_data_member_location[DW_OP_plus_uconst 0x22]
    7484                      .dwattr $C$DW$786, DW_AT_accessibility(DW_ACCESS_public)
    7485              $C$DW$787       .dwtag  DW_TAG_member
    7486                      .dwattr $C$DW$787, DW_AT_type(*$C$DW$T$57)
    7487                      .dwattr $C$DW$787, DW_AT_name("powerWarpGain")
    7488                      .dwattr $C$DW$787, DW_AT_TI_symbol_name("_powerWarpGain")
    7489                      .dwattr $C$DW$787, DW_AT_data_member_location[DW_OP_plus_uconst 0x24]
    7490                      .dwattr $C$DW$787, DW_AT_accessibility(DW_ACCESS_public)
    7491              $C$DW$788       .dwtag  DW_TAG_member
    7492                      .dwattr $C$DW$788, DW_AT_type(*$C$DW$T$56)
    7493                      .dwattr $C$DW$788, DW_AT_name("systemFreq_MHz")
    7494                      .dwattr $C$DW$788, DW_AT_TI_symbol_name("_systemFreq_MHz")
    7495                      .dwattr $C$DW$788, DW_AT_data_member_location[DW_OP_plus_uconst 0x26]
    7496                      .dwattr $C$DW$788, DW_AT_accessibility(DW_ACCESS_public)
    7497              $C$DW$789       .dwtag  DW_TAG_member
    7498                      .dwattr $C$DW$789, DW_AT_type(*$C$DW$T$57)
    7499                      .dwattr $C$DW$789, DW_AT_name("pwmPeriod_usec")
    7500                      .dwattr $C$DW$789, DW_AT_TI_symbol_name("_pwmPeriod_usec")
    7501                      .dwattr $C$DW$789, DW_AT_data_member_location[DW_OP_plus_uconst 0x28]
    7502                      .dwattr $C$DW$789, DW_AT_accessibility(DW_ACCESS_public)
    7503              $C$DW$790       .dwtag  DW_TAG_member
    7504                      .dwattr $C$DW$790, DW_AT_type(*$C$DW$T$57)
    7505                      .dwattr $C$DW$790, DW_AT_name("voltage_sf")
    7506                      .dwattr $C$DW$790, DW_AT_TI_symbol_name("_voltage_sf")
    7507                      .dwattr $C$DW$790, DW_AT_data_member_location[DW_OP_plus_uconst 0x2a]
    7508                      .dwattr $C$DW$790, DW_AT_accessibility(DW_ACCESS_public)
    7509              $C$DW$791       .dwtag  DW_TAG_member
    7510                      .dwattr $C$DW$791, DW_AT_type(*$C$DW$T$57)
    7511                      .dwattr $C$DW$791, DW_AT_name("current_sf")
    7512                      .dwattr $C$DW$791, DW_AT_TI_symbol_name("_current_sf")
    7513                      .dwattr $C$DW$791, DW_AT_data_member_location[DW_OP_plus_uconst 0x2c]
    7514                      .dwattr $C$DW$791, DW_AT_accessibility(DW_ACCESS_public)
    7515              $C$DW$792       .dwtag  DW_TAG_member
    7516                      .dwattr $C$DW$792, DW_AT_type(*$C$DW$T$57)
    7517                      .dwattr $C$DW$792, DW_AT_name("voltageFilterPole_rps")
    7518                      .dwattr $C$DW$792, DW_AT_TI_symbol_name("_voltageFilterPole_rps")
    7519                      .dwattr $C$DW$792, DW_AT_data_member_location[DW_OP_plus_uconst 0x2e]
TMS320C2000 Assembler PC v6.2.5 Fri Oct 13 15:05:16 2017

Tools Copyright (c) 1996-2014 Texas Instruments Incorporated
C:\Users\wmj\AppData\Local\Temp\1488411                              PAGE  151

    7520                      .dwattr $C$DW$792, DW_AT_accessibility(DW_ACCESS_public)
    7521              $C$DW$793       .dwtag  DW_TAG_member
    7522                      .dwattr $C$DW$793, DW_AT_type(*$C$DW$T$57)
    7523                      .dwattr $C$DW$793, DW_AT_name("maxVsMag_pu")
    7524                      .dwattr $C$DW$793, DW_AT_TI_symbol_name("_maxVsMag_pu")
    7525                      .dwattr $C$DW$793, DW_AT_data_member_location[DW_OP_plus_uconst 0x30]
    7526                      .dwattr $C$DW$793, DW_AT_accessibility(DW_ACCESS_public)
    7527              $C$DW$794       .dwtag  DW_TAG_member
    7528                      .dwattr $C$DW$794, DW_AT_type(*$C$DW$T$57)
    7529                      .dwattr $C$DW$794, DW_AT_name("estKappa")
    7530                      .dwattr $C$DW$794, DW_AT_TI_symbol_name("_estKappa")
    7531                      .dwattr $C$DW$794, DW_AT_data_member_location[DW_OP_plus_uconst 0x32]
    7532                      .dwattr $C$DW$794, DW_AT_accessibility(DW_ACCESS_public)
    7533              $C$DW$795       .dwtag  DW_TAG_member
    7534                      .dwattr $C$DW$795, DW_AT_type(*$C$DW$T$69)
    7535                      .dwattr $C$DW$795, DW_AT_name("motor_type")
    7536                      .dwattr $C$DW$795, DW_AT_TI_symbol_name("_motor_type")
    7537                      .dwattr $C$DW$795, DW_AT_data_member_location[DW_OP_plus_uconst 0x34]
    7538                      .dwattr $C$DW$795, DW_AT_accessibility(DW_ACCESS_public)
    7539              $C$DW$796       .dwtag  DW_TAG_member
    7540                      .dwattr $C$DW$796, DW_AT_type(*$C$DW$T$56)
    7541                      .dwattr $C$DW$796, DW_AT_name("motor_numPolePairs")
    7542                      .dwattr $C$DW$796, DW_AT_TI_symbol_name("_motor_numPolePairs")
    7543                      .dwattr $C$DW$796, DW_AT_data_member_location[DW_OP_plus_uconst 0x35]
    7544                      .dwattr $C$DW$796, DW_AT_accessibility(DW_ACCESS_public)
    7545              $C$DW$797       .dwtag  DW_TAG_member
    7546                      .dwattr $C$DW$797, DW_AT_type(*$C$DW$T$57)
    7547                      .dwattr $C$DW$797, DW_AT_name("motor_ratedFlux")
    7548                      .dwattr $C$DW$797, DW_AT_TI_symbol_name("_motor_ratedFlux")
    7549                      .dwattr $C$DW$797, DW_AT_data_member_location[DW_OP_plus_uconst 0x36]
    7550                      .dwattr $C$DW$797, DW_AT_accessibility(DW_ACCESS_public)
    7551              $C$DW$798       .dwtag  DW_TAG_member
    7552                      .dwattr $C$DW$798, DW_AT_type(*$C$DW$T$57)
    7553                      .dwattr $C$DW$798, DW_AT_name("motor_Rr")
    7554                      .dwattr $C$DW$798, DW_AT_TI_symbol_name("_motor_Rr")
    7555                      .dwattr $C$DW$798, DW_AT_data_member_location[DW_OP_plus_uconst 0x38]
    7556                      .dwattr $C$DW$798, DW_AT_accessibility(DW_ACCESS_public)
    7557              $C$DW$799       .dwtag  DW_TAG_member
    7558                      .dwattr $C$DW$799, DW_AT_type(*$C$DW$T$57)
    7559                      .dwattr $C$DW$799, DW_AT_name("motor_Rs")
    7560                      .dwattr $C$DW$799, DW_AT_TI_symbol_name("_motor_Rs")
    7561                      .dwattr $C$DW$799, DW_AT_data_member_location[DW_OP_plus_uconst 0x3a]
    7562                      .dwattr $C$DW$799, DW_AT_accessibility(DW_ACCESS_public)
    7563              $C$DW$800       .dwtag  DW_TAG_member
    7564                      .dwattr $C$DW$800, DW_AT_type(*$C$DW$T$57)
    7565                      .dwattr $C$DW$800, DW_AT_name("motor_Ls_d")
    7566                      .dwattr $C$DW$800, DW_AT_TI_symbol_name("_motor_Ls_d")
    7567                      .dwattr $C$DW$800, DW_AT_data_member_location[DW_OP_plus_uconst 0x3c]
    7568                      .dwattr $C$DW$800, DW_AT_accessibility(DW_ACCESS_public)
    7569              $C$DW$801       .dwtag  DW_TAG_member
    7570                      .dwattr $C$DW$801, DW_AT_type(*$C$DW$T$57)
    7571                      .dwattr $C$DW$801, DW_AT_name("motor_Ls_q")
    7572                      .dwattr $C$DW$801, DW_AT_TI_symbol_name("_motor_Ls_q")
    7573                      .dwattr $C$DW$801, DW_AT_data_member_location[DW_OP_plus_uconst 0x3e]
    7574                      .dwattr $C$DW$801, DW_AT_accessibility(DW_ACCESS_public)
TMS320C2000 Assembler PC v6.2.5 Fri Oct 13 15:05:16 2017

Tools Copyright (c) 1996-2014 Texas Instruments Incorporated
C:\Users\wmj\AppData\Local\Temp\1488411                              PAGE  152

    7575              $C$DW$802       .dwtag  DW_TAG_member
    7576                      .dwattr $C$DW$802, DW_AT_type(*$C$DW$T$57)
    7577                      .dwattr $C$DW$802, DW_AT_name("maxCurrent")
    7578                      .dwattr $C$DW$802, DW_AT_TI_symbol_name("_maxCurrent")
    7579                      .dwattr $C$DW$802, DW_AT_data_member_location[DW_OP_plus_uconst 0x40]
    7580                      .dwattr $C$DW$802, DW_AT_accessibility(DW_ACCESS_public)
    7581              $C$DW$803       .dwtag  DW_TAG_member
    7582                      .dwattr $C$DW$803, DW_AT_type(*$C$DW$T$57)
    7583                      .dwattr $C$DW$803, DW_AT_name("maxCurrent_resEst")
    7584                      .dwattr $C$DW$803, DW_AT_TI_symbol_name("_maxCurrent_resEst")
    7585                      .dwattr $C$DW$803, DW_AT_data_member_location[DW_OP_plus_uconst 0x42]
    7586                      .dwattr $C$DW$803, DW_AT_accessibility(DW_ACCESS_public)
    7587              $C$DW$804       .dwtag  DW_TAG_member
    7588                      .dwattr $C$DW$804, DW_AT_type(*$C$DW$T$57)
    7589                      .dwattr $C$DW$804, DW_AT_name("maxCurrent_indEst")
    7590                      .dwattr $C$DW$804, DW_AT_TI_symbol_name("_maxCurrent_indEst")
    7591                      .dwattr $C$DW$804, DW_AT_data_member_location[DW_OP_plus_uconst 0x44]
    7592                      .dwattr $C$DW$804, DW_AT_accessibility(DW_ACCESS_public)
    7593              $C$DW$805       .dwtag  DW_TAG_member
    7594                      .dwattr $C$DW$805, DW_AT_type(*$C$DW$T$57)
    7595                      .dwattr $C$DW$805, DW_AT_name("maxCurrentSlope")
    7596                      .dwattr $C$DW$805, DW_AT_TI_symbol_name("_maxCurrentSlope")
    7597                      .dwattr $C$DW$805, DW_AT_data_member_location[DW_OP_plus_uconst 0x46]
    7598                      .dwattr $C$DW$805, DW_AT_accessibility(DW_ACCESS_public)
    7599              $C$DW$806       .dwtag  DW_TAG_member
    7600                      .dwattr $C$DW$806, DW_AT_type(*$C$DW$T$57)
    7601                      .dwattr $C$DW$806, DW_AT_name("maxCurrentSlope_powerWarp")
    7602                      .dwattr $C$DW$806, DW_AT_TI_symbol_name("_maxCurrentSlope_powerWarp")
    7603                      .dwattr $C$DW$806, DW_AT_data_member_location[DW_OP_plus_uconst 0x48]
    7604                      .dwattr $C$DW$806, DW_AT_accessibility(DW_ACCESS_public)
    7605              $C$DW$807       .dwtag  DW_TAG_member
