TMS320C2000 Assembler PC v6.2.5 Tue Sep 12 20:58:49 2017

Tools Copyright (c) 1996-2014 Texas Instruments Incorporated
C:\Users\wmj\AppData\Local\Temp\1256010                              PAGE    1

       1              ;***************************************************************
       2              ;* TMS320C2000 C/C++ Codegen                         PC v6.2.5 *
       3              ;* Date/Time created: Tue Sep 12 20:58:48 2017                 *
       4              ;***************************************************************
       5                      .compiler_opts --float_support=softlib --hll_source=on --mem_model:code=flat --mem_model:data=large -
       6        0002  FP      .set    XAR2
       7              
       8              $C$DW$CU        .dwtag  DW_TAG_compile_unit
       9                      .dwattr $C$DW$CU, DW_AT_name("D:/BM1000/sw/modules/hal/boards/hvkit_rev1p1/f28x/f2802x/src/hal.c")
      10                      .dwattr $C$DW$CU, DW_AT_producer("TMS320C2000 C/C++ Codegen PC v6.2.5 Copyright (c) 1996-2014 Texas I
      11                      .dwattr $C$DW$CU, DW_AT_TI_version(0x01)
      12                      .dwattr $C$DW$CU, DW_AT_comp_dir("D:\BM1000\sw\solutions\instaspin_foc\boards\hvkit_rev1p1\f28x\f2802
      13              
      14              $C$DW$1 .dwtag  DW_TAG_subprogram, DW_AT_name("SPI_setClkPolarity")
      15                      .dwattr $C$DW$1, DW_AT_TI_symbol_name("_SPI_setClkPolarity")

    9812              $C$DW$T$312     .dwtag  DW_TAG_typedef, DW_AT_name("SCI_CharLength_e")
    9813                      .dwattr $C$DW$T$312, DW_AT_type(*$C$DW$T$311)
    9814                      .dwattr $C$DW$T$312, DW_AT_language(DW_LANG_C)
    9815              $C$DW$1781      .dwtag  DW_TAG_TI_far_type
    9816                      .dwattr $C$DW$1781, DW_AT_type(*$C$DW$T$312)
    9817              $C$DW$T$313     .dwtag  DW_TAG_const_type
    9818                      .dwattr $C$DW$T$313, DW_AT_type(*$C$DW$1781)
    9819              
    9820              $C$DW$T$314     .dwtag  DW_TAG_enumeration_type
    9821                      .dwattr $C$DW$T$314, DW_AT_byte_size(0x01)
    9822              $C$DW$1782      .dwtag  DW_TAG_enumerator, DW_AT_name("SCI_Mode_IdleLine"), DW_AT_const_value(0x00)
    9823              $C$DW$1783      .dwtag  DW_TAG_enumerator, DW_AT_name("SCI_Mode_AddressBit"), DW_AT_const_value(0x08)
    9824                      .dwendtag $C$DW$T$314
    9825              
    9826              $C$DW$T$315     .dwtag  DW_TAG_typedef, DW_AT_name("SCI_Mode_e")
    9827                      .dwattr $C$DW$T$315, DW_AT_type(*$C$DW$T$314)
    9828                      .dwattr $C$DW$T$315, DW_AT_language(DW_LANG_C)
    9829              $C$DW$1784      .dwtag  DW_TAG_TI_far_type
    9830                      .dwattr $C$DW$1784, DW_AT_type(*$C$DW$T$315)
    9831              $C$DW$T$316     .dwtag  DW_TAG_const_type
TMS320C2000 Assembler PC v6.2.5 Tue Sep 12 20:58:49 2017

Tools Copyright (c) 1996-2014 Texas Instruments Incorporated
C:\Users\wmj\AppData\Local\Temp\1256010                              PAGE  189

    9832                      .dwattr $C$DW$T$316, DW_AT_type(*$C$DW$1784)
    9833              
    9834              $C$DW$T$317     .dwtag  DW_TAG_enumeration_type
    9835                      .dwattr $C$DW$T$317, DW_AT_byte_size(0x01)
    9836              $C$DW$1785      .dwtag  DW_TAG_enumerator, DW_AT_name("SCI_NumStopBits_One"), DW_AT_const_value(0x00)
    9837              $C$DW$1786      .dwtag  DW_TAG_enumerator, DW_AT_name("SCI_NumStopBits_Two"), DW_AT_const_value(0x80)
    9838                      .dwendtag $C$DW$T$317
    9839              
    9840              $C$DW$T$318     .dwtag  DW_TAG_typedef, DW_AT_name("SCI_NumStopBits_e")
    9841                      .dwattr $C$DW$T$318, DW_AT_type(*$C$DW$T$317)
    9842                      .dwattr $C$DW$T$318, DW_AT_language(DW_LANG_C)
    9843              $C$DW$1787      .dwtag  DW_TAG_TI_far_type
    9844                      .dwattr $C$DW$1787, DW_AT_type(*$C$DW$T$318)
    9845              $C$DW$T$319     .dwtag  DW_TAG_const_type
    9846                      .dwattr $C$DW$T$319, DW_AT_type(*$C$DW$1787)
    9847              
    9848              $C$DW$T$320     .dwtag  DW_TAG_enumeration_type
    9849                      .dwattr $C$DW$T$320, DW_AT_byte_size(0x01)
    9850              $C$DW$1788      .dwtag  DW_TAG_enumerator, DW_AT_name("SCI_Parity_Odd"), DW_AT_const_value(0x00)
    9851              $C$DW$1789      .dwtag  DW_TAG_enumerator, DW_AT_name("SCI_Parity_Even"), DW_AT_const_value(0x40)
    9852                      .dwendtag $C$DW$T$320
    9853              
    9854              $C$DW$T$321     .dwtag  DW_TAG_typedef, DW_AT_name("SCI_Parity_e")
    9855                      .dwattr $C$DW$T$321, DW_AT_type(*$C$DW$T$320)
    9856                      .dwattr $C$DW$T$321, DW_AT_language(DW_LANG_C)
    9857              $C$DW$1790      .dwtag  DW_TAG_TI_far_type
    9858                      .dwattr $C$DW$1790, DW_AT_type(*$C$DW$T$321)
    9859              $C$DW$T$322     .dwtag  DW_TAG_const_type
    9860                      .dwattr $C$DW$T$322, DW_AT_type(*$C$DW$1790)
    9861              
    9862              $C$DW$T$323     .dwtag  DW_TAG_enumeration_type
    9863                      .dwattr $C$DW$T$323, DW_AT_byte_size(0x01)
    9864              $C$DW$1791      .dwtag  DW_TAG_enumerator, DW_AT_name("HAL_SensorType_Current"), DW_AT_const_value(0x00)
    9865              $C$DW$1792      .dwtag  DW_TAG_enumerator, DW_AT_name("HAL_SensorType_Voltage"), DW_AT_const_value(0x01)
    9866                      .dwendtag $C$DW$T$323
    9867              
    9868              $C$DW$T$324     .dwtag  DW_TAG_typedef, DW_AT_name("HAL_SensorType_e")
    9869                      .dwattr $C$DW$T$324, DW_AT_type(*$C$DW$T$323)
    9870                      .dwattr $C$DW$T$324, DW_AT_language(DW_LANG_C)
    9871              
    9872              $C$DW$T$19      .dwtag  DW_TAG_structure_type
    9873                      .dwattr $C$DW$T$19, DW_AT_name("I2C_Obj")
    9874                      .dwattr $C$DW$T$19, DW_AT_declaration
    9875                      .dwendtag $C$DW$T$19
    9876              
    9877              $C$DW$T$79      .dwtag  DW_TAG_pointer_type
    9878                      .dwattr $C$DW$T$79, DW_AT_type(*$C$DW$T$19)
    9879                      .dwattr $C$DW$T$79, DW_AT_address_class(0x16)
    9880              $C$DW$T$80      .dwtag  DW_TAG_typedef, DW_AT_name("I2C_Handle")
    9881                      .dwattr $C$DW$T$80, DW_AT_type(*$C$DW$T$79)
    9882                      .dwattr $C$DW$T$80, DW_AT_language(DW_LANG_C)
    9883              
    9884              $C$DW$T$30      .dwtag  DW_TAG_structure_type
    9885                      .dwattr $C$DW$T$30, DW_AT_name("_ADC_Obj_")
    9886                      .dwattr $C$DW$T$30, DW_AT_byte_size(0x6650)
TMS320C2000 Assembler PC v6.2.5 Tue Sep 12 20:58:49 2017

Tools Copyright (c) 1996-2014 Texas Instruments Incorporated
C:\Users\wmj\AppData\Local\Temp\1256010                              PAGE  190

    9887              $C$DW$1793      .dwtag  DW_TAG_member
    9888                      .dwattr $C$DW$1793, DW_AT_type(*$C$DW$T$24)
    9889                      .dwattr $C$DW$1793, DW_AT_name("ADCRESULT")
    9890                      .dwattr $C$DW$1793, DW_AT_TI_symbol_name("_ADCRESULT")
    9891                      .dwattr $C$DW$1793, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    9892                      .dwattr $C$DW$1793, DW_AT_accessibility(DW_ACCESS_public)
    9893              $C$DW$1794      .dwtag  DW_TAG_member
    9894                      .dwattr $C$DW$1794, DW_AT_type(*$C$DW$T$25)
    9895                      .dwattr $C$DW$1794, DW_AT_name("resvd_1")
    9896                      .dwattr $C$DW$1794, DW_AT_TI_symbol_name("_resvd_1")
    9897                      .dwattr $C$DW$1794, DW_AT_data_member_location[DW_OP_plus_uconst 0x10]
    9898                      .dwattr $C$DW$1794, DW_AT_accessibility(DW_ACCESS_public)
    9899              $C$DW$1795      .dwtag  DW_TAG_member
    9900                      .dwattr $C$DW$1795, DW_AT_type(*$C$DW$T$23)
    9901                      .dwattr $C$DW$1795, DW_AT_name("ADCCTL1")
    9902                      .dwattr $C$DW$1795, DW_AT_TI_symbol_name("_ADCCTL1")
    9903                      .dwattr $C$DW$1795, DW_AT_data_member_location[DW_OP_plus_uconst 0x6600]
    9904                      .dwattr $C$DW$1795, DW_AT_accessibility(DW_ACCESS_public)
    9905              $C$DW$1796      .dwtag  DW_TAG_member
    9906                      .dwattr $C$DW$1796, DW_AT_type(*$C$DW$T$23)
    9907                      .dwattr $C$DW$1796, DW_AT_name("ADCCTL2")
    9908                      .dwattr $C$DW$1796, DW_AT_TI_symbol_name("_ADCCTL2")
    9909                      .dwattr $C$DW$1796, DW_AT_data_member_location[DW_OP_plus_uconst 0x6601]
    9910                      .dwattr $C$DW$1796, DW_AT_accessibility(DW_ACCESS_public)
    9911              $C$DW$1797      .dwtag  DW_TAG_member
    9912                      .dwattr $C$DW$1797, DW_AT_type(*$C$DW$T$26)
    9913                      .dwattr $C$DW$1797, DW_AT_name("rsvd_2")
    9914                      .dwattr $C$DW$1797, DW_AT_TI_symbol_name("_rsvd_2")
    9915                      .dwattr $C$DW$1797, DW_AT_data_member_location[DW_OP_plus_uconst 0x6602]
    9916                      .dwattr $C$DW$1797, DW_AT_accessibility(DW_ACCESS_public)
    9917              $C$DW$1798      .dwtag  DW_TAG_member
    9918                      .dwattr $C$DW$1798, DW_AT_type(*$C$DW$T$23)
    9919                      .dwattr $C$DW$1798, DW_AT_name("ADCINTFLG")
    9920                      .dwattr $C$DW$1798, DW_AT_TI_symbol_name("_ADCINTFLG")
    9921                      .dwattr $C$DW$1798, DW_AT_data_member_location[DW_OP_plus_uconst 0x6604]
    9922                      .dwattr $C$DW$1798, DW_AT_accessibility(DW_ACCESS_public)
    9923              $C$DW$1799      .dwtag  DW_TAG_member
    9924                      .dwattr $C$DW$1799, DW_AT_type(*$C$DW$T$23)
    9925                      .dwattr $C$DW$1799, DW_AT_name("ADCINTFLGCLR")
    9926                      .dwattr $C$DW$1799, DW_AT_TI_symbol_name("_ADCINTFLGCLR")
    9927                      .dwattr $C$DW$1799, DW_AT_data_member_location[DW_OP_plus_uconst 0x6605]
    9928                      .dwattr $C$DW$1799, DW_AT_accessibility(DW_ACCESS_public)
    9929              $C$DW$1800      .dwtag  DW_TAG_member
    9930                      .dwattr $C$DW$1800, DW_AT_type(*$C$DW$T$23)
    9931                      .dwattr $C$DW$1800, DW_AT_name("ADCINTOVF")
    9932                      .dwattr $C$DW$1800, DW_AT_TI_symbol_name("_ADCINTOVF")
    9933                      .dwattr $C$DW$1800, DW_AT_data_member_location[DW_OP_plus_uconst 0x6606]
    9934                      .dwattr $C$DW$1800, DW_AT_accessibility(DW_ACCESS_public)
    9935              $C$DW$1801      .dwtag  DW_TAG_member
    9936                      .dwattr $C$DW$1801, DW_AT_type(*$C$DW$T$23)
    9937                      .dwattr $C$DW$1801, DW_AT_name("ADCINTOVFCLR")
    9938                      .dwattr $C$DW$1801, DW_AT_TI_symbol_name("_ADCINTOVFCLR")
    9939                      .dwattr $C$DW$1801, DW_AT_data_member_location[DW_OP_plus_uconst 0x6607]
    9940                      .dwattr $C$DW$1801, DW_AT_accessibility(DW_ACCESS_public)
    9941              $C$DW$1802      .dwtag  DW_TAG_member
TMS320C2000 Assembler PC v6.2.5 Tue Sep 12 20:58:49 2017

Tools Copyright (c) 1996-2014 Texas Instruments Incorporated
C:\Users\wmj\AppData\Local\Temp\1256010                              PAGE  191

    9942                      .dwattr $C$DW$1802, DW_AT_type(*$C$DW$T$27)
    9943                      .dwattr $C$DW$1802, DW_AT_name("INTSELxNy")
    9944                      .dwattr $C$DW$1802, DW_AT_TI_symbol_name("_INTSELxNy")
    9945                      .dwattr $C$DW$1802, DW_AT_data_member_location[DW_OP_plus_uconst 0x6608]
    9946                      .dwattr $C$DW$1802, DW_AT_accessibility(DW_ACCESS_public)
    9947              $C$DW$1803      .dwtag  DW_TAG_member
    9948                      .dwattr $C$DW$1803, DW_AT_type(*$C$DW$T$28)
    9949                      .dwattr $C$DW$1803, DW_AT_name("rsvd_3")
    9950                      .dwattr $C$DW$1803, DW_AT_TI_symbol_name("_rsvd_3")
    9951                      .dwattr $C$DW$1803, DW_AT_data_member_location[DW_OP_plus_uconst 0x660d]
    9952                      .dwattr $C$DW$1803, DW_AT_accessibility(DW_ACCESS_public)
    9953              $C$DW$1804      .dwtag  DW_TAG_member
    9954                      .dwattr $C$DW$1804, DW_AT_type(*$C$DW$T$23)
    9955                      .dwattr $C$DW$1804, DW_AT_name("SOCPRICTRL")
    9956                      .dwattr $C$DW$1804, DW_AT_TI_symbol_name("_SOCPRICTRL")
    9957                      .dwattr $C$DW$1804, DW_AT_data_member_location[DW_OP_plus_uconst 0x6610]
    9958                      .dwattr $C$DW$1804, DW_AT_accessibility(DW_ACCESS_public)
    9959              $C$DW$1805      .dwtag  DW_TAG_member
    9960                      .dwattr $C$DW$1805, DW_AT_type(*$C$DW$T$23)
    9961                      .dwattr $C$DW$1805, DW_AT_name("rsvd_4")
    9962                      .dwattr $C$DW$1805, DW_AT_TI_symbol_name("_rsvd_4")
    9963                      .dwattr $C$DW$1805, DW_AT_data_member_location[DW_OP_plus_uconst 0x6611]
    9964                      .dwattr $C$DW$1805, DW_AT_accessibility(DW_ACCESS_public)
    9965              $C$DW$1806      .dwtag  DW_TAG_member
    9966                      .dwattr $C$DW$1806, DW_AT_type(*$C$DW$T$23)
    9967                      .dwattr $C$DW$1806, DW_AT_name("ADCSAMPLEMODE")
    9968                      .dwattr $C$DW$1806, DW_AT_TI_symbol_name("_ADCSAMPLEMODE")
    9969                      .dwattr $C$DW$1806, DW_AT_data_member_location[DW_OP_plus_uconst 0x6612]
    9970                      .dwattr $C$DW$1806, DW_AT_accessibility(DW_ACCESS_public)
    9971              $C$DW$1807      .dwtag  DW_TAG_member
    9972                      .dwattr $C$DW$1807, DW_AT_type(*$C$DW$T$23)
    9973                      .dwattr $C$DW$1807, DW_AT_name("rsvd_5")
    9974                      .dwattr $C$DW$1807, DW_AT_TI_symbol_name("_rsvd_5")
    9975                      .dwattr $C$DW$1807, DW_AT_data_member_location[DW_OP_plus_uconst 0x6613]
    9976                      .dwattr $C$DW$1807, DW_AT_accessibility(DW_ACCESS_public)
    9977              $C$DW$1808      .dwtag  DW_TAG_member
    9978                      .dwattr $C$DW$1808, DW_AT_type(*$C$DW$T$23)
    9979                      .dwattr $C$DW$1808, DW_AT_name("ADCINTSOCSEL1")
    9980                      .dwattr $C$DW$1808, DW_AT_TI_symbol_name("_ADCINTSOCSEL1")
    9981                      .dwattr $C$DW$1808, DW_AT_data_member_location[DW_OP_plus_uconst 0x6614]
    9982                      .dwattr $C$DW$1808, DW_AT_accessibility(DW_ACCESS_public)
    9983              $C$DW$1809      .dwtag  DW_TAG_member
    9984                      .dwattr $C$DW$1809, DW_AT_type(*$C$DW$T$23)
    9985                      .dwattr $C$DW$1809, DW_AT_name("ADCINTSOCSEL2")
    9986                      .dwattr $C$DW$1809, DW_AT_TI_symbol_name("_ADCINTSOCSEL2")
    9987                      .dwattr $C$DW$1809, DW_AT_data_member_location[DW_OP_plus_uconst 0x6615]
    9988                      .dwattr $C$DW$1809, DW_AT_accessibility(DW_ACCESS_public)
    9989              $C$DW$1810      .dwtag  DW_TAG_member
    9990                      .dwattr $C$DW$1810, DW_AT_type(*$C$DW$T$26)
    9991                      .dwattr $C$DW$1810, DW_AT_name("rsvd_6")
    9992                      .dwattr $C$DW$1810, DW_AT_TI_symbol_name("_rsvd_6")
    9993                      .dwattr $C$DW$1810, DW_AT_data_member_location[DW_OP_plus_uconst 0x6616]
    9994                      .dwattr $C$DW$1810, DW_AT_accessibility(DW_ACCESS_public)
    9995              $C$DW$1811      .dwtag  DW_TAG_member
    9996                      .dwattr $C$DW$1811, DW_AT_type(*$C$DW$T$23)
TMS320C2000 Assembler PC v6.2.5 Tue Sep 12 20:58:49 2017

Tools Copyright (c) 1996-2014 Texas Instruments Incorporated
C:\Users\wmj\AppData\Local\Temp\1256010                              PAGE  192

    9997                      .dwattr $C$DW$1811, DW_AT_name("ADCSOCFLG1")
    9998                      .dwattr $C$DW$1811, DW_AT_TI_symbol_name("_ADCSOCFLG1")
    9999                      .dwattr $C$DW$1811, DW_AT_data_member_location[DW_OP_plus_uconst 0x6618]
   10000                      .dwattr $C$DW$1811, DW_AT_accessibility(DW_ACCESS_public)
   10001              $C$DW$1812      .dwtag  DW_TAG_member
   10002                      .dwattr $C$DW$1812, DW_AT_type(*$C$DW$T$23)
   10003                      .dwattr $C$DW$1812, DW_AT_name("rsvd_7")
   10004                      .dwattr $C$DW$1812, DW_AT_TI_symbol_name("_rsvd_7")
   10005                      .dwattr $C$DW$1812, DW_AT_data_member_location[DW_OP_plus_uconst 0x6619]
   10006                      .dwattr $C$DW$1812, DW_AT_accessibility(DW_ACCESS_public)
   10007              $C$DW$1813      .dwtag  DW_TAG_member
   10008                      .dwattr $C$DW$1813, DW_AT_type(*$C$DW$T$23)
   10009                      .dwattr $C$DW$1813, DW_AT_name("ADCSOCFRC1")
   10010                      .dwattr $C$DW$1813, DW_AT_TI_symbol_name("_ADCSOCFRC1")
   10011                      .dwattr $C$DW$1813, DW_AT_data_member_location[DW_OP_plus_uconst 0x661a]
   10012                      .dwattr $C$DW$1813, DW_AT_accessibility(DW_ACCESS_public)
   10013              $C$DW$1814      .dwtag  DW_TAG_member
   10014                      .dwattr $C$DW$1814, DW_AT_type(*$C$DW$T$23)
   10015                      .dwattr $C$DW$1814, DW_AT_name("rsvd_8")
   10016                      .dwattr $C$DW$1814, DW_AT_TI_symbol_name("_rsvd_8")
   10017                      .dwattr $C$DW$1814, DW_AT_data_member_location[DW_OP_plus_uconst 0x661b]
   10018                      .dwattr $C$DW$1814, DW_AT_accessibility(DW_ACCESS_public)
   10019              $C$DW$1815      .dwtag  DW_TAG_member
   10020                      .dwattr $C$DW$1815, DW_AT_type(*$C$DW$T$23)
   10021                      .dwattr $C$DW$1815, DW_AT_name("ADCSOCOVF1")
   10022                      .dwattr $C$DW$1815, DW_AT_TI_symbol_name("_ADCSOCOVF1")
   10023                      .dwattr $C$DW$1815, DW_AT_data_member_location[DW_OP_plus_uconst 0x661c]
   10024                      .dwattr $C$DW$1815, DW_AT_accessibility(DW_ACCESS_public)
   10025              $C$DW$1816      .dwtag  DW_TAG_member
   10026                      .dwattr $C$DW$1816, DW_AT_type(*$C$DW$T$23)
   10027                      .dwattr $C$DW$1816, DW_AT_name("rsvd_9")
   10028                      .dwattr $C$DW$1816, DW_AT_TI_symbol_name("_rsvd_9")
   10029                      .dwattr $C$DW$1816, DW_AT_data_member_location[DW_OP_plus_uconst 0x661d]
   10030                      .dwattr $C$DW$1816, DW_AT_accessibility(DW_ACCESS_public)
   10031              $C$DW$1817      .dwtag  DW_TAG_member
   10032                      .dwattr $C$DW$1817, DW_AT_type(*$C$DW$T$23)
   10033                      .dwattr $C$DW$1817, DW_AT_name("ADCSOCOVFCLR1")
   10034                      .dwattr $C$DW$1817, DW_AT_TI_symbol_name("_ADCSOCOVFCLR1")
   10035                      .dwattr $C$DW$1817, DW_AT_data_member_location[DW_OP_plus_uconst 0x661e]
   10036                      .dwattr $C$DW$1817, DW_AT_accessibility(DW_ACCESS_public)
   10037              $C$DW$1818      .dwtag  DW_TAG_member
   10038                      .dwattr $C$DW$1818, DW_AT_type(*$C$DW$T$23)
   10039                      .dwattr $C$DW$1818, DW_AT_name("rsvd_10")
   10040                      .dwattr $C$DW$1818, DW_AT_TI_symbol_name("_rsvd_10")
   10041                      .dwattr $C$DW$1818, DW_AT_data_member_location[DW_OP_plus_uconst 0x661f]
   10042                      .dwattr $C$DW$1818, DW_AT_accessibility(DW_ACCESS_public)
   10043              $C$DW$1819      .dwtag  DW_TAG_member
   10044                      .dwattr $C$DW$1819, DW_AT_type(*$C$DW$T$24)
   10045                      .dwattr $C$DW$1819, DW_AT_name("ADCSOCxCTL")
   10046                      .dwattr $C$DW$1819, DW_AT_TI_symbol_name("_ADCSOCxCTL")
   10047                      .dwattr $C$DW$1819, DW_AT_data_member_location[DW_OP_plus_uconst 0x6620]
   10048                      .dwattr $C$DW$1819, DW_AT_accessibility(DW_ACCESS_public)
   10049              $C$DW$1820      .dwtag  DW_TAG_member
   10050                      .dwattr $C$DW$1820, DW_AT_type(*$C$DW$T$24)
   10051                      .dwattr $C$DW$1820, DW_AT_name("rsvd_11")
TMS320C2000 Assembler PC v6.2.5 Tue Sep 12 20:58:49 2017

Tools Copyright (c) 1996-2014 Texas Instruments Incorporated
C:\Users\wmj\AppData\Local\Temp\1256010                              PAGE  193

   10052                      .dwattr $C$DW$1820, DW_AT_TI_symbol_name("_rsvd_11")
   10053                      .dwattr $C$DW$1820, DW_AT_data_member_location[DW_OP_plus_uconst 0x6630]
   10054                      .dwattr $C$DW$1820, DW_AT_accessibility(DW_ACCESS_public)
   10055              $C$DW$1821      .dwtag  DW_TAG_member
   10056                      .dwattr $C$DW$1821, DW_AT_type(*$C$DW$T$23)
   10057                      .dwattr $C$DW$1821, DW_AT_name("ADCREFTRIM")
   10058                      .dwattr $C$DW$1821, DW_AT_TI_symbol_name("_ADCREFTRIM")
   10059                      .dwattr $C$DW$1821, DW_AT_data_member_location[DW_OP_plus_uconst 0x6640]
   10060                      .dwattr $C$DW$1821, DW_AT_accessibility(DW_ACCESS_public)
   10061              $C$DW$1822      .dwtag  DW_TAG_member
   10062                      .dwattr $C$DW$1822, DW_AT_type(*$C$DW$T$23)
   10063                      .dwattr $C$DW$1822, DW_AT_name("ADCOFFTRIM")
   10064                      .dwattr $C$DW$1822, DW_AT_TI_symbol_name("_ADCOFFTRIM")
   10065                      .dwattr $C$DW$1822, DW_AT_data_member_location[DW_OP_plus_uconst 0x6641]
   10066                      .dwattr $C$DW$1822, DW_AT_accessibility(DW_ACCESS_public)
   10067              $C$DW$1823      .dwtag  DW_TAG_member
   10068                      .dwattr $C$DW$1823, DW_AT_type(*$C$DW$T$29)
   10069                      .dwattr $C$DW$1823, DW_AT_name("resvd_12")
   10070                      .dwattr $C$DW$1823, DW_AT_TI_symbol_name("_resvd_12")
   10071                      .dwattr $C$DW$1823, DW_AT_data_member_location[DW_OP_plus_uconst 0x6642]
   10072                      .dwattr $C$DW$1823, DW_AT_accessibility(DW_ACCESS_public)
   10073              $C$DW$1824      .dwtag  DW_TAG_member
   10074                      .dwattr $C$DW$1824, DW_AT_type(*$C$DW$T$23)
   10075                      .dwattr $C$DW$1824, DW_AT_name("ADCREV")
   10076                      .dwattr $C$DW$1824, DW_AT_TI_symbol_name("_ADCREV")
   10077                      .dwattr $C$DW$1824, DW_AT_data_member_location[DW_OP_plus_uconst 0x664f]
   10078                      .dwattr $C$DW$1824, DW_AT_accessibility(DW_ACCESS_public)
   10079                      .dwendtag $C$DW$T$30
   10080              
   10081              $C$DW$T$331     .dwtag  DW_TAG_typedef, DW_AT_name("ADC_Obj")
   10082                      .dwattr $C$DW$T$331, DW_AT_type(*$C$DW$T$30)
   10083                      .dwattr $C$DW$T$331, DW_AT_language(DW_LANG_C)
   10084              $C$DW$T$50      .dwtag  DW_TAG_pointer_type
   10085                      .dwattr $C$DW$T$50, DW_AT_type(*$C$DW$T$30)
   10086                      .dwattr $C$DW$T$50, DW_AT_address_class(0x16)
   10087              $C$DW$T$51      .dwtag  DW_TAG_typedef, DW_AT_name("ADC_Handle")
   10088                      .dwattr $C$DW$T$51, DW_AT_type(*$C$DW$T$50)
   10089                      .dwattr $C$DW$T$51, DW_AT_language(DW_LANG_C)
   10090              
   10091              $C$DW$T$32      .dwtag  DW_TAG_structure_type
   10092                      .dwattr $C$DW$T$32, DW_AT_name("_CLK_Obj_")
   10093                      .dwattr $C$DW$T$32, DW_AT_byte_size(0x11)
   10094              $C$DW$1825      .dwtag  DW_TAG_member
   10095                      .dwattr $C$DW$1825, DW_AT_type(*$C$DW$T$23)
   10096                      .dwattr $C$DW$1825, DW_AT_name("XCLK")
   10097                      .dwattr $C$DW$1825, DW_AT_TI_symbol_name("_XCLK")
   10098                      .dwattr $C$DW$1825, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
   10099                      .dwattr $C$DW$1825, DW_AT_accessibility(DW_ACCESS_public)
   10100              $C$DW$1826      .dwtag  DW_TAG_member
   10101                      .dwattr $C$DW$1826, DW_AT_type(*$C$DW$T$23)
   10102                      .dwattr $C$DW$1826, DW_AT_name("rsvd_1")
   10103                      .dwattr $C$DW$1826, DW_AT_TI_symbol_name("_rsvd_1")
   10104                      .dwattr $C$DW$1826, DW_AT_data_member_location[DW_OP_plus_uconst 0x1]
   10105                      .dwattr $C$DW$1826, DW_AT_accessibility(DW_ACCESS_public)
   10106              $C$DW$1827      .dwtag  DW_TAG_member
TMS320C2000 Assembler PC v6.2.5 Tue Sep 12 20:58:49 2017

Tools Copyright (c) 1996-2014 Texas Instruments Incorporated
C:\Users\wmj\AppData\Local\Temp\1256010                              PAGE  194

   10107                      .dwattr $C$DW$1827, DW_AT_type(*$C$DW$T$23)
   10108                      .dwattr $C$DW$1827, DW_AT_name("CLKCTL")
   10109                      .dwattr $C$DW$1827, DW_AT_TI_symbol_name("_CLKCTL")
   10110                      .dwattr $C$DW$1827, DW_AT_data_member_location[DW_OP_plus_uconst 0x2]
   10111                      .dwattr $C$DW$1827, DW_AT_accessibility(DW_ACCESS_public)
   10112              $C$DW$1828      .dwtag  DW_TAG_member
   10113                      .dwattr $C$DW$1828, DW_AT_type(*$C$DW$T$31)
   10114                      .dwattr $C$DW$1828, DW_AT_name("rsvd_2")
   10115                      .dwattr $C$DW$1828, DW_AT_TI_symbol_name("_rsvd_2")
   10116                      .dwattr $C$DW$1828, DW_AT_data_member_location[DW_OP_plus_uconst 0x3]
   10117                      .dwattr $C$DW$1828, DW_AT_accessibility(DW_ACCESS_public)
   10118              $C$DW$1829      .dwtag  DW_TAG_member
   10119                      .dwattr $C$DW$1829, DW_AT_type(*$C$DW$T$23)
   10120                      .dwattr $C$DW$1829, DW_AT_name("LOSPCP")
   10121                      .dwattr $C$DW$1829, DW_AT_TI_symbol_name("_LOSPCP")
   10122                      .dwattr $C$DW$1829, DW_AT_data_member_location[DW_OP_plus_uconst 0xb]
   10123                      .dwattr $C$DW$1829, DW_AT_accessibility(DW_ACCESS_public)
   10124              $C$DW$1830      .dwtag  DW_TAG_member
   10125                      .dwattr $C$DW$1830, DW_AT_type(*$C$DW$T$23)
   10126                      .dwattr $C$DW$1830, DW_AT_name("PCLKCR0")
   10127                      .dwattr $C$DW$1830, DW_AT_TI_symbol_name("_PCLKCR0")
   10128                      .dwattr $C$DW$1830, DW_AT_data_member_location[DW_OP_plus_uconst 0xc]
   10129                      .dwattr $C$DW$1830, DW_AT_accessibility(DW_ACCESS_public)
   10130              $C$DW$1831      .dwtag  DW_TAG_member
   10131                      .dwattr $C$DW$1831, DW_AT_type(*$C$DW$T$23)
   10132                      .dwattr $C$DW$1831, DW_AT_name("PCLKCR1")
   10133                      .dwattr $C$DW$1831, DW_AT_TI_symbol_name("_PCLKCR1")
   10134                      .dwattr $C$DW$1831, DW_AT_data_member_location[DW_OP_plus_uconst 0xd]
   10135                      .dwattr $C$DW$1831, DW_AT_accessibility(DW_ACCESS_public)
   10136              $C$DW$1832      .dwtag  DW_TAG_member
   10137                      .dwattr $C$DW$1832, DW_AT_type(*$C$DW$T$26)
   10138                      .dwattr $C$DW$1832, DW_AT_name("rsvd_3")
   10139                      .dwattr $C$DW$1832, DW_AT_TI_symbol_name("_rsvd_3")
   10140                      .dwattr $C$DW$1832, DW_AT_data_member_location[DW_OP_plus_uconst 0xe]
   10141                      .dwattr $C$DW$1832, DW_AT_accessibility(DW_ACCESS_public)
   10142              $C$DW$1833      .dwtag  DW_TAG_member
   10143                      .dwattr $C$DW$1833, DW_AT_type(*$C$DW$T$23)
   10144                      .dwattr $C$DW$1833, DW_AT_name("PCLKCR3")
   10145                      .dwattr $C$DW$1833, DW_AT_TI_symbol_name("_PCLKCR3")
   10146                      .dwattr $C$DW$1833, DW_AT_data_member_location[DW_OP_plus_uconst 0x10]
   10147                      .dwattr $C$DW$1833, DW_AT_accessibility(DW_ACCESS_public)
   10148                      .dwendtag $C$DW$T$32
   10149              
   10150              $C$DW$T$52      .dwtag  DW_TAG_pointer_type
   10151                      .dwattr $C$DW$T$52, DW_AT_type(*$C$DW$T$32)
   10152                      .dwattr $C$DW$T$52, DW_AT_address_class(0x16)
   10153              $C$DW$T$53      .dwtag  DW_TAG_typedef, DW_AT_name("CLK_Handle")
   10154                      .dwattr $C$DW$T$53, DW_AT_type(*$C$DW$T$52)
   10155                      .dwattr $C$DW$T$53, DW_AT_language(DW_LANG_C)
   10156              
   10157              $C$DW$T$34      .dwtag  DW_TAG_structure_type
   10158                      .dwattr $C$DW$T$34, DW_AT_name("_CPU_Obj_")
   10159                      .dwattr $C$DW$T$34, DW_AT_byte_size(0x01)
   10160              $C$DW$1834      .dwtag  DW_TAG_member
   10161                      .dwattr $C$DW$1834, DW_AT_type(*$C$DW$T$33)
TMS320C2000 Assembler PC v6.2.5 Tue Sep 12 20:58:49 2017

Tools Copyright (c) 1996-2014 Texas Instruments Incorporated
C:\Users\wmj\AppData\Local\Temp\1256010                              PAGE  195

   10162                      .dwattr $C$DW$1834, DW_AT_name("tmp")
   10163                      .dwattr $C$DW$1834, DW_AT_TI_symbol_name("_tmp")
   10164                      .dwattr $C$DW$1834, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
   10165                      .dwattr $C$DW$1834, DW_AT_accessibility(DW_ACCESS_public)
   10166                      .dwendtag $C$DW$T$34
   10167              
   10168              $C$DW$T$338     .dwtag  DW_TAG_typedef, DW_AT_name("CPU_Obj")
   10169                      .dwattr $C$DW$T$338, DW_AT_type(*$C$DW$T$34)
   10170                      .dwattr $C$DW$T$338, DW_AT_language(DW_LANG_C)
   10171              $C$DW$T$54      .dwtag  DW_TAG_pointer_type
   10172                      .dwattr $C$DW$T$54, DW_AT_type(*$C$DW$T$34)
   10173                      .dwattr $C$DW$T$54, DW_AT_address_class(0x16)
   10174              $C$DW$T$55      .dwtag  DW_TAG_typedef, DW_AT_name("CPU_Handle")
   10175                      .dwattr $C$DW$T$55, DW_AT_type(*$C$DW$T$54)
   10176                      .dwattr $C$DW$T$55, DW_AT_language(DW_LANG_C)
   10177              
   10178              $C$DW$T$36      .dwtag  DW_TAG_structure_type
   10179                      .dwattr $C$DW$T$36, DW_AT_name("_FILTER_FO_")
   10180                      .dwattr $C$DW$T$36, DW_AT_byte_size(0x0a)
   10181              $C$DW$1835      .dwtag  DW_TAG_member
   10182                      .dwattr $C$DW$1835, DW_AT_type(*$C$DW$T$35)
   10183                      .dwattr $C$DW$1835, DW_AT_name("a1")
   10184                      .dwattr $C$DW$1835, DW_AT_TI_symbol_name("_a1")
   10185                      .dwattr $C$DW$1835, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
   10186                      .dwattr $C$DW$1835, DW_AT_accessibility(DW_ACCESS_public)
   10187              $C$DW$1836      .dwtag  DW_TAG_member
   10188                      .dwattr $C$DW$1836, DW_AT_type(*$C$DW$T$35)
   10189                      .dwattr $C$DW$1836, DW_AT_name("b0")
   10190                      .dwattr $C$DW$1836, DW_AT_TI_symbol_name("_b0")
   10191                      .dwattr $C$DW$1836, DW_AT_data_member_location[DW_OP_plus_uconst 0x2]
   10192                      .dwattr $C$DW$1836, DW_AT_accessibility(DW_ACCESS_public)
   10193              $C$DW$1837      .dwtag  DW_TAG_member
   10194                      .dwattr $C$DW$1837, DW_AT_type(*$C$DW$T$35)
   10195                      .dwattr $C$DW$1837, DW_AT_name("b1")
   10196                      .dwattr $C$DW$1837, DW_AT_TI_symbol_name("_b1")
   10197                      .dwattr $C$DW$1837, DW_AT_data_member_location[DW_OP_plus_uconst 0x4]
   10198                      .dwattr $C$DW$1837, DW_AT_accessibility(DW_ACCESS_public)
   10199              $C$DW$1838      .dwtag  DW_TAG_member
   10200                      .dwattr $C$DW$1838, DW_AT_type(*$C$DW$T$35)
   10201                      .dwattr $C$DW$1838, DW_AT_name("x1")
   10202                      .dwattr $C$DW$1838, DW_AT_TI_symbol_name("_x1")
   10203                      .dwattr $C$DW$1838, DW_AT_data_member_location[DW_OP_plus_uconst 0x6]
   10204                      .dwattr $C$DW$1838, DW_AT_accessibility(DW_ACCESS_public)
   10205              $C$DW$1839      .dwtag  DW_TAG_member
   10206                      .dwattr $C$DW$1839, DW_AT_type(*$C$DW$T$35)
   10207                      .dwattr $C$DW$1839, DW_AT_name("y1")
   10208                      .dwattr $C$DW$1839, DW_AT_TI_symbol_name("_y1")
   10209                      .dwattr $C$DW$1839, DW_AT_data_member_location[DW_OP_plus_uconst 0x8]
   10210                      .dwattr $C$DW$1839, DW_AT_accessibility(DW_ACCESS_public)
   10211                      .dwendtag $C$DW$T$36
   10212              
   10213              $C$DW$T$91      .dwtag  DW_TAG_typedef, DW_AT_name("FILTER_FO_Obj")
   10214                      .dwattr $C$DW$T$91, DW_AT_type(*$C$DW$T$36)
   10215                      .dwattr $C$DW$T$91, DW_AT_language(DW_LANG_C)
   10216              
TMS320C2000 Assembler PC v6.2.5 Tue Sep 12 20:58:49 2017

Tools Copyright (c) 1996-2014 Texas Instruments Incorporated
C:\Users\wmj\AppData\Local\Temp\1256010                              PAGE  196

   10217              $C$DW$T$20      .dwtag  DW_TAG_structure_type
   10218                      .dwattr $C$DW$T$20, DW_AT_name("_FILTER_FO_Obj_")
   10219                      .dwattr $C$DW$T$20, DW_AT_declaration
   10220                      .dwendtag $C$DW$T$20
   10221              
   10222              $C$DW$T$92      .dwtag  DW_TAG_pointer_type
   10223                      .dwattr $C$DW$T$92, DW_AT_type(*$C$DW$T$20)
   10224                      .dwattr $C$DW$T$92, DW_AT_address_class(0x16)
   10225              $C$DW$T$93      .dwtag  DW_TAG_typedef, DW_AT_name("FILTER_FO_Handle")
   10226                      .dwattr $C$DW$T$93, DW_AT_type(*$C$DW$T$92)
   10227                      .dwattr $C$DW$T$93, DW_AT_language(DW_LANG_C)
   10228              
   10229              $C$DW$T$37      .dwtag  DW_TAG_structure_type
   10230                      .dwattr $C$DW$T$37, DW_AT_name("_FLASH_Obj_")
   10231                      .dwattr $C$DW$T$37, DW_AT_byte_size(0x08)
   10232              $C$DW$1840      .dwtag  DW_TAG_member
   10233                      .dwattr $C$DW$1840, DW_AT_type(*$C$DW$T$23)
   10234                      .dwattr $C$DW$1840, DW_AT_name("FOPT")
   10235                      .dwattr $C$DW$1840, DW_AT_TI_symbol_name("_FOPT")
   10236                      .dwattr $C$DW$1840, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
   10237                      .dwattr $C$DW$1840, DW_AT_accessibility(DW_ACCESS_public)
   10238              $C$DW$1841      .dwtag  DW_TAG_member
   10239                      .dwattr $C$DW$1841, DW_AT_type(*$C$DW$T$23)
   10240                      .dwattr $C$DW$1841, DW_AT_name("rsvd_1")
   10241                      .dwattr $C$DW$1841, DW_AT_TI_symbol_name("_rsvd_1")
   10242                      .dwattr $C$DW$1841, DW_AT_data_member_location[DW_OP_plus_uconst 0x1]
   10243                      .dwattr $C$DW$1841, DW_AT_accessibility(DW_ACCESS_public)
   10244              $C$DW$1842      .dwtag  DW_TAG_member
   10245                      .dwattr $C$DW$1842, DW_AT_type(*$C$DW$T$23)
   10246                      .dwattr $C$DW$1842, DW_AT_name("FPWR")
   10247                      .dwattr $C$DW$1842, DW_AT_TI_symbol_name("_FPWR")
   10248                      .dwattr $C$DW$1842, DW_AT_data_member_location[DW_OP_plus_uconst 0x2]
   10249                      .dwattr $C$DW$1842, DW_AT_accessibility(DW_ACCESS_public)
   10250              $C$DW$1843      .dwtag  DW_TAG_member
   10251                      .dwattr $C$DW$1843, DW_AT_type(*$C$DW$T$23)
   10252                      .dwattr $C$DW$1843, DW_AT_name("FSTATUS")
   10253                      .dwattr $C$DW$1843, DW_AT_TI_symbol_name("_FSTATUS")
   10254                      .dwattr $C$DW$1843, DW_AT_data_member_location[DW_OP_plus_uconst 0x3]
   10255                      .dwattr $C$DW$1843, DW_AT_accessibility(DW_ACCESS_public)
   10256              $C$DW$1844      .dwtag  DW_TAG_member
   10257                      .dwattr $C$DW$1844, DW_AT_type(*$C$DW$T$23)
   10258                      .dwattr $C$DW$1844, DW_AT_name("FSTDBYWAIT")
   10259                      .dwattr $C$DW$1844, DW_AT_TI_symbol_name("_FSTDBYWAIT")
   10260                      .dwattr $C$DW$1844, DW_AT_data_member_location[DW_OP_plus_uconst 0x4]
   10261                      .dwattr $C$DW$1844, DW_AT_accessibility(DW_ACCESS_public)
   10262              $C$DW$1845      .dwtag  DW_TAG_member
   10263                      .dwattr $C$DW$1845, DW_AT_type(*$C$DW$T$23)
   10264                      .dwattr $C$DW$1845, DW_AT_name("FACTIVEWAIT")
   10265                      .dwattr $C$DW$1845, DW_AT_TI_symbol_name("_FACTIVEWAIT")
   10266                      .dwattr $C$DW$1845, DW_AT_data_member_location[DW_OP_plus_uconst 0x5]
   10267                      .dwattr $C$DW$1845, DW_AT_accessibility(DW_ACCESS_public)
   10268              $C$DW$1846      .dwtag  DW_TAG_member
   10269                      .dwattr $C$DW$1846, DW_AT_type(*$C$DW$T$23)
   10270                      .dwattr $C$DW$1846, DW_AT_name("FBANKWAIT")
   10271                      .dwattr $C$DW$1846, DW_AT_TI_symbol_name("_FBANKWAIT")
TMS320C2000 Assembler PC v6.2.5 Tue Sep 12 20:58:49 2017

Tools Copyright (c) 1996-2014 Texas Instruments Incorporated
C:\Users\wmj\AppData\Local\Temp\1256010                              PAGE  197

   10272                      .dwattr $C$DW$1846, DW_AT_data_member_location[DW_OP_plus_uconst 0x6]
   10273                      .dwattr $C$DW$1846, DW_AT_accessibility(DW_ACCESS_public)
   10274              $C$DW$1847      .dwtag  DW_TAG_member
   10275                      .dwattr $C$DW$1847, DW_AT_type(*$C$DW$T$23)
   10276                      .dwattr $C$DW$1847, DW_AT_name("FOTPWAIT")
   10277                      .dwattr $C$DW$1847, DW_AT_TI_symbol_name("_FOTPWAIT")
   10278                      .dwattr $C$DW$1847, DW_AT_data_member_location[DW_OP_plus_uconst 0x7]
   10279                      .dwattr $C$DW$1847, DW_AT_accessibility(DW_ACCESS_public)
   10280                      .dwendtag $C$DW$T$37
   10281              
   10282              $C$DW$T$56      .dwtag  DW_TAG_pointer_type
   10283                      .dwattr $C$DW$T$56, DW_AT_type(*$C$DW$T$37)
   10284                      .dwattr $C$DW$T$56, DW_AT_address_class(0x16)
   10285              $C$DW$T$57      .dwtag  DW_TAG_typedef, DW_AT_name("FLASH_Handle")
   10286                      .dwattr $C$DW$T$57, DW_AT_type(*$C$DW$T$56)
   10287                      .dwattr $C$DW$T$57, DW_AT_language(DW_LANG_C)
   10288              
   10289              $C$DW$T$42      .dwtag  DW_TAG_structure_type
   10290                      .dwattr $C$DW$T$42, DW_AT_name("_GPIO_Obj_")
   10291                      .dwattr $C$DW$T$42, DW_AT_byte_size(0x6a)
   10292              $C$DW$1848      .dwtag  DW_TAG_member
   10293                      .dwattr $C$DW$1848, DW_AT_type(*$C$DW$T$39)
   10294                      .dwattr $C$DW$1848, DW_AT_name("GPACTRL")
   10295                      .dwattr $C$DW$1848, DW_AT_TI_symbol_name("_GPACTRL")
   10296                      .dwattr $C$DW$1848, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
   10297                      .dwattr $C$DW$1848, DW_AT_accessibility(DW_ACCESS_public)
   10298              $C$DW$1849      .dwtag  DW_TAG_member
   10299                      .dwattr $C$DW$1849, DW_AT_type(*$C$DW$T$39)
   10300                      .dwattr $C$DW$1849, DW_AT_name("GPAQSEL1")
   10301                      .dwattr $C$DW$1849, DW_AT_TI_symbol_name("_GPAQSEL1")
   10302                      .dwattr $C$DW$1849, DW_AT_data_member_location[DW_OP_plus_uconst 0x2]
   10303                      .dwattr $C$DW$1849, DW_AT_accessibility(DW_ACCESS_public)
   10304              $C$DW$1850      .dwtag  DW_TAG_member
   10305                      .dwattr $C$DW$1850, DW_AT_type(*$C$DW$T$39)
   10306                      .dwattr $C$DW$1850, DW_AT_name("GPAQSEL2")
   10307                      .dwattr $C$DW$1850, DW_AT_TI_symbol_name("_GPAQSEL2")
   10308                      .dwattr $C$DW$1850, DW_AT_data_member_location[DW_OP_plus_uconst 0x4]
   10309                      .dwattr $C$DW$1850, DW_AT_accessibility(DW_ACCESS_public)
   10310              $C$DW$1851      .dwtag  DW_TAG_member
   10311                      .dwattr $C$DW$1851, DW_AT_type(*$C$DW$T$39)
   10312                      .dwattr $C$DW$1851, DW_AT_name("GPAMUX1")
   10313                      .dwattr $C$DW$1851, DW_AT_TI_symbol_name("_GPAMUX1")
   10314                      .dwattr $C$DW$1851, DW_AT_data_member_location[DW_OP_plus_uconst 0x6]
   10315                      .dwattr $C$DW$1851, DW_AT_accessibility(DW_ACCESS_public)
   10316              $C$DW$1852      .dwtag  DW_TAG_member
   10317                      .dwattr $C$DW$1852, DW_AT_type(*$C$DW$T$39)
   10318                      .dwattr $C$DW$1852, DW_AT_name("GPAMUX2")
   10319                      .dwattr $C$DW$1852, DW_AT_TI_symbol_name("_GPAMUX2")
   10320                      .dwattr $C$DW$1852, DW_AT_data_member_location[DW_OP_plus_uconst 0x8]
   10321                      .dwattr $C$DW$1852, DW_AT_accessibility(DW_ACCESS_public)
   10322              $C$DW$1853      .dwtag  DW_TAG_member
   10323                      .dwattr $C$DW$1853, DW_AT_type(*$C$DW$T$39)
   10324                      .dwattr $C$DW$1853, DW_AT_name("GPADIR")
   10325                      .dwattr $C$DW$1853, DW_AT_TI_symbol_name("_GPADIR")
   10326                      .dwattr $C$DW$1853, DW_AT_data_member_location[DW_OP_plus_uconst 0xa]
TMS320C2000 Assembler PC v6.2.5 Tue Sep 12 20:58:49 2017

Tools Copyright (c) 1996-2014 Texas Instruments Incorporated
C:\Users\wmj\AppData\Local\Temp\1256010                              PAGE  198

   10327                      .dwattr $C$DW$1853, DW_AT_accessibility(DW_ACCESS_public)
   10328              $C$DW$1854      .dwtag  DW_TAG_member
   10329                      .dwattr $C$DW$1854, DW_AT_type(*$C$DW$T$39)
   10330                      .dwattr $C$DW$1854, DW_AT_name("GPAPUD")
   10331                      .dwattr $C$DW$1854, DW_AT_TI_symbol_name("_GPAPUD")
   10332                      .dwattr $C$DW$1854, DW_AT_data_member_location[DW_OP_plus_uconst 0xc]
   10333                      .dwattr $C$DW$1854, DW_AT_accessibility(DW_ACCESS_public)
   10334              $C$DW$1855      .dwtag  DW_TAG_member
   10335                      .dwattr $C$DW$1855, DW_AT_type(*$C$DW$T$26)
   10336                      .dwattr $C$DW$1855, DW_AT_name("rsvd_1")
   10337                      .dwattr $C$DW$1855, DW_AT_TI_symbol_name("_rsvd_1")
   10338                      .dwattr $C$DW$1855, DW_AT_data_member_location[DW_OP_plus_uconst 0xe]
   10339                      .dwattr $C$DW$1855, DW_AT_accessibility(DW_ACCESS_public)
   10340              $C$DW$1856      .dwtag  DW_TAG_member
   10341                      .dwattr $C$DW$1856, DW_AT_type(*$C$DW$T$39)
   10342                      .dwattr $C$DW$1856, DW_AT_name("GPBCTRL")
   10343                      .dwattr $C$DW$1856, DW_AT_TI_symbol_name("_GPBCTRL")
   10344                      .dwattr $C$DW$1856, DW_AT_data_member_location[DW_OP_plus_uconst 0x10]
   10345                      .dwattr $C$DW$1856, DW_AT_accessibility(DW_ACCESS_public)
   10346              $C$DW$1857      .dwtag  DW_TAG_member
   10347                      .dwattr $C$DW$1857, DW_AT_type(*$C$DW$T$39)
   10348                      .dwattr $C$DW$1857, DW_AT_name("GPBQSEL1")
   10349                      .dwattr $C$DW$1857, DW_AT_TI_symbol_name("_GPBQSEL1")
   10350                      .dwattr $C$DW$1857, DW_AT_data_member_location[DW_OP_plus_uconst 0x12]
   10351                      .dwattr $C$DW$1857, DW_AT_accessibility(DW_ACCESS_public)
   10352              $C$DW$1858      .dwtag  DW_TAG_member
   10353                      .dwattr $C$DW$1858, DW_AT_type(*$C$DW$T$26)
   10354                      .dwattr $C$DW$1858, DW_AT_name("rsvd_2")
   10355                      .dwattr $C$DW$1858, DW_AT_TI_symbol_name("_rsvd_2")
   10356                      .dwattr $C$DW$1858, DW_AT_data_member_location[DW_OP_plus_uconst 0x14]
   10357                      .dwattr $C$DW$1858, DW_AT_accessibility(DW_ACCESS_public)
   10358              $C$DW$1859      .dwtag  DW_TAG_member
   10359                      .dwattr $C$DW$1859, DW_AT_type(*$C$DW$T$39)
   10360                      .dwattr $C$DW$1859, DW_AT_name("GPBMUX1")
   10361                      .dwattr $C$DW$1859, DW_AT_TI_symbol_name("_GPBMUX1")
   10362                      .dwattr $C$DW$1859, DW_AT_data_member_location[DW_OP_plus_uconst 0x16]
   10363                      .dwattr $C$DW$1859, DW_AT_accessibility(DW_ACCESS_public)
   10364              $C$DW$1860      .dwtag  DW_TAG_member
   10365                      .dwattr $C$DW$1860, DW_AT_type(*$C$DW$T$26)
   10366                      .dwattr $C$DW$1860, DW_AT_name("rsvd_3")
   10367                      .dwattr $C$DW$1860, DW_AT_TI_symbol_name("_rsvd_3")
   10368                      .dwattr $C$DW$1860, DW_AT_data_member_location[DW_OP_plus_uconst 0x18]
   10369                      .dwattr $C$DW$1860, DW_AT_accessibility(DW_ACCESS_public)
   10370              $C$DW$1861      .dwtag  DW_TAG_member
   10371                      .dwattr $C$DW$1861, DW_AT_type(*$C$DW$T$39)
   10372                      .dwattr $C$DW$1861, DW_AT_name("GPBDIR")
   10373                      .dwattr $C$DW$1861, DW_AT_TI_symbol_name("_GPBDIR")
   10374                      .dwattr $C$DW$1861, DW_AT_data_member_location[DW_OP_plus_uconst 0x1a]
   10375                      .dwattr $C$DW$1861, DW_AT_accessibility(DW_ACCESS_public)
   10376              $C$DW$1862      .dwtag  DW_TAG_member
   10377                      .dwattr $C$DW$1862, DW_AT_type(*$C$DW$T$39)
   10378                      .dwattr $C$DW$1862, DW_AT_name("GPBPUD")
   10379                      .dwattr $C$DW$1862, DW_AT_TI_symbol_name("_GPBPUD")
   10380                      .dwattr $C$DW$1862, DW_AT_data_member_location[DW_OP_plus_uconst 0x1c]
   10381                      .dwattr $C$DW$1862, DW_AT_accessibility(DW_ACCESS_public)
TMS320C2000 Assembler PC v6.2.5 Tue Sep 12 20:58:49 2017

Tools Copyright (c) 1996-2014 Texas Instruments Incorporated
C:\Users\wmj\AppData\Local\Temp\1256010                              PAGE  199

   10382              $C$DW$1863      .dwtag  DW_TAG_member
   10383                      .dwattr $C$DW$1863, DW_AT_type(*$C$DW$T$40)
   10384                      .dwattr $C$DW$1863, DW_AT_name("rsvd_4")
   10385                      .dwattr $C$DW$1863, DW_AT_TI_symbol_name("_rsvd_4")
   10386                      .dwattr $C$DW$1863, DW_AT_data_member_location[DW_OP_plus_uconst 0x1e]
   10387                      .dwattr $C$DW$1863, DW_AT_accessibility(DW_ACCESS_public)
   10388              $C$DW$1864      .dwtag  DW_TAG_member
   10389                      .dwattr $C$DW$1864, DW_AT_type(*$C$DW$T$39)
   10390                      .dwattr $C$DW$1864, DW_AT_name("AIOMUX1")
   10391                      .dwattr $C$DW$1864, DW_AT_TI_symbol_name("_AIOMUX1")
   10392                      .dwattr $C$DW$1864, DW_AT_data_member_location[DW_OP_plus_uconst 0x36]
   10393                      .dwattr $C$DW$1864, DW_AT_accessibility(DW_ACCESS_public)
   10394              $C$DW$1865      .dwtag  DW_TAG_member
   10395                      .dwattr $C$DW$1865, DW_AT_type(*$C$DW$T$26)
   10396                      .dwattr $C$DW$1865, DW_AT_name("rsvd_5")
   10397                      .dwattr $C$DW$1865, DW_AT_TI_symbol_name("_rsvd_5")
   10398                      .dwattr $C$DW$1865, DW_AT_data_member_location[DW_OP_plus_uconst 0x38]
   10399                      .dwattr $C$DW$1865, DW_AT_accessibility(DW_ACCESS_public)
   10400              $C$DW$1866      .dwtag  DW_TAG_member
   10401                      .dwattr $C$DW$1866, DW_AT_type(*$C$DW$T$39)
   10402                      .dwattr $C$DW$1866, DW_AT_name("AIODIR")
   10403                      .dwattr $C$DW$1866, DW_AT_TI_symbol_name("_AIODIR")
   10404                      .dwattr $C$DW$1866, DW_AT_data_member_location[DW_OP_plus_uconst 0x3a]
   10405                      .dwattr $C$DW$1866, DW_AT_accessibility(DW_ACCESS_public)
   10406              $C$DW$1867      .dwtag  DW_TAG_member
   10407                      .dwattr $C$DW$1867, DW_AT_type(*$C$DW$T$41)
   10408                      .dwattr $C$DW$1867, DW_AT_name("rsvd_6")
   10409                      .dwattr $C$DW$1867, DW_AT_TI_symbol_name("_rsvd_6")
   10410                      .dwattr $C$DW$1867, DW_AT_data_member_location[DW_OP_plus_uconst 0x3c]
   10411                      .dwattr $C$DW$1867, DW_AT_accessibility(DW_ACCESS_public)
   10412              $C$DW$1868      .dwtag  DW_TAG_member
   10413                      .dwattr $C$DW$1868, DW_AT_type(*$C$DW$T$39)
   10414                      .dwattr $C$DW$1868, DW_AT_name("GPADAT")
   10415                      .dwattr $C$DW$1868, DW_AT_TI_symbol_name("_GPADAT")
   10416                      .dwattr $C$DW$1868, DW_AT_data_member_location[DW_OP_plus_uconst 0x40]
   10417                      .dwattr $C$DW$1868, DW_AT_accessibility(DW_ACCESS_public)
   10418              $C$DW$1869      .dwtag  DW_TAG_member
   10419                      .dwattr $C$DW$1869, DW_AT_type(*$C$DW$T$39)
   10420                      .dwattr $C$DW$1869, DW_AT_name("GPASET")
   10421                      .dwattr $C$DW$1869, DW_AT_TI_symbol_name("_GPASET")
   10422                      .dwattr $C$DW$1869, DW_AT_data_member_location[DW_OP_plus_uconst 0x42]
   10423                      .dwattr $C$DW$1869, DW_AT_accessibility(DW_ACCESS_public)
   10424              $C$DW$1870      .dwtag  DW_TAG_member
   10425                      .dwattr $C$DW$1870, DW_AT_type(*$C$DW$T$39)
   10426                      .dwattr $C$DW$1870, DW_AT_name("GPACLEAR")
   10427                      .dwattr $C$DW$1870, DW_AT_TI_symbol_name("_GPACLEAR")
   10428                      .dwattr $C$DW$1870, DW_AT_data_member_location[DW_OP_plus_uconst 0x44]
   10429                      .dwattr $C$DW$1870, DW_AT_accessibility(DW_ACCESS_public)
   10430              $C$DW$1871      .dwtag  DW_TAG_member
   10431                      .dwattr $C$DW$1871, DW_AT_type(*$C$DW$T$39)
   10432                      .dwattr $C$DW$1871, DW_AT_name("GPATOGGLE")
   10433                      .dwattr $C$DW$1871, DW_AT_TI_symbol_name("_GPATOGGLE")
   10434                      .dwattr $C$DW$1871, DW_AT_data_member_location[DW_OP_plus_uconst 0x46]
   10435                      .dwattr $C$DW$1871, DW_AT_accessibility(DW_ACCESS_public)
   10436              $C$DW$1872      .dwtag  DW_TAG_member
TMS320C2000 Assembler PC v6.2.5 Tue Sep 12 20:58:49 2017

Tools Copyright (c) 1996-2014 Texas Instruments Incorporated
C:\Users\wmj\AppData\Local\Temp\1256010                              PAGE  200

   10437                      .dwattr $C$DW$1872, DW_AT_type(*$C$DW$T$39)
   10438                      .dwattr $C$DW$1872, DW_AT_name("GPBDAT")
   10439                      .dwattr $C$DW$1872, DW_AT_TI_symbol_name("_GPBDAT")
   10440                      .dwattr $C$DW$1872, DW_AT_data_member_location[DW_OP_plus_uconst 0x48]
   10441                      .dwattr $C$DW$1872, DW_AT_accessibility(DW_ACCESS_public)
   10442              $C$DW$1873      .dwtag  DW_TAG_member
   10443                      .dwattr $C$DW$1873, DW_AT_type(*$C$DW$T$39)
   10444                      .dwattr $C$DW$1873, DW_AT_name("GPBSET")
   10445                      .dwattr $C$DW$1873, DW_AT_TI_symbol_name("_GPBSET")
   10446                      .dwattr $C$DW$1873, DW_AT_data_member_location[DW_OP_plus_uconst 0x4a]
   10447                      .dwattr $C$DW$1873, DW_AT_accessibility(DW_ACCESS_public)
   10448              $C$DW$1874      .dwtag  DW_TAG_member
   10449                      .dwattr $C$DW$1874, DW_AT_type(*$C$DW$T$39)
   10450                      .dwattr $C$DW$1874, DW_AT_name("GPBCLEAR")
   10451                      .dwattr $C$DW$1874, DW_AT_TI_symbol_name("_GPBCLEAR")
   10452                      .dwattr $C$DW$1874, DW_AT_data_member_location[DW_OP_plus_uconst 0x4c]
   10453                      .dwattr $C$DW$1874, DW_AT_accessibility(DW_ACCESS_public)
   10454              $C$DW$1875      .dwtag  DW_TAG_member
   10455                      .dwattr $C$DW$1875, DW_AT_type(*$C$DW$T$39)
   10456                      .dwattr $C$DW$1875, DW_AT_name("GPBTOGGLE")
   10457                      .dwattr $C$DW$1875, DW_AT_TI_symbol_name("_GPBTOGGLE")
   10458                      .dwattr $C$DW$1875, DW_AT_data_member_location[DW_OP_plus_uconst 0x4e]
   10459                      .dwattr $C$DW$1875, DW_AT_accessibility(DW_ACCESS_public)
   10460              $C$DW$1876      .dwtag  DW_TAG_member
   10461                      .dwattr $C$DW$1876, DW_AT_type(*$C$DW$T$31)
   10462                      .dwattr $C$DW$1876, DW_AT_name("rsvd_7")
   10463                      .dwattr $C$DW$1876, DW_AT_TI_symbol_name("_rsvd_7")
   10464                      .dwattr $C$DW$1876, DW_AT_data_member_location[DW_OP_plus_uconst 0x50]
   10465                      .dwattr $C$DW$1876, DW_AT_accessibility(DW_ACCESS_public)
   10466              $C$DW$1877      .dwtag  DW_TAG_member
   10467                      .dwattr $C$DW$1877, DW_AT_type(*$C$DW$T$39)
   10468                      .dwattr $C$DW$1877, DW_AT_name("AIODAT")
   10469                      .dwattr $C$DW$1877, DW_AT_TI_symbol_name("_AIODAT")
   10470                      .dwattr $C$DW$1877, DW_AT_data_member_location[DW_OP_plus_uconst 0x58]
   10471                      .dwattr $C$DW$1877, DW_AT_accessibility(DW_ACCESS_public)
   10472              $C$DW$1878      .dwtag  DW_TAG_member
   10473                      .dwattr $C$DW$1878, DW_AT_type(*$C$DW$T$39)
   10474                      .dwattr $C$DW$1878, DW_AT_name("AIOSET")
   10475                      .dwattr $C$DW$1878, DW_AT_TI_symbol_name("_AIOSET")
   10476                      .dwattr $C$DW$1878, DW_AT_data_member_location[DW_OP_plus_uconst 0x5a]
   10477                      .dwattr $C$DW$1878, DW_AT_accessibility(DW_ACCESS_public)
   10478              $C$DW$1879      .dwtag  DW_TAG_member
   10479                      .dwattr $C$DW$1879, DW_AT_type(*$C$DW$T$39)
   10480                      .dwattr $C$DW$1879, DW_AT_name("AIOCLEAR")
   10481                      .dwattr $C$DW$1879, DW_AT_TI_symbol_name("_AIOCLEAR")
   10482                      .dwattr $C$DW$1879, DW_AT_data_member_location[DW_OP_plus_uconst 0x5c]
   10483                      .dwattr $C$DW$1879, DW_AT_accessibility(DW_ACCESS_public)
   10484              $C$DW$1880      .dwtag  DW_TAG_member
   10485                      .dwattr $C$DW$1880, DW_AT_type(*$C$DW$T$39)
   10486                      .dwattr $C$DW$1880, DW_AT_name("AIOTOGGLE")
   10487                      .dwattr $C$DW$1880, DW_AT_TI_symbol_name("_AIOTOGGLE")
   10488                      .dwattr $C$DW$1880, DW_AT_data_member_location[DW_OP_plus_uconst 0x5e]
   10489                      .dwattr $C$DW$1880, DW_AT_accessibility(DW_ACCESS_public)
   10490              $C$DW$1881      .dwtag  DW_TAG_member
   10491                      .dwattr $C$DW$1881, DW_AT_type(*$C$DW$T$28)
TMS320C2000 Assembler PC v6.2.5 Tue Sep 12 20:58:49 2017

Tools Copyright (c) 1996-2014 Texas Instruments Incorporated
C:\Users\wmj\AppData\Local\Temp\1256010                              PAGE  201

   10492                      .dwattr $C$DW$1881, DW_AT_name("GPIOXINTnSEL")
   10493                      .dwattr $C$DW$1881, DW_AT_TI_symbol_name("_GPIOXINTnSEL")
   10494                      .dwattr $C$DW$1881, DW_AT_data_member_location[DW_OP_plus_uconst 0x60]
   10495                      .dwattr $C$DW$1881, DW_AT_accessibility(DW_ACCESS_public)
   10496              $C$DW$1882      .dwtag  DW_TAG_member
   10497                      .dwattr $C$DW$1882, DW_AT_type(*$C$DW$T$27)
   10498                      .dwattr $C$DW$1882, DW_AT_name("rsvd_8")
   10499                      .dwattr $C$DW$1882, DW_AT_TI_symbol_name("_rsvd_8")
   10500                      .dwattr $C$DW$1882, DW_AT_data_member_location[DW_OP_plus_uconst 0x63]
   10501                      .dwattr $C$DW$1882, DW_AT_accessibility(DW_ACCESS_public)
   10502              $C$DW$1883      .dwtag  DW_TAG_member
   10503                      .dwattr $C$DW$1883, DW_AT_type(*$C$DW$T$39)
   10504                      .dwattr $C$DW$1883, DW_AT_name("GPIOLPMSEL")
   10505                      .dwattr $C$DW$1883, DW_AT_TI_symbol_name("_GPIOLPMSEL")
   10506                      .dwattr $C$DW$1883, DW_AT_data_member_location[DW_OP_plus_uconst 0x68]
   10507                      .dwattr $C$DW$1883, DW_AT_accessibility(DW_ACCESS_public)
   10508                      .dwendtag $C$DW$T$42
   10509              
   10510              $C$DW$T$58      .dwtag  DW_TAG_pointer_type
   10511                      .dwattr $C$DW$T$58, DW_AT_type(*$C$DW$T$42)
   10512                      .dwattr $C$DW$T$58, DW_AT_address_class(0x16)
   10513              $C$DW$T$59      .dwtag  DW_TAG_typedef, DW_AT_name("GPIO_Handle")
   10514                      .dwattr $C$DW$T$59, DW_AT_type(*$C$DW$T$58)
   10515                      .dwattr $C$DW$T$59, DW_AT_language(DW_LANG_C)
   10516              
   10517              $C$DW$T$44      .dwtag  DW_TAG_structure_type
   10518                      .dwattr $C$DW$T$44, DW_AT_name("_HAL_AdcData_t_")
   10519                      .dwattr $C$DW$T$44, DW_AT_byte_size(0x16)
   10520              $C$DW$1884      .dwtag  DW_TAG_member
   10521                      .dwattr $C$DW$1884, DW_AT_type(*$C$DW$T$43)
   10522                      .dwattr $C$DW$1884, DW_AT_name("I")
   10523                      .dwattr $C$DW$1884, DW_AT_TI_symbol_name("_I")
   10524                      .dwattr $C$DW$1884, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
   10525                      .dwattr $C$DW$1884, DW_AT_accessibility(DW_ACCESS_public)
   10526              $C$DW$1885      .dwtag  DW_TAG_member
   10527                      .dwattr $C$DW$1885, DW_AT_type(*$C$DW$T$43)
   10528                      .dwattr $C$DW$1885, DW_AT_name("V")
   10529                      .dwattr $C$DW$1885, DW_AT_TI_symbol_name("_V")
   10530                      .dwattr $C$DW$1885, DW_AT_data_member_location[DW_OP_plus_uconst 0x6]
   10531                      .dwattr $C$DW$1885, DW_AT_accessibility(DW_ACCESS_public)
   10532              $C$DW$1886      .dwtag  DW_TAG_member
   10533                      .dwattr $C$DW$1886, DW_AT_type(*$C$DW$T$35)
   10534                      .dwattr $C$DW$1886, DW_AT_name("dcBus")
   10535                      .dwattr $C$DW$1886, DW_AT_TI_symbol_name("_dcBus")
   10536                      .dwattr $C$DW$1886, DW_AT_data_member_location[DW_OP_plus_uconst 0xc]
   10537                      .dwattr $C$DW$1886, DW_AT_accessibility(DW_ACCESS_public)
   10538              $C$DW$1887      .dwtag  DW_TAG_member
   10539                      .dwattr $C$DW$1887, DW_AT_type(*$C$DW$T$35)
   10540                      .dwattr $C$DW$1887, DW_AT_name("analogSensor1")
   10541                      .dwattr $C$DW$1887, DW_AT_TI_symbol_name("_analogSensor1")
   10542                      .dwattr $C$DW$1887, DW_AT_data_member_location[DW_OP_plus_uconst 0xe]
   10543                      .dwattr $C$DW$1887, DW_AT_accessibility(DW_ACCESS_public)
   10544              $C$DW$1888      .dwtag  DW_TAG_member
   10545                      .dwattr $C$DW$1888, DW_AT_type(*$C$DW$T$35)
   10546                      .dwattr $C$DW$1888, DW_AT_name("analogSensor2")
TMS320C2000 Assembler PC v6.2.5 Tue Sep 12 20:58:49 2017

Tools Copyright (c) 1996-2014 Texas Instruments Incorporated
C:\Users\wmj\AppData\Local\Temp\1256010                              PAGE  202

   10547                      .dwattr $C$DW$1888, DW_AT_TI_symbol_name("_analogSensor2")
   10548                      .dwattr $C$DW$1888, DW_AT_data_member_location[DW_OP_plus_uconst 0x10]
   10549                      .dwattr $C$DW$1888, DW_AT_accessibility(DW_ACCESS_public)
   10550              $C$DW$1889      .dwtag  DW_TAG_member
   10551                      .dwattr $C$DW$1889, DW_AT_type(*$C$DW$T$35)
   10552                      .dwattr $C$DW$1889, DW_AT_name("igbtNTC")
   10553                      .dwattr $C$DW$1889, DW_AT_TI_symbol_name("_igbtNTC")
   10554                      .dwattr $C$DW$1889, DW_AT_data_member_location[DW_OP_plus_uconst 0x12]
   10555                      .dwattr $C$DW$1889, DW_AT_accessibility(DW_ACCESS_public)
   10556              $C$DW$1890      .dwtag  DW_TAG_member
   10557                      .dwattr $C$DW$1890, DW_AT_type(*$C$DW$T$35)
   10558                      .dwattr $C$DW$1890, DW_AT_name("boardAddr")
   10559                      .dwattr $C$DW$1890, DW_AT_TI_symbol_name("_boardAddr")
   10560                      .dwattr $C$DW$1890, DW_AT_data_member_location[DW_OP_plus_uconst 0x14]
   10561                      .dwattr $C$DW$1890, DW_AT_accessibility(DW_ACCESS_public)
   10562                      .dwendtag $C$DW$T$44
   10563              
   10564              $C$DW$T$87      .dwtag  DW_TAG_typedef, DW_AT_name("HAL_AdcData_t")
   10565                      .dwattr $C$DW$T$87, DW_AT_type(*$C$DW$T$44)
   10566                      .dwattr $C$DW$T$87, DW_AT_language(DW_LANG_C)
   10567              
   10568              $C$DW$T$49      .dwtag  DW_TAG_structure_type
   10569                      .dwattr $C$DW$T$49, DW_AT_name("_HAL_DacData_t_")
   10570                      .dwattr $C$DW$T$49, DW_AT_byte_size(0x22)
   10571              $C$DW$1891      .dwtag  DW_TAG_member
   10572                      .dwattr $C$DW$1891, DW_AT_type(*$C$DW$T$22)
   10573                      .dwattr $C$DW$1891, DW_AT_name("PeriodMax")
   10574                      .dwattr $C$DW$1891, DW_AT_TI_symbol_name("_PeriodMax")
   10575                      .dwattr $C$DW$1891, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
   10576                      .dwattr $C$DW$1891, DW_AT_accessibility(DW_ACCESS_public)
   10577              $C$DW$1892      .dwtag  DW_TAG_member
   10578                      .dwattr $C$DW$1892, DW_AT_type(*$C$DW$T$47)
   10579                      .dwattr $C$DW$1892, DW_AT_name("ptrData")
   10580                      .dwattr $C$DW$1892, DW_AT_TI_symbol_name("_ptrData")
   10581                      .dwattr $C$DW$1892, DW_AT_data_member_location[DW_OP_plus_uconst 0x2]
   10582                      .dwattr $C$DW$1892, DW_AT_accessibility(DW_ACCESS_public)
   10583              $C$DW$1893      .dwtag  DW_TAG_member
   10584                      .dwattr $C$DW$1893, DW_AT_type(*$C$DW$T$48)
   10585                      .dwattr $C$DW$1893, DW_AT_name("value")
   10586                      .dwattr $C$DW$1893, DW_AT_TI_symbol_name("_value")
   10587                      .dwattr $C$DW$1893, DW_AT_data_member_location[DW_OP_plus_uconst 0xa]
   10588                      .dwattr $C$DW$1893, DW_AT_accessibility(DW_ACCESS_public)
   10589              $C$DW$1894      .dwtag  DW_TAG_member
   10590                      .dwattr $C$DW$1894, DW_AT_type(*$C$DW$T$48)
   10591                      .dwattr $C$DW$1894, DW_AT_name("offset")
   10592                      .dwattr $C$DW$1894, DW_AT_TI_symbol_name("_offset")
   10593                      .dwattr $C$DW$1894, DW_AT_data_member_location[DW_OP_plus_uconst 0x12]
   10594                      .dwattr $C$DW$1894, DW_AT_accessibility(DW_ACCESS_public)
   10595              $C$DW$1895      .dwtag  DW_TAG_member
   10596                      .dwattr $C$DW$1895, DW_AT_type(*$C$DW$T$48)
   10597                      .dwattr $C$DW$1895, DW_AT_name("gain")
   10598                      .dwattr $C$DW$1895, DW_AT_TI_symbol_name("_gain")
   10599                      .dwattr $C$DW$1895, DW_AT_data_member_location[DW_OP_plus_uconst 0x1a]
   10600                      .dwattr $C$DW$1895, DW_AT_accessibility(DW_ACCESS_public)
   10601                      .dwendtag $C$DW$T$49
TMS320C2000 Assembler PC v6.2.5 Tue Sep 12 20:58:49 2017

Tools Copyright (c) 1996-2014 Texas Instruments Incorporated
C:\Users\wmj\AppData\Local\Temp\1256010                              PAGE  203

   10602              
   10603              $C$DW$T$348     .dwtag  DW_TAG_typedef, DW_AT_name("HAL_DacData_t")
   10604                      .dwattr $C$DW$T$348, DW_AT_type(*$C$DW$T$49)
   10605                      .dwattr $C$DW$T$348, DW_AT_language(DW_LANG_C)
   10606              $C$DW$T$349     .dwtag  DW_TAG_pointer_type
   10607                      .dwattr $C$DW$T$349, DW_AT_type(*$C$DW$T$348)
   10608                      .dwattr $C$DW$T$349, DW_AT_address_class(0x16)
   10609              $C$DW$1896      .dwtag  DW_TAG_TI_far_type
   10610                      .dwattr $C$DW$1896, DW_AT_type(*$C$DW$T$349)
   10611              $C$DW$T$350     .dwtag  DW_TAG_const_type
   10612                      .dwattr $C$DW$T$350, DW_AT_type(*$C$DW$1896)
   10613              
   10614              $C$DW$T$88      .dwtag  DW_TAG_structure_type
   10615                      .dwattr $C$DW$T$88, DW_AT_name("_HAL_Obj_")
   10616                      .dwattr $C$DW$T$88, DW_AT_byte_size(0xb4)
   10617              $C$DW$1897      .dwtag  DW_TAG_member
   10618                      .dwattr $C$DW$1897, DW_AT_type(*$C$DW$T$51)
   10619                      .dwattr $C$DW$1897, DW_AT_name("adcHandle")
   10620                      .dwattr $C$DW$1897, DW_AT_TI_symbol_name("_adcHandle")
   10621                      .dwattr $C$DW$1897, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
   10622                      .dwattr $C$DW$1897, DW_AT_accessibility(DW_ACCESS_public)
   10623              $C$DW$1898      .dwtag  DW_TAG_member
   10624                      .dwattr $C$DW$1898, DW_AT_type(*$C$DW$T$53)
   10625                      .dwattr $C$DW$1898, DW_AT_name("clkHandle")
   10626                      .dwattr $C$DW$1898, DW_AT_TI_symbol_name("_clkHandle")
   10627                      .dwattr $C$DW$1898, DW_AT_data_member_location[DW_OP_plus_uconst 0x2]
   10628                      .dwattr $C$DW$1898, DW_AT_accessibility(DW_ACCESS_public)
   10629              $C$DW$1899      .dwtag  DW_TAG_member
   10630                      .dwattr $C$DW$1899, DW_AT_type(*$C$DW$T$55)
   10631                      .dwattr $C$DW$1899, DW_AT_name("cpuHandle")
   10632                      .dwattr $C$DW$1899, DW_AT_TI_symbol_name("_cpuHandle")
   10633                      .dwattr $C$DW$1899, DW_AT_data_member_location[DW_OP_plus_uconst 0x4]
   10634                      .dwattr $C$DW$1899, DW_AT_accessibility(DW_ACCESS_public)
   10635              $C$DW$1900      .dwtag  DW_TAG_member
   10636                      .dwattr $C$DW$1900, DW_AT_type(*$C$DW$T$57)
   10637                      .dwattr $C$DW$1900, DW_AT_name("flashHandle")
   10638                      .dwattr $C$DW$1900, DW_AT_TI_symbol_name("_flashHandle")
   10639                      .dwattr $C$DW$1900, DW_AT_data_member_location[DW_OP_plus_uconst 0x6]
   10640                      .dwattr $C$DW$1900, DW_AT_accessibility(DW_ACCESS_public)
   10641              $C$DW$1901      .dwtag  DW_TAG_member
   10642                      .dwattr $C$DW$1901, DW_AT_type(*$C$DW$T$59)
   10643                      .dwattr $C$DW$1901, DW_AT_name("gpioHandle")
   10644                      .dwattr $C$DW$1901, DW_AT_TI_symbol_name("_gpioHandle")
   10645                      .dwattr $C$DW$1901, DW_AT_data_member_location[DW_OP_plus_uconst 0x8]
   10646                      .dwattr $C$DW$1901, DW_AT_accessibility(DW_ACCESS_public)
   10647              $C$DW$1902      .dwtag  DW_TAG_member
   10648                      .dwattr $C$DW$1902, DW_AT_type(*$C$DW$T$62)
   10649                      .dwattr $C$DW$1902, DW_AT_name("offsetHandle_I")
   10650                      .dwattr $C$DW$1902, DW_AT_TI_symbol_name("_offsetHandle_I")
   10651                      .dwattr $C$DW$1902, DW_AT_data_member_location[DW_OP_plus_uconst 0xa]
   10652                      .dwattr $C$DW$1902, DW_AT_accessibility(DW_ACCESS_public)
   10653              $C$DW$1903      .dwtag  DW_TAG_member
   10654                      .dwattr $C$DW$1903, DW_AT_type(*$C$DW$T$64)
   10655                      .dwattr $C$DW$1903, DW_AT_name("offset_I")
   10656                      .dwattr $C$DW$1903, DW_AT_TI_symbol_name("_offset_I")
TMS320C2000 Assembler PC v6.2.5 Tue Sep 12 20:58:49 2017

Tools Copyright (c) 1996-2014 Texas Instruments Incorporated
C:\Users\wmj\AppData\Local\Temp\1256010                              PAGE  204

   10657                      .dwattr $C$DW$1903, DW_AT_data_member_location[DW_OP_plus_uconst 0x10]
   10658                      .dwattr $C$DW$1903, DW_AT_accessibility(DW_ACCESS_public)
   10659              $C$DW$1904      .dwtag  DW_TAG_member
   10660                      .dwattr $C$DW$1904, DW_AT_type(*$C$DW$T$62)
   10661                      .dwattr $C$DW$1904, DW_AT_name("offsetHandle_V")
   10662                      .dwattr $C$DW$1904, DW_AT_TI_symbol_name("_offsetHandle_V")
   10663                      .dwattr $C$DW$1904, DW_AT_data_member_location[DW_OP_plus_uconst 0x40]
   10664                      .dwattr $C$DW$1904, DW_AT_accessibility(DW_ACCESS_public)
   10665              $C$DW$1905      .dwtag  DW_TAG_member
   10666                      .dwattr $C$DW$1905, DW_AT_type(*$C$DW$T$64)
   10667                      .dwattr $C$DW$1905, DW_AT_name("offset_V")
   10668                      .dwattr $C$DW$1905, DW_AT_TI_symbol_name("_offset_V")
   10669                      .dwattr $C$DW$1905, DW_AT_data_member_location[DW_OP_plus_uconst 0x46]
   10670                      .dwattr $C$DW$1905, DW_AT_accessibility(DW_ACCESS_public)
   10671              $C$DW$1906      .dwtag  DW_TAG_member
   10672                      .dwattr $C$DW$1906, DW_AT_type(*$C$DW$T$66)
   10673                      .dwattr $C$DW$1906, DW_AT_name("oscHandle")
   10674                      .dwattr $C$DW$1906, DW_AT_TI_symbol_name("_oscHandle")
   10675                      .dwattr $C$DW$1906, DW_AT_data_member_location[DW_OP_plus_uconst 0x76]
   10676                      .dwattr $C$DW$1906, DW_AT_accessibility(DW_ACCESS_public)
   10677              $C$DW$1907      .dwtag  DW_TAG_member
   10678                      .dwattr $C$DW$1907, DW_AT_type(*$C$DW$T$68)
   10679                      .dwattr $C$DW$1907, DW_AT_name("pieHandle")
   10680                      .dwattr $C$DW$1907, DW_AT_TI_symbol_name("_pieHandle")
   10681                      .dwattr $C$DW$1907, DW_AT_data_member_location[DW_OP_plus_uconst 0x78]
   10682                      .dwattr $C$DW$1907, DW_AT_accessibility(DW_ACCESS_public)
   10683              $C$DW$1908      .dwtag  DW_TAG_member
   10684                      .dwattr $C$DW$1908, DW_AT_type(*$C$DW$T$70)
   10685                      .dwattr $C$DW$1908, DW_AT_name("pllHandle")
   10686                      .dwattr $C$DW$1908, DW_AT_TI_symbol_name("_pllHandle")
   10687                      .dwattr $C$DW$1908, DW_AT_data_member_location[DW_OP_plus_uconst 0x7a]
   10688                      .dwattr $C$DW$1908, DW_AT_accessibility(DW_ACCESS_public)
   10689              $C$DW$1909      .dwtag  DW_TAG_member
   10690                      .dwattr $C$DW$1909, DW_AT_type(*$C$DW$T$73)
   10691                      .dwattr $C$DW$1909, DW_AT_name("pwmHandle")
   10692                      .dwattr $C$DW$1909, DW_AT_TI_symbol_name("_pwmHandle")
   10693                      .dwattr $C$DW$1909, DW_AT_data_member_location[DW_OP_plus_uconst 0x7c]
   10694                      .dwattr $C$DW$1909, DW_AT_accessibility(DW_ACCESS_public)
   10695              $C$DW$1910      .dwtag  DW_TAG_member
   10696                      .dwattr $C$DW$1910, DW_AT_type(*$C$DW$T$73)
   10697                      .dwattr $C$DW$1910, DW_AT_name("pwmDacHandle")
   10698                      .dwattr $C$DW$1910, DW_AT_TI_symbol_name("_pwmDacHandle")
   10699                      .dwattr $C$DW$1910, DW_AT_data_member_location[DW_OP_plus_uconst 0x82]
   10700                      .dwattr $C$DW$1910, DW_AT_accessibility(DW_ACCESS_public)
   10701              $C$DW$1911      .dwtag  DW_TAG_member
   10702                      .dwattr $C$DW$1911, DW_AT_type(*$C$DW$T$75)
   10703                      .dwattr $C$DW$1911, DW_AT_name("pwrHandle")
   10704                      .dwattr $C$DW$1911, DW_AT_TI_symbol_name("_pwrHandle")
   10705                      .dwattr $C$DW$1911, DW_AT_data_member_location[DW_OP_plus_uconst 0x88]
   10706                      .dwattr $C$DW$1911, DW_AT_accessibility(DW_ACCESS_public)
   10707              $C$DW$1912      .dwtag  DW_TAG_member
   10708                      .dwattr $C$DW$1912, DW_AT_type(*$C$DW$T$78)
   10709                      .dwattr $C$DW$1912, DW_AT_name("timerHandle")
   10710                      .dwattr $C$DW$1912, DW_AT_TI_symbol_name("_timerHandle")
   10711                      .dwattr $C$DW$1912, DW_AT_data_member_location[DW_OP_plus_uconst 0x8a]
TMS320C2000 Assembler PC v6.2.5 Tue Sep 12 20:58:49 2017

Tools Copyright (c) 1996-2014 Texas Instruments Incorporated
C:\Users\wmj\AppData\Local\Temp\1256010                              PAGE  205

   10712                      .dwattr $C$DW$1912, DW_AT_accessibility(DW_ACCESS_public)
   10713              $C$DW$1913      .dwtag  DW_TAG_member
   10714                      .dwattr $C$DW$1913, DW_AT_type(*$C$DW$T$80)
   10715                      .dwattr $C$DW$1913, DW_AT_name("i2cHandle")
   10716                      .dwattr $C$DW$1913, DW_AT_TI_symbol_name("_i2cHandle")
   10717                      .dwattr $C$DW$1913, DW_AT_data_member_location[DW_OP_plus_uconst 0x90]
   10718                      .dwattr $C$DW$1913, DW_AT_accessibility(DW_ACCESS_public)
   10719              $C$DW$1914      .dwtag  DW_TAG_member
   10720                      .dwattr $C$DW$1914, DW_AT_type(*$C$DW$T$82)
   10721                      .dwattr $C$DW$1914, DW_AT_name("spiAHandle")
   10722                      .dwattr $C$DW$1914, DW_AT_TI_symbol_name("_spiAHandle")
   10723                      .dwattr $C$DW$1914, DW_AT_data_member_location[DW_OP_plus_uconst 0x92]
   10724                      .dwattr $C$DW$1914, DW_AT_accessibility(DW_ACCESS_public)
   10725              $C$DW$1915      .dwtag  DW_TAG_member
   10726                      .dwattr $C$DW$1915, DW_AT_type(*$C$DW$T$84)
   10727                      .dwattr $C$DW$1915, DW_AT_name("wdogHandle")
   10728                      .dwattr $C$DW$1915, DW_AT_TI_symbol_name("_wdogHandle")
   10729                      .dwattr $C$DW$1915, DW_AT_data_member_location[DW_OP_plus_uconst 0x94]
   10730                      .dwattr $C$DW$1915, DW_AT_accessibility(DW_ACCESS_public)
   10731              $C$DW$1916      .dwtag  DW_TAG_member
   10732                      .dwattr $C$DW$1916, DW_AT_type(*$C$DW$T$86)
   10733                      .dwattr $C$DW$1916, DW_AT_name("sciHandle")
   10734                      .dwattr $C$DW$1916, DW_AT_TI_symbol_name("_sciHandle")
   10735                      .dwattr $C$DW$1916, DW_AT_data_member_location[DW_OP_plus_uconst 0x96]
   10736                      .dwattr $C$DW$1916, DW_AT_accessibility(DW_ACCESS_public)
   10737              $C$DW$1917      .dwtag  DW_TAG_member
   10738                      .dwattr $C$DW$1917, DW_AT_type(*$C$DW$T$87)
   10739                      .dwattr $C$DW$1917, DW_AT_name("adcBias")
   10740                      .dwattr $C$DW$1917, DW_AT_TI_symbol_name("_adcBias")
   10741                      .dwattr $C$DW$1917, DW_AT_data_member_location[DW_OP_plus_uconst 0x98]
   10742                      .dwattr $C$DW$1917, DW_AT_accessibility(DW_ACCESS_public)
   10743              $C$DW$1918      .dwtag  DW_TAG_member
   10744                      .dwattr $C$DW$1918, DW_AT_type(*$C$DW$T$35)
   10745                      .dwattr $C$DW$1918, DW_AT_name("current_sf")
   10746                      .dwattr $C$DW$1918, DW_AT_TI_symbol_name("_current_sf")
   10747                      .dwattr $C$DW$1918, DW_AT_data_member_location[DW_OP_plus_uconst 0xae]
   10748                      .dwattr $C$DW$1918, DW_AT_accessibility(DW_ACCESS_public)
   10749              $C$DW$1919      .dwtag  DW_TAG_member
   10750                      .dwattr $C$DW$1919, DW_AT_type(*$C$DW$T$35)
   10751                      .dwattr $C$DW$1919, DW_AT_name("voltage_sf")
   10752                      .dwattr $C$DW$1919, DW_AT_TI_symbol_name("_voltage_sf")
   10753                      .dwattr $C$DW$1919, DW_AT_data_member_location[DW_OP_plus_uconst 0xb0]
   10754                      .dwattr $C$DW$1919, DW_AT_accessibility(DW_ACCESS_public)
   10755              $C$DW$1920      .dwtag  DW_TAG_member
   10756                      .dwattr $C$DW$1920, DW_AT_type(*$C$DW$T$33)
   10757                      .dwattr $C$DW$1920, DW_AT_name("numCurrentSensors")
   10758                      .dwattr $C$DW$1920, DW_AT_TI_symbol_name("_numCurrentSensors")
   10759                      .dwattr $C$DW$1920, DW_AT_data_member_location[DW_OP_plus_uconst 0xb2]
   10760                      .dwattr $C$DW$1920, DW_AT_accessibility(DW_ACCESS_public)
   10761              $C$DW$1921      .dwtag  DW_TAG_member
   10762                      .dwattr $C$DW$1921, DW_AT_type(*$C$DW$T$33)
   10763                      .dwattr $C$DW$1921, DW_AT_name("numVoltageSensors")
   10764                      .dwattr $C$DW$1921, DW_AT_TI_symbol_name("_numVoltageSensors")
   10765                      .dwattr $C$DW$1921, DW_AT_data_member_location[DW_OP_plus_uconst 0xb3]
   10766                      .dwattr $C$DW$1921, DW_AT_accessibility(DW_ACCESS_public)
TMS320C2000 Assembler PC v6.2.5 Tue Sep 12 20:58:49 2017

Tools Copyright (c) 1996-2014 Texas Instruments Incorporated
C:\Users\wmj\AppData\Local\Temp\1256010                              PAGE  206

   10767                      .dwendtag $C$DW$T$88
   10768              
   10769              $C$DW$T$353     .dwtag  DW_TAG_typedef, DW_AT_name("HAL_Obj")
   10770                      .dwattr $C$DW$T$353, DW_AT_type(*$C$DW$T$88)
   10771                      .dwattr $C$DW$T$353, DW_AT_language(DW_LANG_C)
   10772              $C$DW$T$354     .dwtag  DW_TAG_pointer_type
   10773                      .dwattr $C$DW$T$354, DW_AT_type(*$C$DW$T$353)
   10774                      .dwattr $C$DW$T$354, DW_AT_address_class(0x16)
   10775              $C$DW$T$355     .dwtag  DW_TAG_pointer_type
   10776                      .dwattr $C$DW$T$355, DW_AT_type(*$C$DW$T$88)
   10777                      .dwattr $C$DW$T$355, DW_AT_address_class(0x16)
   10778              $C$DW$T$356     .dwtag  DW_TAG_typedef, DW_AT_name("HAL_Handle")
   10779                      .dwattr $C$DW$T$356, DW_AT_type(*$C$DW$T$355)
   10780                      .dwattr $C$DW$T$356, DW_AT_language(DW_LANG_C)
   10781              $C$DW$1922      .dwtag  DW_TAG_TI_far_type
   10782                      .dwattr $C$DW$1922, DW_AT_type(*$C$DW$T$356)
   10783              $C$DW$T$357     .dwtag  DW_TAG_const_type
   10784                      .dwattr $C$DW$T$357, DW_AT_type(*$C$DW$1922)
   10785              
   10786              $C$DW$T$90      .dwtag  DW_TAG_structure_type
   10787                      .dwattr $C$DW$T$90, DW_AT_name("_MATH_vec3_")
   10788                      .dwattr $C$DW$T$90, DW_AT_byte_size(0x06)
   10789              $C$DW$1923      .dwtag  DW_TAG_member
   10790                      .dwattr $C$DW$1923, DW_AT_type(*$C$DW$T$89)
   10791                      .dwattr $C$DW$1923, DW_AT_name("value")
   10792                      .dwattr $C$DW$1923, DW_AT_TI_symbol_name("_value")
   10793                      .dwattr $C$DW$1923, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
   10794                      .dwattr $C$DW$1923, DW_AT_accessibility(DW_ACCESS_public)
   10795                      .dwendtag $C$DW$T$90
   10796              
   10797              $C$DW$T$43      .dwtag  DW_TAG_typedef, DW_AT_name("MATH_vec3")
   10798                      .dwattr $C$DW$T$43, DW_AT_type(*$C$DW$T$90)
   10799                      .dwattr $C$DW$T$43, DW_AT_language(DW_LANG_C)
   10800              
   10801              $C$DW$T$94      .dwtag  DW_TAG_structure_type
   10802                      .dwattr $C$DW$T$94, DW_AT_name("_OFFSET_")
   10803                      .dwattr $C$DW$T$94, DW_AT_byte_size(0x10)
   10804              $C$DW$1924      .dwtag  DW_TAG_member
   10805                      .dwattr $C$DW$1924, DW_AT_type(*$C$DW$T$35)
   10806                      .dwattr $C$DW$1924, DW_AT_name("value")
   10807                      .dwattr $C$DW$1924, DW_AT_TI_symbol_name("_value")
   10808                      .dwattr $C$DW$1924, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
   10809                      .dwattr $C$DW$1924, DW_AT_accessibility(DW_ACCESS_public)
   10810              $C$DW$1925      .dwtag  DW_TAG_member
   10811                      .dwattr $C$DW$1925, DW_AT_type(*$C$DW$T$35)
   10812                      .dwattr $C$DW$1925, DW_AT_name("bias")
   10813                      .dwattr $C$DW$1925, DW_AT_TI_symbol_name("_bias")
   10814                      .dwattr $C$DW$1925, DW_AT_data_member_location[DW_OP_plus_uconst 0x2]
   10815                      .dwattr $C$DW$1925, DW_AT_accessibility(DW_ACCESS_public)
   10816              $C$DW$1926      .dwtag  DW_TAG_member
   10817                      .dwattr $C$DW$1926, DW_AT_type(*$C$DW$T$91)
   10818                      .dwattr $C$DW$1926, DW_AT_name("filter")
   10819                      .dwattr $C$DW$1926, DW_AT_TI_symbol_name("_filter")
   10820                      .dwattr $C$DW$1926, DW_AT_data_member_location[DW_OP_plus_uconst 0x4]
   10821                      .dwattr $C$DW$1926, DW_AT_accessibility(DW_ACCESS_public)
TMS320C2000 Assembler PC v6.2.5 Tue Sep 12 20:58:49 2017

Tools Copyright (c) 1996-2014 Texas Instruments Incorporated
C:\Users\wmj\AppData\Local\Temp\1256010                              PAGE  207

   10822              $C$DW$1927      .dwtag  DW_TAG_member
   10823                      .dwattr $C$DW$1927, DW_AT_type(*$C$DW$T$93)
   10824                      .dwattr $C$DW$1927, DW_AT_name("filterHandle")
   10825                      .dwattr $C$DW$1927, DW_AT_TI_symbol_name("_filterHandle")
   10826                      .dwattr $C$DW$1927, DW_AT_data_member_location[DW_OP_plus_uconst 0xe]
   10827                      .dwattr $C$DW$1927, DW_AT_accessibility(DW_ACCESS_public)
   10828                      .dwendtag $C$DW$T$94
   10829              
   10830              $C$DW$T$63      .dwtag  DW_TAG_typedef, DW_AT_name("OFFSET_Obj")
   10831                      .dwattr $C$DW$T$63, DW_AT_type(*$C$DW$T$94)
   10832                      .dwattr $C$DW$T$63, DW_AT_language(DW_LANG_C)
   10833              
   10834              $C$DW$T$64      .dwtag  DW_TAG_array_type
   10835                      .dwattr $C$DW$T$64, DW_AT_type(*$C$DW$T$63)
   10836                      .dwattr $C$DW$T$64, DW_AT_language(DW_LANG_C)
   10837                      .dwattr $C$DW$T$64, DW_AT_byte_size(0x30)
   10838              $C$DW$1928      .dwtag  DW_TAG_subrange_type
   10839                      .dwattr $C$DW$1928, DW_AT_upper_bound(0x02)
   10840                      .dwendtag $C$DW$T$64
   10841              
   10842              
   10843              $C$DW$T$21      .dwtag  DW_TAG_structure_type
   10844                      .dwattr $C$DW$T$21, DW_AT_name("_OFFSET_Obj_")
   10845                      .dwattr $C$DW$T$21, DW_AT_declaration
   10846                      .dwendtag $C$DW$T$21
   10847              
   10848              $C$DW$T$60      .dwtag  DW_TAG_pointer_type
   10849                      .dwattr $C$DW$T$60, DW_AT_type(*$C$DW$T$21)
   10850                      .dwattr $C$DW$T$60, DW_AT_address_class(0x16)
   10851              $C$DW$T$61      .dwtag  DW_TAG_typedef, DW_AT_name("OFFSET_Handle")
   10852                      .dwattr $C$DW$T$61, DW_AT_type(*$C$DW$T$60)
   10853                      .dwattr $C$DW$T$61, DW_AT_language(DW_LANG_C)
   10854              
   10855              $C$DW$T$62      .dwtag  DW_TAG_array_type
   10856                      .dwattr $C$DW$T$62, DW_AT_type(*$C$DW$T$61)
   10857                      .dwattr $C$DW$T$62, DW_AT_language(DW_LANG_C)
   10858                      .dwattr $C$DW$T$62, DW_AT_byte_size(0x06)
   10859              $C$DW$1929      .dwtag  DW_TAG_subrange_type
   10860                      .dwattr $C$DW$1929, DW_AT_upper_bound(0x02)
   10861                      .dwendtag $C$DW$T$62
   10862              
   10863              
   10864              $C$DW$T$95      .dwtag  DW_TAG_structure_type
   10865                      .dwattr $C$DW$T$95, DW_AT_name("_OSC_Obj_")
   10866                      .dwattr $C$DW$T$95, DW_AT_byte_size(0x03)
   10867              $C$DW$1930      .dwtag  DW_TAG_member
   10868                      .dwattr $C$DW$1930, DW_AT_type(*$C$DW$T$23)
   10869                      .dwattr $C$DW$1930, DW_AT_name("INTOSC1TRIM")
   10870                      .dwattr $C$DW$1930, DW_AT_TI_symbol_name("_INTOSC1TRIM")
   10871                      .dwattr $C$DW$1930, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
   10872                      .dwattr $C$DW$1930, DW_AT_accessibility(DW_ACCESS_public)
   10873              $C$DW$1931      .dwtag  DW_TAG_member
   10874                      .dwattr $C$DW$1931, DW_AT_type(*$C$DW$T$23)
   10875                      .dwattr $C$DW$1931, DW_AT_name("rsvd_1")
   10876                      .dwattr $C$DW$1931, DW_AT_TI_symbol_name("_rsvd_1")
TMS320C2000 Assembler PC v6.2.5 Tue Sep 12 20:58:49 2017

Tools Copyright (c) 1996-2014 Texas Instruments Incorporated
C:\Users\wmj\AppData\Local\Temp\1256010                              PAGE  208

   10877                      .dwattr $C$DW$1931, DW_AT_data_member_location[DW_OP_plus_uconst 0x1]
   10878                      .dwattr $C$DW$1931, DW_AT_accessibility(DW_ACCESS_public)
   10879              $C$DW$1932      .dwtag  DW_TAG_member
   10880                      .dwattr $C$DW$1932, DW_AT_type(*$C$DW$T$23)
   10881                      .dwattr $C$DW$1932, DW_AT_name("INTOSC2TRIM")
   10882                      .dwattr $C$DW$1932, DW_AT_TI_symbol_name("_INTOSC2TRIM")
   10883                      .dwattr $C$DW$1932, DW_AT_data_member_location[DW_OP_plus_uconst 0x2]
   10884                      .dwattr $C$DW$1932, DW_AT_accessibility(DW_ACCESS_public)
   10885                      .dwendtag $C$DW$T$95
   10886              
   10887              $C$DW$T$65      .dwtag  DW_TAG_pointer_type
   10888                      .dwattr $C$DW$T$65, DW_AT_type(*$C$DW$T$95)
   10889                      .dwattr $C$DW$T$65, DW_AT_address_class(0x16)
   10890              $C$DW$T$66      .dwtag  DW_TAG_typedef, DW_AT_name("OSC_Handle")
   10891                      .dwattr $C$DW$T$66, DW_AT_type(*$C$DW$T$65)
   10892                      .dwattr $C$DW$T$66, DW_AT_language(DW_LANG_C)
   10893              
   10894              $C$DW$T$96      .dwtag  DW_TAG_structure_type
   10895                      .dwattr $C$DW$T$96, DW_AT_name("_PIE_IERIFR_t")
   10896                      .dwattr $C$DW$T$96, DW_AT_byte_size(0x02)
   10897              $C$DW$1933      .dwtag  DW_TAG_member
   10898                      .dwattr $C$DW$1933, DW_AT_type(*$C$DW$T$23)
   10899                      .dwattr $C$DW$1933, DW_AT_name("IER")
   10900                      .dwattr $C$DW$1933, DW_AT_TI_symbol_name("_IER")
   10901                      .dwattr $C$DW$1933, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
   10902                      .dwattr $C$DW$1933, DW_AT_accessibility(DW_ACCESS_public)
   10903              $C$DW$1934      .dwtag  DW_TAG_member
   10904                      .dwattr $C$DW$1934, DW_AT_type(*$C$DW$T$23)
   10905                      .dwattr $C$DW$1934, DW_AT_name("IFR")
   10906                      .dwattr $C$DW$1934, DW_AT_TI_symbol_name("_IFR")
   10907                      .dwattr $C$DW$1934, DW_AT_data_member_location[DW_OP_plus_uconst 0x1]
   10908                      .dwattr $C$DW$1934, DW_AT_accessibility(DW_ACCESS_public)
   10909                      .dwendtag $C$DW$T$96
   10910              
   10911              $C$DW$T$97      .dwtag  DW_TAG_typedef, DW_AT_name("PIE_IERIFR_t")
   10912                      .dwattr $C$DW$T$97, DW_AT_type(*$C$DW$T$96)
   10913                      .dwattr $C$DW$T$97, DW_AT_language(DW_LANG_C)
   10914              $C$DW$1935      .dwtag  DW_TAG_TI_far_type
   10915                      .dwattr $C$DW$1935, DW_AT_type(*$C$DW$T$97)
   10916              $C$DW$T$98      .dwtag  DW_TAG_volatile_type
   10917                      .dwattr $C$DW$T$98, DW_AT_type(*$C$DW$1935)
   10918              
   10919              $C$DW$T$99      .dwtag  DW_TAG_array_type
   10920                      .dwattr $C$DW$T$99, DW_AT_type(*$C$DW$T$98)
   10921                      .dwattr $C$DW$T$99, DW_AT_language(DW_LANG_C)
   10922                      .dwattr $C$DW$T$99, DW_AT_byte_size(0x18)
   10923              $C$DW$1936      .dwtag  DW_TAG_subrange_type
   10924                      .dwattr $C$DW$1936, DW_AT_upper_bound(0x0b)
   10925                      .dwendtag $C$DW$T$99
   10926              
   10927              
   10928              $C$DW$T$106     .dwtag  DW_TAG_structure_type
   10929                      .dwattr $C$DW$T$106, DW_AT_name("_PIE_Obj_")
   10930                      .dwattr $C$DW$T$106, DW_AT_byte_size(0x639c)
   10931              $C$DW$1937      .dwtag  DW_TAG_member
TMS320C2000 Assembler PC v6.2.5 Tue Sep 12 20:58:49 2017

Tools Copyright (c) 1996-2014 Texas Instruments Incorporated
C:\Users\wmj\AppData\Local\Temp\1256010                              PAGE  209

   10932                      .dwattr $C$DW$1937, DW_AT_type(*$C$DW$T$23)
   10933                      .dwattr $C$DW$1937, DW_AT_name("PIECTRL")
   10934                      .dwattr $C$DW$1937, DW_AT_TI_symbol_name("_PIECTRL")
   10935                      .dwattr $C$DW$1937, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
   10936                      .dwattr $C$DW$1937, DW_AT_accessibility(DW_ACCESS_public)
   10937              $C$DW$1938      .dwtag  DW_TAG_member
   10938                      .dwattr $C$DW$1938, DW_AT_type(*$C$DW$T$23)
   10939                      .dwattr $C$DW$1938, DW_AT_name("PIEACK")
   10940                      .dwattr $C$DW$1938, DW_AT_TI_symbol_name("_PIEACK")
   10941                      .dwattr $C$DW$1938, DW_AT_data_member_location[DW_OP_plus_uconst 0x1]
   10942                      .dwattr $C$DW$1938, DW_AT_accessibility(DW_ACCESS_public)
   10943              $C$DW$1939      .dwtag  DW_TAG_member
   10944                      .dwattr $C$DW$1939, DW_AT_type(*$C$DW$T$99)
   10945                      .dwattr $C$DW$1939, DW_AT_name("PIEIER_PIEIFR")
   10946                      .dwattr $C$DW$1939, DW_AT_TI_symbol_name("_PIEIER_PIEIFR")
   10947                      .dwattr $C$DW$1939, DW_AT_data_member_location[DW_OP_plus_uconst 0x2]
   10948                      .dwattr $C$DW$1939, DW_AT_accessibility(DW_ACCESS_public)
   10949              $C$DW$1940      .dwtag  DW_TAG_member
   10950                      .dwattr $C$DW$1940, DW_AT_type(*$C$DW$T$100)
   10951                      .dwattr $C$DW$1940, DW_AT_name("rsvd_1")
   10952                      .dwattr $C$DW$1940, DW_AT_TI_symbol_name("_rsvd_1")
   10953                      .dwattr $C$DW$1940, DW_AT_data_member_location[DW_OP_plus_uconst 0x1a]
   10954                      .dwattr $C$DW$1940, DW_AT_accessibility(DW_ACCESS_public)
   10955              $C$DW$1941      .dwtag  DW_TAG_member
   10956                      .dwattr $C$DW$1941, DW_AT_type(*$C$DW$T$104)
   10957                      .dwattr $C$DW$1941, DW_AT_name("Reset")
   10958                      .dwattr $C$DW$1941, DW_AT_TI_symbol_name("_Reset")
   10959                      .dwattr $C$DW$1941, DW_AT_data_member_location[DW_OP_plus_uconst 0x20]
   10960                      .dwattr $C$DW$1941, DW_AT_accessibility(DW_ACCESS_public)
   10961              $C$DW$1942      .dwtag  DW_TAG_member
   10962                      .dwattr $C$DW$1942, DW_AT_type(*$C$DW$T$104)
   10963                      .dwattr $C$DW$1942, DW_AT_name("INT1")
   10964                      .dwattr $C$DW$1942, DW_AT_TI_symbol_name("_INT1")
   10965                      .dwattr $C$DW$1942, DW_AT_data_member_location[DW_OP_plus_uconst 0x22]
   10966                      .dwattr $C$DW$1942, DW_AT_accessibility(DW_ACCESS_public)
   10967              $C$DW$1943      .dwtag  DW_TAG_member
   10968                      .dwattr $C$DW$1943, DW_AT_type(*$C$DW$T$104)
   10969                      .dwattr $C$DW$1943, DW_AT_name("INT2")
   10970                      .dwattr $C$DW$1943, DW_AT_TI_symbol_name("_INT2")
   10971                      .dwattr $C$DW$1943, DW_AT_data_member_location[DW_OP_plus_uconst 0x24]
   10972                      .dwattr $C$DW$1943, DW_AT_accessibility(DW_ACCESS_public)
   10973              $C$DW$1944      .dwtag  DW_TAG_member
   10974                      .dwattr $C$DW$1944, DW_AT_type(*$C$DW$T$104)
   10975                      .dwattr $C$DW$1944, DW_AT_name("INT3")
   10976                      .dwattr $C$DW$1944, DW_AT_TI_symbol_name("_INT3")
   10977                      .dwattr $C$DW$1944, DW_AT_data_member_location[DW_OP_plus_uconst 0x26]
   10978                      .dwattr $C$DW$1944, DW_AT_accessibility(DW_ACCESS_public)
   10979              $C$DW$1945      .dwtag  DW_TAG_member
   10980                      .dwattr $C$DW$1945, DW_AT_type(*$C$DW$T$104)
   10981                      .dwattr $C$DW$1945, DW_AT_name("INT4")
   10982                      .dwattr $C$DW$1945, DW_AT_TI_symbol_name("_INT4")
   10983                      .dwattr $C$DW$1945, DW_AT_data_member_location[DW_OP_plus_uconst 0x28]
   10984                      .dwattr $C$DW$1945, DW_AT_accessibility(DW_ACCESS_public)
   10985              $C$DW$1946      .dwtag  DW_TAG_member
   10986                      .dwattr $C$DW$1946, DW_AT_type(*$C$DW$T$104)
TMS320C2000 Assembler PC v6.2.5 Tue Sep 12 20:58:49 2017

Tools Copyright (c) 1996-2014 Texas Instruments Incorporated
C:\Users\wmj\AppData\Local\Temp\1256010                              PAGE  210

   10987                      .dwattr $C$DW$1946, DW_AT_name("INT5")
   10988                      .dwattr $C$DW$1946, DW_AT_TI_symbol_name("_INT5")
   10989                      .dwattr $C$DW$1946, DW_AT_data_member_location[DW_OP_plus_uconst 0x2a]
   10990                      .dwattr $C$DW$1946, DW_AT_accessibility(DW_ACCESS_public)
   10991              $C$DW$1947      .dwtag  DW_TAG_member
   10992                      .dwattr $C$DW$1947, DW_AT_type(*$C$DW$T$104)
   10993                      .dwattr $C$DW$1947, DW_AT_name("INT6")
   10994                      .dwattr $C$DW$1947, DW_AT_TI_symbol_name("_INT6")
   10995                      .dwattr $C$DW$1947, DW_AT_data_member_location[DW_OP_plus_uconst 0x2c]
   10996                      .dwattr $C$DW$1947, DW_AT_accessibility(DW_ACCESS_public)
   10997              $C$DW$1948      .dwtag  DW_TAG_member
   10998                      .dwattr $C$DW$1948, DW_AT_type(*$C$DW$T$104)
   10999                      .dwattr $C$DW$1948, DW_AT_name("INT7")
   11000                      .dwattr $C$DW$1948, DW_AT_TI_symbol_name("_INT7")
   11001                      .dwattr $C$DW$1948, DW_AT_data_member_location[DW_OP_plus_uconst 0x2e]
   11002                      .dwattr $C$DW$1948, DW_AT_accessibility(DW_ACCESS_public)
   11003              $C$DW$1949      .dwtag  DW_TAG_member
   11004                      .dwattr $C$DW$1949, DW_AT_type(*$C$DW$T$104)
   11005                      .dwattr $C$DW$1949, DW_AT_name("INT8")
   11006                      .dwattr $C$DW$1949, DW_AT_TI_symbol_name("_INT8")
   11007                      .dwattr $C$DW$1949, DW_AT_data_member_location[DW_OP_plus_uconst 0x30]
   11008                      .dwattr $C$DW$1949, DW_AT_accessibility(DW_ACCESS_public)
   11009              $C$DW$1950      .dwtag  DW_TAG_member
   11010                      .dwattr $C$DW$1950, DW_AT_type(*$C$DW$T$104)
   11011                      .dwattr $C$DW$1950, DW_AT_name("INT9")
   11012                      .dwattr $C$DW$1950, DW_AT_TI_symbol_name("_INT9")
   11013                      .dwattr $C$DW$1950, DW_AT_data_member_location[DW_OP_plus_uconst 0x32]
   11014                      .dwattr $C$DW$1950, DW_AT_accessibility(DW_ACCESS_public)
   11015              $C$DW$1951      .dwtag  DW_TAG_member
   11016                      .dwattr $C$DW$1951, DW_AT_type(*$C$DW$T$104)
   11017                      .dwattr $C$DW$1951, DW_AT_name("INT10")
   11018                      .dwattr $C$DW$1951, DW_AT_TI_symbol_name("_INT10")
   11019                      .dwattr $C$DW$1951, DW_AT_data_member_location[DW_OP_plus_uconst 0x34]
   11020                      .dwattr $C$DW$1951, DW_AT_accessibility(DW_ACCESS_public)
   11021              $C$DW$1952      .dwtag  DW_TAG_member
   11022                      .dwattr $C$DW$1952, DW_AT_type(*$C$DW$T$104)
   11023                      .dwattr $C$DW$1952, DW_AT_name("INT11")
   11024                      .dwattr $C$DW$1952, DW_AT_TI_symbol_name("_INT11")
   11025                      .dwattr $C$DW$1952, DW_AT_data_member_location[DW_OP_plus_uconst 0x36]
   11026                      .dwattr $C$DW$1952, DW_AT_accessibility(DW_ACCESS_public)
   11027              $C$DW$1953      .dwtag  DW_TAG_member
   11028                      .dwattr $C$DW$1953, DW_AT_type(*$C$DW$T$104)
   11029                      .dwattr $C$DW$1953, DW_AT_name("INT12")
   11030                      .dwattr $C$DW$1953, DW_AT_TI_symbol_name("_INT12")
   11031                      .dwattr $C$DW$1953, DW_AT_data_member_location[DW_OP_plus_uconst 0x38]
   11032                      .dwattr $C$DW$1953, DW_AT_accessibility(DW_ACCESS_public)
   11033              $C$DW$1954      .dwtag  DW_TAG_member
   11034                      .dwattr $C$DW$1954, DW_AT_type(*$C$DW$T$104)
   11035                      .dwattr $C$DW$1954, DW_AT_name("TINT1")
   11036                      .dwattr $C$DW$1954, DW_AT_TI_symbol_name("_TINT1")
   11037                      .dwattr $C$DW$1954, DW_AT_data_member_location[DW_OP_plus_uconst 0x3a]
   11038                      .dwattr $C$DW$1954, DW_AT_accessibility(DW_ACCESS_public)
   11039              $C$DW$1955      .dwtag  DW_TAG_member
   11040                      .dwattr $C$DW$1955, DW_AT_type(*$C$DW$T$104)
   11041                      .dwattr $C$DW$1955, DW_AT_name("TINT2")
TMS320C2000 Assembler PC v6.2.5 Tue Sep 12 20:58:49 2017

Tools Copyright (c) 1996-2014 Texas Instruments Incorporated
