TMS320C2000 Assembler PC v6.2.5 Wed Sep 27 19:09:55 2017

Tools Copyright (c) 1996-2014 Texas Instruments Incorporated
C:\Users\wmj\AppData\Local\Temp\0231210                              PAGE    1

       1              ;***************************************************************
       2              ;* TMS320C2000 C/C++ Codegen                         PC v6.2.5 *
       3              ;* Date/Time created: Wed Sep 27 19:09:54 2017                 *
       4              ;***************************************************************
       5                      .compiler_opts --float_support=softlib --hll_source=on --mem_model:code=flat --mem_model:data=large -
       6        0002  FP      .set    XAR2
       7              
       8              $C$DW$CU        .dwtag  DW_TAG_compile_unit
       9                      .dwattr $C$DW$CU, DW_AT_name("D:/BM1000/sw/modules/hal/boards/hvkit_rev1p1/f28x/f2802x/src/hal.c")
      10                      .dwattr $C$DW$CU, DW_AT_producer("TMS320C2000 C/C++ Codegen PC v6.2.5 Copyright (c) 1996-2014 Texas I
      11                      .dwattr $C$DW$CU, DW_AT_TI_version(0x01)
      12                      .dwattr $C$DW$CU, DW_AT_comp_dir("D:\BM1000\sw\solutions\instaspin_foc\boards\hvkit_rev1p1\f28x\f2802
      13              
      14              $C$DW$1 .dwtag  DW_TAG_subprogram, DW_AT_name("SPI_setClkPolarity")
      15                      .dwattr $C$DW$1, DW_AT_TI_symbol_name("_SPI_setClkPolarity")

   10125                      .dwattr $C$DW$T$314, DW_AT_type(*$C$DW$T$313)
   10126                      .dwattr $C$DW$T$314, DW_AT_language(DW_LANG_C)
   10127              $C$DW$1813      .dwtag  DW_TAG_TI_far_type
   10128                      .dwattr $C$DW$1813, DW_AT_type(*$C$DW$T$314)
   10129              $C$DW$T$315     .dwtag  DW_TAG_const_type
   10130                      .dwattr $C$DW$T$315, DW_AT_type(*$C$DW$1813)
   10131              
   10132              $C$DW$T$316     .dwtag  DW_TAG_enumeration_type
TMS320C2000 Assembler PC v6.2.5 Wed Sep 27 19:09:55 2017

Tools Copyright (c) 1996-2014 Texas Instruments Incorporated
C:\Users\wmj\AppData\Local\Temp\0231210                              PAGE  195

   10133                      .dwattr $C$DW$T$316, DW_AT_byte_size(0x01)
   10134              $C$DW$1814      .dwtag  DW_TAG_enumerator, DW_AT_name("SCI_Mode_IdleLine"), DW_AT_const_value(0x00)
   10135              $C$DW$1815      .dwtag  DW_TAG_enumerator, DW_AT_name("SCI_Mode_AddressBit"), DW_AT_const_value(0x08)
   10136                      .dwendtag $C$DW$T$316
   10137              
   10138              $C$DW$T$317     .dwtag  DW_TAG_typedef, DW_AT_name("SCI_Mode_e")
   10139                      .dwattr $C$DW$T$317, DW_AT_type(*$C$DW$T$316)
   10140                      .dwattr $C$DW$T$317, DW_AT_language(DW_LANG_C)
   10141              $C$DW$1816      .dwtag  DW_TAG_TI_far_type
   10142                      .dwattr $C$DW$1816, DW_AT_type(*$C$DW$T$317)
   10143              $C$DW$T$318     .dwtag  DW_TAG_const_type
   10144                      .dwattr $C$DW$T$318, DW_AT_type(*$C$DW$1816)
   10145              
   10146              $C$DW$T$319     .dwtag  DW_TAG_enumeration_type
   10147                      .dwattr $C$DW$T$319, DW_AT_byte_size(0x01)
   10148              $C$DW$1817      .dwtag  DW_TAG_enumerator, DW_AT_name("SCI_NumStopBits_One"), DW_AT_const_value(0x00)
   10149              $C$DW$1818      .dwtag  DW_TAG_enumerator, DW_AT_name("SCI_NumStopBits_Two"), DW_AT_const_value(0x80)
   10150                      .dwendtag $C$DW$T$319
   10151              
   10152              $C$DW$T$320     .dwtag  DW_TAG_typedef, DW_AT_name("SCI_NumStopBits_e")
   10153                      .dwattr $C$DW$T$320, DW_AT_type(*$C$DW$T$319)
   10154                      .dwattr $C$DW$T$320, DW_AT_language(DW_LANG_C)
   10155              $C$DW$1819      .dwtag  DW_TAG_TI_far_type
   10156                      .dwattr $C$DW$1819, DW_AT_type(*$C$DW$T$320)
   10157              $C$DW$T$321     .dwtag  DW_TAG_const_type
   10158                      .dwattr $C$DW$T$321, DW_AT_type(*$C$DW$1819)
   10159              
   10160              $C$DW$T$322     .dwtag  DW_TAG_enumeration_type
   10161                      .dwattr $C$DW$T$322, DW_AT_byte_size(0x01)
   10162              $C$DW$1820      .dwtag  DW_TAG_enumerator, DW_AT_name("SCI_Parity_Odd"), DW_AT_const_value(0x00)
   10163              $C$DW$1821      .dwtag  DW_TAG_enumerator, DW_AT_name("SCI_Parity_Even"), DW_AT_const_value(0x40)
   10164                      .dwendtag $C$DW$T$322
   10165              
   10166              $C$DW$T$323     .dwtag  DW_TAG_typedef, DW_AT_name("SCI_Parity_e")
   10167                      .dwattr $C$DW$T$323, DW_AT_type(*$C$DW$T$322)
   10168                      .dwattr $C$DW$T$323, DW_AT_language(DW_LANG_C)
   10169              $C$DW$1822      .dwtag  DW_TAG_TI_far_type
   10170                      .dwattr $C$DW$1822, DW_AT_type(*$C$DW$T$323)
   10171              $C$DW$T$324     .dwtag  DW_TAG_const_type
   10172                      .dwattr $C$DW$T$324, DW_AT_type(*$C$DW$1822)
   10173              
   10174              $C$DW$T$325     .dwtag  DW_TAG_enumeration_type
   10175                      .dwattr $C$DW$T$325, DW_AT_byte_size(0x01)
   10176              $C$DW$1823      .dwtag  DW_TAG_enumerator, DW_AT_name("HAL_SensorType_Current"), DW_AT_const_value(0x00)
   10177              $C$DW$1824      .dwtag  DW_TAG_enumerator, DW_AT_name("HAL_SensorType_Voltage"), DW_AT_const_value(0x01)
   10178                      .dwendtag $C$DW$T$325
   10179              
   10180              $C$DW$T$326     .dwtag  DW_TAG_typedef, DW_AT_name("HAL_SensorType_e")
   10181                      .dwattr $C$DW$T$326, DW_AT_type(*$C$DW$T$325)
   10182                      .dwattr $C$DW$T$326, DW_AT_language(DW_LANG_C)
   10183              
   10184              $C$DW$T$19      .dwtag  DW_TAG_structure_type
   10185                      .dwattr $C$DW$T$19, DW_AT_name("I2C_Obj")
   10186                      .dwattr $C$DW$T$19, DW_AT_declaration
   10187                      .dwendtag $C$DW$T$19
TMS320C2000 Assembler PC v6.2.5 Wed Sep 27 19:09:55 2017

Tools Copyright (c) 1996-2014 Texas Instruments Incorporated
C:\Users\wmj\AppData\Local\Temp\0231210                              PAGE  196

   10188              
   10189              $C$DW$T$79      .dwtag  DW_TAG_pointer_type
   10190                      .dwattr $C$DW$T$79, DW_AT_type(*$C$DW$T$19)
   10191                      .dwattr $C$DW$T$79, DW_AT_address_class(0x16)
   10192              $C$DW$T$80      .dwtag  DW_TAG_typedef, DW_AT_name("I2C_Handle")
   10193                      .dwattr $C$DW$T$80, DW_AT_type(*$C$DW$T$79)
   10194                      .dwattr $C$DW$T$80, DW_AT_language(DW_LANG_C)
   10195              
   10196              $C$DW$T$30      .dwtag  DW_TAG_structure_type
   10197                      .dwattr $C$DW$T$30, DW_AT_name("_ADC_Obj_")
   10198                      .dwattr $C$DW$T$30, DW_AT_byte_size(0x6650)
   10199              $C$DW$1825      .dwtag  DW_TAG_member
   10200                      .dwattr $C$DW$1825, DW_AT_type(*$C$DW$T$24)
   10201                      .dwattr $C$DW$1825, DW_AT_name("ADCRESULT")
   10202                      .dwattr $C$DW$1825, DW_AT_TI_symbol_name("_ADCRESULT")
   10203                      .dwattr $C$DW$1825, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
   10204                      .dwattr $C$DW$1825, DW_AT_accessibility(DW_ACCESS_public)
   10205              $C$DW$1826      .dwtag  DW_TAG_member
   10206                      .dwattr $C$DW$1826, DW_AT_type(*$C$DW$T$25)
   10207                      .dwattr $C$DW$1826, DW_AT_name("resvd_1")
   10208                      .dwattr $C$DW$1826, DW_AT_TI_symbol_name("_resvd_1")
   10209                      .dwattr $C$DW$1826, DW_AT_data_member_location[DW_OP_plus_uconst 0x10]
   10210                      .dwattr $C$DW$1826, DW_AT_accessibility(DW_ACCESS_public)
   10211              $C$DW$1827      .dwtag  DW_TAG_member
   10212                      .dwattr $C$DW$1827, DW_AT_type(*$C$DW$T$23)
   10213                      .dwattr $C$DW$1827, DW_AT_name("ADCCTL1")
   10214                      .dwattr $C$DW$1827, DW_AT_TI_symbol_name("_ADCCTL1")
   10215                      .dwattr $C$DW$1827, DW_AT_data_member_location[DW_OP_plus_uconst 0x6600]
   10216                      .dwattr $C$DW$1827, DW_AT_accessibility(DW_ACCESS_public)
   10217              $C$DW$1828      .dwtag  DW_TAG_member
   10218                      .dwattr $C$DW$1828, DW_AT_type(*$C$DW$T$23)
   10219                      .dwattr $C$DW$1828, DW_AT_name("ADCCTL2")
   10220                      .dwattr $C$DW$1828, DW_AT_TI_symbol_name("_ADCCTL2")
   10221                      .dwattr $C$DW$1828, DW_AT_data_member_location[DW_OP_plus_uconst 0x6601]
   10222                      .dwattr $C$DW$1828, DW_AT_accessibility(DW_ACCESS_public)
   10223              $C$DW$1829      .dwtag  DW_TAG_member
   10224                      .dwattr $C$DW$1829, DW_AT_type(*$C$DW$T$26)
   10225                      .dwattr $C$DW$1829, DW_AT_name("rsvd_2")
   10226                      .dwattr $C$DW$1829, DW_AT_TI_symbol_name("_rsvd_2")
   10227                      .dwattr $C$DW$1829, DW_AT_data_member_location[DW_OP_plus_uconst 0x6602]
   10228                      .dwattr $C$DW$1829, DW_AT_accessibility(DW_ACCESS_public)
   10229              $C$DW$1830      .dwtag  DW_TAG_member
   10230                      .dwattr $C$DW$1830, DW_AT_type(*$C$DW$T$23)
   10231                      .dwattr $C$DW$1830, DW_AT_name("ADCINTFLG")
   10232                      .dwattr $C$DW$1830, DW_AT_TI_symbol_name("_ADCINTFLG")
   10233                      .dwattr $C$DW$1830, DW_AT_data_member_location[DW_OP_plus_uconst 0x6604]
   10234                      .dwattr $C$DW$1830, DW_AT_accessibility(DW_ACCESS_public)
   10235              $C$DW$1831      .dwtag  DW_TAG_member
   10236                      .dwattr $C$DW$1831, DW_AT_type(*$C$DW$T$23)
   10237                      .dwattr $C$DW$1831, DW_AT_name("ADCINTFLGCLR")
   10238                      .dwattr $C$DW$1831, DW_AT_TI_symbol_name("_ADCINTFLGCLR")
   10239                      .dwattr $C$DW$1831, DW_AT_data_member_location[DW_OP_plus_uconst 0x6605]
   10240                      .dwattr $C$DW$1831, DW_AT_accessibility(DW_ACCESS_public)
   10241              $C$DW$1832      .dwtag  DW_TAG_member
   10242                      .dwattr $C$DW$1832, DW_AT_type(*$C$DW$T$23)
TMS320C2000 Assembler PC v6.2.5 Wed Sep 27 19:09:55 2017

Tools Copyright (c) 1996-2014 Texas Instruments Incorporated
C:\Users\wmj\AppData\Local\Temp\0231210                              PAGE  197

   10243                      .dwattr $C$DW$1832, DW_AT_name("ADCINTOVF")
   10244                      .dwattr $C$DW$1832, DW_AT_TI_symbol_name("_ADCINTOVF")
   10245                      .dwattr $C$DW$1832, DW_AT_data_member_location[DW_OP_plus_uconst 0x6606]
   10246                      .dwattr $C$DW$1832, DW_AT_accessibility(DW_ACCESS_public)
   10247              $C$DW$1833      .dwtag  DW_TAG_member
   10248                      .dwattr $C$DW$1833, DW_AT_type(*$C$DW$T$23)
   10249                      .dwattr $C$DW$1833, DW_AT_name("ADCINTOVFCLR")
   10250                      .dwattr $C$DW$1833, DW_AT_TI_symbol_name("_ADCINTOVFCLR")
   10251                      .dwattr $C$DW$1833, DW_AT_data_member_location[DW_OP_plus_uconst 0x6607]
   10252                      .dwattr $C$DW$1833, DW_AT_accessibility(DW_ACCESS_public)
   10253              $C$DW$1834      .dwtag  DW_TAG_member
   10254                      .dwattr $C$DW$1834, DW_AT_type(*$C$DW$T$27)
   10255                      .dwattr $C$DW$1834, DW_AT_name("INTSELxNy")
   10256                      .dwattr $C$DW$1834, DW_AT_TI_symbol_name("_INTSELxNy")
   10257                      .dwattr $C$DW$1834, DW_AT_data_member_location[DW_OP_plus_uconst 0x6608]
   10258                      .dwattr $C$DW$1834, DW_AT_accessibility(DW_ACCESS_public)
   10259              $C$DW$1835      .dwtag  DW_TAG_member
   10260                      .dwattr $C$DW$1835, DW_AT_type(*$C$DW$T$28)
   10261                      .dwattr $C$DW$1835, DW_AT_name("rsvd_3")
   10262                      .dwattr $C$DW$1835, DW_AT_TI_symbol_name("_rsvd_3")
   10263                      .dwattr $C$DW$1835, DW_AT_data_member_location[DW_OP_plus_uconst 0x660d]
   10264                      .dwattr $C$DW$1835, DW_AT_accessibility(DW_ACCESS_public)
   10265              $C$DW$1836      .dwtag  DW_TAG_member
   10266                      .dwattr $C$DW$1836, DW_AT_type(*$C$DW$T$23)
   10267                      .dwattr $C$DW$1836, DW_AT_name("SOCPRICTRL")
   10268                      .dwattr $C$DW$1836, DW_AT_TI_symbol_name("_SOCPRICTRL")
   10269                      .dwattr $C$DW$1836, DW_AT_data_member_location[DW_OP_plus_uconst 0x6610]
   10270                      .dwattr $C$DW$1836, DW_AT_accessibility(DW_ACCESS_public)
   10271              $C$DW$1837      .dwtag  DW_TAG_member
   10272                      .dwattr $C$DW$1837, DW_AT_type(*$C$DW$T$23)
   10273                      .dwattr $C$DW$1837, DW_AT_name("rsvd_4")
   10274                      .dwattr $C$DW$1837, DW_AT_TI_symbol_name("_rsvd_4")
   10275                      .dwattr $C$DW$1837, DW_AT_data_member_location[DW_OP_plus_uconst 0x6611]
   10276                      .dwattr $C$DW$1837, DW_AT_accessibility(DW_ACCESS_public)
   10277              $C$DW$1838      .dwtag  DW_TAG_member
   10278                      .dwattr $C$DW$1838, DW_AT_type(*$C$DW$T$23)
   10279                      .dwattr $C$DW$1838, DW_AT_name("ADCSAMPLEMODE")
   10280                      .dwattr $C$DW$1838, DW_AT_TI_symbol_name("_ADCSAMPLEMODE")
   10281                      .dwattr $C$DW$1838, DW_AT_data_member_location[DW_OP_plus_uconst 0x6612]
   10282                      .dwattr $C$DW$1838, DW_AT_accessibility(DW_ACCESS_public)
   10283              $C$DW$1839      .dwtag  DW_TAG_member
   10284                      .dwattr $C$DW$1839, DW_AT_type(*$C$DW$T$23)
   10285                      .dwattr $C$DW$1839, DW_AT_name("rsvd_5")
   10286                      .dwattr $C$DW$1839, DW_AT_TI_symbol_name("_rsvd_5")
   10287                      .dwattr $C$DW$1839, DW_AT_data_member_location[DW_OP_plus_uconst 0x6613]
   10288                      .dwattr $C$DW$1839, DW_AT_accessibility(DW_ACCESS_public)
   10289              $C$DW$1840      .dwtag  DW_TAG_member
   10290                      .dwattr $C$DW$1840, DW_AT_type(*$C$DW$T$23)
   10291                      .dwattr $C$DW$1840, DW_AT_name("ADCINTSOCSEL1")
   10292                      .dwattr $C$DW$1840, DW_AT_TI_symbol_name("_ADCINTSOCSEL1")
   10293                      .dwattr $C$DW$1840, DW_AT_data_member_location[DW_OP_plus_uconst 0x6614]
   10294                      .dwattr $C$DW$1840, DW_AT_accessibility(DW_ACCESS_public)
   10295              $C$DW$1841      .dwtag  DW_TAG_member
   10296                      .dwattr $C$DW$1841, DW_AT_type(*$C$DW$T$23)
   10297                      .dwattr $C$DW$1841, DW_AT_name("ADCINTSOCSEL2")
TMS320C2000 Assembler PC v6.2.5 Wed Sep 27 19:09:55 2017

Tools Copyright (c) 1996-2014 Texas Instruments Incorporated
C:\Users\wmj\AppData\Local\Temp\0231210                              PAGE  198

   10298                      .dwattr $C$DW$1841, DW_AT_TI_symbol_name("_ADCINTSOCSEL2")
   10299                      .dwattr $C$DW$1841, DW_AT_data_member_location[DW_OP_plus_uconst 0x6615]
   10300                      .dwattr $C$DW$1841, DW_AT_accessibility(DW_ACCESS_public)
   10301              $C$DW$1842      .dwtag  DW_TAG_member
   10302                      .dwattr $C$DW$1842, DW_AT_type(*$C$DW$T$26)
   10303                      .dwattr $C$DW$1842, DW_AT_name("rsvd_6")
   10304                      .dwattr $C$DW$1842, DW_AT_TI_symbol_name("_rsvd_6")
   10305                      .dwattr $C$DW$1842, DW_AT_data_member_location[DW_OP_plus_uconst 0x6616]
   10306                      .dwattr $C$DW$1842, DW_AT_accessibility(DW_ACCESS_public)
   10307              $C$DW$1843      .dwtag  DW_TAG_member
   10308                      .dwattr $C$DW$1843, DW_AT_type(*$C$DW$T$23)
   10309                      .dwattr $C$DW$1843, DW_AT_name("ADCSOCFLG1")
   10310                      .dwattr $C$DW$1843, DW_AT_TI_symbol_name("_ADCSOCFLG1")
   10311                      .dwattr $C$DW$1843, DW_AT_data_member_location[DW_OP_plus_uconst 0x6618]
   10312                      .dwattr $C$DW$1843, DW_AT_accessibility(DW_ACCESS_public)
   10313              $C$DW$1844      .dwtag  DW_TAG_member
   10314                      .dwattr $C$DW$1844, DW_AT_type(*$C$DW$T$23)
   10315                      .dwattr $C$DW$1844, DW_AT_name("rsvd_7")
   10316                      .dwattr $C$DW$1844, DW_AT_TI_symbol_name("_rsvd_7")
   10317                      .dwattr $C$DW$1844, DW_AT_data_member_location[DW_OP_plus_uconst 0x6619]
   10318                      .dwattr $C$DW$1844, DW_AT_accessibility(DW_ACCESS_public)
   10319              $C$DW$1845      .dwtag  DW_TAG_member
   10320                      .dwattr $C$DW$1845, DW_AT_type(*$C$DW$T$23)
   10321                      .dwattr $C$DW$1845, DW_AT_name("ADCSOCFRC1")
   10322                      .dwattr $C$DW$1845, DW_AT_TI_symbol_name("_ADCSOCFRC1")
   10323                      .dwattr $C$DW$1845, DW_AT_data_member_location[DW_OP_plus_uconst 0x661a]
   10324                      .dwattr $C$DW$1845, DW_AT_accessibility(DW_ACCESS_public)
   10325              $C$DW$1846      .dwtag  DW_TAG_member
   10326                      .dwattr $C$DW$1846, DW_AT_type(*$C$DW$T$23)
   10327                      .dwattr $C$DW$1846, DW_AT_name("rsvd_8")
   10328                      .dwattr $C$DW$1846, DW_AT_TI_symbol_name("_rsvd_8")
   10329                      .dwattr $C$DW$1846, DW_AT_data_member_location[DW_OP_plus_uconst 0x661b]
   10330                      .dwattr $C$DW$1846, DW_AT_accessibility(DW_ACCESS_public)
   10331              $C$DW$1847      .dwtag  DW_TAG_member
   10332                      .dwattr $C$DW$1847, DW_AT_type(*$C$DW$T$23)
   10333                      .dwattr $C$DW$1847, DW_AT_name("ADCSOCOVF1")
   10334                      .dwattr $C$DW$1847, DW_AT_TI_symbol_name("_ADCSOCOVF1")
   10335                      .dwattr $C$DW$1847, DW_AT_data_member_location[DW_OP_plus_uconst 0x661c]
   10336                      .dwattr $C$DW$1847, DW_AT_accessibility(DW_ACCESS_public)
   10337              $C$DW$1848      .dwtag  DW_TAG_member
   10338                      .dwattr $C$DW$1848, DW_AT_type(*$C$DW$T$23)
   10339                      .dwattr $C$DW$1848, DW_AT_name("rsvd_9")
   10340                      .dwattr $C$DW$1848, DW_AT_TI_symbol_name("_rsvd_9")
   10341                      .dwattr $C$DW$1848, DW_AT_data_member_location[DW_OP_plus_uconst 0x661d]
   10342                      .dwattr $C$DW$1848, DW_AT_accessibility(DW_ACCESS_public)
   10343              $C$DW$1849      .dwtag  DW_TAG_member
   10344                      .dwattr $C$DW$1849, DW_AT_type(*$C$DW$T$23)
   10345                      .dwattr $C$DW$1849, DW_AT_name("ADCSOCOVFCLR1")
   10346                      .dwattr $C$DW$1849, DW_AT_TI_symbol_name("_ADCSOCOVFCLR1")
   10347                      .dwattr $C$DW$1849, DW_AT_data_member_location[DW_OP_plus_uconst 0x661e]
   10348                      .dwattr $C$DW$1849, DW_AT_accessibility(DW_ACCESS_public)
   10349              $C$DW$1850      .dwtag  DW_TAG_member
   10350                      .dwattr $C$DW$1850, DW_AT_type(*$C$DW$T$23)
   10351                      .dwattr $C$DW$1850, DW_AT_name("rsvd_10")
   10352                      .dwattr $C$DW$1850, DW_AT_TI_symbol_name("_rsvd_10")
TMS320C2000 Assembler PC v6.2.5 Wed Sep 27 19:09:55 2017

Tools Copyright (c) 1996-2014 Texas Instruments Incorporated
C:\Users\wmj\AppData\Local\Temp\0231210                              PAGE  199

   10353                      .dwattr $C$DW$1850, DW_AT_data_member_location[DW_OP_plus_uconst 0x661f]
   10354                      .dwattr $C$DW$1850, DW_AT_accessibility(DW_ACCESS_public)
   10355              $C$DW$1851      .dwtag  DW_TAG_member
   10356                      .dwattr $C$DW$1851, DW_AT_type(*$C$DW$T$24)
   10357                      .dwattr $C$DW$1851, DW_AT_name("ADCSOCxCTL")
   10358                      .dwattr $C$DW$1851, DW_AT_TI_symbol_name("_ADCSOCxCTL")
   10359                      .dwattr $C$DW$1851, DW_AT_data_member_location[DW_OP_plus_uconst 0x6620]
   10360                      .dwattr $C$DW$1851, DW_AT_accessibility(DW_ACCESS_public)
   10361              $C$DW$1852      .dwtag  DW_TAG_member
   10362                      .dwattr $C$DW$1852, DW_AT_type(*$C$DW$T$24)
   10363                      .dwattr $C$DW$1852, DW_AT_name("rsvd_11")
   10364                      .dwattr $C$DW$1852, DW_AT_TI_symbol_name("_rsvd_11")
   10365                      .dwattr $C$DW$1852, DW_AT_data_member_location[DW_OP_plus_uconst 0x6630]
   10366                      .dwattr $C$DW$1852, DW_AT_accessibility(DW_ACCESS_public)
   10367              $C$DW$1853      .dwtag  DW_TAG_member
   10368                      .dwattr $C$DW$1853, DW_AT_type(*$C$DW$T$23)
   10369                      .dwattr $C$DW$1853, DW_AT_name("ADCREFTRIM")
   10370                      .dwattr $C$DW$1853, DW_AT_TI_symbol_name("_ADCREFTRIM")
   10371                      .dwattr $C$DW$1853, DW_AT_data_member_location[DW_OP_plus_uconst 0x6640]
   10372                      .dwattr $C$DW$1853, DW_AT_accessibility(DW_ACCESS_public)
   10373              $C$DW$1854      .dwtag  DW_TAG_member
   10374                      .dwattr $C$DW$1854, DW_AT_type(*$C$DW$T$23)
   10375                      .dwattr $C$DW$1854, DW_AT_name("ADCOFFTRIM")
   10376                      .dwattr $C$DW$1854, DW_AT_TI_symbol_name("_ADCOFFTRIM")
   10377                      .dwattr $C$DW$1854, DW_AT_data_member_location[DW_OP_plus_uconst 0x6641]
   10378                      .dwattr $C$DW$1854, DW_AT_accessibility(DW_ACCESS_public)
   10379              $C$DW$1855      .dwtag  DW_TAG_member
   10380                      .dwattr $C$DW$1855, DW_AT_type(*$C$DW$T$29)
   10381                      .dwattr $C$DW$1855, DW_AT_name("resvd_12")
   10382                      .dwattr $C$DW$1855, DW_AT_TI_symbol_name("_resvd_12")
   10383                      .dwattr $C$DW$1855, DW_AT_data_member_location[DW_OP_plus_uconst 0x6642]
   10384                      .dwattr $C$DW$1855, DW_AT_accessibility(DW_ACCESS_public)
   10385              $C$DW$1856      .dwtag  DW_TAG_member
   10386                      .dwattr $C$DW$1856, DW_AT_type(*$C$DW$T$23)
   10387                      .dwattr $C$DW$1856, DW_AT_name("ADCREV")
   10388                      .dwattr $C$DW$1856, DW_AT_TI_symbol_name("_ADCREV")
   10389                      .dwattr $C$DW$1856, DW_AT_data_member_location[DW_OP_plus_uconst 0x664f]
   10390                      .dwattr $C$DW$1856, DW_AT_accessibility(DW_ACCESS_public)
   10391                      .dwendtag $C$DW$T$30
   10392              
   10393              $C$DW$T$333     .dwtag  DW_TAG_typedef, DW_AT_name("ADC_Obj")
   10394                      .dwattr $C$DW$T$333, DW_AT_type(*$C$DW$T$30)
   10395                      .dwattr $C$DW$T$333, DW_AT_language(DW_LANG_C)
   10396              $C$DW$T$50      .dwtag  DW_TAG_pointer_type
   10397                      .dwattr $C$DW$T$50, DW_AT_type(*$C$DW$T$30)
   10398                      .dwattr $C$DW$T$50, DW_AT_address_class(0x16)
   10399              $C$DW$T$51      .dwtag  DW_TAG_typedef, DW_AT_name("ADC_Handle")
   10400                      .dwattr $C$DW$T$51, DW_AT_type(*$C$DW$T$50)
   10401                      .dwattr $C$DW$T$51, DW_AT_language(DW_LANG_C)
   10402              
   10403              $C$DW$T$32      .dwtag  DW_TAG_structure_type
   10404                      .dwattr $C$DW$T$32, DW_AT_name("_CLK_Obj_")
   10405                      .dwattr $C$DW$T$32, DW_AT_byte_size(0x11)
   10406              $C$DW$1857      .dwtag  DW_TAG_member
   10407                      .dwattr $C$DW$1857, DW_AT_type(*$C$DW$T$23)
TMS320C2000 Assembler PC v6.2.5 Wed Sep 27 19:09:55 2017

Tools Copyright (c) 1996-2014 Texas Instruments Incorporated
C:\Users\wmj\AppData\Local\Temp\0231210                              PAGE  200

   10408                      .dwattr $C$DW$1857, DW_AT_name("XCLK")
   10409                      .dwattr $C$DW$1857, DW_AT_TI_symbol_name("_XCLK")
   10410                      .dwattr $C$DW$1857, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
   10411                      .dwattr $C$DW$1857, DW_AT_accessibility(DW_ACCESS_public)
   10412              $C$DW$1858      .dwtag  DW_TAG_member
   10413                      .dwattr $C$DW$1858, DW_AT_type(*$C$DW$T$23)
   10414                      .dwattr $C$DW$1858, DW_AT_name("rsvd_1")
   10415                      .dwattr $C$DW$1858, DW_AT_TI_symbol_name("_rsvd_1")
   10416                      .dwattr $C$DW$1858, DW_AT_data_member_location[DW_OP_plus_uconst 0x1]
   10417                      .dwattr $C$DW$1858, DW_AT_accessibility(DW_ACCESS_public)
   10418              $C$DW$1859      .dwtag  DW_TAG_member
   10419                      .dwattr $C$DW$1859, DW_AT_type(*$C$DW$T$23)
   10420                      .dwattr $C$DW$1859, DW_AT_name("CLKCTL")
   10421                      .dwattr $C$DW$1859, DW_AT_TI_symbol_name("_CLKCTL")
   10422                      .dwattr $C$DW$1859, DW_AT_data_member_location[DW_OP_plus_uconst 0x2]
   10423                      .dwattr $C$DW$1859, DW_AT_accessibility(DW_ACCESS_public)
   10424              $C$DW$1860      .dwtag  DW_TAG_member
   10425                      .dwattr $C$DW$1860, DW_AT_type(*$C$DW$T$31)
   10426                      .dwattr $C$DW$1860, DW_AT_name("rsvd_2")
   10427                      .dwattr $C$DW$1860, DW_AT_TI_symbol_name("_rsvd_2")
   10428                      .dwattr $C$DW$1860, DW_AT_data_member_location[DW_OP_plus_uconst 0x3]
   10429                      .dwattr $C$DW$1860, DW_AT_accessibility(DW_ACCESS_public)
   10430              $C$DW$1861      .dwtag  DW_TAG_member
   10431                      .dwattr $C$DW$1861, DW_AT_type(*$C$DW$T$23)
   10432                      .dwattr $C$DW$1861, DW_AT_name("LOSPCP")
   10433                      .dwattr $C$DW$1861, DW_AT_TI_symbol_name("_LOSPCP")
   10434                      .dwattr $C$DW$1861, DW_AT_data_member_location[DW_OP_plus_uconst 0xb]
   10435                      .dwattr $C$DW$1861, DW_AT_accessibility(DW_ACCESS_public)
   10436              $C$DW$1862      .dwtag  DW_TAG_member
   10437                      .dwattr $C$DW$1862, DW_AT_type(*$C$DW$T$23)
   10438                      .dwattr $C$DW$1862, DW_AT_name("PCLKCR0")
   10439                      .dwattr $C$DW$1862, DW_AT_TI_symbol_name("_PCLKCR0")
   10440                      .dwattr $C$DW$1862, DW_AT_data_member_location[DW_OP_plus_uconst 0xc]
   10441                      .dwattr $C$DW$1862, DW_AT_accessibility(DW_ACCESS_public)
   10442              $C$DW$1863      .dwtag  DW_TAG_member
   10443                      .dwattr $C$DW$1863, DW_AT_type(*$C$DW$T$23)
   10444                      .dwattr $C$DW$1863, DW_AT_name("PCLKCR1")
   10445                      .dwattr $C$DW$1863, DW_AT_TI_symbol_name("_PCLKCR1")
   10446                      .dwattr $C$DW$1863, DW_AT_data_member_location[DW_OP_plus_uconst 0xd]
   10447                      .dwattr $C$DW$1863, DW_AT_accessibility(DW_ACCESS_public)
   10448              $C$DW$1864      .dwtag  DW_TAG_member
   10449                      .dwattr $C$DW$1864, DW_AT_type(*$C$DW$T$26)
   10450                      .dwattr $C$DW$1864, DW_AT_name("rsvd_3")
   10451                      .dwattr $C$DW$1864, DW_AT_TI_symbol_name("_rsvd_3")
   10452                      .dwattr $C$DW$1864, DW_AT_data_member_location[DW_OP_plus_uconst 0xe]
   10453                      .dwattr $C$DW$1864, DW_AT_accessibility(DW_ACCESS_public)
   10454              $C$DW$1865      .dwtag  DW_TAG_member
   10455                      .dwattr $C$DW$1865, DW_AT_type(*$C$DW$T$23)
   10456                      .dwattr $C$DW$1865, DW_AT_name("PCLKCR3")
   10457                      .dwattr $C$DW$1865, DW_AT_TI_symbol_name("_PCLKCR3")
   10458                      .dwattr $C$DW$1865, DW_AT_data_member_location[DW_OP_plus_uconst 0x10]
   10459                      .dwattr $C$DW$1865, DW_AT_accessibility(DW_ACCESS_public)
   10460                      .dwendtag $C$DW$T$32
   10461              
   10462              $C$DW$T$52      .dwtag  DW_TAG_pointer_type
TMS320C2000 Assembler PC v6.2.5 Wed Sep 27 19:09:55 2017

Tools Copyright (c) 1996-2014 Texas Instruments Incorporated
C:\Users\wmj\AppData\Local\Temp\0231210                              PAGE  201

   10463                      .dwattr $C$DW$T$52, DW_AT_type(*$C$DW$T$32)
   10464                      .dwattr $C$DW$T$52, DW_AT_address_class(0x16)
   10465              $C$DW$T$53      .dwtag  DW_TAG_typedef, DW_AT_name("CLK_Handle")
   10466                      .dwattr $C$DW$T$53, DW_AT_type(*$C$DW$T$52)
   10467                      .dwattr $C$DW$T$53, DW_AT_language(DW_LANG_C)
   10468              
   10469              $C$DW$T$34      .dwtag  DW_TAG_structure_type
   10470                      .dwattr $C$DW$T$34, DW_AT_name("_CPU_Obj_")
   10471                      .dwattr $C$DW$T$34, DW_AT_byte_size(0x01)
   10472              $C$DW$1866      .dwtag  DW_TAG_member
   10473                      .dwattr $C$DW$1866, DW_AT_type(*$C$DW$T$33)
   10474                      .dwattr $C$DW$1866, DW_AT_name("tmp")
   10475                      .dwattr $C$DW$1866, DW_AT_TI_symbol_name("_tmp")
   10476                      .dwattr $C$DW$1866, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
   10477                      .dwattr $C$DW$1866, DW_AT_accessibility(DW_ACCESS_public)
   10478                      .dwendtag $C$DW$T$34
   10479              
   10480              $C$DW$T$340     .dwtag  DW_TAG_typedef, DW_AT_name("CPU_Obj")
   10481                      .dwattr $C$DW$T$340, DW_AT_type(*$C$DW$T$34)
   10482                      .dwattr $C$DW$T$340, DW_AT_language(DW_LANG_C)
   10483              $C$DW$T$54      .dwtag  DW_TAG_pointer_type
   10484                      .dwattr $C$DW$T$54, DW_AT_type(*$C$DW$T$34)
   10485                      .dwattr $C$DW$T$54, DW_AT_address_class(0x16)
   10486              $C$DW$T$55      .dwtag  DW_TAG_typedef, DW_AT_name("CPU_Handle")
   10487                      .dwattr $C$DW$T$55, DW_AT_type(*$C$DW$T$54)
   10488                      .dwattr $C$DW$T$55, DW_AT_language(DW_LANG_C)
   10489              
   10490              $C$DW$T$36      .dwtag  DW_TAG_structure_type
   10491                      .dwattr $C$DW$T$36, DW_AT_name("_FILTER_FO_")
   10492                      .dwattr $C$DW$T$36, DW_AT_byte_size(0x0a)
   10493              $C$DW$1867      .dwtag  DW_TAG_member
   10494                      .dwattr $C$DW$1867, DW_AT_type(*$C$DW$T$35)
   10495                      .dwattr $C$DW$1867, DW_AT_name("a1")
   10496                      .dwattr $C$DW$1867, DW_AT_TI_symbol_name("_a1")
   10497                      .dwattr $C$DW$1867, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
   10498                      .dwattr $C$DW$1867, DW_AT_accessibility(DW_ACCESS_public)
   10499              $C$DW$1868      .dwtag  DW_TAG_member
   10500                      .dwattr $C$DW$1868, DW_AT_type(*$C$DW$T$35)
   10501                      .dwattr $C$DW$1868, DW_AT_name("b0")
   10502                      .dwattr $C$DW$1868, DW_AT_TI_symbol_name("_b0")
   10503                      .dwattr $C$DW$1868, DW_AT_data_member_location[DW_OP_plus_uconst 0x2]
   10504                      .dwattr $C$DW$1868, DW_AT_accessibility(DW_ACCESS_public)
   10505              $C$DW$1869      .dwtag  DW_TAG_member
   10506                      .dwattr $C$DW$1869, DW_AT_type(*$C$DW$T$35)
   10507                      .dwattr $C$DW$1869, DW_AT_name("b1")
   10508                      .dwattr $C$DW$1869, DW_AT_TI_symbol_name("_b1")
   10509                      .dwattr $C$DW$1869, DW_AT_data_member_location[DW_OP_plus_uconst 0x4]
   10510                      .dwattr $C$DW$1869, DW_AT_accessibility(DW_ACCESS_public)
   10511              $C$DW$1870      .dwtag  DW_TAG_member
   10512                      .dwattr $C$DW$1870, DW_AT_type(*$C$DW$T$35)
   10513                      .dwattr $C$DW$1870, DW_AT_name("x1")
   10514                      .dwattr $C$DW$1870, DW_AT_TI_symbol_name("_x1")
   10515                      .dwattr $C$DW$1870, DW_AT_data_member_location[DW_OP_plus_uconst 0x6]
   10516                      .dwattr $C$DW$1870, DW_AT_accessibility(DW_ACCESS_public)
   10517              $C$DW$1871      .dwtag  DW_TAG_member
TMS320C2000 Assembler PC v6.2.5 Wed Sep 27 19:09:55 2017

Tools Copyright (c) 1996-2014 Texas Instruments Incorporated
C:\Users\wmj\AppData\Local\Temp\0231210                              PAGE  202

   10518                      .dwattr $C$DW$1871, DW_AT_type(*$C$DW$T$35)
   10519                      .dwattr $C$DW$1871, DW_AT_name("y1")
   10520                      .dwattr $C$DW$1871, DW_AT_TI_symbol_name("_y1")
   10521                      .dwattr $C$DW$1871, DW_AT_data_member_location[DW_OP_plus_uconst 0x8]
   10522                      .dwattr $C$DW$1871, DW_AT_accessibility(DW_ACCESS_public)
   10523                      .dwendtag $C$DW$T$36
   10524              
   10525              $C$DW$T$93      .dwtag  DW_TAG_typedef, DW_AT_name("FILTER_FO_Obj")
   10526                      .dwattr $C$DW$T$93, DW_AT_type(*$C$DW$T$36)
   10527                      .dwattr $C$DW$T$93, DW_AT_language(DW_LANG_C)
   10528              
   10529              $C$DW$T$20      .dwtag  DW_TAG_structure_type
   10530                      .dwattr $C$DW$T$20, DW_AT_name("_FILTER_FO_Obj_")
   10531                      .dwattr $C$DW$T$20, DW_AT_declaration
   10532                      .dwendtag $C$DW$T$20
   10533              
   10534              $C$DW$T$94      .dwtag  DW_TAG_pointer_type
   10535                      .dwattr $C$DW$T$94, DW_AT_type(*$C$DW$T$20)
   10536                      .dwattr $C$DW$T$94, DW_AT_address_class(0x16)
   10537              $C$DW$T$95      .dwtag  DW_TAG_typedef, DW_AT_name("FILTER_FO_Handle")
   10538                      .dwattr $C$DW$T$95, DW_AT_type(*$C$DW$T$94)
   10539                      .dwattr $C$DW$T$95, DW_AT_language(DW_LANG_C)
   10540              
   10541              $C$DW$T$37      .dwtag  DW_TAG_structure_type
   10542                      .dwattr $C$DW$T$37, DW_AT_name("_FLASH_Obj_")
   10543                      .dwattr $C$DW$T$37, DW_AT_byte_size(0x08)
   10544              $C$DW$1872      .dwtag  DW_TAG_member
   10545                      .dwattr $C$DW$1872, DW_AT_type(*$C$DW$T$23)
   10546                      .dwattr $C$DW$1872, DW_AT_name("FOPT")
   10547                      .dwattr $C$DW$1872, DW_AT_TI_symbol_name("_FOPT")
   10548                      .dwattr $C$DW$1872, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
   10549                      .dwattr $C$DW$1872, DW_AT_accessibility(DW_ACCESS_public)
   10550              $C$DW$1873      .dwtag  DW_TAG_member
   10551                      .dwattr $C$DW$1873, DW_AT_type(*$C$DW$T$23)
   10552                      .dwattr $C$DW$1873, DW_AT_name("rsvd_1")
   10553                      .dwattr $C$DW$1873, DW_AT_TI_symbol_name("_rsvd_1")
   10554                      .dwattr $C$DW$1873, DW_AT_data_member_location[DW_OP_plus_uconst 0x1]
   10555                      .dwattr $C$DW$1873, DW_AT_accessibility(DW_ACCESS_public)
   10556              $C$DW$1874      .dwtag  DW_TAG_member
   10557                      .dwattr $C$DW$1874, DW_AT_type(*$C$DW$T$23)
   10558                      .dwattr $C$DW$1874, DW_AT_name("FPWR")
   10559                      .dwattr $C$DW$1874, DW_AT_TI_symbol_name("_FPWR")
   10560                      .dwattr $C$DW$1874, DW_AT_data_member_location[DW_OP_plus_uconst 0x2]
   10561                      .dwattr $C$DW$1874, DW_AT_accessibility(DW_ACCESS_public)
   10562              $C$DW$1875      .dwtag  DW_TAG_member
   10563                      .dwattr $C$DW$1875, DW_AT_type(*$C$DW$T$23)
   10564                      .dwattr $C$DW$1875, DW_AT_name("FSTATUS")
   10565                      .dwattr $C$DW$1875, DW_AT_TI_symbol_name("_FSTATUS")
   10566                      .dwattr $C$DW$1875, DW_AT_data_member_location[DW_OP_plus_uconst 0x3]
   10567                      .dwattr $C$DW$1875, DW_AT_accessibility(DW_ACCESS_public)
   10568              $C$DW$1876      .dwtag  DW_TAG_member
   10569                      .dwattr $C$DW$1876, DW_AT_type(*$C$DW$T$23)
   10570                      .dwattr $C$DW$1876, DW_AT_name("FSTDBYWAIT")
   10571                      .dwattr $C$DW$1876, DW_AT_TI_symbol_name("_FSTDBYWAIT")
   10572                      .dwattr $C$DW$1876, DW_AT_data_member_location[DW_OP_plus_uconst 0x4]
TMS320C2000 Assembler PC v6.2.5 Wed Sep 27 19:09:55 2017

Tools Copyright (c) 1996-2014 Texas Instruments Incorporated
C:\Users\wmj\AppData\Local\Temp\0231210                              PAGE  203

   10573                      .dwattr $C$DW$1876, DW_AT_accessibility(DW_ACCESS_public)
   10574              $C$DW$1877      .dwtag  DW_TAG_member
   10575                      .dwattr $C$DW$1877, DW_AT_type(*$C$DW$T$23)
   10576                      .dwattr $C$DW$1877, DW_AT_name("FACTIVEWAIT")
   10577                      .dwattr $C$DW$1877, DW_AT_TI_symbol_name("_FACTIVEWAIT")
   10578                      .dwattr $C$DW$1877, DW_AT_data_member_location[DW_OP_plus_uconst 0x5]
   10579                      .dwattr $C$DW$1877, DW_AT_accessibility(DW_ACCESS_public)
   10580              $C$DW$1878      .dwtag  DW_TAG_member
   10581                      .dwattr $C$DW$1878, DW_AT_type(*$C$DW$T$23)
   10582                      .dwattr $C$DW$1878, DW_AT_name("FBANKWAIT")
   10583                      .dwattr $C$DW$1878, DW_AT_TI_symbol_name("_FBANKWAIT")
   10584                      .dwattr $C$DW$1878, DW_AT_data_member_location[DW_OP_plus_uconst 0x6]
   10585                      .dwattr $C$DW$1878, DW_AT_accessibility(DW_ACCESS_public)
   10586              $C$DW$1879      .dwtag  DW_TAG_member
   10587                      .dwattr $C$DW$1879, DW_AT_type(*$C$DW$T$23)
   10588                      .dwattr $C$DW$1879, DW_AT_name("FOTPWAIT")
   10589                      .dwattr $C$DW$1879, DW_AT_TI_symbol_name("_FOTPWAIT")
   10590                      .dwattr $C$DW$1879, DW_AT_data_member_location[DW_OP_plus_uconst 0x7]
   10591                      .dwattr $C$DW$1879, DW_AT_accessibility(DW_ACCESS_public)
   10592                      .dwendtag $C$DW$T$37
   10593              
   10594              $C$DW$T$56      .dwtag  DW_TAG_pointer_type
   10595                      .dwattr $C$DW$T$56, DW_AT_type(*$C$DW$T$37)
   10596                      .dwattr $C$DW$T$56, DW_AT_address_class(0x16)
   10597              $C$DW$T$57      .dwtag  DW_TAG_typedef, DW_AT_name("FLASH_Handle")
   10598                      .dwattr $C$DW$T$57, DW_AT_type(*$C$DW$T$56)
   10599                      .dwattr $C$DW$T$57, DW_AT_language(DW_LANG_C)
   10600              
   10601              $C$DW$T$42      .dwtag  DW_TAG_structure_type
   10602                      .dwattr $C$DW$T$42, DW_AT_name("_GPIO_Obj_")
   10603                      .dwattr $C$DW$T$42, DW_AT_byte_size(0x6a)
   10604              $C$DW$1880      .dwtag  DW_TAG_member
   10605                      .dwattr $C$DW$1880, DW_AT_type(*$C$DW$T$39)
   10606                      .dwattr $C$DW$1880, DW_AT_name("GPACTRL")
   10607                      .dwattr $C$DW$1880, DW_AT_TI_symbol_name("_GPACTRL")
   10608                      .dwattr $C$DW$1880, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
   10609                      .dwattr $C$DW$1880, DW_AT_accessibility(DW_ACCESS_public)
   10610              $C$DW$1881      .dwtag  DW_TAG_member
   10611                      .dwattr $C$DW$1881, DW_AT_type(*$C$DW$T$39)
   10612                      .dwattr $C$DW$1881, DW_AT_name("GPAQSEL1")
   10613                      .dwattr $C$DW$1881, DW_AT_TI_symbol_name("_GPAQSEL1")
   10614                      .dwattr $C$DW$1881, DW_AT_data_member_location[DW_OP_plus_uconst 0x2]
   10615                      .dwattr $C$DW$1881, DW_AT_accessibility(DW_ACCESS_public)
   10616              $C$DW$1882      .dwtag  DW_TAG_member
   10617                      .dwattr $C$DW$1882, DW_AT_type(*$C$DW$T$39)
   10618                      .dwattr $C$DW$1882, DW_AT_name("GPAQSEL2")
   10619                      .dwattr $C$DW$1882, DW_AT_TI_symbol_name("_GPAQSEL2")
   10620                      .dwattr $C$DW$1882, DW_AT_data_member_location[DW_OP_plus_uconst 0x4]
   10621                      .dwattr $C$DW$1882, DW_AT_accessibility(DW_ACCESS_public)
   10622              $C$DW$1883      .dwtag  DW_TAG_member
   10623                      .dwattr $C$DW$1883, DW_AT_type(*$C$DW$T$39)
   10624                      .dwattr $C$DW$1883, DW_AT_name("GPAMUX1")
   10625                      .dwattr $C$DW$1883, DW_AT_TI_symbol_name("_GPAMUX1")
   10626                      .dwattr $C$DW$1883, DW_AT_data_member_location[DW_OP_plus_uconst 0x6]
   10627                      .dwattr $C$DW$1883, DW_AT_accessibility(DW_ACCESS_public)
TMS320C2000 Assembler PC v6.2.5 Wed Sep 27 19:09:55 2017

Tools Copyright (c) 1996-2014 Texas Instruments Incorporated
C:\Users\wmj\AppData\Local\Temp\0231210                              PAGE  204

   10628              $C$DW$1884      .dwtag  DW_TAG_member
   10629                      .dwattr $C$DW$1884, DW_AT_type(*$C$DW$T$39)
   10630                      .dwattr $C$DW$1884, DW_AT_name("GPAMUX2")
   10631                      .dwattr $C$DW$1884, DW_AT_TI_symbol_name("_GPAMUX2")
   10632                      .dwattr $C$DW$1884, DW_AT_data_member_location[DW_OP_plus_uconst 0x8]
   10633                      .dwattr $C$DW$1884, DW_AT_accessibility(DW_ACCESS_public)
   10634              $C$DW$1885      .dwtag  DW_TAG_member
   10635                      .dwattr $C$DW$1885, DW_AT_type(*$C$DW$T$39)
   10636                      .dwattr $C$DW$1885, DW_AT_name("GPADIR")
   10637                      .dwattr $C$DW$1885, DW_AT_TI_symbol_name("_GPADIR")
   10638                      .dwattr $C$DW$1885, DW_AT_data_member_location[DW_OP_plus_uconst 0xa]
   10639                      .dwattr $C$DW$1885, DW_AT_accessibility(DW_ACCESS_public)
   10640              $C$DW$1886      .dwtag  DW_TAG_member
   10641                      .dwattr $C$DW$1886, DW_AT_type(*$C$DW$T$39)
   10642                      .dwattr $C$DW$1886, DW_AT_name("GPAPUD")
   10643                      .dwattr $C$DW$1886, DW_AT_TI_symbol_name("_GPAPUD")
   10644                      .dwattr $C$DW$1886, DW_AT_data_member_location[DW_OP_plus_uconst 0xc]
   10645                      .dwattr $C$DW$1886, DW_AT_accessibility(DW_ACCESS_public)
   10646              $C$DW$1887      .dwtag  DW_TAG_member
   10647                      .dwattr $C$DW$1887, DW_AT_type(*$C$DW$T$26)
   10648                      .dwattr $C$DW$1887, DW_AT_name("rsvd_1")
   10649                      .dwattr $C$DW$1887, DW_AT_TI_symbol_name("_rsvd_1")
   10650                      .dwattr $C$DW$1887, DW_AT_data_member_location[DW_OP_plus_uconst 0xe]
   10651                      .dwattr $C$DW$1887, DW_AT_accessibility(DW_ACCESS_public)
   10652              $C$DW$1888      .dwtag  DW_TAG_member
   10653                      .dwattr $C$DW$1888, DW_AT_type(*$C$DW$T$39)
   10654                      .dwattr $C$DW$1888, DW_AT_name("GPBCTRL")
   10655                      .dwattr $C$DW$1888, DW_AT_TI_symbol_name("_GPBCTRL")
   10656                      .dwattr $C$DW$1888, DW_AT_data_member_location[DW_OP_plus_uconst 0x10]
   10657                      .dwattr $C$DW$1888, DW_AT_accessibility(DW_ACCESS_public)
   10658              $C$DW$1889      .dwtag  DW_TAG_member
   10659                      .dwattr $C$DW$1889, DW_AT_type(*$C$DW$T$39)
   10660                      .dwattr $C$DW$1889, DW_AT_name("GPBQSEL1")
   10661                      .dwattr $C$DW$1889, DW_AT_TI_symbol_name("_GPBQSEL1")
   10662                      .dwattr $C$DW$1889, DW_AT_data_member_location[DW_OP_plus_uconst 0x12]
   10663                      .dwattr $C$DW$1889, DW_AT_accessibility(DW_ACCESS_public)
   10664              $C$DW$1890      .dwtag  DW_TAG_member
   10665                      .dwattr $C$DW$1890, DW_AT_type(*$C$DW$T$26)
   10666                      .dwattr $C$DW$1890, DW_AT_name("rsvd_2")
   10667                      .dwattr $C$DW$1890, DW_AT_TI_symbol_name("_rsvd_2")
   10668                      .dwattr $C$DW$1890, DW_AT_data_member_location[DW_OP_plus_uconst 0x14]
   10669                      .dwattr $C$DW$1890, DW_AT_accessibility(DW_ACCESS_public)
   10670              $C$DW$1891      .dwtag  DW_TAG_member
   10671                      .dwattr $C$DW$1891, DW_AT_type(*$C$DW$T$39)
   10672                      .dwattr $C$DW$1891, DW_AT_name("GPBMUX1")
   10673                      .dwattr $C$DW$1891, DW_AT_TI_symbol_name("_GPBMUX1")
   10674                      .dwattr $C$DW$1891, DW_AT_data_member_location[DW_OP_plus_uconst 0x16]
   10675                      .dwattr $C$DW$1891, DW_AT_accessibility(DW_ACCESS_public)
   10676              $C$DW$1892      .dwtag  DW_TAG_member
   10677                      .dwattr $C$DW$1892, DW_AT_type(*$C$DW$T$26)
   10678                      .dwattr $C$DW$1892, DW_AT_name("rsvd_3")
   10679                      .dwattr $C$DW$1892, DW_AT_TI_symbol_name("_rsvd_3")
   10680                      .dwattr $C$DW$1892, DW_AT_data_member_location[DW_OP_plus_uconst 0x18]
   10681                      .dwattr $C$DW$1892, DW_AT_accessibility(DW_ACCESS_public)
   10682              $C$DW$1893      .dwtag  DW_TAG_member
TMS320C2000 Assembler PC v6.2.5 Wed Sep 27 19:09:55 2017

Tools Copyright (c) 1996-2014 Texas Instruments Incorporated
C:\Users\wmj\AppData\Local\Temp\0231210                              PAGE  205

   10683                      .dwattr $C$DW$1893, DW_AT_type(*$C$DW$T$39)
   10684                      .dwattr $C$DW$1893, DW_AT_name("GPBDIR")
   10685                      .dwattr $C$DW$1893, DW_AT_TI_symbol_name("_GPBDIR")
   10686                      .dwattr $C$DW$1893, DW_AT_data_member_location[DW_OP_plus_uconst 0x1a]
   10687                      .dwattr $C$DW$1893, DW_AT_accessibility(DW_ACCESS_public)
   10688              $C$DW$1894      .dwtag  DW_TAG_member
   10689                      .dwattr $C$DW$1894, DW_AT_type(*$C$DW$T$39)
   10690                      .dwattr $C$DW$1894, DW_AT_name("GPBPUD")
   10691                      .dwattr $C$DW$1894, DW_AT_TI_symbol_name("_GPBPUD")
   10692                      .dwattr $C$DW$1894, DW_AT_data_member_location[DW_OP_plus_uconst 0x1c]
   10693                      .dwattr $C$DW$1894, DW_AT_accessibility(DW_ACCESS_public)
   10694              $C$DW$1895      .dwtag  DW_TAG_member
   10695                      .dwattr $C$DW$1895, DW_AT_type(*$C$DW$T$40)
   10696                      .dwattr $C$DW$1895, DW_AT_name("rsvd_4")
   10697                      .dwattr $C$DW$1895, DW_AT_TI_symbol_name("_rsvd_4")
   10698                      .dwattr $C$DW$1895, DW_AT_data_member_location[DW_OP_plus_uconst 0x1e]
   10699                      .dwattr $C$DW$1895, DW_AT_accessibility(DW_ACCESS_public)
   10700              $C$DW$1896      .dwtag  DW_TAG_member
   10701                      .dwattr $C$DW$1896, DW_AT_type(*$C$DW$T$39)
   10702                      .dwattr $C$DW$1896, DW_AT_name("AIOMUX1")
   10703                      .dwattr $C$DW$1896, DW_AT_TI_symbol_name("_AIOMUX1")
   10704                      .dwattr $C$DW$1896, DW_AT_data_member_location[DW_OP_plus_uconst 0x36]
   10705                      .dwattr $C$DW$1896, DW_AT_accessibility(DW_ACCESS_public)
   10706              $C$DW$1897      .dwtag  DW_TAG_member
   10707                      .dwattr $C$DW$1897, DW_AT_type(*$C$DW$T$26)
   10708                      .dwattr $C$DW$1897, DW_AT_name("rsvd_5")
   10709                      .dwattr $C$DW$1897, DW_AT_TI_symbol_name("_rsvd_5")
   10710                      .dwattr $C$DW$1897, DW_AT_data_member_location[DW_OP_plus_uconst 0x38]
   10711                      .dwattr $C$DW$1897, DW_AT_accessibility(DW_ACCESS_public)
   10712              $C$DW$1898      .dwtag  DW_TAG_member
   10713                      .dwattr $C$DW$1898, DW_AT_type(*$C$DW$T$39)
   10714                      .dwattr $C$DW$1898, DW_AT_name("AIODIR")
   10715                      .dwattr $C$DW$1898, DW_AT_TI_symbol_name("_AIODIR")
   10716                      .dwattr $C$DW$1898, DW_AT_data_member_location[DW_OP_plus_uconst 0x3a]
   10717                      .dwattr $C$DW$1898, DW_AT_accessibility(DW_ACCESS_public)
   10718              $C$DW$1899      .dwtag  DW_TAG_member
   10719                      .dwattr $C$DW$1899, DW_AT_type(*$C$DW$T$41)
   10720                      .dwattr $C$DW$1899, DW_AT_name("rsvd_6")
   10721                      .dwattr $C$DW$1899, DW_AT_TI_symbol_name("_rsvd_6")
   10722                      .dwattr $C$DW$1899, DW_AT_data_member_location[DW_OP_plus_uconst 0x3c]
   10723                      .dwattr $C$DW$1899, DW_AT_accessibility(DW_ACCESS_public)
   10724              $C$DW$1900      .dwtag  DW_TAG_member
   10725                      .dwattr $C$DW$1900, DW_AT_type(*$C$DW$T$39)
   10726                      .dwattr $C$DW$1900, DW_AT_name("GPADAT")
   10727                      .dwattr $C$DW$1900, DW_AT_TI_symbol_name("_GPADAT")
   10728                      .dwattr $C$DW$1900, DW_AT_data_member_location[DW_OP_plus_uconst 0x40]
   10729                      .dwattr $C$DW$1900, DW_AT_accessibility(DW_ACCESS_public)
   10730              $C$DW$1901      .dwtag  DW_TAG_member
   10731                      .dwattr $C$DW$1901, DW_AT_type(*$C$DW$T$39)
   10732                      .dwattr $C$DW$1901, DW_AT_name("GPASET")
   10733                      .dwattr $C$DW$1901, DW_AT_TI_symbol_name("_GPASET")
   10734                      .dwattr $C$DW$1901, DW_AT_data_member_location[DW_OP_plus_uconst 0x42]
   10735                      .dwattr $C$DW$1901, DW_AT_accessibility(DW_ACCESS_public)
   10736              $C$DW$1902      .dwtag  DW_TAG_member
   10737                      .dwattr $C$DW$1902, DW_AT_type(*$C$DW$T$39)
TMS320C2000 Assembler PC v6.2.5 Wed Sep 27 19:09:55 2017

Tools Copyright (c) 1996-2014 Texas Instruments Incorporated
C:\Users\wmj\AppData\Local\Temp\0231210                              PAGE  206

   10738                      .dwattr $C$DW$1902, DW_AT_name("GPACLEAR")
   10739                      .dwattr $C$DW$1902, DW_AT_TI_symbol_name("_GPACLEAR")
   10740                      .dwattr $C$DW$1902, DW_AT_data_member_location[DW_OP_plus_uconst 0x44]
   10741                      .dwattr $C$DW$1902, DW_AT_accessibility(DW_ACCESS_public)
   10742              $C$DW$1903      .dwtag  DW_TAG_member
   10743                      .dwattr $C$DW$1903, DW_AT_type(*$C$DW$T$39)
   10744                      .dwattr $C$DW$1903, DW_AT_name("GPATOGGLE")
   10745                      .dwattr $C$DW$1903, DW_AT_TI_symbol_name("_GPATOGGLE")
   10746                      .dwattr $C$DW$1903, DW_AT_data_member_location[DW_OP_plus_uconst 0x46]
   10747                      .dwattr $C$DW$1903, DW_AT_accessibility(DW_ACCESS_public)
   10748              $C$DW$1904      .dwtag  DW_TAG_member
   10749                      .dwattr $C$DW$1904, DW_AT_type(*$C$DW$T$39)
   10750                      .dwattr $C$DW$1904, DW_AT_name("GPBDAT")
   10751                      .dwattr $C$DW$1904, DW_AT_TI_symbol_name("_GPBDAT")
   10752                      .dwattr $C$DW$1904, DW_AT_data_member_location[DW_OP_plus_uconst 0x48]
   10753                      .dwattr $C$DW$1904, DW_AT_accessibility(DW_ACCESS_public)
   10754              $C$DW$1905      .dwtag  DW_TAG_member
   10755                      .dwattr $C$DW$1905, DW_AT_type(*$C$DW$T$39)
   10756                      .dwattr $C$DW$1905, DW_AT_name("GPBSET")
   10757                      .dwattr $C$DW$1905, DW_AT_TI_symbol_name("_GPBSET")
   10758                      .dwattr $C$DW$1905, DW_AT_data_member_location[DW_OP_plus_uconst 0x4a]
   10759                      .dwattr $C$DW$1905, DW_AT_accessibility(DW_ACCESS_public)
   10760              $C$DW$1906      .dwtag  DW_TAG_member
   10761                      .dwattr $C$DW$1906, DW_AT_type(*$C$DW$T$39)
   10762                      .dwattr $C$DW$1906, DW_AT_name("GPBCLEAR")
   10763                      .dwattr $C$DW$1906, DW_AT_TI_symbol_name("_GPBCLEAR")
   10764                      .dwattr $C$DW$1906, DW_AT_data_member_location[DW_OP_plus_uconst 0x4c]
   10765                      .dwattr $C$DW$1906, DW_AT_accessibility(DW_ACCESS_public)
   10766              $C$DW$1907      .dwtag  DW_TAG_member
   10767                      .dwattr $C$DW$1907, DW_AT_type(*$C$DW$T$39)
   10768                      .dwattr $C$DW$1907, DW_AT_name("GPBTOGGLE")
   10769                      .dwattr $C$DW$1907, DW_AT_TI_symbol_name("_GPBTOGGLE")
   10770                      .dwattr $C$DW$1907, DW_AT_data_member_location[DW_OP_plus_uconst 0x4e]
   10771                      .dwattr $C$DW$1907, DW_AT_accessibility(DW_ACCESS_public)
   10772              $C$DW$1908      .dwtag  DW_TAG_member
   10773                      .dwattr $C$DW$1908, DW_AT_type(*$C$DW$T$31)
   10774                      .dwattr $C$DW$1908, DW_AT_name("rsvd_7")
   10775                      .dwattr $C$DW$1908, DW_AT_TI_symbol_name("_rsvd_7")
   10776                      .dwattr $C$DW$1908, DW_AT_data_member_location[DW_OP_plus_uconst 0x50]
   10777                      .dwattr $C$DW$1908, DW_AT_accessibility(DW_ACCESS_public)
   10778              $C$DW$1909      .dwtag  DW_TAG_member
   10779                      .dwattr $C$DW$1909, DW_AT_type(*$C$DW$T$39)
   10780                      .dwattr $C$DW$1909, DW_AT_name("AIODAT")
   10781                      .dwattr $C$DW$1909, DW_AT_TI_symbol_name("_AIODAT")
   10782                      .dwattr $C$DW$1909, DW_AT_data_member_location[DW_OP_plus_uconst 0x58]
   10783                      .dwattr $C$DW$1909, DW_AT_accessibility(DW_ACCESS_public)
   10784              $C$DW$1910      .dwtag  DW_TAG_member
   10785                      .dwattr $C$DW$1910, DW_AT_type(*$C$DW$T$39)
   10786                      .dwattr $C$DW$1910, DW_AT_name("AIOSET")
   10787                      .dwattr $C$DW$1910, DW_AT_TI_symbol_name("_AIOSET")
   10788                      .dwattr $C$DW$1910, DW_AT_data_member_location[DW_OP_plus_uconst 0x5a]
   10789                      .dwattr $C$DW$1910, DW_AT_accessibility(DW_ACCESS_public)
   10790              $C$DW$1911      .dwtag  DW_TAG_member
   10791                      .dwattr $C$DW$1911, DW_AT_type(*$C$DW$T$39)
   10792                      .dwattr $C$DW$1911, DW_AT_name("AIOCLEAR")
TMS320C2000 Assembler PC v6.2.5 Wed Sep 27 19:09:55 2017

Tools Copyright (c) 1996-2014 Texas Instruments Incorporated
C:\Users\wmj\AppData\Local\Temp\0231210                              PAGE  207

   10793                      .dwattr $C$DW$1911, DW_AT_TI_symbol_name("_AIOCLEAR")
   10794                      .dwattr $C$DW$1911, DW_AT_data_member_location[DW_OP_plus_uconst 0x5c]
   10795                      .dwattr $C$DW$1911, DW_AT_accessibility(DW_ACCESS_public)
   10796              $C$DW$1912      .dwtag  DW_TAG_member
   10797                      .dwattr $C$DW$1912, DW_AT_type(*$C$DW$T$39)
   10798                      .dwattr $C$DW$1912, DW_AT_name("AIOTOGGLE")
   10799                      .dwattr $C$DW$1912, DW_AT_TI_symbol_name("_AIOTOGGLE")
   10800                      .dwattr $C$DW$1912, DW_AT_data_member_location[DW_OP_plus_uconst 0x5e]
   10801                      .dwattr $C$DW$1912, DW_AT_accessibility(DW_ACCESS_public)
   10802              $C$DW$1913      .dwtag  DW_TAG_member
   10803                      .dwattr $C$DW$1913, DW_AT_type(*$C$DW$T$28)
   10804                      .dwattr $C$DW$1913, DW_AT_name("GPIOXINTnSEL")
   10805                      .dwattr $C$DW$1913, DW_AT_TI_symbol_name("_GPIOXINTnSEL")
   10806                      .dwattr $C$DW$1913, DW_AT_data_member_location[DW_OP_plus_uconst 0x60]
   10807                      .dwattr $C$DW$1913, DW_AT_accessibility(DW_ACCESS_public)
   10808              $C$DW$1914      .dwtag  DW_TAG_member
   10809                      .dwattr $C$DW$1914, DW_AT_type(*$C$DW$T$27)
   10810                      .dwattr $C$DW$1914, DW_AT_name("rsvd_8")
   10811                      .dwattr $C$DW$1914, DW_AT_TI_symbol_name("_rsvd_8")
   10812                      .dwattr $C$DW$1914, DW_AT_data_member_location[DW_OP_plus_uconst 0x63]
   10813                      .dwattr $C$DW$1914, DW_AT_accessibility(DW_ACCESS_public)
   10814              $C$DW$1915      .dwtag  DW_TAG_member
   10815                      .dwattr $C$DW$1915, DW_AT_type(*$C$DW$T$39)
   10816                      .dwattr $C$DW$1915, DW_AT_name("GPIOLPMSEL")
   10817                      .dwattr $C$DW$1915, DW_AT_TI_symbol_name("_GPIOLPMSEL")
   10818                      .dwattr $C$DW$1915, DW_AT_data_member_location[DW_OP_plus_uconst 0x68]
   10819                      .dwattr $C$DW$1915, DW_AT_accessibility(DW_ACCESS_public)
   10820                      .dwendtag $C$DW$T$42
   10821              
   10822              $C$DW$T$58      .dwtag  DW_TAG_pointer_type
   10823                      .dwattr $C$DW$T$58, DW_AT_type(*$C$DW$T$42)
   10824                      .dwattr $C$DW$T$58, DW_AT_address_class(0x16)
   10825              $C$DW$T$59      .dwtag  DW_TAG_typedef, DW_AT_name("GPIO_Handle")
   10826                      .dwattr $C$DW$T$59, DW_AT_type(*$C$DW$T$58)
   10827                      .dwattr $C$DW$T$59, DW_AT_language(DW_LANG_C)
   10828              
   10829              $C$DW$T$44      .dwtag  DW_TAG_structure_type
   10830                      .dwattr $C$DW$T$44, DW_AT_name("_HAL_AdcData_t_")
   10831                      .dwattr $C$DW$T$44, DW_AT_byte_size(0x16)
   10832              $C$DW$1916      .dwtag  DW_TAG_member
   10833                      .dwattr $C$DW$1916, DW_AT_type(*$C$DW$T$43)
   10834                      .dwattr $C$DW$1916, DW_AT_name("I")
   10835                      .dwattr $C$DW$1916, DW_AT_TI_symbol_name("_I")
   10836                      .dwattr $C$DW$1916, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
   10837                      .dwattr $C$DW$1916, DW_AT_accessibility(DW_ACCESS_public)
   10838              $C$DW$1917      .dwtag  DW_TAG_member
   10839                      .dwattr $C$DW$1917, DW_AT_type(*$C$DW$T$43)
   10840                      .dwattr $C$DW$1917, DW_AT_name("V")
   10841                      .dwattr $C$DW$1917, DW_AT_TI_symbol_name("_V")
   10842                      .dwattr $C$DW$1917, DW_AT_data_member_location[DW_OP_plus_uconst 0x6]
   10843                      .dwattr $C$DW$1917, DW_AT_accessibility(DW_ACCESS_public)
   10844              $C$DW$1918      .dwtag  DW_TAG_member
   10845                      .dwattr $C$DW$1918, DW_AT_type(*$C$DW$T$35)
   10846                      .dwattr $C$DW$1918, DW_AT_name("dcBus")
   10847                      .dwattr $C$DW$1918, DW_AT_TI_symbol_name("_dcBus")
TMS320C2000 Assembler PC v6.2.5 Wed Sep 27 19:09:55 2017

Tools Copyright (c) 1996-2014 Texas Instruments Incorporated
C:\Users\wmj\AppData\Local\Temp\0231210                              PAGE  208

   10848                      .dwattr $C$DW$1918, DW_AT_data_member_location[DW_OP_plus_uconst 0xc]
   10849                      .dwattr $C$DW$1918, DW_AT_accessibility(DW_ACCESS_public)
   10850              $C$DW$1919      .dwtag  DW_TAG_member
   10851                      .dwattr $C$DW$1919, DW_AT_type(*$C$DW$T$35)
   10852                      .dwattr $C$DW$1919, DW_AT_name("analogSensor1")
   10853                      .dwattr $C$DW$1919, DW_AT_TI_symbol_name("_analogSensor1")
   10854                      .dwattr $C$DW$1919, DW_AT_data_member_location[DW_OP_plus_uconst 0xe]
   10855                      .dwattr $C$DW$1919, DW_AT_accessibility(DW_ACCESS_public)
   10856              $C$DW$1920      .dwtag  DW_TAG_member
   10857                      .dwattr $C$DW$1920, DW_AT_type(*$C$DW$T$35)
   10858                      .dwattr $C$DW$1920, DW_AT_name("analogSensor2")
   10859                      .dwattr $C$DW$1920, DW_AT_TI_symbol_name("_analogSensor2")
   10860                      .dwattr $C$DW$1920, DW_AT_data_member_location[DW_OP_plus_uconst 0x10]
   10861                      .dwattr $C$DW$1920, DW_AT_accessibility(DW_ACCESS_public)
   10862              $C$DW$1921      .dwtag  DW_TAG_member
   10863                      .dwattr $C$DW$1921, DW_AT_type(*$C$DW$T$35)
   10864                      .dwattr $C$DW$1921, DW_AT_name("igbtNTC")
   10865                      .dwattr $C$DW$1921, DW_AT_TI_symbol_name("_igbtNTC")
   10866                      .dwattr $C$DW$1921, DW_AT_data_member_location[DW_OP_plus_uconst 0x12]
   10867                      .dwattr $C$DW$1921, DW_AT_accessibility(DW_ACCESS_public)
   10868              $C$DW$1922      .dwtag  DW_TAG_member
   10869                      .dwattr $C$DW$1922, DW_AT_type(*$C$DW$T$35)
   10870                      .dwattr $C$DW$1922, DW_AT_name("boardAddr")
   10871                      .dwattr $C$DW$1922, DW_AT_TI_symbol_name("_boardAddr")
   10872                      .dwattr $C$DW$1922, DW_AT_data_member_location[DW_OP_plus_uconst 0x14]
   10873                      .dwattr $C$DW$1922, DW_AT_accessibility(DW_ACCESS_public)
   10874                      .dwendtag $C$DW$T$44
   10875              
   10876              $C$DW$T$87      .dwtag  DW_TAG_typedef, DW_AT_name("HAL_AdcData_t")
   10877                      .dwattr $C$DW$T$87, DW_AT_type(*$C$DW$T$44)
   10878                      .dwattr $C$DW$T$87, DW_AT_language(DW_LANG_C)
   10879              
   10880              $C$DW$T$49      .dwtag  DW_TAG_structure_type
   10881                      .dwattr $C$DW$T$49, DW_AT_name("_HAL_DacData_t_")
   10882                      .dwattr $C$DW$T$49, DW_AT_byte_size(0x22)
   10883              $C$DW$1923      .dwtag  DW_TAG_member
   10884                      .dwattr $C$DW$1923, DW_AT_type(*$C$DW$T$22)
   10885                      .dwattr $C$DW$1923, DW_AT_name("PeriodMax")
   10886                      .dwattr $C$DW$1923, DW_AT_TI_symbol_name("_PeriodMax")
   10887                      .dwattr $C$DW$1923, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
   10888                      .dwattr $C$DW$1923, DW_AT_accessibility(DW_ACCESS_public)
   10889              $C$DW$1924      .dwtag  DW_TAG_member
   10890                      .dwattr $C$DW$1924, DW_AT_type(*$C$DW$T$47)
   10891                      .dwattr $C$DW$1924, DW_AT_name("ptrData")
   10892                      .dwattr $C$DW$1924, DW_AT_TI_symbol_name("_ptrData")
   10893                      .dwattr $C$DW$1924, DW_AT_data_member_location[DW_OP_plus_uconst 0x2]
   10894                      .dwattr $C$DW$1924, DW_AT_accessibility(DW_ACCESS_public)
   10895              $C$DW$1925      .dwtag  DW_TAG_member
   10896                      .dwattr $C$DW$1925, DW_AT_type(*$C$DW$T$48)
   10897                      .dwattr $C$DW$1925, DW_AT_name("value")
   10898                      .dwattr $C$DW$1925, DW_AT_TI_symbol_name("_value")
   10899                      .dwattr $C$DW$1925, DW_AT_data_member_location[DW_OP_plus_uconst 0xa]
   10900                      .dwattr $C$DW$1925, DW_AT_accessibility(DW_ACCESS_public)
   10901              $C$DW$1926      .dwtag  DW_TAG_member
   10902                      .dwattr $C$DW$1926, DW_AT_type(*$C$DW$T$48)
TMS320C2000 Assembler PC v6.2.5 Wed Sep 27 19:09:55 2017

Tools Copyright (c) 1996-2014 Texas Instruments Incorporated
C:\Users\wmj\AppData\Local\Temp\0231210                              PAGE  209

   10903                      .dwattr $C$DW$1926, DW_AT_name("offset")
   10904                      .dwattr $C$DW$1926, DW_AT_TI_symbol_name("_offset")
   10905                      .dwattr $C$DW$1926, DW_AT_data_member_location[DW_OP_plus_uconst 0x12]
   10906                      .dwattr $C$DW$1926, DW_AT_accessibility(DW_ACCESS_public)
   10907              $C$DW$1927      .dwtag  DW_TAG_member
   10908                      .dwattr $C$DW$1927, DW_AT_type(*$C$DW$T$48)
   10909                      .dwattr $C$DW$1927, DW_AT_name("gain")
   10910                      .dwattr $C$DW$1927, DW_AT_TI_symbol_name("_gain")
   10911                      .dwattr $C$DW$1927, DW_AT_data_member_location[DW_OP_plus_uconst 0x1a]
   10912                      .dwattr $C$DW$1927, DW_AT_accessibility(DW_ACCESS_public)
   10913                      .dwendtag $C$DW$T$49
   10914              
   10915              $C$DW$T$350     .dwtag  DW_TAG_typedef, DW_AT_name("HAL_DacData_t")
   10916                      .dwattr $C$DW$T$350, DW_AT_type(*$C$DW$T$49)
   10917                      .dwattr $C$DW$T$350, DW_AT_language(DW_LANG_C)
   10918              $C$DW$T$351     .dwtag  DW_TAG_pointer_type
   10919                      .dwattr $C$DW$T$351, DW_AT_type(*$C$DW$T$350)
   10920                      .dwattr $C$DW$T$351, DW_AT_address_class(0x16)
   10921              $C$DW$1928      .dwtag  DW_TAG_TI_far_type
   10922                      .dwattr $C$DW$1928, DW_AT_type(*$C$DW$T$351)
   10923              $C$DW$T$352     .dwtag  DW_TAG_const_type
   10924                      .dwattr $C$DW$T$352, DW_AT_type(*$C$DW$1928)
   10925              
   10926              $C$DW$T$90      .dwtag  DW_TAG_structure_type
   10927                      .dwattr $C$DW$T$90, DW_AT_name("_HAL_Obj_")
   10928                      .dwattr $C$DW$T$90, DW_AT_byte_size(0xb6)
   10929              $C$DW$1929      .dwtag  DW_TAG_member
   10930                      .dwattr $C$DW$1929, DW_AT_type(*$C$DW$T$51)
   10931                      .dwattr $C$DW$1929, DW_AT_name("adcHandle")
   10932                      .dwattr $C$DW$1929, DW_AT_TI_symbol_name("_adcHandle")
   10933                      .dwattr $C$DW$1929, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
   10934                      .dwattr $C$DW$1929, DW_AT_accessibility(DW_ACCESS_public)
   10935              $C$DW$1930      .dwtag  DW_TAG_member
   10936                      .dwattr $C$DW$1930, DW_AT_type(*$C$DW$T$53)
   10937                      .dwattr $C$DW$1930, DW_AT_name("clkHandle")
   10938                      .dwattr $C$DW$1930, DW_AT_TI_symbol_name("_clkHandle")
   10939                      .dwattr $C$DW$1930, DW_AT_data_member_location[DW_OP_plus_uconst 0x2]
   10940                      .dwattr $C$DW$1930, DW_AT_accessibility(DW_ACCESS_public)
   10941              $C$DW$1931      .dwtag  DW_TAG_member
   10942                      .dwattr $C$DW$1931, DW_AT_type(*$C$DW$T$55)
   10943                      .dwattr $C$DW$1931, DW_AT_name("cpuHandle")
   10944                      .dwattr $C$DW$1931, DW_AT_TI_symbol_name("_cpuHandle")
   10945                      .dwattr $C$DW$1931, DW_AT_data_member_location[DW_OP_plus_uconst 0x4]
   10946                      .dwattr $C$DW$1931, DW_AT_accessibility(DW_ACCESS_public)
   10947              $C$DW$1932      .dwtag  DW_TAG_member
   10948                      .dwattr $C$DW$1932, DW_AT_type(*$C$DW$T$57)
   10949                      .dwattr $C$DW$1932, DW_AT_name("flashHandle")
   10950                      .dwattr $C$DW$1932, DW_AT_TI_symbol_name("_flashHandle")
   10951                      .dwattr $C$DW$1932, DW_AT_data_member_location[DW_OP_plus_uconst 0x6]
   10952                      .dwattr $C$DW$1932, DW_AT_accessibility(DW_ACCESS_public)
   10953              $C$DW$1933      .dwtag  DW_TAG_member
   10954                      .dwattr $C$DW$1933, DW_AT_type(*$C$DW$T$59)
   10955                      .dwattr $C$DW$1933, DW_AT_name("gpioHandle")
   10956                      .dwattr $C$DW$1933, DW_AT_TI_symbol_name("_gpioHandle")
   10957                      .dwattr $C$DW$1933, DW_AT_data_member_location[DW_OP_plus_uconst 0x8]
TMS320C2000 Assembler PC v6.2.5 Wed Sep 27 19:09:55 2017

Tools Copyright (c) 1996-2014 Texas Instruments Incorporated
C:\Users\wmj\AppData\Local\Temp\0231210                              PAGE  210

   10958                      .dwattr $C$DW$1933, DW_AT_accessibility(DW_ACCESS_public)
   10959              $C$DW$1934      .dwtag  DW_TAG_member
   10960                      .dwattr $C$DW$1934, DW_AT_type(*$C$DW$T$62)
   10961                      .dwattr $C$DW$1934, DW_AT_name("offsetHandle_I")
   10962                      .dwattr $C$DW$1934, DW_AT_TI_symbol_name("_offsetHandle_I")
   10963                      .dwattr $C$DW$1934, DW_AT_data_member_location[DW_OP_plus_uconst 0xa]
   10964                      .dwattr $C$DW$1934, DW_AT_accessibility(DW_ACCESS_public)
   10965              $C$DW$1935      .dwtag  DW_TAG_member
   10966                      .dwattr $C$DW$1935, DW_AT_type(*$C$DW$T$64)
   10967                      .dwattr $C$DW$1935, DW_AT_name("offset_I")
   10968                      .dwattr $C$DW$1935, DW_AT_TI_symbol_name("_offset_I")
   10969                      .dwattr $C$DW$1935, DW_AT_data_member_location[DW_OP_plus_uconst 0x10]
   10970                      .dwattr $C$DW$1935, DW_AT_accessibility(DW_ACCESS_public)
   10971              $C$DW$1936      .dwtag  DW_TAG_member
   10972                      .dwattr $C$DW$1936, DW_AT_type(*$C$DW$T$62)
   10973                      .dwattr $C$DW$1936, DW_AT_name("offsetHandle_V")
   10974                      .dwattr $C$DW$1936, DW_AT_TI_symbol_name("_offsetHandle_V")
   10975                      .dwattr $C$DW$1936, DW_AT_data_member_location[DW_OP_plus_uconst 0x40]
   10976                      .dwattr $C$DW$1936, DW_AT_accessibility(DW_ACCESS_public)
   10977              $C$DW$1937      .dwtag  DW_TAG_member
   10978                      .dwattr $C$DW$1937, DW_AT_type(*$C$DW$T$64)
   10979                      .dwattr $C$DW$1937, DW_AT_name("offset_V")
   10980                      .dwattr $C$DW$1937, DW_AT_TI_symbol_name("_offset_V")
   10981                      .dwattr $C$DW$1937, DW_AT_data_member_location[DW_OP_plus_uconst 0x46]
   10982                      .dwattr $C$DW$1937, DW_AT_accessibility(DW_ACCESS_public)
   10983              $C$DW$1938      .dwtag  DW_TAG_member
   10984                      .dwattr $C$DW$1938, DW_AT_type(*$C$DW$T$66)
   10985                      .dwattr $C$DW$1938, DW_AT_name("oscHandle")
   10986                      .dwattr $C$DW$1938, DW_AT_TI_symbol_name("_oscHandle")
   10987                      .dwattr $C$DW$1938, DW_AT_data_member_location[DW_OP_plus_uconst 0x76]
   10988                      .dwattr $C$DW$1938, DW_AT_accessibility(DW_ACCESS_public)
   10989              $C$DW$1939      .dwtag  DW_TAG_member
   10990                      .dwattr $C$DW$1939, DW_AT_type(*$C$DW$T$68)
   10991                      .dwattr $C$DW$1939, DW_AT_name("pieHandle")
   10992                      .dwattr $C$DW$1939, DW_AT_TI_symbol_name("_pieHandle")
   10993                      .dwattr $C$DW$1939, DW_AT_data_member_location[DW_OP_plus_uconst 0x78]
   10994                      .dwattr $C$DW$1939, DW_AT_accessibility(DW_ACCESS_public)
   10995              $C$DW$1940      .dwtag  DW_TAG_member
   10996                      .dwattr $C$DW$1940, DW_AT_type(*$C$DW$T$70)
   10997                      .dwattr $C$DW$1940, DW_AT_name("pllHandle")
   10998                      .dwattr $C$DW$1940, DW_AT_TI_symbol_name("_pllHandle")
   10999                      .dwattr $C$DW$1940, DW_AT_data_member_location[DW_OP_plus_uconst 0x7a]
   11000                      .dwattr $C$DW$1940, DW_AT_accessibility(DW_ACCESS_public)
   11001              $C$DW$1941      .dwtag  DW_TAG_member
   11002                      .dwattr $C$DW$1941, DW_AT_type(*$C$DW$T$73)
   11003                      .dwattr $C$DW$1941, DW_AT_name("pwmHandle")
   11004                      .dwattr $C$DW$1941, DW_AT_TI_symbol_name("_pwmHandle")
   11005                      .dwattr $C$DW$1941, DW_AT_data_member_location[DW_OP_plus_uconst 0x7c]
   11006                      .dwattr $C$DW$1941, DW_AT_accessibility(DW_ACCESS_public)
   11007              $C$DW$1942      .dwtag  DW_TAG_member
   11008                      .dwattr $C$DW$1942, DW_AT_type(*$C$DW$T$73)
   11009                      .dwattr $C$DW$1942, DW_AT_name("pwmDacHandle")
   11010                      .dwattr $C$DW$1942, DW_AT_TI_symbol_name("_pwmDacHandle")
   11011                      .dwattr $C$DW$1942, DW_AT_data_member_location[DW_OP_plus_uconst 0x82]
   11012                      .dwattr $C$DW$1942, DW_AT_accessibility(DW_ACCESS_public)
TMS320C2000 Assembler PC v6.2.5 Wed Sep 27 19:09:55 2017

Tools Copyright (c) 1996-2014 Texas Instruments Incorporated
C:\Users\wmj\AppData\Local\Temp\0231210                              PAGE  211

   11013              $C$DW$1943      .dwtag  DW_TAG_member
   11014                      .dwattr $C$DW$1943, DW_AT_type(*$C$DW$T$75)
   11015                      .dwattr $C$DW$1943, DW_AT_name("pwrHandle")
   11016                      .dwattr $C$DW$1943, DW_AT_TI_symbol_name("_pwrHandle")
   11017                      .dwattr $C$DW$1943, DW_AT_data_member_location[DW_OP_plus_uconst 0x88]
   11018                      .dwattr $C$DW$1943, DW_AT_accessibility(DW_ACCESS_public)
   11019              $C$DW$1944      .dwtag  DW_TAG_member
   11020                      .dwattr $C$DW$1944, DW_AT_type(*$C$DW$T$78)
   11021                      .dwattr $C$DW$1944, DW_AT_name("timerHandle")
   11022                      .dwattr $C$DW$1944, DW_AT_TI_symbol_name("_timerHandle")
   11023                      .dwattr $C$DW$1944, DW_AT_data_member_location[DW_OP_plus_uconst 0x8a]
   11024                      .dwattr $C$DW$1944, DW_AT_accessibility(DW_ACCESS_public)
   11025              $C$DW$1945      .dwtag  DW_TAG_member
   11026                      .dwattr $C$DW$1945, DW_AT_type(*$C$DW$T$80)
   11027                      .dwattr $C$DW$1945, DW_AT_name("i2cHandle")
   11028                      .dwattr $C$DW$1945, DW_AT_TI_symbol_name("_i2cHandle")
   11029                      .dwattr $C$DW$1945, DW_AT_data_member_location[DW_OP_plus_uconst 0x90]
   11030                      .dwattr $C$DW$1945, DW_AT_accessibility(DW_ACCESS_public)
   11031              $C$DW$1946      .dwtag  DW_TAG_member
   11032                      .dwattr $C$DW$1946, DW_AT_type(*$C$DW$T$82)
   11033                      .dwattr $C$DW$1946, DW_AT_name("spiAHandle")
   11034                      .dwattr $C$DW$1946, DW_AT_TI_symbol_name("_spiAHandle")
   11035                      .dwattr $C$DW$1946, DW_AT_data_member_location[DW_OP_plus_uconst 0x92]
   11036                      .dwattr $C$DW$1946, DW_AT_accessibility(DW_ACCESS_public)
   11037              $C$DW$1947      .dwtag  DW_TAG_member
   11038                      .dwattr $C$DW$1947, DW_AT_type(*$C$DW$T$84)
   11039                      .dwattr $C$DW$1947, DW_AT_name("wdogHandle")
   11040                      .dwattr $C$DW$1947, DW_AT_TI_symbol_name("_wdogHandle")
   11041                      .dwattr $C$DW$1947, DW_AT_data_member_location[DW_OP_plus_uconst 0x94]
   11042                      .dwattr $C$DW$1947, DW_AT_accessibility(DW_ACCESS_public)
   11043              $C$DW$1948      .dwtag  DW_TAG_member
   11044                      .dwattr $C$DW$1948, DW_AT_type(*$C$DW$T$86)
   11045                      .dwattr $C$DW$1948, DW_AT_name("sciHandle")
   11046                      .dwattr $C$DW$1948, DW_AT_TI_symbol_name("_sciHandle")
   11047                      .dwattr $C$DW$1948, DW_AT_data_member_location[DW_OP_plus_uconst 0x96]
   11048                      .dwattr $C$DW$1948, DW_AT_accessibility(DW_ACCESS_public)
   11049              $C$DW$1949      .dwtag  DW_TAG_member
   11050                      .dwattr $C$DW$1949, DW_AT_type(*$C$DW$T$87)
   11051                      .dwattr $C$DW$1949, DW_AT_name("adcBias")
   11052                      .dwattr $C$DW$1949, DW_AT_TI_symbol_name("_adcBias")
   11053                      .dwattr $C$DW$1949, DW_AT_data_member_location[DW_OP_plus_uconst 0x98]
   11054                      .dwattr $C$DW$1949, DW_AT_accessibility(DW_ACCESS_public)
   11055              $C$DW$1950      .dwtag  DW_TAG_member
   11056                      .dwattr $C$DW$1950, DW_AT_type(*$C$DW$T$35)
   11057                      .dwattr $C$DW$1950, DW_AT_name("current_sf")
   11058                      .dwattr $C$DW$1950, DW_AT_TI_symbol_name("_current_sf")
   11059                      .dwattr $C$DW$1950, DW_AT_data_member_location[DW_OP_plus_uconst 0xae]
   11060                      .dwattr $C$DW$1950, DW_AT_accessibility(DW_ACCESS_public)
   11061              $C$DW$1951      .dwtag  DW_TAG_member
   11062                      .dwattr $C$DW$1951, DW_AT_type(*$C$DW$T$35)
   11063                      .dwattr $C$DW$1951, DW_AT_name("voltage_sf")
   11064                      .dwattr $C$DW$1951, DW_AT_TI_symbol_name("_voltage_sf")
   11065                      .dwattr $C$DW$1951, DW_AT_data_member_location[DW_OP_plus_uconst 0xb0]
   11066                      .dwattr $C$DW$1951, DW_AT_accessibility(DW_ACCESS_public)
   11067              $C$DW$1952      .dwtag  DW_TAG_member
TMS320C2000 Assembler PC v6.2.5 Wed Sep 27 19:09:55 2017

Tools Copyright (c) 1996-2014 Texas Instruments Incorporated
C:\Users\wmj\AppData\Local\Temp\0231210                              PAGE  212

   11068                      .dwattr $C$DW$1952, DW_AT_type(*$C$DW$T$33)
   11069                      .dwattr $C$DW$1952, DW_AT_name("numCurrentSensors")
   11070                      .dwattr $C$DW$1952, DW_AT_TI_symbol_name("_numCurrentSensors")
   11071                      .dwattr $C$DW$1952, DW_AT_data_member_location[DW_OP_plus_uconst 0xb2]
   11072                      .dwattr $C$DW$1952, DW_AT_accessibility(DW_ACCESS_public)
   11073              $C$DW$1953      .dwtag  DW_TAG_member
   11074                      .dwattr $C$DW$1953, DW_AT_type(*$C$DW$T$33)
   11075                      .dwattr $C$DW$1953, DW_AT_name("numVoltageSensors")
   11076                      .dwattr $C$DW$1953, DW_AT_TI_symbol_name("_numVoltageSensors")
   11077                      .dwattr $C$DW$1953, DW_AT_data_member_location[DW_OP_plus_uconst 0xb3]
   11078                      .dwattr $C$DW$1953, DW_AT_accessibility(DW_ACCESS_public)
   11079              $C$DW$1954      .dwtag  DW_TAG_member
   11080                      .dwattr $C$DW$1954, DW_AT_type(*$C$DW$T$89)
   11081                      .dwattr $C$DW$1954, DW_AT_name("boardAddress")
   11082                      .dwattr $C$DW$1954, DW_AT_TI_symbol_name("_boardAddress")
   11083                      .dwattr $C$DW$1954, DW_AT_data_member_location[DW_OP_plus_uconst 0xb4]
   11084                      .dwattr $C$DW$1954, DW_AT_accessibility(DW_ACCESS_public)
   11085                      .dwendtag $C$DW$T$90
   11086              
   11087              $C$DW$T$355     .dwtag  DW_TAG_typedef, DW_AT_name("HAL_Obj")
   11088                      .dwattr $C$DW$T$355, DW_AT_type(*$C$DW$T$90)
   11089                      .dwattr $C$DW$T$355, DW_AT_language(DW_LANG_C)
   11090              $C$DW$T$356     .dwtag  DW_TAG_pointer_type
   11091                      .dwattr $C$DW$T$356, DW_AT_type(*$C$DW$T$355)
   11092                      .dwattr $C$DW$T$356, DW_AT_address_class(0x16)
   11093              $C$DW$T$357     .dwtag  DW_TAG_pointer_type
   11094                      .dwattr $C$DW$T$357, DW_AT_type(*$C$DW$T$90)
   11095                      .dwattr $C$DW$T$357, DW_AT_address_class(0x16)
   11096              $C$DW$T$358     .dwtag  DW_TAG_typedef, DW_AT_name("HAL_Handle")
   11097                      .dwattr $C$DW$T$358, DW_AT_type(*$C$DW$T$357)
   11098                      .dwattr $C$DW$T$358, DW_AT_language(DW_LANG_C)
   11099              $C$DW$1955      .dwtag  DW_TAG_TI_far_type
   11100                      .dwattr $C$DW$1955, DW_AT_type(*$C$DW$T$358)
   11101              $C$DW$T$359     .dwtag  DW_TAG_const_type
   11102                      .dwattr $C$DW$T$359, DW_AT_type(*$C$DW$1955)
   11103              
   11104              $C$DW$T$92      .dwtag  DW_TAG_structure_type
   11105                      .dwattr $C$DW$T$92, DW_AT_name("_MATH_vec3_")
   11106                      .dwattr $C$DW$T$92, DW_AT_byte_size(0x06)
   11107              $C$DW$1956      .dwtag  DW_TAG_member
   11108                      .dwattr $C$DW$1956, DW_AT_type(*$C$DW$T$91)
   11109                      .dwattr $C$DW$1956, DW_AT_name("value")
   11110                      .dwattr $C$DW$1956, DW_AT_TI_symbol_name("_value")
   11111                      .dwattr $C$DW$1956, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
   11112                      .dwattr $C$DW$1956, DW_AT_accessibility(DW_ACCESS_public)
   11113                      .dwendtag $C$DW$T$92
   11114              
   11115              $C$DW$T$43      .dwtag  DW_TAG_typedef, DW_AT_name("MATH_vec3")
   11116                      .dwattr $C$DW$T$43, DW_AT_type(*$C$DW$T$92)
   11117                      .dwattr $C$DW$T$43, DW_AT_language(DW_LANG_C)
   11118              
   11119              $C$DW$T$96      .dwtag  DW_TAG_structure_type
   11120                      .dwattr $C$DW$T$96, DW_AT_name("_OFFSET_")
   11121                      .dwattr $C$DW$T$96, DW_AT_byte_size(0x10)
   11122              $C$DW$1957      .dwtag  DW_TAG_member
TMS320C2000 Assembler PC v6.2.5 Wed Sep 27 19:09:55 2017

Tools Copyright (c) 1996-2014 Texas Instruments Incorporated
C:\Users\wmj\AppData\Local\Temp\0231210                              PAGE  213

   11123                      .dwattr $C$DW$1957, DW_AT_type(*$C$DW$T$35)
   11124                      .dwattr $C$DW$1957, DW_AT_name("value")
   11125                      .dwattr $C$DW$1957, DW_AT_TI_symbol_name("_value")
   11126                      .dwattr $C$DW$1957, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
   11127                      .dwattr $C$DW$1957, DW_AT_accessibility(DW_ACCESS_public)
   11128              $C$DW$1958      .dwtag  DW_TAG_member
   11129                      .dwattr $C$DW$1958, DW_AT_type(*$C$DW$T$35)
   11130                      .dwattr $C$DW$1958, DW_AT_name("bias")
   11131                      .dwattr $C$DW$1958, DW_AT_TI_symbol_name("_bias")
   11132                      .dwattr $C$DW$1958, DW_AT_data_member_location[DW_OP_plus_uconst 0x2]
   11133                      .dwattr $C$DW$1958, DW_AT_accessibility(DW_ACCESS_public)
   11134              $C$DW$1959      .dwtag  DW_TAG_member
   11135                      .dwattr $C$DW$1959, DW_AT_type(*$C$DW$T$93)
   11136                      .dwattr $C$DW$1959, DW_AT_name("filter")
   11137                      .dwattr $C$DW$1959, DW_AT_TI_symbol_name("_filter")
   11138                      .dwattr $C$DW$1959, DW_AT_data_member_location[DW_OP_plus_uconst 0x4]
   11139                      .dwattr $C$DW$1959, DW_AT_accessibility(DW_ACCESS_public)
   11140              $C$DW$1960      .dwtag  DW_TAG_member
   11141                      .dwattr $C$DW$1960, DW_AT_type(*$C$DW$T$95)
   11142                      .dwattr $C$DW$1960, DW_AT_name("filterHandle")
   11143                      .dwattr $C$DW$1960, DW_AT_TI_symbol_name("_filterHandle")
   11144                      .dwattr $C$DW$1960, DW_AT_data_member_location[DW_OP_plus_uconst 0xe]
   11145                      .dwattr $C$DW$1960, DW_AT_accessibility(DW_ACCESS_public)
   11146                      .dwendtag $C$DW$T$96
   11147              
   11148              $C$DW$T$63      .dwtag  DW_TAG_typedef, DW_AT_name("OFFSET_Obj")
   11149                      .dwattr $C$DW$T$63, DW_AT_type(*$C$DW$T$96)
   11150                      .dwattr $C$DW$T$63, DW_AT_language(DW_LANG_C)
   11151              
   11152              $C$DW$T$64      .dwtag  DW_TAG_array_type
   11153                      .dwattr $C$DW$T$64, DW_AT_type(*$C$DW$T$63)
   11154                      .dwattr $C$DW$T$64, DW_AT_language(DW_LANG_C)
   11155                      .dwattr $C$DW$T$64, DW_AT_byte_size(0x30)
   11156              $C$DW$1961      .dwtag  DW_TAG_subrange_type
   11157                      .dwattr $C$DW$1961, DW_AT_upper_bound(0x02)
   11158                      .dwendtag $C$DW$T$64
   11159              
   11160              
   11161              $C$DW$T$21      .dwtag  DW_TAG_structure_type
   11162                      .dwattr $C$DW$T$21, DW_AT_name("_OFFSET_Obj_")
   11163                      .dwattr $C$DW$T$21, DW_AT_declaration
   11164                      .dwendtag $C$DW$T$21
   11165              
   11166              $C$DW$T$60      .dwtag  DW_TAG_pointer_type
   11167                      .dwattr $C$DW$T$60, DW_AT_type(*$C$DW$T$21)
   11168                      .dwattr $C$DW$T$60, DW_AT_address_class(0x16)
   11169              $C$DW$T$61      .dwtag  DW_TAG_typedef, DW_AT_name("OFFSET_Handle")
   11170                      .dwattr $C$DW$T$61, DW_AT_type(*$C$DW$T$60)
   11171                      .dwattr $C$DW$T$61, DW_AT_language(DW_LANG_C)
   11172              
   11173              $C$DW$T$62      .dwtag  DW_TAG_array_type
   11174                      .dwattr $C$DW$T$62, DW_AT_type(*$C$DW$T$61)
   11175                      .dwattr $C$DW$T$62, DW_AT_language(DW_LANG_C)
   11176                      .dwattr $C$DW$T$62, DW_AT_byte_size(0x06)
   11177              $C$DW$1962      .dwtag  DW_TAG_subrange_type
TMS320C2000 Assembler PC v6.2.5 Wed Sep 27 19:09:55 2017

Tools Copyright (c) 1996-2014 Texas Instruments Incorporated
C:\Users\wmj\AppData\Local\Temp\0231210                              PAGE  214

   11178                      .dwattr $C$DW$1962, DW_AT_upper_bound(0x02)
   11179                      .dwendtag $C$DW$T$62
   11180              
   11181              
   11182              $C$DW$T$97      .dwtag  DW_TAG_structure_type
   11183                      .dwattr $C$DW$T$97, DW_AT_name("_OSC_Obj_")
   11184                      .dwattr $C$DW$T$97, DW_AT_byte_size(0x03)
   11185              $C$DW$1963      .dwtag  DW_TAG_member
   11186                      .dwattr $C$DW$1963, DW_AT_type(*$C$DW$T$23)
   11187                      .dwattr $C$DW$1963, DW_AT_name("INTOSC1TRIM")
   11188                      .dwattr $C$DW$1963, DW_AT_TI_symbol_name("_INTOSC1TRIM")
   11189                      .dwattr $C$DW$1963, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
   11190                      .dwattr $C$DW$1963, DW_AT_accessibility(DW_ACCESS_public)
   11191              $C$DW$1964      .dwtag  DW_TAG_member
   11192                      .dwattr $C$DW$1964, DW_AT_type(*$C$DW$T$23)
   11193                      .dwattr $C$DW$1964, DW_AT_name("rsvd_1")
   11194                      .dwattr $C$DW$1964, DW_AT_TI_symbol_name("_rsvd_1")
   11195                      .dwattr $C$DW$1964, DW_AT_data_member_location[DW_OP_plus_uconst 0x1]
   11196                      .dwattr $C$DW$1964, DW_AT_accessibility(DW_ACCESS_public)
   11197              $C$DW$1965      .dwtag  DW_TAG_member
   11198                      .dwattr $C$DW$1965, DW_AT_type(*$C$DW$T$23)
   11199                      .dwattr $C$DW$1965, DW_AT_name("INTOSC2TRIM")
   11200                      .dwattr $C$DW$1965, DW_AT_TI_symbol_name("_INTOSC2TRIM")
   11201                      .dwattr $C$DW$1965, DW_AT_data_member_location[DW_OP_plus_uconst 0x2]
   11202                      .dwattr $C$DW$1965, DW_AT_accessibility(DW_ACCESS_public)
   11203                      .dwendtag $C$DW$T$97
   11204              
   11205              $C$DW$T$65      .dwtag  DW_TAG_pointer_type
   11206                      .dwattr $C$DW$T$65, DW_AT_type(*$C$DW$T$97)
   11207                      .dwattr $C$DW$T$65, DW_AT_address_class(0x16)
   11208              $C$DW$T$66      .dwtag  DW_TAG_typedef, DW_AT_name("OSC_Handle")
   11209                      .dwattr $C$DW$T$66, DW_AT_type(*$C$DW$T$65)
   11210                      .dwattr $C$DW$T$66, DW_AT_language(DW_LANG_C)
   11211              
   11212              $C$DW$T$98      .dwtag  DW_TAG_structure_type
   11213                      .dwattr $C$DW$T$98, DW_AT_name("_PIE_IERIFR_t")
   11214                      .dwattr $C$DW$T$98, DW_AT_byte_size(0x02)
   11215              $C$DW$1966      .dwtag  DW_TAG_member
   11216                      .dwattr $C$DW$1966, DW_AT_type(*$C$DW$T$23)
   11217                      .dwattr $C$DW$1966, DW_AT_name("IER")
   11218                      .dwattr $C$DW$1966, DW_AT_TI_symbol_name("_IER")
   11219                      .dwattr $C$DW$1966, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
   11220                      .dwattr $C$DW$1966, DW_AT_accessibility(DW_ACCESS_public)
   11221              $C$DW$1967      .dwtag  DW_TAG_member
   11222                      .dwattr $C$DW$1967, DW_AT_type(*$C$DW$T$23)
   11223                      .dwattr $C$DW$1967, DW_AT_name("IFR")
   11224                      .dwattr $C$DW$1967, DW_AT_TI_symbol_name("_IFR")
   11225                      .dwattr $C$DW$1967, DW_AT_data_member_location[DW_OP_plus_uconst 0x1]
   11226                      .dwattr $C$DW$1967, DW_AT_accessibility(DW_ACCESS_public)
   11227                      .dwendtag $C$DW$T$98
   11228              
   11229              $C$DW$T$99      .dwtag  DW_TAG_typedef, DW_AT_name("PIE_IERIFR_t")
   11230                      .dwattr $C$DW$T$99, DW_AT_type(*$C$DW$T$98)
   11231                      .dwattr $C$DW$T$99, DW_AT_language(DW_LANG_C)
   11232              $C$DW$1968      .dwtag  DW_TAG_TI_far_type
TMS320C2000 Assembler PC v6.2.5 Wed Sep 27 19:09:55 2017

Tools Copyright (c) 1996-2014 Texas Instruments Incorporated
C:\Users\wmj\AppData\Local\Temp\0231210                              PAGE  215

   11233                      .dwattr $C$DW$1968, DW_AT_type(*$C$DW$T$99)
   11234              $C$DW$T$100     .dwtag  DW_TAG_volatile_type
   11235                      .dwattr $C$DW$T$100, DW_AT_type(*$C$DW$1968)
   11236              
   11237              $C$DW$T$101     .dwtag  DW_TAG_array_type
   11238                      .dwattr $C$DW$T$101, DW_AT_type(*$C$DW$T$100)
   11239                      .dwattr $C$DW$T$101, DW_AT_language(DW_LANG_C)
   11240                      .dwattr $C$DW$T$101, DW_AT_byte_size(0x18)
   11241              $C$DW$1969      .dwtag  DW_TAG_subrange_type
   11242                      .dwattr $C$DW$1969, DW_AT_upper_bound(0x0b)
   11243                      .dwendtag $C$DW$T$101
   11244              
   11245              
   11246              $C$DW$T$108     .dwtag  DW_TAG_structure_type
   11247                      .dwattr $C$DW$T$108, DW_AT_name("_PIE_Obj_")
   11248                      .dwattr $C$DW$T$108, DW_AT_byte_size(0x639c)
   11249              $C$DW$1970      .dwtag  DW_TAG_member
   11250                      .dwattr $C$DW$1970, DW_AT_type(*$C$DW$T$23)
   11251                      .dwattr $C$DW$1970, DW_AT_name("PIECTRL")
   11252                      .dwattr $C$DW$1970, DW_AT_TI_symbol_name("_PIECTRL")
   11253                      .dwattr $C$DW$1970, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
   11254                      .dwattr $C$DW$1970, DW_AT_accessibility(DW_ACCESS_public)
   11255              $C$DW$1971      .dwtag  DW_TAG_member
   11256                      .dwattr $C$DW$1971, DW_AT_type(*$C$DW$T$23)
   11257                      .dwattr $C$DW$1971, DW_AT_name("PIEACK")
   11258                      .dwattr $C$DW$1971, DW_AT_TI_symbol_name("_PIEACK")
   11259                      .dwattr $C$DW$1971, DW_AT_data_member_location[DW_OP_plus_uconst 0x1]
   11260                      .dwattr $C$DW$1971, DW_AT_accessibility(DW_ACCESS_public)
   11261              $C$DW$1972      .dwtag  DW_TAG_member
   11262                      .dwattr $C$DW$1972, DW_AT_type(*$C$DW$T$101)
   11263                      .dwattr $C$DW$1972, DW_AT_name("PIEIER_PIEIFR")
   11264                      .dwattr $C$DW$1972, DW_AT_TI_symbol_name("_PIEIER_PIEIFR")
   11265                      .dwattr $C$DW$1972, DW_AT_data_member_location[DW_OP_plus_uconst 0x2]
   11266                      .dwattr $C$DW$1972, DW_AT_accessibility(DW_ACCESS_public)
   11267              $C$DW$1973      .dwtag  DW_TAG_member
   11268                      .dwattr $C$DW$1973, DW_AT_type(*$C$DW$T$102)
   11269                      .dwattr $C$DW$1973, DW_AT_name("rsvd_1")
   11270                      .dwattr $C$DW$1973, DW_AT_TI_symbol_name("_rsvd_1")
   11271                      .dwattr $C$DW$1973, DW_AT_data_member_location[DW_OP_plus_uconst 0x1a]
   11272                      .dwattr $C$DW$1973, DW_AT_accessibility(DW_ACCESS_public)
   11273              $C$DW$1974      .dwtag  DW_TAG_member
   11274                      .dwattr $C$DW$1974, DW_AT_type(*$C$DW$T$106)
   11275                      .dwattr $C$DW$1974, DW_AT_name("Reset")
   11276                      .dwattr $C$DW$1974, DW_AT_TI_symbol_name("_Reset")
   11277                      .dwattr $C$DW$1974, DW_AT_data_member_location[DW_OP_plus_uconst 0x20]
   11278                      .dwattr $C$DW$1974, DW_AT_accessibility(DW_ACCESS_public)
   11279              $C$DW$1975      .dwtag  DW_TAG_member
   11280                      .dwattr $C$DW$1975, DW_AT_type(*$C$DW$T$106)
   11281                      .dwattr $C$DW$1975, DW_AT_name("INT1")
   11282                      .dwattr $C$DW$1975, DW_AT_TI_symbol_name("_INT1")
   11283                      .dwattr $C$DW$1975, DW_AT_data_member_location[DW_OP_plus_uconst 0x22]
   11284                      .dwattr $C$DW$1975, DW_AT_accessibility(DW_ACCESS_public)
   11285              $C$DW$1976      .dwtag  DW_TAG_member
   11286                      .dwattr $C$DW$1976, DW_AT_type(*$C$DW$T$106)
   11287                      .dwattr $C$DW$1976, DW_AT_name("INT2")
TMS320C2000 Assembler PC v6.2.5 Wed Sep 27 19:09:55 2017

Tools Copyright (c) 1996-2014 Texas Instruments Incorporated
C:\Users\wmj\AppData\Local\Temp\0231210                              PAGE  216

   11288                      .dwattr $C$DW$1976, DW_AT_TI_symbol_name("_INT2")
   11289                      .dwattr $C$DW$1976, DW_AT_data_member_location[DW_OP_plus_uconst 0x24]
   11290                      .dwattr $C$DW$1976, DW_AT_accessibility(DW_ACCESS_public)
   11291              $C$DW$1977      .dwtag  DW_TAG_member
   11292                      .dwattr $C$DW$1977, DW_AT_type(*$C$DW$T$106)
   11293                      .dwattr $C$DW$1977, DW_AT_name("INT3")
   11294                      .dwattr $C$DW$1977, DW_AT_TI_symbol_name("_INT3")
   11295                      .dwattr $C$DW$1977, DW_AT_data_member_location[DW_OP_plus_uconst 0x26]
   11296                      .dwattr $C$DW$1977, DW_AT_accessibility(DW_ACCESS_public)
   11297              $C$DW$1978      .dwtag  DW_TAG_member
   11298                      .dwattr $C$DW$1978, DW_AT_type(*$C$DW$T$106)
   11299                      .dwattr $C$DW$1978, DW_AT_name("INT4")
   11300                      .dwattr $C$DW$1978, DW_AT_TI_symbol_name("_INT4")
   11301                      .dwattr $C$DW$1978, DW_AT_data_member_location[DW_OP_plus_uconst 0x28]
   11302                      .dwattr $C$DW$1978, DW_AT_accessibility(DW_ACCESS_public)
   11303              $C$DW$1979      .dwtag  DW_TAG_member
   11304                      .dwattr $C$DW$1979, DW_AT_type(*$C$DW$T$106)
   11305                      .dwattr $C$DW$1979, DW_AT_name("INT5")
   11306                      .dwattr $C$DW$1979, DW_AT_TI_symbol_name("_INT5")
   11307                      .dwattr $C$DW$1979, DW_AT_data_member_location[DW_OP_plus_uconst 0x2a]
   11308                      .dwattr $C$DW$1979, DW_AT_accessibility(DW_ACCESS_public)
   11309              $C$DW$1980      .dwtag  DW_TAG_member
   11310                      .dwattr $C$DW$1980, DW_AT_type(*$C$DW$T$106)
   11311                      .dwattr $C$DW$1980, DW_AT_name("INT6")
   11312                      .dwattr $C$DW$1980, DW_AT_TI_symbol_name("_INT6")
   11313                      .dwattr $C$DW$1980, DW_AT_data_member_location[DW_OP_plus_uconst 0x2c]
   11314                      .dwattr $C$DW$1980, DW_AT_accessibility(DW_ACCESS_public)
   11315              $C$DW$1981      .dwtag  DW_TAG_member
   11316                      .dwattr $C$DW$1981, DW_AT_type(*$C$DW$T$106)
   11317                      .dwattr $C$DW$1981, DW_AT_name("INT7")
   11318                      .dwattr $C$DW$1981, DW_AT_TI_symbol_name("_INT7")
   11319                      .dwattr $C$DW$1981, DW_AT_data_member_location[DW_OP_plus_uconst 0x2e]
   11320                      .dwattr $C$DW$1981, DW_AT_accessibility(DW_ACCESS_public)
   11321              $C$DW$1982      .dwtag  DW_TAG_member
   11322                      .dwattr $C$DW$1982, DW_AT_type(*$C$DW$T$106)
   11323                      .dwattr $C$DW$1982, DW_AT_name("INT8")
   11324                      .dwattr $C$DW$1982, DW_AT_TI_symbol_name("_INT8")
   11325                      .dwattr $C$DW$1982, DW_AT_data_member_location[DW_OP_plus_uconst 0x30]
   11326                      .dwattr $C$DW$1982, DW_AT_accessibility(DW_ACCESS_public)
   11327              $C$DW$1983      .dwtag  DW_TAG_member
   11328                      .dwattr $C$DW$1983, DW_AT_type(*$C$DW$T$106)
   11329                      .dwattr $C$DW$1983, DW_AT_name("INT9")
   11330                      .dwattr $C$DW$1983, DW_AT_TI_symbol_name("_INT9")
   11331                      .dwattr $C$DW$1983, DW_AT_data_member_location[DW_OP_plus_uconst 0x32]
   11332                      .dwattr $C$DW$1983, DW_AT_accessibility(DW_ACCESS_public)
   11333              $C$DW$1984      .dwtag  DW_TAG_member
   11334                      .dwattr $C$DW$1984, DW_AT_type(*$C$DW$T$106)
   11335                      .dwattr $C$DW$1984, DW_AT_name("INT10")
   11336                      .dwattr $C$DW$1984, DW_AT_TI_symbol_name("_INT10")
   11337                      .dwattr $C$DW$1984, DW_AT_data_member_location[DW_OP_plus_uconst 0x34]
   11338                      .dwattr $C$DW$1984, DW_AT_accessibility(DW_ACCESS_public)
