TMS320C2000 Assembler PC v6.2.5 Mon Sep 11 10:22:22 2017

Tools Copyright (c) 1996-2014 Texas Instruments Incorporated
C:\Users\wmj\AppData\Local\Temp\1488411                              PAGE    1

       1              ;***************************************************************
       2              ;* TMS320C2000 C/C++ Codegen                         PC v6.2.5 *
       3              ;* Date/Time created: Mon Sep 11 10:22:22 2017                 *
       4              ;***************************************************************
       5                      .compiler_opts --float_support=softlib --hll_source=on --mem_model:code=flat --mem_model:data=large -
       6        0002  FP      .set    XAR2
       7              
       8              $C$DW$CU        .dwtag  DW_TAG_compile_unit
       9                      .dwattr $C$DW$CU, DW_AT_name("D:/FOC_27/sw/solutions/instaspin_foc/src/proj_lab01.c")
      10                      .dwattr $C$DW$CU, DW_AT_producer("TMS320C2000 C/C++ Codegen PC v6.2.5 Copyright (c) 1996-2014 Texas I
      11                      .dwattr $C$DW$CU, DW_AT_TI_version(0x01)
      12                      .dwattr $C$DW$CU, DW_AT_comp_dir("D:\FOC_27\sw\solutions\instaspin_foc\boards\hvkit_rev1p1\f28x\f2802
      13              ;**************************************************************
      14              ;* CINIT RECORDS                                              *

    1903                      .dwattr $C$DW$T$161, DW_AT_language(DW_LANG_C)
    1904              
    1905              $C$DW$T$163     .dwtag  DW_TAG_enumeration_type
    1906                      .dwattr $C$DW$T$163, DW_AT_byte_size(0x01)
    1907              $C$DW$307       .dwtag  DW_TAG_enumerator, DW_AT_name("ADC_ResultNumber_0"), DW_AT_const_value(0x00)
    1908              $C$DW$308       .dwtag  DW_TAG_enumerator, DW_AT_name("ADC_ResultNumber_1"), DW_AT_const_value(0x01)
    1909              $C$DW$309       .dwtag  DW_TAG_enumerator, DW_AT_name("ADC_ResultNumber_2"), DW_AT_const_value(0x02)
    1910              $C$DW$310       .dwtag  DW_TAG_enumerator, DW_AT_name("ADC_ResultNumber_3"), DW_AT_const_value(0x03)
    1911              $C$DW$311       .dwtag  DW_TAG_enumerator, DW_AT_name("ADC_ResultNumber_4"), DW_AT_const_value(0x04)
    1912              $C$DW$312       .dwtag  DW_TAG_enumerator, DW_AT_name("ADC_ResultNumber_5"), DW_AT_const_value(0x05)
    1913              $C$DW$313       .dwtag  DW_TAG_enumerator, DW_AT_name("ADC_ResultNumber_6"), DW_AT_const_value(0x06)
    1914              $C$DW$314       .dwtag  DW_TAG_enumerator, DW_AT_name("ADC_ResultNumber_7"), DW_AT_const_value(0x07)
    1915              $C$DW$315       .dwtag  DW_TAG_enumerator, DW_AT_name("ADC_ResultNumber_8"), DW_AT_const_value(0x08)
    1916              $C$DW$316       .dwtag  DW_TAG_enumerator, DW_AT_name("ADC_ResultNumber_9"), DW_AT_const_value(0x09)
    1917              $C$DW$317       .dwtag  DW_TAG_enumerator, DW_AT_name("ADC_ResultNumber_10"), DW_AT_const_value(0x0a)
    1918              $C$DW$318       .dwtag  DW_TAG_enumerator, DW_AT_name("ADC_ResultNumber_11"), DW_AT_const_value(0x0b)
    1919              $C$DW$319       .dwtag  DW_TAG_enumerator, DW_AT_name("ADC_ResultNumber_12"), DW_AT_const_value(0x0c)
TMS320C2000 Assembler PC v6.2.5 Mon Sep 11 10:22:22 2017

Tools Copyright (c) 1996-2014 Texas Instruments Incorporated
C:\Users\wmj\AppData\Local\Temp\1488411                              PAGE   39

    1920              $C$DW$320       .dwtag  DW_TAG_enumerator, DW_AT_name("ADC_ResultNumber_13"), DW_AT_const_value(0x0d)
    1921              $C$DW$321       .dwtag  DW_TAG_enumerator, DW_AT_name("ADC_ResultNumber_14"), DW_AT_const_value(0x0e)
    1922              $C$DW$322       .dwtag  DW_TAG_enumerator, DW_AT_name("ADC_ResultNumber_15"), DW_AT_const_value(0x0f)
    1923                      .dwendtag $C$DW$T$163
    1924              
    1925              $C$DW$T$164     .dwtag  DW_TAG_typedef, DW_AT_name("ADC_ResultNumber_e")
    1926                      .dwattr $C$DW$T$164, DW_AT_type(*$C$DW$T$163)
    1927                      .dwattr $C$DW$T$164, DW_AT_language(DW_LANG_C)
    1928              
    1929              $C$DW$T$166     .dwtag  DW_TAG_enumeration_type
    1930                      .dwattr $C$DW$T$166, DW_AT_byte_size(0x01)
    1931              $C$DW$323       .dwtag  DW_TAG_enumerator, DW_AT_name("PIE_GroupNumber_1"), DW_AT_const_value(0x00)
    1932              $C$DW$324       .dwtag  DW_TAG_enumerator, DW_AT_name("PIE_GroupNumber_2"), DW_AT_const_value(0x01)
    1933              $C$DW$325       .dwtag  DW_TAG_enumerator, DW_AT_name("PIE_GroupNumber_3"), DW_AT_const_value(0x02)
    1934              $C$DW$326       .dwtag  DW_TAG_enumerator, DW_AT_name("PIE_GroupNumber_4"), DW_AT_const_value(0x03)
    1935              $C$DW$327       .dwtag  DW_TAG_enumerator, DW_AT_name("PIE_GroupNumber_5"), DW_AT_const_value(0x04)
    1936              $C$DW$328       .dwtag  DW_TAG_enumerator, DW_AT_name("PIE_GroupNumber_6"), DW_AT_const_value(0x05)
    1937              $C$DW$329       .dwtag  DW_TAG_enumerator, DW_AT_name("PIE_GroupNumber_7"), DW_AT_const_value(0x06)
    1938              $C$DW$330       .dwtag  DW_TAG_enumerator, DW_AT_name("PIE_GroupNumber_8"), DW_AT_const_value(0x07)
    1939              $C$DW$331       .dwtag  DW_TAG_enumerator, DW_AT_name("PIE_GroupNumber_9"), DW_AT_const_value(0x08)
    1940              $C$DW$332       .dwtag  DW_TAG_enumerator, DW_AT_name("PIE_GroupNumber_10"), DW_AT_const_value(0x09)
    1941              $C$DW$333       .dwtag  DW_TAG_enumerator, DW_AT_name("PIE_GroupNumber_11"), DW_AT_const_value(0x0a)
    1942              $C$DW$334       .dwtag  DW_TAG_enumerator, DW_AT_name("PIE_GroupNumber_12"), DW_AT_const_value(0x0b)
    1943                      .dwendtag $C$DW$T$166
    1944              
    1945              $C$DW$T$167     .dwtag  DW_TAG_typedef, DW_AT_name("PIE_GroupNumber_e")
    1946                      .dwattr $C$DW$T$167, DW_AT_type(*$C$DW$T$166)
    1947                      .dwattr $C$DW$T$167, DW_AT_language(DW_LANG_C)
    1948              
    1949              $C$DW$T$19      .dwtag  DW_TAG_structure_type
    1950                      .dwattr $C$DW$T$19, DW_AT_name("I2C_Obj")
    1951                      .dwattr $C$DW$T$19, DW_AT_declaration
    1952                      .dwendtag $C$DW$T$19
    1953              
    1954              $C$DW$T$77      .dwtag  DW_TAG_pointer_type
    1955                      .dwattr $C$DW$T$77, DW_AT_type(*$C$DW$T$19)
    1956                      .dwattr $C$DW$T$77, DW_AT_address_class(0x16)
    1957              $C$DW$T$78      .dwtag  DW_TAG_typedef, DW_AT_name("I2C_Handle")
    1958                      .dwattr $C$DW$T$78, DW_AT_type(*$C$DW$T$77)
    1959                      .dwattr $C$DW$T$78, DW_AT_language(DW_LANG_C)
    1960              
    1961              $C$DW$T$30      .dwtag  DW_TAG_structure_type
    1962                      .dwattr $C$DW$T$30, DW_AT_name("_ADC_Obj_")
    1963                      .dwattr $C$DW$T$30, DW_AT_byte_size(0x6650)
    1964              $C$DW$335       .dwtag  DW_TAG_member
    1965                      .dwattr $C$DW$335, DW_AT_type(*$C$DW$T$24)
    1966                      .dwattr $C$DW$335, DW_AT_name("ADCRESULT")
    1967                      .dwattr $C$DW$335, DW_AT_TI_symbol_name("_ADCRESULT")
    1968                      .dwattr $C$DW$335, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    1969                      .dwattr $C$DW$335, DW_AT_accessibility(DW_ACCESS_public)
    1970              $C$DW$336       .dwtag  DW_TAG_member
    1971                      .dwattr $C$DW$336, DW_AT_type(*$C$DW$T$25)
    1972                      .dwattr $C$DW$336, DW_AT_name("resvd_1")
    1973                      .dwattr $C$DW$336, DW_AT_TI_symbol_name("_resvd_1")
    1974                      .dwattr $C$DW$336, DW_AT_data_member_location[DW_OP_plus_uconst 0x10]
TMS320C2000 Assembler PC v6.2.5 Mon Sep 11 10:22:22 2017

Tools Copyright (c) 1996-2014 Texas Instruments Incorporated
C:\Users\wmj\AppData\Local\Temp\1488411                              PAGE   40

    1975                      .dwattr $C$DW$336, DW_AT_accessibility(DW_ACCESS_public)
    1976              $C$DW$337       .dwtag  DW_TAG_member
    1977                      .dwattr $C$DW$337, DW_AT_type(*$C$DW$T$23)
    1978                      .dwattr $C$DW$337, DW_AT_name("ADCCTL1")
    1979                      .dwattr $C$DW$337, DW_AT_TI_symbol_name("_ADCCTL1")
    1980                      .dwattr $C$DW$337, DW_AT_data_member_location[DW_OP_plus_uconst 0x6600]
    1981                      .dwattr $C$DW$337, DW_AT_accessibility(DW_ACCESS_public)
    1982              $C$DW$338       .dwtag  DW_TAG_member
    1983                      .dwattr $C$DW$338, DW_AT_type(*$C$DW$T$23)
    1984                      .dwattr $C$DW$338, DW_AT_name("ADCCTL2")
    1985                      .dwattr $C$DW$338, DW_AT_TI_symbol_name("_ADCCTL2")
    1986                      .dwattr $C$DW$338, DW_AT_data_member_location[DW_OP_plus_uconst 0x6601]
    1987                      .dwattr $C$DW$338, DW_AT_accessibility(DW_ACCESS_public)
    1988              $C$DW$339       .dwtag  DW_TAG_member
    1989                      .dwattr $C$DW$339, DW_AT_type(*$C$DW$T$26)
    1990                      .dwattr $C$DW$339, DW_AT_name("rsvd_2")
    1991                      .dwattr $C$DW$339, DW_AT_TI_symbol_name("_rsvd_2")
    1992                      .dwattr $C$DW$339, DW_AT_data_member_location[DW_OP_plus_uconst 0x6602]
    1993                      .dwattr $C$DW$339, DW_AT_accessibility(DW_ACCESS_public)
    1994              $C$DW$340       .dwtag  DW_TAG_member
    1995                      .dwattr $C$DW$340, DW_AT_type(*$C$DW$T$23)
    1996                      .dwattr $C$DW$340, DW_AT_name("ADCINTFLG")
    1997                      .dwattr $C$DW$340, DW_AT_TI_symbol_name("_ADCINTFLG")
    1998                      .dwattr $C$DW$340, DW_AT_data_member_location[DW_OP_plus_uconst 0x6604]
    1999                      .dwattr $C$DW$340, DW_AT_accessibility(DW_ACCESS_public)
    2000              $C$DW$341       .dwtag  DW_TAG_member
    2001                      .dwattr $C$DW$341, DW_AT_type(*$C$DW$T$23)
    2002                      .dwattr $C$DW$341, DW_AT_name("ADCINTFLGCLR")
    2003                      .dwattr $C$DW$341, DW_AT_TI_symbol_name("_ADCINTFLGCLR")
    2004                      .dwattr $C$DW$341, DW_AT_data_member_location[DW_OP_plus_uconst 0x6605]
    2005                      .dwattr $C$DW$341, DW_AT_accessibility(DW_ACCESS_public)
    2006              $C$DW$342       .dwtag  DW_TAG_member
    2007                      .dwattr $C$DW$342, DW_AT_type(*$C$DW$T$23)
    2008                      .dwattr $C$DW$342, DW_AT_name("ADCINTOVF")
    2009                      .dwattr $C$DW$342, DW_AT_TI_symbol_name("_ADCINTOVF")
    2010                      .dwattr $C$DW$342, DW_AT_data_member_location[DW_OP_plus_uconst 0x6606]
    2011                      .dwattr $C$DW$342, DW_AT_accessibility(DW_ACCESS_public)
    2012              $C$DW$343       .dwtag  DW_TAG_member
    2013                      .dwattr $C$DW$343, DW_AT_type(*$C$DW$T$23)
    2014                      .dwattr $C$DW$343, DW_AT_name("ADCINTOVFCLR")
    2015                      .dwattr $C$DW$343, DW_AT_TI_symbol_name("_ADCINTOVFCLR")
    2016                      .dwattr $C$DW$343, DW_AT_data_member_location[DW_OP_plus_uconst 0x6607]
    2017                      .dwattr $C$DW$343, DW_AT_accessibility(DW_ACCESS_public)
    2018              $C$DW$344       .dwtag  DW_TAG_member
    2019                      .dwattr $C$DW$344, DW_AT_type(*$C$DW$T$27)
    2020                      .dwattr $C$DW$344, DW_AT_name("INTSELxNy")
    2021                      .dwattr $C$DW$344, DW_AT_TI_symbol_name("_INTSELxNy")
    2022                      .dwattr $C$DW$344, DW_AT_data_member_location[DW_OP_plus_uconst 0x6608]
    2023                      .dwattr $C$DW$344, DW_AT_accessibility(DW_ACCESS_public)
    2024              $C$DW$345       .dwtag  DW_TAG_member
    2025                      .dwattr $C$DW$345, DW_AT_type(*$C$DW$T$28)
    2026                      .dwattr $C$DW$345, DW_AT_name("rsvd_3")
    2027                      .dwattr $C$DW$345, DW_AT_TI_symbol_name("_rsvd_3")
    2028                      .dwattr $C$DW$345, DW_AT_data_member_location[DW_OP_plus_uconst 0x660d]
    2029                      .dwattr $C$DW$345, DW_AT_accessibility(DW_ACCESS_public)
TMS320C2000 Assembler PC v6.2.5 Mon Sep 11 10:22:22 2017

Tools Copyright (c) 1996-2014 Texas Instruments Incorporated
C:\Users\wmj\AppData\Local\Temp\1488411                              PAGE   41

    2030              $C$DW$346       .dwtag  DW_TAG_member
    2031                      .dwattr $C$DW$346, DW_AT_type(*$C$DW$T$23)
    2032                      .dwattr $C$DW$346, DW_AT_name("SOCPRICTRL")
    2033                      .dwattr $C$DW$346, DW_AT_TI_symbol_name("_SOCPRICTRL")
    2034                      .dwattr $C$DW$346, DW_AT_data_member_location[DW_OP_plus_uconst 0x6610]
    2035                      .dwattr $C$DW$346, DW_AT_accessibility(DW_ACCESS_public)
    2036              $C$DW$347       .dwtag  DW_TAG_member
    2037                      .dwattr $C$DW$347, DW_AT_type(*$C$DW$T$23)
    2038                      .dwattr $C$DW$347, DW_AT_name("rsvd_4")
    2039                      .dwattr $C$DW$347, DW_AT_TI_symbol_name("_rsvd_4")
    2040                      .dwattr $C$DW$347, DW_AT_data_member_location[DW_OP_plus_uconst 0x6611]
    2041                      .dwattr $C$DW$347, DW_AT_accessibility(DW_ACCESS_public)
    2042              $C$DW$348       .dwtag  DW_TAG_member
    2043                      .dwattr $C$DW$348, DW_AT_type(*$C$DW$T$23)
    2044                      .dwattr $C$DW$348, DW_AT_name("ADCSAMPLEMODE")
    2045                      .dwattr $C$DW$348, DW_AT_TI_symbol_name("_ADCSAMPLEMODE")
    2046                      .dwattr $C$DW$348, DW_AT_data_member_location[DW_OP_plus_uconst 0x6612]
    2047                      .dwattr $C$DW$348, DW_AT_accessibility(DW_ACCESS_public)
    2048              $C$DW$349       .dwtag  DW_TAG_member
    2049                      .dwattr $C$DW$349, DW_AT_type(*$C$DW$T$23)
    2050                      .dwattr $C$DW$349, DW_AT_name("rsvd_5")
    2051                      .dwattr $C$DW$349, DW_AT_TI_symbol_name("_rsvd_5")
    2052                      .dwattr $C$DW$349, DW_AT_data_member_location[DW_OP_plus_uconst 0x6613]
    2053                      .dwattr $C$DW$349, DW_AT_accessibility(DW_ACCESS_public)
    2054              $C$DW$350       .dwtag  DW_TAG_member
    2055                      .dwattr $C$DW$350, DW_AT_type(*$C$DW$T$23)
    2056                      .dwattr $C$DW$350, DW_AT_name("ADCINTSOCSEL1")
    2057                      .dwattr $C$DW$350, DW_AT_TI_symbol_name("_ADCINTSOCSEL1")
    2058                      .dwattr $C$DW$350, DW_AT_data_member_location[DW_OP_plus_uconst 0x6614]
    2059                      .dwattr $C$DW$350, DW_AT_accessibility(DW_ACCESS_public)
    2060              $C$DW$351       .dwtag  DW_TAG_member
    2061                      .dwattr $C$DW$351, DW_AT_type(*$C$DW$T$23)
    2062                      .dwattr $C$DW$351, DW_AT_name("ADCINTSOCSEL2")
    2063                      .dwattr $C$DW$351, DW_AT_TI_symbol_name("_ADCINTSOCSEL2")
    2064                      .dwattr $C$DW$351, DW_AT_data_member_location[DW_OP_plus_uconst 0x6615]
    2065                      .dwattr $C$DW$351, DW_AT_accessibility(DW_ACCESS_public)
    2066              $C$DW$352       .dwtag  DW_TAG_member
    2067                      .dwattr $C$DW$352, DW_AT_type(*$C$DW$T$26)
    2068                      .dwattr $C$DW$352, DW_AT_name("rsvd_6")
    2069                      .dwattr $C$DW$352, DW_AT_TI_symbol_name("_rsvd_6")
    2070                      .dwattr $C$DW$352, DW_AT_data_member_location[DW_OP_plus_uconst 0x6616]
    2071                      .dwattr $C$DW$352, DW_AT_accessibility(DW_ACCESS_public)
    2072              $C$DW$353       .dwtag  DW_TAG_member
    2073                      .dwattr $C$DW$353, DW_AT_type(*$C$DW$T$23)
    2074                      .dwattr $C$DW$353, DW_AT_name("ADCSOCFLG1")
    2075                      .dwattr $C$DW$353, DW_AT_TI_symbol_name("_ADCSOCFLG1")
    2076                      .dwattr $C$DW$353, DW_AT_data_member_location[DW_OP_plus_uconst 0x6618]
    2077                      .dwattr $C$DW$353, DW_AT_accessibility(DW_ACCESS_public)
    2078              $C$DW$354       .dwtag  DW_TAG_member
    2079                      .dwattr $C$DW$354, DW_AT_type(*$C$DW$T$23)
    2080                      .dwattr $C$DW$354, DW_AT_name("rsvd_7")
    2081                      .dwattr $C$DW$354, DW_AT_TI_symbol_name("_rsvd_7")
    2082                      .dwattr $C$DW$354, DW_AT_data_member_location[DW_OP_plus_uconst 0x6619]
    2083                      .dwattr $C$DW$354, DW_AT_accessibility(DW_ACCESS_public)
    2084              $C$DW$355       .dwtag  DW_TAG_member
TMS320C2000 Assembler PC v6.2.5 Mon Sep 11 10:22:22 2017

Tools Copyright (c) 1996-2014 Texas Instruments Incorporated
C:\Users\wmj\AppData\Local\Temp\1488411                              PAGE   42

    2085                      .dwattr $C$DW$355, DW_AT_type(*$C$DW$T$23)
    2086                      .dwattr $C$DW$355, DW_AT_name("ADCSOCFRC1")
    2087                      .dwattr $C$DW$355, DW_AT_TI_symbol_name("_ADCSOCFRC1")
    2088                      .dwattr $C$DW$355, DW_AT_data_member_location[DW_OP_plus_uconst 0x661a]
    2089                      .dwattr $C$DW$355, DW_AT_accessibility(DW_ACCESS_public)
    2090              $C$DW$356       .dwtag  DW_TAG_member
    2091                      .dwattr $C$DW$356, DW_AT_type(*$C$DW$T$23)
    2092                      .dwattr $C$DW$356, DW_AT_name("rsvd_8")
    2093                      .dwattr $C$DW$356, DW_AT_TI_symbol_name("_rsvd_8")
    2094                      .dwattr $C$DW$356, DW_AT_data_member_location[DW_OP_plus_uconst 0x661b]
    2095                      .dwattr $C$DW$356, DW_AT_accessibility(DW_ACCESS_public)
    2096              $C$DW$357       .dwtag  DW_TAG_member
    2097                      .dwattr $C$DW$357, DW_AT_type(*$C$DW$T$23)
    2098                      .dwattr $C$DW$357, DW_AT_name("ADCSOCOVF1")
    2099                      .dwattr $C$DW$357, DW_AT_TI_symbol_name("_ADCSOCOVF1")
    2100                      .dwattr $C$DW$357, DW_AT_data_member_location[DW_OP_plus_uconst 0x661c]
    2101                      .dwattr $C$DW$357, DW_AT_accessibility(DW_ACCESS_public)
    2102              $C$DW$358       .dwtag  DW_TAG_member
    2103                      .dwattr $C$DW$358, DW_AT_type(*$C$DW$T$23)
    2104                      .dwattr $C$DW$358, DW_AT_name("rsvd_9")
    2105                      .dwattr $C$DW$358, DW_AT_TI_symbol_name("_rsvd_9")
    2106                      .dwattr $C$DW$358, DW_AT_data_member_location[DW_OP_plus_uconst 0x661d]
    2107                      .dwattr $C$DW$358, DW_AT_accessibility(DW_ACCESS_public)
    2108              $C$DW$359       .dwtag  DW_TAG_member
    2109                      .dwattr $C$DW$359, DW_AT_type(*$C$DW$T$23)
    2110                      .dwattr $C$DW$359, DW_AT_name("ADCSOCOVFCLR1")
    2111                      .dwattr $C$DW$359, DW_AT_TI_symbol_name("_ADCSOCOVFCLR1")
    2112                      .dwattr $C$DW$359, DW_AT_data_member_location[DW_OP_plus_uconst 0x661e]
    2113                      .dwattr $C$DW$359, DW_AT_accessibility(DW_ACCESS_public)
    2114              $C$DW$360       .dwtag  DW_TAG_member
    2115                      .dwattr $C$DW$360, DW_AT_type(*$C$DW$T$23)
    2116                      .dwattr $C$DW$360, DW_AT_name("rsvd_10")
    2117                      .dwattr $C$DW$360, DW_AT_TI_symbol_name("_rsvd_10")
    2118                      .dwattr $C$DW$360, DW_AT_data_member_location[DW_OP_plus_uconst 0x661f]
    2119                      .dwattr $C$DW$360, DW_AT_accessibility(DW_ACCESS_public)
    2120              $C$DW$361       .dwtag  DW_TAG_member
    2121                      .dwattr $C$DW$361, DW_AT_type(*$C$DW$T$24)
    2122                      .dwattr $C$DW$361, DW_AT_name("ADCSOCxCTL")
    2123                      .dwattr $C$DW$361, DW_AT_TI_symbol_name("_ADCSOCxCTL")
    2124                      .dwattr $C$DW$361, DW_AT_data_member_location[DW_OP_plus_uconst 0x6620]
    2125                      .dwattr $C$DW$361, DW_AT_accessibility(DW_ACCESS_public)
    2126              $C$DW$362       .dwtag  DW_TAG_member
    2127                      .dwattr $C$DW$362, DW_AT_type(*$C$DW$T$24)
    2128                      .dwattr $C$DW$362, DW_AT_name("rsvd_11")
    2129                      .dwattr $C$DW$362, DW_AT_TI_symbol_name("_rsvd_11")
    2130                      .dwattr $C$DW$362, DW_AT_data_member_location[DW_OP_plus_uconst 0x6630]
    2131                      .dwattr $C$DW$362, DW_AT_accessibility(DW_ACCESS_public)
    2132              $C$DW$363       .dwtag  DW_TAG_member
    2133                      .dwattr $C$DW$363, DW_AT_type(*$C$DW$T$23)
    2134                      .dwattr $C$DW$363, DW_AT_name("ADCREFTRIM")
    2135                      .dwattr $C$DW$363, DW_AT_TI_symbol_name("_ADCREFTRIM")
    2136                      .dwattr $C$DW$363, DW_AT_data_member_location[DW_OP_plus_uconst 0x6640]
    2137                      .dwattr $C$DW$363, DW_AT_accessibility(DW_ACCESS_public)
    2138              $C$DW$364       .dwtag  DW_TAG_member
    2139                      .dwattr $C$DW$364, DW_AT_type(*$C$DW$T$23)
TMS320C2000 Assembler PC v6.2.5 Mon Sep 11 10:22:22 2017

Tools Copyright (c) 1996-2014 Texas Instruments Incorporated
C:\Users\wmj\AppData\Local\Temp\1488411                              PAGE   43

    2140                      .dwattr $C$DW$364, DW_AT_name("ADCOFFTRIM")
    2141                      .dwattr $C$DW$364, DW_AT_TI_symbol_name("_ADCOFFTRIM")
    2142                      .dwattr $C$DW$364, DW_AT_data_member_location[DW_OP_plus_uconst 0x6641]
    2143                      .dwattr $C$DW$364, DW_AT_accessibility(DW_ACCESS_public)
    2144              $C$DW$365       .dwtag  DW_TAG_member
    2145                      .dwattr $C$DW$365, DW_AT_type(*$C$DW$T$29)
    2146                      .dwattr $C$DW$365, DW_AT_name("resvd_12")
    2147                      .dwattr $C$DW$365, DW_AT_TI_symbol_name("_resvd_12")
    2148                      .dwattr $C$DW$365, DW_AT_data_member_location[DW_OP_plus_uconst 0x6642]
    2149                      .dwattr $C$DW$365, DW_AT_accessibility(DW_ACCESS_public)
    2150              $C$DW$366       .dwtag  DW_TAG_member
    2151                      .dwattr $C$DW$366, DW_AT_type(*$C$DW$T$23)
    2152                      .dwattr $C$DW$366, DW_AT_name("ADCREV")
    2153                      .dwattr $C$DW$366, DW_AT_TI_symbol_name("_ADCREV")
    2154                      .dwattr $C$DW$366, DW_AT_data_member_location[DW_OP_plus_uconst 0x664f]
    2155                      .dwattr $C$DW$366, DW_AT_accessibility(DW_ACCESS_public)
    2156                      .dwendtag $C$DW$T$30
    2157              
    2158              $C$DW$T$169     .dwtag  DW_TAG_typedef, DW_AT_name("ADC_Obj")
    2159                      .dwattr $C$DW$T$169, DW_AT_type(*$C$DW$T$30)
    2160                      .dwattr $C$DW$T$169, DW_AT_language(DW_LANG_C)
    2161              $C$DW$T$48      .dwtag  DW_TAG_pointer_type
    2162                      .dwattr $C$DW$T$48, DW_AT_type(*$C$DW$T$30)
    2163                      .dwattr $C$DW$T$48, DW_AT_address_class(0x16)
    2164              $C$DW$T$49      .dwtag  DW_TAG_typedef, DW_AT_name("ADC_Handle")
    2165                      .dwattr $C$DW$T$49, DW_AT_type(*$C$DW$T$48)
    2166                      .dwattr $C$DW$T$49, DW_AT_language(DW_LANG_C)
    2167              
    2168              $C$DW$T$32      .dwtag  DW_TAG_structure_type
    2169                      .dwattr $C$DW$T$32, DW_AT_name("_CLK_Obj_")
    2170                      .dwattr $C$DW$T$32, DW_AT_byte_size(0x11)
    2171              $C$DW$367       .dwtag  DW_TAG_member
    2172                      .dwattr $C$DW$367, DW_AT_type(*$C$DW$T$23)
    2173                      .dwattr $C$DW$367, DW_AT_name("XCLK")
    2174                      .dwattr $C$DW$367, DW_AT_TI_symbol_name("_XCLK")
    2175                      .dwattr $C$DW$367, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    2176                      .dwattr $C$DW$367, DW_AT_accessibility(DW_ACCESS_public)
    2177              $C$DW$368       .dwtag  DW_TAG_member
    2178                      .dwattr $C$DW$368, DW_AT_type(*$C$DW$T$23)
    2179                      .dwattr $C$DW$368, DW_AT_name("rsvd_1")
    2180                      .dwattr $C$DW$368, DW_AT_TI_symbol_name("_rsvd_1")
    2181                      .dwattr $C$DW$368, DW_AT_data_member_location[DW_OP_plus_uconst 0x1]
    2182                      .dwattr $C$DW$368, DW_AT_accessibility(DW_ACCESS_public)
    2183              $C$DW$369       .dwtag  DW_TAG_member
    2184                      .dwattr $C$DW$369, DW_AT_type(*$C$DW$T$23)
    2185                      .dwattr $C$DW$369, DW_AT_name("CLKCTL")
    2186                      .dwattr $C$DW$369, DW_AT_TI_symbol_name("_CLKCTL")
    2187                      .dwattr $C$DW$369, DW_AT_data_member_location[DW_OP_plus_uconst 0x2]
    2188                      .dwattr $C$DW$369, DW_AT_accessibility(DW_ACCESS_public)
    2189              $C$DW$370       .dwtag  DW_TAG_member
    2190                      .dwattr $C$DW$370, DW_AT_type(*$C$DW$T$31)
    2191                      .dwattr $C$DW$370, DW_AT_name("rsvd_2")
    2192                      .dwattr $C$DW$370, DW_AT_TI_symbol_name("_rsvd_2")
    2193                      .dwattr $C$DW$370, DW_AT_data_member_location[DW_OP_plus_uconst 0x3]
    2194                      .dwattr $C$DW$370, DW_AT_accessibility(DW_ACCESS_public)
TMS320C2000 Assembler PC v6.2.5 Mon Sep 11 10:22:22 2017

Tools Copyright (c) 1996-2014 Texas Instruments Incorporated
C:\Users\wmj\AppData\Local\Temp\1488411                              PAGE   44

    2195              $C$DW$371       .dwtag  DW_TAG_member
    2196                      .dwattr $C$DW$371, DW_AT_type(*$C$DW$T$23)
    2197                      .dwattr $C$DW$371, DW_AT_name("LOSPCP")
    2198                      .dwattr $C$DW$371, DW_AT_TI_symbol_name("_LOSPCP")
    2199                      .dwattr $C$DW$371, DW_AT_data_member_location[DW_OP_plus_uconst 0xb]
    2200                      .dwattr $C$DW$371, DW_AT_accessibility(DW_ACCESS_public)
    2201              $C$DW$372       .dwtag  DW_TAG_member
    2202                      .dwattr $C$DW$372, DW_AT_type(*$C$DW$T$23)
    2203                      .dwattr $C$DW$372, DW_AT_name("PCLKCR0")
    2204                      .dwattr $C$DW$372, DW_AT_TI_symbol_name("_PCLKCR0")
    2205                      .dwattr $C$DW$372, DW_AT_data_member_location[DW_OP_plus_uconst 0xc]
    2206                      .dwattr $C$DW$372, DW_AT_accessibility(DW_ACCESS_public)
    2207              $C$DW$373       .dwtag  DW_TAG_member
    2208                      .dwattr $C$DW$373, DW_AT_type(*$C$DW$T$23)
    2209                      .dwattr $C$DW$373, DW_AT_name("PCLKCR1")
    2210                      .dwattr $C$DW$373, DW_AT_TI_symbol_name("_PCLKCR1")
    2211                      .dwattr $C$DW$373, DW_AT_data_member_location[DW_OP_plus_uconst 0xd]
    2212                      .dwattr $C$DW$373, DW_AT_accessibility(DW_ACCESS_public)
    2213              $C$DW$374       .dwtag  DW_TAG_member
    2214                      .dwattr $C$DW$374, DW_AT_type(*$C$DW$T$26)
    2215                      .dwattr $C$DW$374, DW_AT_name("rsvd_3")
    2216                      .dwattr $C$DW$374, DW_AT_TI_symbol_name("_rsvd_3")
    2217                      .dwattr $C$DW$374, DW_AT_data_member_location[DW_OP_plus_uconst 0xe]
    2218                      .dwattr $C$DW$374, DW_AT_accessibility(DW_ACCESS_public)
    2219              $C$DW$375       .dwtag  DW_TAG_member
    2220                      .dwattr $C$DW$375, DW_AT_type(*$C$DW$T$23)
    2221                      .dwattr $C$DW$375, DW_AT_name("PCLKCR3")
    2222                      .dwattr $C$DW$375, DW_AT_TI_symbol_name("_PCLKCR3")
    2223                      .dwattr $C$DW$375, DW_AT_data_member_location[DW_OP_plus_uconst 0x10]
    2224                      .dwattr $C$DW$375, DW_AT_accessibility(DW_ACCESS_public)
    2225                      .dwendtag $C$DW$T$32
    2226              
    2227              $C$DW$T$50      .dwtag  DW_TAG_pointer_type
    2228                      .dwattr $C$DW$T$50, DW_AT_type(*$C$DW$T$32)
    2229                      .dwattr $C$DW$T$50, DW_AT_address_class(0x16)
    2230              $C$DW$T$51      .dwtag  DW_TAG_typedef, DW_AT_name("CLK_Handle")
    2231                      .dwattr $C$DW$T$51, DW_AT_type(*$C$DW$T$50)
    2232                      .dwattr $C$DW$T$51, DW_AT_language(DW_LANG_C)
    2233              
    2234              $C$DW$T$34      .dwtag  DW_TAG_structure_type
    2235                      .dwattr $C$DW$T$34, DW_AT_name("_CPU_Obj_")
    2236                      .dwattr $C$DW$T$34, DW_AT_byte_size(0x01)
    2237              $C$DW$376       .dwtag  DW_TAG_member
    2238                      .dwattr $C$DW$376, DW_AT_type(*$C$DW$T$33)
    2239                      .dwattr $C$DW$376, DW_AT_name("tmp")
    2240                      .dwattr $C$DW$376, DW_AT_TI_symbol_name("_tmp")
    2241                      .dwattr $C$DW$376, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    2242                      .dwattr $C$DW$376, DW_AT_accessibility(DW_ACCESS_public)
    2243                      .dwendtag $C$DW$T$34
    2244              
    2245              $C$DW$T$52      .dwtag  DW_TAG_pointer_type
    2246                      .dwattr $C$DW$T$52, DW_AT_type(*$C$DW$T$34)
    2247                      .dwattr $C$DW$T$52, DW_AT_address_class(0x16)
    2248              $C$DW$T$53      .dwtag  DW_TAG_typedef, DW_AT_name("CPU_Handle")
    2249                      .dwattr $C$DW$T$53, DW_AT_type(*$C$DW$T$52)
TMS320C2000 Assembler PC v6.2.5 Mon Sep 11 10:22:22 2017

Tools Copyright (c) 1996-2014 Texas Instruments Incorporated
C:\Users\wmj\AppData\Local\Temp\1488411                              PAGE   45

    2250                      .dwattr $C$DW$T$53, DW_AT_language(DW_LANG_C)
    2251              
    2252              $C$DW$T$37      .dwtag  DW_TAG_structure_type
    2253                      .dwattr $C$DW$T$37, DW_AT_name("_CTRL_Version_")
    2254                      .dwattr $C$DW$T$37, DW_AT_byte_size(0x04)
    2255              $C$DW$377       .dwtag  DW_TAG_member
    2256                      .dwattr $C$DW$377, DW_AT_type(*$C$DW$T$22)
    2257                      .dwattr $C$DW$377, DW_AT_name("rsvd")
    2258                      .dwattr $C$DW$377, DW_AT_TI_symbol_name("_rsvd")
    2259                      .dwattr $C$DW$377, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    2260                      .dwattr $C$DW$377, DW_AT_accessibility(DW_ACCESS_public)
    2261              $C$DW$378       .dwtag  DW_TAG_member
    2262                      .dwattr $C$DW$378, DW_AT_type(*$C$DW$T$36)
    2263                      .dwattr $C$DW$378, DW_AT_name("targetProc")
    2264                      .dwattr $C$DW$378, DW_AT_TI_symbol_name("_targetProc")
    2265                      .dwattr $C$DW$378, DW_AT_data_member_location[DW_OP_plus_uconst 0x1]
    2266                      .dwattr $C$DW$378, DW_AT_accessibility(DW_ACCESS_public)
    2267              $C$DW$379       .dwtag  DW_TAG_member
    2268                      .dwattr $C$DW$379, DW_AT_type(*$C$DW$T$22)
    2269                      .dwattr $C$DW$379, DW_AT_name("major")
    2270                      .dwattr $C$DW$379, DW_AT_TI_symbol_name("_major")
    2271                      .dwattr $C$DW$379, DW_AT_data_member_location[DW_OP_plus_uconst 0x2]
    2272                      .dwattr $C$DW$379, DW_AT_accessibility(DW_ACCESS_public)
    2273              $C$DW$380       .dwtag  DW_TAG_member
    2274                      .dwattr $C$DW$380, DW_AT_type(*$C$DW$T$22)
    2275                      .dwattr $C$DW$380, DW_AT_name("minor")
    2276                      .dwattr $C$DW$380, DW_AT_TI_symbol_name("_minor")
    2277                      .dwattr $C$DW$380, DW_AT_data_member_location[DW_OP_plus_uconst 0x3]
    2278                      .dwattr $C$DW$380, DW_AT_accessibility(DW_ACCESS_public)
    2279                      .dwendtag $C$DW$T$37
    2280              
    2281              $C$DW$T$114     .dwtag  DW_TAG_typedef, DW_AT_name("CTRL_Version")
    2282                      .dwattr $C$DW$T$114, DW_AT_type(*$C$DW$T$37)
    2283                      .dwattr $C$DW$T$114, DW_AT_language(DW_LANG_C)
    2284              
    2285              $C$DW$T$39      .dwtag  DW_TAG_structure_type
    2286                      .dwattr $C$DW$T$39, DW_AT_name("_FILTER_FO_")
    2287                      .dwattr $C$DW$T$39, DW_AT_byte_size(0x0a)
    2288              $C$DW$381       .dwtag  DW_TAG_member
    2289                      .dwattr $C$DW$381, DW_AT_type(*$C$DW$T$38)
    2290                      .dwattr $C$DW$381, DW_AT_name("a1")
    2291                      .dwattr $C$DW$381, DW_AT_TI_symbol_name("_a1")
    2292                      .dwattr $C$DW$381, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    2293                      .dwattr $C$DW$381, DW_AT_accessibility(DW_ACCESS_public)
    2294              $C$DW$382       .dwtag  DW_TAG_member
    2295                      .dwattr $C$DW$382, DW_AT_type(*$C$DW$T$38)
    2296                      .dwattr $C$DW$382, DW_AT_name("b0")
    2297                      .dwattr $C$DW$382, DW_AT_TI_symbol_name("_b0")
    2298                      .dwattr $C$DW$382, DW_AT_data_member_location[DW_OP_plus_uconst 0x2]
    2299                      .dwattr $C$DW$382, DW_AT_accessibility(DW_ACCESS_public)
    2300              $C$DW$383       .dwtag  DW_TAG_member
    2301                      .dwattr $C$DW$383, DW_AT_type(*$C$DW$T$38)
    2302                      .dwattr $C$DW$383, DW_AT_name("b1")
    2303                      .dwattr $C$DW$383, DW_AT_TI_symbol_name("_b1")
    2304                      .dwattr $C$DW$383, DW_AT_data_member_location[DW_OP_plus_uconst 0x4]
TMS320C2000 Assembler PC v6.2.5 Mon Sep 11 10:22:22 2017

Tools Copyright (c) 1996-2014 Texas Instruments Incorporated
C:\Users\wmj\AppData\Local\Temp\1488411                              PAGE   46

    2305                      .dwattr $C$DW$383, DW_AT_accessibility(DW_ACCESS_public)
    2306              $C$DW$384       .dwtag  DW_TAG_member
    2307                      .dwattr $C$DW$384, DW_AT_type(*$C$DW$T$38)
    2308                      .dwattr $C$DW$384, DW_AT_name("x1")
    2309                      .dwattr $C$DW$384, DW_AT_TI_symbol_name("_x1")
    2310                      .dwattr $C$DW$384, DW_AT_data_member_location[DW_OP_plus_uconst 0x6]
    2311                      .dwattr $C$DW$384, DW_AT_accessibility(DW_ACCESS_public)
    2312              $C$DW$385       .dwtag  DW_TAG_member
    2313                      .dwattr $C$DW$385, DW_AT_type(*$C$DW$T$38)
    2314                      .dwattr $C$DW$385, DW_AT_name("y1")
    2315                      .dwattr $C$DW$385, DW_AT_TI_symbol_name("_y1")
    2316                      .dwattr $C$DW$385, DW_AT_data_member_location[DW_OP_plus_uconst 0x8]
    2317                      .dwattr $C$DW$385, DW_AT_accessibility(DW_ACCESS_public)
    2318                      .dwendtag $C$DW$T$39
    2319              
    2320              $C$DW$T$117     .dwtag  DW_TAG_typedef, DW_AT_name("FILTER_FO_Obj")
    2321                      .dwattr $C$DW$T$117, DW_AT_type(*$C$DW$T$39)
    2322                      .dwattr $C$DW$T$117, DW_AT_language(DW_LANG_C)
    2323              
    2324              $C$DW$T$20      .dwtag  DW_TAG_structure_type
    2325                      .dwattr $C$DW$T$20, DW_AT_name("_FILTER_FO_Obj_")
    2326                      .dwattr $C$DW$T$20, DW_AT_declaration
    2327                      .dwendtag $C$DW$T$20
    2328              
    2329              $C$DW$T$118     .dwtag  DW_TAG_pointer_type
    2330                      .dwattr $C$DW$T$118, DW_AT_type(*$C$DW$T$20)
    2331                      .dwattr $C$DW$T$118, DW_AT_address_class(0x16)
    2332              $C$DW$T$119     .dwtag  DW_TAG_typedef, DW_AT_name("FILTER_FO_Handle")
    2333                      .dwattr $C$DW$T$119, DW_AT_type(*$C$DW$T$118)
    2334                      .dwattr $C$DW$T$119, DW_AT_language(DW_LANG_C)
    2335              
    2336              $C$DW$T$40      .dwtag  DW_TAG_structure_type
    2337                      .dwattr $C$DW$T$40, DW_AT_name("_FLASH_Obj_")
    2338                      .dwattr $C$DW$T$40, DW_AT_byte_size(0x08)
    2339              $C$DW$386       .dwtag  DW_TAG_member
    2340                      .dwattr $C$DW$386, DW_AT_type(*$C$DW$T$23)
    2341                      .dwattr $C$DW$386, DW_AT_name("FOPT")
    2342                      .dwattr $C$DW$386, DW_AT_TI_symbol_name("_FOPT")
    2343                      .dwattr $C$DW$386, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    2344                      .dwattr $C$DW$386, DW_AT_accessibility(DW_ACCESS_public)
    2345              $C$DW$387       .dwtag  DW_TAG_member
    2346                      .dwattr $C$DW$387, DW_AT_type(*$C$DW$T$23)
    2347                      .dwattr $C$DW$387, DW_AT_name("rsvd_1")
    2348                      .dwattr $C$DW$387, DW_AT_TI_symbol_name("_rsvd_1")
    2349                      .dwattr $C$DW$387, DW_AT_data_member_location[DW_OP_plus_uconst 0x1]
    2350                      .dwattr $C$DW$387, DW_AT_accessibility(DW_ACCESS_public)
    2351              $C$DW$388       .dwtag  DW_TAG_member
    2352                      .dwattr $C$DW$388, DW_AT_type(*$C$DW$T$23)
    2353                      .dwattr $C$DW$388, DW_AT_name("FPWR")
    2354                      .dwattr $C$DW$388, DW_AT_TI_symbol_name("_FPWR")
    2355                      .dwattr $C$DW$388, DW_AT_data_member_location[DW_OP_plus_uconst 0x2]
    2356                      .dwattr $C$DW$388, DW_AT_accessibility(DW_ACCESS_public)
    2357              $C$DW$389       .dwtag  DW_TAG_member
    2358                      .dwattr $C$DW$389, DW_AT_type(*$C$DW$T$23)
    2359                      .dwattr $C$DW$389, DW_AT_name("FSTATUS")
TMS320C2000 Assembler PC v6.2.5 Mon Sep 11 10:22:22 2017

Tools Copyright (c) 1996-2014 Texas Instruments Incorporated
C:\Users\wmj\AppData\Local\Temp\1488411                              PAGE   47

    2360                      .dwattr $C$DW$389, DW_AT_TI_symbol_name("_FSTATUS")
    2361                      .dwattr $C$DW$389, DW_AT_data_member_location[DW_OP_plus_uconst 0x3]
    2362                      .dwattr $C$DW$389, DW_AT_accessibility(DW_ACCESS_public)
    2363              $C$DW$390       .dwtag  DW_TAG_member
    2364                      .dwattr $C$DW$390, DW_AT_type(*$C$DW$T$23)
    2365                      .dwattr $C$DW$390, DW_AT_name("FSTDBYWAIT")
    2366                      .dwattr $C$DW$390, DW_AT_TI_symbol_name("_FSTDBYWAIT")
    2367                      .dwattr $C$DW$390, DW_AT_data_member_location[DW_OP_plus_uconst 0x4]
    2368                      .dwattr $C$DW$390, DW_AT_accessibility(DW_ACCESS_public)
    2369              $C$DW$391       .dwtag  DW_TAG_member
    2370                      .dwattr $C$DW$391, DW_AT_type(*$C$DW$T$23)
    2371                      .dwattr $C$DW$391, DW_AT_name("FACTIVEWAIT")
    2372                      .dwattr $C$DW$391, DW_AT_TI_symbol_name("_FACTIVEWAIT")
    2373                      .dwattr $C$DW$391, DW_AT_data_member_location[DW_OP_plus_uconst 0x5]
    2374                      .dwattr $C$DW$391, DW_AT_accessibility(DW_ACCESS_public)
    2375              $C$DW$392       .dwtag  DW_TAG_member
    2376                      .dwattr $C$DW$392, DW_AT_type(*$C$DW$T$23)
    2377                      .dwattr $C$DW$392, DW_AT_name("FBANKWAIT")
    2378                      .dwattr $C$DW$392, DW_AT_TI_symbol_name("_FBANKWAIT")
    2379                      .dwattr $C$DW$392, DW_AT_data_member_location[DW_OP_plus_uconst 0x6]
    2380                      .dwattr $C$DW$392, DW_AT_accessibility(DW_ACCESS_public)
    2381              $C$DW$393       .dwtag  DW_TAG_member
    2382                      .dwattr $C$DW$393, DW_AT_type(*$C$DW$T$23)
    2383                      .dwattr $C$DW$393, DW_AT_name("FOTPWAIT")
    2384                      .dwattr $C$DW$393, DW_AT_TI_symbol_name("_FOTPWAIT")
    2385                      .dwattr $C$DW$393, DW_AT_data_member_location[DW_OP_plus_uconst 0x7]
    2386                      .dwattr $C$DW$393, DW_AT_accessibility(DW_ACCESS_public)
    2387                      .dwendtag $C$DW$T$40
    2388              
    2389              $C$DW$T$54      .dwtag  DW_TAG_pointer_type
    2390                      .dwattr $C$DW$T$54, DW_AT_type(*$C$DW$T$40)
    2391                      .dwattr $C$DW$T$54, DW_AT_address_class(0x16)
    2392              $C$DW$T$55      .dwtag  DW_TAG_typedef, DW_AT_name("FLASH_Handle")
    2393                      .dwattr $C$DW$T$55, DW_AT_type(*$C$DW$T$54)
    2394                      .dwattr $C$DW$T$55, DW_AT_language(DW_LANG_C)
    2395              
    2396              $C$DW$T$45      .dwtag  DW_TAG_structure_type
    2397                      .dwattr $C$DW$T$45, DW_AT_name("_GPIO_Obj_")
    2398                      .dwattr $C$DW$T$45, DW_AT_byte_size(0x6a)
    2399              $C$DW$394       .dwtag  DW_TAG_member
    2400                      .dwattr $C$DW$394, DW_AT_type(*$C$DW$T$42)
    2401                      .dwattr $C$DW$394, DW_AT_name("GPACTRL")
    2402                      .dwattr $C$DW$394, DW_AT_TI_symbol_name("_GPACTRL")
    2403                      .dwattr $C$DW$394, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    2404                      .dwattr $C$DW$394, DW_AT_accessibility(DW_ACCESS_public)
    2405              $C$DW$395       .dwtag  DW_TAG_member
    2406                      .dwattr $C$DW$395, DW_AT_type(*$C$DW$T$42)
    2407                      .dwattr $C$DW$395, DW_AT_name("GPAQSEL1")
    2408                      .dwattr $C$DW$395, DW_AT_TI_symbol_name("_GPAQSEL1")
    2409                      .dwattr $C$DW$395, DW_AT_data_member_location[DW_OP_plus_uconst 0x2]
    2410                      .dwattr $C$DW$395, DW_AT_accessibility(DW_ACCESS_public)
    2411              $C$DW$396       .dwtag  DW_TAG_member
    2412                      .dwattr $C$DW$396, DW_AT_type(*$C$DW$T$42)
    2413                      .dwattr $C$DW$396, DW_AT_name("GPAQSEL2")
    2414                      .dwattr $C$DW$396, DW_AT_TI_symbol_name("_GPAQSEL2")
TMS320C2000 Assembler PC v6.2.5 Mon Sep 11 10:22:22 2017

Tools Copyright (c) 1996-2014 Texas Instruments Incorporated
C:\Users\wmj\AppData\Local\Temp\1488411                              PAGE   48

    2415                      .dwattr $C$DW$396, DW_AT_data_member_location[DW_OP_plus_uconst 0x4]
    2416                      .dwattr $C$DW$396, DW_AT_accessibility(DW_ACCESS_public)
    2417              $C$DW$397       .dwtag  DW_TAG_member
    2418                      .dwattr $C$DW$397, DW_AT_type(*$C$DW$T$42)
    2419                      .dwattr $C$DW$397, DW_AT_name("GPAMUX1")
    2420                      .dwattr $C$DW$397, DW_AT_TI_symbol_name("_GPAMUX1")
    2421                      .dwattr $C$DW$397, DW_AT_data_member_location[DW_OP_plus_uconst 0x6]
    2422                      .dwattr $C$DW$397, DW_AT_accessibility(DW_ACCESS_public)
    2423              $C$DW$398       .dwtag  DW_TAG_member
    2424                      .dwattr $C$DW$398, DW_AT_type(*$C$DW$T$42)
    2425                      .dwattr $C$DW$398, DW_AT_name("GPAMUX2")
    2426                      .dwattr $C$DW$398, DW_AT_TI_symbol_name("_GPAMUX2")
    2427                      .dwattr $C$DW$398, DW_AT_data_member_location[DW_OP_plus_uconst 0x8]
    2428                      .dwattr $C$DW$398, DW_AT_accessibility(DW_ACCESS_public)
    2429              $C$DW$399       .dwtag  DW_TAG_member
    2430                      .dwattr $C$DW$399, DW_AT_type(*$C$DW$T$42)
    2431                      .dwattr $C$DW$399, DW_AT_name("GPADIR")
    2432                      .dwattr $C$DW$399, DW_AT_TI_symbol_name("_GPADIR")
    2433                      .dwattr $C$DW$399, DW_AT_data_member_location[DW_OP_plus_uconst 0xa]
    2434                      .dwattr $C$DW$399, DW_AT_accessibility(DW_ACCESS_public)
    2435              $C$DW$400       .dwtag  DW_TAG_member
    2436                      .dwattr $C$DW$400, DW_AT_type(*$C$DW$T$42)
    2437                      .dwattr $C$DW$400, DW_AT_name("GPAPUD")
    2438                      .dwattr $C$DW$400, DW_AT_TI_symbol_name("_GPAPUD")
    2439                      .dwattr $C$DW$400, DW_AT_data_member_location[DW_OP_plus_uconst 0xc]
    2440                      .dwattr $C$DW$400, DW_AT_accessibility(DW_ACCESS_public)
    2441              $C$DW$401       .dwtag  DW_TAG_member
    2442                      .dwattr $C$DW$401, DW_AT_type(*$C$DW$T$26)
    2443                      .dwattr $C$DW$401, DW_AT_name("rsvd_1")
    2444                      .dwattr $C$DW$401, DW_AT_TI_symbol_name("_rsvd_1")
    2445                      .dwattr $C$DW$401, DW_AT_data_member_location[DW_OP_plus_uconst 0xe]
    2446                      .dwattr $C$DW$401, DW_AT_accessibility(DW_ACCESS_public)
    2447              $C$DW$402       .dwtag  DW_TAG_member
    2448                      .dwattr $C$DW$402, DW_AT_type(*$C$DW$T$42)
    2449                      .dwattr $C$DW$402, DW_AT_name("GPBCTRL")
    2450                      .dwattr $C$DW$402, DW_AT_TI_symbol_name("_GPBCTRL")
    2451                      .dwattr $C$DW$402, DW_AT_data_member_location[DW_OP_plus_uconst 0x10]
    2452                      .dwattr $C$DW$402, DW_AT_accessibility(DW_ACCESS_public)
    2453              $C$DW$403       .dwtag  DW_TAG_member
    2454                      .dwattr $C$DW$403, DW_AT_type(*$C$DW$T$42)
    2455                      .dwattr $C$DW$403, DW_AT_name("GPBQSEL1")
    2456                      .dwattr $C$DW$403, DW_AT_TI_symbol_name("_GPBQSEL1")
    2457                      .dwattr $C$DW$403, DW_AT_data_member_location[DW_OP_plus_uconst 0x12]
    2458                      .dwattr $C$DW$403, DW_AT_accessibility(DW_ACCESS_public)
    2459              $C$DW$404       .dwtag  DW_TAG_member
    2460                      .dwattr $C$DW$404, DW_AT_type(*$C$DW$T$26)
    2461                      .dwattr $C$DW$404, DW_AT_name("rsvd_2")
    2462                      .dwattr $C$DW$404, DW_AT_TI_symbol_name("_rsvd_2")
    2463                      .dwattr $C$DW$404, DW_AT_data_member_location[DW_OP_plus_uconst 0x14]
    2464                      .dwattr $C$DW$404, DW_AT_accessibility(DW_ACCESS_public)
    2465              $C$DW$405       .dwtag  DW_TAG_member
    2466                      .dwattr $C$DW$405, DW_AT_type(*$C$DW$T$42)
    2467                      .dwattr $C$DW$405, DW_AT_name("GPBMUX1")
    2468                      .dwattr $C$DW$405, DW_AT_TI_symbol_name("_GPBMUX1")
    2469                      .dwattr $C$DW$405, DW_AT_data_member_location[DW_OP_plus_uconst 0x16]
TMS320C2000 Assembler PC v6.2.5 Mon Sep 11 10:22:22 2017

Tools Copyright (c) 1996-2014 Texas Instruments Incorporated
C:\Users\wmj\AppData\Local\Temp\1488411                              PAGE   49

    2470                      .dwattr $C$DW$405, DW_AT_accessibility(DW_ACCESS_public)
    2471              $C$DW$406       .dwtag  DW_TAG_member
    2472                      .dwattr $C$DW$406, DW_AT_type(*$C$DW$T$26)
    2473                      .dwattr $C$DW$406, DW_AT_name("rsvd_3")
    2474                      .dwattr $C$DW$406, DW_AT_TI_symbol_name("_rsvd_3")
    2475                      .dwattr $C$DW$406, DW_AT_data_member_location[DW_OP_plus_uconst 0x18]
    2476                      .dwattr $C$DW$406, DW_AT_accessibility(DW_ACCESS_public)
    2477              $C$DW$407       .dwtag  DW_TAG_member
    2478                      .dwattr $C$DW$407, DW_AT_type(*$C$DW$T$42)
    2479                      .dwattr $C$DW$407, DW_AT_name("GPBDIR")
    2480                      .dwattr $C$DW$407, DW_AT_TI_symbol_name("_GPBDIR")
    2481                      .dwattr $C$DW$407, DW_AT_data_member_location[DW_OP_plus_uconst 0x1a]
    2482                      .dwattr $C$DW$407, DW_AT_accessibility(DW_ACCESS_public)
    2483              $C$DW$408       .dwtag  DW_TAG_member
    2484                      .dwattr $C$DW$408, DW_AT_type(*$C$DW$T$42)
    2485                      .dwattr $C$DW$408, DW_AT_name("GPBPUD")
    2486                      .dwattr $C$DW$408, DW_AT_TI_symbol_name("_GPBPUD")
    2487                      .dwattr $C$DW$408, DW_AT_data_member_location[DW_OP_plus_uconst 0x1c]
    2488                      .dwattr $C$DW$408, DW_AT_accessibility(DW_ACCESS_public)
    2489              $C$DW$409       .dwtag  DW_TAG_member
    2490                      .dwattr $C$DW$409, DW_AT_type(*$C$DW$T$43)
    2491                      .dwattr $C$DW$409, DW_AT_name("rsvd_4")
    2492                      .dwattr $C$DW$409, DW_AT_TI_symbol_name("_rsvd_4")
    2493                      .dwattr $C$DW$409, DW_AT_data_member_location[DW_OP_plus_uconst 0x1e]
    2494                      .dwattr $C$DW$409, DW_AT_accessibility(DW_ACCESS_public)
    2495              $C$DW$410       .dwtag  DW_TAG_member
    2496                      .dwattr $C$DW$410, DW_AT_type(*$C$DW$T$42)
    2497                      .dwattr $C$DW$410, DW_AT_name("AIOMUX1")
    2498                      .dwattr $C$DW$410, DW_AT_TI_symbol_name("_AIOMUX1")
    2499                      .dwattr $C$DW$410, DW_AT_data_member_location[DW_OP_plus_uconst 0x36]
    2500                      .dwattr $C$DW$410, DW_AT_accessibility(DW_ACCESS_public)
    2501              $C$DW$411       .dwtag  DW_TAG_member
    2502                      .dwattr $C$DW$411, DW_AT_type(*$C$DW$T$26)
    2503                      .dwattr $C$DW$411, DW_AT_name("rsvd_5")
    2504                      .dwattr $C$DW$411, DW_AT_TI_symbol_name("_rsvd_5")
    2505                      .dwattr $C$DW$411, DW_AT_data_member_location[DW_OP_plus_uconst 0x38]
    2506                      .dwattr $C$DW$411, DW_AT_accessibility(DW_ACCESS_public)
    2507              $C$DW$412       .dwtag  DW_TAG_member
    2508                      .dwattr $C$DW$412, DW_AT_type(*$C$DW$T$42)
    2509                      .dwattr $C$DW$412, DW_AT_name("AIODIR")
    2510                      .dwattr $C$DW$412, DW_AT_TI_symbol_name("_AIODIR")
    2511                      .dwattr $C$DW$412, DW_AT_data_member_location[DW_OP_plus_uconst 0x3a]
    2512                      .dwattr $C$DW$412, DW_AT_accessibility(DW_ACCESS_public)
    2513              $C$DW$413       .dwtag  DW_TAG_member
    2514                      .dwattr $C$DW$413, DW_AT_type(*$C$DW$T$44)
    2515                      .dwattr $C$DW$413, DW_AT_name("rsvd_6")
    2516                      .dwattr $C$DW$413, DW_AT_TI_symbol_name("_rsvd_6")
    2517                      .dwattr $C$DW$413, DW_AT_data_member_location[DW_OP_plus_uconst 0x3c]
    2518                      .dwattr $C$DW$413, DW_AT_accessibility(DW_ACCESS_public)
    2519              $C$DW$414       .dwtag  DW_TAG_member
    2520                      .dwattr $C$DW$414, DW_AT_type(*$C$DW$T$42)
    2521                      .dwattr $C$DW$414, DW_AT_name("GPADAT")
    2522                      .dwattr $C$DW$414, DW_AT_TI_symbol_name("_GPADAT")
    2523                      .dwattr $C$DW$414, DW_AT_data_member_location[DW_OP_plus_uconst 0x40]
    2524                      .dwattr $C$DW$414, DW_AT_accessibility(DW_ACCESS_public)
TMS320C2000 Assembler PC v6.2.5 Mon Sep 11 10:22:22 2017

Tools Copyright (c) 1996-2014 Texas Instruments Incorporated
C:\Users\wmj\AppData\Local\Temp\1488411                              PAGE   50

    2525              $C$DW$415       .dwtag  DW_TAG_member
    2526                      .dwattr $C$DW$415, DW_AT_type(*$C$DW$T$42)
    2527                      .dwattr $C$DW$415, DW_AT_name("GPASET")
    2528                      .dwattr $C$DW$415, DW_AT_TI_symbol_name("_GPASET")
    2529                      .dwattr $C$DW$415, DW_AT_data_member_location[DW_OP_plus_uconst 0x42]
    2530                      .dwattr $C$DW$415, DW_AT_accessibility(DW_ACCESS_public)
    2531              $C$DW$416       .dwtag  DW_TAG_member
    2532                      .dwattr $C$DW$416, DW_AT_type(*$C$DW$T$42)
    2533                      .dwattr $C$DW$416, DW_AT_name("GPACLEAR")
    2534                      .dwattr $C$DW$416, DW_AT_TI_symbol_name("_GPACLEAR")
    2535                      .dwattr $C$DW$416, DW_AT_data_member_location[DW_OP_plus_uconst 0x44]
    2536                      .dwattr $C$DW$416, DW_AT_accessibility(DW_ACCESS_public)
    2537              $C$DW$417       .dwtag  DW_TAG_member
    2538                      .dwattr $C$DW$417, DW_AT_type(*$C$DW$T$42)
    2539                      .dwattr $C$DW$417, DW_AT_name("GPATOGGLE")
    2540                      .dwattr $C$DW$417, DW_AT_TI_symbol_name("_GPATOGGLE")
    2541                      .dwattr $C$DW$417, DW_AT_data_member_location[DW_OP_plus_uconst 0x46]
    2542                      .dwattr $C$DW$417, DW_AT_accessibility(DW_ACCESS_public)
    2543              $C$DW$418       .dwtag  DW_TAG_member
    2544                      .dwattr $C$DW$418, DW_AT_type(*$C$DW$T$42)
    2545                      .dwattr $C$DW$418, DW_AT_name("GPBDAT")
    2546                      .dwattr $C$DW$418, DW_AT_TI_symbol_name("_GPBDAT")
    2547                      .dwattr $C$DW$418, DW_AT_data_member_location[DW_OP_plus_uconst 0x48]
    2548                      .dwattr $C$DW$418, DW_AT_accessibility(DW_ACCESS_public)
    2549              $C$DW$419       .dwtag  DW_TAG_member
    2550                      .dwattr $C$DW$419, DW_AT_type(*$C$DW$T$42)
    2551                      .dwattr $C$DW$419, DW_AT_name("GPBSET")
    2552                      .dwattr $C$DW$419, DW_AT_TI_symbol_name("_GPBSET")
    2553                      .dwattr $C$DW$419, DW_AT_data_member_location[DW_OP_plus_uconst 0x4a]
    2554                      .dwattr $C$DW$419, DW_AT_accessibility(DW_ACCESS_public)
    2555              $C$DW$420       .dwtag  DW_TAG_member
    2556                      .dwattr $C$DW$420, DW_AT_type(*$C$DW$T$42)
    2557                      .dwattr $C$DW$420, DW_AT_name("GPBCLEAR")
    2558                      .dwattr $C$DW$420, DW_AT_TI_symbol_name("_GPBCLEAR")
    2559                      .dwattr $C$DW$420, DW_AT_data_member_location[DW_OP_plus_uconst 0x4c]
    2560                      .dwattr $C$DW$420, DW_AT_accessibility(DW_ACCESS_public)
    2561              $C$DW$421       .dwtag  DW_TAG_member
    2562                      .dwattr $C$DW$421, DW_AT_type(*$C$DW$T$42)
    2563                      .dwattr $C$DW$421, DW_AT_name("GPBTOGGLE")
    2564                      .dwattr $C$DW$421, DW_AT_TI_symbol_name("_GPBTOGGLE")
    2565                      .dwattr $C$DW$421, DW_AT_data_member_location[DW_OP_plus_uconst 0x4e]
    2566                      .dwattr $C$DW$421, DW_AT_accessibility(DW_ACCESS_public)
    2567              $C$DW$422       .dwtag  DW_TAG_member
    2568                      .dwattr $C$DW$422, DW_AT_type(*$C$DW$T$31)
    2569                      .dwattr $C$DW$422, DW_AT_name("rsvd_7")
    2570                      .dwattr $C$DW$422, DW_AT_TI_symbol_name("_rsvd_7")
    2571                      .dwattr $C$DW$422, DW_AT_data_member_location[DW_OP_plus_uconst 0x50]
    2572                      .dwattr $C$DW$422, DW_AT_accessibility(DW_ACCESS_public)
    2573              $C$DW$423       .dwtag  DW_TAG_member
    2574                      .dwattr $C$DW$423, DW_AT_type(*$C$DW$T$42)
    2575                      .dwattr $C$DW$423, DW_AT_name("AIODAT")
    2576                      .dwattr $C$DW$423, DW_AT_TI_symbol_name("_AIODAT")
    2577                      .dwattr $C$DW$423, DW_AT_data_member_location[DW_OP_plus_uconst 0x58]
    2578                      .dwattr $C$DW$423, DW_AT_accessibility(DW_ACCESS_public)
    2579              $C$DW$424       .dwtag  DW_TAG_member
TMS320C2000 Assembler PC v6.2.5 Mon Sep 11 10:22:22 2017

Tools Copyright (c) 1996-2014 Texas Instruments Incorporated
C:\Users\wmj\AppData\Local\Temp\1488411                              PAGE   51

    2580                      .dwattr $C$DW$424, DW_AT_type(*$C$DW$T$42)
    2581                      .dwattr $C$DW$424, DW_AT_name("AIOSET")
    2582                      .dwattr $C$DW$424, DW_AT_TI_symbol_name("_AIOSET")
    2583                      .dwattr $C$DW$424, DW_AT_data_member_location[DW_OP_plus_uconst 0x5a]
    2584                      .dwattr $C$DW$424, DW_AT_accessibility(DW_ACCESS_public)
    2585              $C$DW$425       .dwtag  DW_TAG_member
    2586                      .dwattr $C$DW$425, DW_AT_type(*$C$DW$T$42)
    2587                      .dwattr $C$DW$425, DW_AT_name("AIOCLEAR")
    2588                      .dwattr $C$DW$425, DW_AT_TI_symbol_name("_AIOCLEAR")
    2589                      .dwattr $C$DW$425, DW_AT_data_member_location[DW_OP_plus_uconst 0x5c]
    2590                      .dwattr $C$DW$425, DW_AT_accessibility(DW_ACCESS_public)
    2591              $C$DW$426       .dwtag  DW_TAG_member
    2592                      .dwattr $C$DW$426, DW_AT_type(*$C$DW$T$42)
    2593                      .dwattr $C$DW$426, DW_AT_name("AIOTOGGLE")
    2594                      .dwattr $C$DW$426, DW_AT_TI_symbol_name("_AIOTOGGLE")
    2595                      .dwattr $C$DW$426, DW_AT_data_member_location[DW_OP_plus_uconst 0x5e]
    2596                      .dwattr $C$DW$426, DW_AT_accessibility(DW_ACCESS_public)
    2597              $C$DW$427       .dwtag  DW_TAG_member
    2598                      .dwattr $C$DW$427, DW_AT_type(*$C$DW$T$28)
    2599                      .dwattr $C$DW$427, DW_AT_name("GPIOXINTnSEL")
    2600                      .dwattr $C$DW$427, DW_AT_TI_symbol_name("_GPIOXINTnSEL")
    2601                      .dwattr $C$DW$427, DW_AT_data_member_location[DW_OP_plus_uconst 0x60]
    2602                      .dwattr $C$DW$427, DW_AT_accessibility(DW_ACCESS_public)
    2603              $C$DW$428       .dwtag  DW_TAG_member
    2604                      .dwattr $C$DW$428, DW_AT_type(*$C$DW$T$27)
    2605                      .dwattr $C$DW$428, DW_AT_name("rsvd_8")
    2606                      .dwattr $C$DW$428, DW_AT_TI_symbol_name("_rsvd_8")
    2607                      .dwattr $C$DW$428, DW_AT_data_member_location[DW_OP_plus_uconst 0x63]
    2608                      .dwattr $C$DW$428, DW_AT_accessibility(DW_ACCESS_public)
    2609              $C$DW$429       .dwtag  DW_TAG_member
    2610                      .dwattr $C$DW$429, DW_AT_type(*$C$DW$T$42)
    2611                      .dwattr $C$DW$429, DW_AT_name("GPIOLPMSEL")
    2612                      .dwattr $C$DW$429, DW_AT_TI_symbol_name("_GPIOLPMSEL")
    2613                      .dwattr $C$DW$429, DW_AT_data_member_location[DW_OP_plus_uconst 0x68]
    2614                      .dwattr $C$DW$429, DW_AT_accessibility(DW_ACCESS_public)
    2615                      .dwendtag $C$DW$T$45
    2616              
    2617              $C$DW$T$56      .dwtag  DW_TAG_pointer_type
    2618                      .dwattr $C$DW$T$56, DW_AT_type(*$C$DW$T$45)
    2619                      .dwattr $C$DW$T$56, DW_AT_address_class(0x16)
    2620              $C$DW$T$57      .dwtag  DW_TAG_typedef, DW_AT_name("GPIO_Handle")
    2621                      .dwattr $C$DW$T$57, DW_AT_type(*$C$DW$T$56)
    2622                      .dwattr $C$DW$T$57, DW_AT_language(DW_LANG_C)
    2623              
    2624              $C$DW$T$47      .dwtag  DW_TAG_structure_type
    2625                      .dwattr $C$DW$T$47, DW_AT_name("_HAL_AdcData_t_")
    2626                      .dwattr $C$DW$T$47, DW_AT_byte_size(0x16)
    2627              $C$DW$430       .dwtag  DW_TAG_member
    2628                      .dwattr $C$DW$430, DW_AT_type(*$C$DW$T$46)
    2629                      .dwattr $C$DW$430, DW_AT_name("I")
    2630                      .dwattr $C$DW$430, DW_AT_TI_symbol_name("_I")
    2631                      .dwattr $C$DW$430, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    2632                      .dwattr $C$DW$430, DW_AT_accessibility(DW_ACCESS_public)
    2633              $C$DW$431       .dwtag  DW_TAG_member
    2634                      .dwattr $C$DW$431, DW_AT_type(*$C$DW$T$46)
TMS320C2000 Assembler PC v6.2.5 Mon Sep 11 10:22:22 2017

Tools Copyright (c) 1996-2014 Texas Instruments Incorporated
C:\Users\wmj\AppData\Local\Temp\1488411                              PAGE   52

    2635                      .dwattr $C$DW$431, DW_AT_name("V")
    2636                      .dwattr $C$DW$431, DW_AT_TI_symbol_name("_V")
    2637                      .dwattr $C$DW$431, DW_AT_data_member_location[DW_OP_plus_uconst 0x6]
    2638                      .dwattr $C$DW$431, DW_AT_accessibility(DW_ACCESS_public)
    2639              $C$DW$432       .dwtag  DW_TAG_member
    2640                      .dwattr $C$DW$432, DW_AT_type(*$C$DW$T$38)
    2641                      .dwattr $C$DW$432, DW_AT_name("dcBus")
    2642                      .dwattr $C$DW$432, DW_AT_TI_symbol_name("_dcBus")
    2643                      .dwattr $C$DW$432, DW_AT_data_member_location[DW_OP_plus_uconst 0xc]
    2644                      .dwattr $C$DW$432, DW_AT_accessibility(DW_ACCESS_public)
    2645              $C$DW$433       .dwtag  DW_TAG_member
    2646                      .dwattr $C$DW$433, DW_AT_type(*$C$DW$T$38)
    2647                      .dwattr $C$DW$433, DW_AT_name("analogSensor1")
    2648                      .dwattr $C$DW$433, DW_AT_TI_symbol_name("_analogSensor1")
    2649                      .dwattr $C$DW$433, DW_AT_data_member_location[DW_OP_plus_uconst 0xe]
    2650                      .dwattr $C$DW$433, DW_AT_accessibility(DW_ACCESS_public)
    2651              $C$DW$434       .dwtag  DW_TAG_member
    2652                      .dwattr $C$DW$434, DW_AT_type(*$C$DW$T$38)
    2653                      .dwattr $C$DW$434, DW_AT_name("analogSensor2")
    2654                      .dwattr $C$DW$434, DW_AT_TI_symbol_name("_analogSensor2")
    2655                      .dwattr $C$DW$434, DW_AT_data_member_location[DW_OP_plus_uconst 0x10]
    2656                      .dwattr $C$DW$434, DW_AT_accessibility(DW_ACCESS_public)
    2657              $C$DW$435       .dwtag  DW_TAG_member
    2658                      .dwattr $C$DW$435, DW_AT_type(*$C$DW$T$38)
    2659                      .dwattr $C$DW$435, DW_AT_name("igbtNTC")
    2660                      .dwattr $C$DW$435, DW_AT_TI_symbol_name("_igbtNTC")
    2661                      .dwattr $C$DW$435, DW_AT_data_member_location[DW_OP_plus_uconst 0x12]
    2662                      .dwattr $C$DW$435, DW_AT_accessibility(DW_ACCESS_public)
    2663              $C$DW$436       .dwtag  DW_TAG_member
    2664                      .dwattr $C$DW$436, DW_AT_type(*$C$DW$T$38)
    2665                      .dwattr $C$DW$436, DW_AT_name("boardAddr")
    2666                      .dwattr $C$DW$436, DW_AT_TI_symbol_name("_boardAddr")
    2667                      .dwattr $C$DW$436, DW_AT_data_member_location[DW_OP_plus_uconst 0x14]
    2668                      .dwattr $C$DW$436, DW_AT_accessibility(DW_ACCESS_public)
    2669                      .dwendtag $C$DW$T$47
    2670              
    2671              $C$DW$T$85      .dwtag  DW_TAG_typedef, DW_AT_name("HAL_AdcData_t")
    2672                      .dwattr $C$DW$T$85, DW_AT_type(*$C$DW$T$47)
    2673                      .dwattr $C$DW$T$85, DW_AT_language(DW_LANG_C)
    2674              
    2675              $C$DW$T$86      .dwtag  DW_TAG_structure_type
    2676                      .dwattr $C$DW$T$86, DW_AT_name("_HAL_Obj_")
    2677                      .dwattr $C$DW$T$86, DW_AT_byte_size(0xb4)
    2678              $C$DW$437       .dwtag  DW_TAG_member
    2679                      .dwattr $C$DW$437, DW_AT_type(*$C$DW$T$49)
    2680                      .dwattr $C$DW$437, DW_AT_name("adcHandle")
    2681                      .dwattr $C$DW$437, DW_AT_TI_symbol_name("_adcHandle")
    2682                      .dwattr $C$DW$437, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    2683                      .dwattr $C$DW$437, DW_AT_accessibility(DW_ACCESS_public)
    2684              $C$DW$438       .dwtag  DW_TAG_member
    2685                      .dwattr $C$DW$438, DW_AT_type(*$C$DW$T$51)
    2686                      .dwattr $C$DW$438, DW_AT_name("clkHandle")
    2687                      .dwattr $C$DW$438, DW_AT_TI_symbol_name("_clkHandle")
    2688                      .dwattr $C$DW$438, DW_AT_data_member_location[DW_OP_plus_uconst 0x2]
    2689                      .dwattr $C$DW$438, DW_AT_accessibility(DW_ACCESS_public)
TMS320C2000 Assembler PC v6.2.5 Mon Sep 11 10:22:22 2017

Tools Copyright (c) 1996-2014 Texas Instruments Incorporated
C:\Users\wmj\AppData\Local\Temp\1488411                              PAGE   53

    2690              $C$DW$439       .dwtag  DW_TAG_member
    2691                      .dwattr $C$DW$439, DW_AT_type(*$C$DW$T$53)
    2692                      .dwattr $C$DW$439, DW_AT_name("cpuHandle")
    2693                      .dwattr $C$DW$439, DW_AT_TI_symbol_name("_cpuHandle")
    2694                      .dwattr $C$DW$439, DW_AT_data_member_location[DW_OP_plus_uconst 0x4]
    2695                      .dwattr $C$DW$439, DW_AT_accessibility(DW_ACCESS_public)
    2696              $C$DW$440       .dwtag  DW_TAG_member
    2697                      .dwattr $C$DW$440, DW_AT_type(*$C$DW$T$55)
    2698                      .dwattr $C$DW$440, DW_AT_name("flashHandle")
    2699                      .dwattr $C$DW$440, DW_AT_TI_symbol_name("_flashHandle")
    2700                      .dwattr $C$DW$440, DW_AT_data_member_location[DW_OP_plus_uconst 0x6]
    2701                      .dwattr $C$DW$440, DW_AT_accessibility(DW_ACCESS_public)
    2702              $C$DW$441       .dwtag  DW_TAG_member
    2703                      .dwattr $C$DW$441, DW_AT_type(*$C$DW$T$57)
    2704                      .dwattr $C$DW$441, DW_AT_name("gpioHandle")
    2705                      .dwattr $C$DW$441, DW_AT_TI_symbol_name("_gpioHandle")
    2706                      .dwattr $C$DW$441, DW_AT_data_member_location[DW_OP_plus_uconst 0x8]
    2707                      .dwattr $C$DW$441, DW_AT_accessibility(DW_ACCESS_public)
    2708              $C$DW$442       .dwtag  DW_TAG_member
    2709                      .dwattr $C$DW$442, DW_AT_type(*$C$DW$T$60)
    2710                      .dwattr $C$DW$442, DW_AT_name("offsetHandle_I")
    2711                      .dwattr $C$DW$442, DW_AT_TI_symbol_name("_offsetHandle_I")
    2712                      .dwattr $C$DW$442, DW_AT_data_member_location[DW_OP_plus_uconst 0xa]
    2713                      .dwattr $C$DW$442, DW_AT_accessibility(DW_ACCESS_public)
    2714              $C$DW$443       .dwtag  DW_TAG_member
    2715                      .dwattr $C$DW$443, DW_AT_type(*$C$DW$T$62)
    2716                      .dwattr $C$DW$443, DW_AT_name("offset_I")
    2717                      .dwattr $C$DW$443, DW_AT_TI_symbol_name("_offset_I")
    2718                      .dwattr $C$DW$443, DW_AT_data_member_location[DW_OP_plus_uconst 0x10]
    2719                      .dwattr $C$DW$443, DW_AT_accessibility(DW_ACCESS_public)
    2720              $C$DW$444       .dwtag  DW_TAG_member
    2721                      .dwattr $C$DW$444, DW_AT_type(*$C$DW$T$60)
    2722                      .dwattr $C$DW$444, DW_AT_name("offsetHandle_V")
    2723                      .dwattr $C$DW$444, DW_AT_TI_symbol_name("_offsetHandle_V")
    2724                      .dwattr $C$DW$444, DW_AT_data_member_location[DW_OP_plus_uconst 0x40]
    2725                      .dwattr $C$DW$444, DW_AT_accessibility(DW_ACCESS_public)
    2726              $C$DW$445       .dwtag  DW_TAG_member
    2727                      .dwattr $C$DW$445, DW_AT_type(*$C$DW$T$62)
    2728                      .dwattr $C$DW$445, DW_AT_name("offset_V")
    2729                      .dwattr $C$DW$445, DW_AT_TI_symbol_name("_offset_V")
    2730                      .dwattr $C$DW$445, DW_AT_data_member_location[DW_OP_plus_uconst 0x46]
    2731                      .dwattr $C$DW$445, DW_AT_accessibility(DW_ACCESS_public)
    2732              $C$DW$446       .dwtag  DW_TAG_member
    2733                      .dwattr $C$DW$446, DW_AT_type(*$C$DW$T$64)
    2734                      .dwattr $C$DW$446, DW_AT_name("oscHandle")
    2735                      .dwattr $C$DW$446, DW_AT_TI_symbol_name("_oscHandle")
    2736                      .dwattr $C$DW$446, DW_AT_data_member_location[DW_OP_plus_uconst 0x76]
    2737                      .dwattr $C$DW$446, DW_AT_accessibility(DW_ACCESS_public)
    2738              $C$DW$447       .dwtag  DW_TAG_member
    2739                      .dwattr $C$DW$447, DW_AT_type(*$C$DW$T$66)
    2740                      .dwattr $C$DW$447, DW_AT_name("pieHandle")
    2741                      .dwattr $C$DW$447, DW_AT_TI_symbol_name("_pieHandle")
    2742                      .dwattr $C$DW$447, DW_AT_data_member_location[DW_OP_plus_uconst 0x78]
    2743                      .dwattr $C$DW$447, DW_AT_accessibility(DW_ACCESS_public)
    2744              $C$DW$448       .dwtag  DW_TAG_member
TMS320C2000 Assembler PC v6.2.5 Mon Sep 11 10:22:22 2017

Tools Copyright (c) 1996-2014 Texas Instruments Incorporated
C:\Users\wmj\AppData\Local\Temp\1488411                              PAGE   54

    2745                      .dwattr $C$DW$448, DW_AT_type(*$C$DW$T$68)
    2746                      .dwattr $C$DW$448, DW_AT_name("pllHandle")
    2747                      .dwattr $C$DW$448, DW_AT_TI_symbol_name("_pllHandle")
    2748                      .dwattr $C$DW$448, DW_AT_data_member_location[DW_OP_plus_uconst 0x7a]
    2749                      .dwattr $C$DW$448, DW_AT_accessibility(DW_ACCESS_public)
    2750              $C$DW$449       .dwtag  DW_TAG_member
    2751                      .dwattr $C$DW$449, DW_AT_type(*$C$DW$T$71)
    2752                      .dwattr $C$DW$449, DW_AT_name("pwmHandle")
    2753                      .dwattr $C$DW$449, DW_AT_TI_symbol_name("_pwmHandle")
    2754                      .dwattr $C$DW$449, DW_AT_data_member_location[DW_OP_plus_uconst 0x7c]
    2755                      .dwattr $C$DW$449, DW_AT_accessibility(DW_ACCESS_public)
    2756              $C$DW$450       .dwtag  DW_TAG_member
    2757                      .dwattr $C$DW$450, DW_AT_type(*$C$DW$T$71)
    2758                      .dwattr $C$DW$450, DW_AT_name("pwmDacHandle")
    2759                      .dwattr $C$DW$450, DW_AT_TI_symbol_name("_pwmDacHandle")
    2760                      .dwattr $C$DW$450, DW_AT_data_member_location[DW_OP_plus_uconst 0x82]
    2761                      .dwattr $C$DW$450, DW_AT_accessibility(DW_ACCESS_public)
    2762              $C$DW$451       .dwtag  DW_TAG_member
    2763                      .dwattr $C$DW$451, DW_AT_type(*$C$DW$T$73)
    2764                      .dwattr $C$DW$451, DW_AT_name("pwrHandle")
    2765                      .dwattr $C$DW$451, DW_AT_TI_symbol_name("_pwrHandle")
    2766                      .dwattr $C$DW$451, DW_AT_data_member_location[DW_OP_plus_uconst 0x88]
    2767                      .dwattr $C$DW$451, DW_AT_accessibility(DW_ACCESS_public)
    2768              $C$DW$452       .dwtag  DW_TAG_member
    2769                      .dwattr $C$DW$452, DW_AT_type(*$C$DW$T$76)
    2770                      .dwattr $C$DW$452, DW_AT_name("timerHandle")
    2771                      .dwattr $C$DW$452, DW_AT_TI_symbol_name("_timerHandle")
    2772                      .dwattr $C$DW$452, DW_AT_data_member_location[DW_OP_plus_uconst 0x8a]
    2773                      .dwattr $C$DW$452, DW_AT_accessibility(DW_ACCESS_public)
    2774              $C$DW$453       .dwtag  DW_TAG_member
    2775                      .dwattr $C$DW$453, DW_AT_type(*$C$DW$T$78)
    2776                      .dwattr $C$DW$453, DW_AT_name("i2cHandle")
    2777                      .dwattr $C$DW$453, DW_AT_TI_symbol_name("_i2cHandle")
    2778                      .dwattr $C$DW$453, DW_AT_data_member_location[DW_OP_plus_uconst 0x90]
    2779                      .dwattr $C$DW$453, DW_AT_accessibility(DW_ACCESS_public)
    2780              $C$DW$454       .dwtag  DW_TAG_member
    2781                      .dwattr $C$DW$454, DW_AT_type(*$C$DW$T$80)
    2782                      .dwattr $C$DW$454, DW_AT_name("spiAHandle")
    2783                      .dwattr $C$DW$454, DW_AT_TI_symbol_name("_spiAHandle")
    2784                      .dwattr $C$DW$454, DW_AT_data_member_location[DW_OP_plus_uconst 0x92]
    2785                      .dwattr $C$DW$454, DW_AT_accessibility(DW_ACCESS_public)
    2786              $C$DW$455       .dwtag  DW_TAG_member
    2787                      .dwattr $C$DW$455, DW_AT_type(*$C$DW$T$82)
    2788                      .dwattr $C$DW$455, DW_AT_name("wdogHandle")
    2789                      .dwattr $C$DW$455, DW_AT_TI_symbol_name("_wdogHandle")
    2790                      .dwattr $C$DW$455, DW_AT_data_member_location[DW_OP_plus_uconst 0x94]
    2791                      .dwattr $C$DW$455, DW_AT_accessibility(DW_ACCESS_public)
    2792              $C$DW$456       .dwtag  DW_TAG_member
    2793                      .dwattr $C$DW$456, DW_AT_type(*$C$DW$T$84)
    2794                      .dwattr $C$DW$456, DW_AT_name("sciHandle")
    2795                      .dwattr $C$DW$456, DW_AT_TI_symbol_name("_sciHandle")
    2796                      .dwattr $C$DW$456, DW_AT_data_member_location[DW_OP_plus_uconst 0x96]
    2797                      .dwattr $C$DW$456, DW_AT_accessibility(DW_ACCESS_public)
    2798              $C$DW$457       .dwtag  DW_TAG_member
    2799                      .dwattr $C$DW$457, DW_AT_type(*$C$DW$T$85)
TMS320C2000 Assembler PC v6.2.5 Mon Sep 11 10:22:22 2017

Tools Copyright (c) 1996-2014 Texas Instruments Incorporated
C:\Users\wmj\AppData\Local\Temp\1488411                              PAGE   55

    2800                      .dwattr $C$DW$457, DW_AT_name("adcBias")
    2801                      .dwattr $C$DW$457, DW_AT_TI_symbol_name("_adcBias")
    2802                      .dwattr $C$DW$457, DW_AT_data_member_location[DW_OP_plus_uconst 0x98]
    2803                      .dwattr $C$DW$457, DW_AT_accessibility(DW_ACCESS_public)
    2804              $C$DW$458       .dwtag  DW_TAG_member
    2805                      .dwattr $C$DW$458, DW_AT_type(*$C$DW$T$38)
    2806                      .dwattr $C$DW$458, DW_AT_name("current_sf")
    2807                      .dwattr $C$DW$458, DW_AT_TI_symbol_name("_current_sf")
    2808                      .dwattr $C$DW$458, DW_AT_data_member_location[DW_OP_plus_uconst 0xae]
    2809                      .dwattr $C$DW$458, DW_AT_accessibility(DW_ACCESS_public)
    2810              $C$DW$459       .dwtag  DW_TAG_member
    2811                      .dwattr $C$DW$459, DW_AT_type(*$C$DW$T$38)
    2812                      .dwattr $C$DW$459, DW_AT_name("voltage_sf")
    2813                      .dwattr $C$DW$459, DW_AT_TI_symbol_name("_voltage_sf")
    2814                      .dwattr $C$DW$459, DW_AT_data_member_location[DW_OP_plus_uconst 0xb0]
    2815                      .dwattr $C$DW$459, DW_AT_accessibility(DW_ACCESS_public)
    2816              $C$DW$460       .dwtag  DW_TAG_member
    2817                      .dwattr $C$DW$460, DW_AT_type(*$C$DW$T$33)
    2818                      .dwattr $C$DW$460, DW_AT_name("numCurrentSensors")
    2819                      .dwattr $C$DW$460, DW_AT_TI_symbol_name("_numCurrentSensors")
    2820                      .dwattr $C$DW$460, DW_AT_data_member_location[DW_OP_plus_uconst 0xb2]
    2821                      .dwattr $C$DW$460, DW_AT_accessibility(DW_ACCESS_public)
    2822              $C$DW$461       .dwtag  DW_TAG_member
    2823                      .dwattr $C$DW$461, DW_AT_type(*$C$DW$T$33)
    2824                      .dwattr $C$DW$461, DW_AT_name("numVoltageSensors")
    2825                      .dwattr $C$DW$461, DW_AT_TI_symbol_name("_numVoltageSensors")
    2826                      .dwattr $C$DW$461, DW_AT_data_member_location[DW_OP_plus_uconst 0xb3]
    2827                      .dwattr $C$DW$461, DW_AT_accessibility(DW_ACCESS_public)
    2828                      .dwendtag $C$DW$T$86
    2829              
    2830              $C$DW$T$172     .dwtag  DW_TAG_typedef, DW_AT_name("HAL_Obj")
    2831                      .dwattr $C$DW$T$172, DW_AT_type(*$C$DW$T$86)
    2832                      .dwattr $C$DW$T$172, DW_AT_language(DW_LANG_C)
    2833              $C$DW$T$173     .dwtag  DW_TAG_pointer_type
    2834                      .dwattr $C$DW$T$173, DW_AT_type(*$C$DW$T$172)
    2835                      .dwattr $C$DW$T$173, DW_AT_address_class(0x16)
    2836              $C$DW$T$174     .dwtag  DW_TAG_pointer_type
    2837                      .dwattr $C$DW$T$174, DW_AT_type(*$C$DW$T$86)
    2838                      .dwattr $C$DW$T$174, DW_AT_address_class(0x16)
    2839              $C$DW$T$175     .dwtag  DW_TAG_typedef, DW_AT_name("HAL_Handle")
    2840                      .dwattr $C$DW$T$175, DW_AT_type(*$C$DW$T$174)
    2841                      .dwattr $C$DW$T$175, DW_AT_language(DW_LANG_C)
    2842              
    2843              $C$DW$T$87      .dwtag  DW_TAG_structure_type
    2844                      .dwattr $C$DW$T$87, DW_AT_name("_HAL_PwmData_t_")
    2845                      .dwattr $C$DW$T$87, DW_AT_byte_size(0x06)
    2846              $C$DW$462       .dwtag  DW_TAG_member
    2847                      .dwattr $C$DW$462, DW_AT_type(*$C$DW$T$46)
    2848                      .dwattr $C$DW$462, DW_AT_name("Tabc")
    2849                      .dwattr $C$DW$462, DW_AT_TI_symbol_name("_Tabc")
    2850                      .dwattr $C$DW$462, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    2851                      .dwattr $C$DW$462, DW_AT_accessibility(DW_ACCESS_public)
    2852                      .dwendtag $C$DW$T$87
    2853              
    2854              $C$DW$T$181     .dwtag  DW_TAG_typedef, DW_AT_name("HAL_PwmData_t")
TMS320C2000 Assembler PC v6.2.5 Mon Sep 11 10:22:22 2017

Tools Copyright (c) 1996-2014 Texas Instruments Incorporated
C:\Users\wmj\AppData\Local\Temp\1488411                              PAGE   56

    2855                      .dwattr $C$DW$T$181, DW_AT_type(*$C$DW$T$87)
    2856                      .dwattr $C$DW$T$181, DW_AT_language(DW_LANG_C)
    2857              
    2858              $C$DW$T$89      .dwtag  DW_TAG_structure_type
    2859                      .dwattr $C$DW$T$89, DW_AT_name("_MATH_vec3_")
    2860                      .dwattr $C$DW$T$89, DW_AT_byte_size(0x06)
    2861              $C$DW$463       .dwtag  DW_TAG_member
    2862                      .dwattr $C$DW$463, DW_AT_type(*$C$DW$T$88)
    2863                      .dwattr $C$DW$463, DW_AT_name("value")
    2864                      .dwattr $C$DW$463, DW_AT_TI_symbol_name("_value")
    2865                      .dwattr $C$DW$463, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    2866                      .dwattr $C$DW$463, DW_AT_accessibility(DW_ACCESS_public)
    2867                      .dwendtag $C$DW$T$89
    2868              
    2869              $C$DW$T$46      .dwtag  DW_TAG_typedef, DW_AT_name("MATH_vec3")
    2870                      .dwattr $C$DW$T$46, DW_AT_type(*$C$DW$T$89)
    2871                      .dwattr $C$DW$T$46, DW_AT_language(DW_LANG_C)
    2872              
    2873              $C$DW$T$105     .dwtag  DW_TAG_structure_type
    2874                      .dwattr $C$DW$T$105, DW_AT_name("_MB_Obj_")
    2875                      .dwattr $C$DW$T$105, DW_AT_byte_size(0x1c)
    2876              $C$DW$464       .dwtag  DW_TAG_member
    2877                      .dwattr $C$DW$464, DW_AT_type(*$C$DW$T$57)
    2878                      .dwattr $C$DW$464, DW_AT_name("gpioHandle")
    2879                      .dwattr $C$DW$464, DW_AT_TI_symbol_name("_gpioHandle")
    2880                      .dwattr $C$DW$464, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    2881                      .dwattr $C$DW$464, DW_AT_accessibility(DW_ACCESS_public)
    2882              $C$DW$465       .dwtag  DW_TAG_member
    2883                      .dwattr $C$DW$465, DW_AT_type(*$C$DW$T$75)
    2884                      .dwattr $C$DW$465, DW_AT_name("timerHandle")
    2885                      .dwattr $C$DW$465, DW_AT_TI_symbol_name("_timerHandle")
    2886                      .dwattr $C$DW$465, DW_AT_data_member_location[DW_OP_plus_uconst 0x2]
    2887                      .dwattr $C$DW$465, DW_AT_accessibility(DW_ACCESS_public)
    2888              $C$DW$466       .dwtag  DW_TAG_member
    2889                      .dwattr $C$DW$466, DW_AT_type(*$C$DW$T$84)
    2890                      .dwattr $C$DW$466, DW_AT_name("sciHandle")
    2891                      .dwattr $C$DW$466, DW_AT_TI_symbol_name("_sciHandle")
    2892                      .dwattr $C$DW$466, DW_AT_data_member_location[DW_OP_plus_uconst 0x4]
    2893                      .dwattr $C$DW$466, DW_AT_accessibility(DW_ACCESS_public)
    2894              $C$DW$467       .dwtag  DW_TAG_member
    2895                      .dwattr $C$DW$467, DW_AT_type(*$C$DW$T$91)
    2896                      .dwattr $C$DW$467, DW_AT_name("RTU_Frame")
    2897                      .dwattr $C$DW$467, DW_AT_TI_symbol_name("_RTU_Frame")
    2898                      .dwattr $C$DW$467, DW_AT_data_member_location[DW_OP_plus_uconst 0x6]
    2899                      .dwattr $C$DW$467, DW_AT_accessibility(DW_ACCESS_public)
    2900              $C$DW$468       .dwtag  DW_TAG_member
    2901                      .dwattr $C$DW$468, DW_AT_type(*$C$DW$T$93)
    2902                      .dwattr $C$DW$468, DW_AT_name("RTUBuf")
    2903                      .dwattr $C$DW$468, DW_AT_TI_symbol_name("_RTUBuf")
    2904                      .dwattr $C$DW$468, DW_AT_data_member_location[DW_OP_plus_uconst 0x8]
    2905                      .dwattr $C$DW$468, DW_AT_accessibility(DW_ACCESS_public)
    2906              $C$DW$469       .dwtag  DW_TAG_member
    2907                      .dwattr $C$DW$469, DW_AT_type(*$C$DW$T$92)
    2908                      .dwattr $C$DW$469, DW_AT_name("RcvBufferPos")
    2909                      .dwattr $C$DW$469, DW_AT_TI_symbol_name("_RcvBufferPos")
TMS320C2000 Assembler PC v6.2.5 Mon Sep 11 10:22:22 2017

Tools Copyright (c) 1996-2014 Texas Instruments Incorporated
C:\Users\wmj\AppData\Local\Temp\1488411                              PAGE   57

    2910                      .dwattr $C$DW$469, DW_AT_data_member_location[DW_OP_plus_uconst 0x10]
    2911                      .dwattr $C$DW$469, DW_AT_accessibility(DW_ACCESS_public)
    2912              $C$DW$470       .dwtag  DW_TAG_member
    2913                      .dwattr $C$DW$470, DW_AT_type(*$C$DW$T$94)
    2914                      .dwattr $C$DW$470, DW_AT_name("SndBufferCur")
    2915                      .dwattr $C$DW$470, DW_AT_TI_symbol_name("_SndBufferCur")
    2916                      .dwattr $C$DW$470, DW_AT_data_member_location[DW_OP_plus_uconst 0x12]
    2917                      .dwattr $C$DW$470, DW_AT_accessibility(DW_ACCESS_public)
    2918              $C$DW$471       .dwtag  DW_TAG_member
    2919                      .dwattr $C$DW$471, DW_AT_type(*$C$DW$T$95)
    2920                      .dwattr $C$DW$471, DW_AT_name("SndBufferCount")
    2921                      .dwattr $C$DW$471, DW_AT_TI_symbol_name("_SndBufferCount")
    2922                      .dwattr $C$DW$471, DW_AT_data_member_location[DW_OP_plus_uconst 0x14]
    2923                      .dwattr $C$DW$471, DW_AT_accessibility(DW_ACCESS_public)
    2924              $C$DW$472       .dwtag  DW_TAG_member
    2925                      .dwattr $C$DW$472, DW_AT_type(*$C$DW$T$92)
    2926                      .dwattr $C$DW$472, DW_AT_name("SlaveAddress")
    2927                      .dwattr $C$DW$472, DW_AT_TI_symbol_name("_SlaveAddress")
    2928                      .dwattr $C$DW$472, DW_AT_data_member_location[DW_OP_plus_uconst 0x15]
    2929                      .dwattr $C$DW$472, DW_AT_accessibility(DW_ACCESS_public)
    2930              $C$DW$473       .dwtag  DW_TAG_member
    2931                      .dwattr $C$DW$473, DW_AT_type(*$C$DW$T$97)
    2932                      .dwattr $C$DW$473, DW_AT_name("eStatus")
    2933                      .dwattr $C$DW$473, DW_AT_TI_symbol_name("_eStatus")
    2934                      .dwattr $C$DW$473, DW_AT_data_member_location[DW_OP_plus_uconst 0x16]
    2935                      .dwattr $C$DW$473, DW_AT_accessibility(DW_ACCESS_public)
    2936              $C$DW$474       .dwtag  DW_TAG_member
    2937                      .dwattr $C$DW$474, DW_AT_type(*$C$DW$T$99)
    2938                      .dwattr $C$DW$474, DW_AT_name("eSndState")
    2939                      .dwattr $C$DW$474, DW_AT_TI_symbol_name("_eSndState")
    2940                      .dwattr $C$DW$474, DW_AT_data_member_location[DW_OP_plus_uconst 0x17]
    2941                      .dwattr $C$DW$474, DW_AT_accessibility(DW_ACCESS_public)
    2942              $C$DW$475       .dwtag  DW_TAG_member
    2943                      .dwattr $C$DW$475, DW_AT_type(*$C$DW$T$101)
    2944                      .dwattr $C$DW$475, DW_AT_name("eRcvState")
    2945                      .dwattr $C$DW$475, DW_AT_TI_symbol_name("_eRcvState")
    2946                      .dwattr $C$DW$475, DW_AT_data_member_location[DW_OP_plus_uconst 0x18]
    2947                      .dwattr $C$DW$475, DW_AT_accessibility(DW_ACCESS_public)
    2948              $C$DW$476       .dwtag  DW_TAG_member
    2949                      .dwattr $C$DW$476, DW_AT_type(*$C$DW$T$102)
    2950                      .dwattr $C$DW$476, DW_AT_name("xEventInQueue")
    2951                      .dwattr $C$DW$476, DW_AT_TI_symbol_name("_xEventInQueue")
    2952                      .dwattr $C$DW$476, DW_AT_data_member_location[DW_OP_plus_uconst 0x19]
    2953                      .dwattr $C$DW$476, DW_AT_accessibility(DW_ACCESS_public)
    2954              $C$DW$477       .dwtag  DW_TAG_member
    2955                      .dwattr $C$DW$477, DW_AT_type(*$C$DW$T$104)
    2956                      .dwattr $C$DW$477, DW_AT_name("eQueuedEvent")
    2957                      .dwattr $C$DW$477, DW_AT_TI_symbol_name("_eQueuedEvent")
    2958                      .dwattr $C$DW$477, DW_AT_data_member_location[DW_OP_plus_uconst 0x1a]
    2959                      .dwattr $C$DW$477, DW_AT_accessibility(DW_ACCESS_public)
    2960                      .dwendtag $C$DW$T$105
    2961              
    2962              $C$DW$T$184     .dwtag  DW_TAG_typedef, DW_AT_name("MB_Obj")
    2963                      .dwattr $C$DW$T$184, DW_AT_type(*$C$DW$T$105)
    2964                      .dwattr $C$DW$T$184, DW_AT_language(DW_LANG_C)
TMS320C2000 Assembler PC v6.2.5 Mon Sep 11 10:22:22 2017

Tools Copyright (c) 1996-2014 Texas Instruments Incorporated
C:\Users\wmj\AppData\Local\Temp\1488411                              PAGE   58

    2965              $C$DW$T$150     .dwtag  DW_TAG_pointer_type
    2966                      .dwattr $C$DW$T$150, DW_AT_type(*$C$DW$T$105)
    2967                      .dwattr $C$DW$T$150, DW_AT_address_class(0x16)
    2968              $C$DW$T$151     .dwtag  DW_TAG_typedef, DW_AT_name("MB_Handle")
    2969                      .dwattr $C$DW$T$151, DW_AT_type(*$C$DW$T$150)
    2970                      .dwattr $C$DW$T$151, DW_AT_language(DW_LANG_C)
    2971              
    2972              $C$DW$T$107     .dwtag  DW_TAG_structure_type
    2973                      .dwattr $C$DW$T$107, DW_AT_name("_MB_RTU_t_")
    2974                      .dwattr $C$DW$T$107, DW_AT_byte_size(0x08)
    2975              $C$DW$478       .dwtag  DW_TAG_member
    2976                      .dwattr $C$DW$478, DW_AT_type(*$C$DW$T$92)
    2977                      .dwattr $C$DW$478, DW_AT_name("PDU_Address")
    2978                      .dwattr $C$DW$478, DW_AT_TI_symbol_name("_PDU_Address")
    2979                      .dwattr $C$DW$478, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    2980                      .dwattr $C$DW$478, DW_AT_accessibility(DW_ACCESS_public)
    2981              $C$DW$479       .dwtag  DW_TAG_member
    2982                      .dwattr $C$DW$479, DW_AT_type(*$C$DW$T$92)
    2983                      .dwattr $C$DW$479, DW_AT_name("PDU_FunctionCode")
    2984                      .dwattr $C$DW$479, DW_AT_TI_symbol_name("_PDU_FunctionCode")
    2985                      .dwattr $C$DW$479, DW_AT_data_member_location[DW_OP_plus_uconst 0x1]
    2986                      .dwattr $C$DW$479, DW_AT_accessibility(DW_ACCESS_public)
    2987              $C$DW$480       .dwtag  DW_TAG_member
    2988                      .dwattr $C$DW$480, DW_AT_type(*$C$DW$T$106)
    2989                      .dwattr $C$DW$480, DW_AT_name("PDU_RegAddress")
    2990                      .dwattr $C$DW$480, DW_AT_TI_symbol_name("_PDU_RegAddress")
    2991                      .dwattr $C$DW$480, DW_AT_data_member_location[DW_OP_plus_uconst 0x2]
    2992                      .dwattr $C$DW$480, DW_AT_accessibility(DW_ACCESS_public)
    2993              $C$DW$481       .dwtag  DW_TAG_member
    2994                      .dwattr $C$DW$481, DW_AT_type(*$C$DW$T$106)
    2995                      .dwattr $C$DW$481, DW_AT_name("PDU_Data")
    2996                      .dwattr $C$DW$481, DW_AT_TI_symbol_name("_PDU_Data")
    2997                      .dwattr $C$DW$481, DW_AT_data_member_location[DW_OP_plus_uconst 0x4]
    2998                      .dwattr $C$DW$481, DW_AT_accessibility(DW_ACCESS_public)
    2999              $C$DW$482       .dwtag  DW_TAG_member
    3000                      .dwattr $C$DW$482, DW_AT_type(*$C$DW$T$92)
    3001                      .dwattr $C$DW$482, DW_AT_name("PDU_CRC_LByte")
    3002                      .dwattr $C$DW$482, DW_AT_TI_symbol_name("_PDU_CRC_LByte")
    3003                      .dwattr $C$DW$482, DW_AT_data_member_location[DW_OP_plus_uconst 0x6]
    3004                      .dwattr $C$DW$482, DW_AT_accessibility(DW_ACCESS_public)
    3005              $C$DW$483       .dwtag  DW_TAG_member
    3006                      .dwattr $C$DW$483, DW_AT_type(*$C$DW$T$92)
    3007                      .dwattr $C$DW$483, DW_AT_name("PDU_CRC_HByte")
    3008                      .dwattr $C$DW$483, DW_AT_TI_symbol_name("_PDU_CRC_HByte")
    3009                      .dwattr $C$DW$483, DW_AT_data_member_location[DW_OP_plus_uconst 0x7]
    3010                      .dwattr $C$DW$483, DW_AT_accessibility(DW_ACCESS_public)
    3011                      .dwendtag $C$DW$T$107
    3012              
    3013              $C$DW$T$90      .dwtag  DW_TAG_pointer_type
    3014                      .dwattr $C$DW$T$90, DW_AT_type(*$C$DW$T$107)
    3015                      .dwattr $C$DW$T$90, DW_AT_address_class(0x16)
    3016              $C$DW$T$91      .dwtag  DW_TAG_typedef, DW_AT_name("RTU_Frame")
    3017                      .dwattr $C$DW$T$91, DW_AT_type(*$C$DW$T$90)
    3018                      .dwattr $C$DW$T$91, DW_AT_language(DW_LANG_C)
    3019              
TMS320C2000 Assembler PC v6.2.5 Mon Sep 11 10:22:22 2017

Tools Copyright (c) 1996-2014 Texas Instruments Incorporated
C:\Users\wmj\AppData\Local\Temp\1488411                              PAGE   59

    3020              $C$DW$T$116     .dwtag  DW_TAG_structure_type
    3021                      .dwattr $C$DW$T$116, DW_AT_name("_MOTOR_Vars_t_")
    3022                      .dwattr $C$DW$T$116, DW_AT_byte_size(0x80)
    3023              $C$DW$484       .dwtag  DW_TAG_member
    3024                      .dwattr $C$DW$484, DW_AT_type(*$C$DW$T$102)
    3025                      .dwattr $C$DW$484, DW_AT_name("Flag_enableSys")
    3026                      .dwattr $C$DW$484, DW_AT_TI_symbol_name("_Flag_enableSys")
    3027                      .dwattr $C$DW$484, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    3028                      .dwattr $C$DW$484, DW_AT_accessibility(DW_ACCESS_public)
    3029              $C$DW$485       .dwtag  DW_TAG_member
    3030                      .dwattr $C$DW$485, DW_AT_type(*$C$DW$T$102)
    3031                      .dwattr $C$DW$485, DW_AT_name("Flag_Run_Identify")
    3032                      .dwattr $C$DW$485, DW_AT_TI_symbol_name("_Flag_Run_Identify")
    3033                      .dwattr $C$DW$485, DW_AT_data_member_location[DW_OP_plus_uconst 0x1]
    3034                      .dwattr $C$DW$485, DW_AT_accessibility(DW_ACCESS_public)
    3035              $C$DW$486       .dwtag  DW_TAG_member
    3036                      .dwattr $C$DW$486, DW_AT_type(*$C$DW$T$102)
    3037                      .dwattr $C$DW$486, DW_AT_name("Flag_MotorIdentified")
    3038                      .dwattr $C$DW$486, DW_AT_TI_symbol_name("_Flag_MotorIdentified")
    3039                      .dwattr $C$DW$486, DW_AT_data_member_location[DW_OP_plus_uconst 0x2]
    3040                      .dwattr $C$DW$486, DW_AT_accessibility(DW_ACCESS_public)
    3041              $C$DW$487       .dwtag  DW_TAG_member
    3042                      .dwattr $C$DW$487, DW_AT_type(*$C$DW$T$102)
    3043                      .dwattr $C$DW$487, DW_AT_name("Flag_enableForceAngle")
    3044                      .dwattr $C$DW$487, DW_AT_TI_symbol_name("_Flag_enableForceAngle")
    3045                      .dwattr $C$DW$487, DW_AT_data_member_location[DW_OP_plus_uconst 0x3]
    3046                      .dwattr $C$DW$487, DW_AT_accessibility(DW_ACCESS_public)
    3047              $C$DW$488       .dwtag  DW_TAG_member
    3048                      .dwattr $C$DW$488, DW_AT_type(*$C$DW$T$102)
    3049                      .dwattr $C$DW$488, DW_AT_name("Flag_enableFieldWeakening")
    3050                      .dwattr $C$DW$488, DW_AT_TI_symbol_name("_Flag_enableFieldWeakening")
    3051                      .dwattr $C$DW$488, DW_AT_data_member_location[DW_OP_plus_uconst 0x4]
    3052                      .dwattr $C$DW$488, DW_AT_accessibility(DW_ACCESS_public)
    3053              $C$DW$489       .dwtag  DW_TAG_member
    3054                      .dwattr $C$DW$489, DW_AT_type(*$C$DW$T$102)
    3055                      .dwattr $C$DW$489, DW_AT_name("Flag_enableRsRecalc")
    3056                      .dwattr $C$DW$489, DW_AT_TI_symbol_name("_Flag_enableRsRecalc")
    3057                      .dwattr $C$DW$489, DW_AT_data_member_location[DW_OP_plus_uconst 0x5]
    3058                      .dwattr $C$DW$489, DW_AT_accessibility(DW_ACCESS_public)
    3059              $C$DW$490       .dwtag  DW_TAG_member
    3060                      .dwattr $C$DW$490, DW_AT_type(*$C$DW$T$102)
    3061                      .dwattr $C$DW$490, DW_AT_name("Flag_enableUserParams")
    3062                      .dwattr $C$DW$490, DW_AT_TI_symbol_name("_Flag_enableUserParams")
    3063                      .dwattr $C$DW$490, DW_AT_data_member_location[DW_OP_plus_uconst 0x6]
    3064                      .dwattr $C$DW$490, DW_AT_accessibility(DW_ACCESS_public)
    3065              $C$DW$491       .dwtag  DW_TAG_member
    3066                      .dwattr $C$DW$491, DW_AT_type(*$C$DW$T$102)
    3067                      .dwattr $C$DW$491, DW_AT_name("Flag_enableOffsetcalc")
    3068                      .dwattr $C$DW$491, DW_AT_TI_symbol_name("_Flag_enableOffsetcalc")
    3069                      .dwattr $C$DW$491, DW_AT_data_member_location[DW_OP_plus_uconst 0x7]
    3070                      .dwattr $C$DW$491, DW_AT_accessibility(DW_ACCESS_public)
    3071              $C$DW$492       .dwtag  DW_TAG_member
    3072                      .dwattr $C$DW$492, DW_AT_type(*$C$DW$T$102)
    3073                      .dwattr $C$DW$492, DW_AT_name("Flag_enablePowerWarp")
    3074                      .dwattr $C$DW$492, DW_AT_TI_symbol_name("_Flag_enablePowerWarp")
TMS320C2000 Assembler PC v6.2.5 Mon Sep 11 10:22:22 2017

Tools Copyright (c) 1996-2014 Texas Instruments Incorporated
C:\Users\wmj\AppData\Local\Temp\1488411                              PAGE   60

    3075                      .dwattr $C$DW$492, DW_AT_data_member_location[DW_OP_plus_uconst 0x8]
    3076                      .dwattr $C$DW$492, DW_AT_accessibility(DW_ACCESS_public)
    3077              $C$DW$493       .dwtag  DW_TAG_member
    3078                      .dwattr $C$DW$493, DW_AT_type(*$C$DW$T$102)
    3079                      .dwattr $C$DW$493, DW_AT_name("Flag_enableSpeedCtrl")
    3080                      .dwattr $C$DW$493, DW_AT_TI_symbol_name("_Flag_enableSpeedCtrl")
    3081                      .dwattr $C$DW$493, DW_AT_data_member_location[DW_OP_plus_uconst 0x9]
    3082                      .dwattr $C$DW$493, DW_AT_accessibility(DW_ACCESS_public)
    3083              $C$DW$494       .dwtag  DW_TAG_member
    3084                      .dwattr $C$DW$494, DW_AT_type(*$C$DW$T$102)
    3085                      .dwattr $C$DW$494, DW_AT_name("Flag_enableRun")
    3086                      .dwattr $C$DW$494, DW_AT_TI_symbol_name("_Flag_enableRun")
    3087                      .dwattr $C$DW$494, DW_AT_data_member_location[DW_OP_plus_uconst 0xa]
    3088                      .dwattr $C$DW$494, DW_AT_accessibility(DW_ACCESS_public)
    3089              $C$DW$495       .dwtag  DW_TAG_member
    3090                      .dwattr $C$DW$495, DW_AT_type(*$C$DW$T$102)
    3091                      .dwattr $C$DW$495, DW_AT_name("Flag_RunState")
    3092                      .dwattr $C$DW$495, DW_AT_TI_symbol_name("_Flag_RunState")
    3093                      .dwattr $C$DW$495, DW_AT_data_member_location[DW_OP_plus_uconst 0xb]
    3094                      .dwattr $C$DW$495, DW_AT_accessibility(DW_ACCESS_public)
    3095              $C$DW$496       .dwtag  DW_TAG_member
    3096                      .dwattr $C$DW$496, DW_AT_type(*$C$DW$T$102)
    3097                      .dwattr $C$DW$496, DW_AT_name("Flag_enableFlyingStart")
    3098                      .dwattr $C$DW$496, DW_AT_TI_symbol_name("_Flag_enableFlyingStart")
    3099                      .dwattr $C$DW$496, DW_AT_data_member_location[DW_OP_plus_uconst 0xc]
    3100                      .dwattr $C$DW$496, DW_AT_accessibility(DW_ACCESS_public)
    3101              $C$DW$497       .dwtag  DW_TAG_member
    3102                      .dwattr $C$DW$497, DW_AT_type(*$C$DW$T$109)
    3103                      .dwattr $C$DW$497, DW_AT_name("CtrlState")
    3104                      .dwattr $C$DW$497, DW_AT_TI_symbol_name("_CtrlState")
    3105                      .dwattr $C$DW$497, DW_AT_data_member_location[DW_OP_plus_uconst 0xd]
    3106                      .dwattr $C$DW$497, DW_AT_accessibility(DW_ACCESS_public)
    3107              $C$DW$498       .dwtag  DW_TAG_member
    3108                      .dwattr $C$DW$498, DW_AT_type(*$C$DW$T$111)
    3109                      .dwattr $C$DW$498, DW_AT_name("EstState")
