TMS320C2000 Assembler PC v6.2.5 Sat Sep 16 14:47:35 2017

Tools Copyright (c) 1996-2014 Texas Instruments Incorporated
C:\Users\wmj\AppData\Local\Temp\1316010                              PAGE    1

       1              ;***************************************************************
       2              ;* TMS320C2000 C/C++ Codegen                         PC v6.2.5 *
       3              ;* Date/Time created: Sat Sep 16 14:47:34 2017                 *
       4              ;***************************************************************
       5                      .compiler_opts --float_support=softlib --hll_source=on --mem_model:code=flat --mem_model:data=large -
       6        0002  FP      .set    XAR2
       7              
       8              $C$DW$CU        .dwtag  DW_TAG_compile_unit
       9                      .dwattr $C$DW$CU, DW_AT_name("D:/BM1000/sw/modules/user/src/32b/user.c")
      10                      .dwattr $C$DW$CU, DW_AT_producer("TMS320C2000 C/C++ Codegen PC v6.2.5 Copyright (c) 1996-2014 Texas I
      11                      .dwattr $C$DW$CU, DW_AT_TI_version(0x01)
      12                      .dwattr $C$DW$CU, DW_AT_comp_dir("D:\BM1000\sw\solutions\instaspin_foc\boards\hvkit_rev1p1\f28x\f2802
      13              ;**************************************************************
      14              ;* CINIT RECORDS                                              *

    5947              $C$DW$571       .dwtag  DW_TAG_enumerator, DW_AT_name("USER_ErrorCode_maxCurrentSlope_High"), DW_AT_const_val
    5948              $C$DW$572       .dwtag  DW_TAG_enumerator, DW_AT_name("USER_ErrorCode_maxCurrentSlope_Low"), DW_AT_const_valu
    5949              $C$DW$573       .dwtag  DW_TAG_enumerator, DW_AT_name("USER_ErrorCode_maxCurrentSlope_powerWarp_High"), DW_AT
    5950              $C$DW$574       .dwtag  DW_TAG_enumerator, DW_AT_name("USER_ErrorCode_maxCurrentSlope_powerWarp_Low"), DW_AT_
    5951              $C$DW$575       .dwtag  DW_TAG_enumerator, DW_AT_name("USER_ErrorCode_IdRated_High"), DW_AT_const_value(0x54)
    5952              $C$DW$576       .dwtag  DW_TAG_enumerator, DW_AT_name("USER_ErrorCode_IdRated_Low"), DW_AT_const_value(0x55)
    5953              $C$DW$577       .dwtag  DW_TAG_enumerator, DW_AT_name("USER_ErrorCode_IdRatedFraction_indEst_High"), DW_AT_co
    5954              $C$DW$578       .dwtag  DW_TAG_enumerator, DW_AT_name("USER_ErrorCode_IdRatedFraction_indEst_Low"), DW_AT_con
    5955              $C$DW$579       .dwtag  DW_TAG_enumerator, DW_AT_name("USER_ErrorCode_IdRatedFraction_ratedFlux_High"), DW_AT
    5956              $C$DW$580       .dwtag  DW_TAG_enumerator, DW_AT_name("USER_ErrorCode_IdRatedFraction_ratedFlux_Low"), DW_AT_
    5957              $C$DW$581       .dwtag  DW_TAG_enumerator, DW_AT_name("USER_ErrorCode_IdRated_delta_High"), DW_AT_const_value
    5958              $C$DW$582       .dwtag  DW_TAG_enumerator, DW_AT_name("USER_ErrorCode_IdRated_delta_Low"), DW_AT_const_value(
    5959              $C$DW$583       .dwtag  DW_TAG_enumerator, DW_AT_name("USER_ErrorCode_fluxEstFreq_Hz_High"), DW_AT_const_valu
    5960              $C$DW$584       .dwtag  DW_TAG_enumerator, DW_AT_name("USER_ErrorCode_fluxEstFreq_Hz_Low"), DW_AT_const_value
    5961              $C$DW$585       .dwtag  DW_TAG_enumerator, DW_AT_name("USER_ErrorCode_ctrlFreq_Hz_High"), DW_AT_const_value(0
    5962              $C$DW$586       .dwtag  DW_TAG_enumerator, DW_AT_name("USER_ErrorCode_ctrlFreq_Hz_Low"), DW_AT_const_value(0x
    5963              $C$DW$587       .dwtag  DW_TAG_enumerator, DW_AT_name("USER_ErrorCode_estFreq_Hz_High"), DW_AT_const_value(0x
    5964              $C$DW$588       .dwtag  DW_TAG_enumerator, DW_AT_name("USER_ErrorCode_estFreq_Hz_Low"), DW_AT_const_value(0x6
    5965              $C$DW$589       .dwtag  DW_TAG_enumerator, DW_AT_name("USER_ErrorCode_RoverL_estFreq_Hz_High"), DW_AT_const_v
    5966              $C$DW$590       .dwtag  DW_TAG_enumerator, DW_AT_name("USER_ErrorCode_RoverL_estFreq_Hz_Low"), DW_AT_const_va
    5967              $C$DW$591       .dwtag  DW_TAG_enumerator, DW_AT_name("USER_ErrorCode_trajFreq_Hz_High"), DW_AT_const_value(0
    5968              $C$DW$592       .dwtag  DW_TAG_enumerator, DW_AT_name("USER_ErrorCode_trajFreq_Hz_Low"), DW_AT_const_value(0x
    5969              $C$DW$593       .dwtag  DW_TAG_enumerator, DW_AT_name("USER_ErrorCode_ctrlPeriod_sec_High"), DW_AT_const_valu
    5970              $C$DW$594       .dwtag  DW_TAG_enumerator, DW_AT_name("USER_ErrorCode_ctrlPeriod_sec_Low"), DW_AT_const_value
    5971              $C$DW$595       .dwtag  DW_TAG_enumerator, DW_AT_name("USER_ErrorCode_maxNegativeIdCurrent_a_High"), DW_AT_co
    5972              $C$DW$596       .dwtag  DW_TAG_enumerator, DW_AT_name("USER_ErrorCode_maxNegativeIdCurrent_a_Low"), DW_AT_con
    5973              $C$DW$597       .dwtag  DW_TAG_enumerator, DW_AT_name("USER_numErrorCodes"), DW_AT_const_value(0x6a)
    5974                      .dwendtag $C$DW$T$74
    5975              
    5976              $C$DW$T$75      .dwtag  DW_TAG_typedef, DW_AT_name("USER_ErrorCode_e")
    5977                      .dwattr $C$DW$T$75, DW_AT_type(*$C$DW$T$74)
    5978                      .dwattr $C$DW$T$75, DW_AT_language(DW_LANG_C)
    5979              $C$DW$598       .dwtag  DW_TAG_TI_far_type
    5980                      .dwattr $C$DW$598, DW_AT_type(*$C$DW$T$75)
    5981              $C$DW$T$78      .dwtag  DW_TAG_const_type
    5982                      .dwattr $C$DW$T$78, DW_AT_type(*$C$DW$598)
    5983              
    5984              $C$DW$T$83      .dwtag  DW_TAG_enumeration_type
    5985                      .dwattr $C$DW$T$83, DW_AT_byte_size(0x01)
    5986              $C$DW$599       .dwtag  DW_TAG_enumerator, DW_AT_name("CTRL_Type_PID_spd"), DW_AT_const_value(0x00)
    5987              $C$DW$600       .dwtag  DW_TAG_enumerator, DW_AT_name("CTRL_Type_PID_Id"), DW_AT_const_value(0x01)
    5988              $C$DW$601       .dwtag  DW_TAG_enumerator, DW_AT_name("CTRL_Type_PID_Iq"), DW_AT_const_value(0x02)
    5989                      .dwendtag $C$DW$T$83
    5990              
    5991              $C$DW$T$84      .dwtag  DW_TAG_typedef, DW_AT_name("CTRL_Type_e")
    5992                      .dwattr $C$DW$T$84, DW_AT_type(*$C$DW$T$83)
    5993                      .dwattr $C$DW$T$84, DW_AT_language(DW_LANG_C)
    5994              $C$DW$602       .dwtag  DW_TAG_TI_far_type
    5995                      .dwattr $C$DW$602, DW_AT_type(*$C$DW$T$84)
    5996              $C$DW$T$85      .dwtag  DW_TAG_const_type
TMS320C2000 Assembler PC v6.2.5 Sat Sep 16 14:47:35 2017

Tools Copyright (c) 1996-2014 Texas Instruments Incorporated
C:\Users\wmj\AppData\Local\Temp\1316010                              PAGE  122

    5997                      .dwattr $C$DW$T$85, DW_AT_type(*$C$DW$602)
    5998              
    5999              $C$DW$T$23      .dwtag  DW_TAG_structure_type
    6000                      .dwattr $C$DW$T$23, DW_AT_name("_CLARKE_Obj_")
    6001                      .dwattr $C$DW$T$23, DW_AT_byte_size(0x06)
    6002              $C$DW$603       .dwtag  DW_TAG_member
    6003                      .dwattr $C$DW$603, DW_AT_type(*$C$DW$T$20)
    6004                      .dwattr $C$DW$603, DW_AT_name("alpha_sf")
    6005                      .dwattr $C$DW$603, DW_AT_TI_symbol_name("_alpha_sf")
    6006                      .dwattr $C$DW$603, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    6007                      .dwattr $C$DW$603, DW_AT_accessibility(DW_ACCESS_public)
    6008              $C$DW$604       .dwtag  DW_TAG_member
    6009                      .dwattr $C$DW$604, DW_AT_type(*$C$DW$T$20)
    6010                      .dwattr $C$DW$604, DW_AT_name("beta_sf")
    6011                      .dwattr $C$DW$604, DW_AT_TI_symbol_name("_beta_sf")
    6012                      .dwattr $C$DW$604, DW_AT_data_member_location[DW_OP_plus_uconst 0x2]
    6013                      .dwattr $C$DW$604, DW_AT_accessibility(DW_ACCESS_public)
    6014              $C$DW$605       .dwtag  DW_TAG_member
    6015                      .dwattr $C$DW$605, DW_AT_type(*$C$DW$T$22)
    6016                      .dwattr $C$DW$605, DW_AT_name("numSensors")
    6017                      .dwattr $C$DW$605, DW_AT_TI_symbol_name("_numSensors")
    6018                      .dwattr $C$DW$605, DW_AT_data_member_location[DW_OP_plus_uconst 0x4]
    6019                      .dwattr $C$DW$605, DW_AT_accessibility(DW_ACCESS_public)
    6020                      .dwendtag $C$DW$T$23
    6021              
    6022              $C$DW$T$31      .dwtag  DW_TAG_typedef, DW_AT_name("CLARKE_Obj")
    6023                      .dwattr $C$DW$T$31, DW_AT_type(*$C$DW$T$23)
    6024                      .dwattr $C$DW$T$31, DW_AT_language(DW_LANG_C)
    6025              $C$DW$T$29      .dwtag  DW_TAG_pointer_type
    6026                      .dwattr $C$DW$T$29, DW_AT_type(*$C$DW$T$23)
    6027                      .dwattr $C$DW$T$29, DW_AT_address_class(0x16)
    6028              $C$DW$T$30      .dwtag  DW_TAG_typedef, DW_AT_name("CLARKE_Handle")
    6029                      .dwattr $C$DW$T$30, DW_AT_type(*$C$DW$T$29)
    6030                      .dwattr $C$DW$T$30, DW_AT_language(DW_LANG_C)
    6031              
    6032              $C$DW$T$57      .dwtag  DW_TAG_structure_type
    6033                      .dwattr $C$DW$T$57, DW_AT_name("_CTRL_Obj_")
    6034                      .dwattr $C$DW$T$57, DW_AT_byte_size(0x108)
    6035              $C$DW$606       .dwtag  DW_TAG_member
    6036                      .dwattr $C$DW$606, DW_AT_type(*$C$DW$T$24)
    6037                      .dwattr $C$DW$606, DW_AT_name("version")
    6038                      .dwattr $C$DW$606, DW_AT_TI_symbol_name("_version")
    6039                      .dwattr $C$DW$606, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    6040                      .dwattr $C$DW$606, DW_AT_accessibility(DW_ACCESS_public)
    6041              $C$DW$607       .dwtag  DW_TAG_member
    6042                      .dwattr $C$DW$607, DW_AT_type(*$C$DW$T$26)
    6043                      .dwattr $C$DW$607, DW_AT_name("state")
    6044                      .dwattr $C$DW$607, DW_AT_TI_symbol_name("_state")
    6045                      .dwattr $C$DW$607, DW_AT_data_member_location[DW_OP_plus_uconst 0x4]
    6046                      .dwattr $C$DW$607, DW_AT_accessibility(DW_ACCESS_public)
    6047              $C$DW$608       .dwtag  DW_TAG_member
    6048                      .dwattr $C$DW$608, DW_AT_type(*$C$DW$T$26)
    6049                      .dwattr $C$DW$608, DW_AT_name("prevState")
    6050                      .dwattr $C$DW$608, DW_AT_TI_symbol_name("_prevState")
    6051                      .dwattr $C$DW$608, DW_AT_data_member_location[DW_OP_plus_uconst 0x5]
TMS320C2000 Assembler PC v6.2.5 Sat Sep 16 14:47:35 2017

Tools Copyright (c) 1996-2014 Texas Instruments Incorporated
C:\Users\wmj\AppData\Local\Temp\1316010                              PAGE  123

    6052                      .dwattr $C$DW$608, DW_AT_accessibility(DW_ACCESS_public)
    6053              $C$DW$609       .dwtag  DW_TAG_member
    6054                      .dwattr $C$DW$609, DW_AT_type(*$C$DW$T$28)
    6055                      .dwattr $C$DW$609, DW_AT_name("errorCode")
    6056                      .dwattr $C$DW$609, DW_AT_TI_symbol_name("_errorCode")
    6057                      .dwattr $C$DW$609, DW_AT_data_member_location[DW_OP_plus_uconst 0x6]
    6058                      .dwattr $C$DW$609, DW_AT_accessibility(DW_ACCESS_public)
    6059              $C$DW$610       .dwtag  DW_TAG_member
    6060                      .dwattr $C$DW$610, DW_AT_type(*$C$DW$T$30)
    6061                      .dwattr $C$DW$610, DW_AT_name("clarkeHandle_I")
    6062                      .dwattr $C$DW$610, DW_AT_TI_symbol_name("_clarkeHandle_I")
    6063                      .dwattr $C$DW$610, DW_AT_data_member_location[DW_OP_plus_uconst 0x8]
    6064                      .dwattr $C$DW$610, DW_AT_accessibility(DW_ACCESS_public)
    6065              $C$DW$611       .dwtag  DW_TAG_member
    6066                      .dwattr $C$DW$611, DW_AT_type(*$C$DW$T$31)
    6067                      .dwattr $C$DW$611, DW_AT_name("clarke_I")
    6068                      .dwattr $C$DW$611, DW_AT_TI_symbol_name("_clarke_I")
    6069                      .dwattr $C$DW$611, DW_AT_data_member_location[DW_OP_plus_uconst 0xa]
    6070                      .dwattr $C$DW$611, DW_AT_accessibility(DW_ACCESS_public)
    6071              $C$DW$612       .dwtag  DW_TAG_member
    6072                      .dwattr $C$DW$612, DW_AT_type(*$C$DW$T$30)
    6073                      .dwattr $C$DW$612, DW_AT_name("clarkeHandle_V")
    6074                      .dwattr $C$DW$612, DW_AT_TI_symbol_name("_clarkeHandle_V")
    6075                      .dwattr $C$DW$612, DW_AT_data_member_location[DW_OP_plus_uconst 0x10]
    6076                      .dwattr $C$DW$612, DW_AT_accessibility(DW_ACCESS_public)
    6077              $C$DW$613       .dwtag  DW_TAG_member
    6078                      .dwattr $C$DW$613, DW_AT_type(*$C$DW$T$31)
    6079                      .dwattr $C$DW$613, DW_AT_name("clarke_V")
    6080                      .dwattr $C$DW$613, DW_AT_TI_symbol_name("_clarke_V")
    6081                      .dwattr $C$DW$613, DW_AT_data_member_location[DW_OP_plus_uconst 0x12]
    6082                      .dwattr $C$DW$613, DW_AT_accessibility(DW_ACCESS_public)
    6083              $C$DW$614       .dwtag  DW_TAG_member
    6084                      .dwattr $C$DW$614, DW_AT_type(*$C$DW$T$33)
    6085                      .dwattr $C$DW$614, DW_AT_name("estHandle")
    6086                      .dwattr $C$DW$614, DW_AT_TI_symbol_name("_estHandle")
    6087                      .dwattr $C$DW$614, DW_AT_data_member_location[DW_OP_plus_uconst 0x18]
    6088                      .dwattr $C$DW$614, DW_AT_accessibility(DW_ACCESS_public)
    6089              $C$DW$615       .dwtag  DW_TAG_member
    6090                      .dwattr $C$DW$615, DW_AT_type(*$C$DW$T$35)
    6091                      .dwattr $C$DW$615, DW_AT_name("parkHandle")
    6092                      .dwattr $C$DW$615, DW_AT_TI_symbol_name("_parkHandle")
    6093                      .dwattr $C$DW$615, DW_AT_data_member_location[DW_OP_plus_uconst 0x1a]
    6094                      .dwattr $C$DW$615, DW_AT_accessibility(DW_ACCESS_public)
    6095              $C$DW$616       .dwtag  DW_TAG_member
    6096                      .dwattr $C$DW$616, DW_AT_type(*$C$DW$T$36)
    6097                      .dwattr $C$DW$616, DW_AT_name("park")
    6098                      .dwattr $C$DW$616, DW_AT_TI_symbol_name("_park")
    6099                      .dwattr $C$DW$616, DW_AT_data_member_location[DW_OP_plus_uconst 0x1c]
    6100                      .dwattr $C$DW$616, DW_AT_accessibility(DW_ACCESS_public)
    6101              $C$DW$617       .dwtag  DW_TAG_member
    6102                      .dwattr $C$DW$617, DW_AT_type(*$C$DW$T$38)
    6103                      .dwattr $C$DW$617, DW_AT_name("pidHandle_Id")
    6104                      .dwattr $C$DW$617, DW_AT_TI_symbol_name("_pidHandle_Id")
    6105                      .dwattr $C$DW$617, DW_AT_data_member_location[DW_OP_plus_uconst 0x20]
    6106                      .dwattr $C$DW$617, DW_AT_accessibility(DW_ACCESS_public)
TMS320C2000 Assembler PC v6.2.5 Sat Sep 16 14:47:35 2017

Tools Copyright (c) 1996-2014 Texas Instruments Incorporated
C:\Users\wmj\AppData\Local\Temp\1316010                              PAGE  124

    6107              $C$DW$618       .dwtag  DW_TAG_member
    6108                      .dwattr $C$DW$618, DW_AT_type(*$C$DW$T$39)
    6109                      .dwattr $C$DW$618, DW_AT_name("pid_Id")
    6110                      .dwattr $C$DW$618, DW_AT_TI_symbol_name("_pid_Id")
    6111                      .dwattr $C$DW$618, DW_AT_data_member_location[DW_OP_plus_uconst 0x22]
    6112                      .dwattr $C$DW$618, DW_AT_accessibility(DW_ACCESS_public)
    6113              $C$DW$619       .dwtag  DW_TAG_member
    6114                      .dwattr $C$DW$619, DW_AT_type(*$C$DW$T$38)
    6115                      .dwattr $C$DW$619, DW_AT_name("pidHandle_Iq")
    6116                      .dwattr $C$DW$619, DW_AT_TI_symbol_name("_pidHandle_Iq")
    6117                      .dwattr $C$DW$619, DW_AT_data_member_location[DW_OP_plus_uconst 0x32]
    6118                      .dwattr $C$DW$619, DW_AT_accessibility(DW_ACCESS_public)
    6119              $C$DW$620       .dwtag  DW_TAG_member
    6120                      .dwattr $C$DW$620, DW_AT_type(*$C$DW$T$39)
    6121                      .dwattr $C$DW$620, DW_AT_name("pid_Iq")
    6122                      .dwattr $C$DW$620, DW_AT_TI_symbol_name("_pid_Iq")
    6123                      .dwattr $C$DW$620, DW_AT_data_member_location[DW_OP_plus_uconst 0x34]
    6124                      .dwattr $C$DW$620, DW_AT_accessibility(DW_ACCESS_public)
    6125              $C$DW$621       .dwtag  DW_TAG_member
    6126                      .dwattr $C$DW$621, DW_AT_type(*$C$DW$T$38)
    6127                      .dwattr $C$DW$621, DW_AT_name("pidHandle_spd")
    6128                      .dwattr $C$DW$621, DW_AT_TI_symbol_name("_pidHandle_spd")
    6129                      .dwattr $C$DW$621, DW_AT_data_member_location[DW_OP_plus_uconst 0x44]
    6130                      .dwattr $C$DW$621, DW_AT_accessibility(DW_ACCESS_public)
    6131              $C$DW$622       .dwtag  DW_TAG_member
    6132                      .dwattr $C$DW$622, DW_AT_type(*$C$DW$T$39)
    6133                      .dwattr $C$DW$622, DW_AT_name("pid_spd")
    6134                      .dwattr $C$DW$622, DW_AT_TI_symbol_name("_pid_spd")
    6135                      .dwattr $C$DW$622, DW_AT_data_member_location[DW_OP_plus_uconst 0x46]
    6136                      .dwattr $C$DW$622, DW_AT_accessibility(DW_ACCESS_public)
    6137              $C$DW$623       .dwtag  DW_TAG_member
    6138                      .dwattr $C$DW$623, DW_AT_type(*$C$DW$T$41)
    6139                      .dwattr $C$DW$623, DW_AT_name("iparkHandle")
    6140                      .dwattr $C$DW$623, DW_AT_TI_symbol_name("_iparkHandle")
    6141                      .dwattr $C$DW$623, DW_AT_data_member_location[DW_OP_plus_uconst 0x56]
    6142                      .dwattr $C$DW$623, DW_AT_accessibility(DW_ACCESS_public)
    6143              $C$DW$624       .dwtag  DW_TAG_member
    6144                      .dwattr $C$DW$624, DW_AT_type(*$C$DW$T$42)
    6145                      .dwattr $C$DW$624, DW_AT_name("ipark")
    6146                      .dwattr $C$DW$624, DW_AT_TI_symbol_name("_ipark")
    6147                      .dwattr $C$DW$624, DW_AT_data_member_location[DW_OP_plus_uconst 0x58]
    6148                      .dwattr $C$DW$624, DW_AT_accessibility(DW_ACCESS_public)
    6149              $C$DW$625       .dwtag  DW_TAG_member
    6150                      .dwattr $C$DW$625, DW_AT_type(*$C$DW$T$44)
    6151                      .dwattr $C$DW$625, DW_AT_name("svgenHandle")
    6152                      .dwattr $C$DW$625, DW_AT_TI_symbol_name("_svgenHandle")
    6153                      .dwattr $C$DW$625, DW_AT_data_member_location[DW_OP_plus_uconst 0x5c]
    6154                      .dwattr $C$DW$625, DW_AT_accessibility(DW_ACCESS_public)
    6155              $C$DW$626       .dwtag  DW_TAG_member
    6156                      .dwattr $C$DW$626, DW_AT_type(*$C$DW$T$45)
    6157                      .dwattr $C$DW$626, DW_AT_name("svgen")
    6158                      .dwattr $C$DW$626, DW_AT_TI_symbol_name("_svgen")
    6159                      .dwattr $C$DW$626, DW_AT_data_member_location[DW_OP_plus_uconst 0x5e]
    6160                      .dwattr $C$DW$626, DW_AT_accessibility(DW_ACCESS_public)
    6161              $C$DW$627       .dwtag  DW_TAG_member
TMS320C2000 Assembler PC v6.2.5 Sat Sep 16 14:47:35 2017

Tools Copyright (c) 1996-2014 Texas Instruments Incorporated
C:\Users\wmj\AppData\Local\Temp\1316010                              PAGE  125

    6162                      .dwattr $C$DW$627, DW_AT_type(*$C$DW$T$47)
    6163                      .dwattr $C$DW$627, DW_AT_name("trajHandle_Id")
    6164                      .dwattr $C$DW$627, DW_AT_TI_symbol_name("_trajHandle_Id")
    6165                      .dwattr $C$DW$627, DW_AT_data_member_location[DW_OP_plus_uconst 0x60]
    6166                      .dwattr $C$DW$627, DW_AT_accessibility(DW_ACCESS_public)
    6167              $C$DW$628       .dwtag  DW_TAG_member
    6168                      .dwattr $C$DW$628, DW_AT_type(*$C$DW$T$48)
    6169                      .dwattr $C$DW$628, DW_AT_name("traj_Id")
    6170                      .dwattr $C$DW$628, DW_AT_TI_symbol_name("_traj_Id")
    6171                      .dwattr $C$DW$628, DW_AT_data_member_location[DW_OP_plus_uconst 0x62]
    6172                      .dwattr $C$DW$628, DW_AT_accessibility(DW_ACCESS_public)
    6173              $C$DW$629       .dwtag  DW_TAG_member
    6174                      .dwattr $C$DW$629, DW_AT_type(*$C$DW$T$47)
    6175                      .dwattr $C$DW$629, DW_AT_name("trajHandle_spd")
    6176                      .dwattr $C$DW$629, DW_AT_TI_symbol_name("_trajHandle_spd")
    6177                      .dwattr $C$DW$629, DW_AT_data_member_location[DW_OP_plus_uconst 0x6c]
    6178                      .dwattr $C$DW$629, DW_AT_accessibility(DW_ACCESS_public)
    6179              $C$DW$630       .dwtag  DW_TAG_member
    6180                      .dwattr $C$DW$630, DW_AT_type(*$C$DW$T$48)
    6181                      .dwattr $C$DW$630, DW_AT_name("traj_spd")
    6182                      .dwattr $C$DW$630, DW_AT_TI_symbol_name("_traj_spd")
    6183                      .dwattr $C$DW$630, DW_AT_data_member_location[DW_OP_plus_uconst 0x6e]
    6184                      .dwattr $C$DW$630, DW_AT_accessibility(DW_ACCESS_public)
    6185              $C$DW$631       .dwtag  DW_TAG_member
    6186                      .dwattr $C$DW$631, DW_AT_type(*$C$DW$T$47)
    6187                      .dwattr $C$DW$631, DW_AT_name("trajHandle_spdMax")
    6188                      .dwattr $C$DW$631, DW_AT_TI_symbol_name("_trajHandle_spdMax")
    6189                      .dwattr $C$DW$631, DW_AT_data_member_location[DW_OP_plus_uconst 0x78]
    6190                      .dwattr $C$DW$631, DW_AT_accessibility(DW_ACCESS_public)
    6191              $C$DW$632       .dwtag  DW_TAG_member
    6192                      .dwattr $C$DW$632, DW_AT_type(*$C$DW$T$48)
    6193                      .dwattr $C$DW$632, DW_AT_name("traj_spdMax")
    6194                      .dwattr $C$DW$632, DW_AT_TI_symbol_name("_traj_spdMax")
    6195                      .dwattr $C$DW$632, DW_AT_data_member_location[DW_OP_plus_uconst 0x7a]
    6196                      .dwattr $C$DW$632, DW_AT_accessibility(DW_ACCESS_public)
    6197              $C$DW$633       .dwtag  DW_TAG_member
    6198                      .dwattr $C$DW$633, DW_AT_type(*$C$DW$T$49)
    6199                      .dwattr $C$DW$633, DW_AT_name("motorParams")
    6200                      .dwattr $C$DW$633, DW_AT_TI_symbol_name("_motorParams")
    6201                      .dwattr $C$DW$633, DW_AT_data_member_location[DW_OP_plus_uconst 0x84]
    6202                      .dwattr $C$DW$633, DW_AT_accessibility(DW_ACCESS_public)
    6203              $C$DW$634       .dwtag  DW_TAG_member
    6204                      .dwattr $C$DW$634, DW_AT_type(*$C$DW$T$52)
    6205                      .dwattr $C$DW$634, DW_AT_name("waitTimes")
    6206                      .dwattr $C$DW$634, DW_AT_TI_symbol_name("_waitTimes")
    6207                      .dwattr $C$DW$634, DW_AT_data_member_location[DW_OP_plus_uconst 0x92]
    6208                      .dwattr $C$DW$634, DW_AT_accessibility(DW_ACCESS_public)
    6209              $C$DW$635       .dwtag  DW_TAG_member
    6210                      .dwattr $C$DW$635, DW_AT_type(*$C$DW$T$51)
    6211                      .dwattr $C$DW$635, DW_AT_name("counter_state")
    6212                      .dwattr $C$DW$635, DW_AT_TI_symbol_name("_counter_state")
    6213                      .dwattr $C$DW$635, DW_AT_data_member_location[DW_OP_plus_uconst 0x9a]
    6214                      .dwattr $C$DW$635, DW_AT_accessibility(DW_ACCESS_public)
    6215              $C$DW$636       .dwtag  DW_TAG_member
    6216                      .dwattr $C$DW$636, DW_AT_type(*$C$DW$T$53)
TMS320C2000 Assembler PC v6.2.5 Sat Sep 16 14:47:35 2017

Tools Copyright (c) 1996-2014 Texas Instruments Incorporated
C:\Users\wmj\AppData\Local\Temp\1316010                              PAGE  126

    6217                      .dwattr $C$DW$636, DW_AT_name("numIsrTicksPerCtrlTick")
    6218                      .dwattr $C$DW$636, DW_AT_TI_symbol_name("_numIsrTicksPerCtrlTick")
    6219                      .dwattr $C$DW$636, DW_AT_data_member_location[DW_OP_plus_uconst 0x9c]
    6220                      .dwattr $C$DW$636, DW_AT_accessibility(DW_ACCESS_public)
    6221              $C$DW$637       .dwtag  DW_TAG_member
    6222                      .dwattr $C$DW$637, DW_AT_type(*$C$DW$T$53)
    6223                      .dwattr $C$DW$637, DW_AT_name("numCtrlTicksPerCurrentTick")
    6224                      .dwattr $C$DW$637, DW_AT_TI_symbol_name("_numCtrlTicksPerCurrentTick")
    6225                      .dwattr $C$DW$637, DW_AT_data_member_location[DW_OP_plus_uconst 0x9d]
    6226                      .dwattr $C$DW$637, DW_AT_accessibility(DW_ACCESS_public)
    6227              $C$DW$638       .dwtag  DW_TAG_member
    6228                      .dwattr $C$DW$638, DW_AT_type(*$C$DW$T$53)
    6229                      .dwattr $C$DW$638, DW_AT_name("numCtrlTicksPerSpeedTick")
    6230                      .dwattr $C$DW$638, DW_AT_TI_symbol_name("_numCtrlTicksPerSpeedTick")
    6231                      .dwattr $C$DW$638, DW_AT_data_member_location[DW_OP_plus_uconst 0x9e]
    6232                      .dwattr $C$DW$638, DW_AT_accessibility(DW_ACCESS_public)
    6233              $C$DW$639       .dwtag  DW_TAG_member
    6234                      .dwattr $C$DW$639, DW_AT_type(*$C$DW$T$53)
    6235                      .dwattr $C$DW$639, DW_AT_name("numCtrlTicksPerTrajTick")
    6236                      .dwattr $C$DW$639, DW_AT_TI_symbol_name("_numCtrlTicksPerTrajTick")
    6237                      .dwattr $C$DW$639, DW_AT_data_member_location[DW_OP_plus_uconst 0x9f]
    6238                      .dwattr $C$DW$639, DW_AT_accessibility(DW_ACCESS_public)
    6239              $C$DW$640       .dwtag  DW_TAG_member
    6240                      .dwattr $C$DW$640, DW_AT_type(*$C$DW$T$51)
    6241                      .dwattr $C$DW$640, DW_AT_name("ctrlFreq_Hz")
    6242                      .dwattr $C$DW$640, DW_AT_TI_symbol_name("_ctrlFreq_Hz")
    6243                      .dwattr $C$DW$640, DW_AT_data_member_location[DW_OP_plus_uconst 0xa0]
    6244                      .dwattr $C$DW$640, DW_AT_accessibility(DW_ACCESS_public)
    6245              $C$DW$641       .dwtag  DW_TAG_member
    6246                      .dwattr $C$DW$641, DW_AT_type(*$C$DW$T$51)
    6247                      .dwattr $C$DW$641, DW_AT_name("trajFreq_Hz")
    6248                      .dwattr $C$DW$641, DW_AT_TI_symbol_name("_trajFreq_Hz")
    6249                      .dwattr $C$DW$641, DW_AT_data_member_location[DW_OP_plus_uconst 0xa2]
    6250                      .dwattr $C$DW$641, DW_AT_accessibility(DW_ACCESS_public)
    6251              $C$DW$642       .dwtag  DW_TAG_member
    6252                      .dwattr $C$DW$642, DW_AT_type(*$C$DW$T$20)
    6253                      .dwattr $C$DW$642, DW_AT_name("trajPeriod_sec")
    6254                      .dwattr $C$DW$642, DW_AT_TI_symbol_name("_trajPeriod_sec")
    6255                      .dwattr $C$DW$642, DW_AT_data_member_location[DW_OP_plus_uconst 0xa4]
    6256                      .dwattr $C$DW$642, DW_AT_accessibility(DW_ACCESS_public)
    6257              $C$DW$643       .dwtag  DW_TAG_member
    6258                      .dwattr $C$DW$643, DW_AT_type(*$C$DW$T$54)
    6259                      .dwattr $C$DW$643, DW_AT_name("ctrlPeriod_sec")
    6260                      .dwattr $C$DW$643, DW_AT_TI_symbol_name("_ctrlPeriod_sec")
    6261                      .dwattr $C$DW$643, DW_AT_data_member_location[DW_OP_plus_uconst 0xa6]
    6262                      .dwattr $C$DW$643, DW_AT_accessibility(DW_ACCESS_public)
    6263              $C$DW$644       .dwtag  DW_TAG_member
    6264                      .dwattr $C$DW$644, DW_AT_type(*$C$DW$T$20)
    6265                      .dwattr $C$DW$644, DW_AT_name("maxVsMag_pu")
    6266                      .dwattr $C$DW$644, DW_AT_TI_symbol_name("_maxVsMag_pu")
    6267                      .dwattr $C$DW$644, DW_AT_data_member_location[DW_OP_plus_uconst 0xa8]
    6268                      .dwattr $C$DW$644, DW_AT_accessibility(DW_ACCESS_public)
    6269              $C$DW$645       .dwtag  DW_TAG_member
    6270                      .dwattr $C$DW$645, DW_AT_type(*$C$DW$T$55)
    6271                      .dwattr $C$DW$645, DW_AT_name("Iab_in")
TMS320C2000 Assembler PC v6.2.5 Sat Sep 16 14:47:35 2017

Tools Copyright (c) 1996-2014 Texas Instruments Incorporated
C:\Users\wmj\AppData\Local\Temp\1316010                              PAGE  127

    6272                      .dwattr $C$DW$645, DW_AT_TI_symbol_name("_Iab_in")
    6273                      .dwattr $C$DW$645, DW_AT_data_member_location[DW_OP_plus_uconst 0xaa]
    6274                      .dwattr $C$DW$645, DW_AT_accessibility(DW_ACCESS_public)
    6275              $C$DW$646       .dwtag  DW_TAG_member
    6276                      .dwattr $C$DW$646, DW_AT_type(*$C$DW$T$55)
    6277                      .dwattr $C$DW$646, DW_AT_name("Iab_filt")
    6278                      .dwattr $C$DW$646, DW_AT_TI_symbol_name("_Iab_filt")
    6279                      .dwattr $C$DW$646, DW_AT_data_member_location[DW_OP_plus_uconst 0xae]
    6280                      .dwattr $C$DW$646, DW_AT_accessibility(DW_ACCESS_public)
    6281              $C$DW$647       .dwtag  DW_TAG_member
    6282                      .dwattr $C$DW$647, DW_AT_type(*$C$DW$T$55)
    6283                      .dwattr $C$DW$647, DW_AT_name("Idq_in")
    6284                      .dwattr $C$DW$647, DW_AT_TI_symbol_name("_Idq_in")
    6285                      .dwattr $C$DW$647, DW_AT_data_member_location[DW_OP_plus_uconst 0xb2]
    6286                      .dwattr $C$DW$647, DW_AT_accessibility(DW_ACCESS_public)
    6287              $C$DW$648       .dwtag  DW_TAG_member
    6288                      .dwattr $C$DW$648, DW_AT_type(*$C$DW$T$55)
    6289                      .dwattr $C$DW$648, DW_AT_name("Vab_in")
    6290                      .dwattr $C$DW$648, DW_AT_TI_symbol_name("_Vab_in")
    6291                      .dwattr $C$DW$648, DW_AT_data_member_location[DW_OP_plus_uconst 0xb6]
    6292                      .dwattr $C$DW$648, DW_AT_accessibility(DW_ACCESS_public)
    6293              $C$DW$649       .dwtag  DW_TAG_member
    6294                      .dwattr $C$DW$649, DW_AT_type(*$C$DW$T$20)
    6295                      .dwattr $C$DW$649, DW_AT_name("spd_out")
    6296                      .dwattr $C$DW$649, DW_AT_TI_symbol_name("_spd_out")
    6297                      .dwattr $C$DW$649, DW_AT_data_member_location[DW_OP_plus_uconst 0xba]
    6298                      .dwattr $C$DW$649, DW_AT_accessibility(DW_ACCESS_public)
    6299              $C$DW$650       .dwtag  DW_TAG_member
    6300                      .dwattr $C$DW$650, DW_AT_type(*$C$DW$T$55)
    6301                      .dwattr $C$DW$650, DW_AT_name("Vab_out")
    6302                      .dwattr $C$DW$650, DW_AT_TI_symbol_name("_Vab_out")
    6303                      .dwattr $C$DW$650, DW_AT_data_member_location[DW_OP_plus_uconst 0xbc]
    6304                      .dwattr $C$DW$650, DW_AT_accessibility(DW_ACCESS_public)
    6305              $C$DW$651       .dwtag  DW_TAG_member
    6306                      .dwattr $C$DW$651, DW_AT_type(*$C$DW$T$55)
    6307                      .dwattr $C$DW$651, DW_AT_name("Vdq_out")
    6308                      .dwattr $C$DW$651, DW_AT_TI_symbol_name("_Vdq_out")
    6309                      .dwattr $C$DW$651, DW_AT_data_member_location[DW_OP_plus_uconst 0xc0]
    6310                      .dwattr $C$DW$651, DW_AT_accessibility(DW_ACCESS_public)
    6311              $C$DW$652       .dwtag  DW_TAG_member
    6312                      .dwattr $C$DW$652, DW_AT_type(*$C$DW$T$54)
    6313                      .dwattr $C$DW$652, DW_AT_name("Rhf")
    6314                      .dwattr $C$DW$652, DW_AT_TI_symbol_name("_Rhf")
    6315                      .dwattr $C$DW$652, DW_AT_data_member_location[DW_OP_plus_uconst 0xc4]
    6316                      .dwattr $C$DW$652, DW_AT_accessibility(DW_ACCESS_public)
    6317              $C$DW$653       .dwtag  DW_TAG_member
    6318                      .dwattr $C$DW$653, DW_AT_type(*$C$DW$T$54)
    6319                      .dwattr $C$DW$653, DW_AT_name("Lhf")
    6320                      .dwattr $C$DW$653, DW_AT_TI_symbol_name("_Lhf")
    6321                      .dwattr $C$DW$653, DW_AT_data_member_location[DW_OP_plus_uconst 0xc6]
    6322                      .dwattr $C$DW$653, DW_AT_accessibility(DW_ACCESS_public)
    6323              $C$DW$654       .dwtag  DW_TAG_member
    6324                      .dwattr $C$DW$654, DW_AT_type(*$C$DW$T$54)
    6325                      .dwattr $C$DW$654, DW_AT_name("RoverL")
    6326                      .dwattr $C$DW$654, DW_AT_TI_symbol_name("_RoverL")
TMS320C2000 Assembler PC v6.2.5 Sat Sep 16 14:47:35 2017

Tools Copyright (c) 1996-2014 Texas Instruments Incorporated
C:\Users\wmj\AppData\Local\Temp\1316010                              PAGE  128

    6327                      .dwattr $C$DW$654, DW_AT_data_member_location[DW_OP_plus_uconst 0xc8]
    6328                      .dwattr $C$DW$654, DW_AT_accessibility(DW_ACCESS_public)
    6329              $C$DW$655       .dwtag  DW_TAG_member
    6330                      .dwattr $C$DW$655, DW_AT_type(*$C$DW$T$20)
    6331                      .dwattr $C$DW$655, DW_AT_name("Kp_Id")
    6332                      .dwattr $C$DW$655, DW_AT_TI_symbol_name("_Kp_Id")
    6333                      .dwattr $C$DW$655, DW_AT_data_member_location[DW_OP_plus_uconst 0xca]
    6334                      .dwattr $C$DW$655, DW_AT_accessibility(DW_ACCESS_public)
    6335              $C$DW$656       .dwtag  DW_TAG_member
    6336                      .dwattr $C$DW$656, DW_AT_type(*$C$DW$T$20)
    6337                      .dwattr $C$DW$656, DW_AT_name("Kp_Iq")
    6338                      .dwattr $C$DW$656, DW_AT_TI_symbol_name("_Kp_Iq")
    6339                      .dwattr $C$DW$656, DW_AT_data_member_location[DW_OP_plus_uconst 0xcc]
    6340                      .dwattr $C$DW$656, DW_AT_accessibility(DW_ACCESS_public)
    6341              $C$DW$657       .dwtag  DW_TAG_member
    6342                      .dwattr $C$DW$657, DW_AT_type(*$C$DW$T$20)
    6343                      .dwattr $C$DW$657, DW_AT_name("Kp_spd")
    6344                      .dwattr $C$DW$657, DW_AT_TI_symbol_name("_Kp_spd")
    6345                      .dwattr $C$DW$657, DW_AT_data_member_location[DW_OP_plus_uconst 0xce]
    6346                      .dwattr $C$DW$657, DW_AT_accessibility(DW_ACCESS_public)
    6347              $C$DW$658       .dwtag  DW_TAG_member
    6348                      .dwattr $C$DW$658, DW_AT_type(*$C$DW$T$20)
    6349                      .dwattr $C$DW$658, DW_AT_name("Ki_Id")
    6350                      .dwattr $C$DW$658, DW_AT_TI_symbol_name("_Ki_Id")
    6351                      .dwattr $C$DW$658, DW_AT_data_member_location[DW_OP_plus_uconst 0xd0]
    6352                      .dwattr $C$DW$658, DW_AT_accessibility(DW_ACCESS_public)
    6353              $C$DW$659       .dwtag  DW_TAG_member
    6354                      .dwattr $C$DW$659, DW_AT_type(*$C$DW$T$20)
    6355                      .dwattr $C$DW$659, DW_AT_name("Ki_Iq")
    6356                      .dwattr $C$DW$659, DW_AT_TI_symbol_name("_Ki_Iq")
    6357                      .dwattr $C$DW$659, DW_AT_data_member_location[DW_OP_plus_uconst 0xd2]
    6358                      .dwattr $C$DW$659, DW_AT_accessibility(DW_ACCESS_public)
    6359              $C$DW$660       .dwtag  DW_TAG_member
    6360                      .dwattr $C$DW$660, DW_AT_type(*$C$DW$T$20)
    6361                      .dwattr $C$DW$660, DW_AT_name("Ki_spd")
    6362                      .dwattr $C$DW$660, DW_AT_TI_symbol_name("_Ki_spd")
    6363                      .dwattr $C$DW$660, DW_AT_data_member_location[DW_OP_plus_uconst 0xd4]
    6364                      .dwattr $C$DW$660, DW_AT_accessibility(DW_ACCESS_public)
    6365              $C$DW$661       .dwtag  DW_TAG_member
    6366                      .dwattr $C$DW$661, DW_AT_type(*$C$DW$T$20)
    6367                      .dwattr $C$DW$661, DW_AT_name("Kd_Id")
    6368                      .dwattr $C$DW$661, DW_AT_TI_symbol_name("_Kd_Id")
    6369                      .dwattr $C$DW$661, DW_AT_data_member_location[DW_OP_plus_uconst 0xd6]
    6370                      .dwattr $C$DW$661, DW_AT_accessibility(DW_ACCESS_public)
    6371              $C$DW$662       .dwtag  DW_TAG_member
    6372                      .dwattr $C$DW$662, DW_AT_type(*$C$DW$T$20)
    6373                      .dwattr $C$DW$662, DW_AT_name("Kd_Iq")
    6374                      .dwattr $C$DW$662, DW_AT_TI_symbol_name("_Kd_Iq")
    6375                      .dwattr $C$DW$662, DW_AT_data_member_location[DW_OP_plus_uconst 0xd8]
    6376                      .dwattr $C$DW$662, DW_AT_accessibility(DW_ACCESS_public)
    6377              $C$DW$663       .dwtag  DW_TAG_member
    6378                      .dwattr $C$DW$663, DW_AT_type(*$C$DW$T$20)
    6379                      .dwattr $C$DW$663, DW_AT_name("Kd_spd")
    6380                      .dwattr $C$DW$663, DW_AT_TI_symbol_name("_Kd_spd")
    6381                      .dwattr $C$DW$663, DW_AT_data_member_location[DW_OP_plus_uconst 0xda]
TMS320C2000 Assembler PC v6.2.5 Sat Sep 16 14:47:35 2017

Tools Copyright (c) 1996-2014 Texas Instruments Incorporated
C:\Users\wmj\AppData\Local\Temp\1316010                              PAGE  129

    6382                      .dwattr $C$DW$663, DW_AT_accessibility(DW_ACCESS_public)
    6383              $C$DW$664       .dwtag  DW_TAG_member
    6384                      .dwattr $C$DW$664, DW_AT_type(*$C$DW$T$20)
    6385                      .dwattr $C$DW$664, DW_AT_name("Ui_Id")
    6386                      .dwattr $C$DW$664, DW_AT_TI_symbol_name("_Ui_Id")
    6387                      .dwattr $C$DW$664, DW_AT_data_member_location[DW_OP_plus_uconst 0xdc]
    6388                      .dwattr $C$DW$664, DW_AT_accessibility(DW_ACCESS_public)
    6389              $C$DW$665       .dwtag  DW_TAG_member
    6390                      .dwattr $C$DW$665, DW_AT_type(*$C$DW$T$20)
    6391                      .dwattr $C$DW$665, DW_AT_name("Ui_Iq")
    6392                      .dwattr $C$DW$665, DW_AT_TI_symbol_name("_Ui_Iq")
    6393                      .dwattr $C$DW$665, DW_AT_data_member_location[DW_OP_plus_uconst 0xde]
    6394                      .dwattr $C$DW$665, DW_AT_accessibility(DW_ACCESS_public)
    6395              $C$DW$666       .dwtag  DW_TAG_member
    6396                      .dwattr $C$DW$666, DW_AT_type(*$C$DW$T$20)
    6397                      .dwattr $C$DW$666, DW_AT_name("Ui_spd")
    6398                      .dwattr $C$DW$666, DW_AT_TI_symbol_name("_Ui_spd")
    6399                      .dwattr $C$DW$666, DW_AT_data_member_location[DW_OP_plus_uconst 0xe0]
    6400                      .dwattr $C$DW$666, DW_AT_accessibility(DW_ACCESS_public)
    6401              $C$DW$667       .dwtag  DW_TAG_member
    6402                      .dwattr $C$DW$667, DW_AT_type(*$C$DW$T$55)
    6403                      .dwattr $C$DW$667, DW_AT_name("Idq_ref")
    6404                      .dwattr $C$DW$667, DW_AT_TI_symbol_name("_Idq_ref")
    6405                      .dwattr $C$DW$667, DW_AT_data_member_location[DW_OP_plus_uconst 0xe2]
    6406                      .dwattr $C$DW$667, DW_AT_accessibility(DW_ACCESS_public)
    6407              $C$DW$668       .dwtag  DW_TAG_member
    6408                      .dwattr $C$DW$668, DW_AT_type(*$C$DW$T$20)
    6409                      .dwattr $C$DW$668, DW_AT_name("IdRated")
    6410                      .dwattr $C$DW$668, DW_AT_TI_symbol_name("_IdRated")
    6411                      .dwattr $C$DW$668, DW_AT_data_member_location[DW_OP_plus_uconst 0xe6]
    6412                      .dwattr $C$DW$668, DW_AT_accessibility(DW_ACCESS_public)
    6413              $C$DW$669       .dwtag  DW_TAG_member
    6414                      .dwattr $C$DW$669, DW_AT_type(*$C$DW$T$20)
    6415                      .dwattr $C$DW$669, DW_AT_name("spd_ref")
    6416                      .dwattr $C$DW$669, DW_AT_TI_symbol_name("_spd_ref")
    6417                      .dwattr $C$DW$669, DW_AT_data_member_location[DW_OP_plus_uconst 0xe8]
    6418                      .dwattr $C$DW$669, DW_AT_accessibility(DW_ACCESS_public)
    6419              $C$DW$670       .dwtag  DW_TAG_member
    6420                      .dwattr $C$DW$670, DW_AT_type(*$C$DW$T$20)
    6421                      .dwattr $C$DW$670, DW_AT_name("spd_max")
    6422                      .dwattr $C$DW$670, DW_AT_TI_symbol_name("_spd_max")
    6423                      .dwattr $C$DW$670, DW_AT_data_member_location[DW_OP_plus_uconst 0xea]
    6424                      .dwattr $C$DW$670, DW_AT_accessibility(DW_ACCESS_public)
    6425              $C$DW$671       .dwtag  DW_TAG_member
    6426                      .dwattr $C$DW$671, DW_AT_type(*$C$DW$T$53)
    6427                      .dwattr $C$DW$671, DW_AT_name("counter_current")
    6428                      .dwattr $C$DW$671, DW_AT_TI_symbol_name("_counter_current")
    6429                      .dwattr $C$DW$671, DW_AT_data_member_location[DW_OP_plus_uconst 0xec]
    6430                      .dwattr $C$DW$671, DW_AT_accessibility(DW_ACCESS_public)
    6431              $C$DW$672       .dwtag  DW_TAG_member
    6432                      .dwattr $C$DW$672, DW_AT_type(*$C$DW$T$53)
    6433                      .dwattr $C$DW$672, DW_AT_name("counter_isr")
    6434                      .dwattr $C$DW$672, DW_AT_TI_symbol_name("_counter_isr")
    6435                      .dwattr $C$DW$672, DW_AT_data_member_location[DW_OP_plus_uconst 0xed]
    6436                      .dwattr $C$DW$672, DW_AT_accessibility(DW_ACCESS_public)
TMS320C2000 Assembler PC v6.2.5 Sat Sep 16 14:47:35 2017

Tools Copyright (c) 1996-2014 Texas Instruments Incorporated
C:\Users\wmj\AppData\Local\Temp\1316010                              PAGE  130

    6437              $C$DW$673       .dwtag  DW_TAG_member
    6438                      .dwattr $C$DW$673, DW_AT_type(*$C$DW$T$53)
    6439                      .dwattr $C$DW$673, DW_AT_name("counter_speed")
    6440                      .dwattr $C$DW$673, DW_AT_TI_symbol_name("_counter_speed")
    6441                      .dwattr $C$DW$673, DW_AT_data_member_location[DW_OP_plus_uconst 0xee]
    6442                      .dwattr $C$DW$673, DW_AT_accessibility(DW_ACCESS_public)
    6443              $C$DW$674       .dwtag  DW_TAG_member
    6444                      .dwattr $C$DW$674, DW_AT_type(*$C$DW$T$53)
    6445                      .dwattr $C$DW$674, DW_AT_name("counter_traj")
    6446                      .dwattr $C$DW$674, DW_AT_TI_symbol_name("_counter_traj")
    6447                      .dwattr $C$DW$674, DW_AT_data_member_location[DW_OP_plus_uconst 0xef]
    6448                      .dwattr $C$DW$674, DW_AT_accessibility(DW_ACCESS_public)
    6449              $C$DW$675       .dwtag  DW_TAG_member
    6450                      .dwattr $C$DW$675, DW_AT_type(*$C$DW$T$56)
    6451                      .dwattr $C$DW$675, DW_AT_name("flag_enableCtrl")
    6452                      .dwattr $C$DW$675, DW_AT_TI_symbol_name("_flag_enableCtrl")
    6453                      .dwattr $C$DW$675, DW_AT_data_member_location[DW_OP_plus_uconst 0xf0]
    6454                      .dwattr $C$DW$675, DW_AT_accessibility(DW_ACCESS_public)
    6455              $C$DW$676       .dwtag  DW_TAG_member
    6456                      .dwattr $C$DW$676, DW_AT_type(*$C$DW$T$56)
    6457                      .dwattr $C$DW$676, DW_AT_name("flag_enableDcBusComp")
    6458                      .dwattr $C$DW$676, DW_AT_TI_symbol_name("_flag_enableDcBusComp")
    6459                      .dwattr $C$DW$676, DW_AT_data_member_location[DW_OP_plus_uconst 0xf1]
    6460                      .dwattr $C$DW$676, DW_AT_accessibility(DW_ACCESS_public)
    6461              $C$DW$677       .dwtag  DW_TAG_member
    6462                      .dwattr $C$DW$677, DW_AT_type(*$C$DW$T$56)
    6463                      .dwattr $C$DW$677, DW_AT_name("flag_enablePowerWarp")
    6464                      .dwattr $C$DW$677, DW_AT_TI_symbol_name("_flag_enablePowerWarp")
    6465                      .dwattr $C$DW$677, DW_AT_data_member_location[DW_OP_plus_uconst 0xf2]
    6466                      .dwattr $C$DW$677, DW_AT_accessibility(DW_ACCESS_public)
    6467              $C$DW$678       .dwtag  DW_TAG_member
    6468                      .dwattr $C$DW$678, DW_AT_type(*$C$DW$T$56)
    6469                      .dwattr $C$DW$678, DW_AT_name("flag_enableOffset")
    6470                      .dwattr $C$DW$678, DW_AT_TI_symbol_name("_flag_enableOffset")
    6471                      .dwattr $C$DW$678, DW_AT_data_member_location[DW_OP_plus_uconst 0xf3]
    6472                      .dwattr $C$DW$678, DW_AT_accessibility(DW_ACCESS_public)
    6473              $C$DW$679       .dwtag  DW_TAG_member
    6474                      .dwattr $C$DW$679, DW_AT_type(*$C$DW$T$56)
    6475                      .dwattr $C$DW$679, DW_AT_name("flag_enableSpeedCtrl")
    6476                      .dwattr $C$DW$679, DW_AT_TI_symbol_name("_flag_enableSpeedCtrl")
    6477                      .dwattr $C$DW$679, DW_AT_data_member_location[DW_OP_plus_uconst 0xf4]
    6478                      .dwattr $C$DW$679, DW_AT_accessibility(DW_ACCESS_public)
    6479              $C$DW$680       .dwtag  DW_TAG_member
    6480                      .dwattr $C$DW$680, DW_AT_type(*$C$DW$T$56)
    6481                      .dwattr $C$DW$680, DW_AT_name("flag_enableUserMotorParams")
    6482                      .dwattr $C$DW$680, DW_AT_TI_symbol_name("_flag_enableUserMotorParams")
    6483                      .dwattr $C$DW$680, DW_AT_data_member_location[DW_OP_plus_uconst 0xf5]
    6484                      .dwattr $C$DW$680, DW_AT_accessibility(DW_ACCESS_public)
    6485              $C$DW$681       .dwtag  DW_TAG_member
    6486                      .dwattr $C$DW$681, DW_AT_type(*$C$DW$T$55)
    6487                      .dwattr $C$DW$681, DW_AT_name("Idq_offset_pu")
    6488                      .dwattr $C$DW$681, DW_AT_TI_symbol_name("_Idq_offset_pu")
    6489                      .dwattr $C$DW$681, DW_AT_data_member_location[DW_OP_plus_uconst 0xf6]
    6490                      .dwattr $C$DW$681, DW_AT_accessibility(DW_ACCESS_public)
    6491              $C$DW$682       .dwtag  DW_TAG_member
TMS320C2000 Assembler PC v6.2.5 Sat Sep 16 14:47:35 2017

Tools Copyright (c) 1996-2014 Texas Instruments Incorporated
C:\Users\wmj\AppData\Local\Temp\1316010                              PAGE  131

    6492                      .dwattr $C$DW$682, DW_AT_type(*$C$DW$T$55)
    6493                      .dwattr $C$DW$682, DW_AT_name("Vdq_offset_pu")
    6494                      .dwattr $C$DW$682, DW_AT_TI_symbol_name("_Vdq_offset_pu")
    6495                      .dwattr $C$DW$682, DW_AT_data_member_location[DW_OP_plus_uconst 0xfa]
    6496                      .dwattr $C$DW$682, DW_AT_accessibility(DW_ACCESS_public)
    6497              $C$DW$683       .dwtag  DW_TAG_member
    6498                      .dwattr $C$DW$683, DW_AT_type(*$C$DW$T$20)
    6499                      .dwattr $C$DW$683, DW_AT_name("angle_pu")
    6500                      .dwattr $C$DW$683, DW_AT_TI_symbol_name("_angle_pu")
    6501                      .dwattr $C$DW$683, DW_AT_data_member_location[DW_OP_plus_uconst 0xfe]
    6502                      .dwattr $C$DW$683, DW_AT_accessibility(DW_ACCESS_public)
    6503              $C$DW$684       .dwtag  DW_TAG_member
    6504                      .dwattr $C$DW$684, DW_AT_type(*$C$DW$T$20)
    6505                      .dwattr $C$DW$684, DW_AT_name("speed_ref_pu")
    6506                      .dwattr $C$DW$684, DW_AT_TI_symbol_name("_speed_ref_pu")
    6507                      .dwattr $C$DW$684, DW_AT_data_member_location[DW_OP_plus_uconst 0x100]
    6508                      .dwattr $C$DW$684, DW_AT_accessibility(DW_ACCESS_public)
    6509              $C$DW$685       .dwtag  DW_TAG_member
    6510                      .dwattr $C$DW$685, DW_AT_type(*$C$DW$T$20)
    6511                      .dwattr $C$DW$685, DW_AT_name("speed_fb_pu")
    6512                      .dwattr $C$DW$685, DW_AT_TI_symbol_name("_speed_fb_pu")
    6513                      .dwattr $C$DW$685, DW_AT_data_member_location[DW_OP_plus_uconst 0x102]
    6514                      .dwattr $C$DW$685, DW_AT_accessibility(DW_ACCESS_public)
    6515              $C$DW$686       .dwtag  DW_TAG_member
    6516                      .dwattr $C$DW$686, DW_AT_type(*$C$DW$T$20)
    6517                      .dwattr $C$DW$686, DW_AT_name("speed_outMax_pu")
    6518                      .dwattr $C$DW$686, DW_AT_TI_symbol_name("_speed_outMax_pu")
    6519                      .dwattr $C$DW$686, DW_AT_data_member_location[DW_OP_plus_uconst 0x104]
    6520                      .dwattr $C$DW$686, DW_AT_accessibility(DW_ACCESS_public)
    6521              $C$DW$687       .dwtag  DW_TAG_member
    6522                      .dwattr $C$DW$687, DW_AT_type(*$C$DW$T$56)
    6523                      .dwattr $C$DW$687, DW_AT_name("flag_enableCurrentCtrl")
    6524                      .dwattr $C$DW$687, DW_AT_TI_symbol_name("_flag_enableCurrentCtrl")
    6525                      .dwattr $C$DW$687, DW_AT_data_member_location[DW_OP_plus_uconst 0x106]
    6526                      .dwattr $C$DW$687, DW_AT_accessibility(DW_ACCESS_public)
    6527                      .dwendtag $C$DW$T$57
    6528              
    6529              $C$DW$T$86      .dwtag  DW_TAG_typedef, DW_AT_name("CTRL_Obj")
    6530                      .dwattr $C$DW$T$86, DW_AT_type(*$C$DW$T$57)
    6531                      .dwattr $C$DW$T$86, DW_AT_language(DW_LANG_C)
    6532              $C$DW$T$87      .dwtag  DW_TAG_pointer_type
    6533                      .dwattr $C$DW$T$87, DW_AT_type(*$C$DW$T$57)
    6534                      .dwattr $C$DW$T$87, DW_AT_address_class(0x16)
    6535              $C$DW$T$88      .dwtag  DW_TAG_typedef, DW_AT_name("CTRL_Handle")
    6536                      .dwattr $C$DW$T$88, DW_AT_type(*$C$DW$T$87)
    6537                      .dwattr $C$DW$T$88, DW_AT_language(DW_LANG_C)
    6538              $C$DW$688       .dwtag  DW_TAG_TI_far_type
    6539                      .dwattr $C$DW$688, DW_AT_type(*$C$DW$T$88)
    6540              $C$DW$T$89      .dwtag  DW_TAG_const_type
    6541                      .dwattr $C$DW$T$89, DW_AT_type(*$C$DW$688)
    6542              
    6543              $C$DW$T$60      .dwtag  DW_TAG_structure_type
    6544                      .dwattr $C$DW$T$60, DW_AT_name("_CTRL_Version_")
    6545                      .dwattr $C$DW$T$60, DW_AT_byte_size(0x04)
    6546              $C$DW$689       .dwtag  DW_TAG_member
TMS320C2000 Assembler PC v6.2.5 Sat Sep 16 14:47:35 2017

Tools Copyright (c) 1996-2014 Texas Instruments Incorporated
C:\Users\wmj\AppData\Local\Temp\1316010                              PAGE  132

    6547                      .dwattr $C$DW$689, DW_AT_type(*$C$DW$T$21)
    6548                      .dwattr $C$DW$689, DW_AT_name("rsvd")
    6549                      .dwattr $C$DW$689, DW_AT_TI_symbol_name("_rsvd")
    6550                      .dwattr $C$DW$689, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    6551                      .dwattr $C$DW$689, DW_AT_accessibility(DW_ACCESS_public)
    6552              $C$DW$690       .dwtag  DW_TAG_member
    6553                      .dwattr $C$DW$690, DW_AT_type(*$C$DW$T$59)
    6554                      .dwattr $C$DW$690, DW_AT_name("targetProc")
    6555                      .dwattr $C$DW$690, DW_AT_TI_symbol_name("_targetProc")
    6556                      .dwattr $C$DW$690, DW_AT_data_member_location[DW_OP_plus_uconst 0x1]
    6557                      .dwattr $C$DW$690, DW_AT_accessibility(DW_ACCESS_public)
    6558              $C$DW$691       .dwtag  DW_TAG_member
    6559                      .dwattr $C$DW$691, DW_AT_type(*$C$DW$T$21)
    6560                      .dwattr $C$DW$691, DW_AT_name("major")
    6561                      .dwattr $C$DW$691, DW_AT_TI_symbol_name("_major")
    6562                      .dwattr $C$DW$691, DW_AT_data_member_location[DW_OP_plus_uconst 0x2]
    6563                      .dwattr $C$DW$691, DW_AT_accessibility(DW_ACCESS_public)
    6564              $C$DW$692       .dwtag  DW_TAG_member
    6565                      .dwattr $C$DW$692, DW_AT_type(*$C$DW$T$21)
    6566                      .dwattr $C$DW$692, DW_AT_name("minor")
    6567                      .dwattr $C$DW$692, DW_AT_TI_symbol_name("_minor")
    6568                      .dwattr $C$DW$692, DW_AT_data_member_location[DW_OP_plus_uconst 0x3]
    6569                      .dwattr $C$DW$692, DW_AT_accessibility(DW_ACCESS_public)
    6570                      .dwendtag $C$DW$T$60
    6571              
    6572              $C$DW$T$24      .dwtag  DW_TAG_typedef, DW_AT_name("CTRL_Version")
    6573                      .dwattr $C$DW$T$24, DW_AT_type(*$C$DW$T$60)
    6574                      .dwattr $C$DW$T$24, DW_AT_language(DW_LANG_C)
    6575              
    6576              $C$DW$T$19      .dwtag  DW_TAG_structure_type
    6577                      .dwattr $C$DW$T$19, DW_AT_name("_EST_Obj_")
    6578                      .dwattr $C$DW$T$19, DW_AT_declaration
    6579                      .dwendtag $C$DW$T$19
    6580              
    6581              $C$DW$T$32      .dwtag  DW_TAG_pointer_type
    6582                      .dwattr $C$DW$T$32, DW_AT_type(*$C$DW$T$19)
    6583                      .dwattr $C$DW$T$32, DW_AT_address_class(0x16)
    6584              $C$DW$T$33      .dwtag  DW_TAG_typedef, DW_AT_name("EST_Handle")
    6585                      .dwattr $C$DW$T$33, DW_AT_type(*$C$DW$T$32)
    6586                      .dwattr $C$DW$T$33, DW_AT_language(DW_LANG_C)
    6587              
    6588              $C$DW$T$61      .dwtag  DW_TAG_structure_type
    6589                      .dwattr $C$DW$T$61, DW_AT_name("_IPARK_Obj_")
    6590                      .dwattr $C$DW$T$61, DW_AT_byte_size(0x04)
    6591              $C$DW$693       .dwtag  DW_TAG_member
    6592                      .dwattr $C$DW$693, DW_AT_type(*$C$DW$T$20)
    6593                      .dwattr $C$DW$693, DW_AT_name("sinTh")
    6594                      .dwattr $C$DW$693, DW_AT_TI_symbol_name("_sinTh")
    6595                      .dwattr $C$DW$693, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    6596                      .dwattr $C$DW$693, DW_AT_accessibility(DW_ACCESS_public)
    6597              $C$DW$694       .dwtag  DW_TAG_member
    6598                      .dwattr $C$DW$694, DW_AT_type(*$C$DW$T$20)
    6599                      .dwattr $C$DW$694, DW_AT_name("cosTh")
    6600                      .dwattr $C$DW$694, DW_AT_TI_symbol_name("_cosTh")
    6601                      .dwattr $C$DW$694, DW_AT_data_member_location[DW_OP_plus_uconst 0x2]
TMS320C2000 Assembler PC v6.2.5 Sat Sep 16 14:47:35 2017

Tools Copyright (c) 1996-2014 Texas Instruments Incorporated
C:\Users\wmj\AppData\Local\Temp\1316010                              PAGE  133

    6602                      .dwattr $C$DW$694, DW_AT_accessibility(DW_ACCESS_public)
    6603                      .dwendtag $C$DW$T$61
    6604              
    6605              $C$DW$T$42      .dwtag  DW_TAG_typedef, DW_AT_name("IPARK_Obj")
    6606                      .dwattr $C$DW$T$42, DW_AT_type(*$C$DW$T$61)
    6607                      .dwattr $C$DW$T$42, DW_AT_language(DW_LANG_C)
    6608              $C$DW$T$40      .dwtag  DW_TAG_pointer_type
    6609                      .dwattr $C$DW$T$40, DW_AT_type(*$C$DW$T$61)
    6610                      .dwattr $C$DW$T$40, DW_AT_address_class(0x16)
    6611              $C$DW$T$41      .dwtag  DW_TAG_typedef, DW_AT_name("IPARK_Handle")
    6612                      .dwattr $C$DW$T$41, DW_AT_type(*$C$DW$T$40)
    6613                      .dwattr $C$DW$T$41, DW_AT_language(DW_LANG_C)
    6614              
    6615              $C$DW$T$63      .dwtag  DW_TAG_structure_type
    6616                      .dwattr $C$DW$T$63, DW_AT_name("_MATH_vec2_")
    6617                      .dwattr $C$DW$T$63, DW_AT_byte_size(0x04)
    6618              $C$DW$695       .dwtag  DW_TAG_member
    6619                      .dwattr $C$DW$695, DW_AT_type(*$C$DW$T$62)
    6620                      .dwattr $C$DW$695, DW_AT_name("value")
    6621                      .dwattr $C$DW$695, DW_AT_TI_symbol_name("_value")
    6622                      .dwattr $C$DW$695, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    6623                      .dwattr $C$DW$695, DW_AT_accessibility(DW_ACCESS_public)
    6624                      .dwendtag $C$DW$T$63
    6625              
    6626              $C$DW$T$55      .dwtag  DW_TAG_typedef, DW_AT_name("MATH_vec2")
    6627                      .dwattr $C$DW$T$55, DW_AT_type(*$C$DW$T$63)
    6628                      .dwattr $C$DW$T$55, DW_AT_language(DW_LANG_C)
    6629              
    6630              $C$DW$T$66      .dwtag  DW_TAG_structure_type
    6631                      .dwattr $C$DW$T$66, DW_AT_name("_MOTOR_Params_")
    6632                      .dwattr $C$DW$T$66, DW_AT_byte_size(0x0e)
    6633              $C$DW$696       .dwtag  DW_TAG_member
    6634                      .dwattr $C$DW$696, DW_AT_type(*$C$DW$T$65)
    6635                      .dwattr $C$DW$696, DW_AT_name("type")
    6636                      .dwattr $C$DW$696, DW_AT_TI_symbol_name("_type")
    6637                      .dwattr $C$DW$696, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    6638                      .dwattr $C$DW$696, DW_AT_accessibility(DW_ACCESS_public)
    6639              $C$DW$697       .dwtag  DW_TAG_member
    6640                      .dwattr $C$DW$697, DW_AT_type(*$C$DW$T$53)
    6641                      .dwattr $C$DW$697, DW_AT_name("numPolePairs")
    6642                      .dwattr $C$DW$697, DW_AT_TI_symbol_name("_numPolePairs")
    6643                      .dwattr $C$DW$697, DW_AT_data_member_location[DW_OP_plus_uconst 0x1]
    6644                      .dwattr $C$DW$697, DW_AT_accessibility(DW_ACCESS_public)
    6645              $C$DW$698       .dwtag  DW_TAG_member
    6646                      .dwattr $C$DW$698, DW_AT_type(*$C$DW$T$54)
    6647                      .dwattr $C$DW$698, DW_AT_name("Lr_H")
    6648                      .dwattr $C$DW$698, DW_AT_TI_symbol_name("_Lr_H")
    6649                      .dwattr $C$DW$698, DW_AT_data_member_location[DW_OP_plus_uconst 0x2]
    6650                      .dwattr $C$DW$698, DW_AT_accessibility(DW_ACCESS_public)
    6651              $C$DW$699       .dwtag  DW_TAG_member
    6652                      .dwattr $C$DW$699, DW_AT_type(*$C$DW$T$54)
    6653                      .dwattr $C$DW$699, DW_AT_name("Ls_d_H")
    6654                      .dwattr $C$DW$699, DW_AT_TI_symbol_name("_Ls_d_H")
    6655                      .dwattr $C$DW$699, DW_AT_data_member_location[DW_OP_plus_uconst 0x4]
    6656                      .dwattr $C$DW$699, DW_AT_accessibility(DW_ACCESS_public)
TMS320C2000 Assembler PC v6.2.5 Sat Sep 16 14:47:35 2017

Tools Copyright (c) 1996-2014 Texas Instruments Incorporated
C:\Users\wmj\AppData\Local\Temp\1316010                              PAGE  134

    6657              $C$DW$700       .dwtag  DW_TAG_member
    6658                      .dwattr $C$DW$700, DW_AT_type(*$C$DW$T$54)
    6659                      .dwattr $C$DW$700, DW_AT_name("Ls_q_H")
    6660                      .dwattr $C$DW$700, DW_AT_TI_symbol_name("_Ls_q_H")
    6661                      .dwattr $C$DW$700, DW_AT_data_member_location[DW_OP_plus_uconst 0x6]
    6662                      .dwattr $C$DW$700, DW_AT_accessibility(DW_ACCESS_public)
    6663              $C$DW$701       .dwtag  DW_TAG_member
    6664                      .dwattr $C$DW$701, DW_AT_type(*$C$DW$T$54)
    6665                      .dwattr $C$DW$701, DW_AT_name("Rr_Ohm")
    6666                      .dwattr $C$DW$701, DW_AT_TI_symbol_name("_Rr_Ohm")
    6667                      .dwattr $C$DW$701, DW_AT_data_member_location[DW_OP_plus_uconst 0x8]
    6668                      .dwattr $C$DW$701, DW_AT_accessibility(DW_ACCESS_public)
    6669              $C$DW$702       .dwtag  DW_TAG_member
    6670                      .dwattr $C$DW$702, DW_AT_type(*$C$DW$T$54)
    6671                      .dwattr $C$DW$702, DW_AT_name("Rs_Ohm")
    6672                      .dwattr $C$DW$702, DW_AT_TI_symbol_name("_Rs_Ohm")
    6673                      .dwattr $C$DW$702, DW_AT_data_member_location[DW_OP_plus_uconst 0xa]
    6674                      .dwattr $C$DW$702, DW_AT_accessibility(DW_ACCESS_public)
    6675              $C$DW$703       .dwtag  DW_TAG_member
    6676                      .dwattr $C$DW$703, DW_AT_type(*$C$DW$T$54)
    6677                      .dwattr $C$DW$703, DW_AT_name("ratedFlux_VpHz")
    6678                      .dwattr $C$DW$703, DW_AT_TI_symbol_name("_ratedFlux_VpHz")
    6679                      .dwattr $C$DW$703, DW_AT_data_member_location[DW_OP_plus_uconst 0xc]
    6680                      .dwattr $C$DW$703, DW_AT_accessibility(DW_ACCESS_public)
    6681                      .dwendtag $C$DW$T$66
    6682              
    6683              $C$DW$T$49      .dwtag  DW_TAG_typedef, DW_AT_name("MOTOR_Params")
    6684                      .dwattr $C$DW$T$49, DW_AT_type(*$C$DW$T$66)
    6685                      .dwattr $C$DW$T$49, DW_AT_language(DW_LANG_C)
    6686              
    6687              $C$DW$T$67      .dwtag  DW_TAG_structure_type
    6688                      .dwattr $C$DW$T$67, DW_AT_name("_PARK_Obj_")
    6689                      .dwattr $C$DW$T$67, DW_AT_byte_size(0x04)
    6690              $C$DW$704       .dwtag  DW_TAG_member
    6691                      .dwattr $C$DW$704, DW_AT_type(*$C$DW$T$20)
    6692                      .dwattr $C$DW$704, DW_AT_name("sinTh")
    6693                      .dwattr $C$DW$704, DW_AT_TI_symbol_name("_sinTh")
    6694                      .dwattr $C$DW$704, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    6695                      .dwattr $C$DW$704, DW_AT_accessibility(DW_ACCESS_public)
    6696              $C$DW$705       .dwtag  DW_TAG_member
    6697                      .dwattr $C$DW$705, DW_AT_type(*$C$DW$T$20)
    6698                      .dwattr $C$DW$705, DW_AT_name("cosTh")
    6699                      .dwattr $C$DW$705, DW_AT_TI_symbol_name("_cosTh")
    6700                      .dwattr $C$DW$705, DW_AT_data_member_location[DW_OP_plus_uconst 0x2]
    6701                      .dwattr $C$DW$705, DW_AT_accessibility(DW_ACCESS_public)
    6702                      .dwendtag $C$DW$T$67
    6703              
    6704              $C$DW$T$36      .dwtag  DW_TAG_typedef, DW_AT_name("PARK_Obj")
    6705                      .dwattr $C$DW$T$36, DW_AT_type(*$C$DW$T$67)
    6706                      .dwattr $C$DW$T$36, DW_AT_language(DW_LANG_C)
    6707              $C$DW$T$34      .dwtag  DW_TAG_pointer_type
    6708                      .dwattr $C$DW$T$34, DW_AT_type(*$C$DW$T$67)
    6709                      .dwattr $C$DW$T$34, DW_AT_address_class(0x16)
    6710              $C$DW$T$35      .dwtag  DW_TAG_typedef, DW_AT_name("PARK_Handle")
    6711                      .dwattr $C$DW$T$35, DW_AT_type(*$C$DW$T$34)
TMS320C2000 Assembler PC v6.2.5 Sat Sep 16 14:47:35 2017

Tools Copyright (c) 1996-2014 Texas Instruments Incorporated
C:\Users\wmj\AppData\Local\Temp\1316010                              PAGE  135

    6712                      .dwattr $C$DW$T$35, DW_AT_language(DW_LANG_C)
    6713              
    6714              $C$DW$T$68      .dwtag  DW_TAG_structure_type
    6715                      .dwattr $C$DW$T$68, DW_AT_name("_PID_Obj_")
    6716                      .dwattr $C$DW$T$68, DW_AT_byte_size(0x10)
    6717              $C$DW$706       .dwtag  DW_TAG_member
    6718                      .dwattr $C$DW$706, DW_AT_type(*$C$DW$T$20)
    6719                      .dwattr $C$DW$706, DW_AT_name("Kp")
    6720                      .dwattr $C$DW$706, DW_AT_TI_symbol_name("_Kp")
    6721                      .dwattr $C$DW$706, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    6722                      .dwattr $C$DW$706, DW_AT_accessibility(DW_ACCESS_public)
    6723              $C$DW$707       .dwtag  DW_TAG_member
    6724                      .dwattr $C$DW$707, DW_AT_type(*$C$DW$T$20)
    6725                      .dwattr $C$DW$707, DW_AT_name("Ki")
    6726                      .dwattr $C$DW$707, DW_AT_TI_symbol_name("_Ki")
    6727                      .dwattr $C$DW$707, DW_AT_data_member_location[DW_OP_plus_uconst 0x2]
    6728                      .dwattr $C$DW$707, DW_AT_accessibility(DW_ACCESS_public)
    6729              $C$DW$708       .dwtag  DW_TAG_member
    6730                      .dwattr $C$DW$708, DW_AT_type(*$C$DW$T$20)
    6731                      .dwattr $C$DW$708, DW_AT_name("Kd")
    6732                      .dwattr $C$DW$708, DW_AT_TI_symbol_name("_Kd")
    6733                      .dwattr $C$DW$708, DW_AT_data_member_location[DW_OP_plus_uconst 0x4]
    6734                      .dwattr $C$DW$708, DW_AT_accessibility(DW_ACCESS_public)
    6735              $C$DW$709       .dwtag  DW_TAG_member
    6736                      .dwattr $C$DW$709, DW_AT_type(*$C$DW$T$20)
    6737                      .dwattr $C$DW$709, DW_AT_name("Ui")
    6738                      .dwattr $C$DW$709, DW_AT_TI_symbol_name("_Ui")
    6739                      .dwattr $C$DW$709, DW_AT_data_member_location[DW_OP_plus_uconst 0x6]
    6740                      .dwattr $C$DW$709, DW_AT_accessibility(DW_ACCESS_public)
    6741              $C$DW$710       .dwtag  DW_TAG_member
    6742                      .dwattr $C$DW$710, DW_AT_type(*$C$DW$T$20)
    6743                      .dwattr $C$DW$710, DW_AT_name("refValue")
    6744                      .dwattr $C$DW$710, DW_AT_TI_symbol_name("_refValue")
    6745                      .dwattr $C$DW$710, DW_AT_data_member_location[DW_OP_plus_uconst 0x8]
    6746                      .dwattr $C$DW$710, DW_AT_accessibility(DW_ACCESS_public)
    6747              $C$DW$711       .dwtag  DW_TAG_member
    6748                      .dwattr $C$DW$711, DW_AT_type(*$C$DW$T$20)
    6749                      .dwattr $C$DW$711, DW_AT_name("fbackValue")
    6750                      .dwattr $C$DW$711, DW_AT_TI_symbol_name("_fbackValue")
    6751                      .dwattr $C$DW$711, DW_AT_data_member_location[DW_OP_plus_uconst 0xa]
    6752                      .dwattr $C$DW$711, DW_AT_accessibility(DW_ACCESS_public)
    6753              $C$DW$712       .dwtag  DW_TAG_member
    6754                      .dwattr $C$DW$712, DW_AT_type(*$C$DW$T$20)
    6755                      .dwattr $C$DW$712, DW_AT_name("outMin")
    6756                      .dwattr $C$DW$712, DW_AT_TI_symbol_name("_outMin")
    6757                      .dwattr $C$DW$712, DW_AT_data_member_location[DW_OP_plus_uconst 0xc]
    6758                      .dwattr $C$DW$712, DW_AT_accessibility(DW_ACCESS_public)
    6759              $C$DW$713       .dwtag  DW_TAG_member
    6760                      .dwattr $C$DW$713, DW_AT_type(*$C$DW$T$20)
    6761                      .dwattr $C$DW$713, DW_AT_name("outMax")
    6762                      .dwattr $C$DW$713, DW_AT_TI_symbol_name("_outMax")
    6763                      .dwattr $C$DW$713, DW_AT_data_member_location[DW_OP_plus_uconst 0xe]
    6764                      .dwattr $C$DW$713, DW_AT_accessibility(DW_ACCESS_public)
    6765                      .dwendtag $C$DW$T$68
    6766              
TMS320C2000 Assembler PC v6.2.5 Sat Sep 16 14:47:35 2017

Tools Copyright (c) 1996-2014 Texas Instruments Incorporated
C:\Users\wmj\AppData\Local\Temp\1316010                              PAGE  136

    6767              $C$DW$T$39      .dwtag  DW_TAG_typedef, DW_AT_name("PID_Obj")
    6768                      .dwattr $C$DW$T$39, DW_AT_type(*$C$DW$T$68)
    6769                      .dwattr $C$DW$T$39, DW_AT_language(DW_LANG_C)
    6770              $C$DW$T$37      .dwtag  DW_TAG_pointer_type
    6771                      .dwattr $C$DW$T$37, DW_AT_type(*$C$DW$T$68)
    6772                      .dwattr $C$DW$T$37, DW_AT_address_class(0x16)
    6773              $C$DW$T$38      .dwtag  DW_TAG_typedef, DW_AT_name("PID_Handle")
    6774                      .dwattr $C$DW$T$38, DW_AT_type(*$C$DW$T$37)
    6775                      .dwattr $C$DW$T$38, DW_AT_language(DW_LANG_C)
    6776              
    6777              $C$DW$T$69      .dwtag  DW_TAG_structure_type
    6778                      .dwattr $C$DW$T$69, DW_AT_name("_SVGEN_Obj_")
    6779                      .dwattr $C$DW$T$69, DW_AT_byte_size(0x02)
    6780              $C$DW$714       .dwtag  DW_TAG_member
    6781                      .dwattr $C$DW$714, DW_AT_type(*$C$DW$T$20)
    6782                      .dwattr $C$DW$714, DW_AT_name("maxModulation")
    6783                      .dwattr $C$DW$714, DW_AT_TI_symbol_name("_maxModulation")
    6784                      .dwattr $C$DW$714, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    6785                      .dwattr $C$DW$714, DW_AT_accessibility(DW_ACCESS_public)
    6786                      .dwendtag $C$DW$T$69
    6787              
    6788              $C$DW$T$45      .dwtag  DW_TAG_typedef, DW_AT_name("SVGEN_Obj")
    6789                      .dwattr $C$DW$T$45, DW_AT_type(*$C$DW$T$69)
    6790                      .dwattr $C$DW$T$45, DW_AT_language(DW_LANG_C)
    6791              $C$DW$T$43      .dwtag  DW_TAG_pointer_type
    6792                      .dwattr $C$DW$T$43, DW_AT_type(*$C$DW$T$69)
    6793                      .dwattr $C$DW$T$43, DW_AT_address_class(0x16)
    6794              $C$DW$T$44      .dwtag  DW_TAG_typedef, DW_AT_name("SVGEN_Handle")
    6795                      .dwattr $C$DW$T$44, DW_AT_type(*$C$DW$T$43)
    6796                      .dwattr $C$DW$T$44, DW_AT_language(DW_LANG_C)
    6797              
    6798              $C$DW$T$70      .dwtag  DW_TAG_structure_type
    6799                      .dwattr $C$DW$T$70, DW_AT_name("_TRAJ_Obj_")
    6800                      .dwattr $C$DW$T$70, DW_AT_byte_size(0x0a)
    6801              $C$DW$715       .dwtag  DW_TAG_member
    6802                      .dwattr $C$DW$715, DW_AT_type(*$C$DW$T$20)
    6803                      .dwattr $C$DW$715, DW_AT_name("targetValue")
    6804                      .dwattr $C$DW$715, DW_AT_TI_symbol_name("_targetValue")
    6805                      .dwattr $C$DW$715, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    6806                      .dwattr $C$DW$715, DW_AT_accessibility(DW_ACCESS_public)
    6807              $C$DW$716       .dwtag  DW_TAG_member
    6808                      .dwattr $C$DW$716, DW_AT_type(*$C$DW$T$20)
    6809                      .dwattr $C$DW$716, DW_AT_name("intValue")
    6810                      .dwattr $C$DW$716, DW_AT_TI_symbol_name("_intValue")
    6811                      .dwattr $C$DW$716, DW_AT_data_member_location[DW_OP_plus_uconst 0x2]
    6812                      .dwattr $C$DW$716, DW_AT_accessibility(DW_ACCESS_public)
    6813              $C$DW$717       .dwtag  DW_TAG_member
    6814                      .dwattr $C$DW$717, DW_AT_type(*$C$DW$T$20)
    6815                      .dwattr $C$DW$717, DW_AT_name("minValue")
    6816                      .dwattr $C$DW$717, DW_AT_TI_symbol_name("_minValue")
    6817                      .dwattr $C$DW$717, DW_AT_data_member_location[DW_OP_plus_uconst 0x4]
    6818                      .dwattr $C$DW$717, DW_AT_accessibility(DW_ACCESS_public)
    6819              $C$DW$718       .dwtag  DW_TAG_member
    6820                      .dwattr $C$DW$718, DW_AT_type(*$C$DW$T$20)
    6821                      .dwattr $C$DW$718, DW_AT_name("maxValue")
TMS320C2000 Assembler PC v6.2.5 Sat Sep 16 14:47:35 2017

Tools Copyright (c) 1996-2014 Texas Instruments Incorporated
C:\Users\wmj\AppData\Local\Temp\1316010                              PAGE  137

    6822                      .dwattr $C$DW$718, DW_AT_TI_symbol_name("_maxValue")
    6823                      .dwattr $C$DW$718, DW_AT_data_member_location[DW_OP_plus_uconst 0x6]
    6824                      .dwattr $C$DW$718, DW_AT_accessibility(DW_ACCESS_public)
    6825              $C$DW$719       .dwtag  DW_TAG_member
    6826                      .dwattr $C$DW$719, DW_AT_type(*$C$DW$T$20)
    6827                      .dwattr $C$DW$719, DW_AT_name("maxDelta")
    6828                      .dwattr $C$DW$719, DW_AT_TI_symbol_name("_maxDelta")
    6829                      .dwattr $C$DW$719, DW_AT_data_member_location[DW_OP_plus_uconst 0x8]
    6830                      .dwattr $C$DW$719, DW_AT_accessibility(DW_ACCESS_public)
    6831                      .dwendtag $C$DW$T$70
    6832              
    6833              $C$DW$T$48      .dwtag  DW_TAG_typedef, DW_AT_name("TRAJ_Obj")
    6834                      .dwattr $C$DW$T$48, DW_AT_type(*$C$DW$T$70)
    6835                      .dwattr $C$DW$T$48, DW_AT_language(DW_LANG_C)
    6836              $C$DW$T$46      .dwtag  DW_TAG_pointer_type
    6837                      .dwattr $C$DW$T$46, DW_AT_type(*$C$DW$T$70)
    6838                      .dwattr $C$DW$T$46, DW_AT_address_class(0x16)
    6839              $C$DW$T$47      .dwtag  DW_TAG_typedef, DW_AT_name("TRAJ_Handle")
    6840                      .dwattr $C$DW$T$47, DW_AT_type(*$C$DW$T$46)
    6841                      .dwattr $C$DW$T$47, DW_AT_language(DW_LANG_C)
    6842              
    6843              $C$DW$T$76      .dwtag  DW_TAG_structure_type
    6844                      .dwattr $C$DW$T$76, DW_AT_name("_USER_Params_")
    6845                      .dwattr $C$DW$T$76, DW_AT_byte_size(0xac)
    6846              $C$DW$720       .dwtag  DW_TAG_member
    6847                      .dwattr $C$DW$720, DW_AT_type(*$C$DW$T$54)
    6848                      .dwattr $C$DW$720, DW_AT_name("iqFullScaleCurrent_A")
    6849                      .dwattr $C$DW$720, DW_AT_TI_symbol_name("_iqFullScaleCurrent_A")
    6850                      .dwattr $C$DW$720, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    6851                      .dwattr $C$DW$720, DW_AT_accessibility(DW_ACCESS_public)
    6852              $C$DW$721       .dwtag  DW_TAG_member
    6853                      .dwattr $C$DW$721, DW_AT_type(*$C$DW$T$54)
    6854                      .dwattr $C$DW$721, DW_AT_name("iqFullScaleVoltage_V")
    6855                      .dwattr $C$DW$721, DW_AT_TI_symbol_name("_iqFullScaleVoltage_V")
    6856                      .dwattr $C$DW$721, DW_AT_data_member_location[DW_OP_plus_uconst 0x2]
    6857                      .dwattr $C$DW$721, DW_AT_accessibility(DW_ACCESS_public)
    6858              $C$DW$722       .dwtag  DW_TAG_member
    6859                      .dwattr $C$DW$722, DW_AT_type(*$C$DW$T$54)
    6860                      .dwattr $C$DW$722, DW_AT_name("iqFullScaleFreq_Hz")
    6861                      .dwattr $C$DW$722, DW_AT_TI_symbol_name("_iqFullScaleFreq_Hz")
    6862                      .dwattr $C$DW$722, DW_AT_data_member_location[DW_OP_plus_uconst 0x4]
    6863                      .dwattr $C$DW$722, DW_AT_accessibility(DW_ACCESS_public)
    6864              $C$DW$723       .dwtag  DW_TAG_member
    6865                      .dwattr $C$DW$723, DW_AT_type(*$C$DW$T$53)
    6866                      .dwattr $C$DW$723, DW_AT_name("numIsrTicksPerCtrlTick")
    6867                      .dwattr $C$DW$723, DW_AT_TI_symbol_name("_numIsrTicksPerCtrlTick")
    6868                      .dwattr $C$DW$723, DW_AT_data_member_location[DW_OP_plus_uconst 0x6]
    6869                      .dwattr $C$DW$723, DW_AT_accessibility(DW_ACCESS_public)
    6870              $C$DW$724       .dwtag  DW_TAG_member
    6871                      .dwattr $C$DW$724, DW_AT_type(*$C$DW$T$53)
    6872                      .dwattr $C$DW$724, DW_AT_name("numCtrlTicksPerCurrentTick")
    6873                      .dwattr $C$DW$724, DW_AT_TI_symbol_name("_numCtrlTicksPerCurrentTick")
    6874                      .dwattr $C$DW$724, DW_AT_data_member_location[DW_OP_plus_uconst 0x7]
    6875                      .dwattr $C$DW$724, DW_AT_accessibility(DW_ACCESS_public)
    6876              $C$DW$725       .dwtag  DW_TAG_member
TMS320C2000 Assembler PC v6.2.5 Sat Sep 16 14:47:35 2017

Tools Copyright (c) 1996-2014 Texas Instruments Incorporated
C:\Users\wmj\AppData\Local\Temp\1316010                              PAGE  138

    6877                      .dwattr $C$DW$725, DW_AT_type(*$C$DW$T$53)
    6878                      .dwattr $C$DW$725, DW_AT_name("numCtrlTicksPerEstTick")
    6879                      .dwattr $C$DW$725, DW_AT_TI_symbol_name("_numCtrlTicksPerEstTick")
    6880                      .dwattr $C$DW$725, DW_AT_data_member_location[DW_OP_plus_uconst 0x8]
    6881                      .dwattr $C$DW$725, DW_AT_accessibility(DW_ACCESS_public)
    6882              $C$DW$726       .dwtag  DW_TAG_member
    6883                      .dwattr $C$DW$726, DW_AT_type(*$C$DW$T$53)
    6884                      .dwattr $C$DW$726, DW_AT_name("numCtrlTicksPerSpeedTick")
    6885                      .dwattr $C$DW$726, DW_AT_TI_symbol_name("_numCtrlTicksPerSpeedTick")
    6886                      .dwattr $C$DW$726, DW_AT_data_member_location[DW_OP_plus_uconst 0x9]
    6887                      .dwattr $C$DW$726, DW_AT_accessibility(DW_ACCESS_public)
    6888              $C$DW$727       .dwtag  DW_TAG_member
    6889                      .dwattr $C$DW$727, DW_AT_type(*$C$DW$T$53)
    6890                      .dwattr $C$DW$727, DW_AT_name("numCtrlTicksPerTrajTick")
    6891                      .dwattr $C$DW$727, DW_AT_TI_symbol_name("_numCtrlTicksPerTrajTick")
    6892                      .dwattr $C$DW$727, DW_AT_data_member_location[DW_OP_plus_uconst 0xa]
    6893                      .dwattr $C$DW$727, DW_AT_accessibility(DW_ACCESS_public)
    6894              $C$DW$728       .dwtag  DW_TAG_member
    6895                      .dwattr $C$DW$728, DW_AT_type(*$C$DW$T$22)
    6896                      .dwattr $C$DW$728, DW_AT_name("numCurrentSensors")
    6897                      .dwattr $C$DW$728, DW_AT_TI_symbol_name("_numCurrentSensors")
    6898                      .dwattr $C$DW$728, DW_AT_data_member_location[DW_OP_plus_uconst 0xb]
    6899                      .dwattr $C$DW$728, DW_AT_accessibility(DW_ACCESS_public)
    6900              $C$DW$729       .dwtag  DW_TAG_member
    6901                      .dwattr $C$DW$729, DW_AT_type(*$C$DW$T$22)
    6902                      .dwattr $C$DW$729, DW_AT_name("numVoltageSensors")
    6903                      .dwattr $C$DW$729, DW_AT_TI_symbol_name("_numVoltageSensors")
    6904                      .dwattr $C$DW$729, DW_AT_data_member_location[DW_OP_plus_uconst 0xc]
    6905                      .dwattr $C$DW$729, DW_AT_accessibility(DW_ACCESS_public)
    6906              $C$DW$730       .dwtag  DW_TAG_member
    6907                      .dwattr $C$DW$730, DW_AT_type(*$C$DW$T$54)
    6908                      .dwattr $C$DW$730, DW_AT_name("offsetPole_rps")
    6909                      .dwattr $C$DW$730, DW_AT_TI_symbol_name("_offsetPole_rps")
    6910                      .dwattr $C$DW$730, DW_AT_data_member_location[DW_OP_plus_uconst 0xe]
    6911                      .dwattr $C$DW$730, DW_AT_accessibility(DW_ACCESS_public)
    6912              $C$DW$731       .dwtag  DW_TAG_member
    6913                      .dwattr $C$DW$731, DW_AT_type(*$C$DW$T$54)
    6914                      .dwattr $C$DW$731, DW_AT_name("fluxPole_rps")
    6915                      .dwattr $C$DW$731, DW_AT_TI_symbol_name("_fluxPole_rps")
    6916                      .dwattr $C$DW$731, DW_AT_data_member_location[DW_OP_plus_uconst 0x10]
    6917                      .dwattr $C$DW$731, DW_AT_accessibility(DW_ACCESS_public)
    6918              $C$DW$732       .dwtag  DW_TAG_member
    6919                      .dwattr $C$DW$732, DW_AT_type(*$C$DW$T$54)
    6920                      .dwattr $C$DW$732, DW_AT_name("zeroSpeedLimit")
    6921                      .dwattr $C$DW$732, DW_AT_TI_symbol_name("_zeroSpeedLimit")
    6922                      .dwattr $C$DW$732, DW_AT_data_member_location[DW_OP_plus_uconst 0x12]
    6923                      .dwattr $C$DW$732, DW_AT_accessibility(DW_ACCESS_public)
    6924              $C$DW$733       .dwtag  DW_TAG_member
    6925                      .dwattr $C$DW$733, DW_AT_type(*$C$DW$T$54)
    6926                      .dwattr $C$DW$733, DW_AT_name("forceAngleFreq_Hz")
    6927                      .dwattr $C$DW$733, DW_AT_TI_symbol_name("_forceAngleFreq_Hz")
    6928                      .dwattr $C$DW$733, DW_AT_data_member_location[DW_OP_plus_uconst 0x14]
    6929                      .dwattr $C$DW$733, DW_AT_accessibility(DW_ACCESS_public)
    6930              $C$DW$734       .dwtag  DW_TAG_member
    6931                      .dwattr $C$DW$734, DW_AT_type(*$C$DW$T$54)
TMS320C2000 Assembler PC v6.2.5 Sat Sep 16 14:47:35 2017

Tools Copyright (c) 1996-2014 Texas Instruments Incorporated
C:\Users\wmj\AppData\Local\Temp\1316010                              PAGE  139

    6932                      .dwattr $C$DW$734, DW_AT_name("maxAccel_Hzps")
    6933                      .dwattr $C$DW$734, DW_AT_TI_symbol_name("_maxAccel_Hzps")
    6934                      .dwattr $C$DW$734, DW_AT_data_member_location[DW_OP_plus_uconst 0x16]
    6935                      .dwattr $C$DW$734, DW_AT_accessibility(DW_ACCESS_public)
    6936              $C$DW$735       .dwtag  DW_TAG_member
    6937                      .dwattr $C$DW$735, DW_AT_type(*$C$DW$T$54)
    6938                      .dwattr $C$DW$735, DW_AT_name("maxAccel_est_Hzps")
    6939                      .dwattr $C$DW$735, DW_AT_TI_symbol_name("_maxAccel_est_Hzps")
    6940                      .dwattr $C$DW$735, DW_AT_data_member_location[DW_OP_plus_uconst 0x18]
    6941                      .dwattr $C$DW$735, DW_AT_accessibility(DW_ACCESS_public)
    6942              $C$DW$736       .dwtag  DW_TAG_member
    6943                      .dwattr $C$DW$736, DW_AT_type(*$C$DW$T$54)
    6944                      .dwattr $C$DW$736, DW_AT_name("directionPole_rps")
    6945                      .dwattr $C$DW$736, DW_AT_TI_symbol_name("_directionPole_rps")
    6946                      .dwattr $C$DW$736, DW_AT_data_member_location[DW_OP_plus_uconst 0x1a]
    6947                      .dwattr $C$DW$736, DW_AT_accessibility(DW_ACCESS_public)
    6948              $C$DW$737       .dwtag  DW_TAG_member
    6949                      .dwattr $C$DW$737, DW_AT_type(*$C$DW$T$54)
    6950                      .dwattr $C$DW$737, DW_AT_name("speedPole_rps")
    6951                      .dwattr $C$DW$737, DW_AT_TI_symbol_name("_speedPole_rps")
    6952                      .dwattr $C$DW$737, DW_AT_data_member_location[DW_OP_plus_uconst 0x1c]
    6953                      .dwattr $C$DW$737, DW_AT_accessibility(DW_ACCESS_public)
    6954              $C$DW$738       .dwtag  DW_TAG_member
    6955                      .dwattr $C$DW$738, DW_AT_type(*$C$DW$T$54)
    6956                      .dwattr $C$DW$738, DW_AT_name("dcBusPole_rps")
    6957                      .dwattr $C$DW$738, DW_AT_TI_symbol_name("_dcBusPole_rps")
    6958                      .dwattr $C$DW$738, DW_AT_data_member_location[DW_OP_plus_uconst 0x1e]
    6959                      .dwattr $C$DW$738, DW_AT_accessibility(DW_ACCESS_public)
    6960              $C$DW$739       .dwtag  DW_TAG_member
    6961                      .dwattr $C$DW$739, DW_AT_type(*$C$DW$T$54)
    6962                      .dwattr $C$DW$739, DW_AT_name("fluxFraction")
    6963                      .dwattr $C$DW$739, DW_AT_TI_symbol_name("_fluxFraction")
    6964                      .dwattr $C$DW$739, DW_AT_data_member_location[DW_OP_plus_uconst 0x20]
    6965                      .dwattr $C$DW$739, DW_AT_accessibility(DW_ACCESS_public)
    6966              $C$DW$740       .dwtag  DW_TAG_member
    6967                      .dwattr $C$DW$740, DW_AT_type(*$C$DW$T$54)
    6968                      .dwattr $C$DW$740, DW_AT_name("indEst_speedMaxFraction")
    6969                      .dwattr $C$DW$740, DW_AT_TI_symbol_name("_indEst_speedMaxFraction")
    6970                      .dwattr $C$DW$740, DW_AT_data_member_location[DW_OP_plus_uconst 0x22]
    6971                      .dwattr $C$DW$740, DW_AT_accessibility(DW_ACCESS_public)
    6972              $C$DW$741       .dwtag  DW_TAG_member
    6973                      .dwattr $C$DW$741, DW_AT_type(*$C$DW$T$54)
    6974                      .dwattr $C$DW$741, DW_AT_name("powerWarpGain")
    6975                      .dwattr $C$DW$741, DW_AT_TI_symbol_name("_powerWarpGain")
    6976                      .dwattr $C$DW$741, DW_AT_data_member_location[DW_OP_plus_uconst 0x24]
    6977                      .dwattr $C$DW$741, DW_AT_accessibility(DW_ACCESS_public)
    6978              $C$DW$742       .dwtag  DW_TAG_member
    6979                      .dwattr $C$DW$742, DW_AT_type(*$C$DW$T$53)
    6980                      .dwattr $C$DW$742, DW_AT_name("systemFreq_MHz")
    6981                      .dwattr $C$DW$742, DW_AT_TI_symbol_name("_systemFreq_MHz")
    6982                      .dwattr $C$DW$742, DW_AT_data_member_location[DW_OP_plus_uconst 0x26]
    6983                      .dwattr $C$DW$742, DW_AT_accessibility(DW_ACCESS_public)
    6984              $C$DW$743       .dwtag  DW_TAG_member
    6985                      .dwattr $C$DW$743, DW_AT_type(*$C$DW$T$54)
    6986                      .dwattr $C$DW$743, DW_AT_name("pwmPeriod_usec")
TMS320C2000 Assembler PC v6.2.5 Sat Sep 16 14:47:35 2017

Tools Copyright (c) 1996-2014 Texas Instruments Incorporated
C:\Users\wmj\AppData\Local\Temp\1316010                              PAGE  140

    6987                      .dwattr $C$DW$743, DW_AT_TI_symbol_name("_pwmPeriod_usec")
    6988                      .dwattr $C$DW$743, DW_AT_data_member_location[DW_OP_plus_uconst 0x28]
    6989                      .dwattr $C$DW$743, DW_AT_accessibility(DW_ACCESS_public)
    6990              $C$DW$744       .dwtag  DW_TAG_member
    6991                      .dwattr $C$DW$744, DW_AT_type(*$C$DW$T$54)
    6992                      .dwattr $C$DW$744, DW_AT_name("voltage_sf")
    6993                      .dwattr $C$DW$744, DW_AT_TI_symbol_name("_voltage_sf")
    6994                      .dwattr $C$DW$744, DW_AT_data_member_location[DW_OP_plus_uconst 0x2a]
    6995                      .dwattr $C$DW$744, DW_AT_accessibility(DW_ACCESS_public)
    6996              $C$DW$745       .dwtag  DW_TAG_member
    6997                      .dwattr $C$DW$745, DW_AT_type(*$C$DW$T$54)
    6998                      .dwattr $C$DW$745, DW_AT_name("current_sf")
    6999                      .dwattr $C$DW$745, DW_AT_TI_symbol_name("_current_sf")
    7000                      .dwattr $C$DW$745, DW_AT_data_member_location[DW_OP_plus_uconst 0x2c]
    7001                      .dwattr $C$DW$745, DW_AT_accessibility(DW_ACCESS_public)
    7002              $C$DW$746       .dwtag  DW_TAG_member
    7003                      .dwattr $C$DW$746, DW_AT_type(*$C$DW$T$54)
    7004                      .dwattr $C$DW$746, DW_AT_name("voltageFilterPole_rps")
    7005                      .dwattr $C$DW$746, DW_AT_TI_symbol_name("_voltageFilterPole_rps")
    7006                      .dwattr $C$DW$746, DW_AT_data_member_location[DW_OP_plus_uconst 0x2e]
    7007                      .dwattr $C$DW$746, DW_AT_accessibility(DW_ACCESS_public)
    7008              $C$DW$747       .dwtag  DW_TAG_member
    7009                      .dwattr $C$DW$747, DW_AT_type(*$C$DW$T$54)
    7010                      .dwattr $C$DW$747, DW_AT_name("maxVsMag_pu")
    7011                      .dwattr $C$DW$747, DW_AT_TI_symbol_name("_maxVsMag_pu")
    7012                      .dwattr $C$DW$747, DW_AT_data_member_location[DW_OP_plus_uconst 0x30]
    7013                      .dwattr $C$DW$747, DW_AT_accessibility(DW_ACCESS_public)
    7014              $C$DW$748       .dwtag  DW_TAG_member
    7015                      .dwattr $C$DW$748, DW_AT_type(*$C$DW$T$54)
    7016                      .dwattr $C$DW$748, DW_AT_name("estKappa")
    7017                      .dwattr $C$DW$748, DW_AT_TI_symbol_name("_estKappa")
    7018                      .dwattr $C$DW$748, DW_AT_data_member_location[DW_OP_plus_uconst 0x32]
    7019                      .dwattr $C$DW$748, DW_AT_accessibility(DW_ACCESS_public)
    7020              $C$DW$749       .dwtag  DW_TAG_member
    7021                      .dwattr $C$DW$749, DW_AT_type(*$C$DW$T$65)
    7022                      .dwattr $C$DW$749, DW_AT_name("motor_type")
    7023                      .dwattr $C$DW$749, DW_AT_TI_symbol_name("_motor_type")
    7024                      .dwattr $C$DW$749, DW_AT_data_member_location[DW_OP_plus_uconst 0x34]
    7025                      .dwattr $C$DW$749, DW_AT_accessibility(DW_ACCESS_public)
    7026              $C$DW$750       .dwtag  DW_TAG_member
    7027                      .dwattr $C$DW$750, DW_AT_type(*$C$DW$T$53)
    7028                      .dwattr $C$DW$750, DW_AT_name("motor_numPolePairs")
    7029                      .dwattr $C$DW$750, DW_AT_TI_symbol_name("_motor_numPolePairs")
    7030                      .dwattr $C$DW$750, DW_AT_data_member_location[DW_OP_plus_uconst 0x35]
    7031                      .dwattr $C$DW$750, DW_AT_accessibility(DW_ACCESS_public)
    7032              $C$DW$751       .dwtag  DW_TAG_member
    7033                      .dwattr $C$DW$751, DW_AT_type(*$C$DW$T$54)
    7034                      .dwattr $C$DW$751, DW_AT_name("motor_ratedFlux")
    7035                      .dwattr $C$DW$751, DW_AT_TI_symbol_name("_motor_ratedFlux")
    7036                      .dwattr $C$DW$751, DW_AT_data_member_location[DW_OP_plus_uconst 0x36]
    7037                      .dwattr $C$DW$751, DW_AT_accessibility(DW_ACCESS_public)
    7038              $C$DW$752       .dwtag  DW_TAG_member
    7039                      .dwattr $C$DW$752, DW_AT_type(*$C$DW$T$54)
    7040                      .dwattr $C$DW$752, DW_AT_name("motor_Rr")
    7041                      .dwattr $C$DW$752, DW_AT_TI_symbol_name("_motor_Rr")
TMS320C2000 Assembler PC v6.2.5 Sat Sep 16 14:47:35 2017

Tools Copyright (c) 1996-2014 Texas Instruments Incorporated
C:\Users\wmj\AppData\Local\Temp\1316010                              PAGE  141

    7042                      .dwattr $C$DW$752, DW_AT_data_member_location[DW_OP_plus_uconst 0x38]
    7043                      .dwattr $C$DW$752, DW_AT_accessibility(DW_ACCESS_public)
    7044              $C$DW$753       .dwtag  DW_TAG_member
    7045                      .dwattr $C$DW$753, DW_AT_type(*$C$DW$T$54)
    7046                      .dwattr $C$DW$753, DW_AT_name("motor_Rs")
    7047                      .dwattr $C$DW$753, DW_AT_TI_symbol_name("_motor_Rs")
    7048                      .dwattr $C$DW$753, DW_AT_data_member_location[DW_OP_plus_uconst 0x3a]
    7049                      .dwattr $C$DW$753, DW_AT_accessibility(DW_ACCESS_public)
    7050              $C$DW$754       .dwtag  DW_TAG_member
    7051                      .dwattr $C$DW$754, DW_AT_type(*$C$DW$T$54)
    7052                      .dwattr $C$DW$754, DW_AT_name("motor_Ls_d")
    7053                      .dwattr $C$DW$754, DW_AT_TI_symbol_name("_motor_Ls_d")
    7054                      .dwattr $C$DW$754, DW_AT_data_member_location[DW_OP_plus_uconst 0x3c]
    7055                      .dwattr $C$DW$754, DW_AT_accessibility(DW_ACCESS_public)
    7056              $C$DW$755       .dwtag  DW_TAG_member
    7057                      .dwattr $C$DW$755, DW_AT_type(*$C$DW$T$54)
    7058                      .dwattr $C$DW$755, DW_AT_name("motor_Ls_q")
    7059                      .dwattr $C$DW$755, DW_AT_TI_symbol_name("_motor_Ls_q")
    7060                      .dwattr $C$DW$755, DW_AT_data_member_location[DW_OP_plus_uconst 0x3e]
    7061                      .dwattr $C$DW$755, DW_AT_accessibility(DW_ACCESS_public)
    7062              $C$DW$756       .dwtag  DW_TAG_member
    7063                      .dwattr $C$DW$756, DW_AT_type(*$C$DW$T$54)
    7064                      .dwattr $C$DW$756, DW_AT_name("maxCurrent")
    7065                      .dwattr $C$DW$756, DW_AT_TI_symbol_name("_maxCurrent")
    7066                      .dwattr $C$DW$756, DW_AT_data_member_location[DW_OP_plus_uconst 0x40]
    7067                      .dwattr $C$DW$756, DW_AT_accessibility(DW_ACCESS_public)
    7068              $C$DW$757       .dwtag  DW_TAG_member
    7069                      .dwattr $C$DW$757, DW_AT_type(*$C$DW$T$54)
    7070                      .dwattr $C$DW$757, DW_AT_name("maxCurrent_resEst")
    7071                      .dwattr $C$DW$757, DW_AT_TI_symbol_name("_maxCurrent_resEst")
    7072                      .dwattr $C$DW$757, DW_AT_data_member_location[DW_OP_plus_uconst 0x42]
    7073                      .dwattr $C$DW$757, DW_AT_accessibility(DW_ACCESS_public)
    7074              $C$DW$758       .dwtag  DW_TAG_member
    7075                      .dwattr $C$DW$758, DW_AT_type(*$C$DW$T$54)
    7076                      .dwattr $C$DW$758, DW_AT_name("maxCurrent_indEst")
    7077                      .dwattr $C$DW$758, DW_AT_TI_symbol_name("_maxCurrent_indEst")
    7078                      .dwattr $C$DW$758, DW_AT_data_member_location[DW_OP_plus_uconst 0x44]
    7079                      .dwattr $C$DW$758, DW_AT_accessibility(DW_ACCESS_public)
    7080              $C$DW$759       .dwtag  DW_TAG_member
    7081                      .dwattr $C$DW$759, DW_AT_type(*$C$DW$T$54)
    7082                      .dwattr $C$DW$759, DW_AT_name("maxCurrentSlope")
    7083                      .dwattr $C$DW$759, DW_AT_TI_symbol_name("_maxCurrentSlope")
    7084                      .dwattr $C$DW$759, DW_AT_data_member_location[DW_OP_plus_uconst 0x46]
    7085                      .dwattr $C$DW$759, DW_AT_accessibility(DW_ACCESS_public)
    7086              $C$DW$760       .dwtag  DW_TAG_member
    7087                      .dwattr $C$DW$760, DW_AT_type(*$C$DW$T$54)
    7088                      .dwattr $C$DW$760, DW_AT_name("maxCurrentSlope_powerWarp")
    7089                      .dwattr $C$DW$760, DW_AT_TI_symbol_name("_maxCurrentSlope_powerWarp")
    7090                      .dwattr $C$DW$760, DW_AT_data_member_location[DW_OP_plus_uconst 0x48]
    7091                      .dwattr $C$DW$760, DW_AT_accessibility(DW_ACCESS_public)
    7092              $C$DW$761       .dwtag  DW_TAG_member
    7093                      .dwattr $C$DW$761, DW_AT_type(*$C$DW$T$54)
    7094                      .dwattr $C$DW$761, DW_AT_name("IdRated")
    7095                      .dwattr $C$DW$761, DW_AT_TI_symbol_name("_IdRated")
    7096                      .dwattr $C$DW$761, DW_AT_data_member_location[DW_OP_plus_uconst 0x4a]
TMS320C2000 Assembler PC v6.2.5 Sat Sep 16 14:47:35 2017

Tools Copyright (c) 1996-2014 Texas Instruments Incorporated
C:\Users\wmj\AppData\Local\Temp\1316010                              PAGE  142

    7097                      .dwattr $C$DW$761, DW_AT_accessibility(DW_ACCESS_public)
    7098              $C$DW$762       .dwtag  DW_TAG_member
    7099                      .dwattr $C$DW$762, DW_AT_type(*$C$DW$T$54)
    7100                      .dwattr $C$DW$762, DW_AT_name("IdRatedFraction_indEst")
    7101                      .dwattr $C$DW$762, DW_AT_TI_symbol_name("_IdRatedFraction_indEst")
    7102                      .dwattr $C$DW$762, DW_AT_data_member_location[DW_OP_plus_uconst 0x4c]
    7103                      .dwattr $C$DW$762, DW_AT_accessibility(DW_ACCESS_public)
    7104              $C$DW$763       .dwtag  DW_TAG_member
    7105                      .dwattr $C$DW$763, DW_AT_type(*$C$DW$T$54)
    7106                      .dwattr $C$DW$763, DW_AT_name("IdRatedFraction_ratedFlux")
    7107                      .dwattr $C$DW$763, DW_AT_TI_symbol_name("_IdRatedFraction_ratedFlux")
    7108                      .dwattr $C$DW$763, DW_AT_data_member_location[DW_OP_plus_uconst 0x4e]
    7109                      .dwattr $C$DW$763, DW_AT_accessibility(DW_ACCESS_public)
    7110              $C$DW$764       .dwtag  DW_TAG_member
    7111                      .dwattr $C$DW$764, DW_AT_type(*$C$DW$T$54)
    7112                      .dwattr $C$DW$764, DW_AT_name("IdRated_delta")
    7113                      .dwattr $C$DW$764, DW_AT_TI_symbol_name("_IdRated_delta")
    7114                      .dwattr $C$DW$764, DW_AT_data_member_location[DW_OP_plus_uconst 0x50]
    7115                      .dwattr $C$DW$764, DW_AT_accessibility(DW_ACCESS_public)
    7116              $C$DW$765       .dwtag  DW_TAG_member
    7117                      .dwattr $C$DW$765, DW_AT_type(*$C$DW$T$54)
    7118                      .dwattr $C$DW$765, DW_AT_name("fluxEstFreq_Hz")
    7119                      .dwattr $C$DW$765, DW_AT_TI_symbol_name("_fluxEstFreq_Hz")
    7120                      .dwattr $C$DW$765, DW_AT_data_member_location[DW_OP_plus_uconst 0x52]
