TMS320C2000 Assembler PC v15.12.3 Mon Sep 25 12:51:19 2017

Tools Copyright (c) 1996-2015 Texas Instruments Incorporated
C:\Users\wmj\AppData\Local\Temp\0412810                              PAGE    1

       1              ;***************************************************************
       2              ;* TMS320C2000 C/C++ Codegen                   PC v15.12.3.LTS *
       3              ;* Date/Time created: Mon Sep 25 12:51:17 2017                 *
       4              ;***************************************************************
       5                      .compiler_opts --abi=coffabi --float_support=softlib --hll_source=on --mem_model:code=flat --mem_mode
       6        0002  FP      .set    XAR2
       7              
       8              $C$DW$CU        .dwtag  DW_TAG_compile_unit
       9                      .dwattr $C$DW$CU, DW_AT_name("D:/BM1000/sw/modules/ctrl/src/32b/ctrl.c")
      10                      .dwattr $C$DW$CU, DW_AT_producer("TI TMS320C2000 C/C++ Codegen PC v15.12.3.LTS Copyright (c) 1996-201
      11                      .dwattr $C$DW$CU, DW_AT_TI_version(0x01)
      12                      .dwattr $C$DW$CU, DW_AT_comp_dir("D:\BM1000\sw\solutions\instaspin_foc\boards\hvkit_rev1p1\f28x\f2802
      13              
      14              ;**************************************************************
      15              ;* FUNCTION SYNONYMS                                          *

    7908                      .dwattr $C$DW$644, DW_AT_name("EST_State_RatedFlux_OL")
    7909                      .dwattr $C$DW$644, DW_AT_const_value(0x06)
    7910              
    7911              $C$DW$645       .dwtag  DW_TAG_enumerator
    7912                      .dwattr $C$DW$645, DW_AT_name("EST_State_RatedFlux")
    7913                      .dwattr $C$DW$645, DW_AT_const_value(0x07)
    7914              
    7915              $C$DW$646       .dwtag  DW_TAG_enumerator
    7916                      .dwattr $C$DW$646, DW_AT_name("EST_State_RampDown")
    7917                      .dwattr $C$DW$646, DW_AT_const_value(0x08)
    7918              
    7919              $C$DW$647       .dwtag  DW_TAG_enumerator
    7920                      .dwattr $C$DW$647, DW_AT_name("EST_State_LockRotor")
    7921                      .dwattr $C$DW$647, DW_AT_const_value(0x09)
    7922              
    7923              $C$DW$648       .dwtag  DW_TAG_enumerator
    7924                      .dwattr $C$DW$648, DW_AT_name("EST_State_Ls")
    7925                      .dwattr $C$DW$648, DW_AT_const_value(0x0a)
    7926              
    7927              $C$DW$649       .dwtag  DW_TAG_enumerator
    7928                      .dwattr $C$DW$649, DW_AT_name("EST_State_Rr")
    7929                      .dwattr $C$DW$649, DW_AT_const_value(0x0b)
    7930              
    7931              $C$DW$650       .dwtag  DW_TAG_enumerator
    7932                      .dwattr $C$DW$650, DW_AT_name("EST_State_MotorIdentified")
    7933                      .dwattr $C$DW$650, DW_AT_const_value(0x0c)
    7934              
    7935              $C$DW$651       .dwtag  DW_TAG_enumerator
    7936                      .dwattr $C$DW$651, DW_AT_name("EST_State_OnLine")
    7937                      .dwattr $C$DW$651, DW_AT_const_value(0x0d)
    7938              
    7939              $C$DW$652       .dwtag  DW_TAG_enumerator
    7940                      .dwattr $C$DW$652, DW_AT_name("EST_numStates")
    7941                      .dwattr $C$DW$652, DW_AT_const_value(0x0e)
TMS320C2000 Assembler PC v15.12.3 Mon Sep 25 12:51:19 2017

Tools Copyright (c) 1996-2015 Texas Instruments Incorporated
C:\Users\wmj\AppData\Local\Temp\0412810                              PAGE  152

    7942              
    7943                      .dwendtag $C$DW$T$177
    7944              
    7945              $C$DW$T$178     .dwtag  DW_TAG_typedef
    7946                      .dwattr $C$DW$T$178, DW_AT_name("EST_State_e")
    7947                      .dwattr $C$DW$T$178, DW_AT_type(*$C$DW$T$177)
    7948                      .dwattr $C$DW$T$178, DW_AT_language(DW_LANG_C)
    7949              
    7950              
    7951              $C$DW$T$182     .dwtag  DW_TAG_enumeration_type
    7952                      .dwattr $C$DW$T$182, DW_AT_byte_size(0x01)
    7953              $C$DW$653       .dwtag  DW_TAG_enumerator
    7954                      .dwattr $C$DW$653, DW_AT_name("CTRL_Type_PID_spd")
    7955                      .dwattr $C$DW$653, DW_AT_const_value(0x00)
    7956              
    7957              $C$DW$654       .dwtag  DW_TAG_enumerator
    7958                      .dwattr $C$DW$654, DW_AT_name("CTRL_Type_PID_Id")
    7959                      .dwattr $C$DW$654, DW_AT_const_value(0x01)
    7960              
    7961              $C$DW$655       .dwtag  DW_TAG_enumerator
    7962                      .dwattr $C$DW$655, DW_AT_name("CTRL_Type_PID_Iq")
    7963                      .dwattr $C$DW$655, DW_AT_const_value(0x02)
    7964              
    7965                      .dwendtag $C$DW$T$182
    7966              
    7967              $C$DW$T$183     .dwtag  DW_TAG_typedef
    7968                      .dwattr $C$DW$T$183, DW_AT_name("CTRL_Type_e")
    7969                      .dwattr $C$DW$T$183, DW_AT_type(*$C$DW$T$182)
    7970                      .dwattr $C$DW$T$183, DW_AT_language(DW_LANG_C)
    7971              
    7972              $C$DW$656       .dwtag  DW_TAG_TI_far_type
    7973                      .dwattr $C$DW$656, DW_AT_type(*$C$DW$T$183)
    7974              
    7975              $C$DW$T$184     .dwtag  DW_TAG_const_type
    7976                      .dwattr $C$DW$T$184, DW_AT_type(*$C$DW$656)
    7977              
    7978              
    7979              $C$DW$T$19      .dwtag  DW_TAG_structure_type
    7980                      .dwattr $C$DW$T$19, DW_AT_name("I2C_Obj")
    7981                      .dwattr $C$DW$T$19, DW_AT_declaration
    7982                      .dwendtag $C$DW$T$19
    7983              
    7984              $C$DW$T$116     .dwtag  DW_TAG_pointer_type
    7985                      .dwattr $C$DW$T$116, DW_AT_type(*$C$DW$T$19)
    7986                      .dwattr $C$DW$T$116, DW_AT_address_class(0x20)
    7987              
    7988              $C$DW$T$117     .dwtag  DW_TAG_typedef
    7989                      .dwattr $C$DW$T$117, DW_AT_name("I2C_Handle")
    7990                      .dwattr $C$DW$T$117, DW_AT_type(*$C$DW$T$116)
    7991                      .dwattr $C$DW$T$117, DW_AT_language(DW_LANG_C)
    7992              
    7993              
    7994              $C$DW$T$31      .dwtag  DW_TAG_structure_type
    7995                      .dwattr $C$DW$T$31, DW_AT_name("_ADC_Obj_")
    7996                      .dwattr $C$DW$T$31, DW_AT_byte_size(0x6650)
TMS320C2000 Assembler PC v15.12.3 Mon Sep 25 12:51:19 2017

Tools Copyright (c) 1996-2015 Texas Instruments Incorporated
C:\Users\wmj\AppData\Local\Temp\0412810                              PAGE  153

    7997              $C$DW$657       .dwtag  DW_TAG_member
    7998                      .dwattr $C$DW$657, DW_AT_type(*$C$DW$T$25)
    7999                      .dwattr $C$DW$657, DW_AT_name("ADCRESULT")
    8000                      .dwattr $C$DW$657, DW_AT_TI_symbol_name("_ADCRESULT")
    8001                      .dwattr $C$DW$657, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    8002                      .dwattr $C$DW$657, DW_AT_accessibility(DW_ACCESS_public)
    8003              
    8004              $C$DW$658       .dwtag  DW_TAG_member
    8005                      .dwattr $C$DW$658, DW_AT_type(*$C$DW$T$26)
    8006                      .dwattr $C$DW$658, DW_AT_name("resvd_1")
    8007                      .dwattr $C$DW$658, DW_AT_TI_symbol_name("_resvd_1")
    8008                      .dwattr $C$DW$658, DW_AT_data_member_location[DW_OP_plus_uconst 0x10]
    8009                      .dwattr $C$DW$658, DW_AT_accessibility(DW_ACCESS_public)
    8010              
    8011              $C$DW$659       .dwtag  DW_TAG_member
    8012                      .dwattr $C$DW$659, DW_AT_type(*$C$DW$T$24)
    8013                      .dwattr $C$DW$659, DW_AT_name("ADCCTL1")
    8014                      .dwattr $C$DW$659, DW_AT_TI_symbol_name("_ADCCTL1")
    8015                      .dwattr $C$DW$659, DW_AT_data_member_location[DW_OP_plus_uconst 0x6600]
    8016                      .dwattr $C$DW$659, DW_AT_accessibility(DW_ACCESS_public)
    8017              
    8018              $C$DW$660       .dwtag  DW_TAG_member
    8019                      .dwattr $C$DW$660, DW_AT_type(*$C$DW$T$24)
    8020                      .dwattr $C$DW$660, DW_AT_name("ADCCTL2")
    8021                      .dwattr $C$DW$660, DW_AT_TI_symbol_name("_ADCCTL2")
    8022                      .dwattr $C$DW$660, DW_AT_data_member_location[DW_OP_plus_uconst 0x6601]
    8023                      .dwattr $C$DW$660, DW_AT_accessibility(DW_ACCESS_public)
    8024              
    8025              $C$DW$661       .dwtag  DW_TAG_member
    8026                      .dwattr $C$DW$661, DW_AT_type(*$C$DW$T$27)
    8027                      .dwattr $C$DW$661, DW_AT_name("rsvd_2")
    8028                      .dwattr $C$DW$661, DW_AT_TI_symbol_name("_rsvd_2")
    8029                      .dwattr $C$DW$661, DW_AT_data_member_location[DW_OP_plus_uconst 0x6602]
    8030                      .dwattr $C$DW$661, DW_AT_accessibility(DW_ACCESS_public)
    8031              
    8032              $C$DW$662       .dwtag  DW_TAG_member
    8033                      .dwattr $C$DW$662, DW_AT_type(*$C$DW$T$24)
    8034                      .dwattr $C$DW$662, DW_AT_name("ADCINTFLG")
    8035                      .dwattr $C$DW$662, DW_AT_TI_symbol_name("_ADCINTFLG")
    8036                      .dwattr $C$DW$662, DW_AT_data_member_location[DW_OP_plus_uconst 0x6604]
    8037                      .dwattr $C$DW$662, DW_AT_accessibility(DW_ACCESS_public)
    8038              
    8039              $C$DW$663       .dwtag  DW_TAG_member
    8040                      .dwattr $C$DW$663, DW_AT_type(*$C$DW$T$24)
    8041                      .dwattr $C$DW$663, DW_AT_name("ADCINTFLGCLR")
    8042                      .dwattr $C$DW$663, DW_AT_TI_symbol_name("_ADCINTFLGCLR")
    8043                      .dwattr $C$DW$663, DW_AT_data_member_location[DW_OP_plus_uconst 0x6605]
    8044                      .dwattr $C$DW$663, DW_AT_accessibility(DW_ACCESS_public)
    8045              
    8046              $C$DW$664       .dwtag  DW_TAG_member
    8047                      .dwattr $C$DW$664, DW_AT_type(*$C$DW$T$24)
    8048                      .dwattr $C$DW$664, DW_AT_name("ADCINTOVF")
    8049                      .dwattr $C$DW$664, DW_AT_TI_symbol_name("_ADCINTOVF")
    8050                      .dwattr $C$DW$664, DW_AT_data_member_location[DW_OP_plus_uconst 0x6606]
    8051                      .dwattr $C$DW$664, DW_AT_accessibility(DW_ACCESS_public)
TMS320C2000 Assembler PC v15.12.3 Mon Sep 25 12:51:19 2017

Tools Copyright (c) 1996-2015 Texas Instruments Incorporated
C:\Users\wmj\AppData\Local\Temp\0412810                              PAGE  154

    8052              
    8053              $C$DW$665       .dwtag  DW_TAG_member
    8054                      .dwattr $C$DW$665, DW_AT_type(*$C$DW$T$24)
    8055                      .dwattr $C$DW$665, DW_AT_name("ADCINTOVFCLR")
    8056                      .dwattr $C$DW$665, DW_AT_TI_symbol_name("_ADCINTOVFCLR")
    8057                      .dwattr $C$DW$665, DW_AT_data_member_location[DW_OP_plus_uconst 0x6607]
    8058                      .dwattr $C$DW$665, DW_AT_accessibility(DW_ACCESS_public)
    8059              
    8060              $C$DW$666       .dwtag  DW_TAG_member
    8061                      .dwattr $C$DW$666, DW_AT_type(*$C$DW$T$28)
    8062                      .dwattr $C$DW$666, DW_AT_name("INTSELxNy")
    8063                      .dwattr $C$DW$666, DW_AT_TI_symbol_name("_INTSELxNy")
    8064                      .dwattr $C$DW$666, DW_AT_data_member_location[DW_OP_plus_uconst 0x6608]
    8065                      .dwattr $C$DW$666, DW_AT_accessibility(DW_ACCESS_public)
    8066              
    8067              $C$DW$667       .dwtag  DW_TAG_member
    8068                      .dwattr $C$DW$667, DW_AT_type(*$C$DW$T$29)
    8069                      .dwattr $C$DW$667, DW_AT_name("rsvd_3")
    8070                      .dwattr $C$DW$667, DW_AT_TI_symbol_name("_rsvd_3")
    8071                      .dwattr $C$DW$667, DW_AT_data_member_location[DW_OP_plus_uconst 0x660d]
    8072                      .dwattr $C$DW$667, DW_AT_accessibility(DW_ACCESS_public)
    8073              
    8074              $C$DW$668       .dwtag  DW_TAG_member
    8075                      .dwattr $C$DW$668, DW_AT_type(*$C$DW$T$24)
    8076                      .dwattr $C$DW$668, DW_AT_name("SOCPRICTRL")
    8077                      .dwattr $C$DW$668, DW_AT_TI_symbol_name("_SOCPRICTRL")
    8078                      .dwattr $C$DW$668, DW_AT_data_member_location[DW_OP_plus_uconst 0x6610]
    8079                      .dwattr $C$DW$668, DW_AT_accessibility(DW_ACCESS_public)
    8080              
    8081              $C$DW$669       .dwtag  DW_TAG_member
    8082                      .dwattr $C$DW$669, DW_AT_type(*$C$DW$T$24)
    8083                      .dwattr $C$DW$669, DW_AT_name("rsvd_4")
    8084                      .dwattr $C$DW$669, DW_AT_TI_symbol_name("_rsvd_4")
    8085                      .dwattr $C$DW$669, DW_AT_data_member_location[DW_OP_plus_uconst 0x6611]
    8086                      .dwattr $C$DW$669, DW_AT_accessibility(DW_ACCESS_public)
    8087              
    8088              $C$DW$670       .dwtag  DW_TAG_member
    8089                      .dwattr $C$DW$670, DW_AT_type(*$C$DW$T$24)
    8090                      .dwattr $C$DW$670, DW_AT_name("ADCSAMPLEMODE")
    8091                      .dwattr $C$DW$670, DW_AT_TI_symbol_name("_ADCSAMPLEMODE")
    8092                      .dwattr $C$DW$670, DW_AT_data_member_location[DW_OP_plus_uconst 0x6612]
    8093                      .dwattr $C$DW$670, DW_AT_accessibility(DW_ACCESS_public)
    8094              
    8095              $C$DW$671       .dwtag  DW_TAG_member
    8096                      .dwattr $C$DW$671, DW_AT_type(*$C$DW$T$24)
    8097                      .dwattr $C$DW$671, DW_AT_name("rsvd_5")
    8098                      .dwattr $C$DW$671, DW_AT_TI_symbol_name("_rsvd_5")
    8099                      .dwattr $C$DW$671, DW_AT_data_member_location[DW_OP_plus_uconst 0x6613]
    8100                      .dwattr $C$DW$671, DW_AT_accessibility(DW_ACCESS_public)
    8101              
    8102              $C$DW$672       .dwtag  DW_TAG_member
    8103                      .dwattr $C$DW$672, DW_AT_type(*$C$DW$T$24)
    8104                      .dwattr $C$DW$672, DW_AT_name("ADCINTSOCSEL1")
    8105                      .dwattr $C$DW$672, DW_AT_TI_symbol_name("_ADCINTSOCSEL1")
    8106                      .dwattr $C$DW$672, DW_AT_data_member_location[DW_OP_plus_uconst 0x6614]
TMS320C2000 Assembler PC v15.12.3 Mon Sep 25 12:51:19 2017

Tools Copyright (c) 1996-2015 Texas Instruments Incorporated
C:\Users\wmj\AppData\Local\Temp\0412810                              PAGE  155

    8107                      .dwattr $C$DW$672, DW_AT_accessibility(DW_ACCESS_public)
    8108              
    8109              $C$DW$673       .dwtag  DW_TAG_member
    8110                      .dwattr $C$DW$673, DW_AT_type(*$C$DW$T$24)
    8111                      .dwattr $C$DW$673, DW_AT_name("ADCINTSOCSEL2")
    8112                      .dwattr $C$DW$673, DW_AT_TI_symbol_name("_ADCINTSOCSEL2")
    8113                      .dwattr $C$DW$673, DW_AT_data_member_location[DW_OP_plus_uconst 0x6615]
    8114                      .dwattr $C$DW$673, DW_AT_accessibility(DW_ACCESS_public)
    8115              
    8116              $C$DW$674       .dwtag  DW_TAG_member
    8117                      .dwattr $C$DW$674, DW_AT_type(*$C$DW$T$27)
    8118                      .dwattr $C$DW$674, DW_AT_name("rsvd_6")
    8119                      .dwattr $C$DW$674, DW_AT_TI_symbol_name("_rsvd_6")
    8120                      .dwattr $C$DW$674, DW_AT_data_member_location[DW_OP_plus_uconst 0x6616]
    8121                      .dwattr $C$DW$674, DW_AT_accessibility(DW_ACCESS_public)
    8122              
    8123              $C$DW$675       .dwtag  DW_TAG_member
    8124                      .dwattr $C$DW$675, DW_AT_type(*$C$DW$T$24)
    8125                      .dwattr $C$DW$675, DW_AT_name("ADCSOCFLG1")
    8126                      .dwattr $C$DW$675, DW_AT_TI_symbol_name("_ADCSOCFLG1")
    8127                      .dwattr $C$DW$675, DW_AT_data_member_location[DW_OP_plus_uconst 0x6618]
    8128                      .dwattr $C$DW$675, DW_AT_accessibility(DW_ACCESS_public)
    8129              
    8130              $C$DW$676       .dwtag  DW_TAG_member
    8131                      .dwattr $C$DW$676, DW_AT_type(*$C$DW$T$24)
    8132                      .dwattr $C$DW$676, DW_AT_name("rsvd_7")
    8133                      .dwattr $C$DW$676, DW_AT_TI_symbol_name("_rsvd_7")
    8134                      .dwattr $C$DW$676, DW_AT_data_member_location[DW_OP_plus_uconst 0x6619]
    8135                      .dwattr $C$DW$676, DW_AT_accessibility(DW_ACCESS_public)
    8136              
    8137              $C$DW$677       .dwtag  DW_TAG_member
    8138                      .dwattr $C$DW$677, DW_AT_type(*$C$DW$T$24)
    8139                      .dwattr $C$DW$677, DW_AT_name("ADCSOCFRC1")
    8140                      .dwattr $C$DW$677, DW_AT_TI_symbol_name("_ADCSOCFRC1")
    8141                      .dwattr $C$DW$677, DW_AT_data_member_location[DW_OP_plus_uconst 0x661a]
    8142                      .dwattr $C$DW$677, DW_AT_accessibility(DW_ACCESS_public)
    8143              
    8144              $C$DW$678       .dwtag  DW_TAG_member
    8145                      .dwattr $C$DW$678, DW_AT_type(*$C$DW$T$24)
    8146                      .dwattr $C$DW$678, DW_AT_name("rsvd_8")
    8147                      .dwattr $C$DW$678, DW_AT_TI_symbol_name("_rsvd_8")
    8148                      .dwattr $C$DW$678, DW_AT_data_member_location[DW_OP_plus_uconst 0x661b]
    8149                      .dwattr $C$DW$678, DW_AT_accessibility(DW_ACCESS_public)
    8150              
    8151              $C$DW$679       .dwtag  DW_TAG_member
    8152                      .dwattr $C$DW$679, DW_AT_type(*$C$DW$T$24)
    8153                      .dwattr $C$DW$679, DW_AT_name("ADCSOCOVF1")
    8154                      .dwattr $C$DW$679, DW_AT_TI_symbol_name("_ADCSOCOVF1")
    8155                      .dwattr $C$DW$679, DW_AT_data_member_location[DW_OP_plus_uconst 0x661c]
    8156                      .dwattr $C$DW$679, DW_AT_accessibility(DW_ACCESS_public)
    8157              
    8158              $C$DW$680       .dwtag  DW_TAG_member
    8159                      .dwattr $C$DW$680, DW_AT_type(*$C$DW$T$24)
    8160                      .dwattr $C$DW$680, DW_AT_name("rsvd_9")
    8161                      .dwattr $C$DW$680, DW_AT_TI_symbol_name("_rsvd_9")
TMS320C2000 Assembler PC v15.12.3 Mon Sep 25 12:51:19 2017

Tools Copyright (c) 1996-2015 Texas Instruments Incorporated
C:\Users\wmj\AppData\Local\Temp\0412810                              PAGE  156

    8162                      .dwattr $C$DW$680, DW_AT_data_member_location[DW_OP_plus_uconst 0x661d]
    8163                      .dwattr $C$DW$680, DW_AT_accessibility(DW_ACCESS_public)
    8164              
    8165              $C$DW$681       .dwtag  DW_TAG_member
    8166                      .dwattr $C$DW$681, DW_AT_type(*$C$DW$T$24)
    8167                      .dwattr $C$DW$681, DW_AT_name("ADCSOCOVFCLR1")
    8168                      .dwattr $C$DW$681, DW_AT_TI_symbol_name("_ADCSOCOVFCLR1")
    8169                      .dwattr $C$DW$681, DW_AT_data_member_location[DW_OP_plus_uconst 0x661e]
    8170                      .dwattr $C$DW$681, DW_AT_accessibility(DW_ACCESS_public)
    8171              
    8172              $C$DW$682       .dwtag  DW_TAG_member
    8173                      .dwattr $C$DW$682, DW_AT_type(*$C$DW$T$24)
    8174                      .dwattr $C$DW$682, DW_AT_name("rsvd_10")
    8175                      .dwattr $C$DW$682, DW_AT_TI_symbol_name("_rsvd_10")
    8176                      .dwattr $C$DW$682, DW_AT_data_member_location[DW_OP_plus_uconst 0x661f]
    8177                      .dwattr $C$DW$682, DW_AT_accessibility(DW_ACCESS_public)
    8178              
    8179              $C$DW$683       .dwtag  DW_TAG_member
    8180                      .dwattr $C$DW$683, DW_AT_type(*$C$DW$T$25)
    8181                      .dwattr $C$DW$683, DW_AT_name("ADCSOCxCTL")
    8182                      .dwattr $C$DW$683, DW_AT_TI_symbol_name("_ADCSOCxCTL")
    8183                      .dwattr $C$DW$683, DW_AT_data_member_location[DW_OP_plus_uconst 0x6620]
    8184                      .dwattr $C$DW$683, DW_AT_accessibility(DW_ACCESS_public)
    8185              
    8186              $C$DW$684       .dwtag  DW_TAG_member
    8187                      .dwattr $C$DW$684, DW_AT_type(*$C$DW$T$25)
    8188                      .dwattr $C$DW$684, DW_AT_name("rsvd_11")
    8189                      .dwattr $C$DW$684, DW_AT_TI_symbol_name("_rsvd_11")
    8190                      .dwattr $C$DW$684, DW_AT_data_member_location[DW_OP_plus_uconst 0x6630]
    8191                      .dwattr $C$DW$684, DW_AT_accessibility(DW_ACCESS_public)
    8192              
    8193              $C$DW$685       .dwtag  DW_TAG_member
    8194                      .dwattr $C$DW$685, DW_AT_type(*$C$DW$T$24)
    8195                      .dwattr $C$DW$685, DW_AT_name("ADCREFTRIM")
    8196                      .dwattr $C$DW$685, DW_AT_TI_symbol_name("_ADCREFTRIM")
    8197                      .dwattr $C$DW$685, DW_AT_data_member_location[DW_OP_plus_uconst 0x6640]
    8198                      .dwattr $C$DW$685, DW_AT_accessibility(DW_ACCESS_public)
    8199              
    8200              $C$DW$686       .dwtag  DW_TAG_member
    8201                      .dwattr $C$DW$686, DW_AT_type(*$C$DW$T$24)
    8202                      .dwattr $C$DW$686, DW_AT_name("ADCOFFTRIM")
    8203                      .dwattr $C$DW$686, DW_AT_TI_symbol_name("_ADCOFFTRIM")
    8204                      .dwattr $C$DW$686, DW_AT_data_member_location[DW_OP_plus_uconst 0x6641]
    8205                      .dwattr $C$DW$686, DW_AT_accessibility(DW_ACCESS_public)
    8206              
    8207              $C$DW$687       .dwtag  DW_TAG_member
    8208                      .dwattr $C$DW$687, DW_AT_type(*$C$DW$T$30)
    8209                      .dwattr $C$DW$687, DW_AT_name("resvd_12")
    8210                      .dwattr $C$DW$687, DW_AT_TI_symbol_name("_resvd_12")
    8211                      .dwattr $C$DW$687, DW_AT_data_member_location[DW_OP_plus_uconst 0x6642]
    8212                      .dwattr $C$DW$687, DW_AT_accessibility(DW_ACCESS_public)
    8213              
    8214              $C$DW$688       .dwtag  DW_TAG_member
    8215                      .dwattr $C$DW$688, DW_AT_type(*$C$DW$T$24)
    8216                      .dwattr $C$DW$688, DW_AT_name("ADCREV")
TMS320C2000 Assembler PC v15.12.3 Mon Sep 25 12:51:19 2017

Tools Copyright (c) 1996-2015 Texas Instruments Incorporated
C:\Users\wmj\AppData\Local\Temp\0412810                              PAGE  157

    8217                      .dwattr $C$DW$688, DW_AT_TI_symbol_name("_ADCREV")
    8218                      .dwattr $C$DW$688, DW_AT_data_member_location[DW_OP_plus_uconst 0x664f]
    8219                      .dwattr $C$DW$688, DW_AT_accessibility(DW_ACCESS_public)
    8220              
    8221                      .dwendtag $C$DW$T$31
    8222              
    8223              $C$DW$T$87      .dwtag  DW_TAG_pointer_type
    8224                      .dwattr $C$DW$T$87, DW_AT_type(*$C$DW$T$31)
    8225                      .dwattr $C$DW$T$87, DW_AT_address_class(0x20)
    8226              
    8227              $C$DW$T$88      .dwtag  DW_TAG_typedef
    8228                      .dwattr $C$DW$T$88, DW_AT_name("ADC_Handle")
    8229                      .dwattr $C$DW$T$88, DW_AT_type(*$C$DW$T$87)
    8230                      .dwattr $C$DW$T$88, DW_AT_language(DW_LANG_C)
    8231              
    8232              
    8233              $C$DW$T$35      .dwtag  DW_TAG_structure_type
    8234                      .dwattr $C$DW$T$35, DW_AT_name("_BRAKE_Obj_")
    8235                      .dwattr $C$DW$T$35, DW_AT_byte_size(0x08)
    8236              $C$DW$689       .dwtag  DW_TAG_member
    8237                      .dwattr $C$DW$689, DW_AT_type(*$C$DW$T$32)
    8238                      .dwattr $C$DW$689, DW_AT_name("angle_pu")
    8239                      .dwattr $C$DW$689, DW_AT_TI_symbol_name("_angle_pu")
    8240                      .dwattr $C$DW$689, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    8241                      .dwattr $C$DW$689, DW_AT_accessibility(DW_ACCESS_public)
    8242              
    8243              $C$DW$690       .dwtag  DW_TAG_member
    8244                      .dwattr $C$DW$690, DW_AT_type(*$C$DW$T$33)
    8245                      .dwattr $C$DW$690, DW_AT_name("Idq_brake")
    8246                      .dwattr $C$DW$690, DW_AT_TI_symbol_name("_Idq_brake")
    8247                      .dwattr $C$DW$690, DW_AT_data_member_location[DW_OP_plus_uconst 0x2]
    8248                      .dwattr $C$DW$690, DW_AT_accessibility(DW_ACCESS_public)
    8249              
    8250              $C$DW$691       .dwtag  DW_TAG_member
    8251                      .dwattr $C$DW$691, DW_AT_type(*$C$DW$T$34)
    8252                      .dwattr $C$DW$691, DW_AT_name("brake_enable")
    8253                      .dwattr $C$DW$691, DW_AT_TI_symbol_name("_brake_enable")
    8254                      .dwattr $C$DW$691, DW_AT_data_member_location[DW_OP_plus_uconst 0x6]
    8255                      .dwattr $C$DW$691, DW_AT_accessibility(DW_ACCESS_public)
    8256              
    8257                      .dwendtag $C$DW$T$35
    8258              
    8259              $C$DW$T$74      .dwtag  DW_TAG_typedef
    8260                      .dwattr $C$DW$T$74, DW_AT_name("BRAKE_Obj")
    8261                      .dwattr $C$DW$T$74, DW_AT_type(*$C$DW$T$35)
    8262                      .dwattr $C$DW$T$74, DW_AT_language(DW_LANG_C)
    8263              
    8264              $C$DW$T$72      .dwtag  DW_TAG_pointer_type
    8265                      .dwattr $C$DW$T$72, DW_AT_type(*$C$DW$T$35)
    8266                      .dwattr $C$DW$T$72, DW_AT_address_class(0x20)
    8267              
    8268              $C$DW$T$73      .dwtag  DW_TAG_typedef
    8269                      .dwattr $C$DW$T$73, DW_AT_name("BRAKE_Handle")
    8270                      .dwattr $C$DW$T$73, DW_AT_type(*$C$DW$T$72)
    8271                      .dwattr $C$DW$T$73, DW_AT_language(DW_LANG_C)
TMS320C2000 Assembler PC v15.12.3 Mon Sep 25 12:51:19 2017

Tools Copyright (c) 1996-2015 Texas Instruments Incorporated
C:\Users\wmj\AppData\Local\Temp\0412810                              PAGE  158

    8272              
    8273              
    8274              $C$DW$T$37      .dwtag  DW_TAG_structure_type
    8275                      .dwattr $C$DW$T$37, DW_AT_name("_CLARKE_Obj_")
    8276                      .dwattr $C$DW$T$37, DW_AT_byte_size(0x06)
    8277              $C$DW$692       .dwtag  DW_TAG_member
    8278                      .dwattr $C$DW$692, DW_AT_type(*$C$DW$T$32)
    8279                      .dwattr $C$DW$692, DW_AT_name("alpha_sf")
    8280                      .dwattr $C$DW$692, DW_AT_TI_symbol_name("_alpha_sf")
    8281                      .dwattr $C$DW$692, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    8282                      .dwattr $C$DW$692, DW_AT_accessibility(DW_ACCESS_public)
    8283              
    8284              $C$DW$693       .dwtag  DW_TAG_member
    8285                      .dwattr $C$DW$693, DW_AT_type(*$C$DW$T$32)
    8286                      .dwattr $C$DW$693, DW_AT_name("beta_sf")
    8287                      .dwattr $C$DW$693, DW_AT_TI_symbol_name("_beta_sf")
    8288                      .dwattr $C$DW$693, DW_AT_data_member_location[DW_OP_plus_uconst 0x2]
    8289                      .dwattr $C$DW$693, DW_AT_accessibility(DW_ACCESS_public)
    8290              
    8291              $C$DW$694       .dwtag  DW_TAG_member
    8292                      .dwattr $C$DW$694, DW_AT_type(*$C$DW$T$36)
    8293                      .dwattr $C$DW$694, DW_AT_name("numSensors")
    8294                      .dwattr $C$DW$694, DW_AT_TI_symbol_name("_numSensors")
    8295                      .dwattr $C$DW$694, DW_AT_data_member_location[DW_OP_plus_uconst 0x4]
    8296                      .dwattr $C$DW$694, DW_AT_accessibility(DW_ACCESS_public)
    8297              
    8298                      .dwendtag $C$DW$T$37
    8299              
    8300              $C$DW$T$48      .dwtag  DW_TAG_typedef
    8301                      .dwattr $C$DW$T$48, DW_AT_name("CLARKE_Obj")
    8302                      .dwattr $C$DW$T$48, DW_AT_type(*$C$DW$T$37)
    8303                      .dwattr $C$DW$T$48, DW_AT_language(DW_LANG_C)
    8304              
    8305              $C$DW$T$190     .dwtag  DW_TAG_pointer_type
    8306                      .dwattr $C$DW$T$190, DW_AT_type(*$C$DW$T$48)
    8307                      .dwattr $C$DW$T$190, DW_AT_address_class(0x20)
    8308              
    8309              $C$DW$T$46      .dwtag  DW_TAG_pointer_type
    8310                      .dwattr $C$DW$T$46, DW_AT_type(*$C$DW$T$37)
    8311                      .dwattr $C$DW$T$46, DW_AT_address_class(0x20)
    8312              
    8313              $C$DW$T$47      .dwtag  DW_TAG_typedef
    8314                      .dwattr $C$DW$T$47, DW_AT_name("CLARKE_Handle")
    8315                      .dwattr $C$DW$T$47, DW_AT_type(*$C$DW$T$46)
    8316                      .dwattr $C$DW$T$47, DW_AT_language(DW_LANG_C)
    8317              
    8318              
    8319              $C$DW$T$39      .dwtag  DW_TAG_structure_type
    8320                      .dwattr $C$DW$T$39, DW_AT_name("_CLK_Obj_")
    8321                      .dwattr $C$DW$T$39, DW_AT_byte_size(0x11)
    8322              $C$DW$695       .dwtag  DW_TAG_member
    8323                      .dwattr $C$DW$695, DW_AT_type(*$C$DW$T$24)
    8324                      .dwattr $C$DW$695, DW_AT_name("XCLK")
    8325                      .dwattr $C$DW$695, DW_AT_TI_symbol_name("_XCLK")
    8326                      .dwattr $C$DW$695, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
TMS320C2000 Assembler PC v15.12.3 Mon Sep 25 12:51:19 2017

Tools Copyright (c) 1996-2015 Texas Instruments Incorporated
C:\Users\wmj\AppData\Local\Temp\0412810                              PAGE  159

    8327                      .dwattr $C$DW$695, DW_AT_accessibility(DW_ACCESS_public)
    8328              
    8329              $C$DW$696       .dwtag  DW_TAG_member
    8330                      .dwattr $C$DW$696, DW_AT_type(*$C$DW$T$24)
    8331                      .dwattr $C$DW$696, DW_AT_name("rsvd_1")
    8332                      .dwattr $C$DW$696, DW_AT_TI_symbol_name("_rsvd_1")
    8333                      .dwattr $C$DW$696, DW_AT_data_member_location[DW_OP_plus_uconst 0x1]
    8334                      .dwattr $C$DW$696, DW_AT_accessibility(DW_ACCESS_public)
    8335              
    8336              $C$DW$697       .dwtag  DW_TAG_member
    8337                      .dwattr $C$DW$697, DW_AT_type(*$C$DW$T$24)
    8338                      .dwattr $C$DW$697, DW_AT_name("CLKCTL")
    8339                      .dwattr $C$DW$697, DW_AT_TI_symbol_name("_CLKCTL")
    8340                      .dwattr $C$DW$697, DW_AT_data_member_location[DW_OP_plus_uconst 0x2]
    8341                      .dwattr $C$DW$697, DW_AT_accessibility(DW_ACCESS_public)
    8342              
    8343              $C$DW$698       .dwtag  DW_TAG_member
    8344                      .dwattr $C$DW$698, DW_AT_type(*$C$DW$T$38)
    8345                      .dwattr $C$DW$698, DW_AT_name("rsvd_2")
    8346                      .dwattr $C$DW$698, DW_AT_TI_symbol_name("_rsvd_2")
    8347                      .dwattr $C$DW$698, DW_AT_data_member_location[DW_OP_plus_uconst 0x3]
    8348                      .dwattr $C$DW$698, DW_AT_accessibility(DW_ACCESS_public)
    8349              
    8350              $C$DW$699       .dwtag  DW_TAG_member
    8351                      .dwattr $C$DW$699, DW_AT_type(*$C$DW$T$24)
    8352                      .dwattr $C$DW$699, DW_AT_name("LOSPCP")
    8353                      .dwattr $C$DW$699, DW_AT_TI_symbol_name("_LOSPCP")
    8354                      .dwattr $C$DW$699, DW_AT_data_member_location[DW_OP_plus_uconst 0xb]
    8355                      .dwattr $C$DW$699, DW_AT_accessibility(DW_ACCESS_public)
    8356              
    8357              $C$DW$700       .dwtag  DW_TAG_member
    8358                      .dwattr $C$DW$700, DW_AT_type(*$C$DW$T$24)
    8359                      .dwattr $C$DW$700, DW_AT_name("PCLKCR0")
    8360                      .dwattr $C$DW$700, DW_AT_TI_symbol_name("_PCLKCR0")
    8361                      .dwattr $C$DW$700, DW_AT_data_member_location[DW_OP_plus_uconst 0xc]
    8362                      .dwattr $C$DW$700, DW_AT_accessibility(DW_ACCESS_public)
    8363              
    8364              $C$DW$701       .dwtag  DW_TAG_member
    8365                      .dwattr $C$DW$701, DW_AT_type(*$C$DW$T$24)
    8366                      .dwattr $C$DW$701, DW_AT_name("PCLKCR1")
    8367                      .dwattr $C$DW$701, DW_AT_TI_symbol_name("_PCLKCR1")
    8368                      .dwattr $C$DW$701, DW_AT_data_member_location[DW_OP_plus_uconst 0xd]
    8369                      .dwattr $C$DW$701, DW_AT_accessibility(DW_ACCESS_public)
    8370              
    8371              $C$DW$702       .dwtag  DW_TAG_member
    8372                      .dwattr $C$DW$702, DW_AT_type(*$C$DW$T$27)
    8373                      .dwattr $C$DW$702, DW_AT_name("rsvd_3")
    8374                      .dwattr $C$DW$702, DW_AT_TI_symbol_name("_rsvd_3")
    8375                      .dwattr $C$DW$702, DW_AT_data_member_location[DW_OP_plus_uconst 0xe]
    8376                      .dwattr $C$DW$702, DW_AT_accessibility(DW_ACCESS_public)
    8377              
    8378              $C$DW$703       .dwtag  DW_TAG_member
    8379                      .dwattr $C$DW$703, DW_AT_type(*$C$DW$T$24)
    8380                      .dwattr $C$DW$703, DW_AT_name("PCLKCR3")
    8381                      .dwattr $C$DW$703, DW_AT_TI_symbol_name("_PCLKCR3")
TMS320C2000 Assembler PC v15.12.3 Mon Sep 25 12:51:19 2017

Tools Copyright (c) 1996-2015 Texas Instruments Incorporated
C:\Users\wmj\AppData\Local\Temp\0412810                              PAGE  160

    8382                      .dwattr $C$DW$703, DW_AT_data_member_location[DW_OP_plus_uconst 0x10]
    8383                      .dwattr $C$DW$703, DW_AT_accessibility(DW_ACCESS_public)
    8384              
    8385                      .dwendtag $C$DW$T$39
    8386              
    8387              $C$DW$T$89      .dwtag  DW_TAG_pointer_type
    8388                      .dwattr $C$DW$T$89, DW_AT_type(*$C$DW$T$39)
    8389                      .dwattr $C$DW$T$89, DW_AT_address_class(0x20)
    8390              
    8391              $C$DW$T$90      .dwtag  DW_TAG_typedef
    8392                      .dwattr $C$DW$T$90, DW_AT_name("CLK_Handle")
    8393                      .dwattr $C$DW$T$90, DW_AT_type(*$C$DW$T$89)
    8394                      .dwattr $C$DW$T$90, DW_AT_language(DW_LANG_C)
    8395              
    8396              
    8397              $C$DW$T$40      .dwtag  DW_TAG_structure_type
    8398                      .dwattr $C$DW$T$40, DW_AT_name("_CPU_Obj_")
    8399                      .dwattr $C$DW$T$40, DW_AT_byte_size(0x01)
    8400              $C$DW$704       .dwtag  DW_TAG_member
    8401                      .dwattr $C$DW$704, DW_AT_type(*$C$DW$T$36)
    8402                      .dwattr $C$DW$704, DW_AT_name("tmp")
    8403                      .dwattr $C$DW$704, DW_AT_TI_symbol_name("_tmp")
    8404                      .dwattr $C$DW$704, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    8405                      .dwattr $C$DW$704, DW_AT_accessibility(DW_ACCESS_public)
    8406              
    8407                      .dwendtag $C$DW$T$40
    8408              
    8409              $C$DW$T$91      .dwtag  DW_TAG_pointer_type
    8410                      .dwattr $C$DW$T$91, DW_AT_type(*$C$DW$T$40)
    8411                      .dwattr $C$DW$T$91, DW_AT_address_class(0x20)
    8412              
    8413              $C$DW$T$92      .dwtag  DW_TAG_typedef
    8414                      .dwattr $C$DW$T$92, DW_AT_name("CPU_Handle")
    8415                      .dwattr $C$DW$T$92, DW_AT_type(*$C$DW$T$91)
    8416                      .dwattr $C$DW$T$92, DW_AT_language(DW_LANG_C)
    8417              
    8418              
    8419              $C$DW$T$75      .dwtag  DW_TAG_structure_type
    8420                      .dwattr $C$DW$T$75, DW_AT_name("_CTRL_Obj_")
    8421                      .dwattr $C$DW$T$75, DW_AT_byte_size(0x112)
    8422              $C$DW$705       .dwtag  DW_TAG_member
    8423                      .dwattr $C$DW$705, DW_AT_type(*$C$DW$T$41)
    8424                      .dwattr $C$DW$705, DW_AT_name("version")
    8425                      .dwattr $C$DW$705, DW_AT_TI_symbol_name("_version")
    8426                      .dwattr $C$DW$705, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    8427                      .dwattr $C$DW$705, DW_AT_accessibility(DW_ACCESS_public)
    8428              
    8429              $C$DW$706       .dwtag  DW_TAG_member
    8430                      .dwattr $C$DW$706, DW_AT_type(*$C$DW$T$43)
    8431                      .dwattr $C$DW$706, DW_AT_name("state")
    8432                      .dwattr $C$DW$706, DW_AT_TI_symbol_name("_state")
    8433                      .dwattr $C$DW$706, DW_AT_data_member_location[DW_OP_plus_uconst 0x4]
    8434                      .dwattr $C$DW$706, DW_AT_accessibility(DW_ACCESS_public)
    8435              
    8436              $C$DW$707       .dwtag  DW_TAG_member
TMS320C2000 Assembler PC v15.12.3 Mon Sep 25 12:51:19 2017

Tools Copyright (c) 1996-2015 Texas Instruments Incorporated
C:\Users\wmj\AppData\Local\Temp\0412810                              PAGE  161

    8437                      .dwattr $C$DW$707, DW_AT_type(*$C$DW$T$43)
    8438                      .dwattr $C$DW$707, DW_AT_name("prevState")
    8439                      .dwattr $C$DW$707, DW_AT_TI_symbol_name("_prevState")
    8440                      .dwattr $C$DW$707, DW_AT_data_member_location[DW_OP_plus_uconst 0x5]
    8441                      .dwattr $C$DW$707, DW_AT_accessibility(DW_ACCESS_public)
    8442              
    8443              $C$DW$708       .dwtag  DW_TAG_member
    8444                      .dwattr $C$DW$708, DW_AT_type(*$C$DW$T$45)
    8445                      .dwattr $C$DW$708, DW_AT_name("errorCode")
    8446                      .dwattr $C$DW$708, DW_AT_TI_symbol_name("_errorCode")
    8447                      .dwattr $C$DW$708, DW_AT_data_member_location[DW_OP_plus_uconst 0x6]
    8448                      .dwattr $C$DW$708, DW_AT_accessibility(DW_ACCESS_public)
    8449              
    8450              $C$DW$709       .dwtag  DW_TAG_member
    8451                      .dwattr $C$DW$709, DW_AT_type(*$C$DW$T$47)
    8452                      .dwattr $C$DW$709, DW_AT_name("clarkeHandle_I")
    8453                      .dwattr $C$DW$709, DW_AT_TI_symbol_name("_clarkeHandle_I")
    8454                      .dwattr $C$DW$709, DW_AT_data_member_location[DW_OP_plus_uconst 0x8]
    8455                      .dwattr $C$DW$709, DW_AT_accessibility(DW_ACCESS_public)
    8456              
    8457              $C$DW$710       .dwtag  DW_TAG_member
    8458                      .dwattr $C$DW$710, DW_AT_type(*$C$DW$T$48)
    8459                      .dwattr $C$DW$710, DW_AT_name("clarke_I")
    8460                      .dwattr $C$DW$710, DW_AT_TI_symbol_name("_clarke_I")
    8461                      .dwattr $C$DW$710, DW_AT_data_member_location[DW_OP_plus_uconst 0xa]
    8462                      .dwattr $C$DW$710, DW_AT_accessibility(DW_ACCESS_public)
    8463              
    8464              $C$DW$711       .dwtag  DW_TAG_member
    8465                      .dwattr $C$DW$711, DW_AT_type(*$C$DW$T$47)
    8466                      .dwattr $C$DW$711, DW_AT_name("clarkeHandle_V")
    8467                      .dwattr $C$DW$711, DW_AT_TI_symbol_name("_clarkeHandle_V")
    8468                      .dwattr $C$DW$711, DW_AT_data_member_location[DW_OP_plus_uconst 0x10]
    8469                      .dwattr $C$DW$711, DW_AT_accessibility(DW_ACCESS_public)
    8470              
    8471              $C$DW$712       .dwtag  DW_TAG_member
    8472                      .dwattr $C$DW$712, DW_AT_type(*$C$DW$T$48)
    8473                      .dwattr $C$DW$712, DW_AT_name("clarke_V")
    8474                      .dwattr $C$DW$712, DW_AT_TI_symbol_name("_clarke_V")
    8475                      .dwattr $C$DW$712, DW_AT_data_member_location[DW_OP_plus_uconst 0x12]
    8476                      .dwattr $C$DW$712, DW_AT_accessibility(DW_ACCESS_public)
    8477              
    8478              $C$DW$713       .dwtag  DW_TAG_member
    8479                      .dwattr $C$DW$713, DW_AT_type(*$C$DW$T$50)
    8480                      .dwattr $C$DW$713, DW_AT_name("estHandle")
    8481                      .dwattr $C$DW$713, DW_AT_TI_symbol_name("_estHandle")
    8482                      .dwattr $C$DW$713, DW_AT_data_member_location[DW_OP_plus_uconst 0x18]
    8483                      .dwattr $C$DW$713, DW_AT_accessibility(DW_ACCESS_public)
    8484              
    8485              $C$DW$714       .dwtag  DW_TAG_member
    8486                      .dwattr $C$DW$714, DW_AT_type(*$C$DW$T$52)
    8487                      .dwattr $C$DW$714, DW_AT_name("parkHandle")
    8488                      .dwattr $C$DW$714, DW_AT_TI_symbol_name("_parkHandle")
    8489                      .dwattr $C$DW$714, DW_AT_data_member_location[DW_OP_plus_uconst 0x1a]
    8490                      .dwattr $C$DW$714, DW_AT_accessibility(DW_ACCESS_public)
    8491              
TMS320C2000 Assembler PC v15.12.3 Mon Sep 25 12:51:19 2017

Tools Copyright (c) 1996-2015 Texas Instruments Incorporated
C:\Users\wmj\AppData\Local\Temp\0412810                              PAGE  162

    8492              $C$DW$715       .dwtag  DW_TAG_member
    8493                      .dwattr $C$DW$715, DW_AT_type(*$C$DW$T$53)
    8494                      .dwattr $C$DW$715, DW_AT_name("park")
    8495                      .dwattr $C$DW$715, DW_AT_TI_symbol_name("_park")
    8496                      .dwattr $C$DW$715, DW_AT_data_member_location[DW_OP_plus_uconst 0x1c]
    8497                      .dwattr $C$DW$715, DW_AT_accessibility(DW_ACCESS_public)
    8498              
    8499              $C$DW$716       .dwtag  DW_TAG_member
    8500                      .dwattr $C$DW$716, DW_AT_type(*$C$DW$T$55)
    8501                      .dwattr $C$DW$716, DW_AT_name("pidHandle_Id")
    8502                      .dwattr $C$DW$716, DW_AT_TI_symbol_name("_pidHandle_Id")
    8503                      .dwattr $C$DW$716, DW_AT_data_member_location[DW_OP_plus_uconst 0x20]
    8504                      .dwattr $C$DW$716, DW_AT_accessibility(DW_ACCESS_public)
    8505              
    8506              $C$DW$717       .dwtag  DW_TAG_member
    8507                      .dwattr $C$DW$717, DW_AT_type(*$C$DW$T$56)
    8508                      .dwattr $C$DW$717, DW_AT_name("pid_Id")
    8509                      .dwattr $C$DW$717, DW_AT_TI_symbol_name("_pid_Id")
    8510                      .dwattr $C$DW$717, DW_AT_data_member_location[DW_OP_plus_uconst 0x22]
    8511                      .dwattr $C$DW$717, DW_AT_accessibility(DW_ACCESS_public)
    8512              
    8513              $C$DW$718       .dwtag  DW_TAG_member
    8514                      .dwattr $C$DW$718, DW_AT_type(*$C$DW$T$55)
    8515                      .dwattr $C$DW$718, DW_AT_name("pidHandle_Iq")
    8516                      .dwattr $C$DW$718, DW_AT_TI_symbol_name("_pidHandle_Iq")
    8517                      .dwattr $C$DW$718, DW_AT_data_member_location[DW_OP_plus_uconst 0x32]
    8518                      .dwattr $C$DW$718, DW_AT_accessibility(DW_ACCESS_public)
    8519              
    8520              $C$DW$719       .dwtag  DW_TAG_member
    8521                      .dwattr $C$DW$719, DW_AT_type(*$C$DW$T$56)
    8522                      .dwattr $C$DW$719, DW_AT_name("pid_Iq")
    8523                      .dwattr $C$DW$719, DW_AT_TI_symbol_name("_pid_Iq")
    8524                      .dwattr $C$DW$719, DW_AT_data_member_location[DW_OP_plus_uconst 0x34]
    8525                      .dwattr $C$DW$719, DW_AT_accessibility(DW_ACCESS_public)
    8526              
    8527              $C$DW$720       .dwtag  DW_TAG_member
    8528                      .dwattr $C$DW$720, DW_AT_type(*$C$DW$T$55)
    8529                      .dwattr $C$DW$720, DW_AT_name("pidHandle_spd")
    8530                      .dwattr $C$DW$720, DW_AT_TI_symbol_name("_pidHandle_spd")
    8531                      .dwattr $C$DW$720, DW_AT_data_member_location[DW_OP_plus_uconst 0x44]
    8532                      .dwattr $C$DW$720, DW_AT_accessibility(DW_ACCESS_public)
    8533              
    8534              $C$DW$721       .dwtag  DW_TAG_member
    8535                      .dwattr $C$DW$721, DW_AT_type(*$C$DW$T$56)
    8536                      .dwattr $C$DW$721, DW_AT_name("pid_spd")
    8537                      .dwattr $C$DW$721, DW_AT_TI_symbol_name("_pid_spd")
    8538                      .dwattr $C$DW$721, DW_AT_data_member_location[DW_OP_plus_uconst 0x46]
    8539                      .dwattr $C$DW$721, DW_AT_accessibility(DW_ACCESS_public)
    8540              
    8541              $C$DW$722       .dwtag  DW_TAG_member
    8542                      .dwattr $C$DW$722, DW_AT_type(*$C$DW$T$58)
    8543                      .dwattr $C$DW$722, DW_AT_name("iparkHandle")
    8544                      .dwattr $C$DW$722, DW_AT_TI_symbol_name("_iparkHandle")
    8545                      .dwattr $C$DW$722, DW_AT_data_member_location[DW_OP_plus_uconst 0x56]
    8546                      .dwattr $C$DW$722, DW_AT_accessibility(DW_ACCESS_public)
TMS320C2000 Assembler PC v15.12.3 Mon Sep 25 12:51:19 2017

Tools Copyright (c) 1996-2015 Texas Instruments Incorporated
C:\Users\wmj\AppData\Local\Temp\0412810                              PAGE  163

    8547              
    8548              $C$DW$723       .dwtag  DW_TAG_member
    8549                      .dwattr $C$DW$723, DW_AT_type(*$C$DW$T$59)
    8550                      .dwattr $C$DW$723, DW_AT_name("ipark")
    8551                      .dwattr $C$DW$723, DW_AT_TI_symbol_name("_ipark")
    8552                      .dwattr $C$DW$723, DW_AT_data_member_location[DW_OP_plus_uconst 0x58]
    8553                      .dwattr $C$DW$723, DW_AT_accessibility(DW_ACCESS_public)
    8554              
    8555              $C$DW$724       .dwtag  DW_TAG_member
    8556                      .dwattr $C$DW$724, DW_AT_type(*$C$DW$T$61)
    8557                      .dwattr $C$DW$724, DW_AT_name("svgenHandle")
    8558                      .dwattr $C$DW$724, DW_AT_TI_symbol_name("_svgenHandle")
    8559                      .dwattr $C$DW$724, DW_AT_data_member_location[DW_OP_plus_uconst 0x5c]
    8560                      .dwattr $C$DW$724, DW_AT_accessibility(DW_ACCESS_public)
    8561              
    8562              $C$DW$725       .dwtag  DW_TAG_member
    8563                      .dwattr $C$DW$725, DW_AT_type(*$C$DW$T$62)
    8564                      .dwattr $C$DW$725, DW_AT_name("svgen")
    8565                      .dwattr $C$DW$725, DW_AT_TI_symbol_name("_svgen")
    8566                      .dwattr $C$DW$725, DW_AT_data_member_location[DW_OP_plus_uconst 0x5e]
    8567                      .dwattr $C$DW$725, DW_AT_accessibility(DW_ACCESS_public)
    8568              
    8569              $C$DW$726       .dwtag  DW_TAG_member
    8570                      .dwattr $C$DW$726, DW_AT_type(*$C$DW$T$64)
    8571                      .dwattr $C$DW$726, DW_AT_name("trajHandle_Id")
    8572                      .dwattr $C$DW$726, DW_AT_TI_symbol_name("_trajHandle_Id")
    8573                      .dwattr $C$DW$726, DW_AT_data_member_location[DW_OP_plus_uconst 0x60]
    8574                      .dwattr $C$DW$726, DW_AT_accessibility(DW_ACCESS_public)
    8575              
    8576              $C$DW$727       .dwtag  DW_TAG_member
    8577                      .dwattr $C$DW$727, DW_AT_type(*$C$DW$T$65)
    8578                      .dwattr $C$DW$727, DW_AT_name("traj_Id")
    8579                      .dwattr $C$DW$727, DW_AT_TI_symbol_name("_traj_Id")
    8580                      .dwattr $C$DW$727, DW_AT_data_member_location[DW_OP_plus_uconst 0x62]
    8581                      .dwattr $C$DW$727, DW_AT_accessibility(DW_ACCESS_public)
    8582              
    8583              $C$DW$728       .dwtag  DW_TAG_member
    8584                      .dwattr $C$DW$728, DW_AT_type(*$C$DW$T$64)
    8585                      .dwattr $C$DW$728, DW_AT_name("trajHandle_spd")
    8586                      .dwattr $C$DW$728, DW_AT_TI_symbol_name("_trajHandle_spd")
    8587                      .dwattr $C$DW$728, DW_AT_data_member_location[DW_OP_plus_uconst 0x6c]
    8588                      .dwattr $C$DW$728, DW_AT_accessibility(DW_ACCESS_public)
    8589              
    8590              $C$DW$729       .dwtag  DW_TAG_member
    8591                      .dwattr $C$DW$729, DW_AT_type(*$C$DW$T$65)
    8592                      .dwattr $C$DW$729, DW_AT_name("traj_spd")
    8593                      .dwattr $C$DW$729, DW_AT_TI_symbol_name("_traj_spd")
    8594                      .dwattr $C$DW$729, DW_AT_data_member_location[DW_OP_plus_uconst 0x6e]
    8595                      .dwattr $C$DW$729, DW_AT_accessibility(DW_ACCESS_public)
    8596              
    8597              $C$DW$730       .dwtag  DW_TAG_member
    8598                      .dwattr $C$DW$730, DW_AT_type(*$C$DW$T$64)
    8599                      .dwattr $C$DW$730, DW_AT_name("trajHandle_spdMax")
    8600                      .dwattr $C$DW$730, DW_AT_TI_symbol_name("_trajHandle_spdMax")
    8601                      .dwattr $C$DW$730, DW_AT_data_member_location[DW_OP_plus_uconst 0x78]
TMS320C2000 Assembler PC v15.12.3 Mon Sep 25 12:51:19 2017

Tools Copyright (c) 1996-2015 Texas Instruments Incorporated
C:\Users\wmj\AppData\Local\Temp\0412810                              PAGE  164

    8602                      .dwattr $C$DW$730, DW_AT_accessibility(DW_ACCESS_public)
    8603              
    8604              $C$DW$731       .dwtag  DW_TAG_member
    8605                      .dwattr $C$DW$731, DW_AT_type(*$C$DW$T$65)
    8606                      .dwattr $C$DW$731, DW_AT_name("traj_spdMax")
    8607                      .dwattr $C$DW$731, DW_AT_TI_symbol_name("_traj_spdMax")
    8608                      .dwattr $C$DW$731, DW_AT_data_member_location[DW_OP_plus_uconst 0x7a]
    8609                      .dwattr $C$DW$731, DW_AT_accessibility(DW_ACCESS_public)
    8610              
    8611              $C$DW$732       .dwtag  DW_TAG_member
    8612                      .dwattr $C$DW$732, DW_AT_type(*$C$DW$T$66)
    8613                      .dwattr $C$DW$732, DW_AT_name("motorParams")
    8614                      .dwattr $C$DW$732, DW_AT_TI_symbol_name("_motorParams")
    8615                      .dwattr $C$DW$732, DW_AT_data_member_location[DW_OP_plus_uconst 0x84]
    8616                      .dwattr $C$DW$732, DW_AT_accessibility(DW_ACCESS_public)
    8617              
    8618              $C$DW$733       .dwtag  DW_TAG_member
    8619                      .dwattr $C$DW$733, DW_AT_type(*$C$DW$T$69)
    8620                      .dwattr $C$DW$733, DW_AT_name("waitTimes")
    8621                      .dwattr $C$DW$733, DW_AT_TI_symbol_name("_waitTimes")
    8622                      .dwattr $C$DW$733, DW_AT_data_member_location[DW_OP_plus_uconst 0x92]
    8623                      .dwattr $C$DW$733, DW_AT_accessibility(DW_ACCESS_public)
    8624              
    8625              $C$DW$734       .dwtag  DW_TAG_member
    8626                      .dwattr $C$DW$734, DW_AT_type(*$C$DW$T$68)
    8627                      .dwattr $C$DW$734, DW_AT_name("counter_state")
    8628                      .dwattr $C$DW$734, DW_AT_TI_symbol_name("_counter_state")
    8629                      .dwattr $C$DW$734, DW_AT_data_member_location[DW_OP_plus_uconst 0x9a]
    8630                      .dwattr $C$DW$734, DW_AT_accessibility(DW_ACCESS_public)
    8631              
    8632              $C$DW$735       .dwtag  DW_TAG_member
    8633                      .dwattr $C$DW$735, DW_AT_type(*$C$DW$T$70)
    8634                      .dwattr $C$DW$735, DW_AT_name("numIsrTicksPerCtrlTick")
    8635                      .dwattr $C$DW$735, DW_AT_TI_symbol_name("_numIsrTicksPerCtrlTick")
    8636                      .dwattr $C$DW$735, DW_AT_data_member_location[DW_OP_plus_uconst 0x9c]
    8637                      .dwattr $C$DW$735, DW_AT_accessibility(DW_ACCESS_public)
    8638              
    8639              $C$DW$736       .dwtag  DW_TAG_member
    8640                      .dwattr $C$DW$736, DW_AT_type(*$C$DW$T$70)
    8641                      .dwattr $C$DW$736, DW_AT_name("numCtrlTicksPerCurrentTick")
    8642                      .dwattr $C$DW$736, DW_AT_TI_symbol_name("_numCtrlTicksPerCurrentTick")
    8643                      .dwattr $C$DW$736, DW_AT_data_member_location[DW_OP_plus_uconst 0x9d]
    8644                      .dwattr $C$DW$736, DW_AT_accessibility(DW_ACCESS_public)
    8645              
    8646              $C$DW$737       .dwtag  DW_TAG_member
    8647                      .dwattr $C$DW$737, DW_AT_type(*$C$DW$T$70)
    8648                      .dwattr $C$DW$737, DW_AT_name("numCtrlTicksPerSpeedTick")
    8649                      .dwattr $C$DW$737, DW_AT_TI_symbol_name("_numCtrlTicksPerSpeedTick")
    8650                      .dwattr $C$DW$737, DW_AT_data_member_location[DW_OP_plus_uconst 0x9e]
    8651                      .dwattr $C$DW$737, DW_AT_accessibility(DW_ACCESS_public)
    8652              
    8653              $C$DW$738       .dwtag  DW_TAG_member
    8654                      .dwattr $C$DW$738, DW_AT_type(*$C$DW$T$70)
    8655                      .dwattr $C$DW$738, DW_AT_name("numCtrlTicksPerTrajTick")
    8656                      .dwattr $C$DW$738, DW_AT_TI_symbol_name("_numCtrlTicksPerTrajTick")
TMS320C2000 Assembler PC v15.12.3 Mon Sep 25 12:51:19 2017

Tools Copyright (c) 1996-2015 Texas Instruments Incorporated
C:\Users\wmj\AppData\Local\Temp\0412810                              PAGE  165

    8657                      .dwattr $C$DW$738, DW_AT_data_member_location[DW_OP_plus_uconst 0x9f]
    8658                      .dwattr $C$DW$738, DW_AT_accessibility(DW_ACCESS_public)
    8659              
    8660              $C$DW$739       .dwtag  DW_TAG_member
    8661                      .dwattr $C$DW$739, DW_AT_type(*$C$DW$T$68)
    8662                      .dwattr $C$DW$739, DW_AT_name("ctrlFreq_Hz")
    8663                      .dwattr $C$DW$739, DW_AT_TI_symbol_name("_ctrlFreq_Hz")
    8664                      .dwattr $C$DW$739, DW_AT_data_member_location[DW_OP_plus_uconst 0xa0]
    8665                      .dwattr $C$DW$739, DW_AT_accessibility(DW_ACCESS_public)
    8666              
    8667              $C$DW$740       .dwtag  DW_TAG_member
    8668                      .dwattr $C$DW$740, DW_AT_type(*$C$DW$T$68)
    8669                      .dwattr $C$DW$740, DW_AT_name("trajFreq_Hz")
    8670                      .dwattr $C$DW$740, DW_AT_TI_symbol_name("_trajFreq_Hz")
    8671                      .dwattr $C$DW$740, DW_AT_data_member_location[DW_OP_plus_uconst 0xa2]
    8672                      .dwattr $C$DW$740, DW_AT_accessibility(DW_ACCESS_public)
    8673              
    8674              $C$DW$741       .dwtag  DW_TAG_member
    8675                      .dwattr $C$DW$741, DW_AT_type(*$C$DW$T$32)
    8676                      .dwattr $C$DW$741, DW_AT_name("trajPeriod_sec")
    8677                      .dwattr $C$DW$741, DW_AT_TI_symbol_name("_trajPeriod_sec")
    8678                      .dwattr $C$DW$741, DW_AT_data_member_location[DW_OP_plus_uconst 0xa4]
    8679                      .dwattr $C$DW$741, DW_AT_accessibility(DW_ACCESS_public)
    8680              
    8681              $C$DW$742       .dwtag  DW_TAG_member
    8682                      .dwattr $C$DW$742, DW_AT_type(*$C$DW$T$71)
    8683                      .dwattr $C$DW$742, DW_AT_name("ctrlPeriod_sec")
    8684                      .dwattr $C$DW$742, DW_AT_TI_symbol_name("_ctrlPeriod_sec")
    8685                      .dwattr $C$DW$742, DW_AT_data_member_location[DW_OP_plus_uconst 0xa6]
    8686                      .dwattr $C$DW$742, DW_AT_accessibility(DW_ACCESS_public)
    8687              
    8688              $C$DW$743       .dwtag  DW_TAG_member
    8689                      .dwattr $C$DW$743, DW_AT_type(*$C$DW$T$32)
    8690                      .dwattr $C$DW$743, DW_AT_name("maxVsMag_pu")
    8691                      .dwattr $C$DW$743, DW_AT_TI_symbol_name("_maxVsMag_pu")
    8692                      .dwattr $C$DW$743, DW_AT_data_member_location[DW_OP_plus_uconst 0xa8]
    8693                      .dwattr $C$DW$743, DW_AT_accessibility(DW_ACCESS_public)
    8694              
    8695              $C$DW$744       .dwtag  DW_TAG_member
    8696                      .dwattr $C$DW$744, DW_AT_type(*$C$DW$T$33)
    8697                      .dwattr $C$DW$744, DW_AT_name("Iab_in")
    8698                      .dwattr $C$DW$744, DW_AT_TI_symbol_name("_Iab_in")
    8699                      .dwattr $C$DW$744, DW_AT_data_member_location[DW_OP_plus_uconst 0xaa]
    8700                      .dwattr $C$DW$744, DW_AT_accessibility(DW_ACCESS_public)
    8701              
    8702              $C$DW$745       .dwtag  DW_TAG_member
    8703                      .dwattr $C$DW$745, DW_AT_type(*$C$DW$T$33)
    8704                      .dwattr $C$DW$745, DW_AT_name("Iab_filt")
    8705                      .dwattr $C$DW$745, DW_AT_TI_symbol_name("_Iab_filt")
    8706                      .dwattr $C$DW$745, DW_AT_data_member_location[DW_OP_plus_uconst 0xae]
    8707                      .dwattr $C$DW$745, DW_AT_accessibility(DW_ACCESS_public)
    8708              
    8709              $C$DW$746       .dwtag  DW_TAG_member
    8710                      .dwattr $C$DW$746, DW_AT_type(*$C$DW$T$33)
    8711                      .dwattr $C$DW$746, DW_AT_name("Idq_in")
TMS320C2000 Assembler PC v15.12.3 Mon Sep 25 12:51:19 2017

Tools Copyright (c) 1996-2015 Texas Instruments Incorporated
C:\Users\wmj\AppData\Local\Temp\0412810                              PAGE  166

    8712                      .dwattr $C$DW$746, DW_AT_TI_symbol_name("_Idq_in")
    8713                      .dwattr $C$DW$746, DW_AT_data_member_location[DW_OP_plus_uconst 0xb2]
    8714                      .dwattr $C$DW$746, DW_AT_accessibility(DW_ACCESS_public)
    8715              
    8716              $C$DW$747       .dwtag  DW_TAG_member
    8717                      .dwattr $C$DW$747, DW_AT_type(*$C$DW$T$33)
    8718                      .dwattr $C$DW$747, DW_AT_name("Vab_in")
    8719                      .dwattr $C$DW$747, DW_AT_TI_symbol_name("_Vab_in")
    8720                      .dwattr $C$DW$747, DW_AT_data_member_location[DW_OP_plus_uconst 0xb6]
    8721                      .dwattr $C$DW$747, DW_AT_accessibility(DW_ACCESS_public)
    8722              
    8723              $C$DW$748       .dwtag  DW_TAG_member
    8724                      .dwattr $C$DW$748, DW_AT_type(*$C$DW$T$32)
    8725                      .dwattr $C$DW$748, DW_AT_name("spd_out")
    8726                      .dwattr $C$DW$748, DW_AT_TI_symbol_name("_spd_out")
    8727                      .dwattr $C$DW$748, DW_AT_data_member_location[DW_OP_plus_uconst 0xba]
    8728                      .dwattr $C$DW$748, DW_AT_accessibility(DW_ACCESS_public)
    8729              
    8730              $C$DW$749       .dwtag  DW_TAG_member
    8731                      .dwattr $C$DW$749, DW_AT_type(*$C$DW$T$33)
    8732                      .dwattr $C$DW$749, DW_AT_name("Vab_out")
    8733                      .dwattr $C$DW$749, DW_AT_TI_symbol_name("_Vab_out")
    8734                      .dwattr $C$DW$749, DW_AT_data_member_location[DW_OP_plus_uconst 0xbc]
    8735                      .dwattr $C$DW$749, DW_AT_accessibility(DW_ACCESS_public)
    8736              
    8737              $C$DW$750       .dwtag  DW_TAG_member
    8738                      .dwattr $C$DW$750, DW_AT_type(*$C$DW$T$33)
    8739                      .dwattr $C$DW$750, DW_AT_name("Vdq_out")
    8740                      .dwattr $C$DW$750, DW_AT_TI_symbol_name("_Vdq_out")
    8741                      .dwattr $C$DW$750, DW_AT_data_member_location[DW_OP_plus_uconst 0xc0]
    8742                      .dwattr $C$DW$750, DW_AT_accessibility(DW_ACCESS_public)
    8743              
    8744              $C$DW$751       .dwtag  DW_TAG_member
    8745                      .dwattr $C$DW$751, DW_AT_type(*$C$DW$T$71)
    8746                      .dwattr $C$DW$751, DW_AT_name("Rhf")
    8747                      .dwattr $C$DW$751, DW_AT_TI_symbol_name("_Rhf")
    8748                      .dwattr $C$DW$751, DW_AT_data_member_location[DW_OP_plus_uconst 0xc4]
    8749                      .dwattr $C$DW$751, DW_AT_accessibility(DW_ACCESS_public)
    8750              
    8751              $C$DW$752       .dwtag  DW_TAG_member
    8752                      .dwattr $C$DW$752, DW_AT_type(*$C$DW$T$71)
    8753                      .dwattr $C$DW$752, DW_AT_name("Lhf")
    8754                      .dwattr $C$DW$752, DW_AT_TI_symbol_name("_Lhf")
    8755                      .dwattr $C$DW$752, DW_AT_data_member_location[DW_OP_plus_uconst 0xc6]
    8756                      .dwattr $C$DW$752, DW_AT_accessibility(DW_ACCESS_public)
    8757              
    8758              $C$DW$753       .dwtag  DW_TAG_member
    8759                      .dwattr $C$DW$753, DW_AT_type(*$C$DW$T$71)
    8760                      .dwattr $C$DW$753, DW_AT_name("RoverL")
    8761                      .dwattr $C$DW$753, DW_AT_TI_symbol_name("_RoverL")
    8762                      .dwattr $C$DW$753, DW_AT_data_member_location[DW_OP_plus_uconst 0xc8]
    8763                      .dwattr $C$DW$753, DW_AT_accessibility(DW_ACCESS_public)
    8764              
    8765              $C$DW$754       .dwtag  DW_TAG_member
    8766                      .dwattr $C$DW$754, DW_AT_type(*$C$DW$T$32)
TMS320C2000 Assembler PC v15.12.3 Mon Sep 25 12:51:19 2017

Tools Copyright (c) 1996-2015 Texas Instruments Incorporated
C:\Users\wmj\AppData\Local\Temp\0412810                              PAGE  167

    8767                      .dwattr $C$DW$754, DW_AT_name("Kp_Id")
    8768                      .dwattr $C$DW$754, DW_AT_TI_symbol_name("_Kp_Id")
    8769                      .dwattr $C$DW$754, DW_AT_data_member_location[DW_OP_plus_uconst 0xca]
    8770                      .dwattr $C$DW$754, DW_AT_accessibility(DW_ACCESS_public)
    8771              
    8772              $C$DW$755       .dwtag  DW_TAG_member
    8773                      .dwattr $C$DW$755, DW_AT_type(*$C$DW$T$32)
    8774                      .dwattr $C$DW$755, DW_AT_name("Kp_Iq")
    8775                      .dwattr $C$DW$755, DW_AT_TI_symbol_name("_Kp_Iq")
    8776                      .dwattr $C$DW$755, DW_AT_data_member_location[DW_OP_plus_uconst 0xcc]
    8777                      .dwattr $C$DW$755, DW_AT_accessibility(DW_ACCESS_public)
    8778              
    8779              $C$DW$756       .dwtag  DW_TAG_member
    8780                      .dwattr $C$DW$756, DW_AT_type(*$C$DW$T$32)
    8781                      .dwattr $C$DW$756, DW_AT_name("Kp_spd")
    8782                      .dwattr $C$DW$756, DW_AT_TI_symbol_name("_Kp_spd")
    8783                      .dwattr $C$DW$756, DW_AT_data_member_location[DW_OP_plus_uconst 0xce]
    8784                      .dwattr $C$DW$756, DW_AT_accessibility(DW_ACCESS_public)
    8785              
    8786              $C$DW$757       .dwtag  DW_TAG_member
    8787                      .dwattr $C$DW$757, DW_AT_type(*$C$DW$T$32)
    8788                      .dwattr $C$DW$757, DW_AT_name("Ki_Id")
    8789                      .dwattr $C$DW$757, DW_AT_TI_symbol_name("_Ki_Id")
    8790                      .dwattr $C$DW$757, DW_AT_data_member_location[DW_OP_plus_uconst 0xd0]
    8791                      .dwattr $C$DW$757, DW_AT_accessibility(DW_ACCESS_public)
    8792              
    8793              $C$DW$758       .dwtag  DW_TAG_member
    8794                      .dwattr $C$DW$758, DW_AT_type(*$C$DW$T$32)
    8795                      .dwattr $C$DW$758, DW_AT_name("Ki_Iq")
    8796                      .dwattr $C$DW$758, DW_AT_TI_symbol_name("_Ki_Iq")
    8797                      .dwattr $C$DW$758, DW_AT_data_member_location[DW_OP_plus_uconst 0xd2]
    8798                      .dwattr $C$DW$758, DW_AT_accessibility(DW_ACCESS_public)
    8799              
    8800              $C$DW$759       .dwtag  DW_TAG_member
    8801                      .dwattr $C$DW$759, DW_AT_type(*$C$DW$T$32)
    8802                      .dwattr $C$DW$759, DW_AT_name("Ki_spd")
    8803                      .dwattr $C$DW$759, DW_AT_TI_symbol_name("_Ki_spd")
    8804                      .dwattr $C$DW$759, DW_AT_data_member_location[DW_OP_plus_uconst 0xd4]
    8805                      .dwattr $C$DW$759, DW_AT_accessibility(DW_ACCESS_public)
    8806              
    8807              $C$DW$760       .dwtag  DW_TAG_member
    8808                      .dwattr $C$DW$760, DW_AT_type(*$C$DW$T$32)
    8809                      .dwattr $C$DW$760, DW_AT_name("Kd_Id")
    8810                      .dwattr $C$DW$760, DW_AT_TI_symbol_name("_Kd_Id")
    8811                      .dwattr $C$DW$760, DW_AT_data_member_location[DW_OP_plus_uconst 0xd6]
    8812                      .dwattr $C$DW$760, DW_AT_accessibility(DW_ACCESS_public)
    8813              
    8814              $C$DW$761       .dwtag  DW_TAG_member
    8815                      .dwattr $C$DW$761, DW_AT_type(*$C$DW$T$32)
    8816                      .dwattr $C$DW$761, DW_AT_name("Kd_Iq")
    8817                      .dwattr $C$DW$761, DW_AT_TI_symbol_name("_Kd_Iq")
    8818                      .dwattr $C$DW$761, DW_AT_data_member_location[DW_OP_plus_uconst 0xd8]
    8819                      .dwattr $C$DW$761, DW_AT_accessibility(DW_ACCESS_public)
    8820              
    8821              $C$DW$762       .dwtag  DW_TAG_member
TMS320C2000 Assembler PC v15.12.3 Mon Sep 25 12:51:19 2017

Tools Copyright (c) 1996-2015 Texas Instruments Incorporated
C:\Users\wmj\AppData\Local\Temp\0412810                              PAGE  168

    8822                      .dwattr $C$DW$762, DW_AT_type(*$C$DW$T$32)
    8823                      .dwattr $C$DW$762, DW_AT_name("Kd_spd")
    8824                      .dwattr $C$DW$762, DW_AT_TI_symbol_name("_Kd_spd")
    8825                      .dwattr $C$DW$762, DW_AT_data_member_location[DW_OP_plus_uconst 0xda]
    8826                      .dwattr $C$DW$762, DW_AT_accessibility(DW_ACCESS_public)
    8827              
    8828              $C$DW$763       .dwtag  DW_TAG_member
    8829                      .dwattr $C$DW$763, DW_AT_type(*$C$DW$T$32)
    8830                      .dwattr $C$DW$763, DW_AT_name("Ui_Id")
    8831                      .dwattr $C$DW$763, DW_AT_TI_symbol_name("_Ui_Id")
    8832                      .dwattr $C$DW$763, DW_AT_data_member_location[DW_OP_plus_uconst 0xdc]
    8833                      .dwattr $C$DW$763, DW_AT_accessibility(DW_ACCESS_public)
    8834              
    8835              $C$DW$764       .dwtag  DW_TAG_member
    8836                      .dwattr $C$DW$764, DW_AT_type(*$C$DW$T$32)
    8837                      .dwattr $C$DW$764, DW_AT_name("Ui_Iq")
    8838                      .dwattr $C$DW$764, DW_AT_TI_symbol_name("_Ui_Iq")
    8839                      .dwattr $C$DW$764, DW_AT_data_member_location[DW_OP_plus_uconst 0xde]
    8840                      .dwattr $C$DW$764, DW_AT_accessibility(DW_ACCESS_public)
    8841              
    8842              $C$DW$765       .dwtag  DW_TAG_member
    8843                      .dwattr $C$DW$765, DW_AT_type(*$C$DW$T$32)
    8844                      .dwattr $C$DW$765, DW_AT_name("Ui_spd")
    8845                      .dwattr $C$DW$765, DW_AT_TI_symbol_name("_Ui_spd")
    8846                      .dwattr $C$DW$765, DW_AT_data_member_location[DW_OP_plus_uconst 0xe0]
    8847                      .dwattr $C$DW$765, DW_AT_accessibility(DW_ACCESS_public)
    8848              
    8849              $C$DW$766       .dwtag  DW_TAG_member
    8850                      .dwattr $C$DW$766, DW_AT_type(*$C$DW$T$33)
    8851                      .dwattr $C$DW$766, DW_AT_name("Idq_ref")
    8852                      .dwattr $C$DW$766, DW_AT_TI_symbol_name("_Idq_ref")
    8853                      .dwattr $C$DW$766, DW_AT_data_member_location[DW_OP_plus_uconst 0xe2]
    8854                      .dwattr $C$DW$766, DW_AT_accessibility(DW_ACCESS_public)
    8855              
    8856              $C$DW$767       .dwtag  DW_TAG_member
    8857                      .dwattr $C$DW$767, DW_AT_type(*$C$DW$T$32)
    8858                      .dwattr $C$DW$767, DW_AT_name("IdRated")
    8859                      .dwattr $C$DW$767, DW_AT_TI_symbol_name("_IdRated")
    8860                      .dwattr $C$DW$767, DW_AT_data_member_location[DW_OP_plus_uconst 0xe6]
    8861                      .dwattr $C$DW$767, DW_AT_accessibility(DW_ACCESS_public)
    8862              
    8863              $C$DW$768       .dwtag  DW_TAG_member
    8864                      .dwattr $C$DW$768, DW_AT_type(*$C$DW$T$32)
    8865                      .dwattr $C$DW$768, DW_AT_name("spd_ref")
    8866                      .dwattr $C$DW$768, DW_AT_TI_symbol_name("_spd_ref")
    8867                      .dwattr $C$DW$768, DW_AT_data_member_location[DW_OP_plus_uconst 0xe8]
    8868                      .dwattr $C$DW$768, DW_AT_accessibility(DW_ACCESS_public)
    8869              
    8870              $C$DW$769       .dwtag  DW_TAG_member
    8871                      .dwattr $C$DW$769, DW_AT_type(*$C$DW$T$32)
    8872                      .dwattr $C$DW$769, DW_AT_name("spd_max")
    8873                      .dwattr $C$DW$769, DW_AT_TI_symbol_name("_spd_max")
    8874                      .dwattr $C$DW$769, DW_AT_data_member_location[DW_OP_plus_uconst 0xea]
    8875                      .dwattr $C$DW$769, DW_AT_accessibility(DW_ACCESS_public)
    8876              
TMS320C2000 Assembler PC v15.12.3 Mon Sep 25 12:51:19 2017

Tools Copyright (c) 1996-2015 Texas Instruments Incorporated
C:\Users\wmj\AppData\Local\Temp\0412810                              PAGE  169

    8877              $C$DW$770       .dwtag  DW_TAG_member
    8878                      .dwattr $C$DW$770, DW_AT_type(*$C$DW$T$70)
    8879                      .dwattr $C$DW$770, DW_AT_name("counter_current")
    8880                      .dwattr $C$DW$770, DW_AT_TI_symbol_name("_counter_current")
    8881                      .dwattr $C$DW$770, DW_AT_data_member_location[DW_OP_plus_uconst 0xec]
    8882                      .dwattr $C$DW$770, DW_AT_accessibility(DW_ACCESS_public)
    8883              
    8884              $C$DW$771       .dwtag  DW_TAG_member
    8885                      .dwattr $C$DW$771, DW_AT_type(*$C$DW$T$70)
    8886                      .dwattr $C$DW$771, DW_AT_name("counter_isr")
    8887                      .dwattr $C$DW$771, DW_AT_TI_symbol_name("_counter_isr")
    8888                      .dwattr $C$DW$771, DW_AT_data_member_location[DW_OP_plus_uconst 0xed]
    8889                      .dwattr $C$DW$771, DW_AT_accessibility(DW_ACCESS_public)
    8890              
    8891              $C$DW$772       .dwtag  DW_TAG_member
    8892                      .dwattr $C$DW$772, DW_AT_type(*$C$DW$T$70)
    8893                      .dwattr $C$DW$772, DW_AT_name("counter_speed")
    8894                      .dwattr $C$DW$772, DW_AT_TI_symbol_name("_counter_speed")
    8895                      .dwattr $C$DW$772, DW_AT_data_member_location[DW_OP_plus_uconst 0xee]
    8896                      .dwattr $C$DW$772, DW_AT_accessibility(DW_ACCESS_public)
    8897              
    8898              $C$DW$773       .dwtag  DW_TAG_member
    8899                      .dwattr $C$DW$773, DW_AT_type(*$C$DW$T$70)
    8900                      .dwattr $C$DW$773, DW_AT_name("counter_traj")
    8901                      .dwattr $C$DW$773, DW_AT_TI_symbol_name("_counter_traj")
    8902                      .dwattr $C$DW$773, DW_AT_data_member_location[DW_OP_plus_uconst 0xef]
    8903                      .dwattr $C$DW$773, DW_AT_accessibility(DW_ACCESS_public)
    8904              
    8905              $C$DW$774       .dwtag  DW_TAG_member
    8906                      .dwattr $C$DW$774, DW_AT_type(*$C$DW$T$34)
    8907                      .dwattr $C$DW$774, DW_AT_name("flag_enableCtrl")
    8908                      .dwattr $C$DW$774, DW_AT_TI_symbol_name("_flag_enableCtrl")
    8909                      .dwattr $C$DW$774, DW_AT_data_member_location[DW_OP_plus_uconst 0xf0]
    8910                      .dwattr $C$DW$774, DW_AT_accessibility(DW_ACCESS_public)
    8911              
    8912              $C$DW$775       .dwtag  DW_TAG_member
    8913                      .dwattr $C$DW$775, DW_AT_type(*$C$DW$T$34)
    8914                      .dwattr $C$DW$775, DW_AT_name("flag_enableDcBusComp")
    8915                      .dwattr $C$DW$775, DW_AT_TI_symbol_name("_flag_enableDcBusComp")
    8916                      .dwattr $C$DW$775, DW_AT_data_member_location[DW_OP_plus_uconst 0xf1]
    8917                      .dwattr $C$DW$775, DW_AT_accessibility(DW_ACCESS_public)
    8918              
    8919              $C$DW$776       .dwtag  DW_TAG_member
    8920                      .dwattr $C$DW$776, DW_AT_type(*$C$DW$T$34)
    8921                      .dwattr $C$DW$776, DW_AT_name("flag_enablePowerWarp")
    8922                      .dwattr $C$DW$776, DW_AT_TI_symbol_name("_flag_enablePowerWarp")
    8923                      .dwattr $C$DW$776, DW_AT_data_member_location[DW_OP_plus_uconst 0xf2]
    8924                      .dwattr $C$DW$776, DW_AT_accessibility(DW_ACCESS_public)
    8925              
    8926              $C$DW$777       .dwtag  DW_TAG_member
    8927                      .dwattr $C$DW$777, DW_AT_type(*$C$DW$T$34)
    8928                      .dwattr $C$DW$777, DW_AT_name("flag_enableOffset")
    8929                      .dwattr $C$DW$777, DW_AT_TI_symbol_name("_flag_enableOffset")
    8930                      .dwattr $C$DW$777, DW_AT_data_member_location[DW_OP_plus_uconst 0xf3]
    8931                      .dwattr $C$DW$777, DW_AT_accessibility(DW_ACCESS_public)
TMS320C2000 Assembler PC v15.12.3 Mon Sep 25 12:51:19 2017

Tools Copyright (c) 1996-2015 Texas Instruments Incorporated
C:\Users\wmj\AppData\Local\Temp\0412810                              PAGE  170

    8932              
    8933              $C$DW$778       .dwtag  DW_TAG_member
    8934                      .dwattr $C$DW$778, DW_AT_type(*$C$DW$T$34)
    8935                      .dwattr $C$DW$778, DW_AT_name("flag_enableSpeedCtrl")
    8936                      .dwattr $C$DW$778, DW_AT_TI_symbol_name("_flag_enableSpeedCtrl")
    8937                      .dwattr $C$DW$778, DW_AT_data_member_location[DW_OP_plus_uconst 0xf4]
    8938                      .dwattr $C$DW$778, DW_AT_accessibility(DW_ACCESS_public)
    8939              
    8940              $C$DW$779       .dwtag  DW_TAG_member
    8941                      .dwattr $C$DW$779, DW_AT_type(*$C$DW$T$34)
    8942                      .dwattr $C$DW$779, DW_AT_name("flag_enableUserMotorParams")
    8943                      .dwattr $C$DW$779, DW_AT_TI_symbol_name("_flag_enableUserMotorParams")
    8944                      .dwattr $C$DW$779, DW_AT_data_member_location[DW_OP_plus_uconst 0xf5]
    8945                      .dwattr $C$DW$779, DW_AT_accessibility(DW_ACCESS_public)
    8946              
    8947              $C$DW$780       .dwtag  DW_TAG_member
    8948                      .dwattr $C$DW$780, DW_AT_type(*$C$DW$T$33)
    8949                      .dwattr $C$DW$780, DW_AT_name("Idq_offset_pu")
    8950                      .dwattr $C$DW$780, DW_AT_TI_symbol_name("_Idq_offset_pu")
    8951                      .dwattr $C$DW$780, DW_AT_data_member_location[DW_OP_plus_uconst 0xf6]
    8952                      .dwattr $C$DW$780, DW_AT_accessibility(DW_ACCESS_public)
    8953              
    8954              $C$DW$781       .dwtag  DW_TAG_member
    8955                      .dwattr $C$DW$781, DW_AT_type(*$C$DW$T$33)
    8956                      .dwattr $C$DW$781, DW_AT_name("Vdq_offset_pu")
    8957                      .dwattr $C$DW$781, DW_AT_TI_symbol_name("_Vdq_offset_pu")
    8958                      .dwattr $C$DW$781, DW_AT_data_member_location[DW_OP_plus_uconst 0xfa]
    8959                      .dwattr $C$DW$781, DW_AT_accessibility(DW_ACCESS_public)
    8960              
    8961              $C$DW$782       .dwtag  DW_TAG_member
    8962                      .dwattr $C$DW$782, DW_AT_type(*$C$DW$T$32)
    8963                      .dwattr $C$DW$782, DW_AT_name("angle_pu")
    8964                      .dwattr $C$DW$782, DW_AT_TI_symbol_name("_angle_pu")
    8965                      .dwattr $C$DW$782, DW_AT_data_member_location[DW_OP_plus_uconst 0xfe]
    8966                      .dwattr $C$DW$782, DW_AT_accessibility(DW_ACCESS_public)
    8967              
    8968              $C$DW$783       .dwtag  DW_TAG_member
    8969                      .dwattr $C$DW$783, DW_AT_type(*$C$DW$T$32)
    8970                      .dwattr $C$DW$783, DW_AT_name("speed_ref_pu")
    8971                      .dwattr $C$DW$783, DW_AT_TI_symbol_name("_speed_ref_pu")
    8972                      .dwattr $C$DW$783, DW_AT_data_member_location[DW_OP_plus_uconst 0x100]
    8973                      .dwattr $C$DW$783, DW_AT_accessibility(DW_ACCESS_public)
    8974              
    8975              $C$DW$784       .dwtag  DW_TAG_member
    8976                      .dwattr $C$DW$784, DW_AT_type(*$C$DW$T$32)
    8977                      .dwattr $C$DW$784, DW_AT_name("speed_fb_pu")
    8978                      .dwattr $C$DW$784, DW_AT_TI_symbol_name("_speed_fb_pu")
    8979                      .dwattr $C$DW$784, DW_AT_data_member_location[DW_OP_plus_uconst 0x102]
    8980                      .dwattr $C$DW$784, DW_AT_accessibility(DW_ACCESS_public)
    8981              
    8982              $C$DW$785       .dwtag  DW_TAG_member
    8983                      .dwattr $C$DW$785, DW_AT_type(*$C$DW$T$32)
    8984                      .dwattr $C$DW$785, DW_AT_name("speed_outMax_pu")
    8985                      .dwattr $C$DW$785, DW_AT_TI_symbol_name("_speed_outMax_pu")
    8986                      .dwattr $C$DW$785, DW_AT_data_member_location[DW_OP_plus_uconst 0x104]
TMS320C2000 Assembler PC v15.12.3 Mon Sep 25 12:51:19 2017

Tools Copyright (c) 1996-2015 Texas Instruments Incorporated
C:\Users\wmj\AppData\Local\Temp\0412810                              PAGE  171

    8987                      .dwattr $C$DW$785, DW_AT_accessibility(DW_ACCESS_public)
    8988              
    8989              $C$DW$786       .dwtag  DW_TAG_member
    8990                      .dwattr $C$DW$786, DW_AT_type(*$C$DW$T$34)
    8991                      .dwattr $C$DW$786, DW_AT_name("flag_enableCurrentCtrl")
    8992                      .dwattr $C$DW$786, DW_AT_TI_symbol_name("_flag_enableCurrentCtrl")
    8993                      .dwattr $C$DW$786, DW_AT_data_member_location[DW_OP_plus_uconst 0x106]
    8994                      .dwattr $C$DW$786, DW_AT_accessibility(DW_ACCESS_public)
    8995              
    8996              $C$DW$787       .dwtag  DW_TAG_member
    8997                      .dwattr $C$DW$787, DW_AT_type(*$C$DW$T$73)
    8998                      .dwattr $C$DW$787, DW_AT_name("brakeHandle")
    8999                      .dwattr $C$DW$787, DW_AT_TI_symbol_name("_brakeHandle")
    9000                      .dwattr $C$DW$787, DW_AT_data_member_location[DW_OP_plus_uconst 0x108]
    9001                      .dwattr $C$DW$787, DW_AT_accessibility(DW_ACCESS_public)
    9002              
    9003              $C$DW$788       .dwtag  DW_TAG_member
    9004                      .dwattr $C$DW$788, DW_AT_type(*$C$DW$T$74)
    9005                      .dwattr $C$DW$788, DW_AT_name("brake")
    9006                      .dwattr $C$DW$788, DW_AT_TI_symbol_name("_brake")
    9007                      .dwattr $C$DW$788, DW_AT_data_member_location[DW_OP_plus_uconst 0x10a]
    9008                      .dwattr $C$DW$788, DW_AT_accessibility(DW_ACCESS_public)
    9009              
    9010                      .dwendtag $C$DW$T$75
    9011              
    9012              $C$DW$T$191     .dwtag  DW_TAG_typedef
    9013                      .dwattr $C$DW$T$191, DW_AT_name("CTRL_Obj")
    9014                      .dwattr $C$DW$T$191, DW_AT_type(*$C$DW$T$75)
    9015                      .dwattr $C$DW$T$191, DW_AT_language(DW_LANG_C)
    9016              
    9017              $C$DW$T$172     .dwtag  DW_TAG_pointer_type
    9018                      .dwattr $C$DW$T$172, DW_AT_type(*$C$DW$T$75)
    9019                      .dwattr $C$DW$T$172, DW_AT_address_class(0x20)
    9020              
    9021              $C$DW$T$173     .dwtag  DW_TAG_typedef
    9022                      .dwattr $C$DW$T$173, DW_AT_name("CTRL_Handle")
    9023                      .dwattr $C$DW$T$173, DW_AT_type(*$C$DW$T$172)
    9024                      .dwattr $C$DW$T$173, DW_AT_language(DW_LANG_C)
    9025              
    9026              $C$DW$789       .dwtag  DW_TAG_TI_far_type
    9027                      .dwattr $C$DW$789, DW_AT_type(*$C$DW$T$173)
    9028              
    9029              $C$DW$T$192     .dwtag  DW_TAG_const_type
    9030                      .dwattr $C$DW$T$192, DW_AT_type(*$C$DW$789)
    9031              
    9032              
    9033              $C$DW$T$78      .dwtag  DW_TAG_structure_type
    9034                      .dwattr $C$DW$T$78, DW_AT_name("_CTRL_Version_")
    9035                      .dwattr $C$DW$T$78, DW_AT_byte_size(0x04)
    9036              $C$DW$790       .dwtag  DW_TAG_member
    9037                      .dwattr $C$DW$790, DW_AT_type(*$C$DW$T$23)
    9038                      .dwattr $C$DW$790, DW_AT_name("rsvd")
    9039                      .dwattr $C$DW$790, DW_AT_TI_symbol_name("_rsvd")
    9040                      .dwattr $C$DW$790, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    9041                      .dwattr $C$DW$790, DW_AT_accessibility(DW_ACCESS_public)
TMS320C2000 Assembler PC v15.12.3 Mon Sep 25 12:51:19 2017

Tools Copyright (c) 1996-2015 Texas Instruments Incorporated
C:\Users\wmj\AppData\Local\Temp\0412810                              PAGE  172

    9042              
    9043              $C$DW$791       .dwtag  DW_TAG_member
    9044                      .dwattr $C$DW$791, DW_AT_type(*$C$DW$T$77)
    9045                      .dwattr $C$DW$791, DW_AT_name("targetProc")
    9046                      .dwattr $C$DW$791, DW_AT_TI_symbol_name("_targetProc")
    9047                      .dwattr $C$DW$791, DW_AT_data_member_location[DW_OP_plus_uconst 0x1]
    9048                      .dwattr $C$DW$791, DW_AT_accessibility(DW_ACCESS_public)
    9049              
    9050              $C$DW$792       .dwtag  DW_TAG_member
    9051                      .dwattr $C$DW$792, DW_AT_type(*$C$DW$T$23)
    9052                      .dwattr $C$DW$792, DW_AT_name("major")
    9053                      .dwattr $C$DW$792, DW_AT_TI_symbol_name("_major")
    9054                      .dwattr $C$DW$792, DW_AT_data_member_location[DW_OP_plus_uconst 0x2]
    9055                      .dwattr $C$DW$792, DW_AT_accessibility(DW_ACCESS_public)
    9056              
    9057              $C$DW$793       .dwtag  DW_TAG_member
    9058                      .dwattr $C$DW$793, DW_AT_type(*$C$DW$T$23)
    9059                      .dwattr $C$DW$793, DW_AT_name("minor")
    9060                      .dwattr $C$DW$793, DW_AT_TI_symbol_name("_minor")
    9061                      .dwattr $C$DW$793, DW_AT_data_member_location[DW_OP_plus_uconst 0x3]
    9062                      .dwattr $C$DW$793, DW_AT_accessibility(DW_ACCESS_public)
    9063              
    9064                      .dwendtag $C$DW$T$78
    9065              
    9066              $C$DW$T$41      .dwtag  DW_TAG_typedef
    9067                      .dwattr $C$DW$T$41, DW_AT_name("CTRL_Version")
    9068                      .dwattr $C$DW$T$41, DW_AT_type(*$C$DW$T$78)
    9069                      .dwattr $C$DW$T$41, DW_AT_language(DW_LANG_C)
    9070              
    9071              
    9072              $C$DW$T$20      .dwtag  DW_TAG_structure_type
    9073                      .dwattr $C$DW$T$20, DW_AT_name("_EST_Obj_")
    9074                      .dwattr $C$DW$T$20, DW_AT_declaration
    9075                      .dwendtag $C$DW$T$20
    9076              
    9077              $C$DW$T$49      .dwtag  DW_TAG_pointer_type
    9078                      .dwattr $C$DW$T$49, DW_AT_type(*$C$DW$T$20)
    9079                      .dwattr $C$DW$T$49, DW_AT_address_class(0x20)
    9080              
    9081              $C$DW$T$50      .dwtag  DW_TAG_typedef
    9082                      .dwattr $C$DW$T$50, DW_AT_name("EST_Handle")
    9083                      .dwattr $C$DW$T$50, DW_AT_type(*$C$DW$T$49)
    9084                      .dwattr $C$DW$T$50, DW_AT_language(DW_LANG_C)
    9085              
    9086              
    9087              $C$DW$T$79      .dwtag  DW_TAG_structure_type
    9088                      .dwattr $C$DW$T$79, DW_AT_name("_FILTER_FO_")
    9089                      .dwattr $C$DW$T$79, DW_AT_byte_size(0x0a)
    9090              $C$DW$794       .dwtag  DW_TAG_member
    9091                      .dwattr $C$DW$794, DW_AT_type(*$C$DW$T$32)
    9092                      .dwattr $C$DW$794, DW_AT_name("a1")
    9093                      .dwattr $C$DW$794, DW_AT_TI_symbol_name("_a1")
    9094                      .dwattr $C$DW$794, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    9095                      .dwattr $C$DW$794, DW_AT_accessibility(DW_ACCESS_public)
    9096              
TMS320C2000 Assembler PC v15.12.3 Mon Sep 25 12:51:19 2017

Tools Copyright (c) 1996-2015 Texas Instruments Incorporated
C:\Users\wmj\AppData\Local\Temp\0412810                              PAGE  173

    9097              $C$DW$795       .dwtag  DW_TAG_member
    9098                      .dwattr $C$DW$795, DW_AT_type(*$C$DW$T$32)
    9099                      .dwattr $C$DW$795, DW_AT_name("b0")
    9100                      .dwattr $C$DW$795, DW_AT_TI_symbol_name("_b0")
    9101                      .dwattr $C$DW$795, DW_AT_data_member_location[DW_OP_plus_uconst 0x2]
    9102                      .dwattr $C$DW$795, DW_AT_accessibility(DW_ACCESS_public)
    9103              
    9104              $C$DW$796       .dwtag  DW_TAG_member
    9105                      .dwattr $C$DW$796, DW_AT_type(*$C$DW$T$32)
    9106                      .dwattr $C$DW$796, DW_AT_name("b1")
    9107                      .dwattr $C$DW$796, DW_AT_TI_symbol_name("_b1")
    9108                      .dwattr $C$DW$796, DW_AT_data_member_location[DW_OP_plus_uconst 0x4]
    9109                      .dwattr $C$DW$796, DW_AT_accessibility(DW_ACCESS_public)
    9110              
    9111              $C$DW$797       .dwtag  DW_TAG_member
    9112                      .dwattr $C$DW$797, DW_AT_type(*$C$DW$T$32)
    9113                      .dwattr $C$DW$797, DW_AT_name("x1")
    9114                      .dwattr $C$DW$797, DW_AT_TI_symbol_name("_x1")
    9115                      .dwattr $C$DW$797, DW_AT_data_member_location[DW_OP_plus_uconst 0x6]
    9116                      .dwattr $C$DW$797, DW_AT_accessibility(DW_ACCESS_public)
    9117              
    9118              $C$DW$798       .dwtag  DW_TAG_member
    9119                      .dwattr $C$DW$798, DW_AT_type(*$C$DW$T$32)
    9120                      .dwattr $C$DW$798, DW_AT_name("y1")
    9121                      .dwattr $C$DW$798, DW_AT_TI_symbol_name("_y1")
    9122                      .dwattr $C$DW$798, DW_AT_data_member_location[DW_OP_plus_uconst 0x8]
    9123                      .dwattr $C$DW$798, DW_AT_accessibility(DW_ACCESS_public)
    9124              
    9125                      .dwendtag $C$DW$T$79
    9126              
    9127              $C$DW$T$137     .dwtag  DW_TAG_typedef
    9128                      .dwattr $C$DW$T$137, DW_AT_name("FILTER_FO_Obj")
    9129                      .dwattr $C$DW$T$137, DW_AT_type(*$C$DW$T$79)
    9130                      .dwattr $C$DW$T$137, DW_AT_language(DW_LANG_C)
    9131              
    9132              $C$DW$T$194     .dwtag  DW_TAG_pointer_type
    9133                      .dwattr $C$DW$T$194, DW_AT_type(*$C$DW$T$137)
    9134                      .dwattr $C$DW$T$194, DW_AT_address_class(0x20)
    9135              
    9136              
    9137              $C$DW$T$21      .dwtag  DW_TAG_structure_type
    9138                      .dwattr $C$DW$T$21, DW_AT_name("_FILTER_FO_Obj_")
    9139                      .dwattr $C$DW$T$21, DW_AT_declaration
    9140                      .dwendtag $C$DW$T$21
    9141              
    9142              $C$DW$T$138     .dwtag  DW_TAG_pointer_type
    9143                      .dwattr $C$DW$T$138, DW_AT_type(*$C$DW$T$21)
    9144                      .dwattr $C$DW$T$138, DW_AT_address_class(0x20)
    9145              
    9146              $C$DW$T$139     .dwtag  DW_TAG_typedef
    9147                      .dwattr $C$DW$T$139, DW_AT_name("FILTER_FO_Handle")
    9148                      .dwattr $C$DW$T$139, DW_AT_type(*$C$DW$T$138)
    9149                      .dwattr $C$DW$T$139, DW_AT_language(DW_LANG_C)
    9150              
    9151              
TMS320C2000 Assembler PC v15.12.3 Mon Sep 25 12:51:19 2017

Tools Copyright (c) 1996-2015 Texas Instruments Incorporated
C:\Users\wmj\AppData\Local\Temp\0412810                              PAGE  174

    9152              $C$DW$T$80      .dwtag  DW_TAG_structure_type
    9153                      .dwattr $C$DW$T$80, DW_AT_name("_FLASH_Obj_")
    9154                      .dwattr $C$DW$T$80, DW_AT_byte_size(0x08)
    9155              $C$DW$799       .dwtag  DW_TAG_member
    9156                      .dwattr $C$DW$799, DW_AT_type(*$C$DW$T$24)
    9157                      .dwattr $C$DW$799, DW_AT_name("FOPT")
    9158                      .dwattr $C$DW$799, DW_AT_TI_symbol_name("_FOPT")
    9159                      .dwattr $C$DW$799, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    9160                      .dwattr $C$DW$799, DW_AT_accessibility(DW_ACCESS_public)
    9161              
    9162              $C$DW$800       .dwtag  DW_TAG_member
    9163                      .dwattr $C$DW$800, DW_AT_type(*$C$DW$T$24)
    9164                      .dwattr $C$DW$800, DW_AT_name("rsvd_1")
    9165                      .dwattr $C$DW$800, DW_AT_TI_symbol_name("_rsvd_1")
    9166                      .dwattr $C$DW$800, DW_AT_data_member_location[DW_OP_plus_uconst 0x1]
    9167                      .dwattr $C$DW$800, DW_AT_accessibility(DW_ACCESS_public)
    9168              
    9169              $C$DW$801       .dwtag  DW_TAG_member
    9170                      .dwattr $C$DW$801, DW_AT_type(*$C$DW$T$24)
    9171                      .dwattr $C$DW$801, DW_AT_name("FPWR")
    9172                      .dwattr $C$DW$801, DW_AT_TI_symbol_name("_FPWR")
    9173                      .dwattr $C$DW$801, DW_AT_data_member_location[DW_OP_plus_uconst 0x2]
    9174                      .dwattr $C$DW$801, DW_AT_accessibility(DW_ACCESS_public)
    9175              
    9176              $C$DW$802       .dwtag  DW_TAG_member
    9177                      .dwattr $C$DW$802, DW_AT_type(*$C$DW$T$24)
    9178                      .dwattr $C$DW$802, DW_AT_name("FSTATUS")
    9179                      .dwattr $C$DW$802, DW_AT_TI_symbol_name("_FSTATUS")
    9180                      .dwattr $C$DW$802, DW_AT_data_member_location[DW_OP_plus_uconst 0x3]
    9181                      .dwattr $C$DW$802, DW_AT_accessibility(DW_ACCESS_public)
    9182              
    9183              $C$DW$803       .dwtag  DW_TAG_member
    9184                      .dwattr $C$DW$803, DW_AT_type(*$C$DW$T$24)
    9185                      .dwattr $C$DW$803, DW_AT_name("FSTDBYWAIT")
    9186                      .dwattr $C$DW$803, DW_AT_TI_symbol_name("_FSTDBYWAIT")
    9187                      .dwattr $C$DW$803, DW_AT_data_member_location[DW_OP_plus_uconst 0x4]
    9188                      .dwattr $C$DW$803, DW_AT_accessibility(DW_ACCESS_public)
    9189              
    9190              $C$DW$804       .dwtag  DW_TAG_member
    9191                      .dwattr $C$DW$804, DW_AT_type(*$C$DW$T$24)
    9192                      .dwattr $C$DW$804, DW_AT_name("FACTIVEWAIT")
    9193                      .dwattr $C$DW$804, DW_AT_TI_symbol_name("_FACTIVEWAIT")
    9194                      .dwattr $C$DW$804, DW_AT_data_member_location[DW_OP_plus_uconst 0x5]
    9195                      .dwattr $C$DW$804, DW_AT_accessibility(DW_ACCESS_public)
    9196              
    9197              $C$DW$805       .dwtag  DW_TAG_member
    9198                      .dwattr $C$DW$805, DW_AT_type(*$C$DW$T$24)
    9199                      .dwattr $C$DW$805, DW_AT_name("FBANKWAIT")
    9200                      .dwattr $C$DW$805, DW_AT_TI_symbol_name("_FBANKWAIT")
    9201                      .dwattr $C$DW$805, DW_AT_data_member_location[DW_OP_plus_uconst 0x6]
    9202                      .dwattr $C$DW$805, DW_AT_accessibility(DW_ACCESS_public)
    9203              
    9204              $C$DW$806       .dwtag  DW_TAG_member
    9205                      .dwattr $C$DW$806, DW_AT_type(*$C$DW$T$24)
    9206                      .dwattr $C$DW$806, DW_AT_name("FOTPWAIT")
TMS320C2000 Assembler PC v15.12.3 Mon Sep 25 12:51:19 2017

Tools Copyright (c) 1996-2015 Texas Instruments Incorporated
C:\Users\wmj\AppData\Local\Temp\0412810                              PAGE  175

    9207                      .dwattr $C$DW$806, DW_AT_TI_symbol_name("_FOTPWAIT")
    9208                      .dwattr $C$DW$806, DW_AT_data_member_location[DW_OP_plus_uconst 0x7]
    9209                      .dwattr $C$DW$806, DW_AT_accessibility(DW_ACCESS_public)
    9210              
    9211                      .dwendtag $C$DW$T$80
    9212              
    9213              $C$DW$T$93      .dwtag  DW_TAG_pointer_type
    9214                      .dwattr $C$DW$T$93, DW_AT_type(*$C$DW$T$80)
    9215                      .dwattr $C$DW$T$93, DW_AT_address_class(0x20)
    9216              
    9217              $C$DW$T$94      .dwtag  DW_TAG_typedef
    9218                      .dwattr $C$DW$T$94, DW_AT_name("FLASH_Handle")
    9219                      .dwattr $C$DW$T$94, DW_AT_type(*$C$DW$T$93)
    9220                      .dwattr $C$DW$T$94, DW_AT_language(DW_LANG_C)
    9221              
    9222              
    9223              $C$DW$T$84      .dwtag  DW_TAG_structure_type
    9224                      .dwattr $C$DW$T$84, DW_AT_name("_GPIO_Obj_")
    9225                      .dwattr $C$DW$T$84, DW_AT_byte_size(0x6a)
    9226              $C$DW$807       .dwtag  DW_TAG_member
    9227                      .dwattr $C$DW$807, DW_AT_type(*$C$DW$T$81)
    9228                      .dwattr $C$DW$807, DW_AT_name("GPACTRL")
    9229                      .dwattr $C$DW$807, DW_AT_TI_symbol_name("_GPACTRL")
    9230                      .dwattr $C$DW$807, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    9231                      .dwattr $C$DW$807, DW_AT_accessibility(DW_ACCESS_public)
    9232              
    9233              $C$DW$808       .dwtag  DW_TAG_member
    9234                      .dwattr $C$DW$808, DW_AT_type(*$C$DW$T$81)
    9235                      .dwattr $C$DW$808, DW_AT_name("GPAQSEL1")
    9236                      .dwattr $C$DW$808, DW_AT_TI_symbol_name("_GPAQSEL1")
    9237                      .dwattr $C$DW$808, DW_AT_data_member_location[DW_OP_plus_uconst 0x2]
    9238                      .dwattr $C$DW$808, DW_AT_accessibility(DW_ACCESS_public)
    9239              
    9240              $C$DW$809       .dwtag  DW_TAG_member
    9241                      .dwattr $C$DW$809, DW_AT_type(*$C$DW$T$81)
    9242                      .dwattr $C$DW$809, DW_AT_name("GPAQSEL2")
    9243                      .dwattr $C$DW$809, DW_AT_TI_symbol_name("_GPAQSEL2")
    9244                      .dwattr $C$DW$809, DW_AT_data_member_location[DW_OP_plus_uconst 0x4]
    9245                      .dwattr $C$DW$809, DW_AT_accessibility(DW_ACCESS_public)
    9246              
    9247              $C$DW$810       .dwtag  DW_TAG_member
    9248                      .dwattr $C$DW$810, DW_AT_type(*$C$DW$T$81)
    9249                      .dwattr $C$DW$810, DW_AT_name("GPAMUX1")
