TMS320C2000 Assembler PC v15.12.3 Tue Aug 29 09:30:33 2017

Tools Copyright (c) 1996-2015 Texas Instruments Incorporated
C:\Users\wmj\AppData\Local\Temp\0326810                              PAGE    1

       1              ;***************************************************************
       2              ;* TMS320C2000 C/C++ Codegen                   PC v15.12.3.LTS *
       3              ;* Date/Time created: Tue Aug 29 09:30:32 2017                 *
       4              ;***************************************************************
       5                      .compiler_opts --abi=coffabi --float_support=softlib --hll_source=on --mem_model:code=flat --mem_mode
       6        0002  FP      .set    XAR2
       7              
       8              $C$DW$CU        .dwtag  DW_TAG_compile_unit
       9                      .dwattr $C$DW$CU, DW_AT_name("D:/FOC_27/sw/modules/hal/boards/hvkit_rev1p1/f28x/f2802x/src/hal.c")
      10                      .dwattr $C$DW$CU, DW_AT_producer("TI TMS320C2000 C/C++ Codegen PC v15.12.3.LTS Copyright (c) 1996-201
      11                      .dwattr $C$DW$CU, DW_AT_TI_version(0x01)
      12                      .dwattr $C$DW$CU, DW_AT_comp_dir("D:\FOC_27\sw\solutions\instaspin_foc\boards\hvkit_rev1p1\f28x\f2802
      13              
      14              $C$DW$1 .dwtag  DW_TAG_subprogram
      15                      .dwattr $C$DW$1, DW_AT_name("SPI_setClkPolarity")

   13206              $C$DW$T$316     .dwtag  DW_TAG_const_type
   13207                      .dwattr $C$DW$T$316, DW_AT_type(*$C$DW$1771)
   13208              
   13209              
   13210              $C$DW$T$317     .dwtag  DW_TAG_enumeration_type
   13211                      .dwattr $C$DW$T$317, DW_AT_byte_size(0x01)
   13212              $C$DW$1772      .dwtag  DW_TAG_enumerator
   13213                      .dwattr $C$DW$1772, DW_AT_name("SCI_NumStopBits_One")
   13214                      .dwattr $C$DW$1772, DW_AT_const_value(0x00)
   13215              
   13216              $C$DW$1773      .dwtag  DW_TAG_enumerator
   13217                      .dwattr $C$DW$1773, DW_AT_name("SCI_NumStopBits_Two")
   13218                      .dwattr $C$DW$1773, DW_AT_const_value(0x80)
   13219              
   13220                      .dwendtag $C$DW$T$317
   13221              
   13222              $C$DW$T$318     .dwtag  DW_TAG_typedef
   13223                      .dwattr $C$DW$T$318, DW_AT_name("SCI_NumStopBits_e")
   13224                      .dwattr $C$DW$T$318, DW_AT_type(*$C$DW$T$317)
   13225                      .dwattr $C$DW$T$318, DW_AT_language(DW_LANG_C)
   13226              
   13227              $C$DW$1774      .dwtag  DW_TAG_TI_far_type
   13228                      .dwattr $C$DW$1774, DW_AT_type(*$C$DW$T$318)
   13229              
   13230              $C$DW$T$319     .dwtag  DW_TAG_const_type
   13231                      .dwattr $C$DW$T$319, DW_AT_type(*$C$DW$1774)
   13232              
   13233              
   13234              $C$DW$T$320     .dwtag  DW_TAG_enumeration_type
   13235                      .dwattr $C$DW$T$320, DW_AT_byte_size(0x01)
   13236              $C$DW$1775      .dwtag  DW_TAG_enumerator
   13237                      .dwattr $C$DW$1775, DW_AT_name("SCI_Priority_Immediate")
   13238                      .dwattr $C$DW$1775, DW_AT_const_value(0x00)
   13239              
   13240              $C$DW$1776      .dwtag  DW_TAG_enumerator
   13241                      .dwattr $C$DW$1776, DW_AT_name("SCI_Priority_FreeRun")
   13242                      .dwattr $C$DW$1776, DW_AT_const_value(0x08)
   13243              
TMS320C2000 Assembler PC v15.12.3 Tue Aug 29 09:30:33 2017

Tools Copyright (c) 1996-2015 Texas Instruments Incorporated
C:\Users\wmj\AppData\Local\Temp\0326810                              PAGE  251

   13244              $C$DW$1777      .dwtag  DW_TAG_enumerator
   13245                      .dwattr $C$DW$1777, DW_AT_name("SCI_Priority_AfterRxRxSeq")
   13246                      .dwattr $C$DW$1777, DW_AT_const_value(0x10)
   13247              
   13248                      .dwendtag $C$DW$T$320
   13249              
   13250              $C$DW$T$321     .dwtag  DW_TAG_typedef
   13251                      .dwattr $C$DW$T$321, DW_AT_name("SCI_Priority_e")
   13252                      .dwattr $C$DW$T$321, DW_AT_type(*$C$DW$T$320)
   13253                      .dwattr $C$DW$T$321, DW_AT_language(DW_LANG_C)
   13254              
   13255              $C$DW$1778      .dwtag  DW_TAG_TI_far_type
   13256                      .dwattr $C$DW$1778, DW_AT_type(*$C$DW$T$321)
   13257              
   13258              $C$DW$T$322     .dwtag  DW_TAG_const_type
   13259                      .dwattr $C$DW$T$322, DW_AT_type(*$C$DW$1778)
   13260              
   13261              
   13262              $C$DW$T$323     .dwtag  DW_TAG_enumeration_type
   13263                      .dwattr $C$DW$T$323, DW_AT_byte_size(0x01)
   13264              $C$DW$1779      .dwtag  DW_TAG_enumerator
   13265                      .dwattr $C$DW$1779, DW_AT_name("HAL_SensorType_Current")
   13266                      .dwattr $C$DW$1779, DW_AT_const_value(0x00)
   13267              
   13268              $C$DW$1780      .dwtag  DW_TAG_enumerator
   13269                      .dwattr $C$DW$1780, DW_AT_name("HAL_SensorType_Voltage")
   13270                      .dwattr $C$DW$1780, DW_AT_const_value(0x01)
   13271              
   13272                      .dwendtag $C$DW$T$323
   13273              
   13274              $C$DW$T$324     .dwtag  DW_TAG_typedef
   13275                      .dwattr $C$DW$T$324, DW_AT_name("HAL_SensorType_e")
   13276                      .dwattr $C$DW$T$324, DW_AT_type(*$C$DW$T$323)
   13277                      .dwattr $C$DW$T$324, DW_AT_language(DW_LANG_C)
   13278              
   13279              
   13280              $C$DW$T$19      .dwtag  DW_TAG_structure_type
   13281                      .dwattr $C$DW$T$19, DW_AT_name("I2C_Obj")
   13282                      .dwattr $C$DW$T$19, DW_AT_declaration
   13283                      .dwendtag $C$DW$T$19
   13284              
   13285              $C$DW$T$79      .dwtag  DW_TAG_pointer_type
   13286                      .dwattr $C$DW$T$79, DW_AT_type(*$C$DW$T$19)
   13287                      .dwattr $C$DW$T$79, DW_AT_address_class(0x20)
   13288              
   13289              $C$DW$T$80      .dwtag  DW_TAG_typedef
   13290                      .dwattr $C$DW$T$80, DW_AT_name("I2C_Handle")
   13291                      .dwattr $C$DW$T$80, DW_AT_type(*$C$DW$T$79)
   13292                      .dwattr $C$DW$T$80, DW_AT_language(DW_LANG_C)
   13293              
   13294              
   13295              $C$DW$T$30      .dwtag  DW_TAG_structure_type
   13296                      .dwattr $C$DW$T$30, DW_AT_name("_ADC_Obj_")
   13297                      .dwattr $C$DW$T$30, DW_AT_byte_size(0x6650)
   13298              $C$DW$1781      .dwtag  DW_TAG_member
TMS320C2000 Assembler PC v15.12.3 Tue Aug 29 09:30:33 2017

Tools Copyright (c) 1996-2015 Texas Instruments Incorporated
C:\Users\wmj\AppData\Local\Temp\0326810                              PAGE  252

   13299                      .dwattr $C$DW$1781, DW_AT_type(*$C$DW$T$24)
   13300                      .dwattr $C$DW$1781, DW_AT_name("ADCRESULT")
   13301                      .dwattr $C$DW$1781, DW_AT_TI_symbol_name("_ADCRESULT")
   13302                      .dwattr $C$DW$1781, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
   13303                      .dwattr $C$DW$1781, DW_AT_accessibility(DW_ACCESS_public)
   13304              
   13305              $C$DW$1782      .dwtag  DW_TAG_member
   13306                      .dwattr $C$DW$1782, DW_AT_type(*$C$DW$T$25)
   13307                      .dwattr $C$DW$1782, DW_AT_name("resvd_1")
   13308                      .dwattr $C$DW$1782, DW_AT_TI_symbol_name("_resvd_1")
   13309                      .dwattr $C$DW$1782, DW_AT_data_member_location[DW_OP_plus_uconst 0x10]
   13310                      .dwattr $C$DW$1782, DW_AT_accessibility(DW_ACCESS_public)
   13311              
   13312              $C$DW$1783      .dwtag  DW_TAG_member
   13313                      .dwattr $C$DW$1783, DW_AT_type(*$C$DW$T$23)
   13314                      .dwattr $C$DW$1783, DW_AT_name("ADCCTL1")
   13315                      .dwattr $C$DW$1783, DW_AT_TI_symbol_name("_ADCCTL1")
   13316                      .dwattr $C$DW$1783, DW_AT_data_member_location[DW_OP_plus_uconst 0x6600]
   13317                      .dwattr $C$DW$1783, DW_AT_accessibility(DW_ACCESS_public)
   13318              
   13319              $C$DW$1784      .dwtag  DW_TAG_member
   13320                      .dwattr $C$DW$1784, DW_AT_type(*$C$DW$T$23)
   13321                      .dwattr $C$DW$1784, DW_AT_name("ADCCTL2")
   13322                      .dwattr $C$DW$1784, DW_AT_TI_symbol_name("_ADCCTL2")
   13323                      .dwattr $C$DW$1784, DW_AT_data_member_location[DW_OP_plus_uconst 0x6601]
   13324                      .dwattr $C$DW$1784, DW_AT_accessibility(DW_ACCESS_public)
   13325              
   13326              $C$DW$1785      .dwtag  DW_TAG_member
   13327                      .dwattr $C$DW$1785, DW_AT_type(*$C$DW$T$26)
   13328                      .dwattr $C$DW$1785, DW_AT_name("rsvd_2")
   13329                      .dwattr $C$DW$1785, DW_AT_TI_symbol_name("_rsvd_2")
   13330                      .dwattr $C$DW$1785, DW_AT_data_member_location[DW_OP_plus_uconst 0x6602]
   13331                      .dwattr $C$DW$1785, DW_AT_accessibility(DW_ACCESS_public)
   13332              
   13333              $C$DW$1786      .dwtag  DW_TAG_member
   13334                      .dwattr $C$DW$1786, DW_AT_type(*$C$DW$T$23)
   13335                      .dwattr $C$DW$1786, DW_AT_name("ADCINTFLG")
   13336                      .dwattr $C$DW$1786, DW_AT_TI_symbol_name("_ADCINTFLG")
   13337                      .dwattr $C$DW$1786, DW_AT_data_member_location[DW_OP_plus_uconst 0x6604]
   13338                      .dwattr $C$DW$1786, DW_AT_accessibility(DW_ACCESS_public)
   13339              
   13340              $C$DW$1787      .dwtag  DW_TAG_member
   13341                      .dwattr $C$DW$1787, DW_AT_type(*$C$DW$T$23)
   13342                      .dwattr $C$DW$1787, DW_AT_name("ADCINTFLGCLR")
   13343                      .dwattr $C$DW$1787, DW_AT_TI_symbol_name("_ADCINTFLGCLR")
   13344                      .dwattr $C$DW$1787, DW_AT_data_member_location[DW_OP_plus_uconst 0x6605]
   13345                      .dwattr $C$DW$1787, DW_AT_accessibility(DW_ACCESS_public)
   13346              
   13347              $C$DW$1788      .dwtag  DW_TAG_member
   13348                      .dwattr $C$DW$1788, DW_AT_type(*$C$DW$T$23)
   13349                      .dwattr $C$DW$1788, DW_AT_name("ADCINTOVF")
   13350                      .dwattr $C$DW$1788, DW_AT_TI_symbol_name("_ADCINTOVF")
   13351                      .dwattr $C$DW$1788, DW_AT_data_member_location[DW_OP_plus_uconst 0x6606]
   13352                      .dwattr $C$DW$1788, DW_AT_accessibility(DW_ACCESS_public)
   13353              
TMS320C2000 Assembler PC v15.12.3 Tue Aug 29 09:30:33 2017

Tools Copyright (c) 1996-2015 Texas Instruments Incorporated
C:\Users\wmj\AppData\Local\Temp\0326810                              PAGE  253

   13354              $C$DW$1789      .dwtag  DW_TAG_member
   13355                      .dwattr $C$DW$1789, DW_AT_type(*$C$DW$T$23)
   13356                      .dwattr $C$DW$1789, DW_AT_name("ADCINTOVFCLR")
   13357                      .dwattr $C$DW$1789, DW_AT_TI_symbol_name("_ADCINTOVFCLR")
   13358                      .dwattr $C$DW$1789, DW_AT_data_member_location[DW_OP_plus_uconst 0x6607]
   13359                      .dwattr $C$DW$1789, DW_AT_accessibility(DW_ACCESS_public)
   13360              
   13361              $C$DW$1790      .dwtag  DW_TAG_member
   13362                      .dwattr $C$DW$1790, DW_AT_type(*$C$DW$T$27)
   13363                      .dwattr $C$DW$1790, DW_AT_name("INTSELxNy")
   13364                      .dwattr $C$DW$1790, DW_AT_TI_symbol_name("_INTSELxNy")
   13365                      .dwattr $C$DW$1790, DW_AT_data_member_location[DW_OP_plus_uconst 0x6608]
   13366                      .dwattr $C$DW$1790, DW_AT_accessibility(DW_ACCESS_public)
   13367              
   13368              $C$DW$1791      .dwtag  DW_TAG_member
   13369                      .dwattr $C$DW$1791, DW_AT_type(*$C$DW$T$28)
   13370                      .dwattr $C$DW$1791, DW_AT_name("rsvd_3")
   13371                      .dwattr $C$DW$1791, DW_AT_TI_symbol_name("_rsvd_3")
   13372                      .dwattr $C$DW$1791, DW_AT_data_member_location[DW_OP_plus_uconst 0x660d]
   13373                      .dwattr $C$DW$1791, DW_AT_accessibility(DW_ACCESS_public)
   13374              
   13375              $C$DW$1792      .dwtag  DW_TAG_member
   13376                      .dwattr $C$DW$1792, DW_AT_type(*$C$DW$T$23)
   13377                      .dwattr $C$DW$1792, DW_AT_name("SOCPRICTRL")
   13378                      .dwattr $C$DW$1792, DW_AT_TI_symbol_name("_SOCPRICTRL")
   13379                      .dwattr $C$DW$1792, DW_AT_data_member_location[DW_OP_plus_uconst 0x6610]
   13380                      .dwattr $C$DW$1792, DW_AT_accessibility(DW_ACCESS_public)
   13381              
   13382              $C$DW$1793      .dwtag  DW_TAG_member
   13383                      .dwattr $C$DW$1793, DW_AT_type(*$C$DW$T$23)
   13384                      .dwattr $C$DW$1793, DW_AT_name("rsvd_4")
   13385                      .dwattr $C$DW$1793, DW_AT_TI_symbol_name("_rsvd_4")
   13386                      .dwattr $C$DW$1793, DW_AT_data_member_location[DW_OP_plus_uconst 0x6611]
   13387                      .dwattr $C$DW$1793, DW_AT_accessibility(DW_ACCESS_public)
   13388              
   13389              $C$DW$1794      .dwtag  DW_TAG_member
   13390                      .dwattr $C$DW$1794, DW_AT_type(*$C$DW$T$23)
   13391                      .dwattr $C$DW$1794, DW_AT_name("ADCSAMPLEMODE")
   13392                      .dwattr $C$DW$1794, DW_AT_TI_symbol_name("_ADCSAMPLEMODE")
   13393                      .dwattr $C$DW$1794, DW_AT_data_member_location[DW_OP_plus_uconst 0x6612]
   13394                      .dwattr $C$DW$1794, DW_AT_accessibility(DW_ACCESS_public)
   13395              
   13396              $C$DW$1795      .dwtag  DW_TAG_member
   13397                      .dwattr $C$DW$1795, DW_AT_type(*$C$DW$T$23)
   13398                      .dwattr $C$DW$1795, DW_AT_name("rsvd_5")
   13399                      .dwattr $C$DW$1795, DW_AT_TI_symbol_name("_rsvd_5")
   13400                      .dwattr $C$DW$1795, DW_AT_data_member_location[DW_OP_plus_uconst 0x6613]
   13401                      .dwattr $C$DW$1795, DW_AT_accessibility(DW_ACCESS_public)
   13402              
   13403              $C$DW$1796      .dwtag  DW_TAG_member
   13404                      .dwattr $C$DW$1796, DW_AT_type(*$C$DW$T$23)
   13405                      .dwattr $C$DW$1796, DW_AT_name("ADCINTSOCSEL1")
   13406                      .dwattr $C$DW$1796, DW_AT_TI_symbol_name("_ADCINTSOCSEL1")
   13407                      .dwattr $C$DW$1796, DW_AT_data_member_location[DW_OP_plus_uconst 0x6614]
   13408                      .dwattr $C$DW$1796, DW_AT_accessibility(DW_ACCESS_public)
TMS320C2000 Assembler PC v15.12.3 Tue Aug 29 09:30:33 2017

Tools Copyright (c) 1996-2015 Texas Instruments Incorporated
C:\Users\wmj\AppData\Local\Temp\0326810                              PAGE  254

   13409              
   13410              $C$DW$1797      .dwtag  DW_TAG_member
   13411                      .dwattr $C$DW$1797, DW_AT_type(*$C$DW$T$23)
   13412                      .dwattr $C$DW$1797, DW_AT_name("ADCINTSOCSEL2")
   13413                      .dwattr $C$DW$1797, DW_AT_TI_symbol_name("_ADCINTSOCSEL2")
   13414                      .dwattr $C$DW$1797, DW_AT_data_member_location[DW_OP_plus_uconst 0x6615]
   13415                      .dwattr $C$DW$1797, DW_AT_accessibility(DW_ACCESS_public)
   13416              
   13417              $C$DW$1798      .dwtag  DW_TAG_member
   13418                      .dwattr $C$DW$1798, DW_AT_type(*$C$DW$T$26)
   13419                      .dwattr $C$DW$1798, DW_AT_name("rsvd_6")
   13420                      .dwattr $C$DW$1798, DW_AT_TI_symbol_name("_rsvd_6")
   13421                      .dwattr $C$DW$1798, DW_AT_data_member_location[DW_OP_plus_uconst 0x6616]
   13422                      .dwattr $C$DW$1798, DW_AT_accessibility(DW_ACCESS_public)
   13423              
   13424              $C$DW$1799      .dwtag  DW_TAG_member
   13425                      .dwattr $C$DW$1799, DW_AT_type(*$C$DW$T$23)
   13426                      .dwattr $C$DW$1799, DW_AT_name("ADCSOCFLG1")
   13427                      .dwattr $C$DW$1799, DW_AT_TI_symbol_name("_ADCSOCFLG1")
   13428                      .dwattr $C$DW$1799, DW_AT_data_member_location[DW_OP_plus_uconst 0x6618]
   13429                      .dwattr $C$DW$1799, DW_AT_accessibility(DW_ACCESS_public)
   13430              
   13431              $C$DW$1800      .dwtag  DW_TAG_member
   13432                      .dwattr $C$DW$1800, DW_AT_type(*$C$DW$T$23)
   13433                      .dwattr $C$DW$1800, DW_AT_name("rsvd_7")
   13434                      .dwattr $C$DW$1800, DW_AT_TI_symbol_name("_rsvd_7")
   13435                      .dwattr $C$DW$1800, DW_AT_data_member_location[DW_OP_plus_uconst 0x6619]
   13436                      .dwattr $C$DW$1800, DW_AT_accessibility(DW_ACCESS_public)
   13437              
   13438              $C$DW$1801      .dwtag  DW_TAG_member
   13439                      .dwattr $C$DW$1801, DW_AT_type(*$C$DW$T$23)
   13440                      .dwattr $C$DW$1801, DW_AT_name("ADCSOCFRC1")
   13441                      .dwattr $C$DW$1801, DW_AT_TI_symbol_name("_ADCSOCFRC1")
   13442                      .dwattr $C$DW$1801, DW_AT_data_member_location[DW_OP_plus_uconst 0x661a]
   13443                      .dwattr $C$DW$1801, DW_AT_accessibility(DW_ACCESS_public)
   13444              
   13445              $C$DW$1802      .dwtag  DW_TAG_member
   13446                      .dwattr $C$DW$1802, DW_AT_type(*$C$DW$T$23)
   13447                      .dwattr $C$DW$1802, DW_AT_name("rsvd_8")
   13448                      .dwattr $C$DW$1802, DW_AT_TI_symbol_name("_rsvd_8")
   13449                      .dwattr $C$DW$1802, DW_AT_data_member_location[DW_OP_plus_uconst 0x661b]
   13450                      .dwattr $C$DW$1802, DW_AT_accessibility(DW_ACCESS_public)
   13451              
   13452              $C$DW$1803      .dwtag  DW_TAG_member
   13453                      .dwattr $C$DW$1803, DW_AT_type(*$C$DW$T$23)
   13454                      .dwattr $C$DW$1803, DW_AT_name("ADCSOCOVF1")
   13455                      .dwattr $C$DW$1803, DW_AT_TI_symbol_name("_ADCSOCOVF1")
   13456                      .dwattr $C$DW$1803, DW_AT_data_member_location[DW_OP_plus_uconst 0x661c]
   13457                      .dwattr $C$DW$1803, DW_AT_accessibility(DW_ACCESS_public)
   13458              
   13459              $C$DW$1804      .dwtag  DW_TAG_member
   13460                      .dwattr $C$DW$1804, DW_AT_type(*$C$DW$T$23)
   13461                      .dwattr $C$DW$1804, DW_AT_name("rsvd_9")
   13462                      .dwattr $C$DW$1804, DW_AT_TI_symbol_name("_rsvd_9")
   13463                      .dwattr $C$DW$1804, DW_AT_data_member_location[DW_OP_plus_uconst 0x661d]
TMS320C2000 Assembler PC v15.12.3 Tue Aug 29 09:30:33 2017

Tools Copyright (c) 1996-2015 Texas Instruments Incorporated
C:\Users\wmj\AppData\Local\Temp\0326810                              PAGE  255

   13464                      .dwattr $C$DW$1804, DW_AT_accessibility(DW_ACCESS_public)
   13465              
   13466              $C$DW$1805      .dwtag  DW_TAG_member
   13467                      .dwattr $C$DW$1805, DW_AT_type(*$C$DW$T$23)
   13468                      .dwattr $C$DW$1805, DW_AT_name("ADCSOCOVFCLR1")
   13469                      .dwattr $C$DW$1805, DW_AT_TI_symbol_name("_ADCSOCOVFCLR1")
   13470                      .dwattr $C$DW$1805, DW_AT_data_member_location[DW_OP_plus_uconst 0x661e]
   13471                      .dwattr $C$DW$1805, DW_AT_accessibility(DW_ACCESS_public)
   13472              
   13473              $C$DW$1806      .dwtag  DW_TAG_member
   13474                      .dwattr $C$DW$1806, DW_AT_type(*$C$DW$T$23)
   13475                      .dwattr $C$DW$1806, DW_AT_name("rsvd_10")
   13476                      .dwattr $C$DW$1806, DW_AT_TI_symbol_name("_rsvd_10")
   13477                      .dwattr $C$DW$1806, DW_AT_data_member_location[DW_OP_plus_uconst 0x661f]
   13478                      .dwattr $C$DW$1806, DW_AT_accessibility(DW_ACCESS_public)
   13479              
   13480              $C$DW$1807      .dwtag  DW_TAG_member
   13481                      .dwattr $C$DW$1807, DW_AT_type(*$C$DW$T$24)
   13482                      .dwattr $C$DW$1807, DW_AT_name("ADCSOCxCTL")
   13483                      .dwattr $C$DW$1807, DW_AT_TI_symbol_name("_ADCSOCxCTL")
   13484                      .dwattr $C$DW$1807, DW_AT_data_member_location[DW_OP_plus_uconst 0x6620]
   13485                      .dwattr $C$DW$1807, DW_AT_accessibility(DW_ACCESS_public)
   13486              
   13487              $C$DW$1808      .dwtag  DW_TAG_member
   13488                      .dwattr $C$DW$1808, DW_AT_type(*$C$DW$T$24)
   13489                      .dwattr $C$DW$1808, DW_AT_name("rsvd_11")
   13490                      .dwattr $C$DW$1808, DW_AT_TI_symbol_name("_rsvd_11")
   13491                      .dwattr $C$DW$1808, DW_AT_data_member_location[DW_OP_plus_uconst 0x6630]
   13492                      .dwattr $C$DW$1808, DW_AT_accessibility(DW_ACCESS_public)
   13493              
   13494              $C$DW$1809      .dwtag  DW_TAG_member
   13495                      .dwattr $C$DW$1809, DW_AT_type(*$C$DW$T$23)
   13496                      .dwattr $C$DW$1809, DW_AT_name("ADCREFTRIM")
   13497                      .dwattr $C$DW$1809, DW_AT_TI_symbol_name("_ADCREFTRIM")
   13498                      .dwattr $C$DW$1809, DW_AT_data_member_location[DW_OP_plus_uconst 0x6640]
   13499                      .dwattr $C$DW$1809, DW_AT_accessibility(DW_ACCESS_public)
   13500              
   13501              $C$DW$1810      .dwtag  DW_TAG_member
   13502                      .dwattr $C$DW$1810, DW_AT_type(*$C$DW$T$23)
   13503                      .dwattr $C$DW$1810, DW_AT_name("ADCOFFTRIM")
   13504                      .dwattr $C$DW$1810, DW_AT_TI_symbol_name("_ADCOFFTRIM")
   13505                      .dwattr $C$DW$1810, DW_AT_data_member_location[DW_OP_plus_uconst 0x6641]
   13506                      .dwattr $C$DW$1810, DW_AT_accessibility(DW_ACCESS_public)
   13507              
   13508              $C$DW$1811      .dwtag  DW_TAG_member
   13509                      .dwattr $C$DW$1811, DW_AT_type(*$C$DW$T$29)
   13510                      .dwattr $C$DW$1811, DW_AT_name("resvd_12")
   13511                      .dwattr $C$DW$1811, DW_AT_TI_symbol_name("_resvd_12")
   13512                      .dwattr $C$DW$1811, DW_AT_data_member_location[DW_OP_plus_uconst 0x6642]
   13513                      .dwattr $C$DW$1811, DW_AT_accessibility(DW_ACCESS_public)
   13514              
   13515              $C$DW$1812      .dwtag  DW_TAG_member
   13516                      .dwattr $C$DW$1812, DW_AT_type(*$C$DW$T$23)
   13517                      .dwattr $C$DW$1812, DW_AT_name("ADCREV")
   13518                      .dwattr $C$DW$1812, DW_AT_TI_symbol_name("_ADCREV")
TMS320C2000 Assembler PC v15.12.3 Tue Aug 29 09:30:33 2017

Tools Copyright (c) 1996-2015 Texas Instruments Incorporated
C:\Users\wmj\AppData\Local\Temp\0326810                              PAGE  256

   13519                      .dwattr $C$DW$1812, DW_AT_data_member_location[DW_OP_plus_uconst 0x664f]
   13520                      .dwattr $C$DW$1812, DW_AT_accessibility(DW_ACCESS_public)
   13521              
   13522                      .dwendtag $C$DW$T$30
   13523              
   13524              $C$DW$T$331     .dwtag  DW_TAG_typedef
   13525                      .dwattr $C$DW$T$331, DW_AT_name("ADC_Obj")
   13526                      .dwattr $C$DW$T$331, DW_AT_type(*$C$DW$T$30)
   13527                      .dwattr $C$DW$T$331, DW_AT_language(DW_LANG_C)
   13528              
   13529              $C$DW$T$50      .dwtag  DW_TAG_pointer_type
   13530                      .dwattr $C$DW$T$50, DW_AT_type(*$C$DW$T$30)
   13531                      .dwattr $C$DW$T$50, DW_AT_address_class(0x20)
   13532              
   13533              $C$DW$T$51      .dwtag  DW_TAG_typedef
   13534                      .dwattr $C$DW$T$51, DW_AT_name("ADC_Handle")
   13535                      .dwattr $C$DW$T$51, DW_AT_type(*$C$DW$T$50)
   13536                      .dwattr $C$DW$T$51, DW_AT_language(DW_LANG_C)
   13537              
   13538              
   13539              $C$DW$T$32      .dwtag  DW_TAG_structure_type
   13540                      .dwattr $C$DW$T$32, DW_AT_name("_CLK_Obj_")
   13541                      .dwattr $C$DW$T$32, DW_AT_byte_size(0x11)
   13542              $C$DW$1813      .dwtag  DW_TAG_member
   13543                      .dwattr $C$DW$1813, DW_AT_type(*$C$DW$T$23)
   13544                      .dwattr $C$DW$1813, DW_AT_name("XCLK")
   13545                      .dwattr $C$DW$1813, DW_AT_TI_symbol_name("_XCLK")
   13546                      .dwattr $C$DW$1813, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
   13547                      .dwattr $C$DW$1813, DW_AT_accessibility(DW_ACCESS_public)
   13548              
   13549              $C$DW$1814      .dwtag  DW_TAG_member
   13550                      .dwattr $C$DW$1814, DW_AT_type(*$C$DW$T$23)
   13551                      .dwattr $C$DW$1814, DW_AT_name("rsvd_1")
   13552                      .dwattr $C$DW$1814, DW_AT_TI_symbol_name("_rsvd_1")
   13553                      .dwattr $C$DW$1814, DW_AT_data_member_location[DW_OP_plus_uconst 0x1]
   13554                      .dwattr $C$DW$1814, DW_AT_accessibility(DW_ACCESS_public)
   13555              
   13556              $C$DW$1815      .dwtag  DW_TAG_member
   13557                      .dwattr $C$DW$1815, DW_AT_type(*$C$DW$T$23)
   13558                      .dwattr $C$DW$1815, DW_AT_name("CLKCTL")
   13559                      .dwattr $C$DW$1815, DW_AT_TI_symbol_name("_CLKCTL")
   13560                      .dwattr $C$DW$1815, DW_AT_data_member_location[DW_OP_plus_uconst 0x2]
   13561                      .dwattr $C$DW$1815, DW_AT_accessibility(DW_ACCESS_public)
   13562              
   13563              $C$DW$1816      .dwtag  DW_TAG_member
   13564                      .dwattr $C$DW$1816, DW_AT_type(*$C$DW$T$31)
   13565                      .dwattr $C$DW$1816, DW_AT_name("rsvd_2")
   13566                      .dwattr $C$DW$1816, DW_AT_TI_symbol_name("_rsvd_2")
   13567                      .dwattr $C$DW$1816, DW_AT_data_member_location[DW_OP_plus_uconst 0x3]
   13568                      .dwattr $C$DW$1816, DW_AT_accessibility(DW_ACCESS_public)
   13569              
   13570              $C$DW$1817      .dwtag  DW_TAG_member
   13571                      .dwattr $C$DW$1817, DW_AT_type(*$C$DW$T$23)
   13572                      .dwattr $C$DW$1817, DW_AT_name("LOSPCP")
   13573                      .dwattr $C$DW$1817, DW_AT_TI_symbol_name("_LOSPCP")
TMS320C2000 Assembler PC v15.12.3 Tue Aug 29 09:30:33 2017

Tools Copyright (c) 1996-2015 Texas Instruments Incorporated
C:\Users\wmj\AppData\Local\Temp\0326810                              PAGE  257

   13574                      .dwattr $C$DW$1817, DW_AT_data_member_location[DW_OP_plus_uconst 0xb]
   13575                      .dwattr $C$DW$1817, DW_AT_accessibility(DW_ACCESS_public)
   13576              
   13577              $C$DW$1818      .dwtag  DW_TAG_member
   13578                      .dwattr $C$DW$1818, DW_AT_type(*$C$DW$T$23)
   13579                      .dwattr $C$DW$1818, DW_AT_name("PCLKCR0")
   13580                      .dwattr $C$DW$1818, DW_AT_TI_symbol_name("_PCLKCR0")
   13581                      .dwattr $C$DW$1818, DW_AT_data_member_location[DW_OP_plus_uconst 0xc]
   13582                      .dwattr $C$DW$1818, DW_AT_accessibility(DW_ACCESS_public)
   13583              
   13584              $C$DW$1819      .dwtag  DW_TAG_member
   13585                      .dwattr $C$DW$1819, DW_AT_type(*$C$DW$T$23)
   13586                      .dwattr $C$DW$1819, DW_AT_name("PCLKCR1")
   13587                      .dwattr $C$DW$1819, DW_AT_TI_symbol_name("_PCLKCR1")
   13588                      .dwattr $C$DW$1819, DW_AT_data_member_location[DW_OP_plus_uconst 0xd]
   13589                      .dwattr $C$DW$1819, DW_AT_accessibility(DW_ACCESS_public)
   13590              
   13591              $C$DW$1820      .dwtag  DW_TAG_member
   13592                      .dwattr $C$DW$1820, DW_AT_type(*$C$DW$T$26)
   13593                      .dwattr $C$DW$1820, DW_AT_name("rsvd_3")
   13594                      .dwattr $C$DW$1820, DW_AT_TI_symbol_name("_rsvd_3")
   13595                      .dwattr $C$DW$1820, DW_AT_data_member_location[DW_OP_plus_uconst 0xe]
   13596                      .dwattr $C$DW$1820, DW_AT_accessibility(DW_ACCESS_public)
   13597              
   13598              $C$DW$1821      .dwtag  DW_TAG_member
   13599                      .dwattr $C$DW$1821, DW_AT_type(*$C$DW$T$23)
   13600                      .dwattr $C$DW$1821, DW_AT_name("PCLKCR3")
   13601                      .dwattr $C$DW$1821, DW_AT_TI_symbol_name("_PCLKCR3")
   13602                      .dwattr $C$DW$1821, DW_AT_data_member_location[DW_OP_plus_uconst 0x10]
   13603                      .dwattr $C$DW$1821, DW_AT_accessibility(DW_ACCESS_public)
   13604              
   13605                      .dwendtag $C$DW$T$32
   13606              
   13607              $C$DW$T$52      .dwtag  DW_TAG_pointer_type
   13608                      .dwattr $C$DW$T$52, DW_AT_type(*$C$DW$T$32)
   13609                      .dwattr $C$DW$T$52, DW_AT_address_class(0x20)
   13610              
   13611              $C$DW$T$53      .dwtag  DW_TAG_typedef
   13612                      .dwattr $C$DW$T$53, DW_AT_name("CLK_Handle")
   13613                      .dwattr $C$DW$T$53, DW_AT_type(*$C$DW$T$52)
   13614                      .dwattr $C$DW$T$53, DW_AT_language(DW_LANG_C)
   13615              
   13616              
   13617              $C$DW$T$34      .dwtag  DW_TAG_structure_type
   13618                      .dwattr $C$DW$T$34, DW_AT_name("_CPU_Obj_")
   13619                      .dwattr $C$DW$T$34, DW_AT_byte_size(0x01)
   13620              $C$DW$1822      .dwtag  DW_TAG_member
   13621                      .dwattr $C$DW$1822, DW_AT_type(*$C$DW$T$33)
   13622                      .dwattr $C$DW$1822, DW_AT_name("tmp")
   13623                      .dwattr $C$DW$1822, DW_AT_TI_symbol_name("_tmp")
   13624                      .dwattr $C$DW$1822, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
   13625                      .dwattr $C$DW$1822, DW_AT_accessibility(DW_ACCESS_public)
   13626              
   13627                      .dwendtag $C$DW$T$34
   13628              
TMS320C2000 Assembler PC v15.12.3 Tue Aug 29 09:30:33 2017

Tools Copyright (c) 1996-2015 Texas Instruments Incorporated
C:\Users\wmj\AppData\Local\Temp\0326810                              PAGE  258

   13629              $C$DW$T$338     .dwtag  DW_TAG_typedef
   13630                      .dwattr $C$DW$T$338, DW_AT_name("CPU_Obj")
   13631                      .dwattr $C$DW$T$338, DW_AT_type(*$C$DW$T$34)
   13632                      .dwattr $C$DW$T$338, DW_AT_language(DW_LANG_C)
   13633              
   13634              $C$DW$T$54      .dwtag  DW_TAG_pointer_type
   13635                      .dwattr $C$DW$T$54, DW_AT_type(*$C$DW$T$34)
   13636                      .dwattr $C$DW$T$54, DW_AT_address_class(0x20)
   13637              
   13638              $C$DW$T$55      .dwtag  DW_TAG_typedef
   13639                      .dwattr $C$DW$T$55, DW_AT_name("CPU_Handle")
   13640                      .dwattr $C$DW$T$55, DW_AT_type(*$C$DW$T$54)
   13641                      .dwattr $C$DW$T$55, DW_AT_language(DW_LANG_C)
   13642              
   13643              
   13644              $C$DW$T$36      .dwtag  DW_TAG_structure_type
   13645                      .dwattr $C$DW$T$36, DW_AT_name("_FILTER_FO_")
   13646                      .dwattr $C$DW$T$36, DW_AT_byte_size(0x0a)
   13647              $C$DW$1823      .dwtag  DW_TAG_member
   13648                      .dwattr $C$DW$1823, DW_AT_type(*$C$DW$T$35)
   13649                      .dwattr $C$DW$1823, DW_AT_name("a1")
   13650                      .dwattr $C$DW$1823, DW_AT_TI_symbol_name("_a1")
   13651                      .dwattr $C$DW$1823, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
   13652                      .dwattr $C$DW$1823, DW_AT_accessibility(DW_ACCESS_public)
   13653              
   13654              $C$DW$1824      .dwtag  DW_TAG_member
   13655                      .dwattr $C$DW$1824, DW_AT_type(*$C$DW$T$35)
   13656                      .dwattr $C$DW$1824, DW_AT_name("b0")
   13657                      .dwattr $C$DW$1824, DW_AT_TI_symbol_name("_b0")
   13658                      .dwattr $C$DW$1824, DW_AT_data_member_location[DW_OP_plus_uconst 0x2]
   13659                      .dwattr $C$DW$1824, DW_AT_accessibility(DW_ACCESS_public)
   13660              
   13661              $C$DW$1825      .dwtag  DW_TAG_member
   13662                      .dwattr $C$DW$1825, DW_AT_type(*$C$DW$T$35)
   13663                      .dwattr $C$DW$1825, DW_AT_name("b1")
   13664                      .dwattr $C$DW$1825, DW_AT_TI_symbol_name("_b1")
   13665                      .dwattr $C$DW$1825, DW_AT_data_member_location[DW_OP_plus_uconst 0x4]
   13666                      .dwattr $C$DW$1825, DW_AT_accessibility(DW_ACCESS_public)
   13667              
   13668              $C$DW$1826      .dwtag  DW_TAG_member
   13669                      .dwattr $C$DW$1826, DW_AT_type(*$C$DW$T$35)
   13670                      .dwattr $C$DW$1826, DW_AT_name("x1")
   13671                      .dwattr $C$DW$1826, DW_AT_TI_symbol_name("_x1")
   13672                      .dwattr $C$DW$1826, DW_AT_data_member_location[DW_OP_plus_uconst 0x6]
   13673                      .dwattr $C$DW$1826, DW_AT_accessibility(DW_ACCESS_public)
   13674              
   13675              $C$DW$1827      .dwtag  DW_TAG_member
   13676                      .dwattr $C$DW$1827, DW_AT_type(*$C$DW$T$35)
   13677                      .dwattr $C$DW$1827, DW_AT_name("y1")
   13678                      .dwattr $C$DW$1827, DW_AT_TI_symbol_name("_y1")
   13679                      .dwattr $C$DW$1827, DW_AT_data_member_location[DW_OP_plus_uconst 0x8]
   13680                      .dwattr $C$DW$1827, DW_AT_accessibility(DW_ACCESS_public)
   13681              
   13682                      .dwendtag $C$DW$T$36
   13683              
TMS320C2000 Assembler PC v15.12.3 Tue Aug 29 09:30:33 2017

Tools Copyright (c) 1996-2015 Texas Instruments Incorporated
C:\Users\wmj\AppData\Local\Temp\0326810                              PAGE  259

   13684              $C$DW$T$91      .dwtag  DW_TAG_typedef
   13685                      .dwattr $C$DW$T$91, DW_AT_name("FILTER_FO_Obj")
   13686                      .dwattr $C$DW$T$91, DW_AT_type(*$C$DW$T$36)
   13687                      .dwattr $C$DW$T$91, DW_AT_language(DW_LANG_C)
   13688              
   13689              
   13690              $C$DW$T$20      .dwtag  DW_TAG_structure_type
   13691                      .dwattr $C$DW$T$20, DW_AT_name("_FILTER_FO_Obj_")
   13692                      .dwattr $C$DW$T$20, DW_AT_declaration
   13693                      .dwendtag $C$DW$T$20
   13694              
   13695              $C$DW$T$92      .dwtag  DW_TAG_pointer_type
   13696                      .dwattr $C$DW$T$92, DW_AT_type(*$C$DW$T$20)
   13697                      .dwattr $C$DW$T$92, DW_AT_address_class(0x20)
   13698              
   13699              $C$DW$T$93      .dwtag  DW_TAG_typedef
   13700                      .dwattr $C$DW$T$93, DW_AT_name("FILTER_FO_Handle")
   13701                      .dwattr $C$DW$T$93, DW_AT_type(*$C$DW$T$92)
   13702                      .dwattr $C$DW$T$93, DW_AT_language(DW_LANG_C)
   13703              
   13704              
   13705              $C$DW$T$37      .dwtag  DW_TAG_structure_type
   13706                      .dwattr $C$DW$T$37, DW_AT_name("_FLASH_Obj_")
   13707                      .dwattr $C$DW$T$37, DW_AT_byte_size(0x08)
   13708              $C$DW$1828      .dwtag  DW_TAG_member
   13709                      .dwattr $C$DW$1828, DW_AT_type(*$C$DW$T$23)
   13710                      .dwattr $C$DW$1828, DW_AT_name("FOPT")
   13711                      .dwattr $C$DW$1828, DW_AT_TI_symbol_name("_FOPT")
   13712                      .dwattr $C$DW$1828, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
   13713                      .dwattr $C$DW$1828, DW_AT_accessibility(DW_ACCESS_public)
   13714              
   13715              $C$DW$1829      .dwtag  DW_TAG_member
   13716                      .dwattr $C$DW$1829, DW_AT_type(*$C$DW$T$23)
   13717                      .dwattr $C$DW$1829, DW_AT_name("rsvd_1")
   13718                      .dwattr $C$DW$1829, DW_AT_TI_symbol_name("_rsvd_1")
   13719                      .dwattr $C$DW$1829, DW_AT_data_member_location[DW_OP_plus_uconst 0x1]
   13720                      .dwattr $C$DW$1829, DW_AT_accessibility(DW_ACCESS_public)
   13721              
   13722              $C$DW$1830      .dwtag  DW_TAG_member
   13723                      .dwattr $C$DW$1830, DW_AT_type(*$C$DW$T$23)
   13724                      .dwattr $C$DW$1830, DW_AT_name("FPWR")
   13725                      .dwattr $C$DW$1830, DW_AT_TI_symbol_name("_FPWR")
   13726                      .dwattr $C$DW$1830, DW_AT_data_member_location[DW_OP_plus_uconst 0x2]
   13727                      .dwattr $C$DW$1830, DW_AT_accessibility(DW_ACCESS_public)
   13728              
   13729              $C$DW$1831      .dwtag  DW_TAG_member
   13730                      .dwattr $C$DW$1831, DW_AT_type(*$C$DW$T$23)
   13731                      .dwattr $C$DW$1831, DW_AT_name("FSTATUS")
   13732                      .dwattr $C$DW$1831, DW_AT_TI_symbol_name("_FSTATUS")
   13733                      .dwattr $C$DW$1831, DW_AT_data_member_location[DW_OP_plus_uconst 0x3]
   13734                      .dwattr $C$DW$1831, DW_AT_accessibility(DW_ACCESS_public)
   13735              
   13736              $C$DW$1832      .dwtag  DW_TAG_member
   13737                      .dwattr $C$DW$1832, DW_AT_type(*$C$DW$T$23)
   13738                      .dwattr $C$DW$1832, DW_AT_name("FSTDBYWAIT")
TMS320C2000 Assembler PC v15.12.3 Tue Aug 29 09:30:33 2017

Tools Copyright (c) 1996-2015 Texas Instruments Incorporated
C:\Users\wmj\AppData\Local\Temp\0326810                              PAGE  260

   13739                      .dwattr $C$DW$1832, DW_AT_TI_symbol_name("_FSTDBYWAIT")
   13740                      .dwattr $C$DW$1832, DW_AT_data_member_location[DW_OP_plus_uconst 0x4]
   13741                      .dwattr $C$DW$1832, DW_AT_accessibility(DW_ACCESS_public)
   13742              
   13743              $C$DW$1833      .dwtag  DW_TAG_member
   13744                      .dwattr $C$DW$1833, DW_AT_type(*$C$DW$T$23)
   13745                      .dwattr $C$DW$1833, DW_AT_name("FACTIVEWAIT")
   13746                      .dwattr $C$DW$1833, DW_AT_TI_symbol_name("_FACTIVEWAIT")
   13747                      .dwattr $C$DW$1833, DW_AT_data_member_location[DW_OP_plus_uconst 0x5]
   13748                      .dwattr $C$DW$1833, DW_AT_accessibility(DW_ACCESS_public)
   13749              
   13750              $C$DW$1834      .dwtag  DW_TAG_member
   13751                      .dwattr $C$DW$1834, DW_AT_type(*$C$DW$T$23)
   13752                      .dwattr $C$DW$1834, DW_AT_name("FBANKWAIT")
   13753                      .dwattr $C$DW$1834, DW_AT_TI_symbol_name("_FBANKWAIT")
   13754                      .dwattr $C$DW$1834, DW_AT_data_member_location[DW_OP_plus_uconst 0x6]
   13755                      .dwattr $C$DW$1834, DW_AT_accessibility(DW_ACCESS_public)
   13756              
   13757              $C$DW$1835      .dwtag  DW_TAG_member
   13758                      .dwattr $C$DW$1835, DW_AT_type(*$C$DW$T$23)
   13759                      .dwattr $C$DW$1835, DW_AT_name("FOTPWAIT")
   13760                      .dwattr $C$DW$1835, DW_AT_TI_symbol_name("_FOTPWAIT")
   13761                      .dwattr $C$DW$1835, DW_AT_data_member_location[DW_OP_plus_uconst 0x7]
   13762                      .dwattr $C$DW$1835, DW_AT_accessibility(DW_ACCESS_public)
   13763              
   13764                      .dwendtag $C$DW$T$37
   13765              
   13766              $C$DW$T$56      .dwtag  DW_TAG_pointer_type
   13767                      .dwattr $C$DW$T$56, DW_AT_type(*$C$DW$T$37)
   13768                      .dwattr $C$DW$T$56, DW_AT_address_class(0x20)
   13769              
   13770              $C$DW$T$57      .dwtag  DW_TAG_typedef
   13771                      .dwattr $C$DW$T$57, DW_AT_name("FLASH_Handle")
   13772                      .dwattr $C$DW$T$57, DW_AT_type(*$C$DW$T$56)
   13773                      .dwattr $C$DW$T$57, DW_AT_language(DW_LANG_C)
   13774              
   13775              
   13776              $C$DW$T$42      .dwtag  DW_TAG_structure_type
   13777                      .dwattr $C$DW$T$42, DW_AT_name("_GPIO_Obj_")
   13778                      .dwattr $C$DW$T$42, DW_AT_byte_size(0x6a)
   13779              $C$DW$1836      .dwtag  DW_TAG_member
   13780                      .dwattr $C$DW$1836, DW_AT_type(*$C$DW$T$39)
   13781                      .dwattr $C$DW$1836, DW_AT_name("GPACTRL")
   13782                      .dwattr $C$DW$1836, DW_AT_TI_symbol_name("_GPACTRL")
   13783                      .dwattr $C$DW$1836, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
   13784                      .dwattr $C$DW$1836, DW_AT_accessibility(DW_ACCESS_public)
   13785              
   13786              $C$DW$1837      .dwtag  DW_TAG_member
   13787                      .dwattr $C$DW$1837, DW_AT_type(*$C$DW$T$39)
   13788                      .dwattr $C$DW$1837, DW_AT_name("GPAQSEL1")
   13789                      .dwattr $C$DW$1837, DW_AT_TI_symbol_name("_GPAQSEL1")
   13790                      .dwattr $C$DW$1837, DW_AT_data_member_location[DW_OP_plus_uconst 0x2]
   13791                      .dwattr $C$DW$1837, DW_AT_accessibility(DW_ACCESS_public)
   13792              
   13793              $C$DW$1838      .dwtag  DW_TAG_member
TMS320C2000 Assembler PC v15.12.3 Tue Aug 29 09:30:33 2017

Tools Copyright (c) 1996-2015 Texas Instruments Incorporated
C:\Users\wmj\AppData\Local\Temp\0326810                              PAGE  261

   13794                      .dwattr $C$DW$1838, DW_AT_type(*$C$DW$T$39)
   13795                      .dwattr $C$DW$1838, DW_AT_name("GPAQSEL2")
   13796                      .dwattr $C$DW$1838, DW_AT_TI_symbol_name("_GPAQSEL2")
   13797                      .dwattr $C$DW$1838, DW_AT_data_member_location[DW_OP_plus_uconst 0x4]
   13798                      .dwattr $C$DW$1838, DW_AT_accessibility(DW_ACCESS_public)
   13799              
   13800              $C$DW$1839      .dwtag  DW_TAG_member
   13801                      .dwattr $C$DW$1839, DW_AT_type(*$C$DW$T$39)
   13802                      .dwattr $C$DW$1839, DW_AT_name("GPAMUX1")
   13803                      .dwattr $C$DW$1839, DW_AT_TI_symbol_name("_GPAMUX1")
   13804                      .dwattr $C$DW$1839, DW_AT_data_member_location[DW_OP_plus_uconst 0x6]
   13805                      .dwattr $C$DW$1839, DW_AT_accessibility(DW_ACCESS_public)
   13806              
   13807              $C$DW$1840      .dwtag  DW_TAG_member
   13808                      .dwattr $C$DW$1840, DW_AT_type(*$C$DW$T$39)
   13809                      .dwattr $C$DW$1840, DW_AT_name("GPAMUX2")
   13810                      .dwattr $C$DW$1840, DW_AT_TI_symbol_name("_GPAMUX2")
   13811                      .dwattr $C$DW$1840, DW_AT_data_member_location[DW_OP_plus_uconst 0x8]
   13812                      .dwattr $C$DW$1840, DW_AT_accessibility(DW_ACCESS_public)
   13813              
   13814              $C$DW$1841      .dwtag  DW_TAG_member
   13815                      .dwattr $C$DW$1841, DW_AT_type(*$C$DW$T$39)
   13816                      .dwattr $C$DW$1841, DW_AT_name("GPADIR")
   13817                      .dwattr $C$DW$1841, DW_AT_TI_symbol_name("_GPADIR")
   13818                      .dwattr $C$DW$1841, DW_AT_data_member_location[DW_OP_plus_uconst 0xa]
   13819                      .dwattr $C$DW$1841, DW_AT_accessibility(DW_ACCESS_public)
   13820              
   13821              $C$DW$1842      .dwtag  DW_TAG_member
   13822                      .dwattr $C$DW$1842, DW_AT_type(*$C$DW$T$39)
   13823                      .dwattr $C$DW$1842, DW_AT_name("GPAPUD")
   13824                      .dwattr $C$DW$1842, DW_AT_TI_symbol_name("_GPAPUD")
   13825                      .dwattr $C$DW$1842, DW_AT_data_member_location[DW_OP_plus_uconst 0xc]
   13826                      .dwattr $C$DW$1842, DW_AT_accessibility(DW_ACCESS_public)
   13827              
   13828              $C$DW$1843      .dwtag  DW_TAG_member
   13829                      .dwattr $C$DW$1843, DW_AT_type(*$C$DW$T$26)
   13830                      .dwattr $C$DW$1843, DW_AT_name("rsvd_1")
   13831                      .dwattr $C$DW$1843, DW_AT_TI_symbol_name("_rsvd_1")
   13832                      .dwattr $C$DW$1843, DW_AT_data_member_location[DW_OP_plus_uconst 0xe]
   13833                      .dwattr $C$DW$1843, DW_AT_accessibility(DW_ACCESS_public)
   13834              
   13835              $C$DW$1844      .dwtag  DW_TAG_member
   13836                      .dwattr $C$DW$1844, DW_AT_type(*$C$DW$T$39)
   13837                      .dwattr $C$DW$1844, DW_AT_name("GPBCTRL")
   13838                      .dwattr $C$DW$1844, DW_AT_TI_symbol_name("_GPBCTRL")
   13839                      .dwattr $C$DW$1844, DW_AT_data_member_location[DW_OP_plus_uconst 0x10]
   13840                      .dwattr $C$DW$1844, DW_AT_accessibility(DW_ACCESS_public)
   13841              
   13842              $C$DW$1845      .dwtag  DW_TAG_member
   13843                      .dwattr $C$DW$1845, DW_AT_type(*$C$DW$T$39)
   13844                      .dwattr $C$DW$1845, DW_AT_name("GPBQSEL1")
   13845                      .dwattr $C$DW$1845, DW_AT_TI_symbol_name("_GPBQSEL1")
   13846                      .dwattr $C$DW$1845, DW_AT_data_member_location[DW_OP_plus_uconst 0x12]
   13847                      .dwattr $C$DW$1845, DW_AT_accessibility(DW_ACCESS_public)
   13848              
TMS320C2000 Assembler PC v15.12.3 Tue Aug 29 09:30:33 2017

Tools Copyright (c) 1996-2015 Texas Instruments Incorporated
C:\Users\wmj\AppData\Local\Temp\0326810                              PAGE  262

   13849              $C$DW$1846      .dwtag  DW_TAG_member
   13850                      .dwattr $C$DW$1846, DW_AT_type(*$C$DW$T$26)
   13851                      .dwattr $C$DW$1846, DW_AT_name("rsvd_2")
   13852                      .dwattr $C$DW$1846, DW_AT_TI_symbol_name("_rsvd_2")
   13853                      .dwattr $C$DW$1846, DW_AT_data_member_location[DW_OP_plus_uconst 0x14]
   13854                      .dwattr $C$DW$1846, DW_AT_accessibility(DW_ACCESS_public)
   13855              
   13856              $C$DW$1847      .dwtag  DW_TAG_member
   13857                      .dwattr $C$DW$1847, DW_AT_type(*$C$DW$T$39)
   13858                      .dwattr $C$DW$1847, DW_AT_name("GPBMUX1")
   13859                      .dwattr $C$DW$1847, DW_AT_TI_symbol_name("_GPBMUX1")
   13860                      .dwattr $C$DW$1847, DW_AT_data_member_location[DW_OP_plus_uconst 0x16]
   13861                      .dwattr $C$DW$1847, DW_AT_accessibility(DW_ACCESS_public)
   13862              
   13863              $C$DW$1848      .dwtag  DW_TAG_member
   13864                      .dwattr $C$DW$1848, DW_AT_type(*$C$DW$T$26)
   13865                      .dwattr $C$DW$1848, DW_AT_name("rsvd_3")
   13866                      .dwattr $C$DW$1848, DW_AT_TI_symbol_name("_rsvd_3")
   13867                      .dwattr $C$DW$1848, DW_AT_data_member_location[DW_OP_plus_uconst 0x18]
   13868                      .dwattr $C$DW$1848, DW_AT_accessibility(DW_ACCESS_public)
   13869              
   13870              $C$DW$1849      .dwtag  DW_TAG_member
   13871                      .dwattr $C$DW$1849, DW_AT_type(*$C$DW$T$39)
   13872                      .dwattr $C$DW$1849, DW_AT_name("GPBDIR")
   13873                      .dwattr $C$DW$1849, DW_AT_TI_symbol_name("_GPBDIR")
   13874                      .dwattr $C$DW$1849, DW_AT_data_member_location[DW_OP_plus_uconst 0x1a]
   13875                      .dwattr $C$DW$1849, DW_AT_accessibility(DW_ACCESS_public)
   13876              
   13877              $C$DW$1850      .dwtag  DW_TAG_member
   13878                      .dwattr $C$DW$1850, DW_AT_type(*$C$DW$T$39)
   13879                      .dwattr $C$DW$1850, DW_AT_name("GPBPUD")
   13880                      .dwattr $C$DW$1850, DW_AT_TI_symbol_name("_GPBPUD")
   13881                      .dwattr $C$DW$1850, DW_AT_data_member_location[DW_OP_plus_uconst 0x1c]
   13882                      .dwattr $C$DW$1850, DW_AT_accessibility(DW_ACCESS_public)
   13883              
   13884              $C$DW$1851      .dwtag  DW_TAG_member
   13885                      .dwattr $C$DW$1851, DW_AT_type(*$C$DW$T$40)
   13886                      .dwattr $C$DW$1851, DW_AT_name("rsvd_4")
   13887                      .dwattr $C$DW$1851, DW_AT_TI_symbol_name("_rsvd_4")
   13888                      .dwattr $C$DW$1851, DW_AT_data_member_location[DW_OP_plus_uconst 0x1e]
   13889                      .dwattr $C$DW$1851, DW_AT_accessibility(DW_ACCESS_public)
   13890              
   13891              $C$DW$1852      .dwtag  DW_TAG_member
   13892                      .dwattr $C$DW$1852, DW_AT_type(*$C$DW$T$39)
   13893                      .dwattr $C$DW$1852, DW_AT_name("AIOMUX1")
   13894                      .dwattr $C$DW$1852, DW_AT_TI_symbol_name("_AIOMUX1")
   13895                      .dwattr $C$DW$1852, DW_AT_data_member_location[DW_OP_plus_uconst 0x36]
   13896                      .dwattr $C$DW$1852, DW_AT_accessibility(DW_ACCESS_public)
   13897              
   13898              $C$DW$1853      .dwtag  DW_TAG_member
   13899                      .dwattr $C$DW$1853, DW_AT_type(*$C$DW$T$26)
   13900                      .dwattr $C$DW$1853, DW_AT_name("rsvd_5")
   13901                      .dwattr $C$DW$1853, DW_AT_TI_symbol_name("_rsvd_5")
   13902                      .dwattr $C$DW$1853, DW_AT_data_member_location[DW_OP_plus_uconst 0x38]
   13903                      .dwattr $C$DW$1853, DW_AT_accessibility(DW_ACCESS_public)
TMS320C2000 Assembler PC v15.12.3 Tue Aug 29 09:30:33 2017

Tools Copyright (c) 1996-2015 Texas Instruments Incorporated
C:\Users\wmj\AppData\Local\Temp\0326810                              PAGE  263

   13904              
   13905              $C$DW$1854      .dwtag  DW_TAG_member
   13906                      .dwattr $C$DW$1854, DW_AT_type(*$C$DW$T$39)
   13907                      .dwattr $C$DW$1854, DW_AT_name("AIODIR")
   13908                      .dwattr $C$DW$1854, DW_AT_TI_symbol_name("_AIODIR")
   13909                      .dwattr $C$DW$1854, DW_AT_data_member_location[DW_OP_plus_uconst 0x3a]
   13910                      .dwattr $C$DW$1854, DW_AT_accessibility(DW_ACCESS_public)
   13911              
   13912              $C$DW$1855      .dwtag  DW_TAG_member
   13913                      .dwattr $C$DW$1855, DW_AT_type(*$C$DW$T$41)
   13914                      .dwattr $C$DW$1855, DW_AT_name("rsvd_6")
   13915                      .dwattr $C$DW$1855, DW_AT_TI_symbol_name("_rsvd_6")
   13916                      .dwattr $C$DW$1855, DW_AT_data_member_location[DW_OP_plus_uconst 0x3c]
   13917                      .dwattr $C$DW$1855, DW_AT_accessibility(DW_ACCESS_public)
   13918              
   13919              $C$DW$1856      .dwtag  DW_TAG_member
   13920                      .dwattr $C$DW$1856, DW_AT_type(*$C$DW$T$39)
   13921                      .dwattr $C$DW$1856, DW_AT_name("GPADAT")
   13922                      .dwattr $C$DW$1856, DW_AT_TI_symbol_name("_GPADAT")
   13923                      .dwattr $C$DW$1856, DW_AT_data_member_location[DW_OP_plus_uconst 0x40]
   13924                      .dwattr $C$DW$1856, DW_AT_accessibility(DW_ACCESS_public)
   13925              
   13926              $C$DW$1857      .dwtag  DW_TAG_member
   13927                      .dwattr $C$DW$1857, DW_AT_type(*$C$DW$T$39)
   13928                      .dwattr $C$DW$1857, DW_AT_name("GPASET")
   13929                      .dwattr $C$DW$1857, DW_AT_TI_symbol_name("_GPASET")
   13930                      .dwattr $C$DW$1857, DW_AT_data_member_location[DW_OP_plus_uconst 0x42]
   13931                      .dwattr $C$DW$1857, DW_AT_accessibility(DW_ACCESS_public)
   13932              
   13933              $C$DW$1858      .dwtag  DW_TAG_member
   13934                      .dwattr $C$DW$1858, DW_AT_type(*$C$DW$T$39)
   13935                      .dwattr $C$DW$1858, DW_AT_name("GPACLEAR")
   13936                      .dwattr $C$DW$1858, DW_AT_TI_symbol_name("_GPACLEAR")
   13937                      .dwattr $C$DW$1858, DW_AT_data_member_location[DW_OP_plus_uconst 0x44]
   13938                      .dwattr $C$DW$1858, DW_AT_accessibility(DW_ACCESS_public)
   13939              
   13940              $C$DW$1859      .dwtag  DW_TAG_member
   13941                      .dwattr $C$DW$1859, DW_AT_type(*$C$DW$T$39)
   13942                      .dwattr $C$DW$1859, DW_AT_name("GPATOGGLE")
   13943                      .dwattr $C$DW$1859, DW_AT_TI_symbol_name("_GPATOGGLE")
   13944                      .dwattr $C$DW$1859, DW_AT_data_member_location[DW_OP_plus_uconst 0x46]
   13945                      .dwattr $C$DW$1859, DW_AT_accessibility(DW_ACCESS_public)
   13946              
   13947              $C$DW$1860      .dwtag  DW_TAG_member
   13948                      .dwattr $C$DW$1860, DW_AT_type(*$C$DW$T$39)
   13949                      .dwattr $C$DW$1860, DW_AT_name("GPBDAT")
   13950                      .dwattr $C$DW$1860, DW_AT_TI_symbol_name("_GPBDAT")
   13951                      .dwattr $C$DW$1860, DW_AT_data_member_location[DW_OP_plus_uconst 0x48]
   13952                      .dwattr $C$DW$1860, DW_AT_accessibility(DW_ACCESS_public)
   13953              
   13954              $C$DW$1861      .dwtag  DW_TAG_member
   13955                      .dwattr $C$DW$1861, DW_AT_type(*$C$DW$T$39)
   13956                      .dwattr $C$DW$1861, DW_AT_name("GPBSET")
   13957                      .dwattr $C$DW$1861, DW_AT_TI_symbol_name("_GPBSET")
   13958                      .dwattr $C$DW$1861, DW_AT_data_member_location[DW_OP_plus_uconst 0x4a]
TMS320C2000 Assembler PC v15.12.3 Tue Aug 29 09:30:33 2017

Tools Copyright (c) 1996-2015 Texas Instruments Incorporated
C:\Users\wmj\AppData\Local\Temp\0326810                              PAGE  264

   13959                      .dwattr $C$DW$1861, DW_AT_accessibility(DW_ACCESS_public)
   13960              
   13961              $C$DW$1862      .dwtag  DW_TAG_member
   13962                      .dwattr $C$DW$1862, DW_AT_type(*$C$DW$T$39)
   13963                      .dwattr $C$DW$1862, DW_AT_name("GPBCLEAR")
   13964                      .dwattr $C$DW$1862, DW_AT_TI_symbol_name("_GPBCLEAR")
   13965                      .dwattr $C$DW$1862, DW_AT_data_member_location[DW_OP_plus_uconst 0x4c]
   13966                      .dwattr $C$DW$1862, DW_AT_accessibility(DW_ACCESS_public)
   13967              
   13968              $C$DW$1863      .dwtag  DW_TAG_member
   13969                      .dwattr $C$DW$1863, DW_AT_type(*$C$DW$T$39)
   13970                      .dwattr $C$DW$1863, DW_AT_name("GPBTOGGLE")
   13971                      .dwattr $C$DW$1863, DW_AT_TI_symbol_name("_GPBTOGGLE")
   13972                      .dwattr $C$DW$1863, DW_AT_data_member_location[DW_OP_plus_uconst 0x4e]
   13973                      .dwattr $C$DW$1863, DW_AT_accessibility(DW_ACCESS_public)
   13974              
   13975              $C$DW$1864      .dwtag  DW_TAG_member
   13976                      .dwattr $C$DW$1864, DW_AT_type(*$C$DW$T$31)
   13977                      .dwattr $C$DW$1864, DW_AT_name("rsvd_7")
   13978                      .dwattr $C$DW$1864, DW_AT_TI_symbol_name("_rsvd_7")
   13979                      .dwattr $C$DW$1864, DW_AT_data_member_location[DW_OP_plus_uconst 0x50]
   13980                      .dwattr $C$DW$1864, DW_AT_accessibility(DW_ACCESS_public)
   13981              
   13982              $C$DW$1865      .dwtag  DW_TAG_member
   13983                      .dwattr $C$DW$1865, DW_AT_type(*$C$DW$T$39)
   13984                      .dwattr $C$DW$1865, DW_AT_name("AIODAT")
   13985                      .dwattr $C$DW$1865, DW_AT_TI_symbol_name("_AIODAT")
   13986                      .dwattr $C$DW$1865, DW_AT_data_member_location[DW_OP_plus_uconst 0x58]
   13987                      .dwattr $C$DW$1865, DW_AT_accessibility(DW_ACCESS_public)
   13988              
   13989              $C$DW$1866      .dwtag  DW_TAG_member
   13990                      .dwattr $C$DW$1866, DW_AT_type(*$C$DW$T$39)
   13991                      .dwattr $C$DW$1866, DW_AT_name("AIOSET")
   13992                      .dwattr $C$DW$1866, DW_AT_TI_symbol_name("_AIOSET")
   13993                      .dwattr $C$DW$1866, DW_AT_data_member_location[DW_OP_plus_uconst 0x5a]
   13994                      .dwattr $C$DW$1866, DW_AT_accessibility(DW_ACCESS_public)
   13995              
   13996              $C$DW$1867      .dwtag  DW_TAG_member
   13997                      .dwattr $C$DW$1867, DW_AT_type(*$C$DW$T$39)
   13998                      .dwattr $C$DW$1867, DW_AT_name("AIOCLEAR")
   13999                      .dwattr $C$DW$1867, DW_AT_TI_symbol_name("_AIOCLEAR")
   14000                      .dwattr $C$DW$1867, DW_AT_data_member_location[DW_OP_plus_uconst 0x5c]
   14001                      .dwattr $C$DW$1867, DW_AT_accessibility(DW_ACCESS_public)
   14002              
   14003              $C$DW$1868      .dwtag  DW_TAG_member
   14004                      .dwattr $C$DW$1868, DW_AT_type(*$C$DW$T$39)
   14005                      .dwattr $C$DW$1868, DW_AT_name("AIOTOGGLE")
   14006                      .dwattr $C$DW$1868, DW_AT_TI_symbol_name("_AIOTOGGLE")
   14007                      .dwattr $C$DW$1868, DW_AT_data_member_location[DW_OP_plus_uconst 0x5e]
   14008                      .dwattr $C$DW$1868, DW_AT_accessibility(DW_ACCESS_public)
   14009              
   14010              $C$DW$1869      .dwtag  DW_TAG_member
   14011                      .dwattr $C$DW$1869, DW_AT_type(*$C$DW$T$28)
   14012                      .dwattr $C$DW$1869, DW_AT_name("GPIOXINTnSEL")
   14013                      .dwattr $C$DW$1869, DW_AT_TI_symbol_name("_GPIOXINTnSEL")
TMS320C2000 Assembler PC v15.12.3 Tue Aug 29 09:30:33 2017

Tools Copyright (c) 1996-2015 Texas Instruments Incorporated
C:\Users\wmj\AppData\Local\Temp\0326810                              PAGE  265

   14014                      .dwattr $C$DW$1869, DW_AT_data_member_location[DW_OP_plus_uconst 0x60]
   14015                      .dwattr $C$DW$1869, DW_AT_accessibility(DW_ACCESS_public)
   14016              
   14017              $C$DW$1870      .dwtag  DW_TAG_member
   14018                      .dwattr $C$DW$1870, DW_AT_type(*$C$DW$T$27)
   14019                      .dwattr $C$DW$1870, DW_AT_name("rsvd_8")
   14020                      .dwattr $C$DW$1870, DW_AT_TI_symbol_name("_rsvd_8")
   14021                      .dwattr $C$DW$1870, DW_AT_data_member_location[DW_OP_plus_uconst 0x63]
   14022                      .dwattr $C$DW$1870, DW_AT_accessibility(DW_ACCESS_public)
   14023              
   14024              $C$DW$1871      .dwtag  DW_TAG_member
   14025                      .dwattr $C$DW$1871, DW_AT_type(*$C$DW$T$39)
   14026                      .dwattr $C$DW$1871, DW_AT_name("GPIOLPMSEL")
   14027                      .dwattr $C$DW$1871, DW_AT_TI_symbol_name("_GPIOLPMSEL")
   14028                      .dwattr $C$DW$1871, DW_AT_data_member_location[DW_OP_plus_uconst 0x68]
   14029                      .dwattr $C$DW$1871, DW_AT_accessibility(DW_ACCESS_public)
   14030              
   14031                      .dwendtag $C$DW$T$42
   14032              
   14033              $C$DW$T$58      .dwtag  DW_TAG_pointer_type
   14034                      .dwattr $C$DW$T$58, DW_AT_type(*$C$DW$T$42)
   14035                      .dwattr $C$DW$T$58, DW_AT_address_class(0x20)
   14036              
   14037              $C$DW$T$59      .dwtag  DW_TAG_typedef
   14038                      .dwattr $C$DW$T$59, DW_AT_name("GPIO_Handle")
   14039                      .dwattr $C$DW$T$59, DW_AT_type(*$C$DW$T$58)
   14040                      .dwattr $C$DW$T$59, DW_AT_language(DW_LANG_C)
   14041              
   14042              
   14043              $C$DW$T$44      .dwtag  DW_TAG_structure_type
   14044                      .dwattr $C$DW$T$44, DW_AT_name("_HAL_AdcData_t_")
   14045                      .dwattr $C$DW$T$44, DW_AT_byte_size(0x16)
   14046              $C$DW$1872      .dwtag  DW_TAG_member
   14047                      .dwattr $C$DW$1872, DW_AT_type(*$C$DW$T$43)
   14048                      .dwattr $C$DW$1872, DW_AT_name("I")
   14049                      .dwattr $C$DW$1872, DW_AT_TI_symbol_name("_I")
   14050                      .dwattr $C$DW$1872, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
   14051                      .dwattr $C$DW$1872, DW_AT_accessibility(DW_ACCESS_public)
   14052              
   14053              $C$DW$1873      .dwtag  DW_TAG_member
   14054                      .dwattr $C$DW$1873, DW_AT_type(*$C$DW$T$43)
   14055                      .dwattr $C$DW$1873, DW_AT_name("V")
   14056                      .dwattr $C$DW$1873, DW_AT_TI_symbol_name("_V")
   14057                      .dwattr $C$DW$1873, DW_AT_data_member_location[DW_OP_plus_uconst 0x6]
   14058                      .dwattr $C$DW$1873, DW_AT_accessibility(DW_ACCESS_public)
   14059              
   14060              $C$DW$1874      .dwtag  DW_TAG_member
   14061                      .dwattr $C$DW$1874, DW_AT_type(*$C$DW$T$35)
   14062                      .dwattr $C$DW$1874, DW_AT_name("dcBus")
   14063                      .dwattr $C$DW$1874, DW_AT_TI_symbol_name("_dcBus")
   14064                      .dwattr $C$DW$1874, DW_AT_data_member_location[DW_OP_plus_uconst 0xc]
   14065                      .dwattr $C$DW$1874, DW_AT_accessibility(DW_ACCESS_public)
   14066              
   14067              $C$DW$1875      .dwtag  DW_TAG_member
   14068                      .dwattr $C$DW$1875, DW_AT_type(*$C$DW$T$35)
TMS320C2000 Assembler PC v15.12.3 Tue Aug 29 09:30:33 2017

Tools Copyright (c) 1996-2015 Texas Instruments Incorporated
C:\Users\wmj\AppData\Local\Temp\0326810                              PAGE  266

   14069                      .dwattr $C$DW$1875, DW_AT_name("analogSensor1")
   14070                      .dwattr $C$DW$1875, DW_AT_TI_symbol_name("_analogSensor1")
   14071                      .dwattr $C$DW$1875, DW_AT_data_member_location[DW_OP_plus_uconst 0xe]
   14072                      .dwattr $C$DW$1875, DW_AT_accessibility(DW_ACCESS_public)
   14073              
   14074              $C$DW$1876      .dwtag  DW_TAG_member
   14075                      .dwattr $C$DW$1876, DW_AT_type(*$C$DW$T$35)
   14076                      .dwattr $C$DW$1876, DW_AT_name("analogSensor2")
   14077                      .dwattr $C$DW$1876, DW_AT_TI_symbol_name("_analogSensor2")
   14078                      .dwattr $C$DW$1876, DW_AT_data_member_location[DW_OP_plus_uconst 0x10]
   14079                      .dwattr $C$DW$1876, DW_AT_accessibility(DW_ACCESS_public)
   14080              
   14081              $C$DW$1877      .dwtag  DW_TAG_member
   14082                      .dwattr $C$DW$1877, DW_AT_type(*$C$DW$T$35)
   14083                      .dwattr $C$DW$1877, DW_AT_name("igbtNTC")
   14084                      .dwattr $C$DW$1877, DW_AT_TI_symbol_name("_igbtNTC")
   14085                      .dwattr $C$DW$1877, DW_AT_data_member_location[DW_OP_plus_uconst 0x12]
   14086                      .dwattr $C$DW$1877, DW_AT_accessibility(DW_ACCESS_public)
   14087              
   14088              $C$DW$1878      .dwtag  DW_TAG_member
   14089                      .dwattr $C$DW$1878, DW_AT_type(*$C$DW$T$35)
   14090                      .dwattr $C$DW$1878, DW_AT_name("boardAddr")
   14091                      .dwattr $C$DW$1878, DW_AT_TI_symbol_name("_boardAddr")
   14092                      .dwattr $C$DW$1878, DW_AT_data_member_location[DW_OP_plus_uconst 0x14]
   14093                      .dwattr $C$DW$1878, DW_AT_accessibility(DW_ACCESS_public)
   14094              
   14095                      .dwendtag $C$DW$T$44
   14096              
   14097              $C$DW$T$87      .dwtag  DW_TAG_typedef
   14098                      .dwattr $C$DW$T$87, DW_AT_name("HAL_AdcData_t")
   14099                      .dwattr $C$DW$T$87, DW_AT_type(*$C$DW$T$44)
   14100                      .dwattr $C$DW$T$87, DW_AT_language(DW_LANG_C)
   14101              
   14102              
   14103              $C$DW$T$49      .dwtag  DW_TAG_structure_type
   14104                      .dwattr $C$DW$T$49, DW_AT_name("_HAL_DacData_t_")
   14105                      .dwattr $C$DW$T$49, DW_AT_byte_size(0x22)
   14106              $C$DW$1879      .dwtag  DW_TAG_member
   14107                      .dwattr $C$DW$1879, DW_AT_type(*$C$DW$T$22)
   14108                      .dwattr $C$DW$1879, DW_AT_name("PeriodMax")
   14109                      .dwattr $C$DW$1879, DW_AT_TI_symbol_name("_PeriodMax")
   14110                      .dwattr $C$DW$1879, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
   14111                      .dwattr $C$DW$1879, DW_AT_accessibility(DW_ACCESS_public)
   14112              
   14113              $C$DW$1880      .dwtag  DW_TAG_member
   14114                      .dwattr $C$DW$1880, DW_AT_type(*$C$DW$T$47)
   14115                      .dwattr $C$DW$1880, DW_AT_name("ptrData")
   14116                      .dwattr $C$DW$1880, DW_AT_TI_symbol_name("_ptrData")
   14117                      .dwattr $C$DW$1880, DW_AT_data_member_location[DW_OP_plus_uconst 0x2]
   14118                      .dwattr $C$DW$1880, DW_AT_accessibility(DW_ACCESS_public)
   14119              
   14120              $C$DW$1881      .dwtag  DW_TAG_member
   14121                      .dwattr $C$DW$1881, DW_AT_type(*$C$DW$T$48)
   14122                      .dwattr $C$DW$1881, DW_AT_name("value")
   14123                      .dwattr $C$DW$1881, DW_AT_TI_symbol_name("_value")
TMS320C2000 Assembler PC v15.12.3 Tue Aug 29 09:30:33 2017

Tools Copyright (c) 1996-2015 Texas Instruments Incorporated
C:\Users\wmj\AppData\Local\Temp\0326810                              PAGE  267

   14124                      .dwattr $C$DW$1881, DW_AT_data_member_location[DW_OP_plus_uconst 0xa]
   14125                      .dwattr $C$DW$1881, DW_AT_accessibility(DW_ACCESS_public)
   14126              
   14127              $C$DW$1882      .dwtag  DW_TAG_member
   14128                      .dwattr $C$DW$1882, DW_AT_type(*$C$DW$T$48)
   14129                      .dwattr $C$DW$1882, DW_AT_name("offset")
   14130                      .dwattr $C$DW$1882, DW_AT_TI_symbol_name("_offset")
   14131                      .dwattr $C$DW$1882, DW_AT_data_member_location[DW_OP_plus_uconst 0x12]
   14132                      .dwattr $C$DW$1882, DW_AT_accessibility(DW_ACCESS_public)
   14133              
   14134              $C$DW$1883      .dwtag  DW_TAG_member
   14135                      .dwattr $C$DW$1883, DW_AT_type(*$C$DW$T$48)
   14136                      .dwattr $C$DW$1883, DW_AT_name("gain")
   14137                      .dwattr $C$DW$1883, DW_AT_TI_symbol_name("_gain")
   14138                      .dwattr $C$DW$1883, DW_AT_data_member_location[DW_OP_plus_uconst 0x1a]
   14139                      .dwattr $C$DW$1883, DW_AT_accessibility(DW_ACCESS_public)
   14140              
   14141                      .dwendtag $C$DW$T$49
   14142              
   14143              $C$DW$T$348     .dwtag  DW_TAG_typedef
   14144                      .dwattr $C$DW$T$348, DW_AT_name("HAL_DacData_t")
   14145                      .dwattr $C$DW$T$348, DW_AT_type(*$C$DW$T$49)
   14146                      .dwattr $C$DW$T$348, DW_AT_language(DW_LANG_C)
   14147              
   14148              $C$DW$T$349     .dwtag  DW_TAG_pointer_type
   14149                      .dwattr $C$DW$T$349, DW_AT_type(*$C$DW$T$348)
   14150                      .dwattr $C$DW$T$349, DW_AT_address_class(0x20)
   14151              
   14152              $C$DW$1884      .dwtag  DW_TAG_TI_far_type
   14153                      .dwattr $C$DW$1884, DW_AT_type(*$C$DW$T$349)
   14154              
   14155              $C$DW$T$350     .dwtag  DW_TAG_const_type
   14156                      .dwattr $C$DW$T$350, DW_AT_type(*$C$DW$1884)
   14157              
   14158              
   14159              $C$DW$T$88      .dwtag  DW_TAG_structure_type
   14160                      .dwattr $C$DW$T$88, DW_AT_name("_HAL_Obj_")
   14161                      .dwattr $C$DW$T$88, DW_AT_byte_size(0xb4)
   14162              $C$DW$1885      .dwtag  DW_TAG_member
   14163                      .dwattr $C$DW$1885, DW_AT_type(*$C$DW$T$51)
   14164                      .dwattr $C$DW$1885, DW_AT_name("adcHandle")
   14165                      .dwattr $C$DW$1885, DW_AT_TI_symbol_name("_adcHandle")
   14166                      .dwattr $C$DW$1885, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
   14167                      .dwattr $C$DW$1885, DW_AT_accessibility(DW_ACCESS_public)
   14168              
   14169              $C$DW$1886      .dwtag  DW_TAG_member
   14170                      .dwattr $C$DW$1886, DW_AT_type(*$C$DW$T$53)
   14171                      .dwattr $C$DW$1886, DW_AT_name("clkHandle")
   14172                      .dwattr $C$DW$1886, DW_AT_TI_symbol_name("_clkHandle")
   14173                      .dwattr $C$DW$1886, DW_AT_data_member_location[DW_OP_plus_uconst 0x2]
   14174                      .dwattr $C$DW$1886, DW_AT_accessibility(DW_ACCESS_public)
   14175              
   14176              $C$DW$1887      .dwtag  DW_TAG_member
   14177                      .dwattr $C$DW$1887, DW_AT_type(*$C$DW$T$55)
   14178                      .dwattr $C$DW$1887, DW_AT_name("cpuHandle")
TMS320C2000 Assembler PC v15.12.3 Tue Aug 29 09:30:33 2017

Tools Copyright (c) 1996-2015 Texas Instruments Incorporated
C:\Users\wmj\AppData\Local\Temp\0326810                              PAGE  268

   14179                      .dwattr $C$DW$1887, DW_AT_TI_symbol_name("_cpuHandle")
   14180                      .dwattr $C$DW$1887, DW_AT_data_member_location[DW_OP_plus_uconst 0x4]
   14181                      .dwattr $C$DW$1887, DW_AT_accessibility(DW_ACCESS_public)
   14182              
   14183              $C$DW$1888      .dwtag  DW_TAG_member
   14184                      .dwattr $C$DW$1888, DW_AT_type(*$C$DW$T$57)
   14185                      .dwattr $C$DW$1888, DW_AT_name("flashHandle")
   14186                      .dwattr $C$DW$1888, DW_AT_TI_symbol_name("_flashHandle")
   14187                      .dwattr $C$DW$1888, DW_AT_data_member_location[DW_OP_plus_uconst 0x6]
   14188                      .dwattr $C$DW$1888, DW_AT_accessibility(DW_ACCESS_public)
   14189              
   14190              $C$DW$1889      .dwtag  DW_TAG_member
   14191                      .dwattr $C$DW$1889, DW_AT_type(*$C$DW$T$59)
   14192                      .dwattr $C$DW$1889, DW_AT_name("gpioHandle")
   14193                      .dwattr $C$DW$1889, DW_AT_TI_symbol_name("_gpioHandle")
   14194                      .dwattr $C$DW$1889, DW_AT_data_member_location[DW_OP_plus_uconst 0x8]
   14195                      .dwattr $C$DW$1889, DW_AT_accessibility(DW_ACCESS_public)
   14196              
   14197              $C$DW$1890      .dwtag  DW_TAG_member
   14198                      .dwattr $C$DW$1890, DW_AT_type(*$C$DW$T$62)
   14199                      .dwattr $C$DW$1890, DW_AT_name("offsetHandle_I")
   14200                      .dwattr $C$DW$1890, DW_AT_TI_symbol_name("_offsetHandle_I")
   14201                      .dwattr $C$DW$1890, DW_AT_data_member_location[DW_OP_plus_uconst 0xa]
   14202                      .dwattr $C$DW$1890, DW_AT_accessibility(DW_ACCESS_public)
   14203              
   14204              $C$DW$1891      .dwtag  DW_TAG_member
   14205                      .dwattr $C$DW$1891, DW_AT_type(*$C$DW$T$64)
   14206                      .dwattr $C$DW$1891, DW_AT_name("offset_I")
   14207                      .dwattr $C$DW$1891, DW_AT_TI_symbol_name("_offset_I")
   14208                      .dwattr $C$DW$1891, DW_AT_data_member_location[DW_OP_plus_uconst 0x10]
   14209                      .dwattr $C$DW$1891, DW_AT_accessibility(DW_ACCESS_public)
   14210              
   14211              $C$DW$1892      .dwtag  DW_TAG_member
   14212                      .dwattr $C$DW$1892, DW_AT_type(*$C$DW$T$62)
   14213                      .dwattr $C$DW$1892, DW_AT_name("offsetHandle_V")
   14214                      .dwattr $C$DW$1892, DW_AT_TI_symbol_name("_offsetHandle_V")
   14215                      .dwattr $C$DW$1892, DW_AT_data_member_location[DW_OP_plus_uconst 0x40]
   14216                      .dwattr $C$DW$1892, DW_AT_accessibility(DW_ACCESS_public)
   14217              
   14218              $C$DW$1893      .dwtag  DW_TAG_member
   14219                      .dwattr $C$DW$1893, DW_AT_type(*$C$DW$T$64)
   14220                      .dwattr $C$DW$1893, DW_AT_name("offset_V")
   14221                      .dwattr $C$DW$1893, DW_AT_TI_symbol_name("_offset_V")
   14222                      .dwattr $C$DW$1893, DW_AT_data_member_location[DW_OP_plus_uconst 0x46]
   14223                      .dwattr $C$DW$1893, DW_AT_accessibility(DW_ACCESS_public)
   14224              
   14225              $C$DW$1894      .dwtag  DW_TAG_member
   14226                      .dwattr $C$DW$1894, DW_AT_type(*$C$DW$T$66)
   14227                      .dwattr $C$DW$1894, DW_AT_name("oscHandle")
   14228                      .dwattr $C$DW$1894, DW_AT_TI_symbol_name("_oscHandle")
   14229                      .dwattr $C$DW$1894, DW_AT_data_member_location[DW_OP_plus_uconst 0x76]
   14230                      .dwattr $C$DW$1894, DW_AT_accessibility(DW_ACCESS_public)
   14231              
   14232              $C$DW$1895      .dwtag  DW_TAG_member
   14233                      .dwattr $C$DW$1895, DW_AT_type(*$C$DW$T$68)
TMS320C2000 Assembler PC v15.12.3 Tue Aug 29 09:30:33 2017

Tools Copyright (c) 1996-2015 Texas Instruments Incorporated
C:\Users\wmj\AppData\Local\Temp\0326810                              PAGE  269

   14234                      .dwattr $C$DW$1895, DW_AT_name("pieHandle")
   14235                      .dwattr $C$DW$1895, DW_AT_TI_symbol_name("_pieHandle")
   14236                      .dwattr $C$DW$1895, DW_AT_data_member_location[DW_OP_plus_uconst 0x78]
   14237                      .dwattr $C$DW$1895, DW_AT_accessibility(DW_ACCESS_public)
   14238              
   14239              $C$DW$1896      .dwtag  DW_TAG_member
   14240                      .dwattr $C$DW$1896, DW_AT_type(*$C$DW$T$70)
   14241                      .dwattr $C$DW$1896, DW_AT_name("pllHandle")
   14242                      .dwattr $C$DW$1896, DW_AT_TI_symbol_name("_pllHandle")
   14243                      .dwattr $C$DW$1896, DW_AT_data_member_location[DW_OP_plus_uconst 0x7a]
   14244                      .dwattr $C$DW$1896, DW_AT_accessibility(DW_ACCESS_public)
   14245              
   14246              $C$DW$1897      .dwtag  DW_TAG_member
   14247                      .dwattr $C$DW$1897, DW_AT_type(*$C$DW$T$73)
   14248                      .dwattr $C$DW$1897, DW_AT_name("pwmHandle")
   14249                      .dwattr $C$DW$1897, DW_AT_TI_symbol_name("_pwmHandle")
   14250                      .dwattr $C$DW$1897, DW_AT_data_member_location[DW_OP_plus_uconst 0x7c]
   14251                      .dwattr $C$DW$1897, DW_AT_accessibility(DW_ACCESS_public)
   14252              
   14253              $C$DW$1898      .dwtag  DW_TAG_member
   14254                      .dwattr $C$DW$1898, DW_AT_type(*$C$DW$T$73)
   14255                      .dwattr $C$DW$1898, DW_AT_name("pwmDacHandle")
   14256                      .dwattr $C$DW$1898, DW_AT_TI_symbol_name("_pwmDacHandle")
   14257                      .dwattr $C$DW$1898, DW_AT_data_member_location[DW_OP_plus_uconst 0x82]
   14258                      .dwattr $C$DW$1898, DW_AT_accessibility(DW_ACCESS_public)
   14259              
   14260              $C$DW$1899      .dwtag  DW_TAG_member
   14261                      .dwattr $C$DW$1899, DW_AT_type(*$C$DW$T$75)
   14262                      .dwattr $C$DW$1899, DW_AT_name("pwrHandle")
   14263                      .dwattr $C$DW$1899, DW_AT_TI_symbol_name("_pwrHandle")
   14264                      .dwattr $C$DW$1899, DW_AT_data_member_location[DW_OP_plus_uconst 0x88]
   14265                      .dwattr $C$DW$1899, DW_AT_accessibility(DW_ACCESS_public)
   14266              
   14267              $C$DW$1900      .dwtag  DW_TAG_member
   14268                      .dwattr $C$DW$1900, DW_AT_type(*$C$DW$T$78)
   14269                      .dwattr $C$DW$1900, DW_AT_name("timerHandle")
   14270                      .dwattr $C$DW$1900, DW_AT_TI_symbol_name("_timerHandle")
   14271                      .dwattr $C$DW$1900, DW_AT_data_member_location[DW_OP_plus_uconst 0x8a]
   14272                      .dwattr $C$DW$1900, DW_AT_accessibility(DW_ACCESS_public)
   14273              
   14274              $C$DW$1901      .dwtag  DW_TAG_member
   14275                      .dwattr $C$DW$1901, DW_AT_type(*$C$DW$T$80)
   14276                      .dwattr $C$DW$1901, DW_AT_name("i2cHandle")
   14277                      .dwattr $C$DW$1901, DW_AT_TI_symbol_name("_i2cHandle")
   14278                      .dwattr $C$DW$1901, DW_AT_data_member_location[DW_OP_plus_uconst 0x90]
   14279                      .dwattr $C$DW$1901, DW_AT_accessibility(DW_ACCESS_public)
   14280              
   14281              $C$DW$1902      .dwtag  DW_TAG_member
   14282                      .dwattr $C$DW$1902, DW_AT_type(*$C$DW$T$82)
   14283                      .dwattr $C$DW$1902, DW_AT_name("spiAHandle")
   14284                      .dwattr $C$DW$1902, DW_AT_TI_symbol_name("_spiAHandle")
   14285                      .dwattr $C$DW$1902, DW_AT_data_member_location[DW_OP_plus_uconst 0x92]
   14286                      .dwattr $C$DW$1902, DW_AT_accessibility(DW_ACCESS_public)
   14287              
   14288              $C$DW$1903      .dwtag  DW_TAG_member
TMS320C2000 Assembler PC v15.12.3 Tue Aug 29 09:30:33 2017

Tools Copyright (c) 1996-2015 Texas Instruments Incorporated
C:\Users\wmj\AppData\Local\Temp\0326810                              PAGE  270

   14289                      .dwattr $C$DW$1903, DW_AT_type(*$C$DW$T$84)
   14290                      .dwattr $C$DW$1903, DW_AT_name("wdogHandle")
   14291                      .dwattr $C$DW$1903, DW_AT_TI_symbol_name("_wdogHandle")
   14292                      .dwattr $C$DW$1903, DW_AT_data_member_location[DW_OP_plus_uconst 0x94]
   14293                      .dwattr $C$DW$1903, DW_AT_accessibility(DW_ACCESS_public)
   14294              
   14295              $C$DW$1904      .dwtag  DW_TAG_member
   14296                      .dwattr $C$DW$1904, DW_AT_type(*$C$DW$T$86)
   14297                      .dwattr $C$DW$1904, DW_AT_name("sciHandle")
   14298                      .dwattr $C$DW$1904, DW_AT_TI_symbol_name("_sciHandle")
   14299                      .dwattr $C$DW$1904, DW_AT_data_member_location[DW_OP_plus_uconst 0x96]
   14300                      .dwattr $C$DW$1904, DW_AT_accessibility(DW_ACCESS_public)
   14301              
   14302              $C$DW$1905      .dwtag  DW_TAG_member
   14303                      .dwattr $C$DW$1905, DW_AT_type(*$C$DW$T$87)
   14304                      .dwattr $C$DW$1905, DW_AT_name("adcBias")
   14305                      .dwattr $C$DW$1905, DW_AT_TI_symbol_name("_adcBias")
   14306                      .dwattr $C$DW$1905, DW_AT_data_member_location[DW_OP_plus_uconst 0x98]
   14307                      .dwattr $C$DW$1905, DW_AT_accessibility(DW_ACCESS_public)
   14308              
   14309              $C$DW$1906      .dwtag  DW_TAG_member
   14310                      .dwattr $C$DW$1906, DW_AT_type(*$C$DW$T$35)
   14311                      .dwattr $C$DW$1906, DW_AT_name("current_sf")
   14312                      .dwattr $C$DW$1906, DW_AT_TI_symbol_name("_current_sf")
   14313                      .dwattr $C$DW$1906, DW_AT_data_member_location[DW_OP_plus_uconst 0xae]
   14314                      .dwattr $C$DW$1906, DW_AT_accessibility(DW_ACCESS_public)
   14315              
   14316              $C$DW$1907      .dwtag  DW_TAG_member
   14317                      .dwattr $C$DW$1907, DW_AT_type(*$C$DW$T$35)
   14318                      .dwattr $C$DW$1907, DW_AT_name("voltage_sf")
   14319                      .dwattr $C$DW$1907, DW_AT_TI_symbol_name("_voltage_sf")
   14320                      .dwattr $C$DW$1907, DW_AT_data_member_location[DW_OP_plus_uconst 0xb0]
   14321                      .dwattr $C$DW$1907, DW_AT_accessibility(DW_ACCESS_public)
   14322              
   14323              $C$DW$1908      .dwtag  DW_TAG_member
   14324                      .dwattr $C$DW$1908, DW_AT_type(*$C$DW$T$33)
   14325                      .dwattr $C$DW$1908, DW_AT_name("numCurrentSensors")
   14326                      .dwattr $C$DW$1908, DW_AT_TI_symbol_name("_numCurrentSensors")
   14327                      .dwattr $C$DW$1908, DW_AT_data_member_location[DW_OP_plus_uconst 0xb2]
   14328                      .dwattr $C$DW$1908, DW_AT_accessibility(DW_ACCESS_public)
   14329              
   14330              $C$DW$1909      .dwtag  DW_TAG_member
   14331                      .dwattr $C$DW$1909, DW_AT_type(*$C$DW$T$33)
   14332                      .dwattr $C$DW$1909, DW_AT_name("numVoltageSensors")
   14333                      .dwattr $C$DW$1909, DW_AT_TI_symbol_name("_numVoltageSensors")
   14334                      .dwattr $C$DW$1909, DW_AT_data_member_location[DW_OP_plus_uconst 0xb3]
   14335                      .dwattr $C$DW$1909, DW_AT_accessibility(DW_ACCESS_public)
   14336              
   14337                      .dwendtag $C$DW$T$88
   14338              
   14339              $C$DW$T$353     .dwtag  DW_TAG_typedef
   14340                      .dwattr $C$DW$T$353, DW_AT_name("HAL_Obj")
   14341                      .dwattr $C$DW$T$353, DW_AT_type(*$C$DW$T$88)
   14342                      .dwattr $C$DW$T$353, DW_AT_language(DW_LANG_C)
   14343              
TMS320C2000 Assembler PC v15.12.3 Tue Aug 29 09:30:33 2017

Tools Copyright (c) 1996-2015 Texas Instruments Incorporated
C:\Users\wmj\AppData\Local\Temp\0326810                              PAGE  271

   14344              $C$DW$T$354     .dwtag  DW_TAG_pointer_type
   14345                      .dwattr $C$DW$T$354, DW_AT_type(*$C$DW$T$353)
   14346                      .dwattr $C$DW$T$354, DW_AT_address_class(0x20)
   14347              
   14348              $C$DW$T$355     .dwtag  DW_TAG_pointer_type
   14349                      .dwattr $C$DW$T$355, DW_AT_type(*$C$DW$T$88)
   14350                      .dwattr $C$DW$T$355, DW_AT_address_class(0x20)
   14351              
   14352              $C$DW$T$356     .dwtag  DW_TAG_typedef
   14353                      .dwattr $C$DW$T$356, DW_AT_name("HAL_Handle")
   14354                      .dwattr $C$DW$T$356, DW_AT_type(*$C$DW$T$355)
   14355                      .dwattr $C$DW$T$356, DW_AT_language(DW_LANG_C)
   14356              
   14357              $C$DW$1910      .dwtag  DW_TAG_TI_far_type
   14358                      .dwattr $C$DW$1910, DW_AT_type(*$C$DW$T$356)
   14359              
   14360              $C$DW$T$357     .dwtag  DW_TAG_const_type
   14361                      .dwattr $C$DW$T$357, DW_AT_type(*$C$DW$1910)
   14362              
   14363              
   14364              $C$DW$T$90      .dwtag  DW_TAG_structure_type
   14365                      .dwattr $C$DW$T$90, DW_AT_name("_MATH_vec3_")
   14366                      .dwattr $C$DW$T$90, DW_AT_byte_size(0x06)
   14367              $C$DW$1911      .dwtag  DW_TAG_member
   14368                      .dwattr $C$DW$1911, DW_AT_type(*$C$DW$T$89)
   14369                      .dwattr $C$DW$1911, DW_AT_name("value")
   14370                      .dwattr $C$DW$1911, DW_AT_TI_symbol_name("_value")
   14371                      .dwattr $C$DW$1911, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
   14372                      .dwattr $C$DW$1911, DW_AT_accessibility(DW_ACCESS_public)
   14373              
   14374                      .dwendtag $C$DW$T$90
   14375              
   14376              $C$DW$T$43      .dwtag  DW_TAG_typedef
   14377                      .dwattr $C$DW$T$43, DW_AT_name("MATH_vec3")
   14378                      .dwattr $C$DW$T$43, DW_AT_type(*$C$DW$T$90)
   14379                      .dwattr $C$DW$T$43, DW_AT_language(DW_LANG_C)
   14380              
   14381              
   14382              $C$DW$T$94      .dwtag  DW_TAG_structure_type
   14383                      .dwattr $C$DW$T$94, DW_AT_name("_OFFSET_")
   14384                      .dwattr $C$DW$T$94, DW_AT_byte_size(0x10)
   14385              $C$DW$1912      .dwtag  DW_TAG_member
   14386                      .dwattr $C$DW$1912, DW_AT_type(*$C$DW$T$35)
   14387                      .dwattr $C$DW$1912, DW_AT_name("value")
   14388                      .dwattr $C$DW$1912, DW_AT_TI_symbol_name("_value")
   14389                      .dwattr $C$DW$1912, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
   14390                      .dwattr $C$DW$1912, DW_AT_accessibility(DW_ACCESS_public)
   14391              
   14392              $C$DW$1913      .dwtag  DW_TAG_member
   14393                      .dwattr $C$DW$1913, DW_AT_type(*$C$DW$T$35)
   14394                      .dwattr $C$DW$1913, DW_AT_name("bias")
   14395                      .dwattr $C$DW$1913, DW_AT_TI_symbol_name("_bias")
   14396                      .dwattr $C$DW$1913, DW_AT_data_member_location[DW_OP_plus_uconst 0x2]
   14397                      .dwattr $C$DW$1913, DW_AT_accessibility(DW_ACCESS_public)
   14398              
TMS320C2000 Assembler PC v15.12.3 Tue Aug 29 09:30:33 2017

Tools Copyright (c) 1996-2015 Texas Instruments Incorporated
C:\Users\wmj\AppData\Local\Temp\0326810                              PAGE  272

   14399              $C$DW$1914      .dwtag  DW_TAG_member
   14400                      .dwattr $C$DW$1914, DW_AT_type(*$C$DW$T$91)
   14401                      .dwattr $C$DW$1914, DW_AT_name("filter")
   14402                      .dwattr $C$DW$1914, DW_AT_TI_symbol_name("_filter")
   14403                      .dwattr $C$DW$1914, DW_AT_data_member_location[DW_OP_plus_uconst 0x4]
   14404                      .dwattr $C$DW$1914, DW_AT_accessibility(DW_ACCESS_public)
   14405              
   14406              $C$DW$1915      .dwtag  DW_TAG_member
   14407                      .dwattr $C$DW$1915, DW_AT_type(*$C$DW$T$93)
   14408                      .dwattr $C$DW$1915, DW_AT_name("filterHandle")
   14409                      .dwattr $C$DW$1915, DW_AT_TI_symbol_name("_filterHandle")
   14410                      .dwattr $C$DW$1915, DW_AT_data_member_location[DW_OP_plus_uconst 0xe]
   14411                      .dwattr $C$DW$1915, DW_AT_accessibility(DW_ACCESS_public)
   14412              
   14413                      .dwendtag $C$DW$T$94
   14414              
   14415              $C$DW$T$63      .dwtag  DW_TAG_typedef
   14416                      .dwattr $C$DW$T$63, DW_AT_name("OFFSET_Obj")
   14417                      .dwattr $C$DW$T$63, DW_AT_type(*$C$DW$T$94)
   14418                      .dwattr $C$DW$T$63, DW_AT_language(DW_LANG_C)
   14419              
   14420              
   14421              $C$DW$T$64      .dwtag  DW_TAG_array_type
   14422                      .dwattr $C$DW$T$64, DW_AT_type(*$C$DW$T$63)
   14423                      .dwattr $C$DW$T$64, DW_AT_language(DW_LANG_C)
   14424                      .dwattr $C$DW$T$64, DW_AT_byte_size(0x30)
   14425              $C$DW$1916      .dwtag  DW_TAG_subrange_type
   14426                      .dwattr $C$DW$1916, DW_AT_upper_bound(0x02)
   14427              
   14428                      .dwendtag $C$DW$T$64
   14429              
   14430              
   14431              $C$DW$T$21      .dwtag  DW_TAG_structure_type
   14432                      .dwattr $C$DW$T$21, DW_AT_name("_OFFSET_Obj_")
   14433                      .dwattr $C$DW$T$21, DW_AT_declaration
   14434                      .dwendtag $C$DW$T$21
   14435              
   14436              $C$DW$T$60      .dwtag  DW_TAG_pointer_type
   14437                      .dwattr $C$DW$T$60, DW_AT_type(*$C$DW$T$21)
   14438                      .dwattr $C$DW$T$60, DW_AT_address_class(0x20)
   14439              
   14440              $C$DW$T$61      .dwtag  DW_TAG_typedef
   14441                      .dwattr $C$DW$T$61, DW_AT_name("OFFSET_Handle")
   14442                      .dwattr $C$DW$T$61, DW_AT_type(*$C$DW$T$60)
   14443                      .dwattr $C$DW$T$61, DW_AT_language(DW_LANG_C)
   14444              
   14445              
   14446              $C$DW$T$62      .dwtag  DW_TAG_array_type
   14447                      .dwattr $C$DW$T$62, DW_AT_type(*$C$DW$T$61)
   14448                      .dwattr $C$DW$T$62, DW_AT_language(DW_LANG_C)
   14449                      .dwattr $C$DW$T$62, DW_AT_byte_size(0x06)
   14450              $C$DW$1917      .dwtag  DW_TAG_subrange_type
   14451                      .dwattr $C$DW$1917, DW_AT_upper_bound(0x02)
   14452              
   14453                      .dwendtag $C$DW$T$62
TMS320C2000 Assembler PC v15.12.3 Tue Aug 29 09:30:33 2017

Tools Copyright (c) 1996-2015 Texas Instruments Incorporated
C:\Users\wmj\AppData\Local\Temp\0326810                              PAGE  273

   14454              
   14455              
   14456              $C$DW$T$95      .dwtag  DW_TAG_structure_type
   14457                      .dwattr $C$DW$T$95, DW_AT_name("_OSC_Obj_")
   14458                      .dwattr $C$DW$T$95, DW_AT_byte_size(0x03)
   14459              $C$DW$1918      .dwtag  DW_TAG_member
   14460                      .dwattr $C$DW$1918, DW_AT_type(*$C$DW$T$23)
   14461                      .dwattr $C$DW$1918, DW_AT_name("INTOSC1TRIM")
   14462                      .dwattr $C$DW$1918, DW_AT_TI_symbol_name("_INTOSC1TRIM")
   14463                      .dwattr $C$DW$1918, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
   14464                      .dwattr $C$DW$1918, DW_AT_accessibility(DW_ACCESS_public)
   14465              
   14466              $C$DW$1919      .dwtag  DW_TAG_member
   14467                      .dwattr $C$DW$1919, DW_AT_type(*$C$DW$T$23)
   14468                      .dwattr $C$DW$1919, DW_AT_name("rsvd_1")
   14469                      .dwattr $C$DW$1919, DW_AT_TI_symbol_name("_rsvd_1")
   14470                      .dwattr $C$DW$1919, DW_AT_data_member_location[DW_OP_plus_uconst 0x1]
   14471                      .dwattr $C$DW$1919, DW_AT_accessibility(DW_ACCESS_public)
   14472              
   14473              $C$DW$1920      .dwtag  DW_TAG_member
   14474                      .dwattr $C$DW$1920, DW_AT_type(*$C$DW$T$23)
   14475                      .dwattr $C$DW$1920, DW_AT_name("INTOSC2TRIM")
   14476                      .dwattr $C$DW$1920, DW_AT_TI_symbol_name("_INTOSC2TRIM")
   14477                      .dwattr $C$DW$1920, DW_AT_data_member_location[DW_OP_plus_uconst 0x2]
   14478                      .dwattr $C$DW$1920, DW_AT_accessibility(DW_ACCESS_public)
   14479              
   14480                      .dwendtag $C$DW$T$95
   14481              
   14482              $C$DW$T$65      .dwtag  DW_TAG_pointer_type
   14483                      .dwattr $C$DW$T$65, DW_AT_type(*$C$DW$T$95)
   14484                      .dwattr $C$DW$T$65, DW_AT_address_class(0x20)
   14485              
   14486              $C$DW$T$66      .dwtag  DW_TAG_typedef
   14487                      .dwattr $C$DW$T$66, DW_AT_name("OSC_Handle")
   14488                      .dwattr $C$DW$T$66, DW_AT_type(*$C$DW$T$65)
   14489                      .dwattr $C$DW$T$66, DW_AT_language(DW_LANG_C)
   14490              
   14491              
   14492              $C$DW$T$96      .dwtag  DW_TAG_structure_type
   14493                      .dwattr $C$DW$T$96, DW_AT_name("_PIE_IERIFR_t")
   14494                      .dwattr $C$DW$T$96, DW_AT_byte_size(0x02)
   14495              $C$DW$1921      .dwtag  DW_TAG_member
   14496                      .dwattr $C$DW$1921, DW_AT_type(*$C$DW$T$23)
   14497                      .dwattr $C$DW$1921, DW_AT_name("IER")
   14498                      .dwattr $C$DW$1921, DW_AT_TI_symbol_name("_IER")
   14499                      .dwattr $C$DW$1921, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
   14500                      .dwattr $C$DW$1921, DW_AT_accessibility(DW_ACCESS_public)
   14501              
   14502              $C$DW$1922      .dwtag  DW_TAG_member
   14503                      .dwattr $C$DW$1922, DW_AT_type(*$C$DW$T$23)
   14504                      .dwattr $C$DW$1922, DW_AT_name("IFR")
   14505                      .dwattr $C$DW$1922, DW_AT_TI_symbol_name("_IFR")
   14506                      .dwattr $C$DW$1922, DW_AT_data_member_location[DW_OP_plus_uconst 0x1]
   14507                      .dwattr $C$DW$1922, DW_AT_accessibility(DW_ACCESS_public)
   14508              
TMS320C2000 Assembler PC v15.12.3 Tue Aug 29 09:30:33 2017

Tools Copyright (c) 1996-2015 Texas Instruments Incorporated
C:\Users\wmj\AppData\Local\Temp\0326810                              PAGE  274

   14509                      .dwendtag $C$DW$T$96
   14510              
   14511              $C$DW$T$97      .dwtag  DW_TAG_typedef
   14512                      .dwattr $C$DW$T$97, DW_AT_name("PIE_IERIFR_t")
   14513                      .dwattr $C$DW$T$97, DW_AT_type(*$C$DW$T$96)
   14514                      .dwattr $C$DW$T$97, DW_AT_language(DW_LANG_C)
   14515              
   14516              $C$DW$1923      .dwtag  DW_TAG_TI_far_type
   14517                      .dwattr $C$DW$1923, DW_AT_type(*$C$DW$T$97)
   14518              
   14519              $C$DW$T$98      .dwtag  DW_TAG_volatile_type
   14520                      .dwattr $C$DW$T$98, DW_AT_type(*$C$DW$1923)
   14521              
   14522              
   14523              $C$DW$T$99      .dwtag  DW_TAG_array_type
   14524                      .dwattr $C$DW$T$99, DW_AT_type(*$C$DW$T$98)
   14525                      .dwattr $C$DW$T$99, DW_AT_language(DW_LANG_C)
   14526                      .dwattr $C$DW$T$99, DW_AT_byte_size(0x18)
   14527              $C$DW$1924      .dwtag  DW_TAG_subrange_type
   14528                      .dwattr $C$DW$1924, DW_AT_upper_bound(0x0b)
   14529              
   14530                      .dwendtag $C$DW$T$99
   14531              
   14532              
   14533              $C$DW$T$106     .dwtag  DW_TAG_structure_type
   14534                      .dwattr $C$DW$T$106, DW_AT_name("_PIE_Obj_")
   14535                      .dwattr $C$DW$T$106, DW_AT_byte_size(0x639c)
   14536              $C$DW$1925      .dwtag  DW_TAG_member
   14537                      .dwattr $C$DW$1925, DW_AT_type(*$C$DW$T$23)
   14538                      .dwattr $C$DW$1925, DW_AT_name("PIECTRL")
   14539                      .dwattr $C$DW$1925, DW_AT_TI_symbol_name("_PIECTRL")
   14540                      .dwattr $C$DW$1925, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
   14541                      .dwattr $C$DW$1925, DW_AT_accessibility(DW_ACCESS_public)
   14542              
   14543              $C$DW$1926      .dwtag  DW_TAG_member
   14544                      .dwattr $C$DW$1926, DW_AT_type(*$C$DW$T$23)
   14545                      .dwattr $C$DW$1926, DW_AT_name("PIEACK")
   14546                      .dwattr $C$DW$1926, DW_AT_TI_symbol_name("_PIEACK")
   14547                      .dwattr $C$DW$1926, DW_AT_data_member_location[DW_OP_plus_uconst 0x1]
   14548                      .dwattr $C$DW$1926, DW_AT_accessibility(DW_ACCESS_public)
   14549              
   14550              $C$DW$1927      .dwtag  DW_TAG_member
   14551                      .dwattr $C$DW$1927, DW_AT_type(*$C$DW$T$99)
   14552                      .dwattr $C$DW$1927, DW_AT_name("PIEIER_PIEIFR")
   14553                      .dwattr $C$DW$1927, DW_AT_TI_symbol_name("_PIEIER_PIEIFR")
   14554                      .dwattr $C$DW$1927, DW_AT_data_member_location[DW_OP_plus_uconst 0x2]
   14555                      .dwattr $C$DW$1927, DW_AT_accessibility(DW_ACCESS_public)
   14556              
   14557              $C$DW$1928      .dwtag  DW_TAG_member
   14558                      .dwattr $C$DW$1928, DW_AT_type(*$C$DW$T$100)
   14559                      .dwattr $C$DW$1928, DW_AT_name("rsvd_1")
   14560                      .dwattr $C$DW$1928, DW_AT_TI_symbol_name("_rsvd_1")
   14561                      .dwattr $C$DW$1928, DW_AT_data_member_location[DW_OP_plus_uconst 0x1a]
   14562                      .dwattr $C$DW$1928, DW_AT_accessibility(DW_ACCESS_public)
   14563              
TMS320C2000 Assembler PC v15.12.3 Tue Aug 29 09:30:33 2017

Tools Copyright (c) 1996-2015 Texas Instruments Incorporated
C:\Users\wmj\AppData\Local\Temp\0326810                              PAGE  275

   14564              $C$DW$1929      .dwtag  DW_TAG_member
   14565                      .dwattr $C$DW$1929, DW_AT_type(*$C$DW$T$104)
   14566                      .dwattr $C$DW$1929, DW_AT_name("Reset")
   14567                      .dwattr $C$DW$1929, DW_AT_TI_symbol_name("_Reset")
   14568                      .dwattr $C$DW$1929, DW_AT_data_member_location[DW_OP_plus_uconst 0x20]
   14569                      .dwattr $C$DW$1929, DW_AT_accessibility(DW_ACCESS_public)
   14570              
   14571              $C$DW$1930      .dwtag  DW_TAG_member
   14572                      .dwattr $C$DW$1930, DW_AT_type(*$C$DW$T$104)
   14573                      .dwattr $C$DW$1930, DW_AT_name("INT1")
   14574                      .dwattr $C$DW$1930, DW_AT_TI_symbol_name("_INT1")
   14575                      .dwattr $C$DW$1930, DW_AT_data_member_location[DW_OP_plus_uconst 0x22]
   14576                      .dwattr $C$DW$1930, DW_AT_accessibility(DW_ACCESS_public)
   14577              
   14578              $C$DW$1931      .dwtag  DW_TAG_member
   14579                      .dwattr $C$DW$1931, DW_AT_type(*$C$DW$T$104)
   14580                      .dwattr $C$DW$1931, DW_AT_name("INT2")
   14581                      .dwattr $C$DW$1931, DW_AT_TI_symbol_name("_INT2")
