TMS320C2000 Assembler PC v15.12.3 Tue Sep 12 21:32:34 2017

Tools Copyright (c) 1996-2015 Texas Instruments Incorporated
C:\Users\wmj\AppData\Local\Temp\2302810                              PAGE    1

       1              ;***************************************************************
       2              ;* TMS320C2000 C/C++ Codegen                   PC v15.12.3.LTS *
       3              ;* Date/Time created: Tue Sep 12 21:32:33 2017                 *
       4              ;***************************************************************
       5                      .compiler_opts --abi=coffabi --float_support=softlib --hll_source=on --mem_model:code=flat --mem_mode
       6        0002  FP      .set    XAR2
       7              
       8              $C$DW$CU        .dwtag  DW_TAG_compile_unit
       9                      .dwattr $C$DW$CU, DW_AT_name("D:/BM1000/sw/modules/hal/boards/hvkit_rev1p1/f28x/f2802x/src/hal.c")
      10                      .dwattr $C$DW$CU, DW_AT_producer("TI TMS320C2000 C/C++ Codegen PC v15.12.3.LTS Copyright (c) 1996-201
      11                      .dwattr $C$DW$CU, DW_AT_TI_version(0x01)
      12                      .dwattr $C$DW$CU, DW_AT_comp_dir("D:\BM1000\sw\solutions\instaspin_foc\boards\hvkit_rev1p1\f28x\f2802
      13              
      14              $C$DW$1 .dwtag  DW_TAG_subprogram
      15                      .dwattr $C$DW$1, DW_AT_name("SPI_setClkPolarity")

   13225              $C$DW$1774      .dwtag  DW_TAG_TI_far_type
   13226                      .dwattr $C$DW$1774, DW_AT_type(*$C$DW$T$315)
   13227              
   13228              $C$DW$T$316     .dwtag  DW_TAG_const_type
   13229                      .dwattr $C$DW$T$316, DW_AT_type(*$C$DW$1774)
   13230              
   13231              
   13232              $C$DW$T$317     .dwtag  DW_TAG_enumeration_type
   13233                      .dwattr $C$DW$T$317, DW_AT_byte_size(0x01)
   13234              $C$DW$1775      .dwtag  DW_TAG_enumerator
   13235                      .dwattr $C$DW$1775, DW_AT_name("SCI_NumStopBits_One")
   13236                      .dwattr $C$DW$1775, DW_AT_const_value(0x00)
   13237              
   13238              $C$DW$1776      .dwtag  DW_TAG_enumerator
   13239                      .dwattr $C$DW$1776, DW_AT_name("SCI_NumStopBits_Two")
   13240                      .dwattr $C$DW$1776, DW_AT_const_value(0x80)
   13241              
   13242                      .dwendtag $C$DW$T$317
TMS320C2000 Assembler PC v15.12.3 Tue Sep 12 21:32:34 2017

Tools Copyright (c) 1996-2015 Texas Instruments Incorporated
C:\Users\wmj\AppData\Local\Temp\2302810                              PAGE  251

   13243              
   13244              $C$DW$T$318     .dwtag  DW_TAG_typedef
   13245                      .dwattr $C$DW$T$318, DW_AT_name("SCI_NumStopBits_e")
   13246                      .dwattr $C$DW$T$318, DW_AT_type(*$C$DW$T$317)
   13247                      .dwattr $C$DW$T$318, DW_AT_language(DW_LANG_C)
   13248              
   13249              $C$DW$1777      .dwtag  DW_TAG_TI_far_type
   13250                      .dwattr $C$DW$1777, DW_AT_type(*$C$DW$T$318)
   13251              
   13252              $C$DW$T$319     .dwtag  DW_TAG_const_type
   13253                      .dwattr $C$DW$T$319, DW_AT_type(*$C$DW$1777)
   13254              
   13255              
   13256              $C$DW$T$320     .dwtag  DW_TAG_enumeration_type
   13257                      .dwattr $C$DW$T$320, DW_AT_byte_size(0x01)
   13258              $C$DW$1778      .dwtag  DW_TAG_enumerator
   13259                      .dwattr $C$DW$1778, DW_AT_name("SCI_Parity_Odd")
   13260                      .dwattr $C$DW$1778, DW_AT_const_value(0x00)
   13261              
   13262              $C$DW$1779      .dwtag  DW_TAG_enumerator
   13263                      .dwattr $C$DW$1779, DW_AT_name("SCI_Parity_Even")
   13264                      .dwattr $C$DW$1779, DW_AT_const_value(0x40)
   13265              
   13266                      .dwendtag $C$DW$T$320
   13267              
   13268              $C$DW$T$321     .dwtag  DW_TAG_typedef
   13269                      .dwattr $C$DW$T$321, DW_AT_name("SCI_Parity_e")
   13270                      .dwattr $C$DW$T$321, DW_AT_type(*$C$DW$T$320)
   13271                      .dwattr $C$DW$T$321, DW_AT_language(DW_LANG_C)
   13272              
   13273              $C$DW$1780      .dwtag  DW_TAG_TI_far_type
   13274                      .dwattr $C$DW$1780, DW_AT_type(*$C$DW$T$321)
   13275              
   13276              $C$DW$T$322     .dwtag  DW_TAG_const_type
   13277                      .dwattr $C$DW$T$322, DW_AT_type(*$C$DW$1780)
   13278              
   13279              
   13280              $C$DW$T$323     .dwtag  DW_TAG_enumeration_type
   13281                      .dwattr $C$DW$T$323, DW_AT_byte_size(0x01)
   13282              $C$DW$1781      .dwtag  DW_TAG_enumerator
   13283                      .dwattr $C$DW$1781, DW_AT_name("HAL_SensorType_Current")
   13284                      .dwattr $C$DW$1781, DW_AT_const_value(0x00)
   13285              
   13286              $C$DW$1782      .dwtag  DW_TAG_enumerator
   13287                      .dwattr $C$DW$1782, DW_AT_name("HAL_SensorType_Voltage")
   13288                      .dwattr $C$DW$1782, DW_AT_const_value(0x01)
   13289              
   13290                      .dwendtag $C$DW$T$323
   13291              
   13292              $C$DW$T$324     .dwtag  DW_TAG_typedef
   13293                      .dwattr $C$DW$T$324, DW_AT_name("HAL_SensorType_e")
   13294                      .dwattr $C$DW$T$324, DW_AT_type(*$C$DW$T$323)
   13295                      .dwattr $C$DW$T$324, DW_AT_language(DW_LANG_C)
   13296              
   13297              
TMS320C2000 Assembler PC v15.12.3 Tue Sep 12 21:32:34 2017

Tools Copyright (c) 1996-2015 Texas Instruments Incorporated
C:\Users\wmj\AppData\Local\Temp\2302810                              PAGE  252

   13298              $C$DW$T$19      .dwtag  DW_TAG_structure_type
   13299                      .dwattr $C$DW$T$19, DW_AT_name("I2C_Obj")
   13300                      .dwattr $C$DW$T$19, DW_AT_declaration
   13301                      .dwendtag $C$DW$T$19
   13302              
   13303              $C$DW$T$79      .dwtag  DW_TAG_pointer_type
   13304                      .dwattr $C$DW$T$79, DW_AT_type(*$C$DW$T$19)
   13305                      .dwattr $C$DW$T$79, DW_AT_address_class(0x20)
   13306              
   13307              $C$DW$T$80      .dwtag  DW_TAG_typedef
   13308                      .dwattr $C$DW$T$80, DW_AT_name("I2C_Handle")
   13309                      .dwattr $C$DW$T$80, DW_AT_type(*$C$DW$T$79)
   13310                      .dwattr $C$DW$T$80, DW_AT_language(DW_LANG_C)
   13311              
   13312              
   13313              $C$DW$T$30      .dwtag  DW_TAG_structure_type
   13314                      .dwattr $C$DW$T$30, DW_AT_name("_ADC_Obj_")
   13315                      .dwattr $C$DW$T$30, DW_AT_byte_size(0x6650)
   13316              $C$DW$1783      .dwtag  DW_TAG_member
   13317                      .dwattr $C$DW$1783, DW_AT_type(*$C$DW$T$24)
   13318                      .dwattr $C$DW$1783, DW_AT_name("ADCRESULT")
   13319                      .dwattr $C$DW$1783, DW_AT_TI_symbol_name("_ADCRESULT")
   13320                      .dwattr $C$DW$1783, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
   13321                      .dwattr $C$DW$1783, DW_AT_accessibility(DW_ACCESS_public)
   13322              
   13323              $C$DW$1784      .dwtag  DW_TAG_member
   13324                      .dwattr $C$DW$1784, DW_AT_type(*$C$DW$T$25)
   13325                      .dwattr $C$DW$1784, DW_AT_name("resvd_1")
   13326                      .dwattr $C$DW$1784, DW_AT_TI_symbol_name("_resvd_1")
   13327                      .dwattr $C$DW$1784, DW_AT_data_member_location[DW_OP_plus_uconst 0x10]
   13328                      .dwattr $C$DW$1784, DW_AT_accessibility(DW_ACCESS_public)
   13329              
   13330              $C$DW$1785      .dwtag  DW_TAG_member
   13331                      .dwattr $C$DW$1785, DW_AT_type(*$C$DW$T$23)
   13332                      .dwattr $C$DW$1785, DW_AT_name("ADCCTL1")
   13333                      .dwattr $C$DW$1785, DW_AT_TI_symbol_name("_ADCCTL1")
   13334                      .dwattr $C$DW$1785, DW_AT_data_member_location[DW_OP_plus_uconst 0x6600]
   13335                      .dwattr $C$DW$1785, DW_AT_accessibility(DW_ACCESS_public)
   13336              
   13337              $C$DW$1786      .dwtag  DW_TAG_member
   13338                      .dwattr $C$DW$1786, DW_AT_type(*$C$DW$T$23)
   13339                      .dwattr $C$DW$1786, DW_AT_name("ADCCTL2")
   13340                      .dwattr $C$DW$1786, DW_AT_TI_symbol_name("_ADCCTL2")
   13341                      .dwattr $C$DW$1786, DW_AT_data_member_location[DW_OP_plus_uconst 0x6601]
   13342                      .dwattr $C$DW$1786, DW_AT_accessibility(DW_ACCESS_public)
   13343              
   13344              $C$DW$1787      .dwtag  DW_TAG_member
   13345                      .dwattr $C$DW$1787, DW_AT_type(*$C$DW$T$26)
   13346                      .dwattr $C$DW$1787, DW_AT_name("rsvd_2")
   13347                      .dwattr $C$DW$1787, DW_AT_TI_symbol_name("_rsvd_2")
   13348                      .dwattr $C$DW$1787, DW_AT_data_member_location[DW_OP_plus_uconst 0x6602]
   13349                      .dwattr $C$DW$1787, DW_AT_accessibility(DW_ACCESS_public)
   13350              
   13351              $C$DW$1788      .dwtag  DW_TAG_member
   13352                      .dwattr $C$DW$1788, DW_AT_type(*$C$DW$T$23)
TMS320C2000 Assembler PC v15.12.3 Tue Sep 12 21:32:34 2017

Tools Copyright (c) 1996-2015 Texas Instruments Incorporated
C:\Users\wmj\AppData\Local\Temp\2302810                              PAGE  253

   13353                      .dwattr $C$DW$1788, DW_AT_name("ADCINTFLG")
   13354                      .dwattr $C$DW$1788, DW_AT_TI_symbol_name("_ADCINTFLG")
   13355                      .dwattr $C$DW$1788, DW_AT_data_member_location[DW_OP_plus_uconst 0x6604]
   13356                      .dwattr $C$DW$1788, DW_AT_accessibility(DW_ACCESS_public)
   13357              
   13358              $C$DW$1789      .dwtag  DW_TAG_member
   13359                      .dwattr $C$DW$1789, DW_AT_type(*$C$DW$T$23)
   13360                      .dwattr $C$DW$1789, DW_AT_name("ADCINTFLGCLR")
   13361                      .dwattr $C$DW$1789, DW_AT_TI_symbol_name("_ADCINTFLGCLR")
   13362                      .dwattr $C$DW$1789, DW_AT_data_member_location[DW_OP_plus_uconst 0x6605]
   13363                      .dwattr $C$DW$1789, DW_AT_accessibility(DW_ACCESS_public)
   13364              
   13365              $C$DW$1790      .dwtag  DW_TAG_member
   13366                      .dwattr $C$DW$1790, DW_AT_type(*$C$DW$T$23)
   13367                      .dwattr $C$DW$1790, DW_AT_name("ADCINTOVF")
   13368                      .dwattr $C$DW$1790, DW_AT_TI_symbol_name("_ADCINTOVF")
   13369                      .dwattr $C$DW$1790, DW_AT_data_member_location[DW_OP_plus_uconst 0x6606]
   13370                      .dwattr $C$DW$1790, DW_AT_accessibility(DW_ACCESS_public)
   13371              
   13372              $C$DW$1791      .dwtag  DW_TAG_member
   13373                      .dwattr $C$DW$1791, DW_AT_type(*$C$DW$T$23)
   13374                      .dwattr $C$DW$1791, DW_AT_name("ADCINTOVFCLR")
   13375                      .dwattr $C$DW$1791, DW_AT_TI_symbol_name("_ADCINTOVFCLR")
   13376                      .dwattr $C$DW$1791, DW_AT_data_member_location[DW_OP_plus_uconst 0x6607]
   13377                      .dwattr $C$DW$1791, DW_AT_accessibility(DW_ACCESS_public)
   13378              
   13379              $C$DW$1792      .dwtag  DW_TAG_member
   13380                      .dwattr $C$DW$1792, DW_AT_type(*$C$DW$T$27)
   13381                      .dwattr $C$DW$1792, DW_AT_name("INTSELxNy")
   13382                      .dwattr $C$DW$1792, DW_AT_TI_symbol_name("_INTSELxNy")
   13383                      .dwattr $C$DW$1792, DW_AT_data_member_location[DW_OP_plus_uconst 0x6608]
   13384                      .dwattr $C$DW$1792, DW_AT_accessibility(DW_ACCESS_public)
   13385              
   13386              $C$DW$1793      .dwtag  DW_TAG_member
   13387                      .dwattr $C$DW$1793, DW_AT_type(*$C$DW$T$28)
   13388                      .dwattr $C$DW$1793, DW_AT_name("rsvd_3")
   13389                      .dwattr $C$DW$1793, DW_AT_TI_symbol_name("_rsvd_3")
   13390                      .dwattr $C$DW$1793, DW_AT_data_member_location[DW_OP_plus_uconst 0x660d]
   13391                      .dwattr $C$DW$1793, DW_AT_accessibility(DW_ACCESS_public)
   13392              
   13393              $C$DW$1794      .dwtag  DW_TAG_member
   13394                      .dwattr $C$DW$1794, DW_AT_type(*$C$DW$T$23)
   13395                      .dwattr $C$DW$1794, DW_AT_name("SOCPRICTRL")
   13396                      .dwattr $C$DW$1794, DW_AT_TI_symbol_name("_SOCPRICTRL")
   13397                      .dwattr $C$DW$1794, DW_AT_data_member_location[DW_OP_plus_uconst 0x6610]
   13398                      .dwattr $C$DW$1794, DW_AT_accessibility(DW_ACCESS_public)
   13399              
   13400              $C$DW$1795      .dwtag  DW_TAG_member
   13401                      .dwattr $C$DW$1795, DW_AT_type(*$C$DW$T$23)
   13402                      .dwattr $C$DW$1795, DW_AT_name("rsvd_4")
   13403                      .dwattr $C$DW$1795, DW_AT_TI_symbol_name("_rsvd_4")
   13404                      .dwattr $C$DW$1795, DW_AT_data_member_location[DW_OP_plus_uconst 0x6611]
   13405                      .dwattr $C$DW$1795, DW_AT_accessibility(DW_ACCESS_public)
   13406              
   13407              $C$DW$1796      .dwtag  DW_TAG_member
TMS320C2000 Assembler PC v15.12.3 Tue Sep 12 21:32:34 2017

Tools Copyright (c) 1996-2015 Texas Instruments Incorporated
C:\Users\wmj\AppData\Local\Temp\2302810                              PAGE  254

   13408                      .dwattr $C$DW$1796, DW_AT_type(*$C$DW$T$23)
   13409                      .dwattr $C$DW$1796, DW_AT_name("ADCSAMPLEMODE")
   13410                      .dwattr $C$DW$1796, DW_AT_TI_symbol_name("_ADCSAMPLEMODE")
   13411                      .dwattr $C$DW$1796, DW_AT_data_member_location[DW_OP_plus_uconst 0x6612]
   13412                      .dwattr $C$DW$1796, DW_AT_accessibility(DW_ACCESS_public)
   13413              
   13414              $C$DW$1797      .dwtag  DW_TAG_member
   13415                      .dwattr $C$DW$1797, DW_AT_type(*$C$DW$T$23)
   13416                      .dwattr $C$DW$1797, DW_AT_name("rsvd_5")
   13417                      .dwattr $C$DW$1797, DW_AT_TI_symbol_name("_rsvd_5")
   13418                      .dwattr $C$DW$1797, DW_AT_data_member_location[DW_OP_plus_uconst 0x6613]
   13419                      .dwattr $C$DW$1797, DW_AT_accessibility(DW_ACCESS_public)
   13420              
   13421              $C$DW$1798      .dwtag  DW_TAG_member
   13422                      .dwattr $C$DW$1798, DW_AT_type(*$C$DW$T$23)
   13423                      .dwattr $C$DW$1798, DW_AT_name("ADCINTSOCSEL1")
   13424                      .dwattr $C$DW$1798, DW_AT_TI_symbol_name("_ADCINTSOCSEL1")
   13425                      .dwattr $C$DW$1798, DW_AT_data_member_location[DW_OP_plus_uconst 0x6614]
   13426                      .dwattr $C$DW$1798, DW_AT_accessibility(DW_ACCESS_public)
   13427              
   13428              $C$DW$1799      .dwtag  DW_TAG_member
   13429                      .dwattr $C$DW$1799, DW_AT_type(*$C$DW$T$23)
   13430                      .dwattr $C$DW$1799, DW_AT_name("ADCINTSOCSEL2")
   13431                      .dwattr $C$DW$1799, DW_AT_TI_symbol_name("_ADCINTSOCSEL2")
   13432                      .dwattr $C$DW$1799, DW_AT_data_member_location[DW_OP_plus_uconst 0x6615]
   13433                      .dwattr $C$DW$1799, DW_AT_accessibility(DW_ACCESS_public)
   13434              
   13435              $C$DW$1800      .dwtag  DW_TAG_member
   13436                      .dwattr $C$DW$1800, DW_AT_type(*$C$DW$T$26)
   13437                      .dwattr $C$DW$1800, DW_AT_name("rsvd_6")
   13438                      .dwattr $C$DW$1800, DW_AT_TI_symbol_name("_rsvd_6")
   13439                      .dwattr $C$DW$1800, DW_AT_data_member_location[DW_OP_plus_uconst 0x6616]
   13440                      .dwattr $C$DW$1800, DW_AT_accessibility(DW_ACCESS_public)
   13441              
   13442              $C$DW$1801      .dwtag  DW_TAG_member
   13443                      .dwattr $C$DW$1801, DW_AT_type(*$C$DW$T$23)
   13444                      .dwattr $C$DW$1801, DW_AT_name("ADCSOCFLG1")
   13445                      .dwattr $C$DW$1801, DW_AT_TI_symbol_name("_ADCSOCFLG1")
   13446                      .dwattr $C$DW$1801, DW_AT_data_member_location[DW_OP_plus_uconst 0x6618]
   13447                      .dwattr $C$DW$1801, DW_AT_accessibility(DW_ACCESS_public)
   13448              
   13449              $C$DW$1802      .dwtag  DW_TAG_member
   13450                      .dwattr $C$DW$1802, DW_AT_type(*$C$DW$T$23)
   13451                      .dwattr $C$DW$1802, DW_AT_name("rsvd_7")
   13452                      .dwattr $C$DW$1802, DW_AT_TI_symbol_name("_rsvd_7")
   13453                      .dwattr $C$DW$1802, DW_AT_data_member_location[DW_OP_plus_uconst 0x6619]
   13454                      .dwattr $C$DW$1802, DW_AT_accessibility(DW_ACCESS_public)
   13455              
   13456              $C$DW$1803      .dwtag  DW_TAG_member
   13457                      .dwattr $C$DW$1803, DW_AT_type(*$C$DW$T$23)
   13458                      .dwattr $C$DW$1803, DW_AT_name("ADCSOCFRC1")
   13459                      .dwattr $C$DW$1803, DW_AT_TI_symbol_name("_ADCSOCFRC1")
   13460                      .dwattr $C$DW$1803, DW_AT_data_member_location[DW_OP_plus_uconst 0x661a]
   13461                      .dwattr $C$DW$1803, DW_AT_accessibility(DW_ACCESS_public)
   13462              
TMS320C2000 Assembler PC v15.12.3 Tue Sep 12 21:32:34 2017

Tools Copyright (c) 1996-2015 Texas Instruments Incorporated
C:\Users\wmj\AppData\Local\Temp\2302810                              PAGE  255

   13463              $C$DW$1804      .dwtag  DW_TAG_member
   13464                      .dwattr $C$DW$1804, DW_AT_type(*$C$DW$T$23)
   13465                      .dwattr $C$DW$1804, DW_AT_name("rsvd_8")
   13466                      .dwattr $C$DW$1804, DW_AT_TI_symbol_name("_rsvd_8")
   13467                      .dwattr $C$DW$1804, DW_AT_data_member_location[DW_OP_plus_uconst 0x661b]
   13468                      .dwattr $C$DW$1804, DW_AT_accessibility(DW_ACCESS_public)
   13469              
   13470              $C$DW$1805      .dwtag  DW_TAG_member
   13471                      .dwattr $C$DW$1805, DW_AT_type(*$C$DW$T$23)
   13472                      .dwattr $C$DW$1805, DW_AT_name("ADCSOCOVF1")
   13473                      .dwattr $C$DW$1805, DW_AT_TI_symbol_name("_ADCSOCOVF1")
   13474                      .dwattr $C$DW$1805, DW_AT_data_member_location[DW_OP_plus_uconst 0x661c]
   13475                      .dwattr $C$DW$1805, DW_AT_accessibility(DW_ACCESS_public)
   13476              
   13477              $C$DW$1806      .dwtag  DW_TAG_member
   13478                      .dwattr $C$DW$1806, DW_AT_type(*$C$DW$T$23)
   13479                      .dwattr $C$DW$1806, DW_AT_name("rsvd_9")
   13480                      .dwattr $C$DW$1806, DW_AT_TI_symbol_name("_rsvd_9")
   13481                      .dwattr $C$DW$1806, DW_AT_data_member_location[DW_OP_plus_uconst 0x661d]
   13482                      .dwattr $C$DW$1806, DW_AT_accessibility(DW_ACCESS_public)
   13483              
   13484              $C$DW$1807      .dwtag  DW_TAG_member
   13485                      .dwattr $C$DW$1807, DW_AT_type(*$C$DW$T$23)
   13486                      .dwattr $C$DW$1807, DW_AT_name("ADCSOCOVFCLR1")
   13487                      .dwattr $C$DW$1807, DW_AT_TI_symbol_name("_ADCSOCOVFCLR1")
   13488                      .dwattr $C$DW$1807, DW_AT_data_member_location[DW_OP_plus_uconst 0x661e]
   13489                      .dwattr $C$DW$1807, DW_AT_accessibility(DW_ACCESS_public)
   13490              
   13491              $C$DW$1808      .dwtag  DW_TAG_member
   13492                      .dwattr $C$DW$1808, DW_AT_type(*$C$DW$T$23)
   13493                      .dwattr $C$DW$1808, DW_AT_name("rsvd_10")
   13494                      .dwattr $C$DW$1808, DW_AT_TI_symbol_name("_rsvd_10")
   13495                      .dwattr $C$DW$1808, DW_AT_data_member_location[DW_OP_plus_uconst 0x661f]
   13496                      .dwattr $C$DW$1808, DW_AT_accessibility(DW_ACCESS_public)
   13497              
   13498              $C$DW$1809      .dwtag  DW_TAG_member
   13499                      .dwattr $C$DW$1809, DW_AT_type(*$C$DW$T$24)
   13500                      .dwattr $C$DW$1809, DW_AT_name("ADCSOCxCTL")
   13501                      .dwattr $C$DW$1809, DW_AT_TI_symbol_name("_ADCSOCxCTL")
   13502                      .dwattr $C$DW$1809, DW_AT_data_member_location[DW_OP_plus_uconst 0x6620]
   13503                      .dwattr $C$DW$1809, DW_AT_accessibility(DW_ACCESS_public)
   13504              
   13505              $C$DW$1810      .dwtag  DW_TAG_member
   13506                      .dwattr $C$DW$1810, DW_AT_type(*$C$DW$T$24)
   13507                      .dwattr $C$DW$1810, DW_AT_name("rsvd_11")
   13508                      .dwattr $C$DW$1810, DW_AT_TI_symbol_name("_rsvd_11")
   13509                      .dwattr $C$DW$1810, DW_AT_data_member_location[DW_OP_plus_uconst 0x6630]
   13510                      .dwattr $C$DW$1810, DW_AT_accessibility(DW_ACCESS_public)
   13511              
   13512              $C$DW$1811      .dwtag  DW_TAG_member
   13513                      .dwattr $C$DW$1811, DW_AT_type(*$C$DW$T$23)
   13514                      .dwattr $C$DW$1811, DW_AT_name("ADCREFTRIM")
   13515                      .dwattr $C$DW$1811, DW_AT_TI_symbol_name("_ADCREFTRIM")
   13516                      .dwattr $C$DW$1811, DW_AT_data_member_location[DW_OP_plus_uconst 0x6640]
   13517                      .dwattr $C$DW$1811, DW_AT_accessibility(DW_ACCESS_public)
TMS320C2000 Assembler PC v15.12.3 Tue Sep 12 21:32:34 2017

Tools Copyright (c) 1996-2015 Texas Instruments Incorporated
C:\Users\wmj\AppData\Local\Temp\2302810                              PAGE  256

   13518              
   13519              $C$DW$1812      .dwtag  DW_TAG_member
   13520                      .dwattr $C$DW$1812, DW_AT_type(*$C$DW$T$23)
   13521                      .dwattr $C$DW$1812, DW_AT_name("ADCOFFTRIM")
   13522                      .dwattr $C$DW$1812, DW_AT_TI_symbol_name("_ADCOFFTRIM")
   13523                      .dwattr $C$DW$1812, DW_AT_data_member_location[DW_OP_plus_uconst 0x6641]
   13524                      .dwattr $C$DW$1812, DW_AT_accessibility(DW_ACCESS_public)
   13525              
   13526              $C$DW$1813      .dwtag  DW_TAG_member
   13527                      .dwattr $C$DW$1813, DW_AT_type(*$C$DW$T$29)
   13528                      .dwattr $C$DW$1813, DW_AT_name("resvd_12")
   13529                      .dwattr $C$DW$1813, DW_AT_TI_symbol_name("_resvd_12")
   13530                      .dwattr $C$DW$1813, DW_AT_data_member_location[DW_OP_plus_uconst 0x6642]
   13531                      .dwattr $C$DW$1813, DW_AT_accessibility(DW_ACCESS_public)
   13532              
   13533              $C$DW$1814      .dwtag  DW_TAG_member
   13534                      .dwattr $C$DW$1814, DW_AT_type(*$C$DW$T$23)
   13535                      .dwattr $C$DW$1814, DW_AT_name("ADCREV")
   13536                      .dwattr $C$DW$1814, DW_AT_TI_symbol_name("_ADCREV")
   13537                      .dwattr $C$DW$1814, DW_AT_data_member_location[DW_OP_plus_uconst 0x664f]
   13538                      .dwattr $C$DW$1814, DW_AT_accessibility(DW_ACCESS_public)
   13539              
   13540                      .dwendtag $C$DW$T$30
   13541              
   13542              $C$DW$T$331     .dwtag  DW_TAG_typedef
   13543                      .dwattr $C$DW$T$331, DW_AT_name("ADC_Obj")
   13544                      .dwattr $C$DW$T$331, DW_AT_type(*$C$DW$T$30)
   13545                      .dwattr $C$DW$T$331, DW_AT_language(DW_LANG_C)
   13546              
   13547              $C$DW$T$50      .dwtag  DW_TAG_pointer_type
   13548                      .dwattr $C$DW$T$50, DW_AT_type(*$C$DW$T$30)
   13549                      .dwattr $C$DW$T$50, DW_AT_address_class(0x20)
   13550              
   13551              $C$DW$T$51      .dwtag  DW_TAG_typedef
   13552                      .dwattr $C$DW$T$51, DW_AT_name("ADC_Handle")
   13553                      .dwattr $C$DW$T$51, DW_AT_type(*$C$DW$T$50)
   13554                      .dwattr $C$DW$T$51, DW_AT_language(DW_LANG_C)
   13555              
   13556              
   13557              $C$DW$T$32      .dwtag  DW_TAG_structure_type
   13558                      .dwattr $C$DW$T$32, DW_AT_name("_CLK_Obj_")
   13559                      .dwattr $C$DW$T$32, DW_AT_byte_size(0x11)
   13560              $C$DW$1815      .dwtag  DW_TAG_member
   13561                      .dwattr $C$DW$1815, DW_AT_type(*$C$DW$T$23)
   13562                      .dwattr $C$DW$1815, DW_AT_name("XCLK")
   13563                      .dwattr $C$DW$1815, DW_AT_TI_symbol_name("_XCLK")
   13564                      .dwattr $C$DW$1815, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
   13565                      .dwattr $C$DW$1815, DW_AT_accessibility(DW_ACCESS_public)
   13566              
   13567              $C$DW$1816      .dwtag  DW_TAG_member
   13568                      .dwattr $C$DW$1816, DW_AT_type(*$C$DW$T$23)
   13569                      .dwattr $C$DW$1816, DW_AT_name("rsvd_1")
   13570                      .dwattr $C$DW$1816, DW_AT_TI_symbol_name("_rsvd_1")
   13571                      .dwattr $C$DW$1816, DW_AT_data_member_location[DW_OP_plus_uconst 0x1]
   13572                      .dwattr $C$DW$1816, DW_AT_accessibility(DW_ACCESS_public)
TMS320C2000 Assembler PC v15.12.3 Tue Sep 12 21:32:34 2017

Tools Copyright (c) 1996-2015 Texas Instruments Incorporated
C:\Users\wmj\AppData\Local\Temp\2302810                              PAGE  257

   13573              
   13574              $C$DW$1817      .dwtag  DW_TAG_member
   13575                      .dwattr $C$DW$1817, DW_AT_type(*$C$DW$T$23)
   13576                      .dwattr $C$DW$1817, DW_AT_name("CLKCTL")
   13577                      .dwattr $C$DW$1817, DW_AT_TI_symbol_name("_CLKCTL")
   13578                      .dwattr $C$DW$1817, DW_AT_data_member_location[DW_OP_plus_uconst 0x2]
   13579                      .dwattr $C$DW$1817, DW_AT_accessibility(DW_ACCESS_public)
   13580              
   13581              $C$DW$1818      .dwtag  DW_TAG_member
   13582                      .dwattr $C$DW$1818, DW_AT_type(*$C$DW$T$31)
   13583                      .dwattr $C$DW$1818, DW_AT_name("rsvd_2")
   13584                      .dwattr $C$DW$1818, DW_AT_TI_symbol_name("_rsvd_2")
   13585                      .dwattr $C$DW$1818, DW_AT_data_member_location[DW_OP_plus_uconst 0x3]
   13586                      .dwattr $C$DW$1818, DW_AT_accessibility(DW_ACCESS_public)
   13587              
   13588              $C$DW$1819      .dwtag  DW_TAG_member
   13589                      .dwattr $C$DW$1819, DW_AT_type(*$C$DW$T$23)
   13590                      .dwattr $C$DW$1819, DW_AT_name("LOSPCP")
   13591                      .dwattr $C$DW$1819, DW_AT_TI_symbol_name("_LOSPCP")
   13592                      .dwattr $C$DW$1819, DW_AT_data_member_location[DW_OP_plus_uconst 0xb]
   13593                      .dwattr $C$DW$1819, DW_AT_accessibility(DW_ACCESS_public)
   13594              
   13595              $C$DW$1820      .dwtag  DW_TAG_member
   13596                      .dwattr $C$DW$1820, DW_AT_type(*$C$DW$T$23)
   13597                      .dwattr $C$DW$1820, DW_AT_name("PCLKCR0")
   13598                      .dwattr $C$DW$1820, DW_AT_TI_symbol_name("_PCLKCR0")
   13599                      .dwattr $C$DW$1820, DW_AT_data_member_location[DW_OP_plus_uconst 0xc]
   13600                      .dwattr $C$DW$1820, DW_AT_accessibility(DW_ACCESS_public)
   13601              
   13602              $C$DW$1821      .dwtag  DW_TAG_member
   13603                      .dwattr $C$DW$1821, DW_AT_type(*$C$DW$T$23)
   13604                      .dwattr $C$DW$1821, DW_AT_name("PCLKCR1")
   13605                      .dwattr $C$DW$1821, DW_AT_TI_symbol_name("_PCLKCR1")
   13606                      .dwattr $C$DW$1821, DW_AT_data_member_location[DW_OP_plus_uconst 0xd]
   13607                      .dwattr $C$DW$1821, DW_AT_accessibility(DW_ACCESS_public)
   13608              
   13609              $C$DW$1822      .dwtag  DW_TAG_member
   13610                      .dwattr $C$DW$1822, DW_AT_type(*$C$DW$T$26)
   13611                      .dwattr $C$DW$1822, DW_AT_name("rsvd_3")
   13612                      .dwattr $C$DW$1822, DW_AT_TI_symbol_name("_rsvd_3")
   13613                      .dwattr $C$DW$1822, DW_AT_data_member_location[DW_OP_plus_uconst 0xe]
   13614                      .dwattr $C$DW$1822, DW_AT_accessibility(DW_ACCESS_public)
   13615              
   13616              $C$DW$1823      .dwtag  DW_TAG_member
   13617                      .dwattr $C$DW$1823, DW_AT_type(*$C$DW$T$23)
   13618                      .dwattr $C$DW$1823, DW_AT_name("PCLKCR3")
   13619                      .dwattr $C$DW$1823, DW_AT_TI_symbol_name("_PCLKCR3")
   13620                      .dwattr $C$DW$1823, DW_AT_data_member_location[DW_OP_plus_uconst 0x10]
   13621                      .dwattr $C$DW$1823, DW_AT_accessibility(DW_ACCESS_public)
   13622              
   13623                      .dwendtag $C$DW$T$32
   13624              
   13625              $C$DW$T$52      .dwtag  DW_TAG_pointer_type
   13626                      .dwattr $C$DW$T$52, DW_AT_type(*$C$DW$T$32)
   13627                      .dwattr $C$DW$T$52, DW_AT_address_class(0x20)
TMS320C2000 Assembler PC v15.12.3 Tue Sep 12 21:32:34 2017

Tools Copyright (c) 1996-2015 Texas Instruments Incorporated
C:\Users\wmj\AppData\Local\Temp\2302810                              PAGE  258

   13628              
   13629              $C$DW$T$53      .dwtag  DW_TAG_typedef
   13630                      .dwattr $C$DW$T$53, DW_AT_name("CLK_Handle")
   13631                      .dwattr $C$DW$T$53, DW_AT_type(*$C$DW$T$52)
   13632                      .dwattr $C$DW$T$53, DW_AT_language(DW_LANG_C)
   13633              
   13634              
   13635              $C$DW$T$34      .dwtag  DW_TAG_structure_type
   13636                      .dwattr $C$DW$T$34, DW_AT_name("_CPU_Obj_")
   13637                      .dwattr $C$DW$T$34, DW_AT_byte_size(0x01)
   13638              $C$DW$1824      .dwtag  DW_TAG_member
   13639                      .dwattr $C$DW$1824, DW_AT_type(*$C$DW$T$33)
   13640                      .dwattr $C$DW$1824, DW_AT_name("tmp")
   13641                      .dwattr $C$DW$1824, DW_AT_TI_symbol_name("_tmp")
   13642                      .dwattr $C$DW$1824, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
   13643                      .dwattr $C$DW$1824, DW_AT_accessibility(DW_ACCESS_public)
   13644              
   13645                      .dwendtag $C$DW$T$34
   13646              
   13647              $C$DW$T$338     .dwtag  DW_TAG_typedef
   13648                      .dwattr $C$DW$T$338, DW_AT_name("CPU_Obj")
   13649                      .dwattr $C$DW$T$338, DW_AT_type(*$C$DW$T$34)
   13650                      .dwattr $C$DW$T$338, DW_AT_language(DW_LANG_C)
   13651              
   13652              $C$DW$T$54      .dwtag  DW_TAG_pointer_type
   13653                      .dwattr $C$DW$T$54, DW_AT_type(*$C$DW$T$34)
   13654                      .dwattr $C$DW$T$54, DW_AT_address_class(0x20)
   13655              
   13656              $C$DW$T$55      .dwtag  DW_TAG_typedef
   13657                      .dwattr $C$DW$T$55, DW_AT_name("CPU_Handle")
   13658                      .dwattr $C$DW$T$55, DW_AT_type(*$C$DW$T$54)
   13659                      .dwattr $C$DW$T$55, DW_AT_language(DW_LANG_C)
   13660              
   13661              
   13662              $C$DW$T$36      .dwtag  DW_TAG_structure_type
   13663                      .dwattr $C$DW$T$36, DW_AT_name("_FILTER_FO_")
   13664                      .dwattr $C$DW$T$36, DW_AT_byte_size(0x0a)
   13665              $C$DW$1825      .dwtag  DW_TAG_member
   13666                      .dwattr $C$DW$1825, DW_AT_type(*$C$DW$T$35)
   13667                      .dwattr $C$DW$1825, DW_AT_name("a1")
   13668                      .dwattr $C$DW$1825, DW_AT_TI_symbol_name("_a1")
   13669                      .dwattr $C$DW$1825, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
   13670                      .dwattr $C$DW$1825, DW_AT_accessibility(DW_ACCESS_public)
   13671              
   13672              $C$DW$1826      .dwtag  DW_TAG_member
   13673                      .dwattr $C$DW$1826, DW_AT_type(*$C$DW$T$35)
   13674                      .dwattr $C$DW$1826, DW_AT_name("b0")
   13675                      .dwattr $C$DW$1826, DW_AT_TI_symbol_name("_b0")
   13676                      .dwattr $C$DW$1826, DW_AT_data_member_location[DW_OP_plus_uconst 0x2]
   13677                      .dwattr $C$DW$1826, DW_AT_accessibility(DW_ACCESS_public)
   13678              
   13679              $C$DW$1827      .dwtag  DW_TAG_member
   13680                      .dwattr $C$DW$1827, DW_AT_type(*$C$DW$T$35)
   13681                      .dwattr $C$DW$1827, DW_AT_name("b1")
   13682                      .dwattr $C$DW$1827, DW_AT_TI_symbol_name("_b1")
TMS320C2000 Assembler PC v15.12.3 Tue Sep 12 21:32:34 2017

Tools Copyright (c) 1996-2015 Texas Instruments Incorporated
C:\Users\wmj\AppData\Local\Temp\2302810                              PAGE  259

   13683                      .dwattr $C$DW$1827, DW_AT_data_member_location[DW_OP_plus_uconst 0x4]
   13684                      .dwattr $C$DW$1827, DW_AT_accessibility(DW_ACCESS_public)
   13685              
   13686              $C$DW$1828      .dwtag  DW_TAG_member
   13687                      .dwattr $C$DW$1828, DW_AT_type(*$C$DW$T$35)
   13688                      .dwattr $C$DW$1828, DW_AT_name("x1")
   13689                      .dwattr $C$DW$1828, DW_AT_TI_symbol_name("_x1")
   13690                      .dwattr $C$DW$1828, DW_AT_data_member_location[DW_OP_plus_uconst 0x6]
   13691                      .dwattr $C$DW$1828, DW_AT_accessibility(DW_ACCESS_public)
   13692              
   13693              $C$DW$1829      .dwtag  DW_TAG_member
   13694                      .dwattr $C$DW$1829, DW_AT_type(*$C$DW$T$35)
   13695                      .dwattr $C$DW$1829, DW_AT_name("y1")
   13696                      .dwattr $C$DW$1829, DW_AT_TI_symbol_name("_y1")
   13697                      .dwattr $C$DW$1829, DW_AT_data_member_location[DW_OP_plus_uconst 0x8]
   13698                      .dwattr $C$DW$1829, DW_AT_accessibility(DW_ACCESS_public)
   13699              
   13700                      .dwendtag $C$DW$T$36
   13701              
   13702              $C$DW$T$91      .dwtag  DW_TAG_typedef
   13703                      .dwattr $C$DW$T$91, DW_AT_name("FILTER_FO_Obj")
   13704                      .dwattr $C$DW$T$91, DW_AT_type(*$C$DW$T$36)
   13705                      .dwattr $C$DW$T$91, DW_AT_language(DW_LANG_C)
   13706              
   13707              
   13708              $C$DW$T$20      .dwtag  DW_TAG_structure_type
   13709                      .dwattr $C$DW$T$20, DW_AT_name("_FILTER_FO_Obj_")
   13710                      .dwattr $C$DW$T$20, DW_AT_declaration
   13711                      .dwendtag $C$DW$T$20
   13712              
   13713              $C$DW$T$92      .dwtag  DW_TAG_pointer_type
   13714                      .dwattr $C$DW$T$92, DW_AT_type(*$C$DW$T$20)
   13715                      .dwattr $C$DW$T$92, DW_AT_address_class(0x20)
   13716              
   13717              $C$DW$T$93      .dwtag  DW_TAG_typedef
   13718                      .dwattr $C$DW$T$93, DW_AT_name("FILTER_FO_Handle")
   13719                      .dwattr $C$DW$T$93, DW_AT_type(*$C$DW$T$92)
   13720                      .dwattr $C$DW$T$93, DW_AT_language(DW_LANG_C)
   13721              
   13722              
   13723              $C$DW$T$37      .dwtag  DW_TAG_structure_type
   13724                      .dwattr $C$DW$T$37, DW_AT_name("_FLASH_Obj_")
   13725                      .dwattr $C$DW$T$37, DW_AT_byte_size(0x08)
   13726              $C$DW$1830      .dwtag  DW_TAG_member
   13727                      .dwattr $C$DW$1830, DW_AT_type(*$C$DW$T$23)
   13728                      .dwattr $C$DW$1830, DW_AT_name("FOPT")
   13729                      .dwattr $C$DW$1830, DW_AT_TI_symbol_name("_FOPT")
   13730                      .dwattr $C$DW$1830, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
   13731                      .dwattr $C$DW$1830, DW_AT_accessibility(DW_ACCESS_public)
   13732              
   13733              $C$DW$1831      .dwtag  DW_TAG_member
   13734                      .dwattr $C$DW$1831, DW_AT_type(*$C$DW$T$23)
   13735                      .dwattr $C$DW$1831, DW_AT_name("rsvd_1")
   13736                      .dwattr $C$DW$1831, DW_AT_TI_symbol_name("_rsvd_1")
   13737                      .dwattr $C$DW$1831, DW_AT_data_member_location[DW_OP_plus_uconst 0x1]
TMS320C2000 Assembler PC v15.12.3 Tue Sep 12 21:32:34 2017

Tools Copyright (c) 1996-2015 Texas Instruments Incorporated
C:\Users\wmj\AppData\Local\Temp\2302810                              PAGE  260

   13738                      .dwattr $C$DW$1831, DW_AT_accessibility(DW_ACCESS_public)
   13739              
   13740              $C$DW$1832      .dwtag  DW_TAG_member
   13741                      .dwattr $C$DW$1832, DW_AT_type(*$C$DW$T$23)
   13742                      .dwattr $C$DW$1832, DW_AT_name("FPWR")
   13743                      .dwattr $C$DW$1832, DW_AT_TI_symbol_name("_FPWR")
   13744                      .dwattr $C$DW$1832, DW_AT_data_member_location[DW_OP_plus_uconst 0x2]
   13745                      .dwattr $C$DW$1832, DW_AT_accessibility(DW_ACCESS_public)
   13746              
   13747              $C$DW$1833      .dwtag  DW_TAG_member
   13748                      .dwattr $C$DW$1833, DW_AT_type(*$C$DW$T$23)
   13749                      .dwattr $C$DW$1833, DW_AT_name("FSTATUS")
   13750                      .dwattr $C$DW$1833, DW_AT_TI_symbol_name("_FSTATUS")
   13751                      .dwattr $C$DW$1833, DW_AT_data_member_location[DW_OP_plus_uconst 0x3]
   13752                      .dwattr $C$DW$1833, DW_AT_accessibility(DW_ACCESS_public)
   13753              
   13754              $C$DW$1834      .dwtag  DW_TAG_member
   13755                      .dwattr $C$DW$1834, DW_AT_type(*$C$DW$T$23)
   13756                      .dwattr $C$DW$1834, DW_AT_name("FSTDBYWAIT")
   13757                      .dwattr $C$DW$1834, DW_AT_TI_symbol_name("_FSTDBYWAIT")
   13758                      .dwattr $C$DW$1834, DW_AT_data_member_location[DW_OP_plus_uconst 0x4]
   13759                      .dwattr $C$DW$1834, DW_AT_accessibility(DW_ACCESS_public)
   13760              
   13761              $C$DW$1835      .dwtag  DW_TAG_member
   13762                      .dwattr $C$DW$1835, DW_AT_type(*$C$DW$T$23)
   13763                      .dwattr $C$DW$1835, DW_AT_name("FACTIVEWAIT")
   13764                      .dwattr $C$DW$1835, DW_AT_TI_symbol_name("_FACTIVEWAIT")
   13765                      .dwattr $C$DW$1835, DW_AT_data_member_location[DW_OP_plus_uconst 0x5]
   13766                      .dwattr $C$DW$1835, DW_AT_accessibility(DW_ACCESS_public)
   13767              
   13768              $C$DW$1836      .dwtag  DW_TAG_member
   13769                      .dwattr $C$DW$1836, DW_AT_type(*$C$DW$T$23)
   13770                      .dwattr $C$DW$1836, DW_AT_name("FBANKWAIT")
   13771                      .dwattr $C$DW$1836, DW_AT_TI_symbol_name("_FBANKWAIT")
   13772                      .dwattr $C$DW$1836, DW_AT_data_member_location[DW_OP_plus_uconst 0x6]
   13773                      .dwattr $C$DW$1836, DW_AT_accessibility(DW_ACCESS_public)
   13774              
   13775              $C$DW$1837      .dwtag  DW_TAG_member
   13776                      .dwattr $C$DW$1837, DW_AT_type(*$C$DW$T$23)
   13777                      .dwattr $C$DW$1837, DW_AT_name("FOTPWAIT")
   13778                      .dwattr $C$DW$1837, DW_AT_TI_symbol_name("_FOTPWAIT")
   13779                      .dwattr $C$DW$1837, DW_AT_data_member_location[DW_OP_plus_uconst 0x7]
   13780                      .dwattr $C$DW$1837, DW_AT_accessibility(DW_ACCESS_public)
   13781              
   13782                      .dwendtag $C$DW$T$37
   13783              
   13784              $C$DW$T$56      .dwtag  DW_TAG_pointer_type
   13785                      .dwattr $C$DW$T$56, DW_AT_type(*$C$DW$T$37)
   13786                      .dwattr $C$DW$T$56, DW_AT_address_class(0x20)
   13787              
   13788              $C$DW$T$57      .dwtag  DW_TAG_typedef
   13789                      .dwattr $C$DW$T$57, DW_AT_name("FLASH_Handle")
   13790                      .dwattr $C$DW$T$57, DW_AT_type(*$C$DW$T$56)
   13791                      .dwattr $C$DW$T$57, DW_AT_language(DW_LANG_C)
   13792              
TMS320C2000 Assembler PC v15.12.3 Tue Sep 12 21:32:34 2017

Tools Copyright (c) 1996-2015 Texas Instruments Incorporated
C:\Users\wmj\AppData\Local\Temp\2302810                              PAGE  261

   13793              
   13794              $C$DW$T$42      .dwtag  DW_TAG_structure_type
   13795                      .dwattr $C$DW$T$42, DW_AT_name("_GPIO_Obj_")
   13796                      .dwattr $C$DW$T$42, DW_AT_byte_size(0x6a)
   13797              $C$DW$1838      .dwtag  DW_TAG_member
   13798                      .dwattr $C$DW$1838, DW_AT_type(*$C$DW$T$39)
   13799                      .dwattr $C$DW$1838, DW_AT_name("GPACTRL")
   13800                      .dwattr $C$DW$1838, DW_AT_TI_symbol_name("_GPACTRL")
   13801                      .dwattr $C$DW$1838, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
   13802                      .dwattr $C$DW$1838, DW_AT_accessibility(DW_ACCESS_public)
   13803              
   13804              $C$DW$1839      .dwtag  DW_TAG_member
   13805                      .dwattr $C$DW$1839, DW_AT_type(*$C$DW$T$39)
   13806                      .dwattr $C$DW$1839, DW_AT_name("GPAQSEL1")
   13807                      .dwattr $C$DW$1839, DW_AT_TI_symbol_name("_GPAQSEL1")
   13808                      .dwattr $C$DW$1839, DW_AT_data_member_location[DW_OP_plus_uconst 0x2]
   13809                      .dwattr $C$DW$1839, DW_AT_accessibility(DW_ACCESS_public)
   13810              
   13811              $C$DW$1840      .dwtag  DW_TAG_member
   13812                      .dwattr $C$DW$1840, DW_AT_type(*$C$DW$T$39)
   13813                      .dwattr $C$DW$1840, DW_AT_name("GPAQSEL2")
   13814                      .dwattr $C$DW$1840, DW_AT_TI_symbol_name("_GPAQSEL2")
   13815                      .dwattr $C$DW$1840, DW_AT_data_member_location[DW_OP_plus_uconst 0x4]
   13816                      .dwattr $C$DW$1840, DW_AT_accessibility(DW_ACCESS_public)
   13817              
   13818              $C$DW$1841      .dwtag  DW_TAG_member
   13819                      .dwattr $C$DW$1841, DW_AT_type(*$C$DW$T$39)
   13820                      .dwattr $C$DW$1841, DW_AT_name("GPAMUX1")
   13821                      .dwattr $C$DW$1841, DW_AT_TI_symbol_name("_GPAMUX1")
   13822                      .dwattr $C$DW$1841, DW_AT_data_member_location[DW_OP_plus_uconst 0x6]
   13823                      .dwattr $C$DW$1841, DW_AT_accessibility(DW_ACCESS_public)
   13824              
   13825              $C$DW$1842      .dwtag  DW_TAG_member
   13826                      .dwattr $C$DW$1842, DW_AT_type(*$C$DW$T$39)
   13827                      .dwattr $C$DW$1842, DW_AT_name("GPAMUX2")
   13828                      .dwattr $C$DW$1842, DW_AT_TI_symbol_name("_GPAMUX2")
   13829                      .dwattr $C$DW$1842, DW_AT_data_member_location[DW_OP_plus_uconst 0x8]
   13830                      .dwattr $C$DW$1842, DW_AT_accessibility(DW_ACCESS_public)
   13831              
   13832              $C$DW$1843      .dwtag  DW_TAG_member
   13833                      .dwattr $C$DW$1843, DW_AT_type(*$C$DW$T$39)
   13834                      .dwattr $C$DW$1843, DW_AT_name("GPADIR")
   13835                      .dwattr $C$DW$1843, DW_AT_TI_symbol_name("_GPADIR")
   13836                      .dwattr $C$DW$1843, DW_AT_data_member_location[DW_OP_plus_uconst 0xa]
   13837                      .dwattr $C$DW$1843, DW_AT_accessibility(DW_ACCESS_public)
   13838              
   13839              $C$DW$1844      .dwtag  DW_TAG_member
   13840                      .dwattr $C$DW$1844, DW_AT_type(*$C$DW$T$39)
   13841                      .dwattr $C$DW$1844, DW_AT_name("GPAPUD")
   13842                      .dwattr $C$DW$1844, DW_AT_TI_symbol_name("_GPAPUD")
   13843                      .dwattr $C$DW$1844, DW_AT_data_member_location[DW_OP_plus_uconst 0xc]
   13844                      .dwattr $C$DW$1844, DW_AT_accessibility(DW_ACCESS_public)
   13845              
   13846              $C$DW$1845      .dwtag  DW_TAG_member
   13847                      .dwattr $C$DW$1845, DW_AT_type(*$C$DW$T$26)
TMS320C2000 Assembler PC v15.12.3 Tue Sep 12 21:32:34 2017

Tools Copyright (c) 1996-2015 Texas Instruments Incorporated
C:\Users\wmj\AppData\Local\Temp\2302810                              PAGE  262

   13848                      .dwattr $C$DW$1845, DW_AT_name("rsvd_1")
   13849                      .dwattr $C$DW$1845, DW_AT_TI_symbol_name("_rsvd_1")
   13850                      .dwattr $C$DW$1845, DW_AT_data_member_location[DW_OP_plus_uconst 0xe]
   13851                      .dwattr $C$DW$1845, DW_AT_accessibility(DW_ACCESS_public)
   13852              
   13853              $C$DW$1846      .dwtag  DW_TAG_member
   13854                      .dwattr $C$DW$1846, DW_AT_type(*$C$DW$T$39)
   13855                      .dwattr $C$DW$1846, DW_AT_name("GPBCTRL")
   13856                      .dwattr $C$DW$1846, DW_AT_TI_symbol_name("_GPBCTRL")
   13857                      .dwattr $C$DW$1846, DW_AT_data_member_location[DW_OP_plus_uconst 0x10]
   13858                      .dwattr $C$DW$1846, DW_AT_accessibility(DW_ACCESS_public)
   13859              
   13860              $C$DW$1847      .dwtag  DW_TAG_member
   13861                      .dwattr $C$DW$1847, DW_AT_type(*$C$DW$T$39)
   13862                      .dwattr $C$DW$1847, DW_AT_name("GPBQSEL1")
   13863                      .dwattr $C$DW$1847, DW_AT_TI_symbol_name("_GPBQSEL1")
   13864                      .dwattr $C$DW$1847, DW_AT_data_member_location[DW_OP_plus_uconst 0x12]
   13865                      .dwattr $C$DW$1847, DW_AT_accessibility(DW_ACCESS_public)
   13866              
   13867              $C$DW$1848      .dwtag  DW_TAG_member
   13868                      .dwattr $C$DW$1848, DW_AT_type(*$C$DW$T$26)
   13869                      .dwattr $C$DW$1848, DW_AT_name("rsvd_2")
   13870                      .dwattr $C$DW$1848, DW_AT_TI_symbol_name("_rsvd_2")
   13871                      .dwattr $C$DW$1848, DW_AT_data_member_location[DW_OP_plus_uconst 0x14]
   13872                      .dwattr $C$DW$1848, DW_AT_accessibility(DW_ACCESS_public)
   13873              
   13874              $C$DW$1849      .dwtag  DW_TAG_member
   13875                      .dwattr $C$DW$1849, DW_AT_type(*$C$DW$T$39)
   13876                      .dwattr $C$DW$1849, DW_AT_name("GPBMUX1")
   13877                      .dwattr $C$DW$1849, DW_AT_TI_symbol_name("_GPBMUX1")
   13878                      .dwattr $C$DW$1849, DW_AT_data_member_location[DW_OP_plus_uconst 0x16]
   13879                      .dwattr $C$DW$1849, DW_AT_accessibility(DW_ACCESS_public)
   13880              
   13881              $C$DW$1850      .dwtag  DW_TAG_member
   13882                      .dwattr $C$DW$1850, DW_AT_type(*$C$DW$T$26)
   13883                      .dwattr $C$DW$1850, DW_AT_name("rsvd_3")
   13884                      .dwattr $C$DW$1850, DW_AT_TI_symbol_name("_rsvd_3")
   13885                      .dwattr $C$DW$1850, DW_AT_data_member_location[DW_OP_plus_uconst 0x18]
   13886                      .dwattr $C$DW$1850, DW_AT_accessibility(DW_ACCESS_public)
   13887              
   13888              $C$DW$1851      .dwtag  DW_TAG_member
   13889                      .dwattr $C$DW$1851, DW_AT_type(*$C$DW$T$39)
   13890                      .dwattr $C$DW$1851, DW_AT_name("GPBDIR")
   13891                      .dwattr $C$DW$1851, DW_AT_TI_symbol_name("_GPBDIR")
   13892                      .dwattr $C$DW$1851, DW_AT_data_member_location[DW_OP_plus_uconst 0x1a]
   13893                      .dwattr $C$DW$1851, DW_AT_accessibility(DW_ACCESS_public)
   13894              
   13895              $C$DW$1852      .dwtag  DW_TAG_member
   13896                      .dwattr $C$DW$1852, DW_AT_type(*$C$DW$T$39)
   13897                      .dwattr $C$DW$1852, DW_AT_name("GPBPUD")
   13898                      .dwattr $C$DW$1852, DW_AT_TI_symbol_name("_GPBPUD")
   13899                      .dwattr $C$DW$1852, DW_AT_data_member_location[DW_OP_plus_uconst 0x1c]
   13900                      .dwattr $C$DW$1852, DW_AT_accessibility(DW_ACCESS_public)
   13901              
   13902              $C$DW$1853      .dwtag  DW_TAG_member
TMS320C2000 Assembler PC v15.12.3 Tue Sep 12 21:32:34 2017

Tools Copyright (c) 1996-2015 Texas Instruments Incorporated
C:\Users\wmj\AppData\Local\Temp\2302810                              PAGE  263

   13903                      .dwattr $C$DW$1853, DW_AT_type(*$C$DW$T$40)
   13904                      .dwattr $C$DW$1853, DW_AT_name("rsvd_4")
   13905                      .dwattr $C$DW$1853, DW_AT_TI_symbol_name("_rsvd_4")
   13906                      .dwattr $C$DW$1853, DW_AT_data_member_location[DW_OP_plus_uconst 0x1e]
   13907                      .dwattr $C$DW$1853, DW_AT_accessibility(DW_ACCESS_public)
   13908              
   13909              $C$DW$1854      .dwtag  DW_TAG_member
   13910                      .dwattr $C$DW$1854, DW_AT_type(*$C$DW$T$39)
   13911                      .dwattr $C$DW$1854, DW_AT_name("AIOMUX1")
   13912                      .dwattr $C$DW$1854, DW_AT_TI_symbol_name("_AIOMUX1")
   13913                      .dwattr $C$DW$1854, DW_AT_data_member_location[DW_OP_plus_uconst 0x36]
   13914                      .dwattr $C$DW$1854, DW_AT_accessibility(DW_ACCESS_public)
   13915              
   13916              $C$DW$1855      .dwtag  DW_TAG_member
   13917                      .dwattr $C$DW$1855, DW_AT_type(*$C$DW$T$26)
   13918                      .dwattr $C$DW$1855, DW_AT_name("rsvd_5")
   13919                      .dwattr $C$DW$1855, DW_AT_TI_symbol_name("_rsvd_5")
   13920                      .dwattr $C$DW$1855, DW_AT_data_member_location[DW_OP_plus_uconst 0x38]
   13921                      .dwattr $C$DW$1855, DW_AT_accessibility(DW_ACCESS_public)
   13922              
   13923              $C$DW$1856      .dwtag  DW_TAG_member
   13924                      .dwattr $C$DW$1856, DW_AT_type(*$C$DW$T$39)
   13925                      .dwattr $C$DW$1856, DW_AT_name("AIODIR")
   13926                      .dwattr $C$DW$1856, DW_AT_TI_symbol_name("_AIODIR")
   13927                      .dwattr $C$DW$1856, DW_AT_data_member_location[DW_OP_plus_uconst 0x3a]
   13928                      .dwattr $C$DW$1856, DW_AT_accessibility(DW_ACCESS_public)
   13929              
   13930              $C$DW$1857      .dwtag  DW_TAG_member
   13931                      .dwattr $C$DW$1857, DW_AT_type(*$C$DW$T$41)
   13932                      .dwattr $C$DW$1857, DW_AT_name("rsvd_6")
   13933                      .dwattr $C$DW$1857, DW_AT_TI_symbol_name("_rsvd_6")
   13934                      .dwattr $C$DW$1857, DW_AT_data_member_location[DW_OP_plus_uconst 0x3c]
   13935                      .dwattr $C$DW$1857, DW_AT_accessibility(DW_ACCESS_public)
   13936              
   13937              $C$DW$1858      .dwtag  DW_TAG_member
   13938                      .dwattr $C$DW$1858, DW_AT_type(*$C$DW$T$39)
   13939                      .dwattr $C$DW$1858, DW_AT_name("GPADAT")
   13940                      .dwattr $C$DW$1858, DW_AT_TI_symbol_name("_GPADAT")
   13941                      .dwattr $C$DW$1858, DW_AT_data_member_location[DW_OP_plus_uconst 0x40]
   13942                      .dwattr $C$DW$1858, DW_AT_accessibility(DW_ACCESS_public)
   13943              
   13944              $C$DW$1859      .dwtag  DW_TAG_member
   13945                      .dwattr $C$DW$1859, DW_AT_type(*$C$DW$T$39)
   13946                      .dwattr $C$DW$1859, DW_AT_name("GPASET")
   13947                      .dwattr $C$DW$1859, DW_AT_TI_symbol_name("_GPASET")
   13948                      .dwattr $C$DW$1859, DW_AT_data_member_location[DW_OP_plus_uconst 0x42]
   13949                      .dwattr $C$DW$1859, DW_AT_accessibility(DW_ACCESS_public)
   13950              
   13951              $C$DW$1860      .dwtag  DW_TAG_member
   13952                      .dwattr $C$DW$1860, DW_AT_type(*$C$DW$T$39)
   13953                      .dwattr $C$DW$1860, DW_AT_name("GPACLEAR")
   13954                      .dwattr $C$DW$1860, DW_AT_TI_symbol_name("_GPACLEAR")
   13955                      .dwattr $C$DW$1860, DW_AT_data_member_location[DW_OP_plus_uconst 0x44]
   13956                      .dwattr $C$DW$1860, DW_AT_accessibility(DW_ACCESS_public)
   13957              
TMS320C2000 Assembler PC v15.12.3 Tue Sep 12 21:32:34 2017

Tools Copyright (c) 1996-2015 Texas Instruments Incorporated
C:\Users\wmj\AppData\Local\Temp\2302810                              PAGE  264

   13958              $C$DW$1861      .dwtag  DW_TAG_member
   13959                      .dwattr $C$DW$1861, DW_AT_type(*$C$DW$T$39)
   13960                      .dwattr $C$DW$1861, DW_AT_name("GPATOGGLE")
   13961                      .dwattr $C$DW$1861, DW_AT_TI_symbol_name("_GPATOGGLE")
   13962                      .dwattr $C$DW$1861, DW_AT_data_member_location[DW_OP_plus_uconst 0x46]
   13963                      .dwattr $C$DW$1861, DW_AT_accessibility(DW_ACCESS_public)
   13964              
   13965              $C$DW$1862      .dwtag  DW_TAG_member
   13966                      .dwattr $C$DW$1862, DW_AT_type(*$C$DW$T$39)
   13967                      .dwattr $C$DW$1862, DW_AT_name("GPBDAT")
   13968                      .dwattr $C$DW$1862, DW_AT_TI_symbol_name("_GPBDAT")
   13969                      .dwattr $C$DW$1862, DW_AT_data_member_location[DW_OP_plus_uconst 0x48]
   13970                      .dwattr $C$DW$1862, DW_AT_accessibility(DW_ACCESS_public)
   13971              
   13972              $C$DW$1863      .dwtag  DW_TAG_member
   13973                      .dwattr $C$DW$1863, DW_AT_type(*$C$DW$T$39)
   13974                      .dwattr $C$DW$1863, DW_AT_name("GPBSET")
   13975                      .dwattr $C$DW$1863, DW_AT_TI_symbol_name("_GPBSET")
   13976                      .dwattr $C$DW$1863, DW_AT_data_member_location[DW_OP_plus_uconst 0x4a]
   13977                      .dwattr $C$DW$1863, DW_AT_accessibility(DW_ACCESS_public)
   13978              
   13979              $C$DW$1864      .dwtag  DW_TAG_member
   13980                      .dwattr $C$DW$1864, DW_AT_type(*$C$DW$T$39)
   13981                      .dwattr $C$DW$1864, DW_AT_name("GPBCLEAR")
   13982                      .dwattr $C$DW$1864, DW_AT_TI_symbol_name("_GPBCLEAR")
   13983                      .dwattr $C$DW$1864, DW_AT_data_member_location[DW_OP_plus_uconst 0x4c]
   13984                      .dwattr $C$DW$1864, DW_AT_accessibility(DW_ACCESS_public)
   13985              
   13986              $C$DW$1865      .dwtag  DW_TAG_member
   13987                      .dwattr $C$DW$1865, DW_AT_type(*$C$DW$T$39)
   13988                      .dwattr $C$DW$1865, DW_AT_name("GPBTOGGLE")
   13989                      .dwattr $C$DW$1865, DW_AT_TI_symbol_name("_GPBTOGGLE")
   13990                      .dwattr $C$DW$1865, DW_AT_data_member_location[DW_OP_plus_uconst 0x4e]
   13991                      .dwattr $C$DW$1865, DW_AT_accessibility(DW_ACCESS_public)
   13992              
   13993              $C$DW$1866      .dwtag  DW_TAG_member
   13994                      .dwattr $C$DW$1866, DW_AT_type(*$C$DW$T$31)
   13995                      .dwattr $C$DW$1866, DW_AT_name("rsvd_7")
   13996                      .dwattr $C$DW$1866, DW_AT_TI_symbol_name("_rsvd_7")
   13997                      .dwattr $C$DW$1866, DW_AT_data_member_location[DW_OP_plus_uconst 0x50]
   13998                      .dwattr $C$DW$1866, DW_AT_accessibility(DW_ACCESS_public)
   13999              
   14000              $C$DW$1867      .dwtag  DW_TAG_member
   14001                      .dwattr $C$DW$1867, DW_AT_type(*$C$DW$T$39)
   14002                      .dwattr $C$DW$1867, DW_AT_name("AIODAT")
   14003                      .dwattr $C$DW$1867, DW_AT_TI_symbol_name("_AIODAT")
   14004                      .dwattr $C$DW$1867, DW_AT_data_member_location[DW_OP_plus_uconst 0x58]
   14005                      .dwattr $C$DW$1867, DW_AT_accessibility(DW_ACCESS_public)
   14006              
   14007              $C$DW$1868      .dwtag  DW_TAG_member
   14008                      .dwattr $C$DW$1868, DW_AT_type(*$C$DW$T$39)
   14009                      .dwattr $C$DW$1868, DW_AT_name("AIOSET")
   14010                      .dwattr $C$DW$1868, DW_AT_TI_symbol_name("_AIOSET")
   14011                      .dwattr $C$DW$1868, DW_AT_data_member_location[DW_OP_plus_uconst 0x5a]
   14012                      .dwattr $C$DW$1868, DW_AT_accessibility(DW_ACCESS_public)
TMS320C2000 Assembler PC v15.12.3 Tue Sep 12 21:32:34 2017

Tools Copyright (c) 1996-2015 Texas Instruments Incorporated
C:\Users\wmj\AppData\Local\Temp\2302810                              PAGE  265

   14013              
   14014              $C$DW$1869      .dwtag  DW_TAG_member
   14015                      .dwattr $C$DW$1869, DW_AT_type(*$C$DW$T$39)
   14016                      .dwattr $C$DW$1869, DW_AT_name("AIOCLEAR")
   14017                      .dwattr $C$DW$1869, DW_AT_TI_symbol_name("_AIOCLEAR")
   14018                      .dwattr $C$DW$1869, DW_AT_data_member_location[DW_OP_plus_uconst 0x5c]
   14019                      .dwattr $C$DW$1869, DW_AT_accessibility(DW_ACCESS_public)
   14020              
   14021              $C$DW$1870      .dwtag  DW_TAG_member
   14022                      .dwattr $C$DW$1870, DW_AT_type(*$C$DW$T$39)
   14023                      .dwattr $C$DW$1870, DW_AT_name("AIOTOGGLE")
   14024                      .dwattr $C$DW$1870, DW_AT_TI_symbol_name("_AIOTOGGLE")
   14025                      .dwattr $C$DW$1870, DW_AT_data_member_location[DW_OP_plus_uconst 0x5e]
   14026                      .dwattr $C$DW$1870, DW_AT_accessibility(DW_ACCESS_public)
   14027              
   14028              $C$DW$1871      .dwtag  DW_TAG_member
   14029                      .dwattr $C$DW$1871, DW_AT_type(*$C$DW$T$28)
   14030                      .dwattr $C$DW$1871, DW_AT_name("GPIOXINTnSEL")
   14031                      .dwattr $C$DW$1871, DW_AT_TI_symbol_name("_GPIOXINTnSEL")
   14032                      .dwattr $C$DW$1871, DW_AT_data_member_location[DW_OP_plus_uconst 0x60]
   14033                      .dwattr $C$DW$1871, DW_AT_accessibility(DW_ACCESS_public)
   14034              
   14035              $C$DW$1872      .dwtag  DW_TAG_member
   14036                      .dwattr $C$DW$1872, DW_AT_type(*$C$DW$T$27)
   14037                      .dwattr $C$DW$1872, DW_AT_name("rsvd_8")
   14038                      .dwattr $C$DW$1872, DW_AT_TI_symbol_name("_rsvd_8")
   14039                      .dwattr $C$DW$1872, DW_AT_data_member_location[DW_OP_plus_uconst 0x63]
   14040                      .dwattr $C$DW$1872, DW_AT_accessibility(DW_ACCESS_public)
   14041              
   14042              $C$DW$1873      .dwtag  DW_TAG_member
   14043                      .dwattr $C$DW$1873, DW_AT_type(*$C$DW$T$39)
   14044                      .dwattr $C$DW$1873, DW_AT_name("GPIOLPMSEL")
   14045                      .dwattr $C$DW$1873, DW_AT_TI_symbol_name("_GPIOLPMSEL")
   14046                      .dwattr $C$DW$1873, DW_AT_data_member_location[DW_OP_plus_uconst 0x68]
   14047                      .dwattr $C$DW$1873, DW_AT_accessibility(DW_ACCESS_public)
   14048              
   14049                      .dwendtag $C$DW$T$42
   14050              
   14051              $C$DW$T$58      .dwtag  DW_TAG_pointer_type
   14052                      .dwattr $C$DW$T$58, DW_AT_type(*$C$DW$T$42)
   14053                      .dwattr $C$DW$T$58, DW_AT_address_class(0x20)
   14054              
   14055              $C$DW$T$59      .dwtag  DW_TAG_typedef
   14056                      .dwattr $C$DW$T$59, DW_AT_name("GPIO_Handle")
   14057                      .dwattr $C$DW$T$59, DW_AT_type(*$C$DW$T$58)
   14058                      .dwattr $C$DW$T$59, DW_AT_language(DW_LANG_C)
   14059              
   14060              
   14061              $C$DW$T$44      .dwtag  DW_TAG_structure_type
   14062                      .dwattr $C$DW$T$44, DW_AT_name("_HAL_AdcData_t_")
   14063                      .dwattr $C$DW$T$44, DW_AT_byte_size(0x16)
   14064              $C$DW$1874      .dwtag  DW_TAG_member
   14065                      .dwattr $C$DW$1874, DW_AT_type(*$C$DW$T$43)
   14066                      .dwattr $C$DW$1874, DW_AT_name("I")
   14067                      .dwattr $C$DW$1874, DW_AT_TI_symbol_name("_I")
TMS320C2000 Assembler PC v15.12.3 Tue Sep 12 21:32:34 2017

Tools Copyright (c) 1996-2015 Texas Instruments Incorporated
C:\Users\wmj\AppData\Local\Temp\2302810                              PAGE  266

   14068                      .dwattr $C$DW$1874, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
   14069                      .dwattr $C$DW$1874, DW_AT_accessibility(DW_ACCESS_public)
   14070              
   14071              $C$DW$1875      .dwtag  DW_TAG_member
   14072                      .dwattr $C$DW$1875, DW_AT_type(*$C$DW$T$43)
   14073                      .dwattr $C$DW$1875, DW_AT_name("V")
   14074                      .dwattr $C$DW$1875, DW_AT_TI_symbol_name("_V")
   14075                      .dwattr $C$DW$1875, DW_AT_data_member_location[DW_OP_plus_uconst 0x6]
   14076                      .dwattr $C$DW$1875, DW_AT_accessibility(DW_ACCESS_public)
   14077              
   14078              $C$DW$1876      .dwtag  DW_TAG_member
   14079                      .dwattr $C$DW$1876, DW_AT_type(*$C$DW$T$35)
   14080                      .dwattr $C$DW$1876, DW_AT_name("dcBus")
   14081                      .dwattr $C$DW$1876, DW_AT_TI_symbol_name("_dcBus")
   14082                      .dwattr $C$DW$1876, DW_AT_data_member_location[DW_OP_plus_uconst 0xc]
   14083                      .dwattr $C$DW$1876, DW_AT_accessibility(DW_ACCESS_public)
   14084              
   14085              $C$DW$1877      .dwtag  DW_TAG_member
   14086                      .dwattr $C$DW$1877, DW_AT_type(*$C$DW$T$35)
   14087                      .dwattr $C$DW$1877, DW_AT_name("analogSensor1")
   14088                      .dwattr $C$DW$1877, DW_AT_TI_symbol_name("_analogSensor1")
   14089                      .dwattr $C$DW$1877, DW_AT_data_member_location[DW_OP_plus_uconst 0xe]
   14090                      .dwattr $C$DW$1877, DW_AT_accessibility(DW_ACCESS_public)
   14091              
   14092              $C$DW$1878      .dwtag  DW_TAG_member
   14093                      .dwattr $C$DW$1878, DW_AT_type(*$C$DW$T$35)
   14094                      .dwattr $C$DW$1878, DW_AT_name("analogSensor2")
   14095                      .dwattr $C$DW$1878, DW_AT_TI_symbol_name("_analogSensor2")
   14096                      .dwattr $C$DW$1878, DW_AT_data_member_location[DW_OP_plus_uconst 0x10]
   14097                      .dwattr $C$DW$1878, DW_AT_accessibility(DW_ACCESS_public)
   14098              
   14099              $C$DW$1879      .dwtag  DW_TAG_member
   14100                      .dwattr $C$DW$1879, DW_AT_type(*$C$DW$T$35)
   14101                      .dwattr $C$DW$1879, DW_AT_name("igbtNTC")
   14102                      .dwattr $C$DW$1879, DW_AT_TI_symbol_name("_igbtNTC")
   14103                      .dwattr $C$DW$1879, DW_AT_data_member_location[DW_OP_plus_uconst 0x12]
   14104                      .dwattr $C$DW$1879, DW_AT_accessibility(DW_ACCESS_public)
   14105              
   14106              $C$DW$1880      .dwtag  DW_TAG_member
   14107                      .dwattr $C$DW$1880, DW_AT_type(*$C$DW$T$35)
   14108                      .dwattr $C$DW$1880, DW_AT_name("boardAddr")
   14109                      .dwattr $C$DW$1880, DW_AT_TI_symbol_name("_boardAddr")
   14110                      .dwattr $C$DW$1880, DW_AT_data_member_location[DW_OP_plus_uconst 0x14]
   14111                      .dwattr $C$DW$1880, DW_AT_accessibility(DW_ACCESS_public)
   14112              
   14113                      .dwendtag $C$DW$T$44
   14114              
   14115              $C$DW$T$87      .dwtag  DW_TAG_typedef
   14116                      .dwattr $C$DW$T$87, DW_AT_name("HAL_AdcData_t")
   14117                      .dwattr $C$DW$T$87, DW_AT_type(*$C$DW$T$44)
   14118                      .dwattr $C$DW$T$87, DW_AT_language(DW_LANG_C)
   14119              
   14120              
   14121              $C$DW$T$49      .dwtag  DW_TAG_structure_type
   14122                      .dwattr $C$DW$T$49, DW_AT_name("_HAL_DacData_t_")
TMS320C2000 Assembler PC v15.12.3 Tue Sep 12 21:32:34 2017

Tools Copyright (c) 1996-2015 Texas Instruments Incorporated
C:\Users\wmj\AppData\Local\Temp\2302810                              PAGE  267

   14123                      .dwattr $C$DW$T$49, DW_AT_byte_size(0x22)
   14124              $C$DW$1881      .dwtag  DW_TAG_member
   14125                      .dwattr $C$DW$1881, DW_AT_type(*$C$DW$T$22)
   14126                      .dwattr $C$DW$1881, DW_AT_name("PeriodMax")
   14127                      .dwattr $C$DW$1881, DW_AT_TI_symbol_name("_PeriodMax")
   14128                      .dwattr $C$DW$1881, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
   14129                      .dwattr $C$DW$1881, DW_AT_accessibility(DW_ACCESS_public)
   14130              
   14131              $C$DW$1882      .dwtag  DW_TAG_member
   14132                      .dwattr $C$DW$1882, DW_AT_type(*$C$DW$T$47)
   14133                      .dwattr $C$DW$1882, DW_AT_name("ptrData")
   14134                      .dwattr $C$DW$1882, DW_AT_TI_symbol_name("_ptrData")
   14135                      .dwattr $C$DW$1882, DW_AT_data_member_location[DW_OP_plus_uconst 0x2]
   14136                      .dwattr $C$DW$1882, DW_AT_accessibility(DW_ACCESS_public)
   14137              
   14138              $C$DW$1883      .dwtag  DW_TAG_member
   14139                      .dwattr $C$DW$1883, DW_AT_type(*$C$DW$T$48)
   14140                      .dwattr $C$DW$1883, DW_AT_name("value")
   14141                      .dwattr $C$DW$1883, DW_AT_TI_symbol_name("_value")
   14142                      .dwattr $C$DW$1883, DW_AT_data_member_location[DW_OP_plus_uconst 0xa]
   14143                      .dwattr $C$DW$1883, DW_AT_accessibility(DW_ACCESS_public)
   14144              
   14145              $C$DW$1884      .dwtag  DW_TAG_member
   14146                      .dwattr $C$DW$1884, DW_AT_type(*$C$DW$T$48)
   14147                      .dwattr $C$DW$1884, DW_AT_name("offset")
   14148                      .dwattr $C$DW$1884, DW_AT_TI_symbol_name("_offset")
   14149                      .dwattr $C$DW$1884, DW_AT_data_member_location[DW_OP_plus_uconst 0x12]
   14150                      .dwattr $C$DW$1884, DW_AT_accessibility(DW_ACCESS_public)
   14151              
   14152              $C$DW$1885      .dwtag  DW_TAG_member
   14153                      .dwattr $C$DW$1885, DW_AT_type(*$C$DW$T$48)
   14154                      .dwattr $C$DW$1885, DW_AT_name("gain")
   14155                      .dwattr $C$DW$1885, DW_AT_TI_symbol_name("_gain")
   14156                      .dwattr $C$DW$1885, DW_AT_data_member_location[DW_OP_plus_uconst 0x1a]
   14157                      .dwattr $C$DW$1885, DW_AT_accessibility(DW_ACCESS_public)
   14158              
   14159                      .dwendtag $C$DW$T$49
   14160              
   14161              $C$DW$T$348     .dwtag  DW_TAG_typedef
   14162                      .dwattr $C$DW$T$348, DW_AT_name("HAL_DacData_t")
   14163                      .dwattr $C$DW$T$348, DW_AT_type(*$C$DW$T$49)
   14164                      .dwattr $C$DW$T$348, DW_AT_language(DW_LANG_C)
   14165              
   14166              $C$DW$T$349     .dwtag  DW_TAG_pointer_type
   14167                      .dwattr $C$DW$T$349, DW_AT_type(*$C$DW$T$348)
   14168                      .dwattr $C$DW$T$349, DW_AT_address_class(0x20)
   14169              
   14170              $C$DW$1886      .dwtag  DW_TAG_TI_far_type
   14171                      .dwattr $C$DW$1886, DW_AT_type(*$C$DW$T$349)
   14172              
   14173              $C$DW$T$350     .dwtag  DW_TAG_const_type
   14174                      .dwattr $C$DW$T$350, DW_AT_type(*$C$DW$1886)
   14175              
   14176              
   14177              $C$DW$T$88      .dwtag  DW_TAG_structure_type
TMS320C2000 Assembler PC v15.12.3 Tue Sep 12 21:32:34 2017

Tools Copyright (c) 1996-2015 Texas Instruments Incorporated
C:\Users\wmj\AppData\Local\Temp\2302810                              PAGE  268

   14178                      .dwattr $C$DW$T$88, DW_AT_name("_HAL_Obj_")
   14179                      .dwattr $C$DW$T$88, DW_AT_byte_size(0xb4)
   14180              $C$DW$1887      .dwtag  DW_TAG_member
   14181                      .dwattr $C$DW$1887, DW_AT_type(*$C$DW$T$51)
   14182                      .dwattr $C$DW$1887, DW_AT_name("adcHandle")
   14183                      .dwattr $C$DW$1887, DW_AT_TI_symbol_name("_adcHandle")
   14184                      .dwattr $C$DW$1887, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
   14185                      .dwattr $C$DW$1887, DW_AT_accessibility(DW_ACCESS_public)
   14186              
   14187              $C$DW$1888      .dwtag  DW_TAG_member
   14188                      .dwattr $C$DW$1888, DW_AT_type(*$C$DW$T$53)
   14189                      .dwattr $C$DW$1888, DW_AT_name("clkHandle")
   14190                      .dwattr $C$DW$1888, DW_AT_TI_symbol_name("_clkHandle")
   14191                      .dwattr $C$DW$1888, DW_AT_data_member_location[DW_OP_plus_uconst 0x2]
   14192                      .dwattr $C$DW$1888, DW_AT_accessibility(DW_ACCESS_public)
   14193              
   14194              $C$DW$1889      .dwtag  DW_TAG_member
   14195                      .dwattr $C$DW$1889, DW_AT_type(*$C$DW$T$55)
   14196                      .dwattr $C$DW$1889, DW_AT_name("cpuHandle")
   14197                      .dwattr $C$DW$1889, DW_AT_TI_symbol_name("_cpuHandle")
   14198                      .dwattr $C$DW$1889, DW_AT_data_member_location[DW_OP_plus_uconst 0x4]
   14199                      .dwattr $C$DW$1889, DW_AT_accessibility(DW_ACCESS_public)
   14200              
   14201              $C$DW$1890      .dwtag  DW_TAG_member
   14202                      .dwattr $C$DW$1890, DW_AT_type(*$C$DW$T$57)
   14203                      .dwattr $C$DW$1890, DW_AT_name("flashHandle")
   14204                      .dwattr $C$DW$1890, DW_AT_TI_symbol_name("_flashHandle")
   14205                      .dwattr $C$DW$1890, DW_AT_data_member_location[DW_OP_plus_uconst 0x6]
   14206                      .dwattr $C$DW$1890, DW_AT_accessibility(DW_ACCESS_public)
   14207              
   14208              $C$DW$1891      .dwtag  DW_TAG_member
   14209                      .dwattr $C$DW$1891, DW_AT_type(*$C$DW$T$59)
   14210                      .dwattr $C$DW$1891, DW_AT_name("gpioHandle")
   14211                      .dwattr $C$DW$1891, DW_AT_TI_symbol_name("_gpioHandle")
   14212                      .dwattr $C$DW$1891, DW_AT_data_member_location[DW_OP_plus_uconst 0x8]
   14213                      .dwattr $C$DW$1891, DW_AT_accessibility(DW_ACCESS_public)
   14214              
   14215              $C$DW$1892      .dwtag  DW_TAG_member
   14216                      .dwattr $C$DW$1892, DW_AT_type(*$C$DW$T$62)
   14217                      .dwattr $C$DW$1892, DW_AT_name("offsetHandle_I")
   14218                      .dwattr $C$DW$1892, DW_AT_TI_symbol_name("_offsetHandle_I")
   14219                      .dwattr $C$DW$1892, DW_AT_data_member_location[DW_OP_plus_uconst 0xa]
   14220                      .dwattr $C$DW$1892, DW_AT_accessibility(DW_ACCESS_public)
   14221              
   14222              $C$DW$1893      .dwtag  DW_TAG_member
   14223                      .dwattr $C$DW$1893, DW_AT_type(*$C$DW$T$64)
   14224                      .dwattr $C$DW$1893, DW_AT_name("offset_I")
   14225                      .dwattr $C$DW$1893, DW_AT_TI_symbol_name("_offset_I")
   14226                      .dwattr $C$DW$1893, DW_AT_data_member_location[DW_OP_plus_uconst 0x10]
   14227                      .dwattr $C$DW$1893, DW_AT_accessibility(DW_ACCESS_public)
   14228              
   14229              $C$DW$1894      .dwtag  DW_TAG_member
   14230                      .dwattr $C$DW$1894, DW_AT_type(*$C$DW$T$62)
   14231                      .dwattr $C$DW$1894, DW_AT_name("offsetHandle_V")
   14232                      .dwattr $C$DW$1894, DW_AT_TI_symbol_name("_offsetHandle_V")
TMS320C2000 Assembler PC v15.12.3 Tue Sep 12 21:32:34 2017

Tools Copyright (c) 1996-2015 Texas Instruments Incorporated
C:\Users\wmj\AppData\Local\Temp\2302810                              PAGE  269

   14233                      .dwattr $C$DW$1894, DW_AT_data_member_location[DW_OP_plus_uconst 0x40]
   14234                      .dwattr $C$DW$1894, DW_AT_accessibility(DW_ACCESS_public)
   14235              
   14236              $C$DW$1895      .dwtag  DW_TAG_member
   14237                      .dwattr $C$DW$1895, DW_AT_type(*$C$DW$T$64)
   14238                      .dwattr $C$DW$1895, DW_AT_name("offset_V")
   14239                      .dwattr $C$DW$1895, DW_AT_TI_symbol_name("_offset_V")
   14240                      .dwattr $C$DW$1895, DW_AT_data_member_location[DW_OP_plus_uconst 0x46]
   14241                      .dwattr $C$DW$1895, DW_AT_accessibility(DW_ACCESS_public)
   14242              
   14243              $C$DW$1896      .dwtag  DW_TAG_member
   14244                      .dwattr $C$DW$1896, DW_AT_type(*$C$DW$T$66)
   14245                      .dwattr $C$DW$1896, DW_AT_name("oscHandle")
   14246                      .dwattr $C$DW$1896, DW_AT_TI_symbol_name("_oscHandle")
   14247                      .dwattr $C$DW$1896, DW_AT_data_member_location[DW_OP_plus_uconst 0x76]
   14248                      .dwattr $C$DW$1896, DW_AT_accessibility(DW_ACCESS_public)
   14249              
   14250              $C$DW$1897      .dwtag  DW_TAG_member
   14251                      .dwattr $C$DW$1897, DW_AT_type(*$C$DW$T$68)
   14252                      .dwattr $C$DW$1897, DW_AT_name("pieHandle")
   14253                      .dwattr $C$DW$1897, DW_AT_TI_symbol_name("_pieHandle")
   14254                      .dwattr $C$DW$1897, DW_AT_data_member_location[DW_OP_plus_uconst 0x78]
   14255                      .dwattr $C$DW$1897, DW_AT_accessibility(DW_ACCESS_public)
   14256              
   14257              $C$DW$1898      .dwtag  DW_TAG_member
   14258                      .dwattr $C$DW$1898, DW_AT_type(*$C$DW$T$70)
   14259                      .dwattr $C$DW$1898, DW_AT_name("pllHandle")
   14260                      .dwattr $C$DW$1898, DW_AT_TI_symbol_name("_pllHandle")
   14261                      .dwattr $C$DW$1898, DW_AT_data_member_location[DW_OP_plus_uconst 0x7a]
   14262                      .dwattr $C$DW$1898, DW_AT_accessibility(DW_ACCESS_public)
   14263              
   14264              $C$DW$1899      .dwtag  DW_TAG_member
   14265                      .dwattr $C$DW$1899, DW_AT_type(*$C$DW$T$73)
   14266                      .dwattr $C$DW$1899, DW_AT_name("pwmHandle")
   14267                      .dwattr $C$DW$1899, DW_AT_TI_symbol_name("_pwmHandle")
   14268                      .dwattr $C$DW$1899, DW_AT_data_member_location[DW_OP_plus_uconst 0x7c]
   14269                      .dwattr $C$DW$1899, DW_AT_accessibility(DW_ACCESS_public)
   14270              
   14271              $C$DW$1900      .dwtag  DW_TAG_member
   14272                      .dwattr $C$DW$1900, DW_AT_type(*$C$DW$T$73)
   14273                      .dwattr $C$DW$1900, DW_AT_name("pwmDacHandle")
   14274                      .dwattr $C$DW$1900, DW_AT_TI_symbol_name("_pwmDacHandle")
   14275                      .dwattr $C$DW$1900, DW_AT_data_member_location[DW_OP_plus_uconst 0x82]
   14276                      .dwattr $C$DW$1900, DW_AT_accessibility(DW_ACCESS_public)
   14277              
   14278              $C$DW$1901      .dwtag  DW_TAG_member
   14279                      .dwattr $C$DW$1901, DW_AT_type(*$C$DW$T$75)
   14280                      .dwattr $C$DW$1901, DW_AT_name("pwrHandle")
   14281                      .dwattr $C$DW$1901, DW_AT_TI_symbol_name("_pwrHandle")
   14282                      .dwattr $C$DW$1901, DW_AT_data_member_location[DW_OP_plus_uconst 0x88]
   14283                      .dwattr $C$DW$1901, DW_AT_accessibility(DW_ACCESS_public)
   14284              
   14285              $C$DW$1902      .dwtag  DW_TAG_member
   14286                      .dwattr $C$DW$1902, DW_AT_type(*$C$DW$T$78)
   14287                      .dwattr $C$DW$1902, DW_AT_name("timerHandle")
TMS320C2000 Assembler PC v15.12.3 Tue Sep 12 21:32:34 2017

Tools Copyright (c) 1996-2015 Texas Instruments Incorporated
C:\Users\wmj\AppData\Local\Temp\2302810                              PAGE  270

   14288                      .dwattr $C$DW$1902, DW_AT_TI_symbol_name("_timerHandle")
   14289                      .dwattr $C$DW$1902, DW_AT_data_member_location[DW_OP_plus_uconst 0x8a]
   14290                      .dwattr $C$DW$1902, DW_AT_accessibility(DW_ACCESS_public)
   14291              
   14292              $C$DW$1903      .dwtag  DW_TAG_member
   14293                      .dwattr $C$DW$1903, DW_AT_type(*$C$DW$T$80)
   14294                      .dwattr $C$DW$1903, DW_AT_name("i2cHandle")
   14295                      .dwattr $C$DW$1903, DW_AT_TI_symbol_name("_i2cHandle")
   14296                      .dwattr $C$DW$1903, DW_AT_data_member_location[DW_OP_plus_uconst 0x90]
   14297                      .dwattr $C$DW$1903, DW_AT_accessibility(DW_ACCESS_public)
   14298              
   14299              $C$DW$1904      .dwtag  DW_TAG_member
   14300                      .dwattr $C$DW$1904, DW_AT_type(*$C$DW$T$82)
   14301                      .dwattr $C$DW$1904, DW_AT_name("spiAHandle")
   14302                      .dwattr $C$DW$1904, DW_AT_TI_symbol_name("_spiAHandle")
   14303                      .dwattr $C$DW$1904, DW_AT_data_member_location[DW_OP_plus_uconst 0x92]
   14304                      .dwattr $C$DW$1904, DW_AT_accessibility(DW_ACCESS_public)
   14305              
   14306              $C$DW$1905      .dwtag  DW_TAG_member
   14307                      .dwattr $C$DW$1905, DW_AT_type(*$C$DW$T$84)
   14308                      .dwattr $C$DW$1905, DW_AT_name("wdogHandle")
   14309                      .dwattr $C$DW$1905, DW_AT_TI_symbol_name("_wdogHandle")
   14310                      .dwattr $C$DW$1905, DW_AT_data_member_location[DW_OP_plus_uconst 0x94]
   14311                      .dwattr $C$DW$1905, DW_AT_accessibility(DW_ACCESS_public)
   14312              
   14313              $C$DW$1906      .dwtag  DW_TAG_member
   14314                      .dwattr $C$DW$1906, DW_AT_type(*$C$DW$T$86)
   14315                      .dwattr $C$DW$1906, DW_AT_name("sciHandle")
   14316                      .dwattr $C$DW$1906, DW_AT_TI_symbol_name("_sciHandle")
   14317                      .dwattr $C$DW$1906, DW_AT_data_member_location[DW_OP_plus_uconst 0x96]
   14318                      .dwattr $C$DW$1906, DW_AT_accessibility(DW_ACCESS_public)
   14319              
   14320              $C$DW$1907      .dwtag  DW_TAG_member
   14321                      .dwattr $C$DW$1907, DW_AT_type(*$C$DW$T$87)
   14322                      .dwattr $C$DW$1907, DW_AT_name("adcBias")
   14323                      .dwattr $C$DW$1907, DW_AT_TI_symbol_name("_adcBias")
   14324                      .dwattr $C$DW$1907, DW_AT_data_member_location[DW_OP_plus_uconst 0x98]
   14325                      .dwattr $C$DW$1907, DW_AT_accessibility(DW_ACCESS_public)
   14326              
   14327              $C$DW$1908      .dwtag  DW_TAG_member
   14328                      .dwattr $C$DW$1908, DW_AT_type(*$C$DW$T$35)
   14329                      .dwattr $C$DW$1908, DW_AT_name("current_sf")
   14330                      .dwattr $C$DW$1908, DW_AT_TI_symbol_name("_current_sf")
   14331                      .dwattr $C$DW$1908, DW_AT_data_member_location[DW_OP_plus_uconst 0xae]
   14332                      .dwattr $C$DW$1908, DW_AT_accessibility(DW_ACCESS_public)
   14333              
   14334              $C$DW$1909      .dwtag  DW_TAG_member
   14335                      .dwattr $C$DW$1909, DW_AT_type(*$C$DW$T$35)
   14336                      .dwattr $C$DW$1909, DW_AT_name("voltage_sf")
   14337                      .dwattr $C$DW$1909, DW_AT_TI_symbol_name("_voltage_sf")
   14338                      .dwattr $C$DW$1909, DW_AT_data_member_location[DW_OP_plus_uconst 0xb0]
   14339                      .dwattr $C$DW$1909, DW_AT_accessibility(DW_ACCESS_public)
   14340              
   14341              $C$DW$1910      .dwtag  DW_TAG_member
   14342                      .dwattr $C$DW$1910, DW_AT_type(*$C$DW$T$33)
TMS320C2000 Assembler PC v15.12.3 Tue Sep 12 21:32:34 2017

Tools Copyright (c) 1996-2015 Texas Instruments Incorporated
C:\Users\wmj\AppData\Local\Temp\2302810                              PAGE  271

   14343                      .dwattr $C$DW$1910, DW_AT_name("numCurrentSensors")
   14344                      .dwattr $C$DW$1910, DW_AT_TI_symbol_name("_numCurrentSensors")
   14345                      .dwattr $C$DW$1910, DW_AT_data_member_location[DW_OP_plus_uconst 0xb2]
   14346                      .dwattr $C$DW$1910, DW_AT_accessibility(DW_ACCESS_public)
   14347              
   14348              $C$DW$1911      .dwtag  DW_TAG_member
   14349                      .dwattr $C$DW$1911, DW_AT_type(*$C$DW$T$33)
   14350                      .dwattr $C$DW$1911, DW_AT_name("numVoltageSensors")
   14351                      .dwattr $C$DW$1911, DW_AT_TI_symbol_name("_numVoltageSensors")
   14352                      .dwattr $C$DW$1911, DW_AT_data_member_location[DW_OP_plus_uconst 0xb3]
   14353                      .dwattr $C$DW$1911, DW_AT_accessibility(DW_ACCESS_public)
   14354              
   14355                      .dwendtag $C$DW$T$88
   14356              
   14357              $C$DW$T$353     .dwtag  DW_TAG_typedef
   14358                      .dwattr $C$DW$T$353, DW_AT_name("HAL_Obj")
   14359                      .dwattr $C$DW$T$353, DW_AT_type(*$C$DW$T$88)
   14360                      .dwattr $C$DW$T$353, DW_AT_language(DW_LANG_C)
   14361              
   14362              $C$DW$T$354     .dwtag  DW_TAG_pointer_type
   14363                      .dwattr $C$DW$T$354, DW_AT_type(*$C$DW$T$353)
   14364                      .dwattr $C$DW$T$354, DW_AT_address_class(0x20)
   14365              
   14366              $C$DW$T$355     .dwtag  DW_TAG_pointer_type
   14367                      .dwattr $C$DW$T$355, DW_AT_type(*$C$DW$T$88)
   14368                      .dwattr $C$DW$T$355, DW_AT_address_class(0x20)
   14369              
   14370              $C$DW$T$356     .dwtag  DW_TAG_typedef
   14371                      .dwattr $C$DW$T$356, DW_AT_name("HAL_Handle")
   14372                      .dwattr $C$DW$T$356, DW_AT_type(*$C$DW$T$355)
   14373                      .dwattr $C$DW$T$356, DW_AT_language(DW_LANG_C)
   14374              
   14375              $C$DW$1912      .dwtag  DW_TAG_TI_far_type
   14376                      .dwattr $C$DW$1912, DW_AT_type(*$C$DW$T$356)
   14377              
   14378              $C$DW$T$357     .dwtag  DW_TAG_const_type
   14379                      .dwattr $C$DW$T$357, DW_AT_type(*$C$DW$1912)
   14380              
   14381              
   14382              $C$DW$T$90      .dwtag  DW_TAG_structure_type
   14383                      .dwattr $C$DW$T$90, DW_AT_name("_MATH_vec3_")
   14384                      .dwattr $C$DW$T$90, DW_AT_byte_size(0x06)
   14385              $C$DW$1913      .dwtag  DW_TAG_member
   14386                      .dwattr $C$DW$1913, DW_AT_type(*$C$DW$T$89)
   14387                      .dwattr $C$DW$1913, DW_AT_name("value")
   14388                      .dwattr $C$DW$1913, DW_AT_TI_symbol_name("_value")
   14389                      .dwattr $C$DW$1913, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
   14390                      .dwattr $C$DW$1913, DW_AT_accessibility(DW_ACCESS_public)
   14391              
   14392                      .dwendtag $C$DW$T$90
   14393              
   14394              $C$DW$T$43      .dwtag  DW_TAG_typedef
   14395                      .dwattr $C$DW$T$43, DW_AT_name("MATH_vec3")
   14396                      .dwattr $C$DW$T$43, DW_AT_type(*$C$DW$T$90)
   14397                      .dwattr $C$DW$T$43, DW_AT_language(DW_LANG_C)
TMS320C2000 Assembler PC v15.12.3 Tue Sep 12 21:32:34 2017

Tools Copyright (c) 1996-2015 Texas Instruments Incorporated
C:\Users\wmj\AppData\Local\Temp\2302810                              PAGE  272

   14398              
   14399              
   14400              $C$DW$T$94      .dwtag  DW_TAG_structure_type
   14401                      .dwattr $C$DW$T$94, DW_AT_name("_OFFSET_")
   14402                      .dwattr $C$DW$T$94, DW_AT_byte_size(0x10)
   14403              $C$DW$1914      .dwtag  DW_TAG_member
   14404                      .dwattr $C$DW$1914, DW_AT_type(*$C$DW$T$35)
   14405                      .dwattr $C$DW$1914, DW_AT_name("value")
   14406                      .dwattr $C$DW$1914, DW_AT_TI_symbol_name("_value")
   14407                      .dwattr $C$DW$1914, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
   14408                      .dwattr $C$DW$1914, DW_AT_accessibility(DW_ACCESS_public)
   14409              
   14410              $C$DW$1915      .dwtag  DW_TAG_member
   14411                      .dwattr $C$DW$1915, DW_AT_type(*$C$DW$T$35)
   14412                      .dwattr $C$DW$1915, DW_AT_name("bias")
   14413                      .dwattr $C$DW$1915, DW_AT_TI_symbol_name("_bias")
   14414                      .dwattr $C$DW$1915, DW_AT_data_member_location[DW_OP_plus_uconst 0x2]
   14415                      .dwattr $C$DW$1915, DW_AT_accessibility(DW_ACCESS_public)
   14416              
   14417              $C$DW$1916      .dwtag  DW_TAG_member
   14418                      .dwattr $C$DW$1916, DW_AT_type(*$C$DW$T$91)
   14419                      .dwattr $C$DW$1916, DW_AT_name("filter")
   14420                      .dwattr $C$DW$1916, DW_AT_TI_symbol_name("_filter")
   14421                      .dwattr $C$DW$1916, DW_AT_data_member_location[DW_OP_plus_uconst 0x4]
   14422                      .dwattr $C$DW$1916, DW_AT_accessibility(DW_ACCESS_public)
   14423              
   14424              $C$DW$1917      .dwtag  DW_TAG_member
   14425                      .dwattr $C$DW$1917, DW_AT_type(*$C$DW$T$93)
   14426                      .dwattr $C$DW$1917, DW_AT_name("filterHandle")
   14427                      .dwattr $C$DW$1917, DW_AT_TI_symbol_name("_filterHandle")
   14428                      .dwattr $C$DW$1917, DW_AT_data_member_location[DW_OP_plus_uconst 0xe]
   14429                      .dwattr $C$DW$1917, DW_AT_accessibility(DW_ACCESS_public)
   14430              
   14431                      .dwendtag $C$DW$T$94
   14432              
   14433              $C$DW$T$63      .dwtag  DW_TAG_typedef
   14434                      .dwattr $C$DW$T$63, DW_AT_name("OFFSET_Obj")
   14435                      .dwattr $C$DW$T$63, DW_AT_type(*$C$DW$T$94)
   14436                      .dwattr $C$DW$T$63, DW_AT_language(DW_LANG_C)
   14437              
   14438              
   14439              $C$DW$T$64      .dwtag  DW_TAG_array_type
   14440                      .dwattr $C$DW$T$64, DW_AT_type(*$C$DW$T$63)
   14441                      .dwattr $C$DW$T$64, DW_AT_language(DW_LANG_C)
   14442                      .dwattr $C$DW$T$64, DW_AT_byte_size(0x30)
   14443              $C$DW$1918      .dwtag  DW_TAG_subrange_type
   14444                      .dwattr $C$DW$1918, DW_AT_upper_bound(0x02)
   14445              
   14446                      .dwendtag $C$DW$T$64
   14447              
   14448              
   14449              $C$DW$T$21      .dwtag  DW_TAG_structure_type
   14450                      .dwattr $C$DW$T$21, DW_AT_name("_OFFSET_Obj_")
   14451                      .dwattr $C$DW$T$21, DW_AT_declaration
   14452                      .dwendtag $C$DW$T$21
TMS320C2000 Assembler PC v15.12.3 Tue Sep 12 21:32:34 2017

Tools Copyright (c) 1996-2015 Texas Instruments Incorporated
C:\Users\wmj\AppData\Local\Temp\2302810                              PAGE  273

   14453              
   14454              $C$DW$T$60      .dwtag  DW_TAG_pointer_type
   14455                      .dwattr $C$DW$T$60, DW_AT_type(*$C$DW$T$21)
   14456                      .dwattr $C$DW$T$60, DW_AT_address_class(0x20)
   14457              
   14458              $C$DW$T$61      .dwtag  DW_TAG_typedef
   14459                      .dwattr $C$DW$T$61, DW_AT_name("OFFSET_Handle")
   14460                      .dwattr $C$DW$T$61, DW_AT_type(*$C$DW$T$60)
   14461                      .dwattr $C$DW$T$61, DW_AT_language(DW_LANG_C)
   14462              
   14463              
   14464              $C$DW$T$62      .dwtag  DW_TAG_array_type
   14465                      .dwattr $C$DW$T$62, DW_AT_type(*$C$DW$T$61)
   14466                      .dwattr $C$DW$T$62, DW_AT_language(DW_LANG_C)
   14467                      .dwattr $C$DW$T$62, DW_AT_byte_size(0x06)
   14468              $C$DW$1919      .dwtag  DW_TAG_subrange_type
   14469                      .dwattr $C$DW$1919, DW_AT_upper_bound(0x02)
   14470              
   14471                      .dwendtag $C$DW$T$62
   14472              
   14473              
   14474              $C$DW$T$95      .dwtag  DW_TAG_structure_type
   14475                      .dwattr $C$DW$T$95, DW_AT_name("_OSC_Obj_")
   14476                      .dwattr $C$DW$T$95, DW_AT_byte_size(0x03)
   14477              $C$DW$1920      .dwtag  DW_TAG_member
   14478                      .dwattr $C$DW$1920, DW_AT_type(*$C$DW$T$23)
   14479                      .dwattr $C$DW$1920, DW_AT_name("INTOSC1TRIM")
   14480                      .dwattr $C$DW$1920, DW_AT_TI_symbol_name("_INTOSC1TRIM")
   14481                      .dwattr $C$DW$1920, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
   14482                      .dwattr $C$DW$1920, DW_AT_accessibility(DW_ACCESS_public)
   14483              
   14484              $C$DW$1921      .dwtag  DW_TAG_member
   14485                      .dwattr $C$DW$1921, DW_AT_type(*$C$DW$T$23)
   14486                      .dwattr $C$DW$1921, DW_AT_name("rsvd_1")
   14487                      .dwattr $C$DW$1921, DW_AT_TI_symbol_name("_rsvd_1")
   14488                      .dwattr $C$DW$1921, DW_AT_data_member_location[DW_OP_plus_uconst 0x1]
   14489                      .dwattr $C$DW$1921, DW_AT_accessibility(DW_ACCESS_public)
   14490              
   14491              $C$DW$1922      .dwtag  DW_TAG_member
   14492                      .dwattr $C$DW$1922, DW_AT_type(*$C$DW$T$23)
   14493                      .dwattr $C$DW$1922, DW_AT_name("INTOSC2TRIM")
   14494                      .dwattr $C$DW$1922, DW_AT_TI_symbol_name("_INTOSC2TRIM")
   14495                      .dwattr $C$DW$1922, DW_AT_data_member_location[DW_OP_plus_uconst 0x2]
   14496                      .dwattr $C$DW$1922, DW_AT_accessibility(DW_ACCESS_public)
   14497              
   14498                      .dwendtag $C$DW$T$95
   14499              
   14500              $C$DW$T$65      .dwtag  DW_TAG_pointer_type
   14501                      .dwattr $C$DW$T$65, DW_AT_type(*$C$DW$T$95)
   14502                      .dwattr $C$DW$T$65, DW_AT_address_class(0x20)
   14503              
   14504              $C$DW$T$66      .dwtag  DW_TAG_typedef
   14505                      .dwattr $C$DW$T$66, DW_AT_name("OSC_Handle")
   14506                      .dwattr $C$DW$T$66, DW_AT_type(*$C$DW$T$65)
   14507                      .dwattr $C$DW$T$66, DW_AT_language(DW_LANG_C)
TMS320C2000 Assembler PC v15.12.3 Tue Sep 12 21:32:34 2017

Tools Copyright (c) 1996-2015 Texas Instruments Incorporated
C:\Users\wmj\AppData\Local\Temp\2302810                              PAGE  274

   14508              
   14509              
   14510              $C$DW$T$96      .dwtag  DW_TAG_structure_type
   14511                      .dwattr $C$DW$T$96, DW_AT_name("_PIE_IERIFR_t")
   14512                      .dwattr $C$DW$T$96, DW_AT_byte_size(0x02)
   14513              $C$DW$1923      .dwtag  DW_TAG_member
   14514                      .dwattr $C$DW$1923, DW_AT_type(*$C$DW$T$23)
   14515                      .dwattr $C$DW$1923, DW_AT_name("IER")
   14516                      .dwattr $C$DW$1923, DW_AT_TI_symbol_name("_IER")
   14517                      .dwattr $C$DW$1923, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
   14518                      .dwattr $C$DW$1923, DW_AT_accessibility(DW_ACCESS_public)
   14519              
   14520              $C$DW$1924      .dwtag  DW_TAG_member
   14521                      .dwattr $C$DW$1924, DW_AT_type(*$C$DW$T$23)
   14522                      .dwattr $C$DW$1924, DW_AT_name("IFR")
   14523                      .dwattr $C$DW$1924, DW_AT_TI_symbol_name("_IFR")
   14524                      .dwattr $C$DW$1924, DW_AT_data_member_location[DW_OP_plus_uconst 0x1]
   14525                      .dwattr $C$DW$1924, DW_AT_accessibility(DW_ACCESS_public)
   14526              
   14527                      .dwendtag $C$DW$T$96
   14528              
   14529              $C$DW$T$97      .dwtag  DW_TAG_typedef
   14530                      .dwattr $C$DW$T$97, DW_AT_name("PIE_IERIFR_t")
   14531                      .dwattr $C$DW$T$97, DW_AT_type(*$C$DW$T$96)
   14532                      .dwattr $C$DW$T$97, DW_AT_language(DW_LANG_C)
   14533              
   14534              $C$DW$1925      .dwtag  DW_TAG_TI_far_type
   14535                      .dwattr $C$DW$1925, DW_AT_type(*$C$DW$T$97)
   14536              
   14537              $C$DW$T$98      .dwtag  DW_TAG_volatile_type
   14538                      .dwattr $C$DW$T$98, DW_AT_type(*$C$DW$1925)
   14539              
   14540              
   14541              $C$DW$T$99      .dwtag  DW_TAG_array_type
   14542                      .dwattr $C$DW$T$99, DW_AT_type(*$C$DW$T$98)
   14543                      .dwattr $C$DW$T$99, DW_AT_language(DW_LANG_C)
   14544                      .dwattr $C$DW$T$99, DW_AT_byte_size(0x18)
   14545              $C$DW$1926      .dwtag  DW_TAG_subrange_type
   14546                      .dwattr $C$DW$1926, DW_AT_upper_bound(0x0b)
   14547              
   14548                      .dwendtag $C$DW$T$99
   14549              
   14550              
   14551              $C$DW$T$106     .dwtag  DW_TAG_structure_type
   14552                      .dwattr $C$DW$T$106, DW_AT_name("_PIE_Obj_")
   14553                      .dwattr $C$DW$T$106, DW_AT_byte_size(0x639c)
   14554              $C$DW$1927      .dwtag  DW_TAG_member
   14555                      .dwattr $C$DW$1927, DW_AT_type(*$C$DW$T$23)
   14556                      .dwattr $C$DW$1927, DW_AT_name("PIECTRL")
   14557                      .dwattr $C$DW$1927, DW_AT_TI_symbol_name("_PIECTRL")
   14558                      .dwattr $C$DW$1927, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
   14559                      .dwattr $C$DW$1927, DW_AT_accessibility(DW_ACCESS_public)
   14560              
   14561              $C$DW$1928      .dwtag  DW_TAG_member
   14562                      .dwattr $C$DW$1928, DW_AT_type(*$C$DW$T$23)
TMS320C2000 Assembler PC v15.12.3 Tue Sep 12 21:32:34 2017

Tools Copyright (c) 1996-2015 Texas Instruments Incorporated
C:\Users\wmj\AppData\Local\Temp\2302810                              PAGE  275

   14563                      .dwattr $C$DW$1928, DW_AT_name("PIEACK")
   14564                      .dwattr $C$DW$1928, DW_AT_TI_symbol_name("_PIEACK")
   14565                      .dwattr $C$DW$1928, DW_AT_data_member_location[DW_OP_plus_uconst 0x1]
   14566                      .dwattr $C$DW$1928, DW_AT_accessibility(DW_ACCESS_public)
   14567              
   14568              $C$DW$1929      .dwtag  DW_TAG_member
   14569                      .dwattr $C$DW$1929, DW_AT_type(*$C$DW$T$99)
   14570                      .dwattr $C$DW$1929, DW_AT_name("PIEIER_PIEIFR")
   14571                      .dwattr $C$DW$1929, DW_AT_TI_symbol_name("_PIEIER_PIEIFR")
   14572                      .dwattr $C$DW$1929, DW_AT_data_member_location[DW_OP_plus_uconst 0x2]
   14573                      .dwattr $C$DW$1929, DW_AT_accessibility(DW_ACCESS_public)
   14574              
   14575              $C$DW$1930      .dwtag  DW_TAG_member
   14576                      .dwattr $C$DW$1930, DW_AT_type(*$C$DW$T$100)
   14577                      .dwattr $C$DW$1930, DW_AT_name("rsvd_1")
   14578                      .dwattr $C$DW$1930, DW_AT_TI_symbol_name("_rsvd_1")
   14579                      .dwattr $C$DW$1930, DW_AT_data_member_location[DW_OP_plus_uconst 0x1a]
