TMS320C2000 Assembler PC v15.12.3 Mon Sep 25 12:51:22 2017

Tools Copyright (c) 1996-2015 Texas Instruments Incorporated
C:\Users\wmj\AppData\Local\Temp\1048412                              PAGE    1

       1              ;***************************************************************
       2              ;* TMS320C2000 C/C++ Codegen                   PC v15.12.3.LTS *
       3              ;* Date/Time created: Mon Sep 25 12:51:21 2017                 *
       4              ;***************************************************************
       5                      .compiler_opts --abi=coffabi --float_support=softlib --hll_source=on --mem_model:code=flat --mem_mode
       6        0002  FP      .set    XAR2
       7              
       8              $C$DW$CU        .dwtag  DW_TAG_compile_unit
       9                      .dwattr $C$DW$CU, DW_AT_name("D:/BM1000/sw/modules/hal/boards/hvkit_rev1p1/f28x/f2802x/src/hal.c")
      10                      .dwattr $C$DW$CU, DW_AT_producer("TI TMS320C2000 C/C++ Codegen PC v15.12.3.LTS Copyright (c) 1996-201
      11                      .dwattr $C$DW$CU, DW_AT_TI_version(0x01)
      12                      .dwattr $C$DW$CU, DW_AT_comp_dir("D:\BM1000\sw\solutions\instaspin_foc\boards\hvkit_rev1p1\f28x\f2802
      13              
      14              $C$DW$1 .dwtag  DW_TAG_subprogram
      15                      .dwattr $C$DW$1, DW_AT_name("SPI_setClkPolarity")

   13593              $C$DW$1806      .dwtag  DW_TAG_TI_far_type
   13594                      .dwattr $C$DW$1806, DW_AT_type(*$C$DW$T$317)
   13595              
   13596              $C$DW$T$318     .dwtag  DW_TAG_const_type
   13597                      .dwattr $C$DW$T$318, DW_AT_type(*$C$DW$1806)
   13598              
TMS320C2000 Assembler PC v15.12.3 Mon Sep 25 12:51:22 2017

Tools Copyright (c) 1996-2015 Texas Instruments Incorporated
C:\Users\wmj\AppData\Local\Temp\1048412                              PAGE  258

   13599              
   13600              $C$DW$T$319     .dwtag  DW_TAG_enumeration_type
   13601                      .dwattr $C$DW$T$319, DW_AT_byte_size(0x01)
   13602              $C$DW$1807      .dwtag  DW_TAG_enumerator
   13603                      .dwattr $C$DW$1807, DW_AT_name("SCI_NumStopBits_One")
   13604                      .dwattr $C$DW$1807, DW_AT_const_value(0x00)
   13605              
   13606              $C$DW$1808      .dwtag  DW_TAG_enumerator
   13607                      .dwattr $C$DW$1808, DW_AT_name("SCI_NumStopBits_Two")
   13608                      .dwattr $C$DW$1808, DW_AT_const_value(0x80)
   13609              
   13610                      .dwendtag $C$DW$T$319
   13611              
   13612              $C$DW$T$320     .dwtag  DW_TAG_typedef
   13613                      .dwattr $C$DW$T$320, DW_AT_name("SCI_NumStopBits_e")
   13614                      .dwattr $C$DW$T$320, DW_AT_type(*$C$DW$T$319)
   13615                      .dwattr $C$DW$T$320, DW_AT_language(DW_LANG_C)
   13616              
   13617              $C$DW$1809      .dwtag  DW_TAG_TI_far_type
   13618                      .dwattr $C$DW$1809, DW_AT_type(*$C$DW$T$320)
   13619              
   13620              $C$DW$T$321     .dwtag  DW_TAG_const_type
   13621                      .dwattr $C$DW$T$321, DW_AT_type(*$C$DW$1809)
   13622              
   13623              
   13624              $C$DW$T$322     .dwtag  DW_TAG_enumeration_type
   13625                      .dwattr $C$DW$T$322, DW_AT_byte_size(0x01)
   13626              $C$DW$1810      .dwtag  DW_TAG_enumerator
   13627                      .dwattr $C$DW$1810, DW_AT_name("SCI_Parity_Odd")
   13628                      .dwattr $C$DW$1810, DW_AT_const_value(0x00)
   13629              
   13630              $C$DW$1811      .dwtag  DW_TAG_enumerator
   13631                      .dwattr $C$DW$1811, DW_AT_name("SCI_Parity_Even")
   13632                      .dwattr $C$DW$1811, DW_AT_const_value(0x40)
   13633              
   13634                      .dwendtag $C$DW$T$322
   13635              
   13636              $C$DW$T$323     .dwtag  DW_TAG_typedef
   13637                      .dwattr $C$DW$T$323, DW_AT_name("SCI_Parity_e")
   13638                      .dwattr $C$DW$T$323, DW_AT_type(*$C$DW$T$322)
   13639                      .dwattr $C$DW$T$323, DW_AT_language(DW_LANG_C)
   13640              
   13641              $C$DW$1812      .dwtag  DW_TAG_TI_far_type
   13642                      .dwattr $C$DW$1812, DW_AT_type(*$C$DW$T$323)
   13643              
   13644              $C$DW$T$324     .dwtag  DW_TAG_const_type
   13645                      .dwattr $C$DW$T$324, DW_AT_type(*$C$DW$1812)
   13646              
   13647              
   13648              $C$DW$T$325     .dwtag  DW_TAG_enumeration_type
   13649                      .dwattr $C$DW$T$325, DW_AT_byte_size(0x01)
   13650              $C$DW$1813      .dwtag  DW_TAG_enumerator
   13651                      .dwattr $C$DW$1813, DW_AT_name("HAL_SensorType_Current")
   13652                      .dwattr $C$DW$1813, DW_AT_const_value(0x00)
   13653              
TMS320C2000 Assembler PC v15.12.3 Mon Sep 25 12:51:22 2017

Tools Copyright (c) 1996-2015 Texas Instruments Incorporated
C:\Users\wmj\AppData\Local\Temp\1048412                              PAGE  259

   13654              $C$DW$1814      .dwtag  DW_TAG_enumerator
   13655                      .dwattr $C$DW$1814, DW_AT_name("HAL_SensorType_Voltage")
   13656                      .dwattr $C$DW$1814, DW_AT_const_value(0x01)
   13657              
   13658                      .dwendtag $C$DW$T$325
   13659              
   13660              $C$DW$T$326     .dwtag  DW_TAG_typedef
   13661                      .dwattr $C$DW$T$326, DW_AT_name("HAL_SensorType_e")
   13662                      .dwattr $C$DW$T$326, DW_AT_type(*$C$DW$T$325)
   13663                      .dwattr $C$DW$T$326, DW_AT_language(DW_LANG_C)
   13664              
   13665              
   13666              $C$DW$T$19      .dwtag  DW_TAG_structure_type
   13667                      .dwattr $C$DW$T$19, DW_AT_name("I2C_Obj")
   13668                      .dwattr $C$DW$T$19, DW_AT_declaration
   13669                      .dwendtag $C$DW$T$19
   13670              
   13671              $C$DW$T$79      .dwtag  DW_TAG_pointer_type
   13672                      .dwattr $C$DW$T$79, DW_AT_type(*$C$DW$T$19)
   13673                      .dwattr $C$DW$T$79, DW_AT_address_class(0x20)
   13674              
   13675              $C$DW$T$80      .dwtag  DW_TAG_typedef
   13676                      .dwattr $C$DW$T$80, DW_AT_name("I2C_Handle")
   13677                      .dwattr $C$DW$T$80, DW_AT_type(*$C$DW$T$79)
   13678                      .dwattr $C$DW$T$80, DW_AT_language(DW_LANG_C)
   13679              
   13680              
   13681              $C$DW$T$30      .dwtag  DW_TAG_structure_type
   13682                      .dwattr $C$DW$T$30, DW_AT_name("_ADC_Obj_")
   13683                      .dwattr $C$DW$T$30, DW_AT_byte_size(0x6650)
   13684              $C$DW$1815      .dwtag  DW_TAG_member
   13685                      .dwattr $C$DW$1815, DW_AT_type(*$C$DW$T$24)
   13686                      .dwattr $C$DW$1815, DW_AT_name("ADCRESULT")
   13687                      .dwattr $C$DW$1815, DW_AT_TI_symbol_name("_ADCRESULT")
   13688                      .dwattr $C$DW$1815, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
   13689                      .dwattr $C$DW$1815, DW_AT_accessibility(DW_ACCESS_public)
   13690              
   13691              $C$DW$1816      .dwtag  DW_TAG_member
   13692                      .dwattr $C$DW$1816, DW_AT_type(*$C$DW$T$25)
   13693                      .dwattr $C$DW$1816, DW_AT_name("resvd_1")
   13694                      .dwattr $C$DW$1816, DW_AT_TI_symbol_name("_resvd_1")
   13695                      .dwattr $C$DW$1816, DW_AT_data_member_location[DW_OP_plus_uconst 0x10]
   13696                      .dwattr $C$DW$1816, DW_AT_accessibility(DW_ACCESS_public)
   13697              
   13698              $C$DW$1817      .dwtag  DW_TAG_member
   13699                      .dwattr $C$DW$1817, DW_AT_type(*$C$DW$T$23)
   13700                      .dwattr $C$DW$1817, DW_AT_name("ADCCTL1")
   13701                      .dwattr $C$DW$1817, DW_AT_TI_symbol_name("_ADCCTL1")
   13702                      .dwattr $C$DW$1817, DW_AT_data_member_location[DW_OP_plus_uconst 0x6600]
   13703                      .dwattr $C$DW$1817, DW_AT_accessibility(DW_ACCESS_public)
   13704              
   13705              $C$DW$1818      .dwtag  DW_TAG_member
   13706                      .dwattr $C$DW$1818, DW_AT_type(*$C$DW$T$23)
   13707                      .dwattr $C$DW$1818, DW_AT_name("ADCCTL2")
   13708                      .dwattr $C$DW$1818, DW_AT_TI_symbol_name("_ADCCTL2")
TMS320C2000 Assembler PC v15.12.3 Mon Sep 25 12:51:22 2017

Tools Copyright (c) 1996-2015 Texas Instruments Incorporated
C:\Users\wmj\AppData\Local\Temp\1048412                              PAGE  260

   13709                      .dwattr $C$DW$1818, DW_AT_data_member_location[DW_OP_plus_uconst 0x6601]
   13710                      .dwattr $C$DW$1818, DW_AT_accessibility(DW_ACCESS_public)
   13711              
   13712              $C$DW$1819      .dwtag  DW_TAG_member
   13713                      .dwattr $C$DW$1819, DW_AT_type(*$C$DW$T$26)
   13714                      .dwattr $C$DW$1819, DW_AT_name("rsvd_2")
   13715                      .dwattr $C$DW$1819, DW_AT_TI_symbol_name("_rsvd_2")
   13716                      .dwattr $C$DW$1819, DW_AT_data_member_location[DW_OP_plus_uconst 0x6602]
   13717                      .dwattr $C$DW$1819, DW_AT_accessibility(DW_ACCESS_public)
   13718              
   13719              $C$DW$1820      .dwtag  DW_TAG_member
   13720                      .dwattr $C$DW$1820, DW_AT_type(*$C$DW$T$23)
   13721                      .dwattr $C$DW$1820, DW_AT_name("ADCINTFLG")
   13722                      .dwattr $C$DW$1820, DW_AT_TI_symbol_name("_ADCINTFLG")
   13723                      .dwattr $C$DW$1820, DW_AT_data_member_location[DW_OP_plus_uconst 0x6604]
   13724                      .dwattr $C$DW$1820, DW_AT_accessibility(DW_ACCESS_public)
   13725              
   13726              $C$DW$1821      .dwtag  DW_TAG_member
   13727                      .dwattr $C$DW$1821, DW_AT_type(*$C$DW$T$23)
   13728                      .dwattr $C$DW$1821, DW_AT_name("ADCINTFLGCLR")
   13729                      .dwattr $C$DW$1821, DW_AT_TI_symbol_name("_ADCINTFLGCLR")
   13730                      .dwattr $C$DW$1821, DW_AT_data_member_location[DW_OP_plus_uconst 0x6605]
   13731                      .dwattr $C$DW$1821, DW_AT_accessibility(DW_ACCESS_public)
   13732              
   13733              $C$DW$1822      .dwtag  DW_TAG_member
   13734                      .dwattr $C$DW$1822, DW_AT_type(*$C$DW$T$23)
   13735                      .dwattr $C$DW$1822, DW_AT_name("ADCINTOVF")
   13736                      .dwattr $C$DW$1822, DW_AT_TI_symbol_name("_ADCINTOVF")
   13737                      .dwattr $C$DW$1822, DW_AT_data_member_location[DW_OP_plus_uconst 0x6606]
   13738                      .dwattr $C$DW$1822, DW_AT_accessibility(DW_ACCESS_public)
   13739              
   13740              $C$DW$1823      .dwtag  DW_TAG_member
   13741                      .dwattr $C$DW$1823, DW_AT_type(*$C$DW$T$23)
   13742                      .dwattr $C$DW$1823, DW_AT_name("ADCINTOVFCLR")
   13743                      .dwattr $C$DW$1823, DW_AT_TI_symbol_name("_ADCINTOVFCLR")
   13744                      .dwattr $C$DW$1823, DW_AT_data_member_location[DW_OP_plus_uconst 0x6607]
   13745                      .dwattr $C$DW$1823, DW_AT_accessibility(DW_ACCESS_public)
   13746              
   13747              $C$DW$1824      .dwtag  DW_TAG_member
   13748                      .dwattr $C$DW$1824, DW_AT_type(*$C$DW$T$27)
   13749                      .dwattr $C$DW$1824, DW_AT_name("INTSELxNy")
   13750                      .dwattr $C$DW$1824, DW_AT_TI_symbol_name("_INTSELxNy")
   13751                      .dwattr $C$DW$1824, DW_AT_data_member_location[DW_OP_plus_uconst 0x6608]
   13752                      .dwattr $C$DW$1824, DW_AT_accessibility(DW_ACCESS_public)
   13753              
   13754              $C$DW$1825      .dwtag  DW_TAG_member
   13755                      .dwattr $C$DW$1825, DW_AT_type(*$C$DW$T$28)
   13756                      .dwattr $C$DW$1825, DW_AT_name("rsvd_3")
   13757                      .dwattr $C$DW$1825, DW_AT_TI_symbol_name("_rsvd_3")
   13758                      .dwattr $C$DW$1825, DW_AT_data_member_location[DW_OP_plus_uconst 0x660d]
   13759                      .dwattr $C$DW$1825, DW_AT_accessibility(DW_ACCESS_public)
   13760              
   13761              $C$DW$1826      .dwtag  DW_TAG_member
   13762                      .dwattr $C$DW$1826, DW_AT_type(*$C$DW$T$23)
   13763                      .dwattr $C$DW$1826, DW_AT_name("SOCPRICTRL")
TMS320C2000 Assembler PC v15.12.3 Mon Sep 25 12:51:22 2017

Tools Copyright (c) 1996-2015 Texas Instruments Incorporated
C:\Users\wmj\AppData\Local\Temp\1048412                              PAGE  261

   13764                      .dwattr $C$DW$1826, DW_AT_TI_symbol_name("_SOCPRICTRL")
   13765                      .dwattr $C$DW$1826, DW_AT_data_member_location[DW_OP_plus_uconst 0x6610]
   13766                      .dwattr $C$DW$1826, DW_AT_accessibility(DW_ACCESS_public)
   13767              
   13768              $C$DW$1827      .dwtag  DW_TAG_member
   13769                      .dwattr $C$DW$1827, DW_AT_type(*$C$DW$T$23)
   13770                      .dwattr $C$DW$1827, DW_AT_name("rsvd_4")
   13771                      .dwattr $C$DW$1827, DW_AT_TI_symbol_name("_rsvd_4")
   13772                      .dwattr $C$DW$1827, DW_AT_data_member_location[DW_OP_plus_uconst 0x6611]
   13773                      .dwattr $C$DW$1827, DW_AT_accessibility(DW_ACCESS_public)
   13774              
   13775              $C$DW$1828      .dwtag  DW_TAG_member
   13776                      .dwattr $C$DW$1828, DW_AT_type(*$C$DW$T$23)
   13777                      .dwattr $C$DW$1828, DW_AT_name("ADCSAMPLEMODE")
   13778                      .dwattr $C$DW$1828, DW_AT_TI_symbol_name("_ADCSAMPLEMODE")
   13779                      .dwattr $C$DW$1828, DW_AT_data_member_location[DW_OP_plus_uconst 0x6612]
   13780                      .dwattr $C$DW$1828, DW_AT_accessibility(DW_ACCESS_public)
   13781              
   13782              $C$DW$1829      .dwtag  DW_TAG_member
   13783                      .dwattr $C$DW$1829, DW_AT_type(*$C$DW$T$23)
   13784                      .dwattr $C$DW$1829, DW_AT_name("rsvd_5")
   13785                      .dwattr $C$DW$1829, DW_AT_TI_symbol_name("_rsvd_5")
   13786                      .dwattr $C$DW$1829, DW_AT_data_member_location[DW_OP_plus_uconst 0x6613]
   13787                      .dwattr $C$DW$1829, DW_AT_accessibility(DW_ACCESS_public)
   13788              
   13789              $C$DW$1830      .dwtag  DW_TAG_member
   13790                      .dwattr $C$DW$1830, DW_AT_type(*$C$DW$T$23)
   13791                      .dwattr $C$DW$1830, DW_AT_name("ADCINTSOCSEL1")
   13792                      .dwattr $C$DW$1830, DW_AT_TI_symbol_name("_ADCINTSOCSEL1")
   13793                      .dwattr $C$DW$1830, DW_AT_data_member_location[DW_OP_plus_uconst 0x6614]
   13794                      .dwattr $C$DW$1830, DW_AT_accessibility(DW_ACCESS_public)
   13795              
   13796              $C$DW$1831      .dwtag  DW_TAG_member
   13797                      .dwattr $C$DW$1831, DW_AT_type(*$C$DW$T$23)
   13798                      .dwattr $C$DW$1831, DW_AT_name("ADCINTSOCSEL2")
   13799                      .dwattr $C$DW$1831, DW_AT_TI_symbol_name("_ADCINTSOCSEL2")
   13800                      .dwattr $C$DW$1831, DW_AT_data_member_location[DW_OP_plus_uconst 0x6615]
   13801                      .dwattr $C$DW$1831, DW_AT_accessibility(DW_ACCESS_public)
   13802              
   13803              $C$DW$1832      .dwtag  DW_TAG_member
   13804                      .dwattr $C$DW$1832, DW_AT_type(*$C$DW$T$26)
   13805                      .dwattr $C$DW$1832, DW_AT_name("rsvd_6")
   13806                      .dwattr $C$DW$1832, DW_AT_TI_symbol_name("_rsvd_6")
   13807                      .dwattr $C$DW$1832, DW_AT_data_member_location[DW_OP_plus_uconst 0x6616]
   13808                      .dwattr $C$DW$1832, DW_AT_accessibility(DW_ACCESS_public)
   13809              
   13810              $C$DW$1833      .dwtag  DW_TAG_member
   13811                      .dwattr $C$DW$1833, DW_AT_type(*$C$DW$T$23)
   13812                      .dwattr $C$DW$1833, DW_AT_name("ADCSOCFLG1")
   13813                      .dwattr $C$DW$1833, DW_AT_TI_symbol_name("_ADCSOCFLG1")
   13814                      .dwattr $C$DW$1833, DW_AT_data_member_location[DW_OP_plus_uconst 0x6618]
   13815                      .dwattr $C$DW$1833, DW_AT_accessibility(DW_ACCESS_public)
   13816              
   13817              $C$DW$1834      .dwtag  DW_TAG_member
   13818                      .dwattr $C$DW$1834, DW_AT_type(*$C$DW$T$23)
TMS320C2000 Assembler PC v15.12.3 Mon Sep 25 12:51:22 2017

Tools Copyright (c) 1996-2015 Texas Instruments Incorporated
C:\Users\wmj\AppData\Local\Temp\1048412                              PAGE  262

   13819                      .dwattr $C$DW$1834, DW_AT_name("rsvd_7")
   13820                      .dwattr $C$DW$1834, DW_AT_TI_symbol_name("_rsvd_7")
   13821                      .dwattr $C$DW$1834, DW_AT_data_member_location[DW_OP_plus_uconst 0x6619]
   13822                      .dwattr $C$DW$1834, DW_AT_accessibility(DW_ACCESS_public)
   13823              
   13824              $C$DW$1835      .dwtag  DW_TAG_member
   13825                      .dwattr $C$DW$1835, DW_AT_type(*$C$DW$T$23)
   13826                      .dwattr $C$DW$1835, DW_AT_name("ADCSOCFRC1")
   13827                      .dwattr $C$DW$1835, DW_AT_TI_symbol_name("_ADCSOCFRC1")
   13828                      .dwattr $C$DW$1835, DW_AT_data_member_location[DW_OP_plus_uconst 0x661a]
   13829                      .dwattr $C$DW$1835, DW_AT_accessibility(DW_ACCESS_public)
   13830              
   13831              $C$DW$1836      .dwtag  DW_TAG_member
   13832                      .dwattr $C$DW$1836, DW_AT_type(*$C$DW$T$23)
   13833                      .dwattr $C$DW$1836, DW_AT_name("rsvd_8")
   13834                      .dwattr $C$DW$1836, DW_AT_TI_symbol_name("_rsvd_8")
   13835                      .dwattr $C$DW$1836, DW_AT_data_member_location[DW_OP_plus_uconst 0x661b]
   13836                      .dwattr $C$DW$1836, DW_AT_accessibility(DW_ACCESS_public)
   13837              
   13838              $C$DW$1837      .dwtag  DW_TAG_member
   13839                      .dwattr $C$DW$1837, DW_AT_type(*$C$DW$T$23)
   13840                      .dwattr $C$DW$1837, DW_AT_name("ADCSOCOVF1")
   13841                      .dwattr $C$DW$1837, DW_AT_TI_symbol_name("_ADCSOCOVF1")
   13842                      .dwattr $C$DW$1837, DW_AT_data_member_location[DW_OP_plus_uconst 0x661c]
   13843                      .dwattr $C$DW$1837, DW_AT_accessibility(DW_ACCESS_public)
   13844              
   13845              $C$DW$1838      .dwtag  DW_TAG_member
   13846                      .dwattr $C$DW$1838, DW_AT_type(*$C$DW$T$23)
   13847                      .dwattr $C$DW$1838, DW_AT_name("rsvd_9")
   13848                      .dwattr $C$DW$1838, DW_AT_TI_symbol_name("_rsvd_9")
   13849                      .dwattr $C$DW$1838, DW_AT_data_member_location[DW_OP_plus_uconst 0x661d]
   13850                      .dwattr $C$DW$1838, DW_AT_accessibility(DW_ACCESS_public)
   13851              
   13852              $C$DW$1839      .dwtag  DW_TAG_member
   13853                      .dwattr $C$DW$1839, DW_AT_type(*$C$DW$T$23)
   13854                      .dwattr $C$DW$1839, DW_AT_name("ADCSOCOVFCLR1")
   13855                      .dwattr $C$DW$1839, DW_AT_TI_symbol_name("_ADCSOCOVFCLR1")
   13856                      .dwattr $C$DW$1839, DW_AT_data_member_location[DW_OP_plus_uconst 0x661e]
   13857                      .dwattr $C$DW$1839, DW_AT_accessibility(DW_ACCESS_public)
   13858              
   13859              $C$DW$1840      .dwtag  DW_TAG_member
   13860                      .dwattr $C$DW$1840, DW_AT_type(*$C$DW$T$23)
   13861                      .dwattr $C$DW$1840, DW_AT_name("rsvd_10")
   13862                      .dwattr $C$DW$1840, DW_AT_TI_symbol_name("_rsvd_10")
   13863                      .dwattr $C$DW$1840, DW_AT_data_member_location[DW_OP_plus_uconst 0x661f]
   13864                      .dwattr $C$DW$1840, DW_AT_accessibility(DW_ACCESS_public)
   13865              
   13866              $C$DW$1841      .dwtag  DW_TAG_member
   13867                      .dwattr $C$DW$1841, DW_AT_type(*$C$DW$T$24)
   13868                      .dwattr $C$DW$1841, DW_AT_name("ADCSOCxCTL")
   13869                      .dwattr $C$DW$1841, DW_AT_TI_symbol_name("_ADCSOCxCTL")
   13870                      .dwattr $C$DW$1841, DW_AT_data_member_location[DW_OP_plus_uconst 0x6620]
   13871                      .dwattr $C$DW$1841, DW_AT_accessibility(DW_ACCESS_public)
   13872              
   13873              $C$DW$1842      .dwtag  DW_TAG_member
TMS320C2000 Assembler PC v15.12.3 Mon Sep 25 12:51:22 2017

Tools Copyright (c) 1996-2015 Texas Instruments Incorporated
C:\Users\wmj\AppData\Local\Temp\1048412                              PAGE  263

   13874                      .dwattr $C$DW$1842, DW_AT_type(*$C$DW$T$24)
   13875                      .dwattr $C$DW$1842, DW_AT_name("rsvd_11")
   13876                      .dwattr $C$DW$1842, DW_AT_TI_symbol_name("_rsvd_11")
   13877                      .dwattr $C$DW$1842, DW_AT_data_member_location[DW_OP_plus_uconst 0x6630]
   13878                      .dwattr $C$DW$1842, DW_AT_accessibility(DW_ACCESS_public)
   13879              
   13880              $C$DW$1843      .dwtag  DW_TAG_member
   13881                      .dwattr $C$DW$1843, DW_AT_type(*$C$DW$T$23)
   13882                      .dwattr $C$DW$1843, DW_AT_name("ADCREFTRIM")
   13883                      .dwattr $C$DW$1843, DW_AT_TI_symbol_name("_ADCREFTRIM")
   13884                      .dwattr $C$DW$1843, DW_AT_data_member_location[DW_OP_plus_uconst 0x6640]
   13885                      .dwattr $C$DW$1843, DW_AT_accessibility(DW_ACCESS_public)
   13886              
   13887              $C$DW$1844      .dwtag  DW_TAG_member
   13888                      .dwattr $C$DW$1844, DW_AT_type(*$C$DW$T$23)
   13889                      .dwattr $C$DW$1844, DW_AT_name("ADCOFFTRIM")
   13890                      .dwattr $C$DW$1844, DW_AT_TI_symbol_name("_ADCOFFTRIM")
   13891                      .dwattr $C$DW$1844, DW_AT_data_member_location[DW_OP_plus_uconst 0x6641]
   13892                      .dwattr $C$DW$1844, DW_AT_accessibility(DW_ACCESS_public)
   13893              
   13894              $C$DW$1845      .dwtag  DW_TAG_member
   13895                      .dwattr $C$DW$1845, DW_AT_type(*$C$DW$T$29)
   13896                      .dwattr $C$DW$1845, DW_AT_name("resvd_12")
   13897                      .dwattr $C$DW$1845, DW_AT_TI_symbol_name("_resvd_12")
   13898                      .dwattr $C$DW$1845, DW_AT_data_member_location[DW_OP_plus_uconst 0x6642]
   13899                      .dwattr $C$DW$1845, DW_AT_accessibility(DW_ACCESS_public)
   13900              
   13901              $C$DW$1846      .dwtag  DW_TAG_member
   13902                      .dwattr $C$DW$1846, DW_AT_type(*$C$DW$T$23)
   13903                      .dwattr $C$DW$1846, DW_AT_name("ADCREV")
   13904                      .dwattr $C$DW$1846, DW_AT_TI_symbol_name("_ADCREV")
   13905                      .dwattr $C$DW$1846, DW_AT_data_member_location[DW_OP_plus_uconst 0x664f]
   13906                      .dwattr $C$DW$1846, DW_AT_accessibility(DW_ACCESS_public)
   13907              
   13908                      .dwendtag $C$DW$T$30
   13909              
   13910              $C$DW$T$333     .dwtag  DW_TAG_typedef
   13911                      .dwattr $C$DW$T$333, DW_AT_name("ADC_Obj")
   13912                      .dwattr $C$DW$T$333, DW_AT_type(*$C$DW$T$30)
   13913                      .dwattr $C$DW$T$333, DW_AT_language(DW_LANG_C)
   13914              
   13915              $C$DW$T$50      .dwtag  DW_TAG_pointer_type
   13916                      .dwattr $C$DW$T$50, DW_AT_type(*$C$DW$T$30)
   13917                      .dwattr $C$DW$T$50, DW_AT_address_class(0x20)
   13918              
   13919              $C$DW$T$51      .dwtag  DW_TAG_typedef
   13920                      .dwattr $C$DW$T$51, DW_AT_name("ADC_Handle")
   13921                      .dwattr $C$DW$T$51, DW_AT_type(*$C$DW$T$50)
   13922                      .dwattr $C$DW$T$51, DW_AT_language(DW_LANG_C)
   13923              
   13924              
   13925              $C$DW$T$32      .dwtag  DW_TAG_structure_type
   13926                      .dwattr $C$DW$T$32, DW_AT_name("_CLK_Obj_")
   13927                      .dwattr $C$DW$T$32, DW_AT_byte_size(0x11)
   13928              $C$DW$1847      .dwtag  DW_TAG_member
TMS320C2000 Assembler PC v15.12.3 Mon Sep 25 12:51:22 2017

Tools Copyright (c) 1996-2015 Texas Instruments Incorporated
C:\Users\wmj\AppData\Local\Temp\1048412                              PAGE  264

   13929                      .dwattr $C$DW$1847, DW_AT_type(*$C$DW$T$23)
   13930                      .dwattr $C$DW$1847, DW_AT_name("XCLK")
   13931                      .dwattr $C$DW$1847, DW_AT_TI_symbol_name("_XCLK")
   13932                      .dwattr $C$DW$1847, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
   13933                      .dwattr $C$DW$1847, DW_AT_accessibility(DW_ACCESS_public)
   13934              
   13935              $C$DW$1848      .dwtag  DW_TAG_member
   13936                      .dwattr $C$DW$1848, DW_AT_type(*$C$DW$T$23)
   13937                      .dwattr $C$DW$1848, DW_AT_name("rsvd_1")
   13938                      .dwattr $C$DW$1848, DW_AT_TI_symbol_name("_rsvd_1")
   13939                      .dwattr $C$DW$1848, DW_AT_data_member_location[DW_OP_plus_uconst 0x1]
   13940                      .dwattr $C$DW$1848, DW_AT_accessibility(DW_ACCESS_public)
   13941              
   13942              $C$DW$1849      .dwtag  DW_TAG_member
   13943                      .dwattr $C$DW$1849, DW_AT_type(*$C$DW$T$23)
   13944                      .dwattr $C$DW$1849, DW_AT_name("CLKCTL")
   13945                      .dwattr $C$DW$1849, DW_AT_TI_symbol_name("_CLKCTL")
   13946                      .dwattr $C$DW$1849, DW_AT_data_member_location[DW_OP_plus_uconst 0x2]
   13947                      .dwattr $C$DW$1849, DW_AT_accessibility(DW_ACCESS_public)
   13948              
   13949              $C$DW$1850      .dwtag  DW_TAG_member
   13950                      .dwattr $C$DW$1850, DW_AT_type(*$C$DW$T$31)
   13951                      .dwattr $C$DW$1850, DW_AT_name("rsvd_2")
   13952                      .dwattr $C$DW$1850, DW_AT_TI_symbol_name("_rsvd_2")
   13953                      .dwattr $C$DW$1850, DW_AT_data_member_location[DW_OP_plus_uconst 0x3]
   13954                      .dwattr $C$DW$1850, DW_AT_accessibility(DW_ACCESS_public)
   13955              
   13956              $C$DW$1851      .dwtag  DW_TAG_member
   13957                      .dwattr $C$DW$1851, DW_AT_type(*$C$DW$T$23)
   13958                      .dwattr $C$DW$1851, DW_AT_name("LOSPCP")
   13959                      .dwattr $C$DW$1851, DW_AT_TI_symbol_name("_LOSPCP")
   13960                      .dwattr $C$DW$1851, DW_AT_data_member_location[DW_OP_plus_uconst 0xb]
   13961                      .dwattr $C$DW$1851, DW_AT_accessibility(DW_ACCESS_public)
   13962              
   13963              $C$DW$1852      .dwtag  DW_TAG_member
   13964                      .dwattr $C$DW$1852, DW_AT_type(*$C$DW$T$23)
   13965                      .dwattr $C$DW$1852, DW_AT_name("PCLKCR0")
   13966                      .dwattr $C$DW$1852, DW_AT_TI_symbol_name("_PCLKCR0")
   13967                      .dwattr $C$DW$1852, DW_AT_data_member_location[DW_OP_plus_uconst 0xc]
   13968                      .dwattr $C$DW$1852, DW_AT_accessibility(DW_ACCESS_public)
   13969              
   13970              $C$DW$1853      .dwtag  DW_TAG_member
   13971                      .dwattr $C$DW$1853, DW_AT_type(*$C$DW$T$23)
   13972                      .dwattr $C$DW$1853, DW_AT_name("PCLKCR1")
   13973                      .dwattr $C$DW$1853, DW_AT_TI_symbol_name("_PCLKCR1")
   13974                      .dwattr $C$DW$1853, DW_AT_data_member_location[DW_OP_plus_uconst 0xd]
   13975                      .dwattr $C$DW$1853, DW_AT_accessibility(DW_ACCESS_public)
   13976              
   13977              $C$DW$1854      .dwtag  DW_TAG_member
   13978                      .dwattr $C$DW$1854, DW_AT_type(*$C$DW$T$26)
   13979                      .dwattr $C$DW$1854, DW_AT_name("rsvd_3")
   13980                      .dwattr $C$DW$1854, DW_AT_TI_symbol_name("_rsvd_3")
   13981                      .dwattr $C$DW$1854, DW_AT_data_member_location[DW_OP_plus_uconst 0xe]
   13982                      .dwattr $C$DW$1854, DW_AT_accessibility(DW_ACCESS_public)
   13983              
TMS320C2000 Assembler PC v15.12.3 Mon Sep 25 12:51:22 2017

Tools Copyright (c) 1996-2015 Texas Instruments Incorporated
C:\Users\wmj\AppData\Local\Temp\1048412                              PAGE  265

   13984              $C$DW$1855      .dwtag  DW_TAG_member
   13985                      .dwattr $C$DW$1855, DW_AT_type(*$C$DW$T$23)
   13986                      .dwattr $C$DW$1855, DW_AT_name("PCLKCR3")
   13987                      .dwattr $C$DW$1855, DW_AT_TI_symbol_name("_PCLKCR3")
   13988                      .dwattr $C$DW$1855, DW_AT_data_member_location[DW_OP_plus_uconst 0x10]
   13989                      .dwattr $C$DW$1855, DW_AT_accessibility(DW_ACCESS_public)
   13990              
   13991                      .dwendtag $C$DW$T$32
   13992              
   13993              $C$DW$T$52      .dwtag  DW_TAG_pointer_type
   13994                      .dwattr $C$DW$T$52, DW_AT_type(*$C$DW$T$32)
   13995                      .dwattr $C$DW$T$52, DW_AT_address_class(0x20)
   13996              
   13997              $C$DW$T$53      .dwtag  DW_TAG_typedef
   13998                      .dwattr $C$DW$T$53, DW_AT_name("CLK_Handle")
   13999                      .dwattr $C$DW$T$53, DW_AT_type(*$C$DW$T$52)
   14000                      .dwattr $C$DW$T$53, DW_AT_language(DW_LANG_C)
   14001              
   14002              
   14003              $C$DW$T$34      .dwtag  DW_TAG_structure_type
   14004                      .dwattr $C$DW$T$34, DW_AT_name("_CPU_Obj_")
   14005                      .dwattr $C$DW$T$34, DW_AT_byte_size(0x01)
   14006              $C$DW$1856      .dwtag  DW_TAG_member
   14007                      .dwattr $C$DW$1856, DW_AT_type(*$C$DW$T$33)
   14008                      .dwattr $C$DW$1856, DW_AT_name("tmp")
   14009                      .dwattr $C$DW$1856, DW_AT_TI_symbol_name("_tmp")
   14010                      .dwattr $C$DW$1856, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
   14011                      .dwattr $C$DW$1856, DW_AT_accessibility(DW_ACCESS_public)
   14012              
   14013                      .dwendtag $C$DW$T$34
   14014              
   14015              $C$DW$T$340     .dwtag  DW_TAG_typedef
   14016                      .dwattr $C$DW$T$340, DW_AT_name("CPU_Obj")
   14017                      .dwattr $C$DW$T$340, DW_AT_type(*$C$DW$T$34)
   14018                      .dwattr $C$DW$T$340, DW_AT_language(DW_LANG_C)
   14019              
   14020              $C$DW$T$54      .dwtag  DW_TAG_pointer_type
   14021                      .dwattr $C$DW$T$54, DW_AT_type(*$C$DW$T$34)
   14022                      .dwattr $C$DW$T$54, DW_AT_address_class(0x20)
   14023              
   14024              $C$DW$T$55      .dwtag  DW_TAG_typedef
   14025                      .dwattr $C$DW$T$55, DW_AT_name("CPU_Handle")
   14026                      .dwattr $C$DW$T$55, DW_AT_type(*$C$DW$T$54)
   14027                      .dwattr $C$DW$T$55, DW_AT_language(DW_LANG_C)
   14028              
   14029              
   14030              $C$DW$T$36      .dwtag  DW_TAG_structure_type
   14031                      .dwattr $C$DW$T$36, DW_AT_name("_FILTER_FO_")
   14032                      .dwattr $C$DW$T$36, DW_AT_byte_size(0x0a)
   14033              $C$DW$1857      .dwtag  DW_TAG_member
   14034                      .dwattr $C$DW$1857, DW_AT_type(*$C$DW$T$35)
   14035                      .dwattr $C$DW$1857, DW_AT_name("a1")
   14036                      .dwattr $C$DW$1857, DW_AT_TI_symbol_name("_a1")
   14037                      .dwattr $C$DW$1857, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
   14038                      .dwattr $C$DW$1857, DW_AT_accessibility(DW_ACCESS_public)
TMS320C2000 Assembler PC v15.12.3 Mon Sep 25 12:51:22 2017

Tools Copyright (c) 1996-2015 Texas Instruments Incorporated
C:\Users\wmj\AppData\Local\Temp\1048412                              PAGE  266

   14039              
   14040              $C$DW$1858      .dwtag  DW_TAG_member
   14041                      .dwattr $C$DW$1858, DW_AT_type(*$C$DW$T$35)
   14042                      .dwattr $C$DW$1858, DW_AT_name("b0")
   14043                      .dwattr $C$DW$1858, DW_AT_TI_symbol_name("_b0")
   14044                      .dwattr $C$DW$1858, DW_AT_data_member_location[DW_OP_plus_uconst 0x2]
   14045                      .dwattr $C$DW$1858, DW_AT_accessibility(DW_ACCESS_public)
   14046              
   14047              $C$DW$1859      .dwtag  DW_TAG_member
   14048                      .dwattr $C$DW$1859, DW_AT_type(*$C$DW$T$35)
   14049                      .dwattr $C$DW$1859, DW_AT_name("b1")
   14050                      .dwattr $C$DW$1859, DW_AT_TI_symbol_name("_b1")
   14051                      .dwattr $C$DW$1859, DW_AT_data_member_location[DW_OP_plus_uconst 0x4]
   14052                      .dwattr $C$DW$1859, DW_AT_accessibility(DW_ACCESS_public)
   14053              
   14054              $C$DW$1860      .dwtag  DW_TAG_member
   14055                      .dwattr $C$DW$1860, DW_AT_type(*$C$DW$T$35)
   14056                      .dwattr $C$DW$1860, DW_AT_name("x1")
   14057                      .dwattr $C$DW$1860, DW_AT_TI_symbol_name("_x1")
   14058                      .dwattr $C$DW$1860, DW_AT_data_member_location[DW_OP_plus_uconst 0x6]
   14059                      .dwattr $C$DW$1860, DW_AT_accessibility(DW_ACCESS_public)
   14060              
   14061              $C$DW$1861      .dwtag  DW_TAG_member
   14062                      .dwattr $C$DW$1861, DW_AT_type(*$C$DW$T$35)
   14063                      .dwattr $C$DW$1861, DW_AT_name("y1")
   14064                      .dwattr $C$DW$1861, DW_AT_TI_symbol_name("_y1")
   14065                      .dwattr $C$DW$1861, DW_AT_data_member_location[DW_OP_plus_uconst 0x8]
   14066                      .dwattr $C$DW$1861, DW_AT_accessibility(DW_ACCESS_public)
   14067              
   14068                      .dwendtag $C$DW$T$36
   14069              
   14070              $C$DW$T$93      .dwtag  DW_TAG_typedef
   14071                      .dwattr $C$DW$T$93, DW_AT_name("FILTER_FO_Obj")
   14072                      .dwattr $C$DW$T$93, DW_AT_type(*$C$DW$T$36)
   14073                      .dwattr $C$DW$T$93, DW_AT_language(DW_LANG_C)
   14074              
   14075              
   14076              $C$DW$T$20      .dwtag  DW_TAG_structure_type
   14077                      .dwattr $C$DW$T$20, DW_AT_name("_FILTER_FO_Obj_")
   14078                      .dwattr $C$DW$T$20, DW_AT_declaration
   14079                      .dwendtag $C$DW$T$20
   14080              
   14081              $C$DW$T$94      .dwtag  DW_TAG_pointer_type
   14082                      .dwattr $C$DW$T$94, DW_AT_type(*$C$DW$T$20)
   14083                      .dwattr $C$DW$T$94, DW_AT_address_class(0x20)
   14084              
   14085              $C$DW$T$95      .dwtag  DW_TAG_typedef
   14086                      .dwattr $C$DW$T$95, DW_AT_name("FILTER_FO_Handle")
   14087                      .dwattr $C$DW$T$95, DW_AT_type(*$C$DW$T$94)
   14088                      .dwattr $C$DW$T$95, DW_AT_language(DW_LANG_C)
   14089              
   14090              
   14091              $C$DW$T$37      .dwtag  DW_TAG_structure_type
   14092                      .dwattr $C$DW$T$37, DW_AT_name("_FLASH_Obj_")
   14093                      .dwattr $C$DW$T$37, DW_AT_byte_size(0x08)
TMS320C2000 Assembler PC v15.12.3 Mon Sep 25 12:51:22 2017

Tools Copyright (c) 1996-2015 Texas Instruments Incorporated
C:\Users\wmj\AppData\Local\Temp\1048412                              PAGE  267

   14094              $C$DW$1862      .dwtag  DW_TAG_member
   14095                      .dwattr $C$DW$1862, DW_AT_type(*$C$DW$T$23)
   14096                      .dwattr $C$DW$1862, DW_AT_name("FOPT")
   14097                      .dwattr $C$DW$1862, DW_AT_TI_symbol_name("_FOPT")
   14098                      .dwattr $C$DW$1862, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
   14099                      .dwattr $C$DW$1862, DW_AT_accessibility(DW_ACCESS_public)
   14100              
   14101              $C$DW$1863      .dwtag  DW_TAG_member
   14102                      .dwattr $C$DW$1863, DW_AT_type(*$C$DW$T$23)
   14103                      .dwattr $C$DW$1863, DW_AT_name("rsvd_1")
   14104                      .dwattr $C$DW$1863, DW_AT_TI_symbol_name("_rsvd_1")
   14105                      .dwattr $C$DW$1863, DW_AT_data_member_location[DW_OP_plus_uconst 0x1]
   14106                      .dwattr $C$DW$1863, DW_AT_accessibility(DW_ACCESS_public)
   14107              
   14108              $C$DW$1864      .dwtag  DW_TAG_member
   14109                      .dwattr $C$DW$1864, DW_AT_type(*$C$DW$T$23)
   14110                      .dwattr $C$DW$1864, DW_AT_name("FPWR")
   14111                      .dwattr $C$DW$1864, DW_AT_TI_symbol_name("_FPWR")
   14112                      .dwattr $C$DW$1864, DW_AT_data_member_location[DW_OP_plus_uconst 0x2]
   14113                      .dwattr $C$DW$1864, DW_AT_accessibility(DW_ACCESS_public)
   14114              
   14115              $C$DW$1865      .dwtag  DW_TAG_member
   14116                      .dwattr $C$DW$1865, DW_AT_type(*$C$DW$T$23)
   14117                      .dwattr $C$DW$1865, DW_AT_name("FSTATUS")
   14118                      .dwattr $C$DW$1865, DW_AT_TI_symbol_name("_FSTATUS")
   14119                      .dwattr $C$DW$1865, DW_AT_data_member_location[DW_OP_plus_uconst 0x3]
   14120                      .dwattr $C$DW$1865, DW_AT_accessibility(DW_ACCESS_public)
   14121              
   14122              $C$DW$1866      .dwtag  DW_TAG_member
   14123                      .dwattr $C$DW$1866, DW_AT_type(*$C$DW$T$23)
   14124                      .dwattr $C$DW$1866, DW_AT_name("FSTDBYWAIT")
   14125                      .dwattr $C$DW$1866, DW_AT_TI_symbol_name("_FSTDBYWAIT")
   14126                      .dwattr $C$DW$1866, DW_AT_data_member_location[DW_OP_plus_uconst 0x4]
   14127                      .dwattr $C$DW$1866, DW_AT_accessibility(DW_ACCESS_public)
   14128              
   14129              $C$DW$1867      .dwtag  DW_TAG_member
   14130                      .dwattr $C$DW$1867, DW_AT_type(*$C$DW$T$23)
   14131                      .dwattr $C$DW$1867, DW_AT_name("FACTIVEWAIT")
   14132                      .dwattr $C$DW$1867, DW_AT_TI_symbol_name("_FACTIVEWAIT")
   14133                      .dwattr $C$DW$1867, DW_AT_data_member_location[DW_OP_plus_uconst 0x5]
   14134                      .dwattr $C$DW$1867, DW_AT_accessibility(DW_ACCESS_public)
   14135              
   14136              $C$DW$1868      .dwtag  DW_TAG_member
   14137                      .dwattr $C$DW$1868, DW_AT_type(*$C$DW$T$23)
   14138                      .dwattr $C$DW$1868, DW_AT_name("FBANKWAIT")
   14139                      .dwattr $C$DW$1868, DW_AT_TI_symbol_name("_FBANKWAIT")
   14140                      .dwattr $C$DW$1868, DW_AT_data_member_location[DW_OP_plus_uconst 0x6]
   14141                      .dwattr $C$DW$1868, DW_AT_accessibility(DW_ACCESS_public)
   14142              
   14143              $C$DW$1869      .dwtag  DW_TAG_member
   14144                      .dwattr $C$DW$1869, DW_AT_type(*$C$DW$T$23)
   14145                      .dwattr $C$DW$1869, DW_AT_name("FOTPWAIT")
   14146                      .dwattr $C$DW$1869, DW_AT_TI_symbol_name("_FOTPWAIT")
   14147                      .dwattr $C$DW$1869, DW_AT_data_member_location[DW_OP_plus_uconst 0x7]
   14148                      .dwattr $C$DW$1869, DW_AT_accessibility(DW_ACCESS_public)
TMS320C2000 Assembler PC v15.12.3 Mon Sep 25 12:51:22 2017

Tools Copyright (c) 1996-2015 Texas Instruments Incorporated
C:\Users\wmj\AppData\Local\Temp\1048412                              PAGE  268

   14149              
   14150                      .dwendtag $C$DW$T$37
   14151              
   14152              $C$DW$T$56      .dwtag  DW_TAG_pointer_type
   14153                      .dwattr $C$DW$T$56, DW_AT_type(*$C$DW$T$37)
   14154                      .dwattr $C$DW$T$56, DW_AT_address_class(0x20)
   14155              
   14156              $C$DW$T$57      .dwtag  DW_TAG_typedef
   14157                      .dwattr $C$DW$T$57, DW_AT_name("FLASH_Handle")
   14158                      .dwattr $C$DW$T$57, DW_AT_type(*$C$DW$T$56)
   14159                      .dwattr $C$DW$T$57, DW_AT_language(DW_LANG_C)
   14160              
   14161              
   14162              $C$DW$T$42      .dwtag  DW_TAG_structure_type
   14163                      .dwattr $C$DW$T$42, DW_AT_name("_GPIO_Obj_")
   14164                      .dwattr $C$DW$T$42, DW_AT_byte_size(0x6a)
   14165              $C$DW$1870      .dwtag  DW_TAG_member
   14166                      .dwattr $C$DW$1870, DW_AT_type(*$C$DW$T$39)
   14167                      .dwattr $C$DW$1870, DW_AT_name("GPACTRL")
   14168                      .dwattr $C$DW$1870, DW_AT_TI_symbol_name("_GPACTRL")
   14169                      .dwattr $C$DW$1870, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
   14170                      .dwattr $C$DW$1870, DW_AT_accessibility(DW_ACCESS_public)
   14171              
   14172              $C$DW$1871      .dwtag  DW_TAG_member
   14173                      .dwattr $C$DW$1871, DW_AT_type(*$C$DW$T$39)
   14174                      .dwattr $C$DW$1871, DW_AT_name("GPAQSEL1")
   14175                      .dwattr $C$DW$1871, DW_AT_TI_symbol_name("_GPAQSEL1")
   14176                      .dwattr $C$DW$1871, DW_AT_data_member_location[DW_OP_plus_uconst 0x2]
   14177                      .dwattr $C$DW$1871, DW_AT_accessibility(DW_ACCESS_public)
   14178              
   14179              $C$DW$1872      .dwtag  DW_TAG_member
   14180                      .dwattr $C$DW$1872, DW_AT_type(*$C$DW$T$39)
   14181                      .dwattr $C$DW$1872, DW_AT_name("GPAQSEL2")
   14182                      .dwattr $C$DW$1872, DW_AT_TI_symbol_name("_GPAQSEL2")
   14183                      .dwattr $C$DW$1872, DW_AT_data_member_location[DW_OP_plus_uconst 0x4]
   14184                      .dwattr $C$DW$1872, DW_AT_accessibility(DW_ACCESS_public)
   14185              
   14186              $C$DW$1873      .dwtag  DW_TAG_member
   14187                      .dwattr $C$DW$1873, DW_AT_type(*$C$DW$T$39)
   14188                      .dwattr $C$DW$1873, DW_AT_name("GPAMUX1")
   14189                      .dwattr $C$DW$1873, DW_AT_TI_symbol_name("_GPAMUX1")
   14190                      .dwattr $C$DW$1873, DW_AT_data_member_location[DW_OP_plus_uconst 0x6]
   14191                      .dwattr $C$DW$1873, DW_AT_accessibility(DW_ACCESS_public)
   14192              
   14193              $C$DW$1874      .dwtag  DW_TAG_member
   14194                      .dwattr $C$DW$1874, DW_AT_type(*$C$DW$T$39)
   14195                      .dwattr $C$DW$1874, DW_AT_name("GPAMUX2")
   14196                      .dwattr $C$DW$1874, DW_AT_TI_symbol_name("_GPAMUX2")
   14197                      .dwattr $C$DW$1874, DW_AT_data_member_location[DW_OP_plus_uconst 0x8]
   14198                      .dwattr $C$DW$1874, DW_AT_accessibility(DW_ACCESS_public)
   14199              
   14200              $C$DW$1875      .dwtag  DW_TAG_member
   14201                      .dwattr $C$DW$1875, DW_AT_type(*$C$DW$T$39)
   14202                      .dwattr $C$DW$1875, DW_AT_name("GPADIR")
   14203                      .dwattr $C$DW$1875, DW_AT_TI_symbol_name("_GPADIR")
TMS320C2000 Assembler PC v15.12.3 Mon Sep 25 12:51:22 2017

Tools Copyright (c) 1996-2015 Texas Instruments Incorporated
C:\Users\wmj\AppData\Local\Temp\1048412                              PAGE  269

   14204                      .dwattr $C$DW$1875, DW_AT_data_member_location[DW_OP_plus_uconst 0xa]
   14205                      .dwattr $C$DW$1875, DW_AT_accessibility(DW_ACCESS_public)
   14206              
   14207              $C$DW$1876      .dwtag  DW_TAG_member
   14208                      .dwattr $C$DW$1876, DW_AT_type(*$C$DW$T$39)
   14209                      .dwattr $C$DW$1876, DW_AT_name("GPAPUD")
   14210                      .dwattr $C$DW$1876, DW_AT_TI_symbol_name("_GPAPUD")
   14211                      .dwattr $C$DW$1876, DW_AT_data_member_location[DW_OP_plus_uconst 0xc]
   14212                      .dwattr $C$DW$1876, DW_AT_accessibility(DW_ACCESS_public)
   14213              
   14214              $C$DW$1877      .dwtag  DW_TAG_member
   14215                      .dwattr $C$DW$1877, DW_AT_type(*$C$DW$T$26)
   14216                      .dwattr $C$DW$1877, DW_AT_name("rsvd_1")
   14217                      .dwattr $C$DW$1877, DW_AT_TI_symbol_name("_rsvd_1")
   14218                      .dwattr $C$DW$1877, DW_AT_data_member_location[DW_OP_plus_uconst 0xe]
   14219                      .dwattr $C$DW$1877, DW_AT_accessibility(DW_ACCESS_public)
   14220              
   14221              $C$DW$1878      .dwtag  DW_TAG_member
   14222                      .dwattr $C$DW$1878, DW_AT_type(*$C$DW$T$39)
   14223                      .dwattr $C$DW$1878, DW_AT_name("GPBCTRL")
   14224                      .dwattr $C$DW$1878, DW_AT_TI_symbol_name("_GPBCTRL")
   14225                      .dwattr $C$DW$1878, DW_AT_data_member_location[DW_OP_plus_uconst 0x10]
   14226                      .dwattr $C$DW$1878, DW_AT_accessibility(DW_ACCESS_public)
   14227              
   14228              $C$DW$1879      .dwtag  DW_TAG_member
   14229                      .dwattr $C$DW$1879, DW_AT_type(*$C$DW$T$39)
   14230                      .dwattr $C$DW$1879, DW_AT_name("GPBQSEL1")
   14231                      .dwattr $C$DW$1879, DW_AT_TI_symbol_name("_GPBQSEL1")
   14232                      .dwattr $C$DW$1879, DW_AT_data_member_location[DW_OP_plus_uconst 0x12]
   14233                      .dwattr $C$DW$1879, DW_AT_accessibility(DW_ACCESS_public)
   14234              
   14235              $C$DW$1880      .dwtag  DW_TAG_member
   14236                      .dwattr $C$DW$1880, DW_AT_type(*$C$DW$T$26)
   14237                      .dwattr $C$DW$1880, DW_AT_name("rsvd_2")
   14238                      .dwattr $C$DW$1880, DW_AT_TI_symbol_name("_rsvd_2")
   14239                      .dwattr $C$DW$1880, DW_AT_data_member_location[DW_OP_plus_uconst 0x14]
   14240                      .dwattr $C$DW$1880, DW_AT_accessibility(DW_ACCESS_public)
   14241              
   14242              $C$DW$1881      .dwtag  DW_TAG_member
   14243                      .dwattr $C$DW$1881, DW_AT_type(*$C$DW$T$39)
   14244                      .dwattr $C$DW$1881, DW_AT_name("GPBMUX1")
   14245                      .dwattr $C$DW$1881, DW_AT_TI_symbol_name("_GPBMUX1")
   14246                      .dwattr $C$DW$1881, DW_AT_data_member_location[DW_OP_plus_uconst 0x16]
   14247                      .dwattr $C$DW$1881, DW_AT_accessibility(DW_ACCESS_public)
   14248              
   14249              $C$DW$1882      .dwtag  DW_TAG_member
   14250                      .dwattr $C$DW$1882, DW_AT_type(*$C$DW$T$26)
   14251                      .dwattr $C$DW$1882, DW_AT_name("rsvd_3")
   14252                      .dwattr $C$DW$1882, DW_AT_TI_symbol_name("_rsvd_3")
   14253                      .dwattr $C$DW$1882, DW_AT_data_member_location[DW_OP_plus_uconst 0x18]
   14254                      .dwattr $C$DW$1882, DW_AT_accessibility(DW_ACCESS_public)
   14255              
   14256              $C$DW$1883      .dwtag  DW_TAG_member
   14257                      .dwattr $C$DW$1883, DW_AT_type(*$C$DW$T$39)
   14258                      .dwattr $C$DW$1883, DW_AT_name("GPBDIR")
TMS320C2000 Assembler PC v15.12.3 Mon Sep 25 12:51:22 2017

Tools Copyright (c) 1996-2015 Texas Instruments Incorporated
C:\Users\wmj\AppData\Local\Temp\1048412                              PAGE  270

   14259                      .dwattr $C$DW$1883, DW_AT_TI_symbol_name("_GPBDIR")
   14260                      .dwattr $C$DW$1883, DW_AT_data_member_location[DW_OP_plus_uconst 0x1a]
   14261                      .dwattr $C$DW$1883, DW_AT_accessibility(DW_ACCESS_public)
   14262              
   14263              $C$DW$1884      .dwtag  DW_TAG_member
   14264                      .dwattr $C$DW$1884, DW_AT_type(*$C$DW$T$39)
   14265                      .dwattr $C$DW$1884, DW_AT_name("GPBPUD")
   14266                      .dwattr $C$DW$1884, DW_AT_TI_symbol_name("_GPBPUD")
   14267                      .dwattr $C$DW$1884, DW_AT_data_member_location[DW_OP_plus_uconst 0x1c]
   14268                      .dwattr $C$DW$1884, DW_AT_accessibility(DW_ACCESS_public)
   14269              
   14270              $C$DW$1885      .dwtag  DW_TAG_member
   14271                      .dwattr $C$DW$1885, DW_AT_type(*$C$DW$T$40)
   14272                      .dwattr $C$DW$1885, DW_AT_name("rsvd_4")
   14273                      .dwattr $C$DW$1885, DW_AT_TI_symbol_name("_rsvd_4")
   14274                      .dwattr $C$DW$1885, DW_AT_data_member_location[DW_OP_plus_uconst 0x1e]
   14275                      .dwattr $C$DW$1885, DW_AT_accessibility(DW_ACCESS_public)
   14276              
   14277              $C$DW$1886      .dwtag  DW_TAG_member
   14278                      .dwattr $C$DW$1886, DW_AT_type(*$C$DW$T$39)
   14279                      .dwattr $C$DW$1886, DW_AT_name("AIOMUX1")
   14280                      .dwattr $C$DW$1886, DW_AT_TI_symbol_name("_AIOMUX1")
   14281                      .dwattr $C$DW$1886, DW_AT_data_member_location[DW_OP_plus_uconst 0x36]
   14282                      .dwattr $C$DW$1886, DW_AT_accessibility(DW_ACCESS_public)
   14283              
   14284              $C$DW$1887      .dwtag  DW_TAG_member
   14285                      .dwattr $C$DW$1887, DW_AT_type(*$C$DW$T$26)
   14286                      .dwattr $C$DW$1887, DW_AT_name("rsvd_5")
   14287                      .dwattr $C$DW$1887, DW_AT_TI_symbol_name("_rsvd_5")
   14288                      .dwattr $C$DW$1887, DW_AT_data_member_location[DW_OP_plus_uconst 0x38]
   14289                      .dwattr $C$DW$1887, DW_AT_accessibility(DW_ACCESS_public)
   14290              
   14291              $C$DW$1888      .dwtag  DW_TAG_member
   14292                      .dwattr $C$DW$1888, DW_AT_type(*$C$DW$T$39)
   14293                      .dwattr $C$DW$1888, DW_AT_name("AIODIR")
   14294                      .dwattr $C$DW$1888, DW_AT_TI_symbol_name("_AIODIR")
   14295                      .dwattr $C$DW$1888, DW_AT_data_member_location[DW_OP_plus_uconst 0x3a]
   14296                      .dwattr $C$DW$1888, DW_AT_accessibility(DW_ACCESS_public)
   14297              
   14298              $C$DW$1889      .dwtag  DW_TAG_member
   14299                      .dwattr $C$DW$1889, DW_AT_type(*$C$DW$T$41)
   14300                      .dwattr $C$DW$1889, DW_AT_name("rsvd_6")
   14301                      .dwattr $C$DW$1889, DW_AT_TI_symbol_name("_rsvd_6")
   14302                      .dwattr $C$DW$1889, DW_AT_data_member_location[DW_OP_plus_uconst 0x3c]
   14303                      .dwattr $C$DW$1889, DW_AT_accessibility(DW_ACCESS_public)
   14304              
   14305              $C$DW$1890      .dwtag  DW_TAG_member
   14306                      .dwattr $C$DW$1890, DW_AT_type(*$C$DW$T$39)
   14307                      .dwattr $C$DW$1890, DW_AT_name("GPADAT")
   14308                      .dwattr $C$DW$1890, DW_AT_TI_symbol_name("_GPADAT")
   14309                      .dwattr $C$DW$1890, DW_AT_data_member_location[DW_OP_plus_uconst 0x40]
   14310                      .dwattr $C$DW$1890, DW_AT_accessibility(DW_ACCESS_public)
   14311              
   14312              $C$DW$1891      .dwtag  DW_TAG_member
   14313                      .dwattr $C$DW$1891, DW_AT_type(*$C$DW$T$39)
TMS320C2000 Assembler PC v15.12.3 Mon Sep 25 12:51:22 2017

Tools Copyright (c) 1996-2015 Texas Instruments Incorporated
C:\Users\wmj\AppData\Local\Temp\1048412                              PAGE  271

   14314                      .dwattr $C$DW$1891, DW_AT_name("GPASET")
   14315                      .dwattr $C$DW$1891, DW_AT_TI_symbol_name("_GPASET")
   14316                      .dwattr $C$DW$1891, DW_AT_data_member_location[DW_OP_plus_uconst 0x42]
   14317                      .dwattr $C$DW$1891, DW_AT_accessibility(DW_ACCESS_public)
   14318              
   14319              $C$DW$1892      .dwtag  DW_TAG_member
   14320                      .dwattr $C$DW$1892, DW_AT_type(*$C$DW$T$39)
   14321                      .dwattr $C$DW$1892, DW_AT_name("GPACLEAR")
   14322                      .dwattr $C$DW$1892, DW_AT_TI_symbol_name("_GPACLEAR")
   14323                      .dwattr $C$DW$1892, DW_AT_data_member_location[DW_OP_plus_uconst 0x44]
   14324                      .dwattr $C$DW$1892, DW_AT_accessibility(DW_ACCESS_public)
   14325              
   14326              $C$DW$1893      .dwtag  DW_TAG_member
   14327                      .dwattr $C$DW$1893, DW_AT_type(*$C$DW$T$39)
   14328                      .dwattr $C$DW$1893, DW_AT_name("GPATOGGLE")
   14329                      .dwattr $C$DW$1893, DW_AT_TI_symbol_name("_GPATOGGLE")
   14330                      .dwattr $C$DW$1893, DW_AT_data_member_location[DW_OP_plus_uconst 0x46]
   14331                      .dwattr $C$DW$1893, DW_AT_accessibility(DW_ACCESS_public)
   14332              
   14333              $C$DW$1894      .dwtag  DW_TAG_member
   14334                      .dwattr $C$DW$1894, DW_AT_type(*$C$DW$T$39)
   14335                      .dwattr $C$DW$1894, DW_AT_name("GPBDAT")
   14336                      .dwattr $C$DW$1894, DW_AT_TI_symbol_name("_GPBDAT")
   14337                      .dwattr $C$DW$1894, DW_AT_data_member_location[DW_OP_plus_uconst 0x48]
   14338                      .dwattr $C$DW$1894, DW_AT_accessibility(DW_ACCESS_public)
   14339              
   14340              $C$DW$1895      .dwtag  DW_TAG_member
   14341                      .dwattr $C$DW$1895, DW_AT_type(*$C$DW$T$39)
   14342                      .dwattr $C$DW$1895, DW_AT_name("GPBSET")
   14343                      .dwattr $C$DW$1895, DW_AT_TI_symbol_name("_GPBSET")
   14344                      .dwattr $C$DW$1895, DW_AT_data_member_location[DW_OP_plus_uconst 0x4a]
   14345                      .dwattr $C$DW$1895, DW_AT_accessibility(DW_ACCESS_public)
   14346              
   14347              $C$DW$1896      .dwtag  DW_TAG_member
   14348                      .dwattr $C$DW$1896, DW_AT_type(*$C$DW$T$39)
   14349                      .dwattr $C$DW$1896, DW_AT_name("GPBCLEAR")
   14350                      .dwattr $C$DW$1896, DW_AT_TI_symbol_name("_GPBCLEAR")
   14351                      .dwattr $C$DW$1896, DW_AT_data_member_location[DW_OP_plus_uconst 0x4c]
   14352                      .dwattr $C$DW$1896, DW_AT_accessibility(DW_ACCESS_public)
   14353              
   14354              $C$DW$1897      .dwtag  DW_TAG_member
   14355                      .dwattr $C$DW$1897, DW_AT_type(*$C$DW$T$39)
   14356                      .dwattr $C$DW$1897, DW_AT_name("GPBTOGGLE")
   14357                      .dwattr $C$DW$1897, DW_AT_TI_symbol_name("_GPBTOGGLE")
   14358                      .dwattr $C$DW$1897, DW_AT_data_member_location[DW_OP_plus_uconst 0x4e]
   14359                      .dwattr $C$DW$1897, DW_AT_accessibility(DW_ACCESS_public)
   14360              
   14361              $C$DW$1898      .dwtag  DW_TAG_member
   14362                      .dwattr $C$DW$1898, DW_AT_type(*$C$DW$T$31)
   14363                      .dwattr $C$DW$1898, DW_AT_name("rsvd_7")
   14364                      .dwattr $C$DW$1898, DW_AT_TI_symbol_name("_rsvd_7")
   14365                      .dwattr $C$DW$1898, DW_AT_data_member_location[DW_OP_plus_uconst 0x50]
   14366                      .dwattr $C$DW$1898, DW_AT_accessibility(DW_ACCESS_public)
   14367              
   14368              $C$DW$1899      .dwtag  DW_TAG_member
TMS320C2000 Assembler PC v15.12.3 Mon Sep 25 12:51:22 2017

Tools Copyright (c) 1996-2015 Texas Instruments Incorporated
C:\Users\wmj\AppData\Local\Temp\1048412                              PAGE  272

   14369                      .dwattr $C$DW$1899, DW_AT_type(*$C$DW$T$39)
   14370                      .dwattr $C$DW$1899, DW_AT_name("AIODAT")
   14371                      .dwattr $C$DW$1899, DW_AT_TI_symbol_name("_AIODAT")
   14372                      .dwattr $C$DW$1899, DW_AT_data_member_location[DW_OP_plus_uconst 0x58]
   14373                      .dwattr $C$DW$1899, DW_AT_accessibility(DW_ACCESS_public)
   14374              
   14375              $C$DW$1900      .dwtag  DW_TAG_member
   14376                      .dwattr $C$DW$1900, DW_AT_type(*$C$DW$T$39)
   14377                      .dwattr $C$DW$1900, DW_AT_name("AIOSET")
   14378                      .dwattr $C$DW$1900, DW_AT_TI_symbol_name("_AIOSET")
   14379                      .dwattr $C$DW$1900, DW_AT_data_member_location[DW_OP_plus_uconst 0x5a]
   14380                      .dwattr $C$DW$1900, DW_AT_accessibility(DW_ACCESS_public)
   14381              
   14382              $C$DW$1901      .dwtag  DW_TAG_member
   14383                      .dwattr $C$DW$1901, DW_AT_type(*$C$DW$T$39)
   14384                      .dwattr $C$DW$1901, DW_AT_name("AIOCLEAR")
   14385                      .dwattr $C$DW$1901, DW_AT_TI_symbol_name("_AIOCLEAR")
   14386                      .dwattr $C$DW$1901, DW_AT_data_member_location[DW_OP_plus_uconst 0x5c]
   14387                      .dwattr $C$DW$1901, DW_AT_accessibility(DW_ACCESS_public)
   14388              
   14389              $C$DW$1902      .dwtag  DW_TAG_member
   14390                      .dwattr $C$DW$1902, DW_AT_type(*$C$DW$T$39)
   14391                      .dwattr $C$DW$1902, DW_AT_name("AIOTOGGLE")
   14392                      .dwattr $C$DW$1902, DW_AT_TI_symbol_name("_AIOTOGGLE")
   14393                      .dwattr $C$DW$1902, DW_AT_data_member_location[DW_OP_plus_uconst 0x5e]
   14394                      .dwattr $C$DW$1902, DW_AT_accessibility(DW_ACCESS_public)
   14395              
   14396              $C$DW$1903      .dwtag  DW_TAG_member
   14397                      .dwattr $C$DW$1903, DW_AT_type(*$C$DW$T$28)
   14398                      .dwattr $C$DW$1903, DW_AT_name("GPIOXINTnSEL")
   14399                      .dwattr $C$DW$1903, DW_AT_TI_symbol_name("_GPIOXINTnSEL")
   14400                      .dwattr $C$DW$1903, DW_AT_data_member_location[DW_OP_plus_uconst 0x60]
   14401                      .dwattr $C$DW$1903, DW_AT_accessibility(DW_ACCESS_public)
   14402              
   14403              $C$DW$1904      .dwtag  DW_TAG_member
   14404                      .dwattr $C$DW$1904, DW_AT_type(*$C$DW$T$27)
   14405                      .dwattr $C$DW$1904, DW_AT_name("rsvd_8")
   14406                      .dwattr $C$DW$1904, DW_AT_TI_symbol_name("_rsvd_8")
   14407                      .dwattr $C$DW$1904, DW_AT_data_member_location[DW_OP_plus_uconst 0x63]
   14408                      .dwattr $C$DW$1904, DW_AT_accessibility(DW_ACCESS_public)
   14409              
   14410              $C$DW$1905      .dwtag  DW_TAG_member
   14411                      .dwattr $C$DW$1905, DW_AT_type(*$C$DW$T$39)
   14412                      .dwattr $C$DW$1905, DW_AT_name("GPIOLPMSEL")
   14413                      .dwattr $C$DW$1905, DW_AT_TI_symbol_name("_GPIOLPMSEL")
   14414                      .dwattr $C$DW$1905, DW_AT_data_member_location[DW_OP_plus_uconst 0x68]
   14415                      .dwattr $C$DW$1905, DW_AT_accessibility(DW_ACCESS_public)
   14416              
   14417                      .dwendtag $C$DW$T$42
   14418              
   14419              $C$DW$T$58      .dwtag  DW_TAG_pointer_type
   14420                      .dwattr $C$DW$T$58, DW_AT_type(*$C$DW$T$42)
   14421                      .dwattr $C$DW$T$58, DW_AT_address_class(0x20)
   14422              
   14423              $C$DW$T$59      .dwtag  DW_TAG_typedef
TMS320C2000 Assembler PC v15.12.3 Mon Sep 25 12:51:22 2017

Tools Copyright (c) 1996-2015 Texas Instruments Incorporated
C:\Users\wmj\AppData\Local\Temp\1048412                              PAGE  273

   14424                      .dwattr $C$DW$T$59, DW_AT_name("GPIO_Handle")
   14425                      .dwattr $C$DW$T$59, DW_AT_type(*$C$DW$T$58)
   14426                      .dwattr $C$DW$T$59, DW_AT_language(DW_LANG_C)
   14427              
   14428              
   14429              $C$DW$T$44      .dwtag  DW_TAG_structure_type
   14430                      .dwattr $C$DW$T$44, DW_AT_name("_HAL_AdcData_t_")
   14431                      .dwattr $C$DW$T$44, DW_AT_byte_size(0x16)
   14432              $C$DW$1906      .dwtag  DW_TAG_member
   14433                      .dwattr $C$DW$1906, DW_AT_type(*$C$DW$T$43)
   14434                      .dwattr $C$DW$1906, DW_AT_name("I")
   14435                      .dwattr $C$DW$1906, DW_AT_TI_symbol_name("_I")
   14436                      .dwattr $C$DW$1906, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
   14437                      .dwattr $C$DW$1906, DW_AT_accessibility(DW_ACCESS_public)
   14438              
   14439              $C$DW$1907      .dwtag  DW_TAG_member
   14440                      .dwattr $C$DW$1907, DW_AT_type(*$C$DW$T$43)
   14441                      .dwattr $C$DW$1907, DW_AT_name("V")
   14442                      .dwattr $C$DW$1907, DW_AT_TI_symbol_name("_V")
   14443                      .dwattr $C$DW$1907, DW_AT_data_member_location[DW_OP_plus_uconst 0x6]
   14444                      .dwattr $C$DW$1907, DW_AT_accessibility(DW_ACCESS_public)
   14445              
   14446              $C$DW$1908      .dwtag  DW_TAG_member
   14447                      .dwattr $C$DW$1908, DW_AT_type(*$C$DW$T$35)
   14448                      .dwattr $C$DW$1908, DW_AT_name("dcBus")
   14449                      .dwattr $C$DW$1908, DW_AT_TI_symbol_name("_dcBus")
   14450                      .dwattr $C$DW$1908, DW_AT_data_member_location[DW_OP_plus_uconst 0xc]
   14451                      .dwattr $C$DW$1908, DW_AT_accessibility(DW_ACCESS_public)
   14452              
   14453              $C$DW$1909      .dwtag  DW_TAG_member
   14454                      .dwattr $C$DW$1909, DW_AT_type(*$C$DW$T$35)
   14455                      .dwattr $C$DW$1909, DW_AT_name("analogSensor1")
   14456                      .dwattr $C$DW$1909, DW_AT_TI_symbol_name("_analogSensor1")
   14457                      .dwattr $C$DW$1909, DW_AT_data_member_location[DW_OP_plus_uconst 0xe]
   14458                      .dwattr $C$DW$1909, DW_AT_accessibility(DW_ACCESS_public)
   14459              
   14460              $C$DW$1910      .dwtag  DW_TAG_member
   14461                      .dwattr $C$DW$1910, DW_AT_type(*$C$DW$T$35)
   14462                      .dwattr $C$DW$1910, DW_AT_name("analogSensor2")
   14463                      .dwattr $C$DW$1910, DW_AT_TI_symbol_name("_analogSensor2")
   14464                      .dwattr $C$DW$1910, DW_AT_data_member_location[DW_OP_plus_uconst 0x10]
   14465                      .dwattr $C$DW$1910, DW_AT_accessibility(DW_ACCESS_public)
   14466              
   14467              $C$DW$1911      .dwtag  DW_TAG_member
   14468                      .dwattr $C$DW$1911, DW_AT_type(*$C$DW$T$35)
   14469                      .dwattr $C$DW$1911, DW_AT_name("igbtNTC")
   14470                      .dwattr $C$DW$1911, DW_AT_TI_symbol_name("_igbtNTC")
   14471                      .dwattr $C$DW$1911, DW_AT_data_member_location[DW_OP_plus_uconst 0x12]
   14472                      .dwattr $C$DW$1911, DW_AT_accessibility(DW_ACCESS_public)
   14473              
   14474              $C$DW$1912      .dwtag  DW_TAG_member
   14475                      .dwattr $C$DW$1912, DW_AT_type(*$C$DW$T$35)
   14476                      .dwattr $C$DW$1912, DW_AT_name("boardAddr")
   14477                      .dwattr $C$DW$1912, DW_AT_TI_symbol_name("_boardAddr")
   14478                      .dwattr $C$DW$1912, DW_AT_data_member_location[DW_OP_plus_uconst 0x14]
TMS320C2000 Assembler PC v15.12.3 Mon Sep 25 12:51:22 2017

Tools Copyright (c) 1996-2015 Texas Instruments Incorporated
C:\Users\wmj\AppData\Local\Temp\1048412                              PAGE  274

   14479                      .dwattr $C$DW$1912, DW_AT_accessibility(DW_ACCESS_public)
   14480              
   14481                      .dwendtag $C$DW$T$44
   14482              
   14483              $C$DW$T$87      .dwtag  DW_TAG_typedef
   14484                      .dwattr $C$DW$T$87, DW_AT_name("HAL_AdcData_t")
   14485                      .dwattr $C$DW$T$87, DW_AT_type(*$C$DW$T$44)
   14486                      .dwattr $C$DW$T$87, DW_AT_language(DW_LANG_C)
   14487              
   14488              
   14489              $C$DW$T$49      .dwtag  DW_TAG_structure_type
   14490                      .dwattr $C$DW$T$49, DW_AT_name("_HAL_DacData_t_")
   14491                      .dwattr $C$DW$T$49, DW_AT_byte_size(0x22)
   14492              $C$DW$1913      .dwtag  DW_TAG_member
   14493                      .dwattr $C$DW$1913, DW_AT_type(*$C$DW$T$22)
   14494                      .dwattr $C$DW$1913, DW_AT_name("PeriodMax")
   14495                      .dwattr $C$DW$1913, DW_AT_TI_symbol_name("_PeriodMax")
   14496                      .dwattr $C$DW$1913, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
   14497                      .dwattr $C$DW$1913, DW_AT_accessibility(DW_ACCESS_public)
   14498              
   14499              $C$DW$1914      .dwtag  DW_TAG_member
   14500                      .dwattr $C$DW$1914, DW_AT_type(*$C$DW$T$47)
   14501                      .dwattr $C$DW$1914, DW_AT_name("ptrData")
   14502                      .dwattr $C$DW$1914, DW_AT_TI_symbol_name("_ptrData")
   14503                      .dwattr $C$DW$1914, DW_AT_data_member_location[DW_OP_plus_uconst 0x2]
   14504                      .dwattr $C$DW$1914, DW_AT_accessibility(DW_ACCESS_public)
   14505              
   14506              $C$DW$1915      .dwtag  DW_TAG_member
   14507                      .dwattr $C$DW$1915, DW_AT_type(*$C$DW$T$48)
   14508                      .dwattr $C$DW$1915, DW_AT_name("value")
   14509                      .dwattr $C$DW$1915, DW_AT_TI_symbol_name("_value")
   14510                      .dwattr $C$DW$1915, DW_AT_data_member_location[DW_OP_plus_uconst 0xa]
   14511                      .dwattr $C$DW$1915, DW_AT_accessibility(DW_ACCESS_public)
   14512              
   14513              $C$DW$1916      .dwtag  DW_TAG_member
   14514                      .dwattr $C$DW$1916, DW_AT_type(*$C$DW$T$48)
   14515                      .dwattr $C$DW$1916, DW_AT_name("offset")
   14516                      .dwattr $C$DW$1916, DW_AT_TI_symbol_name("_offset")
   14517                      .dwattr $C$DW$1916, DW_AT_data_member_location[DW_OP_plus_uconst 0x12]
   14518                      .dwattr $C$DW$1916, DW_AT_accessibility(DW_ACCESS_public)
   14519              
   14520              $C$DW$1917      .dwtag  DW_TAG_member
   14521                      .dwattr $C$DW$1917, DW_AT_type(*$C$DW$T$48)
   14522                      .dwattr $C$DW$1917, DW_AT_name("gain")
   14523                      .dwattr $C$DW$1917, DW_AT_TI_symbol_name("_gain")
   14524                      .dwattr $C$DW$1917, DW_AT_data_member_location[DW_OP_plus_uconst 0x1a]
   14525                      .dwattr $C$DW$1917, DW_AT_accessibility(DW_ACCESS_public)
   14526              
   14527                      .dwendtag $C$DW$T$49
   14528              
   14529              $C$DW$T$350     .dwtag  DW_TAG_typedef
   14530                      .dwattr $C$DW$T$350, DW_AT_name("HAL_DacData_t")
   14531                      .dwattr $C$DW$T$350, DW_AT_type(*$C$DW$T$49)
   14532                      .dwattr $C$DW$T$350, DW_AT_language(DW_LANG_C)
   14533              
TMS320C2000 Assembler PC v15.12.3 Mon Sep 25 12:51:22 2017

Tools Copyright (c) 1996-2015 Texas Instruments Incorporated
C:\Users\wmj\AppData\Local\Temp\1048412                              PAGE  275

   14534              $C$DW$T$351     .dwtag  DW_TAG_pointer_type
   14535                      .dwattr $C$DW$T$351, DW_AT_type(*$C$DW$T$350)
   14536                      .dwattr $C$DW$T$351, DW_AT_address_class(0x20)
   14537              
   14538              $C$DW$1918      .dwtag  DW_TAG_TI_far_type
   14539                      .dwattr $C$DW$1918, DW_AT_type(*$C$DW$T$351)
   14540              
   14541              $C$DW$T$352     .dwtag  DW_TAG_const_type
   14542                      .dwattr $C$DW$T$352, DW_AT_type(*$C$DW$1918)
   14543              
   14544              
   14545              $C$DW$T$90      .dwtag  DW_TAG_structure_type
   14546                      .dwattr $C$DW$T$90, DW_AT_name("_HAL_Obj_")
   14547                      .dwattr $C$DW$T$90, DW_AT_byte_size(0xb6)
   14548              $C$DW$1919      .dwtag  DW_TAG_member
   14549                      .dwattr $C$DW$1919, DW_AT_type(*$C$DW$T$51)
   14550                      .dwattr $C$DW$1919, DW_AT_name("adcHandle")
   14551                      .dwattr $C$DW$1919, DW_AT_TI_symbol_name("_adcHandle")
   14552                      .dwattr $C$DW$1919, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
   14553                      .dwattr $C$DW$1919, DW_AT_accessibility(DW_ACCESS_public)
   14554              
   14555              $C$DW$1920      .dwtag  DW_TAG_member
   14556                      .dwattr $C$DW$1920, DW_AT_type(*$C$DW$T$53)
   14557                      .dwattr $C$DW$1920, DW_AT_name("clkHandle")
   14558                      .dwattr $C$DW$1920, DW_AT_TI_symbol_name("_clkHandle")
   14559                      .dwattr $C$DW$1920, DW_AT_data_member_location[DW_OP_plus_uconst 0x2]
   14560                      .dwattr $C$DW$1920, DW_AT_accessibility(DW_ACCESS_public)
   14561              
   14562              $C$DW$1921      .dwtag  DW_TAG_member
   14563                      .dwattr $C$DW$1921, DW_AT_type(*$C$DW$T$55)
   14564                      .dwattr $C$DW$1921, DW_AT_name("cpuHandle")
   14565                      .dwattr $C$DW$1921, DW_AT_TI_symbol_name("_cpuHandle")
   14566                      .dwattr $C$DW$1921, DW_AT_data_member_location[DW_OP_plus_uconst 0x4]
   14567                      .dwattr $C$DW$1921, DW_AT_accessibility(DW_ACCESS_public)
   14568              
   14569              $C$DW$1922      .dwtag  DW_TAG_member
   14570                      .dwattr $C$DW$1922, DW_AT_type(*$C$DW$T$57)
   14571                      .dwattr $C$DW$1922, DW_AT_name("flashHandle")
   14572                      .dwattr $C$DW$1922, DW_AT_TI_symbol_name("_flashHandle")
   14573                      .dwattr $C$DW$1922, DW_AT_data_member_location[DW_OP_plus_uconst 0x6]
   14574                      .dwattr $C$DW$1922, DW_AT_accessibility(DW_ACCESS_public)
   14575              
   14576              $C$DW$1923      .dwtag  DW_TAG_member
   14577                      .dwattr $C$DW$1923, DW_AT_type(*$C$DW$T$59)
   14578                      .dwattr $C$DW$1923, DW_AT_name("gpioHandle")
   14579                      .dwattr $C$DW$1923, DW_AT_TI_symbol_name("_gpioHandle")
   14580                      .dwattr $C$DW$1923, DW_AT_data_member_location[DW_OP_plus_uconst 0x8]
   14581                      .dwattr $C$DW$1923, DW_AT_accessibility(DW_ACCESS_public)
   14582              
   14583              $C$DW$1924      .dwtag  DW_TAG_member
   14584                      .dwattr $C$DW$1924, DW_AT_type(*$C$DW$T$62)
   14585                      .dwattr $C$DW$1924, DW_AT_name("offsetHandle_I")
   14586                      .dwattr $C$DW$1924, DW_AT_TI_symbol_name("_offsetHandle_I")
   14587                      .dwattr $C$DW$1924, DW_AT_data_member_location[DW_OP_plus_uconst 0xa]
   14588                      .dwattr $C$DW$1924, DW_AT_accessibility(DW_ACCESS_public)
TMS320C2000 Assembler PC v15.12.3 Mon Sep 25 12:51:22 2017

Tools Copyright (c) 1996-2015 Texas Instruments Incorporated
C:\Users\wmj\AppData\Local\Temp\1048412                              PAGE  276

   14589              
   14590              $C$DW$1925      .dwtag  DW_TAG_member
   14591                      .dwattr $C$DW$1925, DW_AT_type(*$C$DW$T$64)
   14592                      .dwattr $C$DW$1925, DW_AT_name("offset_I")
   14593                      .dwattr $C$DW$1925, DW_AT_TI_symbol_name("_offset_I")
   14594                      .dwattr $C$DW$1925, DW_AT_data_member_location[DW_OP_plus_uconst 0x10]
   14595                      .dwattr $C$DW$1925, DW_AT_accessibility(DW_ACCESS_public)
   14596              
   14597              $C$DW$1926      .dwtag  DW_TAG_member
   14598                      .dwattr $C$DW$1926, DW_AT_type(*$C$DW$T$62)
   14599                      .dwattr $C$DW$1926, DW_AT_name("offsetHandle_V")
   14600                      .dwattr $C$DW$1926, DW_AT_TI_symbol_name("_offsetHandle_V")
   14601                      .dwattr $C$DW$1926, DW_AT_data_member_location[DW_OP_plus_uconst 0x40]
   14602                      .dwattr $C$DW$1926, DW_AT_accessibility(DW_ACCESS_public)
   14603              
   14604              $C$DW$1927      .dwtag  DW_TAG_member
   14605                      .dwattr $C$DW$1927, DW_AT_type(*$C$DW$T$64)
   14606                      .dwattr $C$DW$1927, DW_AT_name("offset_V")
   14607                      .dwattr $C$DW$1927, DW_AT_TI_symbol_name("_offset_V")
   14608                      .dwattr $C$DW$1927, DW_AT_data_member_location[DW_OP_plus_uconst 0x46]
   14609                      .dwattr $C$DW$1927, DW_AT_accessibility(DW_ACCESS_public)
   14610              
   14611              $C$DW$1928      .dwtag  DW_TAG_member
   14612                      .dwattr $C$DW$1928, DW_AT_type(*$C$DW$T$66)
   14613                      .dwattr $C$DW$1928, DW_AT_name("oscHandle")
   14614                      .dwattr $C$DW$1928, DW_AT_TI_symbol_name("_oscHandle")
   14615                      .dwattr $C$DW$1928, DW_AT_data_member_location[DW_OP_plus_uconst 0x76]
   14616                      .dwattr $C$DW$1928, DW_AT_accessibility(DW_ACCESS_public)
   14617              
   14618              $C$DW$1929      .dwtag  DW_TAG_member
   14619                      .dwattr $C$DW$1929, DW_AT_type(*$C$DW$T$68)
   14620                      .dwattr $C$DW$1929, DW_AT_name("pieHandle")
   14621                      .dwattr $C$DW$1929, DW_AT_TI_symbol_name("_pieHandle")
   14622                      .dwattr $C$DW$1929, DW_AT_data_member_location[DW_OP_plus_uconst 0x78]
   14623                      .dwattr $C$DW$1929, DW_AT_accessibility(DW_ACCESS_public)
   14624              
   14625              $C$DW$1930      .dwtag  DW_TAG_member
   14626                      .dwattr $C$DW$1930, DW_AT_type(*$C$DW$T$70)
   14627                      .dwattr $C$DW$1930, DW_AT_name("pllHandle")
   14628                      .dwattr $C$DW$1930, DW_AT_TI_symbol_name("_pllHandle")
   14629                      .dwattr $C$DW$1930, DW_AT_data_member_location[DW_OP_plus_uconst 0x7a]
   14630                      .dwattr $C$DW$1930, DW_AT_accessibility(DW_ACCESS_public)
   14631              
   14632              $C$DW$1931      .dwtag  DW_TAG_member
   14633                      .dwattr $C$DW$1931, DW_AT_type(*$C$DW$T$73)
   14634                      .dwattr $C$DW$1931, DW_AT_name("pwmHandle")
   14635                      .dwattr $C$DW$1931, DW_AT_TI_symbol_name("_pwmHandle")
   14636                      .dwattr $C$DW$1931, DW_AT_data_member_location[DW_OP_plus_uconst 0x7c]
   14637                      .dwattr $C$DW$1931, DW_AT_accessibility(DW_ACCESS_public)
   14638              
   14639              $C$DW$1932      .dwtag  DW_TAG_member
   14640                      .dwattr $C$DW$1932, DW_AT_type(*$C$DW$T$73)
   14641                      .dwattr $C$DW$1932, DW_AT_name("pwmDacHandle")
   14642                      .dwattr $C$DW$1932, DW_AT_TI_symbol_name("_pwmDacHandle")
   14643                      .dwattr $C$DW$1932, DW_AT_data_member_location[DW_OP_plus_uconst 0x82]
TMS320C2000 Assembler PC v15.12.3 Mon Sep 25 12:51:22 2017

Tools Copyright (c) 1996-2015 Texas Instruments Incorporated
C:\Users\wmj\AppData\Local\Temp\1048412                              PAGE  277

   14644                      .dwattr $C$DW$1932, DW_AT_accessibility(DW_ACCESS_public)
   14645              
   14646              $C$DW$1933      .dwtag  DW_TAG_member
   14647                      .dwattr $C$DW$1933, DW_AT_type(*$C$DW$T$75)
   14648                      .dwattr $C$DW$1933, DW_AT_name("pwrHandle")
   14649                      .dwattr $C$DW$1933, DW_AT_TI_symbol_name("_pwrHandle")
   14650                      .dwattr $C$DW$1933, DW_AT_data_member_location[DW_OP_plus_uconst 0x88]
   14651                      .dwattr $C$DW$1933, DW_AT_accessibility(DW_ACCESS_public)
   14652              
   14653              $C$DW$1934      .dwtag  DW_TAG_member
   14654                      .dwattr $C$DW$1934, DW_AT_type(*$C$DW$T$78)
   14655                      .dwattr $C$DW$1934, DW_AT_name("timerHandle")
   14656                      .dwattr $C$DW$1934, DW_AT_TI_symbol_name("_timerHandle")
   14657                      .dwattr $C$DW$1934, DW_AT_data_member_location[DW_OP_plus_uconst 0x8a]
   14658                      .dwattr $C$DW$1934, DW_AT_accessibility(DW_ACCESS_public)
   14659              
   14660              $C$DW$1935      .dwtag  DW_TAG_member
   14661                      .dwattr $C$DW$1935, DW_AT_type(*$C$DW$T$80)
   14662                      .dwattr $C$DW$1935, DW_AT_name("i2cHandle")
   14663                      .dwattr $C$DW$1935, DW_AT_TI_symbol_name("_i2cHandle")
   14664                      .dwattr $C$DW$1935, DW_AT_data_member_location[DW_OP_plus_uconst 0x90]
   14665                      .dwattr $C$DW$1935, DW_AT_accessibility(DW_ACCESS_public)
   14666              
   14667              $C$DW$1936      .dwtag  DW_TAG_member
   14668                      .dwattr $C$DW$1936, DW_AT_type(*$C$DW$T$82)
   14669                      .dwattr $C$DW$1936, DW_AT_name("spiAHandle")
   14670                      .dwattr $C$DW$1936, DW_AT_TI_symbol_name("_spiAHandle")
   14671                      .dwattr $C$DW$1936, DW_AT_data_member_location[DW_OP_plus_uconst 0x92]
   14672                      .dwattr $C$DW$1936, DW_AT_accessibility(DW_ACCESS_public)
   14673              
   14674              $C$DW$1937      .dwtag  DW_TAG_member
   14675                      .dwattr $C$DW$1937, DW_AT_type(*$C$DW$T$84)
   14676                      .dwattr $C$DW$1937, DW_AT_name("wdogHandle")
   14677                      .dwattr $C$DW$1937, DW_AT_TI_symbol_name("_wdogHandle")
   14678                      .dwattr $C$DW$1937, DW_AT_data_member_location[DW_OP_plus_uconst 0x94]
   14679                      .dwattr $C$DW$1937, DW_AT_accessibility(DW_ACCESS_public)
   14680              
   14681              $C$DW$1938      .dwtag  DW_TAG_member
   14682                      .dwattr $C$DW$1938, DW_AT_type(*$C$DW$T$86)
   14683                      .dwattr $C$DW$1938, DW_AT_name("sciHandle")
   14684                      .dwattr $C$DW$1938, DW_AT_TI_symbol_name("_sciHandle")
   14685                      .dwattr $C$DW$1938, DW_AT_data_member_location[DW_OP_plus_uconst 0x96]
   14686                      .dwattr $C$DW$1938, DW_AT_accessibility(DW_ACCESS_public)
   14687              
   14688              $C$DW$1939      .dwtag  DW_TAG_member
   14689                      .dwattr $C$DW$1939, DW_AT_type(*$C$DW$T$87)
   14690                      .dwattr $C$DW$1939, DW_AT_name("adcBias")
   14691                      .dwattr $C$DW$1939, DW_AT_TI_symbol_name("_adcBias")
   14692                      .dwattr $C$DW$1939, DW_AT_data_member_location[DW_OP_plus_uconst 0x98]
   14693                      .dwattr $C$DW$1939, DW_AT_accessibility(DW_ACCESS_public)
   14694              
   14695              $C$DW$1940      .dwtag  DW_TAG_member
   14696                      .dwattr $C$DW$1940, DW_AT_type(*$C$DW$T$35)
   14697                      .dwattr $C$DW$1940, DW_AT_name("current_sf")
   14698                      .dwattr $C$DW$1940, DW_AT_TI_symbol_name("_current_sf")
TMS320C2000 Assembler PC v15.12.3 Mon Sep 25 12:51:22 2017

Tools Copyright (c) 1996-2015 Texas Instruments Incorporated
C:\Users\wmj\AppData\Local\Temp\1048412                              PAGE  278

   14699                      .dwattr $C$DW$1940, DW_AT_data_member_location[DW_OP_plus_uconst 0xae]
   14700                      .dwattr $C$DW$1940, DW_AT_accessibility(DW_ACCESS_public)
   14701              
   14702              $C$DW$1941      .dwtag  DW_TAG_member
   14703                      .dwattr $C$DW$1941, DW_AT_type(*$C$DW$T$35)
   14704                      .dwattr $C$DW$1941, DW_AT_name("voltage_sf")
   14705                      .dwattr $C$DW$1941, DW_AT_TI_symbol_name("_voltage_sf")
   14706                      .dwattr $C$DW$1941, DW_AT_data_member_location[DW_OP_plus_uconst 0xb0]
   14707                      .dwattr $C$DW$1941, DW_AT_accessibility(DW_ACCESS_public)
   14708              
   14709              $C$DW$1942      .dwtag  DW_TAG_member
   14710                      .dwattr $C$DW$1942, DW_AT_type(*$C$DW$T$33)
   14711                      .dwattr $C$DW$1942, DW_AT_name("numCurrentSensors")
   14712                      .dwattr $C$DW$1942, DW_AT_TI_symbol_name("_numCurrentSensors")
   14713                      .dwattr $C$DW$1942, DW_AT_data_member_location[DW_OP_plus_uconst 0xb2]
   14714                      .dwattr $C$DW$1942, DW_AT_accessibility(DW_ACCESS_public)
   14715              
   14716              $C$DW$1943      .dwtag  DW_TAG_member
   14717                      .dwattr $C$DW$1943, DW_AT_type(*$C$DW$T$33)
   14718                      .dwattr $C$DW$1943, DW_AT_name("numVoltageSensors")
   14719                      .dwattr $C$DW$1943, DW_AT_TI_symbol_name("_numVoltageSensors")
   14720                      .dwattr $C$DW$1943, DW_AT_data_member_location[DW_OP_plus_uconst 0xb3]
   14721                      .dwattr $C$DW$1943, DW_AT_accessibility(DW_ACCESS_public)
   14722              
   14723              $C$DW$1944      .dwtag  DW_TAG_member
   14724                      .dwattr $C$DW$1944, DW_AT_type(*$C$DW$T$89)
   14725                      .dwattr $C$DW$1944, DW_AT_name("boardAddress")
   14726                      .dwattr $C$DW$1944, DW_AT_TI_symbol_name("_boardAddress")
   14727                      .dwattr $C$DW$1944, DW_AT_data_member_location[DW_OP_plus_uconst 0xb4]
   14728                      .dwattr $C$DW$1944, DW_AT_accessibility(DW_ACCESS_public)
   14729              
   14730                      .dwendtag $C$DW$T$90
   14731              
   14732              $C$DW$T$355     .dwtag  DW_TAG_typedef
   14733                      .dwattr $C$DW$T$355, DW_AT_name("HAL_Obj")
   14734                      .dwattr $C$DW$T$355, DW_AT_type(*$C$DW$T$90)
   14735                      .dwattr $C$DW$T$355, DW_AT_language(DW_LANG_C)
   14736              
   14737              $C$DW$T$356     .dwtag  DW_TAG_pointer_type
   14738                      .dwattr $C$DW$T$356, DW_AT_type(*$C$DW$T$355)
   14739                      .dwattr $C$DW$T$356, DW_AT_address_class(0x20)
   14740              
   14741              $C$DW$T$357     .dwtag  DW_TAG_pointer_type
   14742                      .dwattr $C$DW$T$357, DW_AT_type(*$C$DW$T$90)
   14743                      .dwattr $C$DW$T$357, DW_AT_address_class(0x20)
   14744              
   14745              $C$DW$T$358     .dwtag  DW_TAG_typedef
   14746                      .dwattr $C$DW$T$358, DW_AT_name("HAL_Handle")
   14747                      .dwattr $C$DW$T$358, DW_AT_type(*$C$DW$T$357)
   14748                      .dwattr $C$DW$T$358, DW_AT_language(DW_LANG_C)
   14749              
   14750              $C$DW$1945      .dwtag  DW_TAG_TI_far_type
   14751                      .dwattr $C$DW$1945, DW_AT_type(*$C$DW$T$358)
   14752              
   14753              $C$DW$T$359     .dwtag  DW_TAG_const_type
TMS320C2000 Assembler PC v15.12.3 Mon Sep 25 12:51:22 2017

Tools Copyright (c) 1996-2015 Texas Instruments Incorporated
C:\Users\wmj\AppData\Local\Temp\1048412                              PAGE  279

   14754                      .dwattr $C$DW$T$359, DW_AT_type(*$C$DW$1945)
   14755              
   14756              
   14757              $C$DW$T$92      .dwtag  DW_TAG_structure_type
   14758                      .dwattr $C$DW$T$92, DW_AT_name("_MATH_vec3_")
   14759                      .dwattr $C$DW$T$92, DW_AT_byte_size(0x06)
   14760              $C$DW$1946      .dwtag  DW_TAG_member
   14761                      .dwattr $C$DW$1946, DW_AT_type(*$C$DW$T$91)
   14762                      .dwattr $C$DW$1946, DW_AT_name("value")
   14763                      .dwattr $C$DW$1946, DW_AT_TI_symbol_name("_value")
   14764                      .dwattr $C$DW$1946, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
   14765                      .dwattr $C$DW$1946, DW_AT_accessibility(DW_ACCESS_public)
   14766              
   14767                      .dwendtag $C$DW$T$92
   14768              
   14769              $C$DW$T$43      .dwtag  DW_TAG_typedef
   14770                      .dwattr $C$DW$T$43, DW_AT_name("MATH_vec3")
   14771                      .dwattr $C$DW$T$43, DW_AT_type(*$C$DW$T$92)
   14772                      .dwattr $C$DW$T$43, DW_AT_language(DW_LANG_C)
   14773              
   14774              
   14775              $C$DW$T$96      .dwtag  DW_TAG_structure_type
   14776                      .dwattr $C$DW$T$96, DW_AT_name("_OFFSET_")
   14777                      .dwattr $C$DW$T$96, DW_AT_byte_size(0x10)
   14778              $C$DW$1947      .dwtag  DW_TAG_member
   14779                      .dwattr $C$DW$1947, DW_AT_type(*$C$DW$T$35)
   14780                      .dwattr $C$DW$1947, DW_AT_name("value")
   14781                      .dwattr $C$DW$1947, DW_AT_TI_symbol_name("_value")
   14782                      .dwattr $C$DW$1947, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
   14783                      .dwattr $C$DW$1947, DW_AT_accessibility(DW_ACCESS_public)
   14784              
   14785              $C$DW$1948      .dwtag  DW_TAG_member
   14786                      .dwattr $C$DW$1948, DW_AT_type(*$C$DW$T$35)
   14787                      .dwattr $C$DW$1948, DW_AT_name("bias")
   14788                      .dwattr $C$DW$1948, DW_AT_TI_symbol_name("_bias")
   14789                      .dwattr $C$DW$1948, DW_AT_data_member_location[DW_OP_plus_uconst 0x2]
   14790                      .dwattr $C$DW$1948, DW_AT_accessibility(DW_ACCESS_public)
   14791              
   14792              $C$DW$1949      .dwtag  DW_TAG_member
   14793                      .dwattr $C$DW$1949, DW_AT_type(*$C$DW$T$93)
   14794                      .dwattr $C$DW$1949, DW_AT_name("filter")
   14795                      .dwattr $C$DW$1949, DW_AT_TI_symbol_name("_filter")
   14796                      .dwattr $C$DW$1949, DW_AT_data_member_location[DW_OP_plus_uconst 0x4]
   14797                      .dwattr $C$DW$1949, DW_AT_accessibility(DW_ACCESS_public)
   14798              
   14799              $C$DW$1950      .dwtag  DW_TAG_member
   14800                      .dwattr $C$DW$1950, DW_AT_type(*$C$DW$T$95)
   14801                      .dwattr $C$DW$1950, DW_AT_name("filterHandle")
   14802                      .dwattr $C$DW$1950, DW_AT_TI_symbol_name("_filterHandle")
   14803                      .dwattr $C$DW$1950, DW_AT_data_member_location[DW_OP_plus_uconst 0xe]
   14804                      .dwattr $C$DW$1950, DW_AT_accessibility(DW_ACCESS_public)
   14805              
   14806                      .dwendtag $C$DW$T$96
   14807              
   14808              $C$DW$T$63      .dwtag  DW_TAG_typedef
TMS320C2000 Assembler PC v15.12.3 Mon Sep 25 12:51:22 2017

Tools Copyright (c) 1996-2015 Texas Instruments Incorporated
C:\Users\wmj\AppData\Local\Temp\1048412                              PAGE  280

   14809                      .dwattr $C$DW$T$63, DW_AT_name("OFFSET_Obj")
   14810                      .dwattr $C$DW$T$63, DW_AT_type(*$C$DW$T$96)
   14811                      .dwattr $C$DW$T$63, DW_AT_language(DW_LANG_C)
   14812              
   14813              
   14814              $C$DW$T$64      .dwtag  DW_TAG_array_type
   14815                      .dwattr $C$DW$T$64, DW_AT_type(*$C$DW$T$63)
   14816                      .dwattr $C$DW$T$64, DW_AT_language(DW_LANG_C)
   14817                      .dwattr $C$DW$T$64, DW_AT_byte_size(0x30)
   14818              $C$DW$1951      .dwtag  DW_TAG_subrange_type
   14819                      .dwattr $C$DW$1951, DW_AT_upper_bound(0x02)
   14820              
   14821                      .dwendtag $C$DW$T$64
   14822              
   14823              
   14824              $C$DW$T$21      .dwtag  DW_TAG_structure_type
   14825                      .dwattr $C$DW$T$21, DW_AT_name("_OFFSET_Obj_")
   14826                      .dwattr $C$DW$T$21, DW_AT_declaration
   14827                      .dwendtag $C$DW$T$21
   14828              
   14829              $C$DW$T$60      .dwtag  DW_TAG_pointer_type
   14830                      .dwattr $C$DW$T$60, DW_AT_type(*$C$DW$T$21)
   14831                      .dwattr $C$DW$T$60, DW_AT_address_class(0x20)
   14832              
   14833              $C$DW$T$61      .dwtag  DW_TAG_typedef
   14834                      .dwattr $C$DW$T$61, DW_AT_name("OFFSET_Handle")
   14835                      .dwattr $C$DW$T$61, DW_AT_type(*$C$DW$T$60)
   14836                      .dwattr $C$DW$T$61, DW_AT_language(DW_LANG_C)
   14837              
   14838              
   14839              $C$DW$T$62      .dwtag  DW_TAG_array_type
   14840                      .dwattr $C$DW$T$62, DW_AT_type(*$C$DW$T$61)
   14841                      .dwattr $C$DW$T$62, DW_AT_language(DW_LANG_C)
   14842                      .dwattr $C$DW$T$62, DW_AT_byte_size(0x06)
   14843              $C$DW$1952      .dwtag  DW_TAG_subrange_type
   14844                      .dwattr $C$DW$1952, DW_AT_upper_bound(0x02)
   14845              
   14846                      .dwendtag $C$DW$T$62
   14847              
   14848              
   14849              $C$DW$T$97      .dwtag  DW_TAG_structure_type
   14850                      .dwattr $C$DW$T$97, DW_AT_name("_OSC_Obj_")
   14851                      .dwattr $C$DW$T$97, DW_AT_byte_size(0x03)
   14852              $C$DW$1953      .dwtag  DW_TAG_member
   14853                      .dwattr $C$DW$1953, DW_AT_type(*$C$DW$T$23)
   14854                      .dwattr $C$DW$1953, DW_AT_name("INTOSC1TRIM")
   14855                      .dwattr $C$DW$1953, DW_AT_TI_symbol_name("_INTOSC1TRIM")
   14856                      .dwattr $C$DW$1953, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
   14857                      .dwattr $C$DW$1953, DW_AT_accessibility(DW_ACCESS_public)
   14858              
   14859              $C$DW$1954      .dwtag  DW_TAG_member
   14860                      .dwattr $C$DW$1954, DW_AT_type(*$C$DW$T$23)
   14861                      .dwattr $C$DW$1954, DW_AT_name("rsvd_1")
   14862                      .dwattr $C$DW$1954, DW_AT_TI_symbol_name("_rsvd_1")
   14863                      .dwattr $C$DW$1954, DW_AT_data_member_location[DW_OP_plus_uconst 0x1]
TMS320C2000 Assembler PC v15.12.3 Mon Sep 25 12:51:22 2017

Tools Copyright (c) 1996-2015 Texas Instruments Incorporated
C:\Users\wmj\AppData\Local\Temp\1048412                              PAGE  281

   14864                      .dwattr $C$DW$1954, DW_AT_accessibility(DW_ACCESS_public)
   14865              
   14866              $C$DW$1955      .dwtag  DW_TAG_member
   14867                      .dwattr $C$DW$1955, DW_AT_type(*$C$DW$T$23)
   14868                      .dwattr $C$DW$1955, DW_AT_name("INTOSC2TRIM")
   14869                      .dwattr $C$DW$1955, DW_AT_TI_symbol_name("_INTOSC2TRIM")
   14870                      .dwattr $C$DW$1955, DW_AT_data_member_location[DW_OP_plus_uconst 0x2]
   14871                      .dwattr $C$DW$1955, DW_AT_accessibility(DW_ACCESS_public)
   14872              
   14873                      .dwendtag $C$DW$T$97
   14874              
   14875              $C$DW$T$65      .dwtag  DW_TAG_pointer_type
   14876                      .dwattr $C$DW$T$65, DW_AT_type(*$C$DW$T$97)
   14877                      .dwattr $C$DW$T$65, DW_AT_address_class(0x20)
   14878              
   14879              $C$DW$T$66      .dwtag  DW_TAG_typedef
   14880                      .dwattr $C$DW$T$66, DW_AT_name("OSC_Handle")
   14881                      .dwattr $C$DW$T$66, DW_AT_type(*$C$DW$T$65)
   14882                      .dwattr $C$DW$T$66, DW_AT_language(DW_LANG_C)
   14883              
   14884              
   14885              $C$DW$T$98      .dwtag  DW_TAG_structure_type
   14886                      .dwattr $C$DW$T$98, DW_AT_name("_PIE_IERIFR_t")
   14887                      .dwattr $C$DW$T$98, DW_AT_byte_size(0x02)
   14888              $C$DW$1956      .dwtag  DW_TAG_member
   14889                      .dwattr $C$DW$1956, DW_AT_type(*$C$DW$T$23)
   14890                      .dwattr $C$DW$1956, DW_AT_name("IER")
   14891                      .dwattr $C$DW$1956, DW_AT_TI_symbol_name("_IER")
   14892                      .dwattr $C$DW$1956, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
   14893                      .dwattr $C$DW$1956, DW_AT_accessibility(DW_ACCESS_public)
   14894              
   14895              $C$DW$1957      .dwtag  DW_TAG_member
   14896                      .dwattr $C$DW$1957, DW_AT_type(*$C$DW$T$23)
   14897                      .dwattr $C$DW$1957, DW_AT_name("IFR")
   14898                      .dwattr $C$DW$1957, DW_AT_TI_symbol_name("_IFR")
   14899                      .dwattr $C$DW$1957, DW_AT_data_member_location[DW_OP_plus_uconst 0x1]
   14900                      .dwattr $C$DW$1957, DW_AT_accessibility(DW_ACCESS_public)
   14901              
   14902                      .dwendtag $C$DW$T$98
   14903              
   14904              $C$DW$T$99      .dwtag  DW_TAG_typedef
   14905                      .dwattr $C$DW$T$99, DW_AT_name("PIE_IERIFR_t")
   14906                      .dwattr $C$DW$T$99, DW_AT_type(*$C$DW$T$98)
   14907                      .dwattr $C$DW$T$99, DW_AT_language(DW_LANG_C)
   14908              
   14909              $C$DW$1958      .dwtag  DW_TAG_TI_far_type
   14910                      .dwattr $C$DW$1958, DW_AT_type(*$C$DW$T$99)
   14911              
   14912              $C$DW$T$100     .dwtag  DW_TAG_volatile_type
   14913                      .dwattr $C$DW$T$100, DW_AT_type(*$C$DW$1958)
   14914              
   14915              
   14916              $C$DW$T$101     .dwtag  DW_TAG_array_type
   14917                      .dwattr $C$DW$T$101, DW_AT_type(*$C$DW$T$100)
   14918                      .dwattr $C$DW$T$101, DW_AT_language(DW_LANG_C)
TMS320C2000 Assembler PC v15.12.3 Mon Sep 25 12:51:22 2017

Tools Copyright (c) 1996-2015 Texas Instruments Incorporated
C:\Users\wmj\AppData\Local\Temp\1048412                              PAGE  282

   14919                      .dwattr $C$DW$T$101, DW_AT_byte_size(0x18)
   14920              $C$DW$1959      .dwtag  DW_TAG_subrange_type
   14921                      .dwattr $C$DW$1959, DW_AT_upper_bound(0x0b)
   14922              
   14923                      .dwendtag $C$DW$T$101
   14924              
   14925              
   14926              $C$DW$T$108     .dwtag  DW_TAG_structure_type
   14927                      .dwattr $C$DW$T$108, DW_AT_name("_PIE_Obj_")
   14928                      .dwattr $C$DW$T$108, DW_AT_byte_size(0x639c)
   14929              $C$DW$1960      .dwtag  DW_TAG_member
   14930                      .dwattr $C$DW$1960, DW_AT_type(*$C$DW$T$23)
   14931                      .dwattr $C$DW$1960, DW_AT_name("PIECTRL")
   14932                      .dwattr $C$DW$1960, DW_AT_TI_symbol_name("_PIECTRL")
   14933                      .dwattr $C$DW$1960, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
   14934                      .dwattr $C$DW$1960, DW_AT_accessibility(DW_ACCESS_public)
   14935              
   14936              $C$DW$1961      .dwtag  DW_TAG_member
   14937                      .dwattr $C$DW$1961, DW_AT_type(*$C$DW$T$23)
   14938                      .dwattr $C$DW$1961, DW_AT_name("PIEACK")
   14939                      .dwattr $C$DW$1961, DW_AT_TI_symbol_name("_PIEACK")
   14940                      .dwattr $C$DW$1961, DW_AT_data_member_location[DW_OP_plus_uconst 0x1]
   14941                      .dwattr $C$DW$1961, DW_AT_accessibility(DW_ACCESS_public)
   14942              
   14943              $C$DW$1962      .dwtag  DW_TAG_member
   14944                      .dwattr $C$DW$1962, DW_AT_type(*$C$DW$T$101)
   14945                      .dwattr $C$DW$1962, DW_AT_name("PIEIER_PIEIFR")
   14946                      .dwattr $C$DW$1962, DW_AT_TI_symbol_name("_PIEIER_PIEIFR")
   14947                      .dwattr $C$DW$1962, DW_AT_data_member_location[DW_OP_plus_uconst 0x2]
