TMS320C2000 Assembler PC v15.12.3 Tue Sep 12 21:32:38 2017

Tools Copyright (c) 1996-2015 Texas Instruments Incorporated
C:\Users\wmj\AppData\Local\Temp\2327210                              PAGE    1

       1              ;***************************************************************
       2              ;* TMS320C2000 C/C++ Codegen                   PC v15.12.3.LTS *
       3              ;* Date/Time created: Tue Sep 12 21:32:37 2017                 *
       4              ;***************************************************************
       5                      .compiler_opts --abi=coffabi --float_support=softlib --hll_source=on --mem_model:code=flat --mem_mode
       6        0002  FP      .set    XAR2
       7              
       8              $C$DW$CU        .dwtag  DW_TAG_compile_unit
       9                      .dwattr $C$DW$CU, DW_AT_name("D:/BM1000/sw/modules/user/src/32b/user.c")
      10                      .dwattr $C$DW$CU, DW_AT_producer("TI TMS320C2000 C/C++ Codegen PC v15.12.3.LTS Copyright (c) 1996-201
      11                      .dwattr $C$DW$CU, DW_AT_TI_version(0x01)
      12                      .dwattr $C$DW$CU, DW_AT_comp_dir("D:\BM1000\sw\solutions\instaspin_foc\boards\hvkit_rev1p1\f28x\f2802
      13              
      14              $C$DW$1 .dwtag  DW_TAG_subprogram
      15                      .dwattr $C$DW$1, DW_AT_name("CTRL_setGains")

    3341              $C$DW$332       .dwtag  DW_TAG_enumerator
    3342                      .dwattr $C$DW$332, DW_AT_name("USER_ErrorCode_estFreq_Hz_High")
    3343                      .dwattr $C$DW$332, DW_AT_const_value(0x60)
    3344              
    3345              $C$DW$333       .dwtag  DW_TAG_enumerator
    3346                      .dwattr $C$DW$333, DW_AT_name("USER_ErrorCode_estFreq_Hz_Low")
    3347                      .dwattr $C$DW$333, DW_AT_const_value(0x61)
    3348              
    3349              $C$DW$334       .dwtag  DW_TAG_enumerator
    3350                      .dwattr $C$DW$334, DW_AT_name("USER_ErrorCode_RoverL_estFreq_Hz_High")
    3351                      .dwattr $C$DW$334, DW_AT_const_value(0x62)
    3352              
    3353              $C$DW$335       .dwtag  DW_TAG_enumerator
    3354                      .dwattr $C$DW$335, DW_AT_name("USER_ErrorCode_RoverL_estFreq_Hz_Low")
    3355                      .dwattr $C$DW$335, DW_AT_const_value(0x63)
    3356              
    3357              $C$DW$336       .dwtag  DW_TAG_enumerator
    3358                      .dwattr $C$DW$336, DW_AT_name("USER_ErrorCode_trajFreq_Hz_High")
    3359                      .dwattr $C$DW$336, DW_AT_const_value(0x64)
    3360              
    3361              $C$DW$337       .dwtag  DW_TAG_enumerator
    3362                      .dwattr $C$DW$337, DW_AT_name("USER_ErrorCode_trajFreq_Hz_Low")
    3363                      .dwattr $C$DW$337, DW_AT_const_value(0x65)
    3364              
    3365              $C$DW$338       .dwtag  DW_TAG_enumerator
    3366                      .dwattr $C$DW$338, DW_AT_name("USER_ErrorCode_ctrlPeriod_sec_High")
    3367                      .dwattr $C$DW$338, DW_AT_const_value(0x66)
    3368              
    3369              $C$DW$339       .dwtag  DW_TAG_enumerator
    3370                      .dwattr $C$DW$339, DW_AT_name("USER_ErrorCode_ctrlPeriod_sec_Low")
    3371                      .dwattr $C$DW$339, DW_AT_const_value(0x67)
    3372              
    3373              $C$DW$340       .dwtag  DW_TAG_enumerator
    3374                      .dwattr $C$DW$340, DW_AT_name("USER_ErrorCode_maxNegativeIdCurrent_a_High")
    3375                      .dwattr $C$DW$340, DW_AT_const_value(0x68)
    3376              
    3377              $C$DW$341       .dwtag  DW_TAG_enumerator
    3378                      .dwattr $C$DW$341, DW_AT_name("USER_ErrorCode_maxNegativeIdCurrent_a_Low")
    3379                      .dwattr $C$DW$341, DW_AT_const_value(0x69)
    3380              
    3381              $C$DW$342       .dwtag  DW_TAG_enumerator
    3382                      .dwattr $C$DW$342, DW_AT_name("USER_numErrorCodes")
    3383                      .dwattr $C$DW$342, DW_AT_const_value(0x6a)
TMS320C2000 Assembler PC v15.12.3 Tue Sep 12 21:32:38 2017

Tools Copyright (c) 1996-2015 Texas Instruments Incorporated
C:\Users\wmj\AppData\Local\Temp\2327210                              PAGE   67

    3384              
    3385                      .dwendtag $C$DW$T$74
    3386              
    3387              $C$DW$T$75      .dwtag  DW_TAG_typedef
    3388                      .dwattr $C$DW$T$75, DW_AT_name("USER_ErrorCode_e")
    3389                      .dwattr $C$DW$T$75, DW_AT_type(*$C$DW$T$74)
    3390                      .dwattr $C$DW$T$75, DW_AT_language(DW_LANG_C)
    3391              
    3392              $C$DW$343       .dwtag  DW_TAG_TI_far_type
    3393                      .dwattr $C$DW$343, DW_AT_type(*$C$DW$T$75)
    3394              
    3395              $C$DW$T$77      .dwtag  DW_TAG_const_type
    3396                      .dwattr $C$DW$T$77, DW_AT_type(*$C$DW$343)
    3397              
    3398              
    3399              $C$DW$T$82      .dwtag  DW_TAG_enumeration_type
    3400                      .dwattr $C$DW$T$82, DW_AT_byte_size(0x01)
    3401              $C$DW$344       .dwtag  DW_TAG_enumerator
    3402                      .dwattr $C$DW$344, DW_AT_name("CTRL_Type_PID_spd")
    3403                      .dwattr $C$DW$344, DW_AT_const_value(0x00)
    3404              
    3405              $C$DW$345       .dwtag  DW_TAG_enumerator
    3406                      .dwattr $C$DW$345, DW_AT_name("CTRL_Type_PID_Id")
    3407                      .dwattr $C$DW$345, DW_AT_const_value(0x01)
    3408              
    3409              $C$DW$346       .dwtag  DW_TAG_enumerator
    3410                      .dwattr $C$DW$346, DW_AT_name("CTRL_Type_PID_Iq")
    3411                      .dwattr $C$DW$346, DW_AT_const_value(0x02)
    3412              
    3413                      .dwendtag $C$DW$T$82
    3414              
    3415              $C$DW$T$83      .dwtag  DW_TAG_typedef
    3416                      .dwattr $C$DW$T$83, DW_AT_name("CTRL_Type_e")
    3417                      .dwattr $C$DW$T$83, DW_AT_type(*$C$DW$T$82)
    3418                      .dwattr $C$DW$T$83, DW_AT_language(DW_LANG_C)
    3419              
    3420              $C$DW$347       .dwtag  DW_TAG_TI_far_type
    3421                      .dwattr $C$DW$347, DW_AT_type(*$C$DW$T$83)
    3422              
    3423              $C$DW$T$84      .dwtag  DW_TAG_const_type
    3424                      .dwattr $C$DW$T$84, DW_AT_type(*$C$DW$347)
    3425              
    3426              
    3427              $C$DW$T$23      .dwtag  DW_TAG_structure_type
    3428                      .dwattr $C$DW$T$23, DW_AT_name("_CLARKE_Obj_")
    3429                      .dwattr $C$DW$T$23, DW_AT_byte_size(0x06)
    3430              $C$DW$348       .dwtag  DW_TAG_member
    3431                      .dwattr $C$DW$348, DW_AT_type(*$C$DW$T$20)
    3432                      .dwattr $C$DW$348, DW_AT_name("alpha_sf")
    3433                      .dwattr $C$DW$348, DW_AT_TI_symbol_name("_alpha_sf")
    3434                      .dwattr $C$DW$348, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    3435                      .dwattr $C$DW$348, DW_AT_accessibility(DW_ACCESS_public)
    3436              
    3437              $C$DW$349       .dwtag  DW_TAG_member
    3438                      .dwattr $C$DW$349, DW_AT_type(*$C$DW$T$20)
TMS320C2000 Assembler PC v15.12.3 Tue Sep 12 21:32:38 2017

Tools Copyright (c) 1996-2015 Texas Instruments Incorporated
C:\Users\wmj\AppData\Local\Temp\2327210                              PAGE   68

    3439                      .dwattr $C$DW$349, DW_AT_name("beta_sf")
    3440                      .dwattr $C$DW$349, DW_AT_TI_symbol_name("_beta_sf")
    3441                      .dwattr $C$DW$349, DW_AT_data_member_location[DW_OP_plus_uconst 0x2]
    3442                      .dwattr $C$DW$349, DW_AT_accessibility(DW_ACCESS_public)
    3443              
    3444              $C$DW$350       .dwtag  DW_TAG_member
    3445                      .dwattr $C$DW$350, DW_AT_type(*$C$DW$T$22)
    3446                      .dwattr $C$DW$350, DW_AT_name("numSensors")
    3447                      .dwattr $C$DW$350, DW_AT_TI_symbol_name("_numSensors")
    3448                      .dwattr $C$DW$350, DW_AT_data_member_location[DW_OP_plus_uconst 0x4]
    3449                      .dwattr $C$DW$350, DW_AT_accessibility(DW_ACCESS_public)
    3450              
    3451                      .dwendtag $C$DW$T$23
    3452              
    3453              $C$DW$T$31      .dwtag  DW_TAG_typedef
    3454                      .dwattr $C$DW$T$31, DW_AT_name("CLARKE_Obj")
    3455                      .dwattr $C$DW$T$31, DW_AT_type(*$C$DW$T$23)
    3456                      .dwattr $C$DW$T$31, DW_AT_language(DW_LANG_C)
    3457              
    3458              $C$DW$T$29      .dwtag  DW_TAG_pointer_type
    3459                      .dwattr $C$DW$T$29, DW_AT_type(*$C$DW$T$23)
    3460                      .dwattr $C$DW$T$29, DW_AT_address_class(0x20)
    3461              
    3462              $C$DW$T$30      .dwtag  DW_TAG_typedef
    3463                      .dwattr $C$DW$T$30, DW_AT_name("CLARKE_Handle")
    3464                      .dwattr $C$DW$T$30, DW_AT_type(*$C$DW$T$29)
    3465                      .dwattr $C$DW$T$30, DW_AT_language(DW_LANG_C)
    3466              
    3467              
    3468              $C$DW$T$57      .dwtag  DW_TAG_structure_type
    3469                      .dwattr $C$DW$T$57, DW_AT_name("_CTRL_Obj_")
    3470                      .dwattr $C$DW$T$57, DW_AT_byte_size(0x108)
    3471              $C$DW$351       .dwtag  DW_TAG_member
    3472                      .dwattr $C$DW$351, DW_AT_type(*$C$DW$T$24)
    3473                      .dwattr $C$DW$351, DW_AT_name("version")
    3474                      .dwattr $C$DW$351, DW_AT_TI_symbol_name("_version")
    3475                      .dwattr $C$DW$351, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    3476                      .dwattr $C$DW$351, DW_AT_accessibility(DW_ACCESS_public)
    3477              
    3478              $C$DW$352       .dwtag  DW_TAG_member
    3479                      .dwattr $C$DW$352, DW_AT_type(*$C$DW$T$26)
    3480                      .dwattr $C$DW$352, DW_AT_name("state")
    3481                      .dwattr $C$DW$352, DW_AT_TI_symbol_name("_state")
    3482                      .dwattr $C$DW$352, DW_AT_data_member_location[DW_OP_plus_uconst 0x4]
    3483                      .dwattr $C$DW$352, DW_AT_accessibility(DW_ACCESS_public)
    3484              
    3485              $C$DW$353       .dwtag  DW_TAG_member
    3486                      .dwattr $C$DW$353, DW_AT_type(*$C$DW$T$26)
    3487                      .dwattr $C$DW$353, DW_AT_name("prevState")
    3488                      .dwattr $C$DW$353, DW_AT_TI_symbol_name("_prevState")
    3489                      .dwattr $C$DW$353, DW_AT_data_member_location[DW_OP_plus_uconst 0x5]
    3490                      .dwattr $C$DW$353, DW_AT_accessibility(DW_ACCESS_public)
    3491              
    3492              $C$DW$354       .dwtag  DW_TAG_member
    3493                      .dwattr $C$DW$354, DW_AT_type(*$C$DW$T$28)
TMS320C2000 Assembler PC v15.12.3 Tue Sep 12 21:32:38 2017

Tools Copyright (c) 1996-2015 Texas Instruments Incorporated
C:\Users\wmj\AppData\Local\Temp\2327210                              PAGE   69

    3494                      .dwattr $C$DW$354, DW_AT_name("errorCode")
    3495                      .dwattr $C$DW$354, DW_AT_TI_symbol_name("_errorCode")
    3496                      .dwattr $C$DW$354, DW_AT_data_member_location[DW_OP_plus_uconst 0x6]
    3497                      .dwattr $C$DW$354, DW_AT_accessibility(DW_ACCESS_public)
    3498              
    3499              $C$DW$355       .dwtag  DW_TAG_member
    3500                      .dwattr $C$DW$355, DW_AT_type(*$C$DW$T$30)
    3501                      .dwattr $C$DW$355, DW_AT_name("clarkeHandle_I")
    3502                      .dwattr $C$DW$355, DW_AT_TI_symbol_name("_clarkeHandle_I")
    3503                      .dwattr $C$DW$355, DW_AT_data_member_location[DW_OP_plus_uconst 0x8]
    3504                      .dwattr $C$DW$355, DW_AT_accessibility(DW_ACCESS_public)
    3505              
    3506              $C$DW$356       .dwtag  DW_TAG_member
    3507                      .dwattr $C$DW$356, DW_AT_type(*$C$DW$T$31)
    3508                      .dwattr $C$DW$356, DW_AT_name("clarke_I")
    3509                      .dwattr $C$DW$356, DW_AT_TI_symbol_name("_clarke_I")
    3510                      .dwattr $C$DW$356, DW_AT_data_member_location[DW_OP_plus_uconst 0xa]
    3511                      .dwattr $C$DW$356, DW_AT_accessibility(DW_ACCESS_public)
    3512              
    3513              $C$DW$357       .dwtag  DW_TAG_member
    3514                      .dwattr $C$DW$357, DW_AT_type(*$C$DW$T$30)
    3515                      .dwattr $C$DW$357, DW_AT_name("clarkeHandle_V")
    3516                      .dwattr $C$DW$357, DW_AT_TI_symbol_name("_clarkeHandle_V")
    3517                      .dwattr $C$DW$357, DW_AT_data_member_location[DW_OP_plus_uconst 0x10]
    3518                      .dwattr $C$DW$357, DW_AT_accessibility(DW_ACCESS_public)
    3519              
    3520              $C$DW$358       .dwtag  DW_TAG_member
    3521                      .dwattr $C$DW$358, DW_AT_type(*$C$DW$T$31)
    3522                      .dwattr $C$DW$358, DW_AT_name("clarke_V")
    3523                      .dwattr $C$DW$358, DW_AT_TI_symbol_name("_clarke_V")
    3524                      .dwattr $C$DW$358, DW_AT_data_member_location[DW_OP_plus_uconst 0x12]
    3525                      .dwattr $C$DW$358, DW_AT_accessibility(DW_ACCESS_public)
    3526              
    3527              $C$DW$359       .dwtag  DW_TAG_member
    3528                      .dwattr $C$DW$359, DW_AT_type(*$C$DW$T$33)
    3529                      .dwattr $C$DW$359, DW_AT_name("estHandle")
    3530                      .dwattr $C$DW$359, DW_AT_TI_symbol_name("_estHandle")
    3531                      .dwattr $C$DW$359, DW_AT_data_member_location[DW_OP_plus_uconst 0x18]
    3532                      .dwattr $C$DW$359, DW_AT_accessibility(DW_ACCESS_public)
    3533              
    3534              $C$DW$360       .dwtag  DW_TAG_member
    3535                      .dwattr $C$DW$360, DW_AT_type(*$C$DW$T$35)
    3536                      .dwattr $C$DW$360, DW_AT_name("parkHandle")
    3537                      .dwattr $C$DW$360, DW_AT_TI_symbol_name("_parkHandle")
    3538                      .dwattr $C$DW$360, DW_AT_data_member_location[DW_OP_plus_uconst 0x1a]
    3539                      .dwattr $C$DW$360, DW_AT_accessibility(DW_ACCESS_public)
    3540              
    3541              $C$DW$361       .dwtag  DW_TAG_member
    3542                      .dwattr $C$DW$361, DW_AT_type(*$C$DW$T$36)
    3543                      .dwattr $C$DW$361, DW_AT_name("park")
    3544                      .dwattr $C$DW$361, DW_AT_TI_symbol_name("_park")
    3545                      .dwattr $C$DW$361, DW_AT_data_member_location[DW_OP_plus_uconst 0x1c]
    3546                      .dwattr $C$DW$361, DW_AT_accessibility(DW_ACCESS_public)
    3547              
    3548              $C$DW$362       .dwtag  DW_TAG_member
TMS320C2000 Assembler PC v15.12.3 Tue Sep 12 21:32:38 2017

Tools Copyright (c) 1996-2015 Texas Instruments Incorporated
C:\Users\wmj\AppData\Local\Temp\2327210                              PAGE   70

    3549                      .dwattr $C$DW$362, DW_AT_type(*$C$DW$T$38)
    3550                      .dwattr $C$DW$362, DW_AT_name("pidHandle_Id")
    3551                      .dwattr $C$DW$362, DW_AT_TI_symbol_name("_pidHandle_Id")
    3552                      .dwattr $C$DW$362, DW_AT_data_member_location[DW_OP_plus_uconst 0x20]
    3553                      .dwattr $C$DW$362, DW_AT_accessibility(DW_ACCESS_public)
    3554              
    3555              $C$DW$363       .dwtag  DW_TAG_member
    3556                      .dwattr $C$DW$363, DW_AT_type(*$C$DW$T$39)
    3557                      .dwattr $C$DW$363, DW_AT_name("pid_Id")
    3558                      .dwattr $C$DW$363, DW_AT_TI_symbol_name("_pid_Id")
    3559                      .dwattr $C$DW$363, DW_AT_data_member_location[DW_OP_plus_uconst 0x22]
    3560                      .dwattr $C$DW$363, DW_AT_accessibility(DW_ACCESS_public)
    3561              
    3562              $C$DW$364       .dwtag  DW_TAG_member
    3563                      .dwattr $C$DW$364, DW_AT_type(*$C$DW$T$38)
    3564                      .dwattr $C$DW$364, DW_AT_name("pidHandle_Iq")
    3565                      .dwattr $C$DW$364, DW_AT_TI_symbol_name("_pidHandle_Iq")
    3566                      .dwattr $C$DW$364, DW_AT_data_member_location[DW_OP_plus_uconst 0x32]
    3567                      .dwattr $C$DW$364, DW_AT_accessibility(DW_ACCESS_public)
    3568              
    3569              $C$DW$365       .dwtag  DW_TAG_member
    3570                      .dwattr $C$DW$365, DW_AT_type(*$C$DW$T$39)
    3571                      .dwattr $C$DW$365, DW_AT_name("pid_Iq")
    3572                      .dwattr $C$DW$365, DW_AT_TI_symbol_name("_pid_Iq")
    3573                      .dwattr $C$DW$365, DW_AT_data_member_location[DW_OP_plus_uconst 0x34]
    3574                      .dwattr $C$DW$365, DW_AT_accessibility(DW_ACCESS_public)
    3575              
    3576              $C$DW$366       .dwtag  DW_TAG_member
    3577                      .dwattr $C$DW$366, DW_AT_type(*$C$DW$T$38)
    3578                      .dwattr $C$DW$366, DW_AT_name("pidHandle_spd")
    3579                      .dwattr $C$DW$366, DW_AT_TI_symbol_name("_pidHandle_spd")
    3580                      .dwattr $C$DW$366, DW_AT_data_member_location[DW_OP_plus_uconst 0x44]
    3581                      .dwattr $C$DW$366, DW_AT_accessibility(DW_ACCESS_public)
    3582              
    3583              $C$DW$367       .dwtag  DW_TAG_member
    3584                      .dwattr $C$DW$367, DW_AT_type(*$C$DW$T$39)
    3585                      .dwattr $C$DW$367, DW_AT_name("pid_spd")
    3586                      .dwattr $C$DW$367, DW_AT_TI_symbol_name("_pid_spd")
    3587                      .dwattr $C$DW$367, DW_AT_data_member_location[DW_OP_plus_uconst 0x46]
    3588                      .dwattr $C$DW$367, DW_AT_accessibility(DW_ACCESS_public)
    3589              
    3590              $C$DW$368       .dwtag  DW_TAG_member
    3591                      .dwattr $C$DW$368, DW_AT_type(*$C$DW$T$41)
    3592                      .dwattr $C$DW$368, DW_AT_name("iparkHandle")
    3593                      .dwattr $C$DW$368, DW_AT_TI_symbol_name("_iparkHandle")
    3594                      .dwattr $C$DW$368, DW_AT_data_member_location[DW_OP_plus_uconst 0x56]
    3595                      .dwattr $C$DW$368, DW_AT_accessibility(DW_ACCESS_public)
    3596              
    3597              $C$DW$369       .dwtag  DW_TAG_member
    3598                      .dwattr $C$DW$369, DW_AT_type(*$C$DW$T$42)
    3599                      .dwattr $C$DW$369, DW_AT_name("ipark")
    3600                      .dwattr $C$DW$369, DW_AT_TI_symbol_name("_ipark")
    3601                      .dwattr $C$DW$369, DW_AT_data_member_location[DW_OP_plus_uconst 0x58]
    3602                      .dwattr $C$DW$369, DW_AT_accessibility(DW_ACCESS_public)
    3603              
TMS320C2000 Assembler PC v15.12.3 Tue Sep 12 21:32:38 2017

Tools Copyright (c) 1996-2015 Texas Instruments Incorporated
C:\Users\wmj\AppData\Local\Temp\2327210                              PAGE   71

    3604              $C$DW$370       .dwtag  DW_TAG_member
    3605                      .dwattr $C$DW$370, DW_AT_type(*$C$DW$T$44)
    3606                      .dwattr $C$DW$370, DW_AT_name("svgenHandle")
    3607                      .dwattr $C$DW$370, DW_AT_TI_symbol_name("_svgenHandle")
    3608                      .dwattr $C$DW$370, DW_AT_data_member_location[DW_OP_plus_uconst 0x5c]
    3609                      .dwattr $C$DW$370, DW_AT_accessibility(DW_ACCESS_public)
    3610              
    3611              $C$DW$371       .dwtag  DW_TAG_member
    3612                      .dwattr $C$DW$371, DW_AT_type(*$C$DW$T$45)
    3613                      .dwattr $C$DW$371, DW_AT_name("svgen")
    3614                      .dwattr $C$DW$371, DW_AT_TI_symbol_name("_svgen")
    3615                      .dwattr $C$DW$371, DW_AT_data_member_location[DW_OP_plus_uconst 0x5e]
    3616                      .dwattr $C$DW$371, DW_AT_accessibility(DW_ACCESS_public)
    3617              
    3618              $C$DW$372       .dwtag  DW_TAG_member
    3619                      .dwattr $C$DW$372, DW_AT_type(*$C$DW$T$47)
    3620                      .dwattr $C$DW$372, DW_AT_name("trajHandle_Id")
    3621                      .dwattr $C$DW$372, DW_AT_TI_symbol_name("_trajHandle_Id")
    3622                      .dwattr $C$DW$372, DW_AT_data_member_location[DW_OP_plus_uconst 0x60]
    3623                      .dwattr $C$DW$372, DW_AT_accessibility(DW_ACCESS_public)
    3624              
    3625              $C$DW$373       .dwtag  DW_TAG_member
    3626                      .dwattr $C$DW$373, DW_AT_type(*$C$DW$T$48)
    3627                      .dwattr $C$DW$373, DW_AT_name("traj_Id")
    3628                      .dwattr $C$DW$373, DW_AT_TI_symbol_name("_traj_Id")
    3629                      .dwattr $C$DW$373, DW_AT_data_member_location[DW_OP_plus_uconst 0x62]
    3630                      .dwattr $C$DW$373, DW_AT_accessibility(DW_ACCESS_public)
    3631              
    3632              $C$DW$374       .dwtag  DW_TAG_member
    3633                      .dwattr $C$DW$374, DW_AT_type(*$C$DW$T$47)
    3634                      .dwattr $C$DW$374, DW_AT_name("trajHandle_spd")
    3635                      .dwattr $C$DW$374, DW_AT_TI_symbol_name("_trajHandle_spd")
    3636                      .dwattr $C$DW$374, DW_AT_data_member_location[DW_OP_plus_uconst 0x6c]
    3637                      .dwattr $C$DW$374, DW_AT_accessibility(DW_ACCESS_public)
    3638              
    3639              $C$DW$375       .dwtag  DW_TAG_member
    3640                      .dwattr $C$DW$375, DW_AT_type(*$C$DW$T$48)
    3641                      .dwattr $C$DW$375, DW_AT_name("traj_spd")
    3642                      .dwattr $C$DW$375, DW_AT_TI_symbol_name("_traj_spd")
    3643                      .dwattr $C$DW$375, DW_AT_data_member_location[DW_OP_plus_uconst 0x6e]
    3644                      .dwattr $C$DW$375, DW_AT_accessibility(DW_ACCESS_public)
    3645              
    3646              $C$DW$376       .dwtag  DW_TAG_member
    3647                      .dwattr $C$DW$376, DW_AT_type(*$C$DW$T$47)
    3648                      .dwattr $C$DW$376, DW_AT_name("trajHandle_spdMax")
    3649                      .dwattr $C$DW$376, DW_AT_TI_symbol_name("_trajHandle_spdMax")
    3650                      .dwattr $C$DW$376, DW_AT_data_member_location[DW_OP_plus_uconst 0x78]
    3651                      .dwattr $C$DW$376, DW_AT_accessibility(DW_ACCESS_public)
    3652              
    3653              $C$DW$377       .dwtag  DW_TAG_member
    3654                      .dwattr $C$DW$377, DW_AT_type(*$C$DW$T$48)
    3655                      .dwattr $C$DW$377, DW_AT_name("traj_spdMax")
    3656                      .dwattr $C$DW$377, DW_AT_TI_symbol_name("_traj_spdMax")
    3657                      .dwattr $C$DW$377, DW_AT_data_member_location[DW_OP_plus_uconst 0x7a]
    3658                      .dwattr $C$DW$377, DW_AT_accessibility(DW_ACCESS_public)
TMS320C2000 Assembler PC v15.12.3 Tue Sep 12 21:32:38 2017

Tools Copyright (c) 1996-2015 Texas Instruments Incorporated
C:\Users\wmj\AppData\Local\Temp\2327210                              PAGE   72

    3659              
    3660              $C$DW$378       .dwtag  DW_TAG_member
    3661                      .dwattr $C$DW$378, DW_AT_type(*$C$DW$T$49)
    3662                      .dwattr $C$DW$378, DW_AT_name("motorParams")
    3663                      .dwattr $C$DW$378, DW_AT_TI_symbol_name("_motorParams")
    3664                      .dwattr $C$DW$378, DW_AT_data_member_location[DW_OP_plus_uconst 0x84]
    3665                      .dwattr $C$DW$378, DW_AT_accessibility(DW_ACCESS_public)
    3666              
    3667              $C$DW$379       .dwtag  DW_TAG_member
    3668                      .dwattr $C$DW$379, DW_AT_type(*$C$DW$T$52)
    3669                      .dwattr $C$DW$379, DW_AT_name("waitTimes")
    3670                      .dwattr $C$DW$379, DW_AT_TI_symbol_name("_waitTimes")
    3671                      .dwattr $C$DW$379, DW_AT_data_member_location[DW_OP_plus_uconst 0x92]
    3672                      .dwattr $C$DW$379, DW_AT_accessibility(DW_ACCESS_public)
    3673              
    3674              $C$DW$380       .dwtag  DW_TAG_member
    3675                      .dwattr $C$DW$380, DW_AT_type(*$C$DW$T$51)
    3676                      .dwattr $C$DW$380, DW_AT_name("counter_state")
    3677                      .dwattr $C$DW$380, DW_AT_TI_symbol_name("_counter_state")
    3678                      .dwattr $C$DW$380, DW_AT_data_member_location[DW_OP_plus_uconst 0x9a]
    3679                      .dwattr $C$DW$380, DW_AT_accessibility(DW_ACCESS_public)
    3680              
    3681              $C$DW$381       .dwtag  DW_TAG_member
    3682                      .dwattr $C$DW$381, DW_AT_type(*$C$DW$T$53)
    3683                      .dwattr $C$DW$381, DW_AT_name("numIsrTicksPerCtrlTick")
    3684                      .dwattr $C$DW$381, DW_AT_TI_symbol_name("_numIsrTicksPerCtrlTick")
    3685                      .dwattr $C$DW$381, DW_AT_data_member_location[DW_OP_plus_uconst 0x9c]
    3686                      .dwattr $C$DW$381, DW_AT_accessibility(DW_ACCESS_public)
    3687              
    3688              $C$DW$382       .dwtag  DW_TAG_member
    3689                      .dwattr $C$DW$382, DW_AT_type(*$C$DW$T$53)
    3690                      .dwattr $C$DW$382, DW_AT_name("numCtrlTicksPerCurrentTick")
    3691                      .dwattr $C$DW$382, DW_AT_TI_symbol_name("_numCtrlTicksPerCurrentTick")
    3692                      .dwattr $C$DW$382, DW_AT_data_member_location[DW_OP_plus_uconst 0x9d]
    3693                      .dwattr $C$DW$382, DW_AT_accessibility(DW_ACCESS_public)
    3694              
    3695              $C$DW$383       .dwtag  DW_TAG_member
    3696                      .dwattr $C$DW$383, DW_AT_type(*$C$DW$T$53)
    3697                      .dwattr $C$DW$383, DW_AT_name("numCtrlTicksPerSpeedTick")
    3698                      .dwattr $C$DW$383, DW_AT_TI_symbol_name("_numCtrlTicksPerSpeedTick")
    3699                      .dwattr $C$DW$383, DW_AT_data_member_location[DW_OP_plus_uconst 0x9e]
    3700                      .dwattr $C$DW$383, DW_AT_accessibility(DW_ACCESS_public)
    3701              
    3702              $C$DW$384       .dwtag  DW_TAG_member
    3703                      .dwattr $C$DW$384, DW_AT_type(*$C$DW$T$53)
    3704                      .dwattr $C$DW$384, DW_AT_name("numCtrlTicksPerTrajTick")
    3705                      .dwattr $C$DW$384, DW_AT_TI_symbol_name("_numCtrlTicksPerTrajTick")
    3706                      .dwattr $C$DW$384, DW_AT_data_member_location[DW_OP_plus_uconst 0x9f]
    3707                      .dwattr $C$DW$384, DW_AT_accessibility(DW_ACCESS_public)
    3708              
    3709              $C$DW$385       .dwtag  DW_TAG_member
    3710                      .dwattr $C$DW$385, DW_AT_type(*$C$DW$T$51)
    3711                      .dwattr $C$DW$385, DW_AT_name("ctrlFreq_Hz")
    3712                      .dwattr $C$DW$385, DW_AT_TI_symbol_name("_ctrlFreq_Hz")
    3713                      .dwattr $C$DW$385, DW_AT_data_member_location[DW_OP_plus_uconst 0xa0]
TMS320C2000 Assembler PC v15.12.3 Tue Sep 12 21:32:38 2017

Tools Copyright (c) 1996-2015 Texas Instruments Incorporated
C:\Users\wmj\AppData\Local\Temp\2327210                              PAGE   73

    3714                      .dwattr $C$DW$385, DW_AT_accessibility(DW_ACCESS_public)
    3715              
    3716              $C$DW$386       .dwtag  DW_TAG_member
    3717                      .dwattr $C$DW$386, DW_AT_type(*$C$DW$T$51)
    3718                      .dwattr $C$DW$386, DW_AT_name("trajFreq_Hz")
    3719                      .dwattr $C$DW$386, DW_AT_TI_symbol_name("_trajFreq_Hz")
    3720                      .dwattr $C$DW$386, DW_AT_data_member_location[DW_OP_plus_uconst 0xa2]
    3721                      .dwattr $C$DW$386, DW_AT_accessibility(DW_ACCESS_public)
    3722              
    3723              $C$DW$387       .dwtag  DW_TAG_member
    3724                      .dwattr $C$DW$387, DW_AT_type(*$C$DW$T$20)
    3725                      .dwattr $C$DW$387, DW_AT_name("trajPeriod_sec")
    3726                      .dwattr $C$DW$387, DW_AT_TI_symbol_name("_trajPeriod_sec")
    3727                      .dwattr $C$DW$387, DW_AT_data_member_location[DW_OP_plus_uconst 0xa4]
    3728                      .dwattr $C$DW$387, DW_AT_accessibility(DW_ACCESS_public)
    3729              
    3730              $C$DW$388       .dwtag  DW_TAG_member
    3731                      .dwattr $C$DW$388, DW_AT_type(*$C$DW$T$54)
    3732                      .dwattr $C$DW$388, DW_AT_name("ctrlPeriod_sec")
    3733                      .dwattr $C$DW$388, DW_AT_TI_symbol_name("_ctrlPeriod_sec")
    3734                      .dwattr $C$DW$388, DW_AT_data_member_location[DW_OP_plus_uconst 0xa6]
    3735                      .dwattr $C$DW$388, DW_AT_accessibility(DW_ACCESS_public)
    3736              
    3737              $C$DW$389       .dwtag  DW_TAG_member
    3738                      .dwattr $C$DW$389, DW_AT_type(*$C$DW$T$20)
    3739                      .dwattr $C$DW$389, DW_AT_name("maxVsMag_pu")
    3740                      .dwattr $C$DW$389, DW_AT_TI_symbol_name("_maxVsMag_pu")
    3741                      .dwattr $C$DW$389, DW_AT_data_member_location[DW_OP_plus_uconst 0xa8]
    3742                      .dwattr $C$DW$389, DW_AT_accessibility(DW_ACCESS_public)
    3743              
    3744              $C$DW$390       .dwtag  DW_TAG_member
    3745                      .dwattr $C$DW$390, DW_AT_type(*$C$DW$T$55)
    3746                      .dwattr $C$DW$390, DW_AT_name("Iab_in")
    3747                      .dwattr $C$DW$390, DW_AT_TI_symbol_name("_Iab_in")
    3748                      .dwattr $C$DW$390, DW_AT_data_member_location[DW_OP_plus_uconst 0xaa]
    3749                      .dwattr $C$DW$390, DW_AT_accessibility(DW_ACCESS_public)
    3750              
    3751              $C$DW$391       .dwtag  DW_TAG_member
    3752                      .dwattr $C$DW$391, DW_AT_type(*$C$DW$T$55)
    3753                      .dwattr $C$DW$391, DW_AT_name("Iab_filt")
    3754                      .dwattr $C$DW$391, DW_AT_TI_symbol_name("_Iab_filt")
    3755                      .dwattr $C$DW$391, DW_AT_data_member_location[DW_OP_plus_uconst 0xae]
    3756                      .dwattr $C$DW$391, DW_AT_accessibility(DW_ACCESS_public)
    3757              
    3758              $C$DW$392       .dwtag  DW_TAG_member
    3759                      .dwattr $C$DW$392, DW_AT_type(*$C$DW$T$55)
    3760                      .dwattr $C$DW$392, DW_AT_name("Idq_in")
    3761                      .dwattr $C$DW$392, DW_AT_TI_symbol_name("_Idq_in")
    3762                      .dwattr $C$DW$392, DW_AT_data_member_location[DW_OP_plus_uconst 0xb2]
    3763                      .dwattr $C$DW$392, DW_AT_accessibility(DW_ACCESS_public)
    3764              
    3765              $C$DW$393       .dwtag  DW_TAG_member
    3766                      .dwattr $C$DW$393, DW_AT_type(*$C$DW$T$55)
    3767                      .dwattr $C$DW$393, DW_AT_name("Vab_in")
    3768                      .dwattr $C$DW$393, DW_AT_TI_symbol_name("_Vab_in")
TMS320C2000 Assembler PC v15.12.3 Tue Sep 12 21:32:38 2017

Tools Copyright (c) 1996-2015 Texas Instruments Incorporated
C:\Users\wmj\AppData\Local\Temp\2327210                              PAGE   74

    3769                      .dwattr $C$DW$393, DW_AT_data_member_location[DW_OP_plus_uconst 0xb6]
    3770                      .dwattr $C$DW$393, DW_AT_accessibility(DW_ACCESS_public)
    3771              
    3772              $C$DW$394       .dwtag  DW_TAG_member
    3773                      .dwattr $C$DW$394, DW_AT_type(*$C$DW$T$20)
    3774                      .dwattr $C$DW$394, DW_AT_name("spd_out")
    3775                      .dwattr $C$DW$394, DW_AT_TI_symbol_name("_spd_out")
    3776                      .dwattr $C$DW$394, DW_AT_data_member_location[DW_OP_plus_uconst 0xba]
    3777                      .dwattr $C$DW$394, DW_AT_accessibility(DW_ACCESS_public)
    3778              
    3779              $C$DW$395       .dwtag  DW_TAG_member
    3780                      .dwattr $C$DW$395, DW_AT_type(*$C$DW$T$55)
    3781                      .dwattr $C$DW$395, DW_AT_name("Vab_out")
    3782                      .dwattr $C$DW$395, DW_AT_TI_symbol_name("_Vab_out")
    3783                      .dwattr $C$DW$395, DW_AT_data_member_location[DW_OP_plus_uconst 0xbc]
    3784                      .dwattr $C$DW$395, DW_AT_accessibility(DW_ACCESS_public)
    3785              
    3786              $C$DW$396       .dwtag  DW_TAG_member
    3787                      .dwattr $C$DW$396, DW_AT_type(*$C$DW$T$55)
    3788                      .dwattr $C$DW$396, DW_AT_name("Vdq_out")
    3789                      .dwattr $C$DW$396, DW_AT_TI_symbol_name("_Vdq_out")
    3790                      .dwattr $C$DW$396, DW_AT_data_member_location[DW_OP_plus_uconst 0xc0]
    3791                      .dwattr $C$DW$396, DW_AT_accessibility(DW_ACCESS_public)
    3792              
    3793              $C$DW$397       .dwtag  DW_TAG_member
    3794                      .dwattr $C$DW$397, DW_AT_type(*$C$DW$T$54)
    3795                      .dwattr $C$DW$397, DW_AT_name("Rhf")
    3796                      .dwattr $C$DW$397, DW_AT_TI_symbol_name("_Rhf")
    3797                      .dwattr $C$DW$397, DW_AT_data_member_location[DW_OP_plus_uconst 0xc4]
    3798                      .dwattr $C$DW$397, DW_AT_accessibility(DW_ACCESS_public)
    3799              
    3800              $C$DW$398       .dwtag  DW_TAG_member
    3801                      .dwattr $C$DW$398, DW_AT_type(*$C$DW$T$54)
    3802                      .dwattr $C$DW$398, DW_AT_name("Lhf")
    3803                      .dwattr $C$DW$398, DW_AT_TI_symbol_name("_Lhf")
    3804                      .dwattr $C$DW$398, DW_AT_data_member_location[DW_OP_plus_uconst 0xc6]
    3805                      .dwattr $C$DW$398, DW_AT_accessibility(DW_ACCESS_public)
    3806              
    3807              $C$DW$399       .dwtag  DW_TAG_member
    3808                      .dwattr $C$DW$399, DW_AT_type(*$C$DW$T$54)
    3809                      .dwattr $C$DW$399, DW_AT_name("RoverL")
    3810                      .dwattr $C$DW$399, DW_AT_TI_symbol_name("_RoverL")
    3811                      .dwattr $C$DW$399, DW_AT_data_member_location[DW_OP_plus_uconst 0xc8]
    3812                      .dwattr $C$DW$399, DW_AT_accessibility(DW_ACCESS_public)
    3813              
    3814              $C$DW$400       .dwtag  DW_TAG_member
    3815                      .dwattr $C$DW$400, DW_AT_type(*$C$DW$T$20)
    3816                      .dwattr $C$DW$400, DW_AT_name("Kp_Id")
    3817                      .dwattr $C$DW$400, DW_AT_TI_symbol_name("_Kp_Id")
    3818                      .dwattr $C$DW$400, DW_AT_data_member_location[DW_OP_plus_uconst 0xca]
    3819                      .dwattr $C$DW$400, DW_AT_accessibility(DW_ACCESS_public)
    3820              
    3821              $C$DW$401       .dwtag  DW_TAG_member
    3822                      .dwattr $C$DW$401, DW_AT_type(*$C$DW$T$20)
    3823                      .dwattr $C$DW$401, DW_AT_name("Kp_Iq")
TMS320C2000 Assembler PC v15.12.3 Tue Sep 12 21:32:38 2017

Tools Copyright (c) 1996-2015 Texas Instruments Incorporated
C:\Users\wmj\AppData\Local\Temp\2327210                              PAGE   75

    3824                      .dwattr $C$DW$401, DW_AT_TI_symbol_name("_Kp_Iq")
    3825                      .dwattr $C$DW$401, DW_AT_data_member_location[DW_OP_plus_uconst 0xcc]
    3826                      .dwattr $C$DW$401, DW_AT_accessibility(DW_ACCESS_public)
    3827              
    3828              $C$DW$402       .dwtag  DW_TAG_member
    3829                      .dwattr $C$DW$402, DW_AT_type(*$C$DW$T$20)
    3830                      .dwattr $C$DW$402, DW_AT_name("Kp_spd")
    3831                      .dwattr $C$DW$402, DW_AT_TI_symbol_name("_Kp_spd")
    3832                      .dwattr $C$DW$402, DW_AT_data_member_location[DW_OP_plus_uconst 0xce]
    3833                      .dwattr $C$DW$402, DW_AT_accessibility(DW_ACCESS_public)
    3834              
    3835              $C$DW$403       .dwtag  DW_TAG_member
    3836                      .dwattr $C$DW$403, DW_AT_type(*$C$DW$T$20)
    3837                      .dwattr $C$DW$403, DW_AT_name("Ki_Id")
    3838                      .dwattr $C$DW$403, DW_AT_TI_symbol_name("_Ki_Id")
    3839                      .dwattr $C$DW$403, DW_AT_data_member_location[DW_OP_plus_uconst 0xd0]
    3840                      .dwattr $C$DW$403, DW_AT_accessibility(DW_ACCESS_public)
    3841              
    3842              $C$DW$404       .dwtag  DW_TAG_member
    3843                      .dwattr $C$DW$404, DW_AT_type(*$C$DW$T$20)
    3844                      .dwattr $C$DW$404, DW_AT_name("Ki_Iq")
    3845                      .dwattr $C$DW$404, DW_AT_TI_symbol_name("_Ki_Iq")
    3846                      .dwattr $C$DW$404, DW_AT_data_member_location[DW_OP_plus_uconst 0xd2]
    3847                      .dwattr $C$DW$404, DW_AT_accessibility(DW_ACCESS_public)
    3848              
    3849              $C$DW$405       .dwtag  DW_TAG_member
    3850                      .dwattr $C$DW$405, DW_AT_type(*$C$DW$T$20)
    3851                      .dwattr $C$DW$405, DW_AT_name("Ki_spd")
    3852                      .dwattr $C$DW$405, DW_AT_TI_symbol_name("_Ki_spd")
    3853                      .dwattr $C$DW$405, DW_AT_data_member_location[DW_OP_plus_uconst 0xd4]
    3854                      .dwattr $C$DW$405, DW_AT_accessibility(DW_ACCESS_public)
    3855              
    3856              $C$DW$406       .dwtag  DW_TAG_member
    3857                      .dwattr $C$DW$406, DW_AT_type(*$C$DW$T$20)
    3858                      .dwattr $C$DW$406, DW_AT_name("Kd_Id")
    3859                      .dwattr $C$DW$406, DW_AT_TI_symbol_name("_Kd_Id")
    3860                      .dwattr $C$DW$406, DW_AT_data_member_location[DW_OP_plus_uconst 0xd6]
    3861                      .dwattr $C$DW$406, DW_AT_accessibility(DW_ACCESS_public)
    3862              
    3863              $C$DW$407       .dwtag  DW_TAG_member
    3864                      .dwattr $C$DW$407, DW_AT_type(*$C$DW$T$20)
    3865                      .dwattr $C$DW$407, DW_AT_name("Kd_Iq")
    3866                      .dwattr $C$DW$407, DW_AT_TI_symbol_name("_Kd_Iq")
    3867                      .dwattr $C$DW$407, DW_AT_data_member_location[DW_OP_plus_uconst 0xd8]
    3868                      .dwattr $C$DW$407, DW_AT_accessibility(DW_ACCESS_public)
    3869              
    3870              $C$DW$408       .dwtag  DW_TAG_member
    3871                      .dwattr $C$DW$408, DW_AT_type(*$C$DW$T$20)
    3872                      .dwattr $C$DW$408, DW_AT_name("Kd_spd")
    3873                      .dwattr $C$DW$408, DW_AT_TI_symbol_name("_Kd_spd")
    3874                      .dwattr $C$DW$408, DW_AT_data_member_location[DW_OP_plus_uconst 0xda]
    3875                      .dwattr $C$DW$408, DW_AT_accessibility(DW_ACCESS_public)
    3876              
    3877              $C$DW$409       .dwtag  DW_TAG_member
    3878                      .dwattr $C$DW$409, DW_AT_type(*$C$DW$T$20)
TMS320C2000 Assembler PC v15.12.3 Tue Sep 12 21:32:38 2017

Tools Copyright (c) 1996-2015 Texas Instruments Incorporated
C:\Users\wmj\AppData\Local\Temp\2327210                              PAGE   76

    3879                      .dwattr $C$DW$409, DW_AT_name("Ui_Id")
    3880                      .dwattr $C$DW$409, DW_AT_TI_symbol_name("_Ui_Id")
    3881                      .dwattr $C$DW$409, DW_AT_data_member_location[DW_OP_plus_uconst 0xdc]
    3882                      .dwattr $C$DW$409, DW_AT_accessibility(DW_ACCESS_public)
    3883              
    3884              $C$DW$410       .dwtag  DW_TAG_member
    3885                      .dwattr $C$DW$410, DW_AT_type(*$C$DW$T$20)
    3886                      .dwattr $C$DW$410, DW_AT_name("Ui_Iq")
    3887                      .dwattr $C$DW$410, DW_AT_TI_symbol_name("_Ui_Iq")
    3888                      .dwattr $C$DW$410, DW_AT_data_member_location[DW_OP_plus_uconst 0xde]
    3889                      .dwattr $C$DW$410, DW_AT_accessibility(DW_ACCESS_public)
    3890              
    3891              $C$DW$411       .dwtag  DW_TAG_member
    3892                      .dwattr $C$DW$411, DW_AT_type(*$C$DW$T$20)
    3893                      .dwattr $C$DW$411, DW_AT_name("Ui_spd")
    3894                      .dwattr $C$DW$411, DW_AT_TI_symbol_name("_Ui_spd")
    3895                      .dwattr $C$DW$411, DW_AT_data_member_location[DW_OP_plus_uconst 0xe0]
    3896                      .dwattr $C$DW$411, DW_AT_accessibility(DW_ACCESS_public)
    3897              
    3898              $C$DW$412       .dwtag  DW_TAG_member
    3899                      .dwattr $C$DW$412, DW_AT_type(*$C$DW$T$55)
    3900                      .dwattr $C$DW$412, DW_AT_name("Idq_ref")
    3901                      .dwattr $C$DW$412, DW_AT_TI_symbol_name("_Idq_ref")
    3902                      .dwattr $C$DW$412, DW_AT_data_member_location[DW_OP_plus_uconst 0xe2]
    3903                      .dwattr $C$DW$412, DW_AT_accessibility(DW_ACCESS_public)
    3904              
    3905              $C$DW$413       .dwtag  DW_TAG_member
    3906                      .dwattr $C$DW$413, DW_AT_type(*$C$DW$T$20)
    3907                      .dwattr $C$DW$413, DW_AT_name("IdRated")
    3908                      .dwattr $C$DW$413, DW_AT_TI_symbol_name("_IdRated")
    3909                      .dwattr $C$DW$413, DW_AT_data_member_location[DW_OP_plus_uconst 0xe6]
    3910                      .dwattr $C$DW$413, DW_AT_accessibility(DW_ACCESS_public)
    3911              
    3912              $C$DW$414       .dwtag  DW_TAG_member
    3913                      .dwattr $C$DW$414, DW_AT_type(*$C$DW$T$20)
    3914                      .dwattr $C$DW$414, DW_AT_name("spd_ref")
    3915                      .dwattr $C$DW$414, DW_AT_TI_symbol_name("_spd_ref")
    3916                      .dwattr $C$DW$414, DW_AT_data_member_location[DW_OP_plus_uconst 0xe8]
    3917                      .dwattr $C$DW$414, DW_AT_accessibility(DW_ACCESS_public)
    3918              
    3919              $C$DW$415       .dwtag  DW_TAG_member
    3920                      .dwattr $C$DW$415, DW_AT_type(*$C$DW$T$20)
    3921                      .dwattr $C$DW$415, DW_AT_name("spd_max")
    3922                      .dwattr $C$DW$415, DW_AT_TI_symbol_name("_spd_max")
    3923                      .dwattr $C$DW$415, DW_AT_data_member_location[DW_OP_plus_uconst 0xea]
    3924                      .dwattr $C$DW$415, DW_AT_accessibility(DW_ACCESS_public)
    3925              
    3926              $C$DW$416       .dwtag  DW_TAG_member
    3927                      .dwattr $C$DW$416, DW_AT_type(*$C$DW$T$53)
    3928                      .dwattr $C$DW$416, DW_AT_name("counter_current")
    3929                      .dwattr $C$DW$416, DW_AT_TI_symbol_name("_counter_current")
    3930                      .dwattr $C$DW$416, DW_AT_data_member_location[DW_OP_plus_uconst 0xec]
    3931                      .dwattr $C$DW$416, DW_AT_accessibility(DW_ACCESS_public)
    3932              
    3933              $C$DW$417       .dwtag  DW_TAG_member
TMS320C2000 Assembler PC v15.12.3 Tue Sep 12 21:32:38 2017

Tools Copyright (c) 1996-2015 Texas Instruments Incorporated
C:\Users\wmj\AppData\Local\Temp\2327210                              PAGE   77

    3934                      .dwattr $C$DW$417, DW_AT_type(*$C$DW$T$53)
    3935                      .dwattr $C$DW$417, DW_AT_name("counter_isr")
    3936                      .dwattr $C$DW$417, DW_AT_TI_symbol_name("_counter_isr")
    3937                      .dwattr $C$DW$417, DW_AT_data_member_location[DW_OP_plus_uconst 0xed]
    3938                      .dwattr $C$DW$417, DW_AT_accessibility(DW_ACCESS_public)
    3939              
    3940              $C$DW$418       .dwtag  DW_TAG_member
    3941                      .dwattr $C$DW$418, DW_AT_type(*$C$DW$T$53)
    3942                      .dwattr $C$DW$418, DW_AT_name("counter_speed")
    3943                      .dwattr $C$DW$418, DW_AT_TI_symbol_name("_counter_speed")
    3944                      .dwattr $C$DW$418, DW_AT_data_member_location[DW_OP_plus_uconst 0xee]
    3945                      .dwattr $C$DW$418, DW_AT_accessibility(DW_ACCESS_public)
    3946              
    3947              $C$DW$419       .dwtag  DW_TAG_member
    3948                      .dwattr $C$DW$419, DW_AT_type(*$C$DW$T$53)
    3949                      .dwattr $C$DW$419, DW_AT_name("counter_traj")
    3950                      .dwattr $C$DW$419, DW_AT_TI_symbol_name("_counter_traj")
    3951                      .dwattr $C$DW$419, DW_AT_data_member_location[DW_OP_plus_uconst 0xef]
    3952                      .dwattr $C$DW$419, DW_AT_accessibility(DW_ACCESS_public)
    3953              
    3954              $C$DW$420       .dwtag  DW_TAG_member
    3955                      .dwattr $C$DW$420, DW_AT_type(*$C$DW$T$56)
    3956                      .dwattr $C$DW$420, DW_AT_name("flag_enableCtrl")
    3957                      .dwattr $C$DW$420, DW_AT_TI_symbol_name("_flag_enableCtrl")
    3958                      .dwattr $C$DW$420, DW_AT_data_member_location[DW_OP_plus_uconst 0xf0]
    3959                      .dwattr $C$DW$420, DW_AT_accessibility(DW_ACCESS_public)
    3960              
    3961              $C$DW$421       .dwtag  DW_TAG_member
    3962                      .dwattr $C$DW$421, DW_AT_type(*$C$DW$T$56)
    3963                      .dwattr $C$DW$421, DW_AT_name("flag_enableDcBusComp")
    3964                      .dwattr $C$DW$421, DW_AT_TI_symbol_name("_flag_enableDcBusComp")
    3965                      .dwattr $C$DW$421, DW_AT_data_member_location[DW_OP_plus_uconst 0xf1]
    3966                      .dwattr $C$DW$421, DW_AT_accessibility(DW_ACCESS_public)
    3967              
    3968              $C$DW$422       .dwtag  DW_TAG_member
    3969                      .dwattr $C$DW$422, DW_AT_type(*$C$DW$T$56)
    3970                      .dwattr $C$DW$422, DW_AT_name("flag_enablePowerWarp")
    3971                      .dwattr $C$DW$422, DW_AT_TI_symbol_name("_flag_enablePowerWarp")
    3972                      .dwattr $C$DW$422, DW_AT_data_member_location[DW_OP_plus_uconst 0xf2]
    3973                      .dwattr $C$DW$422, DW_AT_accessibility(DW_ACCESS_public)
    3974              
    3975              $C$DW$423       .dwtag  DW_TAG_member
    3976                      .dwattr $C$DW$423, DW_AT_type(*$C$DW$T$56)
    3977                      .dwattr $C$DW$423, DW_AT_name("flag_enableOffset")
    3978                      .dwattr $C$DW$423, DW_AT_TI_symbol_name("_flag_enableOffset")
    3979                      .dwattr $C$DW$423, DW_AT_data_member_location[DW_OP_plus_uconst 0xf3]
    3980                      .dwattr $C$DW$423, DW_AT_accessibility(DW_ACCESS_public)
    3981              
    3982              $C$DW$424       .dwtag  DW_TAG_member
    3983                      .dwattr $C$DW$424, DW_AT_type(*$C$DW$T$56)
    3984                      .dwattr $C$DW$424, DW_AT_name("flag_enableSpeedCtrl")
    3985                      .dwattr $C$DW$424, DW_AT_TI_symbol_name("_flag_enableSpeedCtrl")
    3986                      .dwattr $C$DW$424, DW_AT_data_member_location[DW_OP_plus_uconst 0xf4]
    3987                      .dwattr $C$DW$424, DW_AT_accessibility(DW_ACCESS_public)
    3988              
TMS320C2000 Assembler PC v15.12.3 Tue Sep 12 21:32:38 2017

Tools Copyright (c) 1996-2015 Texas Instruments Incorporated
C:\Users\wmj\AppData\Local\Temp\2327210                              PAGE   78

    3989              $C$DW$425       .dwtag  DW_TAG_member
    3990                      .dwattr $C$DW$425, DW_AT_type(*$C$DW$T$56)
    3991                      .dwattr $C$DW$425, DW_AT_name("flag_enableUserMotorParams")
    3992                      .dwattr $C$DW$425, DW_AT_TI_symbol_name("_flag_enableUserMotorParams")
    3993                      .dwattr $C$DW$425, DW_AT_data_member_location[DW_OP_plus_uconst 0xf5]
    3994                      .dwattr $C$DW$425, DW_AT_accessibility(DW_ACCESS_public)
    3995              
    3996              $C$DW$426       .dwtag  DW_TAG_member
    3997                      .dwattr $C$DW$426, DW_AT_type(*$C$DW$T$55)
    3998                      .dwattr $C$DW$426, DW_AT_name("Idq_offset_pu")
    3999                      .dwattr $C$DW$426, DW_AT_TI_symbol_name("_Idq_offset_pu")
    4000                      .dwattr $C$DW$426, DW_AT_data_member_location[DW_OP_plus_uconst 0xf6]
    4001                      .dwattr $C$DW$426, DW_AT_accessibility(DW_ACCESS_public)
    4002              
    4003              $C$DW$427       .dwtag  DW_TAG_member
    4004                      .dwattr $C$DW$427, DW_AT_type(*$C$DW$T$55)
    4005                      .dwattr $C$DW$427, DW_AT_name("Vdq_offset_pu")
    4006                      .dwattr $C$DW$427, DW_AT_TI_symbol_name("_Vdq_offset_pu")
    4007                      .dwattr $C$DW$427, DW_AT_data_member_location[DW_OP_plus_uconst 0xfa]
    4008                      .dwattr $C$DW$427, DW_AT_accessibility(DW_ACCESS_public)
    4009              
    4010              $C$DW$428       .dwtag  DW_TAG_member
    4011                      .dwattr $C$DW$428, DW_AT_type(*$C$DW$T$20)
    4012                      .dwattr $C$DW$428, DW_AT_name("angle_pu")
    4013                      .dwattr $C$DW$428, DW_AT_TI_symbol_name("_angle_pu")
    4014                      .dwattr $C$DW$428, DW_AT_data_member_location[DW_OP_plus_uconst 0xfe]
    4015                      .dwattr $C$DW$428, DW_AT_accessibility(DW_ACCESS_public)
    4016              
    4017              $C$DW$429       .dwtag  DW_TAG_member
    4018                      .dwattr $C$DW$429, DW_AT_type(*$C$DW$T$20)
    4019                      .dwattr $C$DW$429, DW_AT_name("speed_ref_pu")
    4020                      .dwattr $C$DW$429, DW_AT_TI_symbol_name("_speed_ref_pu")
    4021                      .dwattr $C$DW$429, DW_AT_data_member_location[DW_OP_plus_uconst 0x100]
    4022                      .dwattr $C$DW$429, DW_AT_accessibility(DW_ACCESS_public)
    4023              
    4024              $C$DW$430       .dwtag  DW_TAG_member
    4025                      .dwattr $C$DW$430, DW_AT_type(*$C$DW$T$20)
    4026                      .dwattr $C$DW$430, DW_AT_name("speed_fb_pu")
    4027                      .dwattr $C$DW$430, DW_AT_TI_symbol_name("_speed_fb_pu")
    4028                      .dwattr $C$DW$430, DW_AT_data_member_location[DW_OP_plus_uconst 0x102]
    4029                      .dwattr $C$DW$430, DW_AT_accessibility(DW_ACCESS_public)
    4030              
    4031              $C$DW$431       .dwtag  DW_TAG_member
    4032                      .dwattr $C$DW$431, DW_AT_type(*$C$DW$T$20)
    4033                      .dwattr $C$DW$431, DW_AT_name("speed_outMax_pu")
    4034                      .dwattr $C$DW$431, DW_AT_TI_symbol_name("_speed_outMax_pu")
    4035                      .dwattr $C$DW$431, DW_AT_data_member_location[DW_OP_plus_uconst 0x104]
    4036                      .dwattr $C$DW$431, DW_AT_accessibility(DW_ACCESS_public)
    4037              
    4038              $C$DW$432       .dwtag  DW_TAG_member
    4039                      .dwattr $C$DW$432, DW_AT_type(*$C$DW$T$56)
    4040                      .dwattr $C$DW$432, DW_AT_name("flag_enableCurrentCtrl")
    4041                      .dwattr $C$DW$432, DW_AT_TI_symbol_name("_flag_enableCurrentCtrl")
    4042                      .dwattr $C$DW$432, DW_AT_data_member_location[DW_OP_plus_uconst 0x106]
    4043                      .dwattr $C$DW$432, DW_AT_accessibility(DW_ACCESS_public)
TMS320C2000 Assembler PC v15.12.3 Tue Sep 12 21:32:38 2017

Tools Copyright (c) 1996-2015 Texas Instruments Incorporated
C:\Users\wmj\AppData\Local\Temp\2327210                              PAGE   79

    4044              
    4045                      .dwendtag $C$DW$T$57
    4046              
    4047              $C$DW$T$85      .dwtag  DW_TAG_typedef
    4048                      .dwattr $C$DW$T$85, DW_AT_name("CTRL_Obj")
    4049                      .dwattr $C$DW$T$85, DW_AT_type(*$C$DW$T$57)
    4050                      .dwattr $C$DW$T$85, DW_AT_language(DW_LANG_C)
    4051              
    4052              $C$DW$T$86      .dwtag  DW_TAG_pointer_type
    4053                      .dwattr $C$DW$T$86, DW_AT_type(*$C$DW$T$57)
    4054                      .dwattr $C$DW$T$86, DW_AT_address_class(0x20)
    4055              
    4056              $C$DW$T$87      .dwtag  DW_TAG_typedef
    4057                      .dwattr $C$DW$T$87, DW_AT_name("CTRL_Handle")
    4058                      .dwattr $C$DW$T$87, DW_AT_type(*$C$DW$T$86)
    4059                      .dwattr $C$DW$T$87, DW_AT_language(DW_LANG_C)
    4060              
    4061              $C$DW$433       .dwtag  DW_TAG_TI_far_type
    4062                      .dwattr $C$DW$433, DW_AT_type(*$C$DW$T$87)
    4063              
    4064              $C$DW$T$88      .dwtag  DW_TAG_const_type
    4065                      .dwattr $C$DW$T$88, DW_AT_type(*$C$DW$433)
    4066              
    4067              
    4068              $C$DW$T$60      .dwtag  DW_TAG_structure_type
    4069                      .dwattr $C$DW$T$60, DW_AT_name("_CTRL_Version_")
    4070                      .dwattr $C$DW$T$60, DW_AT_byte_size(0x04)
    4071              $C$DW$434       .dwtag  DW_TAG_member
    4072                      .dwattr $C$DW$434, DW_AT_type(*$C$DW$T$21)
    4073                      .dwattr $C$DW$434, DW_AT_name("rsvd")
    4074                      .dwattr $C$DW$434, DW_AT_TI_symbol_name("_rsvd")
    4075                      .dwattr $C$DW$434, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    4076                      .dwattr $C$DW$434, DW_AT_accessibility(DW_ACCESS_public)
    4077              
    4078              $C$DW$435       .dwtag  DW_TAG_member
    4079                      .dwattr $C$DW$435, DW_AT_type(*$C$DW$T$59)
    4080                      .dwattr $C$DW$435, DW_AT_name("targetProc")
    4081                      .dwattr $C$DW$435, DW_AT_TI_symbol_name("_targetProc")
    4082                      .dwattr $C$DW$435, DW_AT_data_member_location[DW_OP_plus_uconst 0x1]
    4083                      .dwattr $C$DW$435, DW_AT_accessibility(DW_ACCESS_public)
    4084              
    4085              $C$DW$436       .dwtag  DW_TAG_member
    4086                      .dwattr $C$DW$436, DW_AT_type(*$C$DW$T$21)
    4087                      .dwattr $C$DW$436, DW_AT_name("major")
    4088                      .dwattr $C$DW$436, DW_AT_TI_symbol_name("_major")
    4089                      .dwattr $C$DW$436, DW_AT_data_member_location[DW_OP_plus_uconst 0x2]
    4090                      .dwattr $C$DW$436, DW_AT_accessibility(DW_ACCESS_public)
    4091              
    4092              $C$DW$437       .dwtag  DW_TAG_member
    4093                      .dwattr $C$DW$437, DW_AT_type(*$C$DW$T$21)
    4094                      .dwattr $C$DW$437, DW_AT_name("minor")
    4095                      .dwattr $C$DW$437, DW_AT_TI_symbol_name("_minor")
    4096                      .dwattr $C$DW$437, DW_AT_data_member_location[DW_OP_plus_uconst 0x3]
    4097                      .dwattr $C$DW$437, DW_AT_accessibility(DW_ACCESS_public)
    4098              
TMS320C2000 Assembler PC v15.12.3 Tue Sep 12 21:32:38 2017

Tools Copyright (c) 1996-2015 Texas Instruments Incorporated
C:\Users\wmj\AppData\Local\Temp\2327210                              PAGE   80

    4099                      .dwendtag $C$DW$T$60
    4100              
    4101              $C$DW$T$24      .dwtag  DW_TAG_typedef
    4102                      .dwattr $C$DW$T$24, DW_AT_name("CTRL_Version")
    4103                      .dwattr $C$DW$T$24, DW_AT_type(*$C$DW$T$60)
    4104                      .dwattr $C$DW$T$24, DW_AT_language(DW_LANG_C)
    4105              
    4106              
    4107              $C$DW$T$19      .dwtag  DW_TAG_structure_type
    4108                      .dwattr $C$DW$T$19, DW_AT_name("_EST_Obj_")
    4109                      .dwattr $C$DW$T$19, DW_AT_declaration
    4110                      .dwendtag $C$DW$T$19
    4111              
    4112              $C$DW$T$32      .dwtag  DW_TAG_pointer_type
    4113                      .dwattr $C$DW$T$32, DW_AT_type(*$C$DW$T$19)
    4114                      .dwattr $C$DW$T$32, DW_AT_address_class(0x20)
    4115              
    4116              $C$DW$T$33      .dwtag  DW_TAG_typedef
    4117                      .dwattr $C$DW$T$33, DW_AT_name("EST_Handle")
    4118                      .dwattr $C$DW$T$33, DW_AT_type(*$C$DW$T$32)
    4119                      .dwattr $C$DW$T$33, DW_AT_language(DW_LANG_C)
    4120              
    4121              
    4122              $C$DW$T$61      .dwtag  DW_TAG_structure_type
    4123                      .dwattr $C$DW$T$61, DW_AT_name("_IPARK_Obj_")
    4124                      .dwattr $C$DW$T$61, DW_AT_byte_size(0x04)
    4125              $C$DW$438       .dwtag  DW_TAG_member
    4126                      .dwattr $C$DW$438, DW_AT_type(*$C$DW$T$20)
    4127                      .dwattr $C$DW$438, DW_AT_name("sinTh")
    4128                      .dwattr $C$DW$438, DW_AT_TI_symbol_name("_sinTh")
    4129                      .dwattr $C$DW$438, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    4130                      .dwattr $C$DW$438, DW_AT_accessibility(DW_ACCESS_public)
    4131              
    4132              $C$DW$439       .dwtag  DW_TAG_member
    4133                      .dwattr $C$DW$439, DW_AT_type(*$C$DW$T$20)
    4134                      .dwattr $C$DW$439, DW_AT_name("cosTh")
    4135                      .dwattr $C$DW$439, DW_AT_TI_symbol_name("_cosTh")
    4136                      .dwattr $C$DW$439, DW_AT_data_member_location[DW_OP_plus_uconst 0x2]
    4137                      .dwattr $C$DW$439, DW_AT_accessibility(DW_ACCESS_public)
    4138              
    4139                      .dwendtag $C$DW$T$61
    4140              
    4141              $C$DW$T$42      .dwtag  DW_TAG_typedef
    4142                      .dwattr $C$DW$T$42, DW_AT_name("IPARK_Obj")
    4143                      .dwattr $C$DW$T$42, DW_AT_type(*$C$DW$T$61)
    4144                      .dwattr $C$DW$T$42, DW_AT_language(DW_LANG_C)
    4145              
    4146              $C$DW$T$40      .dwtag  DW_TAG_pointer_type
    4147                      .dwattr $C$DW$T$40, DW_AT_type(*$C$DW$T$61)
    4148                      .dwattr $C$DW$T$40, DW_AT_address_class(0x20)
    4149              
    4150              $C$DW$T$41      .dwtag  DW_TAG_typedef
    4151                      .dwattr $C$DW$T$41, DW_AT_name("IPARK_Handle")
    4152                      .dwattr $C$DW$T$41, DW_AT_type(*$C$DW$T$40)
    4153                      .dwattr $C$DW$T$41, DW_AT_language(DW_LANG_C)
TMS320C2000 Assembler PC v15.12.3 Tue Sep 12 21:32:38 2017

Tools Copyright (c) 1996-2015 Texas Instruments Incorporated
C:\Users\wmj\AppData\Local\Temp\2327210                              PAGE   81

    4154              
    4155              
    4156              $C$DW$T$63      .dwtag  DW_TAG_structure_type
    4157                      .dwattr $C$DW$T$63, DW_AT_name("_MATH_vec2_")
    4158                      .dwattr $C$DW$T$63, DW_AT_byte_size(0x04)
    4159              $C$DW$440       .dwtag  DW_TAG_member
    4160                      .dwattr $C$DW$440, DW_AT_type(*$C$DW$T$62)
    4161                      .dwattr $C$DW$440, DW_AT_name("value")
    4162                      .dwattr $C$DW$440, DW_AT_TI_symbol_name("_value")
    4163                      .dwattr $C$DW$440, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    4164                      .dwattr $C$DW$440, DW_AT_accessibility(DW_ACCESS_public)
    4165              
    4166                      .dwendtag $C$DW$T$63
    4167              
    4168              $C$DW$T$55      .dwtag  DW_TAG_typedef
    4169                      .dwattr $C$DW$T$55, DW_AT_name("MATH_vec2")
    4170                      .dwattr $C$DW$T$55, DW_AT_type(*$C$DW$T$63)
    4171                      .dwattr $C$DW$T$55, DW_AT_language(DW_LANG_C)
    4172              
    4173              
    4174              $C$DW$T$66      .dwtag  DW_TAG_structure_type
    4175                      .dwattr $C$DW$T$66, DW_AT_name("_MOTOR_Params_")
    4176                      .dwattr $C$DW$T$66, DW_AT_byte_size(0x0e)
    4177              $C$DW$441       .dwtag  DW_TAG_member
    4178                      .dwattr $C$DW$441, DW_AT_type(*$C$DW$T$65)
    4179                      .dwattr $C$DW$441, DW_AT_name("type")
    4180                      .dwattr $C$DW$441, DW_AT_TI_symbol_name("_type")
    4181                      .dwattr $C$DW$441, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    4182                      .dwattr $C$DW$441, DW_AT_accessibility(DW_ACCESS_public)
    4183              
    4184              $C$DW$442       .dwtag  DW_TAG_member
    4185                      .dwattr $C$DW$442, DW_AT_type(*$C$DW$T$53)
    4186                      .dwattr $C$DW$442, DW_AT_name("numPolePairs")
    4187                      .dwattr $C$DW$442, DW_AT_TI_symbol_name("_numPolePairs")
    4188                      .dwattr $C$DW$442, DW_AT_data_member_location[DW_OP_plus_uconst 0x1]
    4189                      .dwattr $C$DW$442, DW_AT_accessibility(DW_ACCESS_public)
    4190              
    4191              $C$DW$443       .dwtag  DW_TAG_member
    4192                      .dwattr $C$DW$443, DW_AT_type(*$C$DW$T$54)
    4193                      .dwattr $C$DW$443, DW_AT_name("Lr_H")
    4194                      .dwattr $C$DW$443, DW_AT_TI_symbol_name("_Lr_H")
    4195                      .dwattr $C$DW$443, DW_AT_data_member_location[DW_OP_plus_uconst 0x2]
    4196                      .dwattr $C$DW$443, DW_AT_accessibility(DW_ACCESS_public)
    4197              
    4198              $C$DW$444       .dwtag  DW_TAG_member
    4199                      .dwattr $C$DW$444, DW_AT_type(*$C$DW$T$54)
    4200                      .dwattr $C$DW$444, DW_AT_name("Ls_d_H")
    4201                      .dwattr $C$DW$444, DW_AT_TI_symbol_name("_Ls_d_H")
    4202                      .dwattr $C$DW$444, DW_AT_data_member_location[DW_OP_plus_uconst 0x4]
    4203                      .dwattr $C$DW$444, DW_AT_accessibility(DW_ACCESS_public)
    4204              
    4205              $C$DW$445       .dwtag  DW_TAG_member
    4206                      .dwattr $C$DW$445, DW_AT_type(*$C$DW$T$54)
    4207                      .dwattr $C$DW$445, DW_AT_name("Ls_q_H")
    4208                      .dwattr $C$DW$445, DW_AT_TI_symbol_name("_Ls_q_H")
TMS320C2000 Assembler PC v15.12.3 Tue Sep 12 21:32:38 2017

Tools Copyright (c) 1996-2015 Texas Instruments Incorporated
C:\Users\wmj\AppData\Local\Temp\2327210                              PAGE   82

    4209                      .dwattr $C$DW$445, DW_AT_data_member_location[DW_OP_plus_uconst 0x6]
    4210                      .dwattr $C$DW$445, DW_AT_accessibility(DW_ACCESS_public)
    4211              
    4212              $C$DW$446       .dwtag  DW_TAG_member
    4213                      .dwattr $C$DW$446, DW_AT_type(*$C$DW$T$54)
    4214                      .dwattr $C$DW$446, DW_AT_name("Rr_Ohm")
    4215                      .dwattr $C$DW$446, DW_AT_TI_symbol_name("_Rr_Ohm")
    4216                      .dwattr $C$DW$446, DW_AT_data_member_location[DW_OP_plus_uconst 0x8]
    4217                      .dwattr $C$DW$446, DW_AT_accessibility(DW_ACCESS_public)
    4218              
    4219              $C$DW$447       .dwtag  DW_TAG_member
    4220                      .dwattr $C$DW$447, DW_AT_type(*$C$DW$T$54)
    4221                      .dwattr $C$DW$447, DW_AT_name("Rs_Ohm")
    4222                      .dwattr $C$DW$447, DW_AT_TI_symbol_name("_Rs_Ohm")
    4223                      .dwattr $C$DW$447, DW_AT_data_member_location[DW_OP_plus_uconst 0xa]
    4224                      .dwattr $C$DW$447, DW_AT_accessibility(DW_ACCESS_public)
    4225              
    4226              $C$DW$448       .dwtag  DW_TAG_member
    4227                      .dwattr $C$DW$448, DW_AT_type(*$C$DW$T$54)
    4228                      .dwattr $C$DW$448, DW_AT_name("ratedFlux_VpHz")
    4229                      .dwattr $C$DW$448, DW_AT_TI_symbol_name("_ratedFlux_VpHz")
    4230                      .dwattr $C$DW$448, DW_AT_data_member_location[DW_OP_plus_uconst 0xc]
    4231                      .dwattr $C$DW$448, DW_AT_accessibility(DW_ACCESS_public)
    4232              
    4233                      .dwendtag $C$DW$T$66
    4234              
    4235              $C$DW$T$49      .dwtag  DW_TAG_typedef
    4236                      .dwattr $C$DW$T$49, DW_AT_name("MOTOR_Params")
    4237                      .dwattr $C$DW$T$49, DW_AT_type(*$C$DW$T$66)
    4238                      .dwattr $C$DW$T$49, DW_AT_language(DW_LANG_C)
    4239              
    4240              
    4241              $C$DW$T$67      .dwtag  DW_TAG_structure_type
    4242                      .dwattr $C$DW$T$67, DW_AT_name("_PARK_Obj_")
    4243                      .dwattr $C$DW$T$67, DW_AT_byte_size(0x04)
    4244              $C$DW$449       .dwtag  DW_TAG_member
    4245                      .dwattr $C$DW$449, DW_AT_type(*$C$DW$T$20)
    4246                      .dwattr $C$DW$449, DW_AT_name("sinTh")
    4247                      .dwattr $C$DW$449, DW_AT_TI_symbol_name("_sinTh")
    4248                      .dwattr $C$DW$449, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    4249                      .dwattr $C$DW$449, DW_AT_accessibility(DW_ACCESS_public)
    4250              
    4251              $C$DW$450       .dwtag  DW_TAG_member
    4252                      .dwattr $C$DW$450, DW_AT_type(*$C$DW$T$20)
    4253                      .dwattr $C$DW$450, DW_AT_name("cosTh")
    4254                      .dwattr $C$DW$450, DW_AT_TI_symbol_name("_cosTh")
    4255                      .dwattr $C$DW$450, DW_AT_data_member_location[DW_OP_plus_uconst 0x2]
    4256                      .dwattr $C$DW$450, DW_AT_accessibility(DW_ACCESS_public)
    4257              
    4258                      .dwendtag $C$DW$T$67
    4259              
    4260              $C$DW$T$36      .dwtag  DW_TAG_typedef
    4261                      .dwattr $C$DW$T$36, DW_AT_name("PARK_Obj")
    4262                      .dwattr $C$DW$T$36, DW_AT_type(*$C$DW$T$67)
    4263                      .dwattr $C$DW$T$36, DW_AT_language(DW_LANG_C)
TMS320C2000 Assembler PC v15.12.3 Tue Sep 12 21:32:38 2017

Tools Copyright (c) 1996-2015 Texas Instruments Incorporated
C:\Users\wmj\AppData\Local\Temp\2327210                              PAGE   83

    4264              
    4265              $C$DW$T$34      .dwtag  DW_TAG_pointer_type
    4266                      .dwattr $C$DW$T$34, DW_AT_type(*$C$DW$T$67)
    4267                      .dwattr $C$DW$T$34, DW_AT_address_class(0x20)
    4268              
    4269              $C$DW$T$35      .dwtag  DW_TAG_typedef
    4270                      .dwattr $C$DW$T$35, DW_AT_name("PARK_Handle")
    4271                      .dwattr $C$DW$T$35, DW_AT_type(*$C$DW$T$34)
    4272                      .dwattr $C$DW$T$35, DW_AT_language(DW_LANG_C)
    4273              
    4274              
    4275              $C$DW$T$68      .dwtag  DW_TAG_structure_type
    4276                      .dwattr $C$DW$T$68, DW_AT_name("_PID_Obj_")
    4277                      .dwattr $C$DW$T$68, DW_AT_byte_size(0x10)
    4278              $C$DW$451       .dwtag  DW_TAG_member
    4279                      .dwattr $C$DW$451, DW_AT_type(*$C$DW$T$20)
    4280                      .dwattr $C$DW$451, DW_AT_name("Kp")
    4281                      .dwattr $C$DW$451, DW_AT_TI_symbol_name("_Kp")
    4282                      .dwattr $C$DW$451, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    4283                      .dwattr $C$DW$451, DW_AT_accessibility(DW_ACCESS_public)
    4284              
    4285              $C$DW$452       .dwtag  DW_TAG_member
    4286                      .dwattr $C$DW$452, DW_AT_type(*$C$DW$T$20)
    4287                      .dwattr $C$DW$452, DW_AT_name("Ki")
    4288                      .dwattr $C$DW$452, DW_AT_TI_symbol_name("_Ki")
    4289                      .dwattr $C$DW$452, DW_AT_data_member_location[DW_OP_plus_uconst 0x2]
    4290                      .dwattr $C$DW$452, DW_AT_accessibility(DW_ACCESS_public)
    4291              
    4292              $C$DW$453       .dwtag  DW_TAG_member
    4293                      .dwattr $C$DW$453, DW_AT_type(*$C$DW$T$20)
    4294                      .dwattr $C$DW$453, DW_AT_name("Kd")
    4295                      .dwattr $C$DW$453, DW_AT_TI_symbol_name("_Kd")
    4296                      .dwattr $C$DW$453, DW_AT_data_member_location[DW_OP_plus_uconst 0x4]
    4297                      .dwattr $C$DW$453, DW_AT_accessibility(DW_ACCESS_public)
    4298              
    4299              $C$DW$454       .dwtag  DW_TAG_member
    4300                      .dwattr $C$DW$454, DW_AT_type(*$C$DW$T$20)
    4301                      .dwattr $C$DW$454, DW_AT_name("Ui")
    4302                      .dwattr $C$DW$454, DW_AT_TI_symbol_name("_Ui")
    4303                      .dwattr $C$DW$454, DW_AT_data_member_location[DW_OP_plus_uconst 0x6]
    4304                      .dwattr $C$DW$454, DW_AT_accessibility(DW_ACCESS_public)
    4305              
    4306              $C$DW$455       .dwtag  DW_TAG_member
    4307                      .dwattr $C$DW$455, DW_AT_type(*$C$DW$T$20)
    4308                      .dwattr $C$DW$455, DW_AT_name("refValue")
    4309                      .dwattr $C$DW$455, DW_AT_TI_symbol_name("_refValue")
    4310                      .dwattr $C$DW$455, DW_AT_data_member_location[DW_OP_plus_uconst 0x8]
    4311                      .dwattr $C$DW$455, DW_AT_accessibility(DW_ACCESS_public)
    4312              
    4313              $C$DW$456       .dwtag  DW_TAG_member
    4314                      .dwattr $C$DW$456, DW_AT_type(*$C$DW$T$20)
    4315                      .dwattr $C$DW$456, DW_AT_name("fbackValue")
    4316                      .dwattr $C$DW$456, DW_AT_TI_symbol_name("_fbackValue")
    4317                      .dwattr $C$DW$456, DW_AT_data_member_location[DW_OP_plus_uconst 0xa]
    4318                      .dwattr $C$DW$456, DW_AT_accessibility(DW_ACCESS_public)
TMS320C2000 Assembler PC v15.12.3 Tue Sep 12 21:32:38 2017

Tools Copyright (c) 1996-2015 Texas Instruments Incorporated
C:\Users\wmj\AppData\Local\Temp\2327210                              PAGE   84

    4319              
    4320              $C$DW$457       .dwtag  DW_TAG_member
    4321                      .dwattr $C$DW$457, DW_AT_type(*$C$DW$T$20)
    4322                      .dwattr $C$DW$457, DW_AT_name("outMin")
    4323                      .dwattr $C$DW$457, DW_AT_TI_symbol_name("_outMin")
    4324                      .dwattr $C$DW$457, DW_AT_data_member_location[DW_OP_plus_uconst 0xc]
    4325                      .dwattr $C$DW$457, DW_AT_accessibility(DW_ACCESS_public)
    4326              
    4327              $C$DW$458       .dwtag  DW_TAG_member
    4328                      .dwattr $C$DW$458, DW_AT_type(*$C$DW$T$20)
    4329                      .dwattr $C$DW$458, DW_AT_name("outMax")
    4330                      .dwattr $C$DW$458, DW_AT_TI_symbol_name("_outMax")
    4331                      .dwattr $C$DW$458, DW_AT_data_member_location[DW_OP_plus_uconst 0xe]
    4332                      .dwattr $C$DW$458, DW_AT_accessibility(DW_ACCESS_public)
    4333              
    4334                      .dwendtag $C$DW$T$68
    4335              
    4336              $C$DW$T$39      .dwtag  DW_TAG_typedef
    4337                      .dwattr $C$DW$T$39, DW_AT_name("PID_Obj")
    4338                      .dwattr $C$DW$T$39, DW_AT_type(*$C$DW$T$68)
    4339                      .dwattr $C$DW$T$39, DW_AT_language(DW_LANG_C)
    4340              
    4341              $C$DW$T$37      .dwtag  DW_TAG_pointer_type
    4342                      .dwattr $C$DW$T$37, DW_AT_type(*$C$DW$T$68)
    4343                      .dwattr $C$DW$T$37, DW_AT_address_class(0x20)
    4344              
    4345              $C$DW$T$38      .dwtag  DW_TAG_typedef
    4346                      .dwattr $C$DW$T$38, DW_AT_name("PID_Handle")
    4347                      .dwattr $C$DW$T$38, DW_AT_type(*$C$DW$T$37)
    4348                      .dwattr $C$DW$T$38, DW_AT_language(DW_LANG_C)
    4349              
    4350              
    4351              $C$DW$T$69      .dwtag  DW_TAG_structure_type
    4352                      .dwattr $C$DW$T$69, DW_AT_name("_SVGEN_Obj_")
    4353                      .dwattr $C$DW$T$69, DW_AT_byte_size(0x02)
    4354              $C$DW$459       .dwtag  DW_TAG_member
    4355                      .dwattr $C$DW$459, DW_AT_type(*$C$DW$T$20)
    4356                      .dwattr $C$DW$459, DW_AT_name("maxModulation")
    4357                      .dwattr $C$DW$459, DW_AT_TI_symbol_name("_maxModulation")
    4358                      .dwattr $C$DW$459, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    4359                      .dwattr $C$DW$459, DW_AT_accessibility(DW_ACCESS_public)
    4360              
    4361                      .dwendtag $C$DW$T$69
    4362              
    4363              $C$DW$T$45      .dwtag  DW_TAG_typedef
    4364                      .dwattr $C$DW$T$45, DW_AT_name("SVGEN_Obj")
    4365                      .dwattr $C$DW$T$45, DW_AT_type(*$C$DW$T$69)
    4366                      .dwattr $C$DW$T$45, DW_AT_language(DW_LANG_C)
    4367              
    4368              $C$DW$T$43      .dwtag  DW_TAG_pointer_type
    4369                      .dwattr $C$DW$T$43, DW_AT_type(*$C$DW$T$69)
    4370                      .dwattr $C$DW$T$43, DW_AT_address_class(0x20)
    4371              
    4372              $C$DW$T$44      .dwtag  DW_TAG_typedef
    4373                      .dwattr $C$DW$T$44, DW_AT_name("SVGEN_Handle")
TMS320C2000 Assembler PC v15.12.3 Tue Sep 12 21:32:38 2017

Tools Copyright (c) 1996-2015 Texas Instruments Incorporated
C:\Users\wmj\AppData\Local\Temp\2327210                              PAGE   85

    4374                      .dwattr $C$DW$T$44, DW_AT_type(*$C$DW$T$43)
    4375                      .dwattr $C$DW$T$44, DW_AT_language(DW_LANG_C)
    4376              
    4377              
    4378              $C$DW$T$70      .dwtag  DW_TAG_structure_type
    4379                      .dwattr $C$DW$T$70, DW_AT_name("_TRAJ_Obj_")
    4380                      .dwattr $C$DW$T$70, DW_AT_byte_size(0x0a)
    4381              $C$DW$460       .dwtag  DW_TAG_member
    4382                      .dwattr $C$DW$460, DW_AT_type(*$C$DW$T$20)
    4383                      .dwattr $C$DW$460, DW_AT_name("targetValue")
    4384                      .dwattr $C$DW$460, DW_AT_TI_symbol_name("_targetValue")
    4385                      .dwattr $C$DW$460, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    4386                      .dwattr $C$DW$460, DW_AT_accessibility(DW_ACCESS_public)
    4387              
    4388              $C$DW$461       .dwtag  DW_TAG_member
    4389                      .dwattr $C$DW$461, DW_AT_type(*$C$DW$T$20)
    4390                      .dwattr $C$DW$461, DW_AT_name("intValue")
    4391                      .dwattr $C$DW$461, DW_AT_TI_symbol_name("_intValue")
    4392                      .dwattr $C$DW$461, DW_AT_data_member_location[DW_OP_plus_uconst 0x2]
    4393                      .dwattr $C$DW$461, DW_AT_accessibility(DW_ACCESS_public)
    4394              
    4395              $C$DW$462       .dwtag  DW_TAG_member
    4396                      .dwattr $C$DW$462, DW_AT_type(*$C$DW$T$20)
    4397                      .dwattr $C$DW$462, DW_AT_name("minValue")
    4398                      .dwattr $C$DW$462, DW_AT_TI_symbol_name("_minValue")
    4399                      .dwattr $C$DW$462, DW_AT_data_member_location[DW_OP_plus_uconst 0x4]
    4400                      .dwattr $C$DW$462, DW_AT_accessibility(DW_ACCESS_public)
    4401              
    4402              $C$DW$463       .dwtag  DW_TAG_member
    4403                      .dwattr $C$DW$463, DW_AT_type(*$C$DW$T$20)
    4404                      .dwattr $C$DW$463, DW_AT_name("maxValue")
    4405                      .dwattr $C$DW$463, DW_AT_TI_symbol_name("_maxValue")
    4406                      .dwattr $C$DW$463, DW_AT_data_member_location[DW_OP_plus_uconst 0x6]
    4407                      .dwattr $C$DW$463, DW_AT_accessibility(DW_ACCESS_public)
    4408              
    4409              $C$DW$464       .dwtag  DW_TAG_member
    4410                      .dwattr $C$DW$464, DW_AT_type(*$C$DW$T$20)
    4411                      .dwattr $C$DW$464, DW_AT_name("maxDelta")
    4412                      .dwattr $C$DW$464, DW_AT_TI_symbol_name("_maxDelta")
    4413                      .dwattr $C$DW$464, DW_AT_data_member_location[DW_OP_plus_uconst 0x8]
    4414                      .dwattr $C$DW$464, DW_AT_accessibility(DW_ACCESS_public)
    4415              
    4416                      .dwendtag $C$DW$T$70
    4417              
    4418              $C$DW$T$48      .dwtag  DW_TAG_typedef
    4419                      .dwattr $C$DW$T$48, DW_AT_name("TRAJ_Obj")
    4420                      .dwattr $C$DW$T$48, DW_AT_type(*$C$DW$T$70)
    4421                      .dwattr $C$DW$T$48, DW_AT_language(DW_LANG_C)
    4422              
    4423              $C$DW$T$46      .dwtag  DW_TAG_pointer_type
    4424                      .dwattr $C$DW$T$46, DW_AT_type(*$C$DW$T$70)
    4425                      .dwattr $C$DW$T$46, DW_AT_address_class(0x20)
    4426              
    4427              $C$DW$T$47      .dwtag  DW_TAG_typedef
    4428                      .dwattr $C$DW$T$47, DW_AT_name("TRAJ_Handle")
TMS320C2000 Assembler PC v15.12.3 Tue Sep 12 21:32:38 2017

Tools Copyright (c) 1996-2015 Texas Instruments Incorporated
C:\Users\wmj\AppData\Local\Temp\2327210                              PAGE   86

    4429                      .dwattr $C$DW$T$47, DW_AT_type(*$C$DW$T$46)
    4430                      .dwattr $C$DW$T$47, DW_AT_language(DW_LANG_C)
    4431              
    4432              
    4433              $C$DW$T$76      .dwtag  DW_TAG_structure_type
    4434                      .dwattr $C$DW$T$76, DW_AT_name("_USER_Params_")
    4435                      .dwattr $C$DW$T$76, DW_AT_byte_size(0xac)
    4436              $C$DW$465       .dwtag  DW_TAG_member
    4437                      .dwattr $C$DW$465, DW_AT_type(*$C$DW$T$54)
    4438                      .dwattr $C$DW$465, DW_AT_name("iqFullScaleCurrent_A")
    4439                      .dwattr $C$DW$465, DW_AT_TI_symbol_name("_iqFullScaleCurrent_A")
    4440                      .dwattr $C$DW$465, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    4441                      .dwattr $C$DW$465, DW_AT_accessibility(DW_ACCESS_public)
    4442              
    4443              $C$DW$466       .dwtag  DW_TAG_member
    4444                      .dwattr $C$DW$466, DW_AT_type(*$C$DW$T$54)
    4445                      .dwattr $C$DW$466, DW_AT_name("iqFullScaleVoltage_V")
    4446                      .dwattr $C$DW$466, DW_AT_TI_symbol_name("_iqFullScaleVoltage_V")
    4447                      .dwattr $C$DW$466, DW_AT_data_member_location[DW_OP_plus_uconst 0x2]
    4448                      .dwattr $C$DW$466, DW_AT_accessibility(DW_ACCESS_public)
    4449              
    4450              $C$DW$467       .dwtag  DW_TAG_member
    4451                      .dwattr $C$DW$467, DW_AT_type(*$C$DW$T$54)
    4452                      .dwattr $C$DW$467, DW_AT_name("iqFullScaleFreq_Hz")
    4453                      .dwattr $C$DW$467, DW_AT_TI_symbol_name("_iqFullScaleFreq_Hz")
    4454                      .dwattr $C$DW$467, DW_AT_data_member_location[DW_OP_plus_uconst 0x4]
    4455                      .dwattr $C$DW$467, DW_AT_accessibility(DW_ACCESS_public)
    4456              
    4457              $C$DW$468       .dwtag  DW_TAG_member
    4458                      .dwattr $C$DW$468, DW_AT_type(*$C$DW$T$53)
    4459                      .dwattr $C$DW$468, DW_AT_name("numIsrTicksPerCtrlTick")
    4460                      .dwattr $C$DW$468, DW_AT_TI_symbol_name("_numIsrTicksPerCtrlTick")
    4461                      .dwattr $C$DW$468, DW_AT_data_member_location[DW_OP_plus_uconst 0x6]
    4462                      .dwattr $C$DW$468, DW_AT_accessibility(DW_ACCESS_public)
    4463              
    4464              $C$DW$469       .dwtag  DW_TAG_member
    4465                      .dwattr $C$DW$469, DW_AT_type(*$C$DW$T$53)
    4466                      .dwattr $C$DW$469, DW_AT_name("numCtrlTicksPerCurrentTick")
    4467                      .dwattr $C$DW$469, DW_AT_TI_symbol_name("_numCtrlTicksPerCurrentTick")
    4468                      .dwattr $C$DW$469, DW_AT_data_member_location[DW_OP_plus_uconst 0x7]
    4469                      .dwattr $C$DW$469, DW_AT_accessibility(DW_ACCESS_public)
    4470              
    4471              $C$DW$470       .dwtag  DW_TAG_member
    4472                      .dwattr $C$DW$470, DW_AT_type(*$C$DW$T$53)
    4473                      .dwattr $C$DW$470, DW_AT_name("numCtrlTicksPerEstTick")
    4474                      .dwattr $C$DW$470, DW_AT_TI_symbol_name("_numCtrlTicksPerEstTick")
    4475                      .dwattr $C$DW$470, DW_AT_data_member_location[DW_OP_plus_uconst 0x8]
    4476                      .dwattr $C$DW$470, DW_AT_accessibility(DW_ACCESS_public)
    4477              
    4478              $C$DW$471       .dwtag  DW_TAG_member
    4479                      .dwattr $C$DW$471, DW_AT_type(*$C$DW$T$53)
    4480                      .dwattr $C$DW$471, DW_AT_name("numCtrlTicksPerSpeedTick")
    4481                      .dwattr $C$DW$471, DW_AT_TI_symbol_name("_numCtrlTicksPerSpeedTick")
    4482                      .dwattr $C$DW$471, DW_AT_data_member_location[DW_OP_plus_uconst 0x9]
    4483                      .dwattr $C$DW$471, DW_AT_accessibility(DW_ACCESS_public)
TMS320C2000 Assembler PC v15.12.3 Tue Sep 12 21:32:38 2017

Tools Copyright (c) 1996-2015 Texas Instruments Incorporated
C:\Users\wmj\AppData\Local\Temp\2327210                              PAGE   87

    4484              
    4485              $C$DW$472       .dwtag  DW_TAG_member
    4486                      .dwattr $C$DW$472, DW_AT_type(*$C$DW$T$53)
    4487                      .dwattr $C$DW$472, DW_AT_name("numCtrlTicksPerTrajTick")
    4488                      .dwattr $C$DW$472, DW_AT_TI_symbol_name("_numCtrlTicksPerTrajTick")
    4489                      .dwattr $C$DW$472, DW_AT_data_member_location[DW_OP_plus_uconst 0xa]
    4490                      .dwattr $C$DW$472, DW_AT_accessibility(DW_ACCESS_public)
    4491              
    4492              $C$DW$473       .dwtag  DW_TAG_member
    4493                      .dwattr $C$DW$473, DW_AT_type(*$C$DW$T$22)
    4494                      .dwattr $C$DW$473, DW_AT_name("numCurrentSensors")
    4495                      .dwattr $C$DW$473, DW_AT_TI_symbol_name("_numCurrentSensors")
    4496                      .dwattr $C$DW$473, DW_AT_data_member_location[DW_OP_plus_uconst 0xb]
    4497                      .dwattr $C$DW$473, DW_AT_accessibility(DW_ACCESS_public)
    4498              
    4499              $C$DW$474       .dwtag  DW_TAG_member
    4500                      .dwattr $C$DW$474, DW_AT_type(*$C$DW$T$22)
    4501                      .dwattr $C$DW$474, DW_AT_name("numVoltageSensors")
    4502                      .dwattr $C$DW$474, DW_AT_TI_symbol_name("_numVoltageSensors")
    4503                      .dwattr $C$DW$474, DW_AT_data_member_location[DW_OP_plus_uconst 0xc]
    4504                      .dwattr $C$DW$474, DW_AT_accessibility(DW_ACCESS_public)
    4505              
    4506              $C$DW$475       .dwtag  DW_TAG_member
    4507                      .dwattr $C$DW$475, DW_AT_type(*$C$DW$T$54)
    4508                      .dwattr $C$DW$475, DW_AT_name("offsetPole_rps")
    4509                      .dwattr $C$DW$475, DW_AT_TI_symbol_name("_offsetPole_rps")
    4510                      .dwattr $C$DW$475, DW_AT_data_member_location[DW_OP_plus_uconst 0xe]
    4511                      .dwattr $C$DW$475, DW_AT_accessibility(DW_ACCESS_public)
    4512              
    4513              $C$DW$476       .dwtag  DW_TAG_member
    4514                      .dwattr $C$DW$476, DW_AT_type(*$C$DW$T$54)
    4515                      .dwattr $C$DW$476, DW_AT_name("fluxPole_rps")
    4516                      .dwattr $C$DW$476, DW_AT_TI_symbol_name("_fluxPole_rps")
    4517                      .dwattr $C$DW$476, DW_AT_data_member_location[DW_OP_plus_uconst 0x10]
    4518                      .dwattr $C$DW$476, DW_AT_accessibility(DW_ACCESS_public)
    4519              
    4520              $C$DW$477       .dwtag  DW_TAG_member
    4521                      .dwattr $C$DW$477, DW_AT_type(*$C$DW$T$54)
    4522                      .dwattr $C$DW$477, DW_AT_name("zeroSpeedLimit")
    4523                      .dwattr $C$DW$477, DW_AT_TI_symbol_name("_zeroSpeedLimit")
    4524                      .dwattr $C$DW$477, DW_AT_data_member_location[DW_OP_plus_uconst 0x12]
    4525                      .dwattr $C$DW$477, DW_AT_accessibility(DW_ACCESS_public)
    4526              
    4527              $C$DW$478       .dwtag  DW_TAG_member
    4528                      .dwattr $C$DW$478, DW_AT_type(*$C$DW$T$54)
    4529                      .dwattr $C$DW$478, DW_AT_name("forceAngleFreq_Hz")
    4530                      .dwattr $C$DW$478, DW_AT_TI_symbol_name("_forceAngleFreq_Hz")
    4531                      .dwattr $C$DW$478, DW_AT_data_member_location[DW_OP_plus_uconst 0x14]
    4532                      .dwattr $C$DW$478, DW_AT_accessibility(DW_ACCESS_public)
    4533              
    4534              $C$DW$479       .dwtag  DW_TAG_member
    4535                      .dwattr $C$DW$479, DW_AT_type(*$C$DW$T$54)
    4536                      .dwattr $C$DW$479, DW_AT_name("maxAccel_Hzps")
    4537                      .dwattr $C$DW$479, DW_AT_TI_symbol_name("_maxAccel_Hzps")
    4538                      .dwattr $C$DW$479, DW_AT_data_member_location[DW_OP_plus_uconst 0x16]
TMS320C2000 Assembler PC v15.12.3 Tue Sep 12 21:32:38 2017

Tools Copyright (c) 1996-2015 Texas Instruments Incorporated
C:\Users\wmj\AppData\Local\Temp\2327210                              PAGE   88

    4539                      .dwattr $C$DW$479, DW_AT_accessibility(DW_ACCESS_public)
    4540              
    4541              $C$DW$480       .dwtag  DW_TAG_member
    4542                      .dwattr $C$DW$480, DW_AT_type(*$C$DW$T$54)
    4543                      .dwattr $C$DW$480, DW_AT_name("maxAccel_est_Hzps")
    4544                      .dwattr $C$DW$480, DW_AT_TI_symbol_name("_maxAccel_est_Hzps")
    4545                      .dwattr $C$DW$480, DW_AT_data_member_location[DW_OP_plus_uconst 0x18]
    4546                      .dwattr $C$DW$480, DW_AT_accessibility(DW_ACCESS_public)
    4547              
    4548              $C$DW$481       .dwtag  DW_TAG_member
    4549                      .dwattr $C$DW$481, DW_AT_type(*$C$DW$T$54)
    4550                      .dwattr $C$DW$481, DW_AT_name("directionPole_rps")
    4551                      .dwattr $C$DW$481, DW_AT_TI_symbol_name("_directionPole_rps")
    4552                      .dwattr $C$DW$481, DW_AT_data_member_location[DW_OP_plus_uconst 0x1a]
    4553                      .dwattr $C$DW$481, DW_AT_accessibility(DW_ACCESS_public)
    4554              
    4555              $C$DW$482       .dwtag  DW_TAG_member
    4556                      .dwattr $C$DW$482, DW_AT_type(*$C$DW$T$54)
    4557                      .dwattr $C$DW$482, DW_AT_name("speedPole_rps")
    4558                      .dwattr $C$DW$482, DW_AT_TI_symbol_name("_speedPole_rps")
    4559                      .dwattr $C$DW$482, DW_AT_data_member_location[DW_OP_plus_uconst 0x1c]
    4560                      .dwattr $C$DW$482, DW_AT_accessibility(DW_ACCESS_public)
    4561              
    4562              $C$DW$483       .dwtag  DW_TAG_member
    4563                      .dwattr $C$DW$483, DW_AT_type(*$C$DW$T$54)
    4564                      .dwattr $C$DW$483, DW_AT_name("dcBusPole_rps")
    4565                      .dwattr $C$DW$483, DW_AT_TI_symbol_name("_dcBusPole_rps")
    4566                      .dwattr $C$DW$483, DW_AT_data_member_location[DW_OP_plus_uconst 0x1e]
    4567                      .dwattr $C$DW$483, DW_AT_accessibility(DW_ACCESS_public)
    4568              
    4569              $C$DW$484       .dwtag  DW_TAG_member
    4570                      .dwattr $C$DW$484, DW_AT_type(*$C$DW$T$54)
    4571                      .dwattr $C$DW$484, DW_AT_name("fluxFraction")
    4572                      .dwattr $C$DW$484, DW_AT_TI_symbol_name("_fluxFraction")
    4573                      .dwattr $C$DW$484, DW_AT_data_member_location[DW_OP_plus_uconst 0x20]
    4574                      .dwattr $C$DW$484, DW_AT_accessibility(DW_ACCESS_public)
    4575              
    4576              $C$DW$485       .dwtag  DW_TAG_member
    4577                      .dwattr $C$DW$485, DW_AT_type(*$C$DW$T$54)
    4578                      .dwattr $C$DW$485, DW_AT_name("indEst_speedMaxFraction")
    4579                      .dwattr $C$DW$485, DW_AT_TI_symbol_name("_indEst_speedMaxFraction")
    4580                      .dwattr $C$DW$485, DW_AT_data_member_location[DW_OP_plus_uconst 0x22]
    4581                      .dwattr $C$DW$485, DW_AT_accessibility(DW_ACCESS_public)
    4582              
    4583              $C$DW$486       .dwtag  DW_TAG_member
    4584                      .dwattr $C$DW$486, DW_AT_type(*$C$DW$T$54)
    4585                      .dwattr $C$DW$486, DW_AT_name("powerWarpGain")
    4586                      .dwattr $C$DW$486, DW_AT_TI_symbol_name("_powerWarpGain")
    4587                      .dwattr $C$DW$486, DW_AT_data_member_location[DW_OP_plus_uconst 0x24]
    4588                      .dwattr $C$DW$486, DW_AT_accessibility(DW_ACCESS_public)
    4589              
    4590              $C$DW$487       .dwtag  DW_TAG_member
    4591                      .dwattr $C$DW$487, DW_AT_type(*$C$DW$T$53)
    4592                      .dwattr $C$DW$487, DW_AT_name("systemFreq_MHz")
    4593                      .dwattr $C$DW$487, DW_AT_TI_symbol_name("_systemFreq_MHz")
TMS320C2000 Assembler PC v15.12.3 Tue Sep 12 21:32:38 2017

Tools Copyright (c) 1996-2015 Texas Instruments Incorporated
C:\Users\wmj\AppData\Local\Temp\2327210                              PAGE   89

    4594                      .dwattr $C$DW$487, DW_AT_data_member_location[DW_OP_plus_uconst 0x26]
    4595                      .dwattr $C$DW$487, DW_AT_accessibility(DW_ACCESS_public)
    4596              
    4597              $C$DW$488       .dwtag  DW_TAG_member
    4598                      .dwattr $C$DW$488, DW_AT_type(*$C$DW$T$54)
    4599                      .dwattr $C$DW$488, DW_AT_name("pwmPeriod_usec")
    4600                      .dwattr $C$DW$488, DW_AT_TI_symbol_name("_pwmPeriod_usec")
    4601                      .dwattr $C$DW$488, DW_AT_data_member_location[DW_OP_plus_uconst 0x28]
    4602                      .dwattr $C$DW$488, DW_AT_accessibility(DW_ACCESS_public)
    4603              
    4604              $C$DW$489       .dwtag  DW_TAG_member
    4605                      .dwattr $C$DW$489, DW_AT_type(*$C$DW$T$54)
    4606                      .dwattr $C$DW$489, DW_AT_name("voltage_sf")
    4607                      .dwattr $C$DW$489, DW_AT_TI_symbol_name("_voltage_sf")
    4608                      .dwattr $C$DW$489, DW_AT_data_member_location[DW_OP_plus_uconst 0x2a]
    4609                      .dwattr $C$DW$489, DW_AT_accessibility(DW_ACCESS_public)
    4610              
    4611              $C$DW$490       .dwtag  DW_TAG_member
    4612                      .dwattr $C$DW$490, DW_AT_type(*$C$DW$T$54)
    4613                      .dwattr $C$DW$490, DW_AT_name("current_sf")
    4614                      .dwattr $C$DW$490, DW_AT_TI_symbol_name("_current_sf")
    4615                      .dwattr $C$DW$490, DW_AT_data_member_location[DW_OP_plus_uconst 0x2c]
    4616                      .dwattr $C$DW$490, DW_AT_accessibility(DW_ACCESS_public)
    4617              
    4618              $C$DW$491       .dwtag  DW_TAG_member
    4619                      .dwattr $C$DW$491, DW_AT_type(*$C$DW$T$54)
    4620                      .dwattr $C$DW$491, DW_AT_name("voltageFilterPole_rps")
    4621                      .dwattr $C$DW$491, DW_AT_TI_symbol_name("_voltageFilterPole_rps")
    4622                      .dwattr $C$DW$491, DW_AT_data_member_location[DW_OP_plus_uconst 0x2e]
    4623                      .dwattr $C$DW$491, DW_AT_accessibility(DW_ACCESS_public)
    4624              
    4625              $C$DW$492       .dwtag  DW_TAG_member
    4626                      .dwattr $C$DW$492, DW_AT_type(*$C$DW$T$54)
    4627                      .dwattr $C$DW$492, DW_AT_name("maxVsMag_pu")
    4628                      .dwattr $C$DW$492, DW_AT_TI_symbol_name("_maxVsMag_pu")
    4629                      .dwattr $C$DW$492, DW_AT_data_member_location[DW_OP_plus_uconst 0x30]
    4630                      .dwattr $C$DW$492, DW_AT_accessibility(DW_ACCESS_public)
    4631              
    4632              $C$DW$493       .dwtag  DW_TAG_member
    4633                      .dwattr $C$DW$493, DW_AT_type(*$C$DW$T$54)
    4634                      .dwattr $C$DW$493, DW_AT_name("estKappa")
    4635                      .dwattr $C$DW$493, DW_AT_TI_symbol_name("_estKappa")
    4636                      .dwattr $C$DW$493, DW_AT_data_member_location[DW_OP_plus_uconst 0x32]
    4637                      .dwattr $C$DW$493, DW_AT_accessibility(DW_ACCESS_public)
    4638              
    4639              $C$DW$494       .dwtag  DW_TAG_member
    4640                      .dwattr $C$DW$494, DW_AT_type(*$C$DW$T$65)
    4641                      .dwattr $C$DW$494, DW_AT_name("motor_type")
    4642                      .dwattr $C$DW$494, DW_AT_TI_symbol_name("_motor_type")
    4643                      .dwattr $C$DW$494, DW_AT_data_member_location[DW_OP_plus_uconst 0x34]
    4644                      .dwattr $C$DW$494, DW_AT_accessibility(DW_ACCESS_public)
    4645              
    4646              $C$DW$495       .dwtag  DW_TAG_member
    4647                      .dwattr $C$DW$495, DW_AT_type(*$C$DW$T$53)
    4648                      .dwattr $C$DW$495, DW_AT_name("motor_numPolePairs")
TMS320C2000 Assembler PC v15.12.3 Tue Sep 12 21:32:38 2017

Tools Copyright (c) 1996-2015 Texas Instruments Incorporated
C:\Users\wmj\AppData\Local\Temp\2327210                              PAGE   90

    4649                      .dwattr $C$DW$495, DW_AT_TI_symbol_name("_motor_numPolePairs")
    4650                      .dwattr $C$DW$495, DW_AT_data_member_location[DW_OP_plus_uconst 0x35]
    4651                      .dwattr $C$DW$495, DW_AT_accessibility(DW_ACCESS_public)
    4652              
    4653              $C$DW$496       .dwtag  DW_TAG_member
    4654                      .dwattr $C$DW$496, DW_AT_type(*$C$DW$T$54)
    4655                      .dwattr $C$DW$496, DW_AT_name("motor_ratedFlux")
    4656                      .dwattr $C$DW$496, DW_AT_TI_symbol_name("_motor_ratedFlux")
    4657                      .dwattr $C$DW$496, DW_AT_data_member_location[DW_OP_plus_uconst 0x36]
    4658                      .dwattr $C$DW$496, DW_AT_accessibility(DW_ACCESS_public)
    4659              
    4660              $C$DW$497       .dwtag  DW_TAG_member
    4661                      .dwattr $C$DW$497, DW_AT_type(*$C$DW$T$54)
    4662                      .dwattr $C$DW$497, DW_AT_name("motor_Rr")
    4663                      .dwattr $C$DW$497, DW_AT_TI_symbol_name("_motor_Rr")
    4664                      .dwattr $C$DW$497, DW_AT_data_member_location[DW_OP_plus_uconst 0x38]
    4665                      .dwattr $C$DW$497, DW_AT_accessibility(DW_ACCESS_public)
    4666              
    4667              $C$DW$498       .dwtag  DW_TAG_member
    4668                      .dwattr $C$DW$498, DW_AT_type(*$C$DW$T$54)
    4669                      .dwattr $C$DW$498, DW_AT_name("motor_Rs")
    4670                      .dwattr $C$DW$498, DW_AT_TI_symbol_name("_motor_Rs")
    4671                      .dwattr $C$DW$498, DW_AT_data_member_location[DW_OP_plus_uconst 0x3a]
    4672                      .dwattr $C$DW$498, DW_AT_accessibility(DW_ACCESS_public)
    4673              
    4674              $C$DW$499       .dwtag  DW_TAG_member
    4675                      .dwattr $C$DW$499, DW_AT_type(*$C$DW$T$54)
