TMS320C2000 Assembler PC v15.12.3 Mon Sep 25 12:51:20 2017

Tools Copyright (c) 1996-2015 Texas Instruments Incorporated
C:\Users\wmj\AppData\Local\Temp\0823212                              PAGE    1

       1              ;***************************************************************
       2              ;* TMS320C2000 C/C++ Codegen                   PC v15.12.3.LTS *
       3              ;* Date/Time created: Mon Sep 25 12:51:19 2017                 *
       4              ;***************************************************************
       5                      .compiler_opts --abi=coffabi --float_support=softlib --hll_source=on --mem_model:code=flat --mem_mode
       6        0002  FP      .set    XAR2
       7              
       8              $C$DW$CU        .dwtag  DW_TAG_compile_unit
       9                      .dwattr $C$DW$CU, DW_AT_name("D:/BM1000/sw/modules/user/src/32b/user.c")
      10                      .dwattr $C$DW$CU, DW_AT_producer("TI TMS320C2000 C/C++ Codegen PC v15.12.3.LTS Copyright (c) 1996-201
      11                      .dwattr $C$DW$CU, DW_AT_TI_version(0x01)
      12                      .dwattr $C$DW$CU, DW_AT_comp_dir("D:\BM1000\sw\solutions\instaspin_foc\boards\hvkit_rev1p1\f28x\f2802
      13              
      14              $C$DW$1 .dwtag  DW_TAG_subprogram
      15                      .dwattr $C$DW$1, DW_AT_name("CTRL_setGains")

C:\Users\wmj\AppData\Local\Temp\0823212                              PAGE  134

    6665                      .dwattr $C$DW$570, DW_AT_name("USER_ErrorCode_estFreq_Hz_High")
    6666                      .dwattr $C$DW$570, DW_AT_const_value(0x60)
    6667              
    6668              $C$DW$571       .dwtag  DW_TAG_enumerator
    6669                      .dwattr $C$DW$571, DW_AT_name("USER_ErrorCode_estFreq_Hz_Low")
    6670                      .dwattr $C$DW$571, DW_AT_const_value(0x61)
    6671              
    6672              $C$DW$572       .dwtag  DW_TAG_enumerator
    6673                      .dwattr $C$DW$572, DW_AT_name("USER_ErrorCode_RoverL_estFreq_Hz_High")
    6674                      .dwattr $C$DW$572, DW_AT_const_value(0x62)
    6675              
    6676              $C$DW$573       .dwtag  DW_TAG_enumerator
    6677                      .dwattr $C$DW$573, DW_AT_name("USER_ErrorCode_RoverL_estFreq_Hz_Low")
    6678                      .dwattr $C$DW$573, DW_AT_const_value(0x63)
    6679              
    6680              $C$DW$574       .dwtag  DW_TAG_enumerator
    6681                      .dwattr $C$DW$574, DW_AT_name("USER_ErrorCode_trajFreq_Hz_High")
    6682                      .dwattr $C$DW$574, DW_AT_const_value(0x64)
    6683              
    6684              $C$DW$575       .dwtag  DW_TAG_enumerator
    6685                      .dwattr $C$DW$575, DW_AT_name("USER_ErrorCode_trajFreq_Hz_Low")
    6686                      .dwattr $C$DW$575, DW_AT_const_value(0x65)
    6687              
    6688              $C$DW$576       .dwtag  DW_TAG_enumerator
    6689                      .dwattr $C$DW$576, DW_AT_name("USER_ErrorCode_ctrlPeriod_sec_High")
    6690                      .dwattr $C$DW$576, DW_AT_const_value(0x66)
    6691              
    6692              $C$DW$577       .dwtag  DW_TAG_enumerator
    6693                      .dwattr $C$DW$577, DW_AT_name("USER_ErrorCode_ctrlPeriod_sec_Low")
    6694                      .dwattr $C$DW$577, DW_AT_const_value(0x67)
    6695              
    6696              $C$DW$578       .dwtag  DW_TAG_enumerator
    6697                      .dwattr $C$DW$578, DW_AT_name("USER_ErrorCode_maxNegativeIdCurrent_a_High")
    6698                      .dwattr $C$DW$578, DW_AT_const_value(0x68)
    6699              
    6700              $C$DW$579       .dwtag  DW_TAG_enumerator
    6701                      .dwattr $C$DW$579, DW_AT_name("USER_ErrorCode_maxNegativeIdCurrent_a_Low")
    6702                      .dwattr $C$DW$579, DW_AT_const_value(0x69)
    6703              
    6704              $C$DW$580       .dwtag  DW_TAG_enumerator
    6705                      .dwattr $C$DW$580, DW_AT_name("USER_numErrorCodes")
    6706                      .dwattr $C$DW$580, DW_AT_const_value(0x6a)
    6707              
    6708                      .dwendtag $C$DW$T$78
    6709              
    6710              $C$DW$T$79      .dwtag  DW_TAG_typedef
    6711                      .dwattr $C$DW$T$79, DW_AT_name("USER_ErrorCode_e")
    6712                      .dwattr $C$DW$T$79, DW_AT_type(*$C$DW$T$78)
    6713                      .dwattr $C$DW$T$79, DW_AT_language(DW_LANG_C)
    6714              
    6715              $C$DW$581       .dwtag  DW_TAG_TI_far_type
    6716                      .dwattr $C$DW$581, DW_AT_type(*$C$DW$T$79)
    6717              
    6718              $C$DW$T$82      .dwtag  DW_TAG_const_type
    6719                      .dwattr $C$DW$T$82, DW_AT_type(*$C$DW$581)
TMS320C2000 Assembler PC v15.12.3 Mon Sep 25 12:51:20 2017

Tools Copyright (c) 1996-2015 Texas Instruments Incorporated
C:\Users\wmj\AppData\Local\Temp\0823212                              PAGE  135

    6720              
    6721              
    6722              $C$DW$T$87      .dwtag  DW_TAG_enumeration_type
    6723                      .dwattr $C$DW$T$87, DW_AT_byte_size(0x01)
    6724              $C$DW$582       .dwtag  DW_TAG_enumerator
    6725                      .dwattr $C$DW$582, DW_AT_name("CTRL_Type_PID_spd")
    6726                      .dwattr $C$DW$582, DW_AT_const_value(0x00)
    6727              
    6728              $C$DW$583       .dwtag  DW_TAG_enumerator
    6729                      .dwattr $C$DW$583, DW_AT_name("CTRL_Type_PID_Id")
    6730                      .dwattr $C$DW$583, DW_AT_const_value(0x01)
    6731              
    6732              $C$DW$584       .dwtag  DW_TAG_enumerator
    6733                      .dwattr $C$DW$584, DW_AT_name("CTRL_Type_PID_Iq")
    6734                      .dwattr $C$DW$584, DW_AT_const_value(0x02)
    6735              
    6736                      .dwendtag $C$DW$T$87
    6737              
    6738              $C$DW$T$88      .dwtag  DW_TAG_typedef
    6739                      .dwattr $C$DW$T$88, DW_AT_name("CTRL_Type_e")
    6740                      .dwattr $C$DW$T$88, DW_AT_type(*$C$DW$T$87)
    6741                      .dwattr $C$DW$T$88, DW_AT_language(DW_LANG_C)
    6742              
    6743              $C$DW$585       .dwtag  DW_TAG_TI_far_type
    6744                      .dwattr $C$DW$585, DW_AT_type(*$C$DW$T$88)
    6745              
    6746              $C$DW$T$89      .dwtag  DW_TAG_const_type
    6747                      .dwattr $C$DW$T$89, DW_AT_type(*$C$DW$585)
    6748              
    6749              
    6750              $C$DW$T$23      .dwtag  DW_TAG_structure_type
    6751                      .dwattr $C$DW$T$23, DW_AT_name("_BRAKE_Obj_")
    6752                      .dwattr $C$DW$T$23, DW_AT_byte_size(0x08)
    6753              $C$DW$586       .dwtag  DW_TAG_member
    6754                      .dwattr $C$DW$586, DW_AT_type(*$C$DW$T$20)
    6755                      .dwattr $C$DW$586, DW_AT_name("angle_pu")
    6756                      .dwattr $C$DW$586, DW_AT_TI_symbol_name("_angle_pu")
    6757                      .dwattr $C$DW$586, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    6758                      .dwattr $C$DW$586, DW_AT_accessibility(DW_ACCESS_public)
    6759              
    6760              $C$DW$587       .dwtag  DW_TAG_member
    6761                      .dwattr $C$DW$587, DW_AT_type(*$C$DW$T$21)
    6762                      .dwattr $C$DW$587, DW_AT_name("Idq_brake")
    6763                      .dwattr $C$DW$587, DW_AT_TI_symbol_name("_Idq_brake")
    6764                      .dwattr $C$DW$587, DW_AT_data_member_location[DW_OP_plus_uconst 0x2]
    6765                      .dwattr $C$DW$587, DW_AT_accessibility(DW_ACCESS_public)
    6766              
    6767              $C$DW$588       .dwtag  DW_TAG_member
    6768                      .dwattr $C$DW$588, DW_AT_type(*$C$DW$T$22)
    6769                      .dwattr $C$DW$588, DW_AT_name("brake_enable")
    6770                      .dwattr $C$DW$588, DW_AT_TI_symbol_name("_brake_enable")
    6771                      .dwattr $C$DW$588, DW_AT_data_member_location[DW_OP_plus_uconst 0x6]
    6772                      .dwattr $C$DW$588, DW_AT_accessibility(DW_ACCESS_public)
    6773              
    6774                      .dwendtag $C$DW$T$23
TMS320C2000 Assembler PC v15.12.3 Mon Sep 25 12:51:20 2017

Tools Copyright (c) 1996-2015 Texas Instruments Incorporated
C:\Users\wmj\AppData\Local\Temp\0823212                              PAGE  136

    6775              
    6776              $C$DW$T$60      .dwtag  DW_TAG_typedef
    6777                      .dwattr $C$DW$T$60, DW_AT_name("BRAKE_Obj")
    6778                      .dwattr $C$DW$T$60, DW_AT_type(*$C$DW$T$23)
    6779                      .dwattr $C$DW$T$60, DW_AT_language(DW_LANG_C)
    6780              
    6781              $C$DW$T$58      .dwtag  DW_TAG_pointer_type
    6782                      .dwattr $C$DW$T$58, DW_AT_type(*$C$DW$T$23)
    6783                      .dwattr $C$DW$T$58, DW_AT_address_class(0x20)
    6784              
    6785              $C$DW$T$59      .dwtag  DW_TAG_typedef
    6786                      .dwattr $C$DW$T$59, DW_AT_name("BRAKE_Handle")
    6787                      .dwattr $C$DW$T$59, DW_AT_type(*$C$DW$T$58)
    6788                      .dwattr $C$DW$T$59, DW_AT_language(DW_LANG_C)
    6789              
    6790              
    6791              $C$DW$T$26      .dwtag  DW_TAG_structure_type
    6792                      .dwattr $C$DW$T$26, DW_AT_name("_CLARKE_Obj_")
    6793                      .dwattr $C$DW$T$26, DW_AT_byte_size(0x06)
    6794              $C$DW$589       .dwtag  DW_TAG_member
    6795                      .dwattr $C$DW$589, DW_AT_type(*$C$DW$T$20)
    6796                      .dwattr $C$DW$589, DW_AT_name("alpha_sf")
    6797                      .dwattr $C$DW$589, DW_AT_TI_symbol_name("_alpha_sf")
    6798                      .dwattr $C$DW$589, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    6799                      .dwattr $C$DW$589, DW_AT_accessibility(DW_ACCESS_public)
    6800              
    6801              $C$DW$590       .dwtag  DW_TAG_member
    6802                      .dwattr $C$DW$590, DW_AT_type(*$C$DW$T$20)
    6803                      .dwattr $C$DW$590, DW_AT_name("beta_sf")
    6804                      .dwattr $C$DW$590, DW_AT_TI_symbol_name("_beta_sf")
    6805                      .dwattr $C$DW$590, DW_AT_data_member_location[DW_OP_plus_uconst 0x2]
    6806                      .dwattr $C$DW$590, DW_AT_accessibility(DW_ACCESS_public)
    6807              
    6808              $C$DW$591       .dwtag  DW_TAG_member
    6809                      .dwattr $C$DW$591, DW_AT_type(*$C$DW$T$25)
    6810                      .dwattr $C$DW$591, DW_AT_name("numSensors")
    6811                      .dwattr $C$DW$591, DW_AT_TI_symbol_name("_numSensors")
    6812                      .dwattr $C$DW$591, DW_AT_data_member_location[DW_OP_plus_uconst 0x4]
    6813                      .dwattr $C$DW$591, DW_AT_accessibility(DW_ACCESS_public)
    6814              
    6815                      .dwendtag $C$DW$T$26
    6816              
    6817              $C$DW$T$34      .dwtag  DW_TAG_typedef
    6818                      .dwattr $C$DW$T$34, DW_AT_name("CLARKE_Obj")
    6819                      .dwattr $C$DW$T$34, DW_AT_type(*$C$DW$T$26)
    6820                      .dwattr $C$DW$T$34, DW_AT_language(DW_LANG_C)
    6821              
    6822              $C$DW$T$32      .dwtag  DW_TAG_pointer_type
    6823                      .dwattr $C$DW$T$32, DW_AT_type(*$C$DW$T$26)
    6824                      .dwattr $C$DW$T$32, DW_AT_address_class(0x20)
    6825              
    6826              $C$DW$T$33      .dwtag  DW_TAG_typedef
    6827                      .dwattr $C$DW$T$33, DW_AT_name("CLARKE_Handle")
    6828                      .dwattr $C$DW$T$33, DW_AT_type(*$C$DW$T$32)
    6829                      .dwattr $C$DW$T$33, DW_AT_language(DW_LANG_C)
TMS320C2000 Assembler PC v15.12.3 Mon Sep 25 12:51:20 2017

Tools Copyright (c) 1996-2015 Texas Instruments Incorporated
C:\Users\wmj\AppData\Local\Temp\0823212                              PAGE  137

    6830              
    6831              
    6832              $C$DW$T$61      .dwtag  DW_TAG_structure_type
    6833                      .dwattr $C$DW$T$61, DW_AT_name("_CTRL_Obj_")
    6834                      .dwattr $C$DW$T$61, DW_AT_byte_size(0x112)
    6835              $C$DW$592       .dwtag  DW_TAG_member
    6836                      .dwattr $C$DW$592, DW_AT_type(*$C$DW$T$27)
    6837                      .dwattr $C$DW$592, DW_AT_name("version")
    6838                      .dwattr $C$DW$592, DW_AT_TI_symbol_name("_version")
    6839                      .dwattr $C$DW$592, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    6840                      .dwattr $C$DW$592, DW_AT_accessibility(DW_ACCESS_public)
    6841              
    6842              $C$DW$593       .dwtag  DW_TAG_member
    6843                      .dwattr $C$DW$593, DW_AT_type(*$C$DW$T$29)
    6844                      .dwattr $C$DW$593, DW_AT_name("state")
    6845                      .dwattr $C$DW$593, DW_AT_TI_symbol_name("_state")
    6846                      .dwattr $C$DW$593, DW_AT_data_member_location[DW_OP_plus_uconst 0x4]
    6847                      .dwattr $C$DW$593, DW_AT_accessibility(DW_ACCESS_public)
    6848              
    6849              $C$DW$594       .dwtag  DW_TAG_member
    6850                      .dwattr $C$DW$594, DW_AT_type(*$C$DW$T$29)
    6851                      .dwattr $C$DW$594, DW_AT_name("prevState")
    6852                      .dwattr $C$DW$594, DW_AT_TI_symbol_name("_prevState")
    6853                      .dwattr $C$DW$594, DW_AT_data_member_location[DW_OP_plus_uconst 0x5]
    6854                      .dwattr $C$DW$594, DW_AT_accessibility(DW_ACCESS_public)
    6855              
    6856              $C$DW$595       .dwtag  DW_TAG_member
    6857                      .dwattr $C$DW$595, DW_AT_type(*$C$DW$T$31)
    6858                      .dwattr $C$DW$595, DW_AT_name("errorCode")
    6859                      .dwattr $C$DW$595, DW_AT_TI_symbol_name("_errorCode")
    6860                      .dwattr $C$DW$595, DW_AT_data_member_location[DW_OP_plus_uconst 0x6]
    6861                      .dwattr $C$DW$595, DW_AT_accessibility(DW_ACCESS_public)
    6862              
    6863              $C$DW$596       .dwtag  DW_TAG_member
    6864                      .dwattr $C$DW$596, DW_AT_type(*$C$DW$T$33)
    6865                      .dwattr $C$DW$596, DW_AT_name("clarkeHandle_I")
    6866                      .dwattr $C$DW$596, DW_AT_TI_symbol_name("_clarkeHandle_I")
    6867                      .dwattr $C$DW$596, DW_AT_data_member_location[DW_OP_plus_uconst 0x8]
    6868                      .dwattr $C$DW$596, DW_AT_accessibility(DW_ACCESS_public)
    6869              
    6870              $C$DW$597       .dwtag  DW_TAG_member
    6871                      .dwattr $C$DW$597, DW_AT_type(*$C$DW$T$34)
    6872                      .dwattr $C$DW$597, DW_AT_name("clarke_I")
    6873                      .dwattr $C$DW$597, DW_AT_TI_symbol_name("_clarke_I")
    6874                      .dwattr $C$DW$597, DW_AT_data_member_location[DW_OP_plus_uconst 0xa]
    6875                      .dwattr $C$DW$597, DW_AT_accessibility(DW_ACCESS_public)
    6876              
    6877              $C$DW$598       .dwtag  DW_TAG_member
    6878                      .dwattr $C$DW$598, DW_AT_type(*$C$DW$T$33)
    6879                      .dwattr $C$DW$598, DW_AT_name("clarkeHandle_V")
    6880                      .dwattr $C$DW$598, DW_AT_TI_symbol_name("_clarkeHandle_V")
    6881                      .dwattr $C$DW$598, DW_AT_data_member_location[DW_OP_plus_uconst 0x10]
    6882                      .dwattr $C$DW$598, DW_AT_accessibility(DW_ACCESS_public)
    6883              
    6884              $C$DW$599       .dwtag  DW_TAG_member
TMS320C2000 Assembler PC v15.12.3 Mon Sep 25 12:51:20 2017

Tools Copyright (c) 1996-2015 Texas Instruments Incorporated
C:\Users\wmj\AppData\Local\Temp\0823212                              PAGE  138

    6885                      .dwattr $C$DW$599, DW_AT_type(*$C$DW$T$34)
    6886                      .dwattr $C$DW$599, DW_AT_name("clarke_V")
    6887                      .dwattr $C$DW$599, DW_AT_TI_symbol_name("_clarke_V")
    6888                      .dwattr $C$DW$599, DW_AT_data_member_location[DW_OP_plus_uconst 0x12]
    6889                      .dwattr $C$DW$599, DW_AT_accessibility(DW_ACCESS_public)
    6890              
    6891              $C$DW$600       .dwtag  DW_TAG_member
    6892                      .dwattr $C$DW$600, DW_AT_type(*$C$DW$T$36)
    6893                      .dwattr $C$DW$600, DW_AT_name("estHandle")
    6894                      .dwattr $C$DW$600, DW_AT_TI_symbol_name("_estHandle")
    6895                      .dwattr $C$DW$600, DW_AT_data_member_location[DW_OP_plus_uconst 0x18]
    6896                      .dwattr $C$DW$600, DW_AT_accessibility(DW_ACCESS_public)
    6897              
    6898              $C$DW$601       .dwtag  DW_TAG_member
    6899                      .dwattr $C$DW$601, DW_AT_type(*$C$DW$T$38)
    6900                      .dwattr $C$DW$601, DW_AT_name("parkHandle")
    6901                      .dwattr $C$DW$601, DW_AT_TI_symbol_name("_parkHandle")
    6902                      .dwattr $C$DW$601, DW_AT_data_member_location[DW_OP_plus_uconst 0x1a]
    6903                      .dwattr $C$DW$601, DW_AT_accessibility(DW_ACCESS_public)
    6904              
    6905              $C$DW$602       .dwtag  DW_TAG_member
    6906                      .dwattr $C$DW$602, DW_AT_type(*$C$DW$T$39)
    6907                      .dwattr $C$DW$602, DW_AT_name("park")
    6908                      .dwattr $C$DW$602, DW_AT_TI_symbol_name("_park")
    6909                      .dwattr $C$DW$602, DW_AT_data_member_location[DW_OP_plus_uconst 0x1c]
    6910                      .dwattr $C$DW$602, DW_AT_accessibility(DW_ACCESS_public)
    6911              
    6912              $C$DW$603       .dwtag  DW_TAG_member
    6913                      .dwattr $C$DW$603, DW_AT_type(*$C$DW$T$41)
    6914                      .dwattr $C$DW$603, DW_AT_name("pidHandle_Id")
    6915                      .dwattr $C$DW$603, DW_AT_TI_symbol_name("_pidHandle_Id")
    6916                      .dwattr $C$DW$603, DW_AT_data_member_location[DW_OP_plus_uconst 0x20]
    6917                      .dwattr $C$DW$603, DW_AT_accessibility(DW_ACCESS_public)
    6918              
    6919              $C$DW$604       .dwtag  DW_TAG_member
    6920                      .dwattr $C$DW$604, DW_AT_type(*$C$DW$T$42)
    6921                      .dwattr $C$DW$604, DW_AT_name("pid_Id")
    6922                      .dwattr $C$DW$604, DW_AT_TI_symbol_name("_pid_Id")
    6923                      .dwattr $C$DW$604, DW_AT_data_member_location[DW_OP_plus_uconst 0x22]
    6924                      .dwattr $C$DW$604, DW_AT_accessibility(DW_ACCESS_public)
    6925              
    6926              $C$DW$605       .dwtag  DW_TAG_member
    6927                      .dwattr $C$DW$605, DW_AT_type(*$C$DW$T$41)
    6928                      .dwattr $C$DW$605, DW_AT_name("pidHandle_Iq")
    6929                      .dwattr $C$DW$605, DW_AT_TI_symbol_name("_pidHandle_Iq")
    6930                      .dwattr $C$DW$605, DW_AT_data_member_location[DW_OP_plus_uconst 0x32]
    6931                      .dwattr $C$DW$605, DW_AT_accessibility(DW_ACCESS_public)
    6932              
    6933              $C$DW$606       .dwtag  DW_TAG_member
    6934                      .dwattr $C$DW$606, DW_AT_type(*$C$DW$T$42)
    6935                      .dwattr $C$DW$606, DW_AT_name("pid_Iq")
    6936                      .dwattr $C$DW$606, DW_AT_TI_symbol_name("_pid_Iq")
    6937                      .dwattr $C$DW$606, DW_AT_data_member_location[DW_OP_plus_uconst 0x34]
    6938                      .dwattr $C$DW$606, DW_AT_accessibility(DW_ACCESS_public)
    6939              
TMS320C2000 Assembler PC v15.12.3 Mon Sep 25 12:51:20 2017

Tools Copyright (c) 1996-2015 Texas Instruments Incorporated
C:\Users\wmj\AppData\Local\Temp\0823212                              PAGE  139

    6940              $C$DW$607       .dwtag  DW_TAG_member
    6941                      .dwattr $C$DW$607, DW_AT_type(*$C$DW$T$41)
    6942                      .dwattr $C$DW$607, DW_AT_name("pidHandle_spd")
    6943                      .dwattr $C$DW$607, DW_AT_TI_symbol_name("_pidHandle_spd")
    6944                      .dwattr $C$DW$607, DW_AT_data_member_location[DW_OP_plus_uconst 0x44]
    6945                      .dwattr $C$DW$607, DW_AT_accessibility(DW_ACCESS_public)
    6946              
    6947              $C$DW$608       .dwtag  DW_TAG_member
    6948                      .dwattr $C$DW$608, DW_AT_type(*$C$DW$T$42)
    6949                      .dwattr $C$DW$608, DW_AT_name("pid_spd")
    6950                      .dwattr $C$DW$608, DW_AT_TI_symbol_name("_pid_spd")
    6951                      .dwattr $C$DW$608, DW_AT_data_member_location[DW_OP_plus_uconst 0x46]
    6952                      .dwattr $C$DW$608, DW_AT_accessibility(DW_ACCESS_public)
    6953              
    6954              $C$DW$609       .dwtag  DW_TAG_member
    6955                      .dwattr $C$DW$609, DW_AT_type(*$C$DW$T$44)
    6956                      .dwattr $C$DW$609, DW_AT_name("iparkHandle")
    6957                      .dwattr $C$DW$609, DW_AT_TI_symbol_name("_iparkHandle")
    6958                      .dwattr $C$DW$609, DW_AT_data_member_location[DW_OP_plus_uconst 0x56]
    6959                      .dwattr $C$DW$609, DW_AT_accessibility(DW_ACCESS_public)
    6960              
    6961              $C$DW$610       .dwtag  DW_TAG_member
    6962                      .dwattr $C$DW$610, DW_AT_type(*$C$DW$T$45)
    6963                      .dwattr $C$DW$610, DW_AT_name("ipark")
    6964                      .dwattr $C$DW$610, DW_AT_TI_symbol_name("_ipark")
    6965                      .dwattr $C$DW$610, DW_AT_data_member_location[DW_OP_plus_uconst 0x58]
    6966                      .dwattr $C$DW$610, DW_AT_accessibility(DW_ACCESS_public)
    6967              
    6968              $C$DW$611       .dwtag  DW_TAG_member
    6969                      .dwattr $C$DW$611, DW_AT_type(*$C$DW$T$47)
    6970                      .dwattr $C$DW$611, DW_AT_name("svgenHandle")
    6971                      .dwattr $C$DW$611, DW_AT_TI_symbol_name("_svgenHandle")
    6972                      .dwattr $C$DW$611, DW_AT_data_member_location[DW_OP_plus_uconst 0x5c]
    6973                      .dwattr $C$DW$611, DW_AT_accessibility(DW_ACCESS_public)
    6974              
    6975              $C$DW$612       .dwtag  DW_TAG_member
    6976                      .dwattr $C$DW$612, DW_AT_type(*$C$DW$T$48)
    6977                      .dwattr $C$DW$612, DW_AT_name("svgen")
    6978                      .dwattr $C$DW$612, DW_AT_TI_symbol_name("_svgen")
    6979                      .dwattr $C$DW$612, DW_AT_data_member_location[DW_OP_plus_uconst 0x5e]
    6980                      .dwattr $C$DW$612, DW_AT_accessibility(DW_ACCESS_public)
    6981              
    6982              $C$DW$613       .dwtag  DW_TAG_member
    6983                      .dwattr $C$DW$613, DW_AT_type(*$C$DW$T$50)
    6984                      .dwattr $C$DW$613, DW_AT_name("trajHandle_Id")
    6985                      .dwattr $C$DW$613, DW_AT_TI_symbol_name("_trajHandle_Id")
    6986                      .dwattr $C$DW$613, DW_AT_data_member_location[DW_OP_plus_uconst 0x60]
    6987                      .dwattr $C$DW$613, DW_AT_accessibility(DW_ACCESS_public)
    6988              
    6989              $C$DW$614       .dwtag  DW_TAG_member
    6990                      .dwattr $C$DW$614, DW_AT_type(*$C$DW$T$51)
    6991                      .dwattr $C$DW$614, DW_AT_name("traj_Id")
    6992                      .dwattr $C$DW$614, DW_AT_TI_symbol_name("_traj_Id")
    6993                      .dwattr $C$DW$614, DW_AT_data_member_location[DW_OP_plus_uconst 0x62]
    6994                      .dwattr $C$DW$614, DW_AT_accessibility(DW_ACCESS_public)
TMS320C2000 Assembler PC v15.12.3 Mon Sep 25 12:51:20 2017

Tools Copyright (c) 1996-2015 Texas Instruments Incorporated
C:\Users\wmj\AppData\Local\Temp\0823212                              PAGE  140

    6995              
    6996              $C$DW$615       .dwtag  DW_TAG_member
    6997                      .dwattr $C$DW$615, DW_AT_type(*$C$DW$T$50)
    6998                      .dwattr $C$DW$615, DW_AT_name("trajHandle_spd")
    6999                      .dwattr $C$DW$615, DW_AT_TI_symbol_name("_trajHandle_spd")
    7000                      .dwattr $C$DW$615, DW_AT_data_member_location[DW_OP_plus_uconst 0x6c]
    7001                      .dwattr $C$DW$615, DW_AT_accessibility(DW_ACCESS_public)
    7002              
    7003              $C$DW$616       .dwtag  DW_TAG_member
    7004                      .dwattr $C$DW$616, DW_AT_type(*$C$DW$T$51)
    7005                      .dwattr $C$DW$616, DW_AT_name("traj_spd")
    7006                      .dwattr $C$DW$616, DW_AT_TI_symbol_name("_traj_spd")
    7007                      .dwattr $C$DW$616, DW_AT_data_member_location[DW_OP_plus_uconst 0x6e]
    7008                      .dwattr $C$DW$616, DW_AT_accessibility(DW_ACCESS_public)
    7009              
    7010              $C$DW$617       .dwtag  DW_TAG_member
    7011                      .dwattr $C$DW$617, DW_AT_type(*$C$DW$T$50)
    7012                      .dwattr $C$DW$617, DW_AT_name("trajHandle_spdMax")
    7013                      .dwattr $C$DW$617, DW_AT_TI_symbol_name("_trajHandle_spdMax")
    7014                      .dwattr $C$DW$617, DW_AT_data_member_location[DW_OP_plus_uconst 0x78]
    7015                      .dwattr $C$DW$617, DW_AT_accessibility(DW_ACCESS_public)
    7016              
    7017              $C$DW$618       .dwtag  DW_TAG_member
    7018                      .dwattr $C$DW$618, DW_AT_type(*$C$DW$T$51)
    7019                      .dwattr $C$DW$618, DW_AT_name("traj_spdMax")
    7020                      .dwattr $C$DW$618, DW_AT_TI_symbol_name("_traj_spdMax")
    7021                      .dwattr $C$DW$618, DW_AT_data_member_location[DW_OP_plus_uconst 0x7a]
    7022                      .dwattr $C$DW$618, DW_AT_accessibility(DW_ACCESS_public)
    7023              
    7024              $C$DW$619       .dwtag  DW_TAG_member
    7025                      .dwattr $C$DW$619, DW_AT_type(*$C$DW$T$52)
    7026                      .dwattr $C$DW$619, DW_AT_name("motorParams")
    7027                      .dwattr $C$DW$619, DW_AT_TI_symbol_name("_motorParams")
    7028                      .dwattr $C$DW$619, DW_AT_data_member_location[DW_OP_plus_uconst 0x84]
    7029                      .dwattr $C$DW$619, DW_AT_accessibility(DW_ACCESS_public)
    7030              
    7031              $C$DW$620       .dwtag  DW_TAG_member
    7032                      .dwattr $C$DW$620, DW_AT_type(*$C$DW$T$55)
    7033                      .dwattr $C$DW$620, DW_AT_name("waitTimes")
    7034                      .dwattr $C$DW$620, DW_AT_TI_symbol_name("_waitTimes")
    7035                      .dwattr $C$DW$620, DW_AT_data_member_location[DW_OP_plus_uconst 0x92]
    7036                      .dwattr $C$DW$620, DW_AT_accessibility(DW_ACCESS_public)
    7037              
    7038              $C$DW$621       .dwtag  DW_TAG_member
    7039                      .dwattr $C$DW$621, DW_AT_type(*$C$DW$T$54)
    7040                      .dwattr $C$DW$621, DW_AT_name("counter_state")
    7041                      .dwattr $C$DW$621, DW_AT_TI_symbol_name("_counter_state")
    7042                      .dwattr $C$DW$621, DW_AT_data_member_location[DW_OP_plus_uconst 0x9a]
    7043                      .dwattr $C$DW$621, DW_AT_accessibility(DW_ACCESS_public)
    7044              
    7045              $C$DW$622       .dwtag  DW_TAG_member
    7046                      .dwattr $C$DW$622, DW_AT_type(*$C$DW$T$56)
    7047                      .dwattr $C$DW$622, DW_AT_name("numIsrTicksPerCtrlTick")
    7048                      .dwattr $C$DW$622, DW_AT_TI_symbol_name("_numIsrTicksPerCtrlTick")
    7049                      .dwattr $C$DW$622, DW_AT_data_member_location[DW_OP_plus_uconst 0x9c]
TMS320C2000 Assembler PC v15.12.3 Mon Sep 25 12:51:20 2017

Tools Copyright (c) 1996-2015 Texas Instruments Incorporated
C:\Users\wmj\AppData\Local\Temp\0823212                              PAGE  141

    7050                      .dwattr $C$DW$622, DW_AT_accessibility(DW_ACCESS_public)
    7051              
    7052              $C$DW$623       .dwtag  DW_TAG_member
    7053                      .dwattr $C$DW$623, DW_AT_type(*$C$DW$T$56)
    7054                      .dwattr $C$DW$623, DW_AT_name("numCtrlTicksPerCurrentTick")
    7055                      .dwattr $C$DW$623, DW_AT_TI_symbol_name("_numCtrlTicksPerCurrentTick")
    7056                      .dwattr $C$DW$623, DW_AT_data_member_location[DW_OP_plus_uconst 0x9d]
    7057                      .dwattr $C$DW$623, DW_AT_accessibility(DW_ACCESS_public)
    7058              
    7059              $C$DW$624       .dwtag  DW_TAG_member
    7060                      .dwattr $C$DW$624, DW_AT_type(*$C$DW$T$56)
    7061                      .dwattr $C$DW$624, DW_AT_name("numCtrlTicksPerSpeedTick")
    7062                      .dwattr $C$DW$624, DW_AT_TI_symbol_name("_numCtrlTicksPerSpeedTick")
    7063                      .dwattr $C$DW$624, DW_AT_data_member_location[DW_OP_plus_uconst 0x9e]
    7064                      .dwattr $C$DW$624, DW_AT_accessibility(DW_ACCESS_public)
    7065              
    7066              $C$DW$625       .dwtag  DW_TAG_member
    7067                      .dwattr $C$DW$625, DW_AT_type(*$C$DW$T$56)
    7068                      .dwattr $C$DW$625, DW_AT_name("numCtrlTicksPerTrajTick")
    7069                      .dwattr $C$DW$625, DW_AT_TI_symbol_name("_numCtrlTicksPerTrajTick")
    7070                      .dwattr $C$DW$625, DW_AT_data_member_location[DW_OP_plus_uconst 0x9f]
    7071                      .dwattr $C$DW$625, DW_AT_accessibility(DW_ACCESS_public)
    7072              
    7073              $C$DW$626       .dwtag  DW_TAG_member
    7074                      .dwattr $C$DW$626, DW_AT_type(*$C$DW$T$54)
    7075                      .dwattr $C$DW$626, DW_AT_name("ctrlFreq_Hz")
    7076                      .dwattr $C$DW$626, DW_AT_TI_symbol_name("_ctrlFreq_Hz")
    7077                      .dwattr $C$DW$626, DW_AT_data_member_location[DW_OP_plus_uconst 0xa0]
    7078                      .dwattr $C$DW$626, DW_AT_accessibility(DW_ACCESS_public)
    7079              
    7080              $C$DW$627       .dwtag  DW_TAG_member
    7081                      .dwattr $C$DW$627, DW_AT_type(*$C$DW$T$54)
    7082                      .dwattr $C$DW$627, DW_AT_name("trajFreq_Hz")
    7083                      .dwattr $C$DW$627, DW_AT_TI_symbol_name("_trajFreq_Hz")
    7084                      .dwattr $C$DW$627, DW_AT_data_member_location[DW_OP_plus_uconst 0xa2]
    7085                      .dwattr $C$DW$627, DW_AT_accessibility(DW_ACCESS_public)
    7086              
    7087              $C$DW$628       .dwtag  DW_TAG_member
    7088                      .dwattr $C$DW$628, DW_AT_type(*$C$DW$T$20)
    7089                      .dwattr $C$DW$628, DW_AT_name("trajPeriod_sec")
    7090                      .dwattr $C$DW$628, DW_AT_TI_symbol_name("_trajPeriod_sec")
    7091                      .dwattr $C$DW$628, DW_AT_data_member_location[DW_OP_plus_uconst 0xa4]
    7092                      .dwattr $C$DW$628, DW_AT_accessibility(DW_ACCESS_public)
    7093              
    7094              $C$DW$629       .dwtag  DW_TAG_member
    7095                      .dwattr $C$DW$629, DW_AT_type(*$C$DW$T$57)
    7096                      .dwattr $C$DW$629, DW_AT_name("ctrlPeriod_sec")
    7097                      .dwattr $C$DW$629, DW_AT_TI_symbol_name("_ctrlPeriod_sec")
    7098                      .dwattr $C$DW$629, DW_AT_data_member_location[DW_OP_plus_uconst 0xa6]
    7099                      .dwattr $C$DW$629, DW_AT_accessibility(DW_ACCESS_public)
    7100              
    7101              $C$DW$630       .dwtag  DW_TAG_member
    7102                      .dwattr $C$DW$630, DW_AT_type(*$C$DW$T$20)
    7103                      .dwattr $C$DW$630, DW_AT_name("maxVsMag_pu")
    7104                      .dwattr $C$DW$630, DW_AT_TI_symbol_name("_maxVsMag_pu")
TMS320C2000 Assembler PC v15.12.3 Mon Sep 25 12:51:20 2017

Tools Copyright (c) 1996-2015 Texas Instruments Incorporated
C:\Users\wmj\AppData\Local\Temp\0823212                              PAGE  142

    7105                      .dwattr $C$DW$630, DW_AT_data_member_location[DW_OP_plus_uconst 0xa8]
    7106                      .dwattr $C$DW$630, DW_AT_accessibility(DW_ACCESS_public)
    7107              
    7108              $C$DW$631       .dwtag  DW_TAG_member
    7109                      .dwattr $C$DW$631, DW_AT_type(*$C$DW$T$21)
    7110                      .dwattr $C$DW$631, DW_AT_name("Iab_in")
    7111                      .dwattr $C$DW$631, DW_AT_TI_symbol_name("_Iab_in")
    7112                      .dwattr $C$DW$631, DW_AT_data_member_location[DW_OP_plus_uconst 0xaa]
    7113                      .dwattr $C$DW$631, DW_AT_accessibility(DW_ACCESS_public)
    7114              
    7115              $C$DW$632       .dwtag  DW_TAG_member
    7116                      .dwattr $C$DW$632, DW_AT_type(*$C$DW$T$21)
    7117                      .dwattr $C$DW$632, DW_AT_name("Iab_filt")
    7118                      .dwattr $C$DW$632, DW_AT_TI_symbol_name("_Iab_filt")
    7119                      .dwattr $C$DW$632, DW_AT_data_member_location[DW_OP_plus_uconst 0xae]
    7120                      .dwattr $C$DW$632, DW_AT_accessibility(DW_ACCESS_public)
    7121              
    7122              $C$DW$633       .dwtag  DW_TAG_member
    7123                      .dwattr $C$DW$633, DW_AT_type(*$C$DW$T$21)
    7124                      .dwattr $C$DW$633, DW_AT_name("Idq_in")
    7125                      .dwattr $C$DW$633, DW_AT_TI_symbol_name("_Idq_in")
    7126                      .dwattr $C$DW$633, DW_AT_data_member_location[DW_OP_plus_uconst 0xb2]
    7127                      .dwattr $C$DW$633, DW_AT_accessibility(DW_ACCESS_public)
    7128              
    7129              $C$DW$634       .dwtag  DW_TAG_member
    7130                      .dwattr $C$DW$634, DW_AT_type(*$C$DW$T$21)
    7131                      .dwattr $C$DW$634, DW_AT_name("Vab_in")
    7132                      .dwattr $C$DW$634, DW_AT_TI_symbol_name("_Vab_in")
    7133                      .dwattr $C$DW$634, DW_AT_data_member_location[DW_OP_plus_uconst 0xb6]
    7134                      .dwattr $C$DW$634, DW_AT_accessibility(DW_ACCESS_public)
    7135              
    7136              $C$DW$635       .dwtag  DW_TAG_member
    7137                      .dwattr $C$DW$635, DW_AT_type(*$C$DW$T$20)
    7138                      .dwattr $C$DW$635, DW_AT_name("spd_out")
    7139                      .dwattr $C$DW$635, DW_AT_TI_symbol_name("_spd_out")
    7140                      .dwattr $C$DW$635, DW_AT_data_member_location[DW_OP_plus_uconst 0xba]
    7141                      .dwattr $C$DW$635, DW_AT_accessibility(DW_ACCESS_public)
    7142              
    7143              $C$DW$636       .dwtag  DW_TAG_member
    7144                      .dwattr $C$DW$636, DW_AT_type(*$C$DW$T$21)
    7145                      .dwattr $C$DW$636, DW_AT_name("Vab_out")
    7146                      .dwattr $C$DW$636, DW_AT_TI_symbol_name("_Vab_out")
    7147                      .dwattr $C$DW$636, DW_AT_data_member_location[DW_OP_plus_uconst 0xbc]
    7148                      .dwattr $C$DW$636, DW_AT_accessibility(DW_ACCESS_public)
    7149              
    7150              $C$DW$637       .dwtag  DW_TAG_member
    7151                      .dwattr $C$DW$637, DW_AT_type(*$C$DW$T$21)
    7152                      .dwattr $C$DW$637, DW_AT_name("Vdq_out")
    7153                      .dwattr $C$DW$637, DW_AT_TI_symbol_name("_Vdq_out")
    7154                      .dwattr $C$DW$637, DW_AT_data_member_location[DW_OP_plus_uconst 0xc0]
    7155                      .dwattr $C$DW$637, DW_AT_accessibility(DW_ACCESS_public)
    7156              
    7157              $C$DW$638       .dwtag  DW_TAG_member
    7158                      .dwattr $C$DW$638, DW_AT_type(*$C$DW$T$57)
    7159                      .dwattr $C$DW$638, DW_AT_name("Rhf")
TMS320C2000 Assembler PC v15.12.3 Mon Sep 25 12:51:20 2017

Tools Copyright (c) 1996-2015 Texas Instruments Incorporated
C:\Users\wmj\AppData\Local\Temp\0823212                              PAGE  143

    7160                      .dwattr $C$DW$638, DW_AT_TI_symbol_name("_Rhf")
    7161                      .dwattr $C$DW$638, DW_AT_data_member_location[DW_OP_plus_uconst 0xc4]
    7162                      .dwattr $C$DW$638, DW_AT_accessibility(DW_ACCESS_public)
    7163              
    7164              $C$DW$639       .dwtag  DW_TAG_member
    7165                      .dwattr $C$DW$639, DW_AT_type(*$C$DW$T$57)
    7166                      .dwattr $C$DW$639, DW_AT_name("Lhf")
    7167                      .dwattr $C$DW$639, DW_AT_TI_symbol_name("_Lhf")
    7168                      .dwattr $C$DW$639, DW_AT_data_member_location[DW_OP_plus_uconst 0xc6]
    7169                      .dwattr $C$DW$639, DW_AT_accessibility(DW_ACCESS_public)
    7170              
    7171              $C$DW$640       .dwtag  DW_TAG_member
    7172                      .dwattr $C$DW$640, DW_AT_type(*$C$DW$T$57)
    7173                      .dwattr $C$DW$640, DW_AT_name("RoverL")
    7174                      .dwattr $C$DW$640, DW_AT_TI_symbol_name("_RoverL")
    7175                      .dwattr $C$DW$640, DW_AT_data_member_location[DW_OP_plus_uconst 0xc8]
    7176                      .dwattr $C$DW$640, DW_AT_accessibility(DW_ACCESS_public)
    7177              
    7178              $C$DW$641       .dwtag  DW_TAG_member
    7179                      .dwattr $C$DW$641, DW_AT_type(*$C$DW$T$20)
    7180                      .dwattr $C$DW$641, DW_AT_name("Kp_Id")
    7181                      .dwattr $C$DW$641, DW_AT_TI_symbol_name("_Kp_Id")
    7182                      .dwattr $C$DW$641, DW_AT_data_member_location[DW_OP_plus_uconst 0xca]
    7183                      .dwattr $C$DW$641, DW_AT_accessibility(DW_ACCESS_public)
    7184              
    7185              $C$DW$642       .dwtag  DW_TAG_member
    7186                      .dwattr $C$DW$642, DW_AT_type(*$C$DW$T$20)
    7187                      .dwattr $C$DW$642, DW_AT_name("Kp_Iq")
    7188                      .dwattr $C$DW$642, DW_AT_TI_symbol_name("_Kp_Iq")
    7189                      .dwattr $C$DW$642, DW_AT_data_member_location[DW_OP_plus_uconst 0xcc]
    7190                      .dwattr $C$DW$642, DW_AT_accessibility(DW_ACCESS_public)
    7191              
    7192              $C$DW$643       .dwtag  DW_TAG_member
    7193                      .dwattr $C$DW$643, DW_AT_type(*$C$DW$T$20)
    7194                      .dwattr $C$DW$643, DW_AT_name("Kp_spd")
    7195                      .dwattr $C$DW$643, DW_AT_TI_symbol_name("_Kp_spd")
    7196                      .dwattr $C$DW$643, DW_AT_data_member_location[DW_OP_plus_uconst 0xce]
    7197                      .dwattr $C$DW$643, DW_AT_accessibility(DW_ACCESS_public)
    7198              
    7199              $C$DW$644       .dwtag  DW_TAG_member
    7200                      .dwattr $C$DW$644, DW_AT_type(*$C$DW$T$20)
    7201                      .dwattr $C$DW$644, DW_AT_name("Ki_Id")
    7202                      .dwattr $C$DW$644, DW_AT_TI_symbol_name("_Ki_Id")
    7203                      .dwattr $C$DW$644, DW_AT_data_member_location[DW_OP_plus_uconst 0xd0]
    7204                      .dwattr $C$DW$644, DW_AT_accessibility(DW_ACCESS_public)
    7205              
    7206              $C$DW$645       .dwtag  DW_TAG_member
    7207                      .dwattr $C$DW$645, DW_AT_type(*$C$DW$T$20)
    7208                      .dwattr $C$DW$645, DW_AT_name("Ki_Iq")
    7209                      .dwattr $C$DW$645, DW_AT_TI_symbol_name("_Ki_Iq")
    7210                      .dwattr $C$DW$645, DW_AT_data_member_location[DW_OP_plus_uconst 0xd2]
    7211                      .dwattr $C$DW$645, DW_AT_accessibility(DW_ACCESS_public)
    7212              
    7213              $C$DW$646       .dwtag  DW_TAG_member
    7214                      .dwattr $C$DW$646, DW_AT_type(*$C$DW$T$20)
TMS320C2000 Assembler PC v15.12.3 Mon Sep 25 12:51:20 2017

Tools Copyright (c) 1996-2015 Texas Instruments Incorporated
C:\Users\wmj\AppData\Local\Temp\0823212                              PAGE  144

    7215                      .dwattr $C$DW$646, DW_AT_name("Ki_spd")
    7216                      .dwattr $C$DW$646, DW_AT_TI_symbol_name("_Ki_spd")
    7217                      .dwattr $C$DW$646, DW_AT_data_member_location[DW_OP_plus_uconst 0xd4]
    7218                      .dwattr $C$DW$646, DW_AT_accessibility(DW_ACCESS_public)
    7219              
    7220              $C$DW$647       .dwtag  DW_TAG_member
    7221                      .dwattr $C$DW$647, DW_AT_type(*$C$DW$T$20)
    7222                      .dwattr $C$DW$647, DW_AT_name("Kd_Id")
    7223                      .dwattr $C$DW$647, DW_AT_TI_symbol_name("_Kd_Id")
    7224                      .dwattr $C$DW$647, DW_AT_data_member_location[DW_OP_plus_uconst 0xd6]
    7225                      .dwattr $C$DW$647, DW_AT_accessibility(DW_ACCESS_public)
    7226              
    7227              $C$DW$648       .dwtag  DW_TAG_member
    7228                      .dwattr $C$DW$648, DW_AT_type(*$C$DW$T$20)
    7229                      .dwattr $C$DW$648, DW_AT_name("Kd_Iq")
    7230                      .dwattr $C$DW$648, DW_AT_TI_symbol_name("_Kd_Iq")
    7231                      .dwattr $C$DW$648, DW_AT_data_member_location[DW_OP_plus_uconst 0xd8]
    7232                      .dwattr $C$DW$648, DW_AT_accessibility(DW_ACCESS_public)
    7233              
    7234              $C$DW$649       .dwtag  DW_TAG_member
    7235                      .dwattr $C$DW$649, DW_AT_type(*$C$DW$T$20)
    7236                      .dwattr $C$DW$649, DW_AT_name("Kd_spd")
    7237                      .dwattr $C$DW$649, DW_AT_TI_symbol_name("_Kd_spd")
    7238                      .dwattr $C$DW$649, DW_AT_data_member_location[DW_OP_plus_uconst 0xda]
    7239                      .dwattr $C$DW$649, DW_AT_accessibility(DW_ACCESS_public)
    7240              
    7241              $C$DW$650       .dwtag  DW_TAG_member
    7242                      .dwattr $C$DW$650, DW_AT_type(*$C$DW$T$20)
    7243                      .dwattr $C$DW$650, DW_AT_name("Ui_Id")
    7244                      .dwattr $C$DW$650, DW_AT_TI_symbol_name("_Ui_Id")
    7245                      .dwattr $C$DW$650, DW_AT_data_member_location[DW_OP_plus_uconst 0xdc]
    7246                      .dwattr $C$DW$650, DW_AT_accessibility(DW_ACCESS_public)
    7247              
    7248              $C$DW$651       .dwtag  DW_TAG_member
    7249                      .dwattr $C$DW$651, DW_AT_type(*$C$DW$T$20)
    7250                      .dwattr $C$DW$651, DW_AT_name("Ui_Iq")
    7251                      .dwattr $C$DW$651, DW_AT_TI_symbol_name("_Ui_Iq")
    7252                      .dwattr $C$DW$651, DW_AT_data_member_location[DW_OP_plus_uconst 0xde]
    7253                      .dwattr $C$DW$651, DW_AT_accessibility(DW_ACCESS_public)
    7254              
    7255              $C$DW$652       .dwtag  DW_TAG_member
    7256                      .dwattr $C$DW$652, DW_AT_type(*$C$DW$T$20)
    7257                      .dwattr $C$DW$652, DW_AT_name("Ui_spd")
    7258                      .dwattr $C$DW$652, DW_AT_TI_symbol_name("_Ui_spd")
    7259                      .dwattr $C$DW$652, DW_AT_data_member_location[DW_OP_plus_uconst 0xe0]
    7260                      .dwattr $C$DW$652, DW_AT_accessibility(DW_ACCESS_public)
    7261              
    7262              $C$DW$653       .dwtag  DW_TAG_member
    7263                      .dwattr $C$DW$653, DW_AT_type(*$C$DW$T$21)
    7264                      .dwattr $C$DW$653, DW_AT_name("Idq_ref")
    7265                      .dwattr $C$DW$653, DW_AT_TI_symbol_name("_Idq_ref")
    7266                      .dwattr $C$DW$653, DW_AT_data_member_location[DW_OP_plus_uconst 0xe2]
    7267                      .dwattr $C$DW$653, DW_AT_accessibility(DW_ACCESS_public)
    7268              
    7269              $C$DW$654       .dwtag  DW_TAG_member
TMS320C2000 Assembler PC v15.12.3 Mon Sep 25 12:51:20 2017

Tools Copyright (c) 1996-2015 Texas Instruments Incorporated
C:\Users\wmj\AppData\Local\Temp\0823212                              PAGE  145

    7270                      .dwattr $C$DW$654, DW_AT_type(*$C$DW$T$20)
    7271                      .dwattr $C$DW$654, DW_AT_name("IdRated")
    7272                      .dwattr $C$DW$654, DW_AT_TI_symbol_name("_IdRated")
    7273                      .dwattr $C$DW$654, DW_AT_data_member_location[DW_OP_plus_uconst 0xe6]
    7274                      .dwattr $C$DW$654, DW_AT_accessibility(DW_ACCESS_public)
    7275              
    7276              $C$DW$655       .dwtag  DW_TAG_member
    7277                      .dwattr $C$DW$655, DW_AT_type(*$C$DW$T$20)
    7278                      .dwattr $C$DW$655, DW_AT_name("spd_ref")
    7279                      .dwattr $C$DW$655, DW_AT_TI_symbol_name("_spd_ref")
    7280                      .dwattr $C$DW$655, DW_AT_data_member_location[DW_OP_plus_uconst 0xe8]
    7281                      .dwattr $C$DW$655, DW_AT_accessibility(DW_ACCESS_public)
    7282              
    7283              $C$DW$656       .dwtag  DW_TAG_member
    7284                      .dwattr $C$DW$656, DW_AT_type(*$C$DW$T$20)
    7285                      .dwattr $C$DW$656, DW_AT_name("spd_max")
    7286                      .dwattr $C$DW$656, DW_AT_TI_symbol_name("_spd_max")
    7287                      .dwattr $C$DW$656, DW_AT_data_member_location[DW_OP_plus_uconst 0xea]
    7288                      .dwattr $C$DW$656, DW_AT_accessibility(DW_ACCESS_public)
    7289              
    7290              $C$DW$657       .dwtag  DW_TAG_member
    7291                      .dwattr $C$DW$657, DW_AT_type(*$C$DW$T$56)
    7292                      .dwattr $C$DW$657, DW_AT_name("counter_current")
    7293                      .dwattr $C$DW$657, DW_AT_TI_symbol_name("_counter_current")
    7294                      .dwattr $C$DW$657, DW_AT_data_member_location[DW_OP_plus_uconst 0xec]
    7295                      .dwattr $C$DW$657, DW_AT_accessibility(DW_ACCESS_public)
    7296              
    7297              $C$DW$658       .dwtag  DW_TAG_member
    7298                      .dwattr $C$DW$658, DW_AT_type(*$C$DW$T$56)
    7299                      .dwattr $C$DW$658, DW_AT_name("counter_isr")
    7300                      .dwattr $C$DW$658, DW_AT_TI_symbol_name("_counter_isr")
    7301                      .dwattr $C$DW$658, DW_AT_data_member_location[DW_OP_plus_uconst 0xed]
    7302                      .dwattr $C$DW$658, DW_AT_accessibility(DW_ACCESS_public)
    7303              
    7304              $C$DW$659       .dwtag  DW_TAG_member
    7305                      .dwattr $C$DW$659, DW_AT_type(*$C$DW$T$56)
    7306                      .dwattr $C$DW$659, DW_AT_name("counter_speed")
    7307                      .dwattr $C$DW$659, DW_AT_TI_symbol_name("_counter_speed")
    7308                      .dwattr $C$DW$659, DW_AT_data_member_location[DW_OP_plus_uconst 0xee]
    7309                      .dwattr $C$DW$659, DW_AT_accessibility(DW_ACCESS_public)
    7310              
    7311              $C$DW$660       .dwtag  DW_TAG_member
    7312                      .dwattr $C$DW$660, DW_AT_type(*$C$DW$T$56)
    7313                      .dwattr $C$DW$660, DW_AT_name("counter_traj")
    7314                      .dwattr $C$DW$660, DW_AT_TI_symbol_name("_counter_traj")
    7315                      .dwattr $C$DW$660, DW_AT_data_member_location[DW_OP_plus_uconst 0xef]
    7316                      .dwattr $C$DW$660, DW_AT_accessibility(DW_ACCESS_public)
    7317              
    7318              $C$DW$661       .dwtag  DW_TAG_member
    7319                      .dwattr $C$DW$661, DW_AT_type(*$C$DW$T$22)
    7320                      .dwattr $C$DW$661, DW_AT_name("flag_enableCtrl")
    7321                      .dwattr $C$DW$661, DW_AT_TI_symbol_name("_flag_enableCtrl")
    7322                      .dwattr $C$DW$661, DW_AT_data_member_location[DW_OP_plus_uconst 0xf0]
    7323                      .dwattr $C$DW$661, DW_AT_accessibility(DW_ACCESS_public)
    7324              
TMS320C2000 Assembler PC v15.12.3 Mon Sep 25 12:51:20 2017

Tools Copyright (c) 1996-2015 Texas Instruments Incorporated
C:\Users\wmj\AppData\Local\Temp\0823212                              PAGE  146

    7325              $C$DW$662       .dwtag  DW_TAG_member
    7326                      .dwattr $C$DW$662, DW_AT_type(*$C$DW$T$22)
    7327                      .dwattr $C$DW$662, DW_AT_name("flag_enableDcBusComp")
    7328                      .dwattr $C$DW$662, DW_AT_TI_symbol_name("_flag_enableDcBusComp")
    7329                      .dwattr $C$DW$662, DW_AT_data_member_location[DW_OP_plus_uconst 0xf1]
    7330                      .dwattr $C$DW$662, DW_AT_accessibility(DW_ACCESS_public)
    7331              
    7332              $C$DW$663       .dwtag  DW_TAG_member
    7333                      .dwattr $C$DW$663, DW_AT_type(*$C$DW$T$22)
    7334                      .dwattr $C$DW$663, DW_AT_name("flag_enablePowerWarp")
    7335                      .dwattr $C$DW$663, DW_AT_TI_symbol_name("_flag_enablePowerWarp")
    7336                      .dwattr $C$DW$663, DW_AT_data_member_location[DW_OP_plus_uconst 0xf2]
    7337                      .dwattr $C$DW$663, DW_AT_accessibility(DW_ACCESS_public)
    7338              
    7339              $C$DW$664       .dwtag  DW_TAG_member
    7340                      .dwattr $C$DW$664, DW_AT_type(*$C$DW$T$22)
    7341                      .dwattr $C$DW$664, DW_AT_name("flag_enableOffset")
    7342                      .dwattr $C$DW$664, DW_AT_TI_symbol_name("_flag_enableOffset")
    7343                      .dwattr $C$DW$664, DW_AT_data_member_location[DW_OP_plus_uconst 0xf3]
    7344                      .dwattr $C$DW$664, DW_AT_accessibility(DW_ACCESS_public)
    7345              
    7346              $C$DW$665       .dwtag  DW_TAG_member
    7347                      .dwattr $C$DW$665, DW_AT_type(*$C$DW$T$22)
    7348                      .dwattr $C$DW$665, DW_AT_name("flag_enableSpeedCtrl")
    7349                      .dwattr $C$DW$665, DW_AT_TI_symbol_name("_flag_enableSpeedCtrl")
    7350                      .dwattr $C$DW$665, DW_AT_data_member_location[DW_OP_plus_uconst 0xf4]
    7351                      .dwattr $C$DW$665, DW_AT_accessibility(DW_ACCESS_public)
    7352              
    7353              $C$DW$666       .dwtag  DW_TAG_member
    7354                      .dwattr $C$DW$666, DW_AT_type(*$C$DW$T$22)
    7355                      .dwattr $C$DW$666, DW_AT_name("flag_enableUserMotorParams")
    7356                      .dwattr $C$DW$666, DW_AT_TI_symbol_name("_flag_enableUserMotorParams")
    7357                      .dwattr $C$DW$666, DW_AT_data_member_location[DW_OP_plus_uconst 0xf5]
    7358                      .dwattr $C$DW$666, DW_AT_accessibility(DW_ACCESS_public)
    7359              
    7360              $C$DW$667       .dwtag  DW_TAG_member
    7361                      .dwattr $C$DW$667, DW_AT_type(*$C$DW$T$21)
    7362                      .dwattr $C$DW$667, DW_AT_name("Idq_offset_pu")
    7363                      .dwattr $C$DW$667, DW_AT_TI_symbol_name("_Idq_offset_pu")
    7364                      .dwattr $C$DW$667, DW_AT_data_member_location[DW_OP_plus_uconst 0xf6]
    7365                      .dwattr $C$DW$667, DW_AT_accessibility(DW_ACCESS_public)
    7366              
    7367              $C$DW$668       .dwtag  DW_TAG_member
    7368                      .dwattr $C$DW$668, DW_AT_type(*$C$DW$T$21)
    7369                      .dwattr $C$DW$668, DW_AT_name("Vdq_offset_pu")
    7370                      .dwattr $C$DW$668, DW_AT_TI_symbol_name("_Vdq_offset_pu")
    7371                      .dwattr $C$DW$668, DW_AT_data_member_location[DW_OP_plus_uconst 0xfa]
    7372                      .dwattr $C$DW$668, DW_AT_accessibility(DW_ACCESS_public)
    7373              
    7374              $C$DW$669       .dwtag  DW_TAG_member
    7375                      .dwattr $C$DW$669, DW_AT_type(*$C$DW$T$20)
    7376                      .dwattr $C$DW$669, DW_AT_name("angle_pu")
    7377                      .dwattr $C$DW$669, DW_AT_TI_symbol_name("_angle_pu")
    7378                      .dwattr $C$DW$669, DW_AT_data_member_location[DW_OP_plus_uconst 0xfe]
    7379                      .dwattr $C$DW$669, DW_AT_accessibility(DW_ACCESS_public)
TMS320C2000 Assembler PC v15.12.3 Mon Sep 25 12:51:20 2017

Tools Copyright (c) 1996-2015 Texas Instruments Incorporated
C:\Users\wmj\AppData\Local\Temp\0823212                              PAGE  147

    7380              
    7381              $C$DW$670       .dwtag  DW_TAG_member
    7382                      .dwattr $C$DW$670, DW_AT_type(*$C$DW$T$20)
    7383                      .dwattr $C$DW$670, DW_AT_name("speed_ref_pu")
    7384                      .dwattr $C$DW$670, DW_AT_TI_symbol_name("_speed_ref_pu")
    7385                      .dwattr $C$DW$670, DW_AT_data_member_location[DW_OP_plus_uconst 0x100]
    7386                      .dwattr $C$DW$670, DW_AT_accessibility(DW_ACCESS_public)
    7387              
    7388              $C$DW$671       .dwtag  DW_TAG_member
    7389                      .dwattr $C$DW$671, DW_AT_type(*$C$DW$T$20)
    7390                      .dwattr $C$DW$671, DW_AT_name("speed_fb_pu")
    7391                      .dwattr $C$DW$671, DW_AT_TI_symbol_name("_speed_fb_pu")
    7392                      .dwattr $C$DW$671, DW_AT_data_member_location[DW_OP_plus_uconst 0x102]
    7393                      .dwattr $C$DW$671, DW_AT_accessibility(DW_ACCESS_public)
    7394              
    7395              $C$DW$672       .dwtag  DW_TAG_member
    7396                      .dwattr $C$DW$672, DW_AT_type(*$C$DW$T$20)
    7397                      .dwattr $C$DW$672, DW_AT_name("speed_outMax_pu")
    7398                      .dwattr $C$DW$672, DW_AT_TI_symbol_name("_speed_outMax_pu")
    7399                      .dwattr $C$DW$672, DW_AT_data_member_location[DW_OP_plus_uconst 0x104]
    7400                      .dwattr $C$DW$672, DW_AT_accessibility(DW_ACCESS_public)
    7401              
    7402              $C$DW$673       .dwtag  DW_TAG_member
    7403                      .dwattr $C$DW$673, DW_AT_type(*$C$DW$T$22)
    7404                      .dwattr $C$DW$673, DW_AT_name("flag_enableCurrentCtrl")
    7405                      .dwattr $C$DW$673, DW_AT_TI_symbol_name("_flag_enableCurrentCtrl")
    7406                      .dwattr $C$DW$673, DW_AT_data_member_location[DW_OP_plus_uconst 0x106]
    7407                      .dwattr $C$DW$673, DW_AT_accessibility(DW_ACCESS_public)
    7408              
    7409              $C$DW$674       .dwtag  DW_TAG_member
    7410                      .dwattr $C$DW$674, DW_AT_type(*$C$DW$T$59)
    7411                      .dwattr $C$DW$674, DW_AT_name("brakeHandle")
    7412                      .dwattr $C$DW$674, DW_AT_TI_symbol_name("_brakeHandle")
    7413                      .dwattr $C$DW$674, DW_AT_data_member_location[DW_OP_plus_uconst 0x108]
    7414                      .dwattr $C$DW$674, DW_AT_accessibility(DW_ACCESS_public)
    7415              
    7416              $C$DW$675       .dwtag  DW_TAG_member
    7417                      .dwattr $C$DW$675, DW_AT_type(*$C$DW$T$60)
    7418                      .dwattr $C$DW$675, DW_AT_name("brake")
    7419                      .dwattr $C$DW$675, DW_AT_TI_symbol_name("_brake")
    7420                      .dwattr $C$DW$675, DW_AT_data_member_location[DW_OP_plus_uconst 0x10a]
    7421                      .dwattr $C$DW$675, DW_AT_accessibility(DW_ACCESS_public)
    7422              
    7423                      .dwendtag $C$DW$T$61
    7424              
    7425              $C$DW$T$90      .dwtag  DW_TAG_typedef
    7426                      .dwattr $C$DW$T$90, DW_AT_name("CTRL_Obj")
    7427                      .dwattr $C$DW$T$90, DW_AT_type(*$C$DW$T$61)
    7428                      .dwattr $C$DW$T$90, DW_AT_language(DW_LANG_C)
    7429              
    7430              $C$DW$T$91      .dwtag  DW_TAG_pointer_type
    7431                      .dwattr $C$DW$T$91, DW_AT_type(*$C$DW$T$61)
    7432                      .dwattr $C$DW$T$91, DW_AT_address_class(0x20)
    7433              
    7434              $C$DW$T$92      .dwtag  DW_TAG_typedef
TMS320C2000 Assembler PC v15.12.3 Mon Sep 25 12:51:20 2017

Tools Copyright (c) 1996-2015 Texas Instruments Incorporated
C:\Users\wmj\AppData\Local\Temp\0823212                              PAGE  148

    7435                      .dwattr $C$DW$T$92, DW_AT_name("CTRL_Handle")
    7436                      .dwattr $C$DW$T$92, DW_AT_type(*$C$DW$T$91)
    7437                      .dwattr $C$DW$T$92, DW_AT_language(DW_LANG_C)
    7438              
    7439              $C$DW$676       .dwtag  DW_TAG_TI_far_type
    7440                      .dwattr $C$DW$676, DW_AT_type(*$C$DW$T$92)
    7441              
    7442              $C$DW$T$93      .dwtag  DW_TAG_const_type
    7443                      .dwattr $C$DW$T$93, DW_AT_type(*$C$DW$676)
    7444              
    7445              
    7446              $C$DW$T$64      .dwtag  DW_TAG_structure_type
    7447                      .dwattr $C$DW$T$64, DW_AT_name("_CTRL_Version_")
    7448                      .dwattr $C$DW$T$64, DW_AT_byte_size(0x04)
    7449              $C$DW$677       .dwtag  DW_TAG_member
    7450                      .dwattr $C$DW$677, DW_AT_type(*$C$DW$T$24)
    7451                      .dwattr $C$DW$677, DW_AT_name("rsvd")
    7452                      .dwattr $C$DW$677, DW_AT_TI_symbol_name("_rsvd")
    7453                      .dwattr $C$DW$677, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    7454                      .dwattr $C$DW$677, DW_AT_accessibility(DW_ACCESS_public)
    7455              
    7456              $C$DW$678       .dwtag  DW_TAG_member
    7457                      .dwattr $C$DW$678, DW_AT_type(*$C$DW$T$63)
    7458                      .dwattr $C$DW$678, DW_AT_name("targetProc")
    7459                      .dwattr $C$DW$678, DW_AT_TI_symbol_name("_targetProc")
    7460                      .dwattr $C$DW$678, DW_AT_data_member_location[DW_OP_plus_uconst 0x1]
    7461                      .dwattr $C$DW$678, DW_AT_accessibility(DW_ACCESS_public)
    7462              
    7463              $C$DW$679       .dwtag  DW_TAG_member
    7464                      .dwattr $C$DW$679, DW_AT_type(*$C$DW$T$24)
    7465                      .dwattr $C$DW$679, DW_AT_name("major")
    7466                      .dwattr $C$DW$679, DW_AT_TI_symbol_name("_major")
    7467                      .dwattr $C$DW$679, DW_AT_data_member_location[DW_OP_plus_uconst 0x2]
    7468                      .dwattr $C$DW$679, DW_AT_accessibility(DW_ACCESS_public)
    7469              
    7470              $C$DW$680       .dwtag  DW_TAG_member
    7471                      .dwattr $C$DW$680, DW_AT_type(*$C$DW$T$24)
    7472                      .dwattr $C$DW$680, DW_AT_name("minor")
    7473                      .dwattr $C$DW$680, DW_AT_TI_symbol_name("_minor")
    7474                      .dwattr $C$DW$680, DW_AT_data_member_location[DW_OP_plus_uconst 0x3]
    7475                      .dwattr $C$DW$680, DW_AT_accessibility(DW_ACCESS_public)
    7476              
    7477                      .dwendtag $C$DW$T$64
    7478              
    7479              $C$DW$T$27      .dwtag  DW_TAG_typedef
    7480                      .dwattr $C$DW$T$27, DW_AT_name("CTRL_Version")
    7481                      .dwattr $C$DW$T$27, DW_AT_type(*$C$DW$T$64)
    7482                      .dwattr $C$DW$T$27, DW_AT_language(DW_LANG_C)
    7483              
    7484              
    7485              $C$DW$T$19      .dwtag  DW_TAG_structure_type
    7486                      .dwattr $C$DW$T$19, DW_AT_name("_EST_Obj_")
    7487                      .dwattr $C$DW$T$19, DW_AT_declaration
    7488                      .dwendtag $C$DW$T$19
    7489              
TMS320C2000 Assembler PC v15.12.3 Mon Sep 25 12:51:20 2017

Tools Copyright (c) 1996-2015 Texas Instruments Incorporated
C:\Users\wmj\AppData\Local\Temp\0823212                              PAGE  149

    7490              $C$DW$T$35      .dwtag  DW_TAG_pointer_type
    7491                      .dwattr $C$DW$T$35, DW_AT_type(*$C$DW$T$19)
    7492                      .dwattr $C$DW$T$35, DW_AT_address_class(0x20)
    7493              
    7494              $C$DW$T$36      .dwtag  DW_TAG_typedef
    7495                      .dwattr $C$DW$T$36, DW_AT_name("EST_Handle")
    7496                      .dwattr $C$DW$T$36, DW_AT_type(*$C$DW$T$35)
    7497                      .dwattr $C$DW$T$36, DW_AT_language(DW_LANG_C)
    7498              
    7499              
    7500              $C$DW$T$65      .dwtag  DW_TAG_structure_type
    7501                      .dwattr $C$DW$T$65, DW_AT_name("_IPARK_Obj_")
    7502                      .dwattr $C$DW$T$65, DW_AT_byte_size(0x04)
    7503              $C$DW$681       .dwtag  DW_TAG_member
    7504                      .dwattr $C$DW$681, DW_AT_type(*$C$DW$T$20)
    7505                      .dwattr $C$DW$681, DW_AT_name("sinTh")
    7506                      .dwattr $C$DW$681, DW_AT_TI_symbol_name("_sinTh")
    7507                      .dwattr $C$DW$681, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    7508                      .dwattr $C$DW$681, DW_AT_accessibility(DW_ACCESS_public)
    7509              
    7510              $C$DW$682       .dwtag  DW_TAG_member
    7511                      .dwattr $C$DW$682, DW_AT_type(*$C$DW$T$20)
    7512                      .dwattr $C$DW$682, DW_AT_name("cosTh")
    7513                      .dwattr $C$DW$682, DW_AT_TI_symbol_name("_cosTh")
    7514                      .dwattr $C$DW$682, DW_AT_data_member_location[DW_OP_plus_uconst 0x2]
    7515                      .dwattr $C$DW$682, DW_AT_accessibility(DW_ACCESS_public)
    7516              
    7517                      .dwendtag $C$DW$T$65
    7518              
    7519              $C$DW$T$45      .dwtag  DW_TAG_typedef
    7520                      .dwattr $C$DW$T$45, DW_AT_name("IPARK_Obj")
    7521                      .dwattr $C$DW$T$45, DW_AT_type(*$C$DW$T$65)
    7522                      .dwattr $C$DW$T$45, DW_AT_language(DW_LANG_C)
    7523              
    7524              $C$DW$T$43      .dwtag  DW_TAG_pointer_type
    7525                      .dwattr $C$DW$T$43, DW_AT_type(*$C$DW$T$65)
    7526                      .dwattr $C$DW$T$43, DW_AT_address_class(0x20)
    7527              
    7528              $C$DW$T$44      .dwtag  DW_TAG_typedef
    7529                      .dwattr $C$DW$T$44, DW_AT_name("IPARK_Handle")
    7530                      .dwattr $C$DW$T$44, DW_AT_type(*$C$DW$T$43)
    7531                      .dwattr $C$DW$T$44, DW_AT_language(DW_LANG_C)
    7532              
    7533              
    7534              $C$DW$T$67      .dwtag  DW_TAG_structure_type
    7535                      .dwattr $C$DW$T$67, DW_AT_name("_MATH_vec2_")
    7536                      .dwattr $C$DW$T$67, DW_AT_byte_size(0x04)
    7537              $C$DW$683       .dwtag  DW_TAG_member
    7538                      .dwattr $C$DW$683, DW_AT_type(*$C$DW$T$66)
    7539                      .dwattr $C$DW$683, DW_AT_name("value")
    7540                      .dwattr $C$DW$683, DW_AT_TI_symbol_name("_value")
    7541                      .dwattr $C$DW$683, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    7542                      .dwattr $C$DW$683, DW_AT_accessibility(DW_ACCESS_public)
    7543              
    7544                      .dwendtag $C$DW$T$67
TMS320C2000 Assembler PC v15.12.3 Mon Sep 25 12:51:20 2017

Tools Copyright (c) 1996-2015 Texas Instruments Incorporated
C:\Users\wmj\AppData\Local\Temp\0823212                              PAGE  150

    7545              
    7546              $C$DW$T$21      .dwtag  DW_TAG_typedef
    7547                      .dwattr $C$DW$T$21, DW_AT_name("MATH_vec2")
    7548                      .dwattr $C$DW$T$21, DW_AT_type(*$C$DW$T$67)
    7549                      .dwattr $C$DW$T$21, DW_AT_language(DW_LANG_C)
    7550              
    7551              
    7552              $C$DW$T$70      .dwtag  DW_TAG_structure_type
    7553                      .dwattr $C$DW$T$70, DW_AT_name("_MOTOR_Params_")
    7554                      .dwattr $C$DW$T$70, DW_AT_byte_size(0x0e)
    7555              $C$DW$684       .dwtag  DW_TAG_member
    7556                      .dwattr $C$DW$684, DW_AT_type(*$C$DW$T$69)
    7557                      .dwattr $C$DW$684, DW_AT_name("type")
    7558                      .dwattr $C$DW$684, DW_AT_TI_symbol_name("_type")
    7559                      .dwattr $C$DW$684, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    7560                      .dwattr $C$DW$684, DW_AT_accessibility(DW_ACCESS_public)
    7561              
    7562              $C$DW$685       .dwtag  DW_TAG_member
    7563                      .dwattr $C$DW$685, DW_AT_type(*$C$DW$T$56)
    7564                      .dwattr $C$DW$685, DW_AT_name("numPolePairs")
    7565                      .dwattr $C$DW$685, DW_AT_TI_symbol_name("_numPolePairs")
    7566                      .dwattr $C$DW$685, DW_AT_data_member_location[DW_OP_plus_uconst 0x1]
    7567                      .dwattr $C$DW$685, DW_AT_accessibility(DW_ACCESS_public)
    7568              
    7569              $C$DW$686       .dwtag  DW_TAG_member
    7570                      .dwattr $C$DW$686, DW_AT_type(*$C$DW$T$57)
    7571                      .dwattr $C$DW$686, DW_AT_name("Lr_H")
    7572                      .dwattr $C$DW$686, DW_AT_TI_symbol_name("_Lr_H")
    7573                      .dwattr $C$DW$686, DW_AT_data_member_location[DW_OP_plus_uconst 0x2]
    7574                      .dwattr $C$DW$686, DW_AT_accessibility(DW_ACCESS_public)
    7575              
    7576              $C$DW$687       .dwtag  DW_TAG_member
    7577                      .dwattr $C$DW$687, DW_AT_type(*$C$DW$T$57)
    7578                      .dwattr $C$DW$687, DW_AT_name("Ls_d_H")
    7579                      .dwattr $C$DW$687, DW_AT_TI_symbol_name("_Ls_d_H")
    7580                      .dwattr $C$DW$687, DW_AT_data_member_location[DW_OP_plus_uconst 0x4]
    7581                      .dwattr $C$DW$687, DW_AT_accessibility(DW_ACCESS_public)
    7582              
    7583              $C$DW$688       .dwtag  DW_TAG_member
    7584                      .dwattr $C$DW$688, DW_AT_type(*$C$DW$T$57)
    7585                      .dwattr $C$DW$688, DW_AT_name("Ls_q_H")
    7586                      .dwattr $C$DW$688, DW_AT_TI_symbol_name("_Ls_q_H")
    7587                      .dwattr $C$DW$688, DW_AT_data_member_location[DW_OP_plus_uconst 0x6]
    7588                      .dwattr $C$DW$688, DW_AT_accessibility(DW_ACCESS_public)
    7589              
    7590              $C$DW$689       .dwtag  DW_TAG_member
    7591                      .dwattr $C$DW$689, DW_AT_type(*$C$DW$T$57)
    7592                      .dwattr $C$DW$689, DW_AT_name("Rr_Ohm")
    7593                      .dwattr $C$DW$689, DW_AT_TI_symbol_name("_Rr_Ohm")
    7594                      .dwattr $C$DW$689, DW_AT_data_member_location[DW_OP_plus_uconst 0x8]
    7595                      .dwattr $C$DW$689, DW_AT_accessibility(DW_ACCESS_public)
    7596              
    7597              $C$DW$690       .dwtag  DW_TAG_member
    7598                      .dwattr $C$DW$690, DW_AT_type(*$C$DW$T$57)
    7599                      .dwattr $C$DW$690, DW_AT_name("Rs_Ohm")
TMS320C2000 Assembler PC v15.12.3 Mon Sep 25 12:51:20 2017

Tools Copyright (c) 1996-2015 Texas Instruments Incorporated
C:\Users\wmj\AppData\Local\Temp\0823212                              PAGE  151

    7600                      .dwattr $C$DW$690, DW_AT_TI_symbol_name("_Rs_Ohm")
    7601                      .dwattr $C$DW$690, DW_AT_data_member_location[DW_OP_plus_uconst 0xa]
    7602                      .dwattr $C$DW$690, DW_AT_accessibility(DW_ACCESS_public)
    7603              
    7604              $C$DW$691       .dwtag  DW_TAG_member
    7605                      .dwattr $C$DW$691, DW_AT_type(*$C$DW$T$57)
    7606                      .dwattr $C$DW$691, DW_AT_name("ratedFlux_VpHz")
    7607                      .dwattr $C$DW$691, DW_AT_TI_symbol_name("_ratedFlux_VpHz")
    7608                      .dwattr $C$DW$691, DW_AT_data_member_location[DW_OP_plus_uconst 0xc]
    7609                      .dwattr $C$DW$691, DW_AT_accessibility(DW_ACCESS_public)
    7610              
    7611                      .dwendtag $C$DW$T$70
    7612              
    7613              $C$DW$T$52      .dwtag  DW_TAG_typedef
    7614                      .dwattr $C$DW$T$52, DW_AT_name("MOTOR_Params")
    7615                      .dwattr $C$DW$T$52, DW_AT_type(*$C$DW$T$70)
    7616                      .dwattr $C$DW$T$52, DW_AT_language(DW_LANG_C)
    7617              
    7618              
    7619              $C$DW$T$71      .dwtag  DW_TAG_structure_type
    7620                      .dwattr $C$DW$T$71, DW_AT_name("_PARK_Obj_")
    7621                      .dwattr $C$DW$T$71, DW_AT_byte_size(0x04)
    7622              $C$DW$692       .dwtag  DW_TAG_member
    7623                      .dwattr $C$DW$692, DW_AT_type(*$C$DW$T$20)
    7624                      .dwattr $C$DW$692, DW_AT_name("sinTh")
    7625                      .dwattr $C$DW$692, DW_AT_TI_symbol_name("_sinTh")
    7626                      .dwattr $C$DW$692, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    7627                      .dwattr $C$DW$692, DW_AT_accessibility(DW_ACCESS_public)
    7628              
    7629              $C$DW$693       .dwtag  DW_TAG_member
    7630                      .dwattr $C$DW$693, DW_AT_type(*$C$DW$T$20)
    7631                      .dwattr $C$DW$693, DW_AT_name("cosTh")
    7632                      .dwattr $C$DW$693, DW_AT_TI_symbol_name("_cosTh")
    7633                      .dwattr $C$DW$693, DW_AT_data_member_location[DW_OP_plus_uconst 0x2]
    7634                      .dwattr $C$DW$693, DW_AT_accessibility(DW_ACCESS_public)
    7635              
    7636                      .dwendtag $C$DW$T$71
    7637              
    7638              $C$DW$T$39      .dwtag  DW_TAG_typedef
    7639                      .dwattr $C$DW$T$39, DW_AT_name("PARK_Obj")
    7640                      .dwattr $C$DW$T$39, DW_AT_type(*$C$DW$T$71)
    7641                      .dwattr $C$DW$T$39, DW_AT_language(DW_LANG_C)
    7642              
    7643              $C$DW$T$37      .dwtag  DW_TAG_pointer_type
    7644                      .dwattr $C$DW$T$37, DW_AT_type(*$C$DW$T$71)
    7645                      .dwattr $C$DW$T$37, DW_AT_address_class(0x20)
    7646              
    7647              $C$DW$T$38      .dwtag  DW_TAG_typedef
    7648                      .dwattr $C$DW$T$38, DW_AT_name("PARK_Handle")
    7649                      .dwattr $C$DW$T$38, DW_AT_type(*$C$DW$T$37)
    7650                      .dwattr $C$DW$T$38, DW_AT_language(DW_LANG_C)
    7651              
    7652              
    7653              $C$DW$T$72      .dwtag  DW_TAG_structure_type
    7654                      .dwattr $C$DW$T$72, DW_AT_name("_PID_Obj_")
TMS320C2000 Assembler PC v15.12.3 Mon Sep 25 12:51:20 2017

Tools Copyright (c) 1996-2015 Texas Instruments Incorporated
C:\Users\wmj\AppData\Local\Temp\0823212                              PAGE  152

    7655                      .dwattr $C$DW$T$72, DW_AT_byte_size(0x10)
    7656              $C$DW$694       .dwtag  DW_TAG_member
    7657                      .dwattr $C$DW$694, DW_AT_type(*$C$DW$T$20)
    7658                      .dwattr $C$DW$694, DW_AT_name("Kp")
    7659                      .dwattr $C$DW$694, DW_AT_TI_symbol_name("_Kp")
    7660                      .dwattr $C$DW$694, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    7661                      .dwattr $C$DW$694, DW_AT_accessibility(DW_ACCESS_public)
    7662              
    7663              $C$DW$695       .dwtag  DW_TAG_member
    7664                      .dwattr $C$DW$695, DW_AT_type(*$C$DW$T$20)
    7665                      .dwattr $C$DW$695, DW_AT_name("Ki")
    7666                      .dwattr $C$DW$695, DW_AT_TI_symbol_name("_Ki")
    7667                      .dwattr $C$DW$695, DW_AT_data_member_location[DW_OP_plus_uconst 0x2]
    7668                      .dwattr $C$DW$695, DW_AT_accessibility(DW_ACCESS_public)
    7669              
    7670              $C$DW$696       .dwtag  DW_TAG_member
    7671                      .dwattr $C$DW$696, DW_AT_type(*$C$DW$T$20)
    7672                      .dwattr $C$DW$696, DW_AT_name("Kd")
    7673                      .dwattr $C$DW$696, DW_AT_TI_symbol_name("_Kd")
    7674                      .dwattr $C$DW$696, DW_AT_data_member_location[DW_OP_plus_uconst 0x4]
    7675                      .dwattr $C$DW$696, DW_AT_accessibility(DW_ACCESS_public)
    7676              
    7677              $C$DW$697       .dwtag  DW_TAG_member
    7678                      .dwattr $C$DW$697, DW_AT_type(*$C$DW$T$20)
    7679                      .dwattr $C$DW$697, DW_AT_name("Ui")
    7680                      .dwattr $C$DW$697, DW_AT_TI_symbol_name("_Ui")
    7681                      .dwattr $C$DW$697, DW_AT_data_member_location[DW_OP_plus_uconst 0x6]
    7682                      .dwattr $C$DW$697, DW_AT_accessibility(DW_ACCESS_public)
    7683              
    7684              $C$DW$698       .dwtag  DW_TAG_member
    7685                      .dwattr $C$DW$698, DW_AT_type(*$C$DW$T$20)
    7686                      .dwattr $C$DW$698, DW_AT_name("refValue")
    7687                      .dwattr $C$DW$698, DW_AT_TI_symbol_name("_refValue")
    7688                      .dwattr $C$DW$698, DW_AT_data_member_location[DW_OP_plus_uconst 0x8]
    7689                      .dwattr $C$DW$698, DW_AT_accessibility(DW_ACCESS_public)
    7690              
    7691              $C$DW$699       .dwtag  DW_TAG_member
    7692                      .dwattr $C$DW$699, DW_AT_type(*$C$DW$T$20)
    7693                      .dwattr $C$DW$699, DW_AT_name("fbackValue")
    7694                      .dwattr $C$DW$699, DW_AT_TI_symbol_name("_fbackValue")
    7695                      .dwattr $C$DW$699, DW_AT_data_member_location[DW_OP_plus_uconst 0xa]
    7696                      .dwattr $C$DW$699, DW_AT_accessibility(DW_ACCESS_public)
    7697              
    7698              $C$DW$700       .dwtag  DW_TAG_member
    7699                      .dwattr $C$DW$700, DW_AT_type(*$C$DW$T$20)
    7700                      .dwattr $C$DW$700, DW_AT_name("outMin")
    7701                      .dwattr $C$DW$700, DW_AT_TI_symbol_name("_outMin")
    7702                      .dwattr $C$DW$700, DW_AT_data_member_location[DW_OP_plus_uconst 0xc]
    7703                      .dwattr $C$DW$700, DW_AT_accessibility(DW_ACCESS_public)
    7704              
    7705              $C$DW$701       .dwtag  DW_TAG_member
    7706                      .dwattr $C$DW$701, DW_AT_type(*$C$DW$T$20)
    7707                      .dwattr $C$DW$701, DW_AT_name("outMax")
    7708                      .dwattr $C$DW$701, DW_AT_TI_symbol_name("_outMax")
    7709                      .dwattr $C$DW$701, DW_AT_data_member_location[DW_OP_plus_uconst 0xe]
TMS320C2000 Assembler PC v15.12.3 Mon Sep 25 12:51:20 2017

Tools Copyright (c) 1996-2015 Texas Instruments Incorporated
C:\Users\wmj\AppData\Local\Temp\0823212                              PAGE  153

    7710                      .dwattr $C$DW$701, DW_AT_accessibility(DW_ACCESS_public)
    7711              
    7712                      .dwendtag $C$DW$T$72
    7713              
    7714              $C$DW$T$42      .dwtag  DW_TAG_typedef
    7715                      .dwattr $C$DW$T$42, DW_AT_name("PID_Obj")
    7716                      .dwattr $C$DW$T$42, DW_AT_type(*$C$DW$T$72)
    7717                      .dwattr $C$DW$T$42, DW_AT_language(DW_LANG_C)
    7718              
    7719              $C$DW$T$40      .dwtag  DW_TAG_pointer_type
    7720                      .dwattr $C$DW$T$40, DW_AT_type(*$C$DW$T$72)
    7721                      .dwattr $C$DW$T$40, DW_AT_address_class(0x20)
    7722              
    7723              $C$DW$T$41      .dwtag  DW_TAG_typedef
    7724                      .dwattr $C$DW$T$41, DW_AT_name("PID_Handle")
    7725                      .dwattr $C$DW$T$41, DW_AT_type(*$C$DW$T$40)
    7726                      .dwattr $C$DW$T$41, DW_AT_language(DW_LANG_C)
    7727              
    7728              
    7729              $C$DW$T$73      .dwtag  DW_TAG_structure_type
    7730                      .dwattr $C$DW$T$73, DW_AT_name("_SVGEN_Obj_")
    7731                      .dwattr $C$DW$T$73, DW_AT_byte_size(0x02)
    7732              $C$DW$702       .dwtag  DW_TAG_member
    7733                      .dwattr $C$DW$702, DW_AT_type(*$C$DW$T$20)
    7734                      .dwattr $C$DW$702, DW_AT_name("maxModulation")
    7735                      .dwattr $C$DW$702, DW_AT_TI_symbol_name("_maxModulation")
    7736                      .dwattr $C$DW$702, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    7737                      .dwattr $C$DW$702, DW_AT_accessibility(DW_ACCESS_public)
    7738              
    7739                      .dwendtag $C$DW$T$73
    7740              
    7741              $C$DW$T$48      .dwtag  DW_TAG_typedef
    7742                      .dwattr $C$DW$T$48, DW_AT_name("SVGEN_Obj")
    7743                      .dwattr $C$DW$T$48, DW_AT_type(*$C$DW$T$73)
    7744                      .dwattr $C$DW$T$48, DW_AT_language(DW_LANG_C)
    7745              
    7746              $C$DW$T$46      .dwtag  DW_TAG_pointer_type
    7747                      .dwattr $C$DW$T$46, DW_AT_type(*$C$DW$T$73)
    7748                      .dwattr $C$DW$T$46, DW_AT_address_class(0x20)
    7749              
    7750              $C$DW$T$47      .dwtag  DW_TAG_typedef
    7751                      .dwattr $C$DW$T$47, DW_AT_name("SVGEN_Handle")
    7752                      .dwattr $C$DW$T$47, DW_AT_type(*$C$DW$T$46)
    7753                      .dwattr $C$DW$T$47, DW_AT_language(DW_LANG_C)
    7754              
    7755              
    7756              $C$DW$T$74      .dwtag  DW_TAG_structure_type
    7757                      .dwattr $C$DW$T$74, DW_AT_name("_TRAJ_Obj_")
    7758                      .dwattr $C$DW$T$74, DW_AT_byte_size(0x0a)
    7759              $C$DW$703       .dwtag  DW_TAG_member
    7760                      .dwattr $C$DW$703, DW_AT_type(*$C$DW$T$20)
    7761                      .dwattr $C$DW$703, DW_AT_name("targetValue")
    7762                      .dwattr $C$DW$703, DW_AT_TI_symbol_name("_targetValue")
    7763                      .dwattr $C$DW$703, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    7764                      .dwattr $C$DW$703, DW_AT_accessibility(DW_ACCESS_public)
TMS320C2000 Assembler PC v15.12.3 Mon Sep 25 12:51:20 2017

Tools Copyright (c) 1996-2015 Texas Instruments Incorporated
C:\Users\wmj\AppData\Local\Temp\0823212                              PAGE  154

    7765              
    7766              $C$DW$704       .dwtag  DW_TAG_member
    7767                      .dwattr $C$DW$704, DW_AT_type(*$C$DW$T$20)
    7768                      .dwattr $C$DW$704, DW_AT_name("intValue")
    7769                      .dwattr $C$DW$704, DW_AT_TI_symbol_name("_intValue")
    7770                      .dwattr $C$DW$704, DW_AT_data_member_location[DW_OP_plus_uconst 0x2]
    7771                      .dwattr $C$DW$704, DW_AT_accessibility(DW_ACCESS_public)
    7772              
    7773              $C$DW$705       .dwtag  DW_TAG_member
    7774                      .dwattr $C$DW$705, DW_AT_type(*$C$DW$T$20)
    7775                      .dwattr $C$DW$705, DW_AT_name("minValue")
    7776                      .dwattr $C$DW$705, DW_AT_TI_symbol_name("_minValue")
    7777                      .dwattr $C$DW$705, DW_AT_data_member_location[DW_OP_plus_uconst 0x4]
    7778                      .dwattr $C$DW$705, DW_AT_accessibility(DW_ACCESS_public)
    7779              
    7780              $C$DW$706       .dwtag  DW_TAG_member
    7781                      .dwattr $C$DW$706, DW_AT_type(*$C$DW$T$20)
    7782                      .dwattr $C$DW$706, DW_AT_name("maxValue")
    7783                      .dwattr $C$DW$706, DW_AT_TI_symbol_name("_maxValue")
    7784                      .dwattr $C$DW$706, DW_AT_data_member_location[DW_OP_plus_uconst 0x6]
    7785                      .dwattr $C$DW$706, DW_AT_accessibility(DW_ACCESS_public)
    7786              
    7787              $C$DW$707       .dwtag  DW_TAG_member
    7788                      .dwattr $C$DW$707, DW_AT_type(*$C$DW$T$20)
    7789                      .dwattr $C$DW$707, DW_AT_name("maxDelta")
    7790                      .dwattr $C$DW$707, DW_AT_TI_symbol_name("_maxDelta")
    7791                      .dwattr $C$DW$707, DW_AT_data_member_location[DW_OP_plus_uconst 0x8]
    7792                      .dwattr $C$DW$707, DW_AT_accessibility(DW_ACCESS_public)
    7793              
    7794                      .dwendtag $C$DW$T$74
    7795              
    7796              $C$DW$T$51      .dwtag  DW_TAG_typedef
    7797                      .dwattr $C$DW$T$51, DW_AT_name("TRAJ_Obj")
    7798                      .dwattr $C$DW$T$51, DW_AT_type(*$C$DW$T$74)
    7799                      .dwattr $C$DW$T$51, DW_AT_language(DW_LANG_C)
    7800              
    7801              $C$DW$T$49      .dwtag  DW_TAG_pointer_type
    7802                      .dwattr $C$DW$T$49, DW_AT_type(*$C$DW$T$74)
    7803                      .dwattr $C$DW$T$49, DW_AT_address_class(0x20)
    7804              
    7805              $C$DW$T$50      .dwtag  DW_TAG_typedef
    7806                      .dwattr $C$DW$T$50, DW_AT_name("TRAJ_Handle")
    7807                      .dwattr $C$DW$T$50, DW_AT_type(*$C$DW$T$49)
    7808                      .dwattr $C$DW$T$50, DW_AT_language(DW_LANG_C)
    7809              
    7810              
    7811              $C$DW$T$80      .dwtag  DW_TAG_structure_type
    7812                      .dwattr $C$DW$T$80, DW_AT_name("_USER_Params_")
    7813                      .dwattr $C$DW$T$80, DW_AT_byte_size(0xac)
    7814              $C$DW$708       .dwtag  DW_TAG_member
    7815                      .dwattr $C$DW$708, DW_AT_type(*$C$DW$T$57)
    7816                      .dwattr $C$DW$708, DW_AT_name("iqFullScaleCurrent_A")
    7817                      .dwattr $C$DW$708, DW_AT_TI_symbol_name("_iqFullScaleCurrent_A")
    7818                      .dwattr $C$DW$708, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    7819                      .dwattr $C$DW$708, DW_AT_accessibility(DW_ACCESS_public)
TMS320C2000 Assembler PC v15.12.3 Mon Sep 25 12:51:20 2017

Tools Copyright (c) 1996-2015 Texas Instruments Incorporated
C:\Users\wmj\AppData\Local\Temp\0823212                              PAGE  155

    7820              
    7821              $C$DW$709       .dwtag  DW_TAG_member
    7822                      .dwattr $C$DW$709, DW_AT_type(*$C$DW$T$57)
    7823                      .dwattr $C$DW$709, DW_AT_name("iqFullScaleVoltage_V")
    7824                      .dwattr $C$DW$709, DW_AT_TI_symbol_name("_iqFullScaleVoltage_V")
    7825                      .dwattr $C$DW$709, DW_AT_data_member_location[DW_OP_plus_uconst 0x2]
    7826                      .dwattr $C$DW$709, DW_AT_accessibility(DW_ACCESS_public)
    7827              
    7828              $C$DW$710       .dwtag  DW_TAG_member
    7829                      .dwattr $C$DW$710, DW_AT_type(*$C$DW$T$57)
    7830                      .dwattr $C$DW$710, DW_AT_name("iqFullScaleFreq_Hz")
    7831                      .dwattr $C$DW$710, DW_AT_TI_symbol_name("_iqFullScaleFreq_Hz")
    7832                      .dwattr $C$DW$710, DW_AT_data_member_location[DW_OP_plus_uconst 0x4]
    7833                      .dwattr $C$DW$710, DW_AT_accessibility(DW_ACCESS_public)
    7834              
    7835              $C$DW$711       .dwtag  DW_TAG_member
    7836                      .dwattr $C$DW$711, DW_AT_type(*$C$DW$T$56)
    7837                      .dwattr $C$DW$711, DW_AT_name("numIsrTicksPerCtrlTick")
    7838                      .dwattr $C$DW$711, DW_AT_TI_symbol_name("_numIsrTicksPerCtrlTick")
    7839                      .dwattr $C$DW$711, DW_AT_data_member_location[DW_OP_plus_uconst 0x6]
    7840                      .dwattr $C$DW$711, DW_AT_accessibility(DW_ACCESS_public)
    7841              
    7842              $C$DW$712       .dwtag  DW_TAG_member
    7843                      .dwattr $C$DW$712, DW_AT_type(*$C$DW$T$56)
    7844                      .dwattr $C$DW$712, DW_AT_name("numCtrlTicksPerCurrentTick")
    7845                      .dwattr $C$DW$712, DW_AT_TI_symbol_name("_numCtrlTicksPerCurrentTick")
    7846                      .dwattr $C$DW$712, DW_AT_data_member_location[DW_OP_plus_uconst 0x7]
    7847                      .dwattr $C$DW$712, DW_AT_accessibility(DW_ACCESS_public)
    7848              
    7849              $C$DW$713       .dwtag  DW_TAG_member
    7850                      .dwattr $C$DW$713, DW_AT_type(*$C$DW$T$56)
    7851                      .dwattr $C$DW$713, DW_AT_name("numCtrlTicksPerEstTick")
    7852                      .dwattr $C$DW$713, DW_AT_TI_symbol_name("_numCtrlTicksPerEstTick")
    7853                      .dwattr $C$DW$713, DW_AT_data_member_location[DW_OP_plus_uconst 0x8]
    7854                      .dwattr $C$DW$713, DW_AT_accessibility(DW_ACCESS_public)
    7855              
    7856              $C$DW$714       .dwtag  DW_TAG_member
    7857                      .dwattr $C$DW$714, DW_AT_type(*$C$DW$T$56)
    7858                      .dwattr $C$DW$714, DW_AT_name("numCtrlTicksPerSpeedTick")
    7859                      .dwattr $C$DW$714, DW_AT_TI_symbol_name("_numCtrlTicksPerSpeedTick")
    7860                      .dwattr $C$DW$714, DW_AT_data_member_location[DW_OP_plus_uconst 0x9]
    7861                      .dwattr $C$DW$714, DW_AT_accessibility(DW_ACCESS_public)
    7862              
    7863              $C$DW$715       .dwtag  DW_TAG_member
    7864                      .dwattr $C$DW$715, DW_AT_type(*$C$DW$T$56)
    7865                      .dwattr $C$DW$715, DW_AT_name("numCtrlTicksPerTrajTick")
    7866                      .dwattr $C$DW$715, DW_AT_TI_symbol_name("_numCtrlTicksPerTrajTick")
    7867                      .dwattr $C$DW$715, DW_AT_data_member_location[DW_OP_plus_uconst 0xa]
    7868                      .dwattr $C$DW$715, DW_AT_accessibility(DW_ACCESS_public)
    7869              
    7870              $C$DW$716       .dwtag  DW_TAG_member
    7871                      .dwattr $C$DW$716, DW_AT_type(*$C$DW$T$25)
    7872                      .dwattr $C$DW$716, DW_AT_name("numCurrentSensors")
    7873                      .dwattr $C$DW$716, DW_AT_TI_symbol_name("_numCurrentSensors")
    7874                      .dwattr $C$DW$716, DW_AT_data_member_location[DW_OP_plus_uconst 0xb]
TMS320C2000 Assembler PC v15.12.3 Mon Sep 25 12:51:20 2017

Tools Copyright (c) 1996-2015 Texas Instruments Incorporated
C:\Users\wmj\AppData\Local\Temp\0823212                              PAGE  156

    7875                      .dwattr $C$DW$716, DW_AT_accessibility(DW_ACCESS_public)
    7876              
    7877              $C$DW$717       .dwtag  DW_TAG_member
    7878                      .dwattr $C$DW$717, DW_AT_type(*$C$DW$T$25)
    7879                      .dwattr $C$DW$717, DW_AT_name("numVoltageSensors")
    7880                      .dwattr $C$DW$717, DW_AT_TI_symbol_name("_numVoltageSensors")
    7881                      .dwattr $C$DW$717, DW_AT_data_member_location[DW_OP_plus_uconst 0xc]
    7882                      .dwattr $C$DW$717, DW_AT_accessibility(DW_ACCESS_public)
    7883              
    7884              $C$DW$718       .dwtag  DW_TAG_member
    7885                      .dwattr $C$DW$718, DW_AT_type(*$C$DW$T$57)
    7886                      .dwattr $C$DW$718, DW_AT_name("offsetPole_rps")
    7887                      .dwattr $C$DW$718, DW_AT_TI_symbol_name("_offsetPole_rps")
    7888                      .dwattr $C$DW$718, DW_AT_data_member_location[DW_OP_plus_uconst 0xe]
    7889                      .dwattr $C$DW$718, DW_AT_accessibility(DW_ACCESS_public)
    7890              
    7891              $C$DW$719       .dwtag  DW_TAG_member
    7892                      .dwattr $C$DW$719, DW_AT_type(*$C$DW$T$57)
    7893                      .dwattr $C$DW$719, DW_AT_name("fluxPole_rps")
    7894                      .dwattr $C$DW$719, DW_AT_TI_symbol_name("_fluxPole_rps")
    7895                      .dwattr $C$DW$719, DW_AT_data_member_location[DW_OP_plus_uconst 0x10]
    7896                      .dwattr $C$DW$719, DW_AT_accessibility(DW_ACCESS_public)
    7897              
    7898              $C$DW$720       .dwtag  DW_TAG_member
    7899                      .dwattr $C$DW$720, DW_AT_type(*$C$DW$T$57)
    7900                      .dwattr $C$DW$720, DW_AT_name("zeroSpeedLimit")
    7901                      .dwattr $C$DW$720, DW_AT_TI_symbol_name("_zeroSpeedLimit")
    7902                      .dwattr $C$DW$720, DW_AT_data_member_location[DW_OP_plus_uconst 0x12]
    7903                      .dwattr $C$DW$720, DW_AT_accessibility(DW_ACCESS_public)
    7904              
    7905              $C$DW$721       .dwtag  DW_TAG_member
    7906                      .dwattr $C$DW$721, DW_AT_type(*$C$DW$T$57)
    7907                      .dwattr $C$DW$721, DW_AT_name("forceAngleFreq_Hz")
    7908                      .dwattr $C$DW$721, DW_AT_TI_symbol_name("_forceAngleFreq_Hz")
    7909                      .dwattr $C$DW$721, DW_AT_data_member_location[DW_OP_plus_uconst 0x14]
    7910                      .dwattr $C$DW$721, DW_AT_accessibility(DW_ACCESS_public)
    7911              
    7912              $C$DW$722       .dwtag  DW_TAG_member
    7913                      .dwattr $C$DW$722, DW_AT_type(*$C$DW$T$57)
    7914                      .dwattr $C$DW$722, DW_AT_name("maxAccel_Hzps")
    7915                      .dwattr $C$DW$722, DW_AT_TI_symbol_name("_maxAccel_Hzps")
    7916                      .dwattr $C$DW$722, DW_AT_data_member_location[DW_OP_plus_uconst 0x16]
    7917                      .dwattr $C$DW$722, DW_AT_accessibility(DW_ACCESS_public)
    7918              
    7919              $C$DW$723       .dwtag  DW_TAG_member
    7920                      .dwattr $C$DW$723, DW_AT_type(*$C$DW$T$57)
    7921                      .dwattr $C$DW$723, DW_AT_name("maxAccel_est_Hzps")
    7922                      .dwattr $C$DW$723, DW_AT_TI_symbol_name("_maxAccel_est_Hzps")
    7923                      .dwattr $C$DW$723, DW_AT_data_member_location[DW_OP_plus_uconst 0x18]
    7924                      .dwattr $C$DW$723, DW_AT_accessibility(DW_ACCESS_public)
    7925              
    7926              $C$DW$724       .dwtag  DW_TAG_member
    7927                      .dwattr $C$DW$724, DW_AT_type(*$C$DW$T$57)
    7928                      .dwattr $C$DW$724, DW_AT_name("directionPole_rps")
    7929                      .dwattr $C$DW$724, DW_AT_TI_symbol_name("_directionPole_rps")
TMS320C2000 Assembler PC v15.12.3 Mon Sep 25 12:51:20 2017

Tools Copyright (c) 1996-2015 Texas Instruments Incorporated
C:\Users\wmj\AppData\Local\Temp\0823212                              PAGE  157

    7930                      .dwattr $C$DW$724, DW_AT_data_member_location[DW_OP_plus_uconst 0x1a]
    7931                      .dwattr $C$DW$724, DW_AT_accessibility(DW_ACCESS_public)
    7932              
    7933              $C$DW$725       .dwtag  DW_TAG_member
    7934                      .dwattr $C$DW$725, DW_AT_type(*$C$DW$T$57)
    7935                      .dwattr $C$DW$725, DW_AT_name("speedPole_rps")
    7936                      .dwattr $C$DW$725, DW_AT_TI_symbol_name("_speedPole_rps")
    7937                      .dwattr $C$DW$725, DW_AT_data_member_location[DW_OP_plus_uconst 0x1c]
    7938                      .dwattr $C$DW$725, DW_AT_accessibility(DW_ACCESS_public)
    7939              
    7940              $C$DW$726       .dwtag  DW_TAG_member
    7941                      .dwattr $C$DW$726, DW_AT_type(*$C$DW$T$57)
    7942                      .dwattr $C$DW$726, DW_AT_name("dcBusPole_rps")
    7943                      .dwattr $C$DW$726, DW_AT_TI_symbol_name("_dcBusPole_rps")
    7944                      .dwattr $C$DW$726, DW_AT_data_member_location[DW_OP_plus_uconst 0x1e]
    7945                      .dwattr $C$DW$726, DW_AT_accessibility(DW_ACCESS_public)
    7946              
    7947              $C$DW$727       .dwtag  DW_TAG_member
    7948                      .dwattr $C$DW$727, DW_AT_type(*$C$DW$T$57)
    7949                      .dwattr $C$DW$727, DW_AT_name("fluxFraction")
    7950                      .dwattr $C$DW$727, DW_AT_TI_symbol_name("_fluxFraction")
    7951                      .dwattr $C$DW$727, DW_AT_data_member_location[DW_OP_plus_uconst 0x20]
    7952                      .dwattr $C$DW$727, DW_AT_accessibility(DW_ACCESS_public)
    7953              
    7954              $C$DW$728       .dwtag  DW_TAG_member
    7955                      .dwattr $C$DW$728, DW_AT_type(*$C$DW$T$57)
    7956                      .dwattr $C$DW$728, DW_AT_name("indEst_speedMaxFraction")
    7957                      .dwattr $C$DW$728, DW_AT_TI_symbol_name("_indEst_speedMaxFraction")
    7958                      .dwattr $C$DW$728, DW_AT_data_member_location[DW_OP_plus_uconst 0x22]
    7959                      .dwattr $C$DW$728, DW_AT_accessibility(DW_ACCESS_public)
    7960              
    7961              $C$DW$729       .dwtag  DW_TAG_member
    7962                      .dwattr $C$DW$729, DW_AT_type(*$C$DW$T$57)
    7963                      .dwattr $C$DW$729, DW_AT_name("powerWarpGain")
    7964                      .dwattr $C$DW$729, DW_AT_TI_symbol_name("_powerWarpGain")
    7965                      .dwattr $C$DW$729, DW_AT_data_member_location[DW_OP_plus_uconst 0x24]
    7966                      .dwattr $C$DW$729, DW_AT_accessibility(DW_ACCESS_public)
    7967              
    7968              $C$DW$730       .dwtag  DW_TAG_member
    7969                      .dwattr $C$DW$730, DW_AT_type(*$C$DW$T$56)
    7970                      .dwattr $C$DW$730, DW_AT_name("systemFreq_MHz")
    7971                      .dwattr $C$DW$730, DW_AT_TI_symbol_name("_systemFreq_MHz")
    7972                      .dwattr $C$DW$730, DW_AT_data_member_location[DW_OP_plus_uconst 0x26]
    7973                      .dwattr $C$DW$730, DW_AT_accessibility(DW_ACCESS_public)
    7974              
    7975              $C$DW$731       .dwtag  DW_TAG_member
    7976                      .dwattr $C$DW$731, DW_AT_type(*$C$DW$T$57)
    7977                      .dwattr $C$DW$731, DW_AT_name("pwmPeriod_usec")
    7978                      .dwattr $C$DW$731, DW_AT_TI_symbol_name("_pwmPeriod_usec")
    7979                      .dwattr $C$DW$731, DW_AT_data_member_location[DW_OP_plus_uconst 0x28]
    7980                      .dwattr $C$DW$731, DW_AT_accessibility(DW_ACCESS_public)
    7981              
    7982              $C$DW$732       .dwtag  DW_TAG_member
    7983                      .dwattr $C$DW$732, DW_AT_type(*$C$DW$T$57)
    7984                      .dwattr $C$DW$732, DW_AT_name("voltage_sf")
TMS320C2000 Assembler PC v15.12.3 Mon Sep 25 12:51:20 2017

Tools Copyright (c) 1996-2015 Texas Instruments Incorporated
C:\Users\wmj\AppData\Local\Temp\0823212                              PAGE  158

    7985                      .dwattr $C$DW$732, DW_AT_TI_symbol_name("_voltage_sf")
    7986                      .dwattr $C$DW$732, DW_AT_data_member_location[DW_OP_plus_uconst 0x2a]
    7987                      .dwattr $C$DW$732, DW_AT_accessibility(DW_ACCESS_public)
    7988              
    7989              $C$DW$733       .dwtag  DW_TAG_member
    7990                      .dwattr $C$DW$733, DW_AT_type(*$C$DW$T$57)
    7991                      .dwattr $C$DW$733, DW_AT_name("current_sf")
    7992                      .dwattr $C$DW$733, DW_AT_TI_symbol_name("_current_sf")
    7993                      .dwattr $C$DW$733, DW_AT_data_member_location[DW_OP_plus_uconst 0x2c]
    7994                      .dwattr $C$DW$733, DW_AT_accessibility(DW_ACCESS_public)
    7995              
    7996              $C$DW$734       .dwtag  DW_TAG_member
    7997                      .dwattr $C$DW$734, DW_AT_type(*$C$DW$T$57)
    7998                      .dwattr $C$DW$734, DW_AT_name("voltageFilterPole_rps")
    7999                      .dwattr $C$DW$734, DW_AT_TI_symbol_name("_voltageFilterPole_rps")
    8000                      .dwattr $C$DW$734, DW_AT_data_member_location[DW_OP_plus_uconst 0x2e]
    8001                      .dwattr $C$DW$734, DW_AT_accessibility(DW_ACCESS_public)
    8002              
