TMS320C2000 Assembler PC v6.2.5 Sun Oct 08 22:37:56 2017

Tools Copyright (c) 1996-2014 Texas Instruments Incorporated
C:\Users\wmj\AppData\Local\Temp\0865210                              PAGE    1

       1              ;***************************************************************
       2              ;* TMS320C2000 C/C++ Codegen                         PC v6.2.5 *
       3              ;* Date/Time created: Sun Oct 08 22:37:55 2017                 *
       4              ;***************************************************************
       5                      .compiler_opts --float_support=softlib --hll_source=on --mem_model:code=flat --mem_model:data=large -
       6        0002  FP      .set    XAR2
       7              
       8              $C$DW$CU        .dwtag  DW_TAG_compile_unit
       9                      .dwattr $C$DW$CU, DW_AT_name("D:/BM1000/sw/modules/hal/boards/hvkit_rev1p1/f28x/f2802x/src/hal.c")
      10                      .dwattr $C$DW$CU, DW_AT_producer("TMS320C2000 C/C++ Codegen PC v6.2.5 Copyright (c) 1996-2014 Texas I
      11                      .dwattr $C$DW$CU, DW_AT_TI_version(0x01)
      12                      .dwattr $C$DW$CU, DW_AT_comp_dir("D:\BM1000\sw\solutions\instaspin_foc\boards\hvkit_rev1p1\f28x\f2802
      13              
      14              $C$DW$1 .dwtag  DW_TAG_subprogram, DW_AT_name("SPI_setMode")
      15                      .dwattr $C$DW$1, DW_AT_TI_symbol_name("_SPI_setMode")

   10202              $C$DW$1818      .dwtag  DW_TAG_enumerator, DW_AT_name("SCI_CharLength_8_Bits"), DW_AT_const_value(0x07)
   10203                      .dwendtag $C$DW$T$313
   10204              
   10205              $C$DW$T$314     .dwtag  DW_TAG_typedef, DW_AT_name("SCI_CharLength_e")
   10206                      .dwattr $C$DW$T$314, DW_AT_type(*$C$DW$T$313)
   10207                      .dwattr $C$DW$T$314, DW_AT_language(DW_LANG_C)
   10208              $C$DW$1819      .dwtag  DW_TAG_TI_far_type
   10209                      .dwattr $C$DW$1819, DW_AT_type(*$C$DW$T$314)
   10210              $C$DW$T$315     .dwtag  DW_TAG_const_type
   10211                      .dwattr $C$DW$T$315, DW_AT_type(*$C$DW$1819)
   10212              
   10213              $C$DW$T$316     .dwtag  DW_TAG_enumeration_type
   10214                      .dwattr $C$DW$T$316, DW_AT_byte_size(0x01)
   10215              $C$DW$1820      .dwtag  DW_TAG_enumerator, DW_AT_name("SCI_Mode_IdleLine"), DW_AT_const_value(0x00)
   10216              $C$DW$1821      .dwtag  DW_TAG_enumerator, DW_AT_name("SCI_Mode_AddressBit"), DW_AT_const_value(0x08)
   10217                      .dwendtag $C$DW$T$316
   10218              
   10219              $C$DW$T$317     .dwtag  DW_TAG_typedef, DW_AT_name("SCI_Mode_e")
   10220                      .dwattr $C$DW$T$317, DW_AT_type(*$C$DW$T$316)
   10221                      .dwattr $C$DW$T$317, DW_AT_language(DW_LANG_C)
   10222              $C$DW$1822      .dwtag  DW_TAG_TI_far_type
   10223                      .dwattr $C$DW$1822, DW_AT_type(*$C$DW$T$317)
   10224              $C$DW$T$318     .dwtag  DW_TAG_const_type
   10225                      .dwattr $C$DW$T$318, DW_AT_type(*$C$DW$1822)
   10226              
   10227              $C$DW$T$319     .dwtag  DW_TAG_enumeration_type
   10228                      .dwattr $C$DW$T$319, DW_AT_byte_size(0x01)
   10229              $C$DW$1823      .dwtag  DW_TAG_enumerator, DW_AT_name("SCI_NumStopBits_One"), DW_AT_const_value(0x00)
   10230              $C$DW$1824      .dwtag  DW_TAG_enumerator, DW_AT_name("SCI_NumStopBits_Two"), DW_AT_const_value(0x80)
   10231                      .dwendtag $C$DW$T$319
   10232              
   10233              $C$DW$T$320     .dwtag  DW_TAG_typedef, DW_AT_name("SCI_NumStopBits_e")
   10234                      .dwattr $C$DW$T$320, DW_AT_type(*$C$DW$T$319)
   10235                      .dwattr $C$DW$T$320, DW_AT_language(DW_LANG_C)
   10236              $C$DW$1825      .dwtag  DW_TAG_TI_far_type
   10237                      .dwattr $C$DW$1825, DW_AT_type(*$C$DW$T$320)
   10238              $C$DW$T$321     .dwtag  DW_TAG_const_type
   10239                      .dwattr $C$DW$T$321, DW_AT_type(*$C$DW$1825)
   10240              
   10241              $C$DW$T$322     .dwtag  DW_TAG_enumeration_type
   10242                      .dwattr $C$DW$T$322, DW_AT_byte_size(0x01)
   10243              $C$DW$1826      .dwtag  DW_TAG_enumerator, DW_AT_name("SCI_Parity_Odd"), DW_AT_const_value(0x00)
   10244              $C$DW$1827      .dwtag  DW_TAG_enumerator, DW_AT_name("SCI_Parity_Even"), DW_AT_const_value(0x40)
TMS320C2000 Assembler PC v6.2.5 Sun Oct 08 22:37:56 2017

Tools Copyright (c) 1996-2014 Texas Instruments Incorporated
C:\Users\wmj\AppData\Local\Temp\0865210                              PAGE  197

   10245                      .dwendtag $C$DW$T$322
   10246              
   10247              $C$DW$T$323     .dwtag  DW_TAG_typedef, DW_AT_name("SCI_Parity_e")
   10248                      .dwattr $C$DW$T$323, DW_AT_type(*$C$DW$T$322)
   10249                      .dwattr $C$DW$T$323, DW_AT_language(DW_LANG_C)
   10250              $C$DW$1828      .dwtag  DW_TAG_TI_far_type
   10251                      .dwattr $C$DW$1828, DW_AT_type(*$C$DW$T$323)
   10252              $C$DW$T$324     .dwtag  DW_TAG_const_type
   10253                      .dwattr $C$DW$T$324, DW_AT_type(*$C$DW$1828)
   10254              
   10255              $C$DW$T$325     .dwtag  DW_TAG_enumeration_type
   10256                      .dwattr $C$DW$T$325, DW_AT_byte_size(0x01)
   10257              $C$DW$1829      .dwtag  DW_TAG_enumerator, DW_AT_name("HAL_SensorType_Current"), DW_AT_const_value(0x00)
   10258              $C$DW$1830      .dwtag  DW_TAG_enumerator, DW_AT_name("HAL_SensorType_Voltage"), DW_AT_const_value(0x01)
   10259                      .dwendtag $C$DW$T$325
   10260              
   10261              $C$DW$T$326     .dwtag  DW_TAG_typedef, DW_AT_name("HAL_SensorType_e")
   10262                      .dwattr $C$DW$T$326, DW_AT_type(*$C$DW$T$325)
   10263                      .dwattr $C$DW$T$326, DW_AT_language(DW_LANG_C)
   10264              
   10265              $C$DW$T$19      .dwtag  DW_TAG_structure_type
   10266                      .dwattr $C$DW$T$19, DW_AT_name("I2C_Obj")
   10267                      .dwattr $C$DW$T$19, DW_AT_declaration
   10268                      .dwendtag $C$DW$T$19
   10269              
   10270              $C$DW$T$79      .dwtag  DW_TAG_pointer_type
   10271                      .dwattr $C$DW$T$79, DW_AT_type(*$C$DW$T$19)
   10272                      .dwattr $C$DW$T$79, DW_AT_address_class(0x16)
   10273              $C$DW$T$80      .dwtag  DW_TAG_typedef, DW_AT_name("I2C_Handle")
   10274                      .dwattr $C$DW$T$80, DW_AT_type(*$C$DW$T$79)
   10275                      .dwattr $C$DW$T$80, DW_AT_language(DW_LANG_C)
   10276              
   10277              $C$DW$T$30      .dwtag  DW_TAG_structure_type
   10278                      .dwattr $C$DW$T$30, DW_AT_name("_ADC_Obj_")
   10279                      .dwattr $C$DW$T$30, DW_AT_byte_size(0x6650)
   10280              $C$DW$1831      .dwtag  DW_TAG_member
   10281                      .dwattr $C$DW$1831, DW_AT_type(*$C$DW$T$24)
   10282                      .dwattr $C$DW$1831, DW_AT_name("ADCRESULT")
   10283                      .dwattr $C$DW$1831, DW_AT_TI_symbol_name("_ADCRESULT")
   10284                      .dwattr $C$DW$1831, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
   10285                      .dwattr $C$DW$1831, DW_AT_accessibility(DW_ACCESS_public)
   10286              $C$DW$1832      .dwtag  DW_TAG_member
   10287                      .dwattr $C$DW$1832, DW_AT_type(*$C$DW$T$25)
   10288                      .dwattr $C$DW$1832, DW_AT_name("resvd_1")
   10289                      .dwattr $C$DW$1832, DW_AT_TI_symbol_name("_resvd_1")
   10290                      .dwattr $C$DW$1832, DW_AT_data_member_location[DW_OP_plus_uconst 0x10]
   10291                      .dwattr $C$DW$1832, DW_AT_accessibility(DW_ACCESS_public)
   10292              $C$DW$1833      .dwtag  DW_TAG_member
   10293                      .dwattr $C$DW$1833, DW_AT_type(*$C$DW$T$23)
   10294                      .dwattr $C$DW$1833, DW_AT_name("ADCCTL1")
   10295                      .dwattr $C$DW$1833, DW_AT_TI_symbol_name("_ADCCTL1")
   10296                      .dwattr $C$DW$1833, DW_AT_data_member_location[DW_OP_plus_uconst 0x6600]
   10297                      .dwattr $C$DW$1833, DW_AT_accessibility(DW_ACCESS_public)
   10298              $C$DW$1834      .dwtag  DW_TAG_member
   10299                      .dwattr $C$DW$1834, DW_AT_type(*$C$DW$T$23)
TMS320C2000 Assembler PC v6.2.5 Sun Oct 08 22:37:56 2017

Tools Copyright (c) 1996-2014 Texas Instruments Incorporated
C:\Users\wmj\AppData\Local\Temp\0865210                              PAGE  198

   10300                      .dwattr $C$DW$1834, DW_AT_name("ADCCTL2")
   10301                      .dwattr $C$DW$1834, DW_AT_TI_symbol_name("_ADCCTL2")
   10302                      .dwattr $C$DW$1834, DW_AT_data_member_location[DW_OP_plus_uconst 0x6601]
   10303                      .dwattr $C$DW$1834, DW_AT_accessibility(DW_ACCESS_public)
   10304              $C$DW$1835      .dwtag  DW_TAG_member
   10305                      .dwattr $C$DW$1835, DW_AT_type(*$C$DW$T$26)
   10306                      .dwattr $C$DW$1835, DW_AT_name("rsvd_2")
   10307                      .dwattr $C$DW$1835, DW_AT_TI_symbol_name("_rsvd_2")
   10308                      .dwattr $C$DW$1835, DW_AT_data_member_location[DW_OP_plus_uconst 0x6602]
   10309                      .dwattr $C$DW$1835, DW_AT_accessibility(DW_ACCESS_public)
   10310              $C$DW$1836      .dwtag  DW_TAG_member
   10311                      .dwattr $C$DW$1836, DW_AT_type(*$C$DW$T$23)
   10312                      .dwattr $C$DW$1836, DW_AT_name("ADCINTFLG")
   10313                      .dwattr $C$DW$1836, DW_AT_TI_symbol_name("_ADCINTFLG")
   10314                      .dwattr $C$DW$1836, DW_AT_data_member_location[DW_OP_plus_uconst 0x6604]
   10315                      .dwattr $C$DW$1836, DW_AT_accessibility(DW_ACCESS_public)
   10316              $C$DW$1837      .dwtag  DW_TAG_member
   10317                      .dwattr $C$DW$1837, DW_AT_type(*$C$DW$T$23)
   10318                      .dwattr $C$DW$1837, DW_AT_name("ADCINTFLGCLR")
   10319                      .dwattr $C$DW$1837, DW_AT_TI_symbol_name("_ADCINTFLGCLR")
   10320                      .dwattr $C$DW$1837, DW_AT_data_member_location[DW_OP_plus_uconst 0x6605]
   10321                      .dwattr $C$DW$1837, DW_AT_accessibility(DW_ACCESS_public)
   10322              $C$DW$1838      .dwtag  DW_TAG_member
   10323                      .dwattr $C$DW$1838, DW_AT_type(*$C$DW$T$23)
   10324                      .dwattr $C$DW$1838, DW_AT_name("ADCINTOVF")
   10325                      .dwattr $C$DW$1838, DW_AT_TI_symbol_name("_ADCINTOVF")
   10326                      .dwattr $C$DW$1838, DW_AT_data_member_location[DW_OP_plus_uconst 0x6606]
   10327                      .dwattr $C$DW$1838, DW_AT_accessibility(DW_ACCESS_public)
   10328              $C$DW$1839      .dwtag  DW_TAG_member
   10329                      .dwattr $C$DW$1839, DW_AT_type(*$C$DW$T$23)
   10330                      .dwattr $C$DW$1839, DW_AT_name("ADCINTOVFCLR")
   10331                      .dwattr $C$DW$1839, DW_AT_TI_symbol_name("_ADCINTOVFCLR")
   10332                      .dwattr $C$DW$1839, DW_AT_data_member_location[DW_OP_plus_uconst 0x6607]
   10333                      .dwattr $C$DW$1839, DW_AT_accessibility(DW_ACCESS_public)
   10334              $C$DW$1840      .dwtag  DW_TAG_member
   10335                      .dwattr $C$DW$1840, DW_AT_type(*$C$DW$T$27)
   10336                      .dwattr $C$DW$1840, DW_AT_name("INTSELxNy")
   10337                      .dwattr $C$DW$1840, DW_AT_TI_symbol_name("_INTSELxNy")
   10338                      .dwattr $C$DW$1840, DW_AT_data_member_location[DW_OP_plus_uconst 0x6608]
   10339                      .dwattr $C$DW$1840, DW_AT_accessibility(DW_ACCESS_public)
   10340              $C$DW$1841      .dwtag  DW_TAG_member
   10341                      .dwattr $C$DW$1841, DW_AT_type(*$C$DW$T$28)
   10342                      .dwattr $C$DW$1841, DW_AT_name("rsvd_3")
   10343                      .dwattr $C$DW$1841, DW_AT_TI_symbol_name("_rsvd_3")
   10344                      .dwattr $C$DW$1841, DW_AT_data_member_location[DW_OP_plus_uconst 0x660d]
   10345                      .dwattr $C$DW$1841, DW_AT_accessibility(DW_ACCESS_public)
   10346              $C$DW$1842      .dwtag  DW_TAG_member
   10347                      .dwattr $C$DW$1842, DW_AT_type(*$C$DW$T$23)
   10348                      .dwattr $C$DW$1842, DW_AT_name("SOCPRICTRL")
   10349                      .dwattr $C$DW$1842, DW_AT_TI_symbol_name("_SOCPRICTRL")
   10350                      .dwattr $C$DW$1842, DW_AT_data_member_location[DW_OP_plus_uconst 0x6610]
   10351                      .dwattr $C$DW$1842, DW_AT_accessibility(DW_ACCESS_public)
   10352              $C$DW$1843      .dwtag  DW_TAG_member
   10353                      .dwattr $C$DW$1843, DW_AT_type(*$C$DW$T$23)
   10354                      .dwattr $C$DW$1843, DW_AT_name("rsvd_4")
TMS320C2000 Assembler PC v6.2.5 Sun Oct 08 22:37:56 2017

Tools Copyright (c) 1996-2014 Texas Instruments Incorporated
C:\Users\wmj\AppData\Local\Temp\0865210                              PAGE  199

   10355                      .dwattr $C$DW$1843, DW_AT_TI_symbol_name("_rsvd_4")
   10356                      .dwattr $C$DW$1843, DW_AT_data_member_location[DW_OP_plus_uconst 0x6611]
   10357                      .dwattr $C$DW$1843, DW_AT_accessibility(DW_ACCESS_public)
   10358              $C$DW$1844      .dwtag  DW_TAG_member
   10359                      .dwattr $C$DW$1844, DW_AT_type(*$C$DW$T$23)
   10360                      .dwattr $C$DW$1844, DW_AT_name("ADCSAMPLEMODE")
   10361                      .dwattr $C$DW$1844, DW_AT_TI_symbol_name("_ADCSAMPLEMODE")
   10362                      .dwattr $C$DW$1844, DW_AT_data_member_location[DW_OP_plus_uconst 0x6612]
   10363                      .dwattr $C$DW$1844, DW_AT_accessibility(DW_ACCESS_public)
   10364              $C$DW$1845      .dwtag  DW_TAG_member
   10365                      .dwattr $C$DW$1845, DW_AT_type(*$C$DW$T$23)
   10366                      .dwattr $C$DW$1845, DW_AT_name("rsvd_5")
   10367                      .dwattr $C$DW$1845, DW_AT_TI_symbol_name("_rsvd_5")
   10368                      .dwattr $C$DW$1845, DW_AT_data_member_location[DW_OP_plus_uconst 0x6613]
   10369                      .dwattr $C$DW$1845, DW_AT_accessibility(DW_ACCESS_public)
   10370              $C$DW$1846      .dwtag  DW_TAG_member
   10371                      .dwattr $C$DW$1846, DW_AT_type(*$C$DW$T$23)
   10372                      .dwattr $C$DW$1846, DW_AT_name("ADCINTSOCSEL1")
   10373                      .dwattr $C$DW$1846, DW_AT_TI_symbol_name("_ADCINTSOCSEL1")
   10374                      .dwattr $C$DW$1846, DW_AT_data_member_location[DW_OP_plus_uconst 0x6614]
   10375                      .dwattr $C$DW$1846, DW_AT_accessibility(DW_ACCESS_public)
   10376              $C$DW$1847      .dwtag  DW_TAG_member
   10377                      .dwattr $C$DW$1847, DW_AT_type(*$C$DW$T$23)
   10378                      .dwattr $C$DW$1847, DW_AT_name("ADCINTSOCSEL2")
   10379                      .dwattr $C$DW$1847, DW_AT_TI_symbol_name("_ADCINTSOCSEL2")
   10380                      .dwattr $C$DW$1847, DW_AT_data_member_location[DW_OP_plus_uconst 0x6615]
   10381                      .dwattr $C$DW$1847, DW_AT_accessibility(DW_ACCESS_public)
   10382              $C$DW$1848      .dwtag  DW_TAG_member
   10383                      .dwattr $C$DW$1848, DW_AT_type(*$C$DW$T$26)
   10384                      .dwattr $C$DW$1848, DW_AT_name("rsvd_6")
   10385                      .dwattr $C$DW$1848, DW_AT_TI_symbol_name("_rsvd_6")
   10386                      .dwattr $C$DW$1848, DW_AT_data_member_location[DW_OP_plus_uconst 0x6616]
   10387                      .dwattr $C$DW$1848, DW_AT_accessibility(DW_ACCESS_public)
   10388              $C$DW$1849      .dwtag  DW_TAG_member
   10389                      .dwattr $C$DW$1849, DW_AT_type(*$C$DW$T$23)
   10390                      .dwattr $C$DW$1849, DW_AT_name("ADCSOCFLG1")
   10391                      .dwattr $C$DW$1849, DW_AT_TI_symbol_name("_ADCSOCFLG1")
   10392                      .dwattr $C$DW$1849, DW_AT_data_member_location[DW_OP_plus_uconst 0x6618]
   10393                      .dwattr $C$DW$1849, DW_AT_accessibility(DW_ACCESS_public)
   10394              $C$DW$1850      .dwtag  DW_TAG_member
   10395                      .dwattr $C$DW$1850, DW_AT_type(*$C$DW$T$23)
   10396                      .dwattr $C$DW$1850, DW_AT_name("rsvd_7")
   10397                      .dwattr $C$DW$1850, DW_AT_TI_symbol_name("_rsvd_7")
   10398                      .dwattr $C$DW$1850, DW_AT_data_member_location[DW_OP_plus_uconst 0x6619]
   10399                      .dwattr $C$DW$1850, DW_AT_accessibility(DW_ACCESS_public)
   10400              $C$DW$1851      .dwtag  DW_TAG_member
   10401                      .dwattr $C$DW$1851, DW_AT_type(*$C$DW$T$23)
   10402                      .dwattr $C$DW$1851, DW_AT_name("ADCSOCFRC1")
   10403                      .dwattr $C$DW$1851, DW_AT_TI_symbol_name("_ADCSOCFRC1")
   10404                      .dwattr $C$DW$1851, DW_AT_data_member_location[DW_OP_plus_uconst 0x661a]
   10405                      .dwattr $C$DW$1851, DW_AT_accessibility(DW_ACCESS_public)
   10406              $C$DW$1852      .dwtag  DW_TAG_member
   10407                      .dwattr $C$DW$1852, DW_AT_type(*$C$DW$T$23)
   10408                      .dwattr $C$DW$1852, DW_AT_name("rsvd_8")
   10409                      .dwattr $C$DW$1852, DW_AT_TI_symbol_name("_rsvd_8")
TMS320C2000 Assembler PC v6.2.5 Sun Oct 08 22:37:56 2017

Tools Copyright (c) 1996-2014 Texas Instruments Incorporated
C:\Users\wmj\AppData\Local\Temp\0865210                              PAGE  200

   10410                      .dwattr $C$DW$1852, DW_AT_data_member_location[DW_OP_plus_uconst 0x661b]
   10411                      .dwattr $C$DW$1852, DW_AT_accessibility(DW_ACCESS_public)
   10412              $C$DW$1853      .dwtag  DW_TAG_member
   10413                      .dwattr $C$DW$1853, DW_AT_type(*$C$DW$T$23)
   10414                      .dwattr $C$DW$1853, DW_AT_name("ADCSOCOVF1")
   10415                      .dwattr $C$DW$1853, DW_AT_TI_symbol_name("_ADCSOCOVF1")
   10416                      .dwattr $C$DW$1853, DW_AT_data_member_location[DW_OP_plus_uconst 0x661c]
   10417                      .dwattr $C$DW$1853, DW_AT_accessibility(DW_ACCESS_public)
   10418              $C$DW$1854      .dwtag  DW_TAG_member
   10419                      .dwattr $C$DW$1854, DW_AT_type(*$C$DW$T$23)
   10420                      .dwattr $C$DW$1854, DW_AT_name("rsvd_9")
   10421                      .dwattr $C$DW$1854, DW_AT_TI_symbol_name("_rsvd_9")
   10422                      .dwattr $C$DW$1854, DW_AT_data_member_location[DW_OP_plus_uconst 0x661d]
   10423                      .dwattr $C$DW$1854, DW_AT_accessibility(DW_ACCESS_public)
   10424              $C$DW$1855      .dwtag  DW_TAG_member
   10425                      .dwattr $C$DW$1855, DW_AT_type(*$C$DW$T$23)
   10426                      .dwattr $C$DW$1855, DW_AT_name("ADCSOCOVFCLR1")
   10427                      .dwattr $C$DW$1855, DW_AT_TI_symbol_name("_ADCSOCOVFCLR1")
   10428                      .dwattr $C$DW$1855, DW_AT_data_member_location[DW_OP_plus_uconst 0x661e]
   10429                      .dwattr $C$DW$1855, DW_AT_accessibility(DW_ACCESS_public)
   10430              $C$DW$1856      .dwtag  DW_TAG_member
   10431                      .dwattr $C$DW$1856, DW_AT_type(*$C$DW$T$23)
   10432                      .dwattr $C$DW$1856, DW_AT_name("rsvd_10")
   10433                      .dwattr $C$DW$1856, DW_AT_TI_symbol_name("_rsvd_10")
   10434                      .dwattr $C$DW$1856, DW_AT_data_member_location[DW_OP_plus_uconst 0x661f]
   10435                      .dwattr $C$DW$1856, DW_AT_accessibility(DW_ACCESS_public)
   10436              $C$DW$1857      .dwtag  DW_TAG_member
   10437                      .dwattr $C$DW$1857, DW_AT_type(*$C$DW$T$24)
   10438                      .dwattr $C$DW$1857, DW_AT_name("ADCSOCxCTL")
   10439                      .dwattr $C$DW$1857, DW_AT_TI_symbol_name("_ADCSOCxCTL")
   10440                      .dwattr $C$DW$1857, DW_AT_data_member_location[DW_OP_plus_uconst 0x6620]
   10441                      .dwattr $C$DW$1857, DW_AT_accessibility(DW_ACCESS_public)
   10442              $C$DW$1858      .dwtag  DW_TAG_member
   10443                      .dwattr $C$DW$1858, DW_AT_type(*$C$DW$T$24)
   10444                      .dwattr $C$DW$1858, DW_AT_name("rsvd_11")
   10445                      .dwattr $C$DW$1858, DW_AT_TI_symbol_name("_rsvd_11")
   10446                      .dwattr $C$DW$1858, DW_AT_data_member_location[DW_OP_plus_uconst 0x6630]
   10447                      .dwattr $C$DW$1858, DW_AT_accessibility(DW_ACCESS_public)
   10448              $C$DW$1859      .dwtag  DW_TAG_member
   10449                      .dwattr $C$DW$1859, DW_AT_type(*$C$DW$T$23)
   10450                      .dwattr $C$DW$1859, DW_AT_name("ADCREFTRIM")
   10451                      .dwattr $C$DW$1859, DW_AT_TI_symbol_name("_ADCREFTRIM")
   10452                      .dwattr $C$DW$1859, DW_AT_data_member_location[DW_OP_plus_uconst 0x6640]
   10453                      .dwattr $C$DW$1859, DW_AT_accessibility(DW_ACCESS_public)
   10454              $C$DW$1860      .dwtag  DW_TAG_member
   10455                      .dwattr $C$DW$1860, DW_AT_type(*$C$DW$T$23)
   10456                      .dwattr $C$DW$1860, DW_AT_name("ADCOFFTRIM")
   10457                      .dwattr $C$DW$1860, DW_AT_TI_symbol_name("_ADCOFFTRIM")
   10458                      .dwattr $C$DW$1860, DW_AT_data_member_location[DW_OP_plus_uconst 0x6641]
   10459                      .dwattr $C$DW$1860, DW_AT_accessibility(DW_ACCESS_public)
   10460              $C$DW$1861      .dwtag  DW_TAG_member
   10461                      .dwattr $C$DW$1861, DW_AT_type(*$C$DW$T$29)
   10462                      .dwattr $C$DW$1861, DW_AT_name("resvd_12")
   10463                      .dwattr $C$DW$1861, DW_AT_TI_symbol_name("_resvd_12")
   10464                      .dwattr $C$DW$1861, DW_AT_data_member_location[DW_OP_plus_uconst 0x6642]
TMS320C2000 Assembler PC v6.2.5 Sun Oct 08 22:37:56 2017

Tools Copyright (c) 1996-2014 Texas Instruments Incorporated
C:\Users\wmj\AppData\Local\Temp\0865210                              PAGE  201

   10465                      .dwattr $C$DW$1861, DW_AT_accessibility(DW_ACCESS_public)
   10466              $C$DW$1862      .dwtag  DW_TAG_member
   10467                      .dwattr $C$DW$1862, DW_AT_type(*$C$DW$T$23)
   10468                      .dwattr $C$DW$1862, DW_AT_name("ADCREV")
   10469                      .dwattr $C$DW$1862, DW_AT_TI_symbol_name("_ADCREV")
   10470                      .dwattr $C$DW$1862, DW_AT_data_member_location[DW_OP_plus_uconst 0x664f]
   10471                      .dwattr $C$DW$1862, DW_AT_accessibility(DW_ACCESS_public)
   10472                      .dwendtag $C$DW$T$30
   10473              
   10474              $C$DW$T$333     .dwtag  DW_TAG_typedef, DW_AT_name("ADC_Obj")
   10475                      .dwattr $C$DW$T$333, DW_AT_type(*$C$DW$T$30)
   10476                      .dwattr $C$DW$T$333, DW_AT_language(DW_LANG_C)
   10477              $C$DW$T$50      .dwtag  DW_TAG_pointer_type
   10478                      .dwattr $C$DW$T$50, DW_AT_type(*$C$DW$T$30)
   10479                      .dwattr $C$DW$T$50, DW_AT_address_class(0x16)
   10480              $C$DW$T$51      .dwtag  DW_TAG_typedef, DW_AT_name("ADC_Handle")
   10481                      .dwattr $C$DW$T$51, DW_AT_type(*$C$DW$T$50)
   10482                      .dwattr $C$DW$T$51, DW_AT_language(DW_LANG_C)
   10483              
   10484              $C$DW$T$32      .dwtag  DW_TAG_structure_type
   10485                      .dwattr $C$DW$T$32, DW_AT_name("_CLK_Obj_")
   10486                      .dwattr $C$DW$T$32, DW_AT_byte_size(0x11)
   10487              $C$DW$1863      .dwtag  DW_TAG_member
   10488                      .dwattr $C$DW$1863, DW_AT_type(*$C$DW$T$23)
   10489                      .dwattr $C$DW$1863, DW_AT_name("XCLK")
   10490                      .dwattr $C$DW$1863, DW_AT_TI_symbol_name("_XCLK")
   10491                      .dwattr $C$DW$1863, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
   10492                      .dwattr $C$DW$1863, DW_AT_accessibility(DW_ACCESS_public)
   10493              $C$DW$1864      .dwtag  DW_TAG_member
   10494                      .dwattr $C$DW$1864, DW_AT_type(*$C$DW$T$23)
   10495                      .dwattr $C$DW$1864, DW_AT_name("rsvd_1")
   10496                      .dwattr $C$DW$1864, DW_AT_TI_symbol_name("_rsvd_1")
   10497                      .dwattr $C$DW$1864, DW_AT_data_member_location[DW_OP_plus_uconst 0x1]
   10498                      .dwattr $C$DW$1864, DW_AT_accessibility(DW_ACCESS_public)
   10499              $C$DW$1865      .dwtag  DW_TAG_member
   10500                      .dwattr $C$DW$1865, DW_AT_type(*$C$DW$T$23)
   10501                      .dwattr $C$DW$1865, DW_AT_name("CLKCTL")
   10502                      .dwattr $C$DW$1865, DW_AT_TI_symbol_name("_CLKCTL")
   10503                      .dwattr $C$DW$1865, DW_AT_data_member_location[DW_OP_plus_uconst 0x2]
   10504                      .dwattr $C$DW$1865, DW_AT_accessibility(DW_ACCESS_public)
   10505              $C$DW$1866      .dwtag  DW_TAG_member
   10506                      .dwattr $C$DW$1866, DW_AT_type(*$C$DW$T$31)
   10507                      .dwattr $C$DW$1866, DW_AT_name("rsvd_2")
   10508                      .dwattr $C$DW$1866, DW_AT_TI_symbol_name("_rsvd_2")
   10509                      .dwattr $C$DW$1866, DW_AT_data_member_location[DW_OP_plus_uconst 0x3]
   10510                      .dwattr $C$DW$1866, DW_AT_accessibility(DW_ACCESS_public)
   10511              $C$DW$1867      .dwtag  DW_TAG_member
   10512                      .dwattr $C$DW$1867, DW_AT_type(*$C$DW$T$23)
   10513                      .dwattr $C$DW$1867, DW_AT_name("LOSPCP")
   10514                      .dwattr $C$DW$1867, DW_AT_TI_symbol_name("_LOSPCP")
   10515                      .dwattr $C$DW$1867, DW_AT_data_member_location[DW_OP_plus_uconst 0xb]
   10516                      .dwattr $C$DW$1867, DW_AT_accessibility(DW_ACCESS_public)
   10517              $C$DW$1868      .dwtag  DW_TAG_member
   10518                      .dwattr $C$DW$1868, DW_AT_type(*$C$DW$T$23)
   10519                      .dwattr $C$DW$1868, DW_AT_name("PCLKCR0")
TMS320C2000 Assembler PC v6.2.5 Sun Oct 08 22:37:56 2017

Tools Copyright (c) 1996-2014 Texas Instruments Incorporated
C:\Users\wmj\AppData\Local\Temp\0865210                              PAGE  202

   10520                      .dwattr $C$DW$1868, DW_AT_TI_symbol_name("_PCLKCR0")
   10521                      .dwattr $C$DW$1868, DW_AT_data_member_location[DW_OP_plus_uconst 0xc]
   10522                      .dwattr $C$DW$1868, DW_AT_accessibility(DW_ACCESS_public)
   10523              $C$DW$1869      .dwtag  DW_TAG_member
   10524                      .dwattr $C$DW$1869, DW_AT_type(*$C$DW$T$23)
   10525                      .dwattr $C$DW$1869, DW_AT_name("PCLKCR1")
   10526                      .dwattr $C$DW$1869, DW_AT_TI_symbol_name("_PCLKCR1")
   10527                      .dwattr $C$DW$1869, DW_AT_data_member_location[DW_OP_plus_uconst 0xd]
   10528                      .dwattr $C$DW$1869, DW_AT_accessibility(DW_ACCESS_public)
   10529              $C$DW$1870      .dwtag  DW_TAG_member
   10530                      .dwattr $C$DW$1870, DW_AT_type(*$C$DW$T$26)
   10531                      .dwattr $C$DW$1870, DW_AT_name("rsvd_3")
   10532                      .dwattr $C$DW$1870, DW_AT_TI_symbol_name("_rsvd_3")
   10533                      .dwattr $C$DW$1870, DW_AT_data_member_location[DW_OP_plus_uconst 0xe]
   10534                      .dwattr $C$DW$1870, DW_AT_accessibility(DW_ACCESS_public)
   10535              $C$DW$1871      .dwtag  DW_TAG_member
   10536                      .dwattr $C$DW$1871, DW_AT_type(*$C$DW$T$23)
   10537                      .dwattr $C$DW$1871, DW_AT_name("PCLKCR3")
   10538                      .dwattr $C$DW$1871, DW_AT_TI_symbol_name("_PCLKCR3")
   10539                      .dwattr $C$DW$1871, DW_AT_data_member_location[DW_OP_plus_uconst 0x10]
   10540                      .dwattr $C$DW$1871, DW_AT_accessibility(DW_ACCESS_public)
   10541                      .dwendtag $C$DW$T$32
   10542              
   10543              $C$DW$T$52      .dwtag  DW_TAG_pointer_type
   10544                      .dwattr $C$DW$T$52, DW_AT_type(*$C$DW$T$32)
   10545                      .dwattr $C$DW$T$52, DW_AT_address_class(0x16)
   10546              $C$DW$T$53      .dwtag  DW_TAG_typedef, DW_AT_name("CLK_Handle")
   10547                      .dwattr $C$DW$T$53, DW_AT_type(*$C$DW$T$52)
   10548                      .dwattr $C$DW$T$53, DW_AT_language(DW_LANG_C)
   10549              
   10550              $C$DW$T$34      .dwtag  DW_TAG_structure_type
   10551                      .dwattr $C$DW$T$34, DW_AT_name("_CPU_Obj_")
   10552                      .dwattr $C$DW$T$34, DW_AT_byte_size(0x01)
   10553              $C$DW$1872      .dwtag  DW_TAG_member
   10554                      .dwattr $C$DW$1872, DW_AT_type(*$C$DW$T$33)
   10555                      .dwattr $C$DW$1872, DW_AT_name("tmp")
   10556                      .dwattr $C$DW$1872, DW_AT_TI_symbol_name("_tmp")
   10557                      .dwattr $C$DW$1872, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
   10558                      .dwattr $C$DW$1872, DW_AT_accessibility(DW_ACCESS_public)
   10559                      .dwendtag $C$DW$T$34
   10560              
   10561              $C$DW$T$340     .dwtag  DW_TAG_typedef, DW_AT_name("CPU_Obj")
   10562                      .dwattr $C$DW$T$340, DW_AT_type(*$C$DW$T$34)
   10563                      .dwattr $C$DW$T$340, DW_AT_language(DW_LANG_C)
   10564              $C$DW$T$54      .dwtag  DW_TAG_pointer_type
   10565                      .dwattr $C$DW$T$54, DW_AT_type(*$C$DW$T$34)
   10566                      .dwattr $C$DW$T$54, DW_AT_address_class(0x16)
   10567              $C$DW$T$55      .dwtag  DW_TAG_typedef, DW_AT_name("CPU_Handle")
   10568                      .dwattr $C$DW$T$55, DW_AT_type(*$C$DW$T$54)
   10569                      .dwattr $C$DW$T$55, DW_AT_language(DW_LANG_C)
   10570              
   10571              $C$DW$T$36      .dwtag  DW_TAG_structure_type
   10572                      .dwattr $C$DW$T$36, DW_AT_name("_FILTER_FO_")
   10573                      .dwattr $C$DW$T$36, DW_AT_byte_size(0x0a)
   10574              $C$DW$1873      .dwtag  DW_TAG_member
TMS320C2000 Assembler PC v6.2.5 Sun Oct 08 22:37:56 2017

Tools Copyright (c) 1996-2014 Texas Instruments Incorporated
C:\Users\wmj\AppData\Local\Temp\0865210                              PAGE  203

   10575                      .dwattr $C$DW$1873, DW_AT_type(*$C$DW$T$35)
   10576                      .dwattr $C$DW$1873, DW_AT_name("a1")
   10577                      .dwattr $C$DW$1873, DW_AT_TI_symbol_name("_a1")
   10578                      .dwattr $C$DW$1873, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
   10579                      .dwattr $C$DW$1873, DW_AT_accessibility(DW_ACCESS_public)
   10580              $C$DW$1874      .dwtag  DW_TAG_member
   10581                      .dwattr $C$DW$1874, DW_AT_type(*$C$DW$T$35)
   10582                      .dwattr $C$DW$1874, DW_AT_name("b0")
   10583                      .dwattr $C$DW$1874, DW_AT_TI_symbol_name("_b0")
   10584                      .dwattr $C$DW$1874, DW_AT_data_member_location[DW_OP_plus_uconst 0x2]
   10585                      .dwattr $C$DW$1874, DW_AT_accessibility(DW_ACCESS_public)
   10586              $C$DW$1875      .dwtag  DW_TAG_member
   10587                      .dwattr $C$DW$1875, DW_AT_type(*$C$DW$T$35)
   10588                      .dwattr $C$DW$1875, DW_AT_name("b1")
   10589                      .dwattr $C$DW$1875, DW_AT_TI_symbol_name("_b1")
   10590                      .dwattr $C$DW$1875, DW_AT_data_member_location[DW_OP_plus_uconst 0x4]
   10591                      .dwattr $C$DW$1875, DW_AT_accessibility(DW_ACCESS_public)
   10592              $C$DW$1876      .dwtag  DW_TAG_member
   10593                      .dwattr $C$DW$1876, DW_AT_type(*$C$DW$T$35)
   10594                      .dwattr $C$DW$1876, DW_AT_name("x1")
   10595                      .dwattr $C$DW$1876, DW_AT_TI_symbol_name("_x1")
   10596                      .dwattr $C$DW$1876, DW_AT_data_member_location[DW_OP_plus_uconst 0x6]
   10597                      .dwattr $C$DW$1876, DW_AT_accessibility(DW_ACCESS_public)
   10598              $C$DW$1877      .dwtag  DW_TAG_member
   10599                      .dwattr $C$DW$1877, DW_AT_type(*$C$DW$T$35)
   10600                      .dwattr $C$DW$1877, DW_AT_name("y1")
   10601                      .dwattr $C$DW$1877, DW_AT_TI_symbol_name("_y1")
   10602                      .dwattr $C$DW$1877, DW_AT_data_member_location[DW_OP_plus_uconst 0x8]
   10603                      .dwattr $C$DW$1877, DW_AT_accessibility(DW_ACCESS_public)
   10604                      .dwendtag $C$DW$T$36
   10605              
   10606              $C$DW$T$93      .dwtag  DW_TAG_typedef, DW_AT_name("FILTER_FO_Obj")
   10607                      .dwattr $C$DW$T$93, DW_AT_type(*$C$DW$T$36)
   10608                      .dwattr $C$DW$T$93, DW_AT_language(DW_LANG_C)
   10609              
   10610              $C$DW$T$20      .dwtag  DW_TAG_structure_type
   10611                      .dwattr $C$DW$T$20, DW_AT_name("_FILTER_FO_Obj_")
   10612                      .dwattr $C$DW$T$20, DW_AT_declaration
   10613                      .dwendtag $C$DW$T$20
   10614              
   10615              $C$DW$T$94      .dwtag  DW_TAG_pointer_type
   10616                      .dwattr $C$DW$T$94, DW_AT_type(*$C$DW$T$20)
   10617                      .dwattr $C$DW$T$94, DW_AT_address_class(0x16)
   10618              $C$DW$T$95      .dwtag  DW_TAG_typedef, DW_AT_name("FILTER_FO_Handle")
   10619                      .dwattr $C$DW$T$95, DW_AT_type(*$C$DW$T$94)
   10620                      .dwattr $C$DW$T$95, DW_AT_language(DW_LANG_C)
   10621              
   10622              $C$DW$T$37      .dwtag  DW_TAG_structure_type
   10623                      .dwattr $C$DW$T$37, DW_AT_name("_FLASH_Obj_")
   10624                      .dwattr $C$DW$T$37, DW_AT_byte_size(0x08)
   10625              $C$DW$1878      .dwtag  DW_TAG_member
   10626                      .dwattr $C$DW$1878, DW_AT_type(*$C$DW$T$23)
   10627                      .dwattr $C$DW$1878, DW_AT_name("FOPT")
   10628                      .dwattr $C$DW$1878, DW_AT_TI_symbol_name("_FOPT")
   10629                      .dwattr $C$DW$1878, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
TMS320C2000 Assembler PC v6.2.5 Sun Oct 08 22:37:56 2017

Tools Copyright (c) 1996-2014 Texas Instruments Incorporated
C:\Users\wmj\AppData\Local\Temp\0865210                              PAGE  204

   10630                      .dwattr $C$DW$1878, DW_AT_accessibility(DW_ACCESS_public)
   10631              $C$DW$1879      .dwtag  DW_TAG_member
   10632                      .dwattr $C$DW$1879, DW_AT_type(*$C$DW$T$23)
   10633                      .dwattr $C$DW$1879, DW_AT_name("rsvd_1")
   10634                      .dwattr $C$DW$1879, DW_AT_TI_symbol_name("_rsvd_1")
   10635                      .dwattr $C$DW$1879, DW_AT_data_member_location[DW_OP_plus_uconst 0x1]
   10636                      .dwattr $C$DW$1879, DW_AT_accessibility(DW_ACCESS_public)
   10637              $C$DW$1880      .dwtag  DW_TAG_member
   10638                      .dwattr $C$DW$1880, DW_AT_type(*$C$DW$T$23)
   10639                      .dwattr $C$DW$1880, DW_AT_name("FPWR")
   10640                      .dwattr $C$DW$1880, DW_AT_TI_symbol_name("_FPWR")
   10641                      .dwattr $C$DW$1880, DW_AT_data_member_location[DW_OP_plus_uconst 0x2]
   10642                      .dwattr $C$DW$1880, DW_AT_accessibility(DW_ACCESS_public)
   10643              $C$DW$1881      .dwtag  DW_TAG_member
   10644                      .dwattr $C$DW$1881, DW_AT_type(*$C$DW$T$23)
   10645                      .dwattr $C$DW$1881, DW_AT_name("FSTATUS")
   10646                      .dwattr $C$DW$1881, DW_AT_TI_symbol_name("_FSTATUS")
   10647                      .dwattr $C$DW$1881, DW_AT_data_member_location[DW_OP_plus_uconst 0x3]
   10648                      .dwattr $C$DW$1881, DW_AT_accessibility(DW_ACCESS_public)
   10649              $C$DW$1882      .dwtag  DW_TAG_member
   10650                      .dwattr $C$DW$1882, DW_AT_type(*$C$DW$T$23)
   10651                      .dwattr $C$DW$1882, DW_AT_name("FSTDBYWAIT")
   10652                      .dwattr $C$DW$1882, DW_AT_TI_symbol_name("_FSTDBYWAIT")
   10653                      .dwattr $C$DW$1882, DW_AT_data_member_location[DW_OP_plus_uconst 0x4]
   10654                      .dwattr $C$DW$1882, DW_AT_accessibility(DW_ACCESS_public)
   10655              $C$DW$1883      .dwtag  DW_TAG_member
   10656                      .dwattr $C$DW$1883, DW_AT_type(*$C$DW$T$23)
   10657                      .dwattr $C$DW$1883, DW_AT_name("FACTIVEWAIT")
   10658                      .dwattr $C$DW$1883, DW_AT_TI_symbol_name("_FACTIVEWAIT")
   10659                      .dwattr $C$DW$1883, DW_AT_data_member_location[DW_OP_plus_uconst 0x5]
   10660                      .dwattr $C$DW$1883, DW_AT_accessibility(DW_ACCESS_public)
   10661              $C$DW$1884      .dwtag  DW_TAG_member
   10662                      .dwattr $C$DW$1884, DW_AT_type(*$C$DW$T$23)
   10663                      .dwattr $C$DW$1884, DW_AT_name("FBANKWAIT")
   10664                      .dwattr $C$DW$1884, DW_AT_TI_symbol_name("_FBANKWAIT")
   10665                      .dwattr $C$DW$1884, DW_AT_data_member_location[DW_OP_plus_uconst 0x6]
   10666                      .dwattr $C$DW$1884, DW_AT_accessibility(DW_ACCESS_public)
   10667              $C$DW$1885      .dwtag  DW_TAG_member
   10668                      .dwattr $C$DW$1885, DW_AT_type(*$C$DW$T$23)
   10669                      .dwattr $C$DW$1885, DW_AT_name("FOTPWAIT")
   10670                      .dwattr $C$DW$1885, DW_AT_TI_symbol_name("_FOTPWAIT")
   10671                      .dwattr $C$DW$1885, DW_AT_data_member_location[DW_OP_plus_uconst 0x7]
   10672                      .dwattr $C$DW$1885, DW_AT_accessibility(DW_ACCESS_public)
   10673                      .dwendtag $C$DW$T$37
   10674              
   10675              $C$DW$T$56      .dwtag  DW_TAG_pointer_type
   10676                      .dwattr $C$DW$T$56, DW_AT_type(*$C$DW$T$37)
   10677                      .dwattr $C$DW$T$56, DW_AT_address_class(0x16)
   10678              $C$DW$T$57      .dwtag  DW_TAG_typedef, DW_AT_name("FLASH_Handle")
   10679                      .dwattr $C$DW$T$57, DW_AT_type(*$C$DW$T$56)
   10680                      .dwattr $C$DW$T$57, DW_AT_language(DW_LANG_C)
   10681              
   10682              $C$DW$T$42      .dwtag  DW_TAG_structure_type
   10683                      .dwattr $C$DW$T$42, DW_AT_name("_GPIO_Obj_")
   10684                      .dwattr $C$DW$T$42, DW_AT_byte_size(0x6a)
TMS320C2000 Assembler PC v6.2.5 Sun Oct 08 22:37:56 2017

Tools Copyright (c) 1996-2014 Texas Instruments Incorporated
C:\Users\wmj\AppData\Local\Temp\0865210                              PAGE  205

   10685              $C$DW$1886      .dwtag  DW_TAG_member
   10686                      .dwattr $C$DW$1886, DW_AT_type(*$C$DW$T$39)
   10687                      .dwattr $C$DW$1886, DW_AT_name("GPACTRL")
   10688                      .dwattr $C$DW$1886, DW_AT_TI_symbol_name("_GPACTRL")
   10689                      .dwattr $C$DW$1886, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
   10690                      .dwattr $C$DW$1886, DW_AT_accessibility(DW_ACCESS_public)
   10691              $C$DW$1887      .dwtag  DW_TAG_member
   10692                      .dwattr $C$DW$1887, DW_AT_type(*$C$DW$T$39)
   10693                      .dwattr $C$DW$1887, DW_AT_name("GPAQSEL1")
   10694                      .dwattr $C$DW$1887, DW_AT_TI_symbol_name("_GPAQSEL1")
   10695                      .dwattr $C$DW$1887, DW_AT_data_member_location[DW_OP_plus_uconst 0x2]
   10696                      .dwattr $C$DW$1887, DW_AT_accessibility(DW_ACCESS_public)
   10697              $C$DW$1888      .dwtag  DW_TAG_member
   10698                      .dwattr $C$DW$1888, DW_AT_type(*$C$DW$T$39)
   10699                      .dwattr $C$DW$1888, DW_AT_name("GPAQSEL2")
   10700                      .dwattr $C$DW$1888, DW_AT_TI_symbol_name("_GPAQSEL2")
   10701                      .dwattr $C$DW$1888, DW_AT_data_member_location[DW_OP_plus_uconst 0x4]
   10702                      .dwattr $C$DW$1888, DW_AT_accessibility(DW_ACCESS_public)
   10703              $C$DW$1889      .dwtag  DW_TAG_member
   10704                      .dwattr $C$DW$1889, DW_AT_type(*$C$DW$T$39)
   10705                      .dwattr $C$DW$1889, DW_AT_name("GPAMUX1")
   10706                      .dwattr $C$DW$1889, DW_AT_TI_symbol_name("_GPAMUX1")
   10707                      .dwattr $C$DW$1889, DW_AT_data_member_location[DW_OP_plus_uconst 0x6]
   10708                      .dwattr $C$DW$1889, DW_AT_accessibility(DW_ACCESS_public)
   10709              $C$DW$1890      .dwtag  DW_TAG_member
   10710                      .dwattr $C$DW$1890, DW_AT_type(*$C$DW$T$39)
   10711                      .dwattr $C$DW$1890, DW_AT_name("GPAMUX2")
   10712                      .dwattr $C$DW$1890, DW_AT_TI_symbol_name("_GPAMUX2")
   10713                      .dwattr $C$DW$1890, DW_AT_data_member_location[DW_OP_plus_uconst 0x8]
   10714                      .dwattr $C$DW$1890, DW_AT_accessibility(DW_ACCESS_public)
   10715              $C$DW$1891      .dwtag  DW_TAG_member
   10716                      .dwattr $C$DW$1891, DW_AT_type(*$C$DW$T$39)
   10717                      .dwattr $C$DW$1891, DW_AT_name("GPADIR")
   10718                      .dwattr $C$DW$1891, DW_AT_TI_symbol_name("_GPADIR")
   10719                      .dwattr $C$DW$1891, DW_AT_data_member_location[DW_OP_plus_uconst 0xa]
   10720                      .dwattr $C$DW$1891, DW_AT_accessibility(DW_ACCESS_public)
   10721              $C$DW$1892      .dwtag  DW_TAG_member
   10722                      .dwattr $C$DW$1892, DW_AT_type(*$C$DW$T$39)
   10723                      .dwattr $C$DW$1892, DW_AT_name("GPAPUD")
   10724                      .dwattr $C$DW$1892, DW_AT_TI_symbol_name("_GPAPUD")
   10725                      .dwattr $C$DW$1892, DW_AT_data_member_location[DW_OP_plus_uconst 0xc]
   10726                      .dwattr $C$DW$1892, DW_AT_accessibility(DW_ACCESS_public)
   10727              $C$DW$1893      .dwtag  DW_TAG_member
   10728                      .dwattr $C$DW$1893, DW_AT_type(*$C$DW$T$26)
   10729                      .dwattr $C$DW$1893, DW_AT_name("rsvd_1")
   10730                      .dwattr $C$DW$1893, DW_AT_TI_symbol_name("_rsvd_1")
   10731                      .dwattr $C$DW$1893, DW_AT_data_member_location[DW_OP_plus_uconst 0xe]
   10732                      .dwattr $C$DW$1893, DW_AT_accessibility(DW_ACCESS_public)
   10733              $C$DW$1894      .dwtag  DW_TAG_member
   10734                      .dwattr $C$DW$1894, DW_AT_type(*$C$DW$T$39)
   10735                      .dwattr $C$DW$1894, DW_AT_name("GPBCTRL")
   10736                      .dwattr $C$DW$1894, DW_AT_TI_symbol_name("_GPBCTRL")
   10737                      .dwattr $C$DW$1894, DW_AT_data_member_location[DW_OP_plus_uconst 0x10]
   10738                      .dwattr $C$DW$1894, DW_AT_accessibility(DW_ACCESS_public)
   10739              $C$DW$1895      .dwtag  DW_TAG_member
TMS320C2000 Assembler PC v6.2.5 Sun Oct 08 22:37:56 2017

Tools Copyright (c) 1996-2014 Texas Instruments Incorporated
C:\Users\wmj\AppData\Local\Temp\0865210                              PAGE  206

   10740                      .dwattr $C$DW$1895, DW_AT_type(*$C$DW$T$39)
   10741                      .dwattr $C$DW$1895, DW_AT_name("GPBQSEL1")
   10742                      .dwattr $C$DW$1895, DW_AT_TI_symbol_name("_GPBQSEL1")
   10743                      .dwattr $C$DW$1895, DW_AT_data_member_location[DW_OP_plus_uconst 0x12]
   10744                      .dwattr $C$DW$1895, DW_AT_accessibility(DW_ACCESS_public)
   10745              $C$DW$1896      .dwtag  DW_TAG_member
   10746                      .dwattr $C$DW$1896, DW_AT_type(*$C$DW$T$26)
   10747                      .dwattr $C$DW$1896, DW_AT_name("rsvd_2")
   10748                      .dwattr $C$DW$1896, DW_AT_TI_symbol_name("_rsvd_2")
   10749                      .dwattr $C$DW$1896, DW_AT_data_member_location[DW_OP_plus_uconst 0x14]
   10750                      .dwattr $C$DW$1896, DW_AT_accessibility(DW_ACCESS_public)
   10751              $C$DW$1897      .dwtag  DW_TAG_member
   10752                      .dwattr $C$DW$1897, DW_AT_type(*$C$DW$T$39)
   10753                      .dwattr $C$DW$1897, DW_AT_name("GPBMUX1")
   10754                      .dwattr $C$DW$1897, DW_AT_TI_symbol_name("_GPBMUX1")
   10755                      .dwattr $C$DW$1897, DW_AT_data_member_location[DW_OP_plus_uconst 0x16]
   10756                      .dwattr $C$DW$1897, DW_AT_accessibility(DW_ACCESS_public)
   10757              $C$DW$1898      .dwtag  DW_TAG_member
   10758                      .dwattr $C$DW$1898, DW_AT_type(*$C$DW$T$26)
   10759                      .dwattr $C$DW$1898, DW_AT_name("rsvd_3")
   10760                      .dwattr $C$DW$1898, DW_AT_TI_symbol_name("_rsvd_3")
   10761                      .dwattr $C$DW$1898, DW_AT_data_member_location[DW_OP_plus_uconst 0x18]
   10762                      .dwattr $C$DW$1898, DW_AT_accessibility(DW_ACCESS_public)
   10763              $C$DW$1899      .dwtag  DW_TAG_member
   10764                      .dwattr $C$DW$1899, DW_AT_type(*$C$DW$T$39)
   10765                      .dwattr $C$DW$1899, DW_AT_name("GPBDIR")
   10766                      .dwattr $C$DW$1899, DW_AT_TI_symbol_name("_GPBDIR")
   10767                      .dwattr $C$DW$1899, DW_AT_data_member_location[DW_OP_plus_uconst 0x1a]
   10768                      .dwattr $C$DW$1899, DW_AT_accessibility(DW_ACCESS_public)
   10769              $C$DW$1900      .dwtag  DW_TAG_member
   10770                      .dwattr $C$DW$1900, DW_AT_type(*$C$DW$T$39)
   10771                      .dwattr $C$DW$1900, DW_AT_name("GPBPUD")
   10772                      .dwattr $C$DW$1900, DW_AT_TI_symbol_name("_GPBPUD")
   10773                      .dwattr $C$DW$1900, DW_AT_data_member_location[DW_OP_plus_uconst 0x1c]
   10774                      .dwattr $C$DW$1900, DW_AT_accessibility(DW_ACCESS_public)
   10775              $C$DW$1901      .dwtag  DW_TAG_member
   10776                      .dwattr $C$DW$1901, DW_AT_type(*$C$DW$T$40)
   10777                      .dwattr $C$DW$1901, DW_AT_name("rsvd_4")
   10778                      .dwattr $C$DW$1901, DW_AT_TI_symbol_name("_rsvd_4")
   10779                      .dwattr $C$DW$1901, DW_AT_data_member_location[DW_OP_plus_uconst 0x1e]
   10780                      .dwattr $C$DW$1901, DW_AT_accessibility(DW_ACCESS_public)
   10781              $C$DW$1902      .dwtag  DW_TAG_member
   10782                      .dwattr $C$DW$1902, DW_AT_type(*$C$DW$T$39)
   10783                      .dwattr $C$DW$1902, DW_AT_name("AIOMUX1")
   10784                      .dwattr $C$DW$1902, DW_AT_TI_symbol_name("_AIOMUX1")
   10785                      .dwattr $C$DW$1902, DW_AT_data_member_location[DW_OP_plus_uconst 0x36]
   10786                      .dwattr $C$DW$1902, DW_AT_accessibility(DW_ACCESS_public)
   10787              $C$DW$1903      .dwtag  DW_TAG_member
   10788                      .dwattr $C$DW$1903, DW_AT_type(*$C$DW$T$26)
   10789                      .dwattr $C$DW$1903, DW_AT_name("rsvd_5")
   10790                      .dwattr $C$DW$1903, DW_AT_TI_symbol_name("_rsvd_5")
   10791                      .dwattr $C$DW$1903, DW_AT_data_member_location[DW_OP_plus_uconst 0x38]
   10792                      .dwattr $C$DW$1903, DW_AT_accessibility(DW_ACCESS_public)
   10793              $C$DW$1904      .dwtag  DW_TAG_member
   10794                      .dwattr $C$DW$1904, DW_AT_type(*$C$DW$T$39)
TMS320C2000 Assembler PC v6.2.5 Sun Oct 08 22:37:56 2017

Tools Copyright (c) 1996-2014 Texas Instruments Incorporated
C:\Users\wmj\AppData\Local\Temp\0865210                              PAGE  207

   10795                      .dwattr $C$DW$1904, DW_AT_name("AIODIR")
   10796                      .dwattr $C$DW$1904, DW_AT_TI_symbol_name("_AIODIR")
   10797                      .dwattr $C$DW$1904, DW_AT_data_member_location[DW_OP_plus_uconst 0x3a]
   10798                      .dwattr $C$DW$1904, DW_AT_accessibility(DW_ACCESS_public)
   10799              $C$DW$1905      .dwtag  DW_TAG_member
   10800                      .dwattr $C$DW$1905, DW_AT_type(*$C$DW$T$41)
   10801                      .dwattr $C$DW$1905, DW_AT_name("rsvd_6")
   10802                      .dwattr $C$DW$1905, DW_AT_TI_symbol_name("_rsvd_6")
   10803                      .dwattr $C$DW$1905, DW_AT_data_member_location[DW_OP_plus_uconst 0x3c]
   10804                      .dwattr $C$DW$1905, DW_AT_accessibility(DW_ACCESS_public)
   10805              $C$DW$1906      .dwtag  DW_TAG_member
   10806                      .dwattr $C$DW$1906, DW_AT_type(*$C$DW$T$39)
   10807                      .dwattr $C$DW$1906, DW_AT_name("GPADAT")
   10808                      .dwattr $C$DW$1906, DW_AT_TI_symbol_name("_GPADAT")
   10809                      .dwattr $C$DW$1906, DW_AT_data_member_location[DW_OP_plus_uconst 0x40]
   10810                      .dwattr $C$DW$1906, DW_AT_accessibility(DW_ACCESS_public)
   10811              $C$DW$1907      .dwtag  DW_TAG_member
   10812                      .dwattr $C$DW$1907, DW_AT_type(*$C$DW$T$39)
   10813                      .dwattr $C$DW$1907, DW_AT_name("GPASET")
   10814                      .dwattr $C$DW$1907, DW_AT_TI_symbol_name("_GPASET")
   10815                      .dwattr $C$DW$1907, DW_AT_data_member_location[DW_OP_plus_uconst 0x42]
   10816                      .dwattr $C$DW$1907, DW_AT_accessibility(DW_ACCESS_public)
   10817              $C$DW$1908      .dwtag  DW_TAG_member
   10818                      .dwattr $C$DW$1908, DW_AT_type(*$C$DW$T$39)
   10819                      .dwattr $C$DW$1908, DW_AT_name("GPACLEAR")
   10820                      .dwattr $C$DW$1908, DW_AT_TI_symbol_name("_GPACLEAR")
   10821                      .dwattr $C$DW$1908, DW_AT_data_member_location[DW_OP_plus_uconst 0x44]
   10822                      .dwattr $C$DW$1908, DW_AT_accessibility(DW_ACCESS_public)
   10823              $C$DW$1909      .dwtag  DW_TAG_member
   10824                      .dwattr $C$DW$1909, DW_AT_type(*$C$DW$T$39)
   10825                      .dwattr $C$DW$1909, DW_AT_name("GPATOGGLE")
   10826                      .dwattr $C$DW$1909, DW_AT_TI_symbol_name("_GPATOGGLE")
   10827                      .dwattr $C$DW$1909, DW_AT_data_member_location[DW_OP_plus_uconst 0x46]
   10828                      .dwattr $C$DW$1909, DW_AT_accessibility(DW_ACCESS_public)
   10829              $C$DW$1910      .dwtag  DW_TAG_member
   10830                      .dwattr $C$DW$1910, DW_AT_type(*$C$DW$T$39)
   10831                      .dwattr $C$DW$1910, DW_AT_name("GPBDAT")
   10832                      .dwattr $C$DW$1910, DW_AT_TI_symbol_name("_GPBDAT")
   10833                      .dwattr $C$DW$1910, DW_AT_data_member_location[DW_OP_plus_uconst 0x48]
   10834                      .dwattr $C$DW$1910, DW_AT_accessibility(DW_ACCESS_public)
   10835              $C$DW$1911      .dwtag  DW_TAG_member
   10836                      .dwattr $C$DW$1911, DW_AT_type(*$C$DW$T$39)
   10837                      .dwattr $C$DW$1911, DW_AT_name("GPBSET")
   10838                      .dwattr $C$DW$1911, DW_AT_TI_symbol_name("_GPBSET")
   10839                      .dwattr $C$DW$1911, DW_AT_data_member_location[DW_OP_plus_uconst 0x4a]
   10840                      .dwattr $C$DW$1911, DW_AT_accessibility(DW_ACCESS_public)
   10841              $C$DW$1912      .dwtag  DW_TAG_member
   10842                      .dwattr $C$DW$1912, DW_AT_type(*$C$DW$T$39)
   10843                      .dwattr $C$DW$1912, DW_AT_name("GPBCLEAR")
   10844                      .dwattr $C$DW$1912, DW_AT_TI_symbol_name("_GPBCLEAR")
   10845                      .dwattr $C$DW$1912, DW_AT_data_member_location[DW_OP_plus_uconst 0x4c]
   10846                      .dwattr $C$DW$1912, DW_AT_accessibility(DW_ACCESS_public)
   10847              $C$DW$1913      .dwtag  DW_TAG_member
   10848                      .dwattr $C$DW$1913, DW_AT_type(*$C$DW$T$39)
   10849                      .dwattr $C$DW$1913, DW_AT_name("GPBTOGGLE")
TMS320C2000 Assembler PC v6.2.5 Sun Oct 08 22:37:56 2017

Tools Copyright (c) 1996-2014 Texas Instruments Incorporated
C:\Users\wmj\AppData\Local\Temp\0865210                              PAGE  208

   10850                      .dwattr $C$DW$1913, DW_AT_TI_symbol_name("_GPBTOGGLE")
   10851                      .dwattr $C$DW$1913, DW_AT_data_member_location[DW_OP_plus_uconst 0x4e]
   10852                      .dwattr $C$DW$1913, DW_AT_accessibility(DW_ACCESS_public)
   10853              $C$DW$1914      .dwtag  DW_TAG_member
   10854                      .dwattr $C$DW$1914, DW_AT_type(*$C$DW$T$31)
   10855                      .dwattr $C$DW$1914, DW_AT_name("rsvd_7")
   10856                      .dwattr $C$DW$1914, DW_AT_TI_symbol_name("_rsvd_7")
   10857                      .dwattr $C$DW$1914, DW_AT_data_member_location[DW_OP_plus_uconst 0x50]
   10858                      .dwattr $C$DW$1914, DW_AT_accessibility(DW_ACCESS_public)
   10859              $C$DW$1915      .dwtag  DW_TAG_member
   10860                      .dwattr $C$DW$1915, DW_AT_type(*$C$DW$T$39)
   10861                      .dwattr $C$DW$1915, DW_AT_name("AIODAT")
   10862                      .dwattr $C$DW$1915, DW_AT_TI_symbol_name("_AIODAT")
   10863                      .dwattr $C$DW$1915, DW_AT_data_member_location[DW_OP_plus_uconst 0x58]
   10864                      .dwattr $C$DW$1915, DW_AT_accessibility(DW_ACCESS_public)
   10865              $C$DW$1916      .dwtag  DW_TAG_member
   10866                      .dwattr $C$DW$1916, DW_AT_type(*$C$DW$T$39)
   10867                      .dwattr $C$DW$1916, DW_AT_name("AIOSET")
   10868                      .dwattr $C$DW$1916, DW_AT_TI_symbol_name("_AIOSET")
   10869                      .dwattr $C$DW$1916, DW_AT_data_member_location[DW_OP_plus_uconst 0x5a]
   10870                      .dwattr $C$DW$1916, DW_AT_accessibility(DW_ACCESS_public)
   10871              $C$DW$1917      .dwtag  DW_TAG_member
   10872                      .dwattr $C$DW$1917, DW_AT_type(*$C$DW$T$39)
   10873                      .dwattr $C$DW$1917, DW_AT_name("AIOCLEAR")
   10874                      .dwattr $C$DW$1917, DW_AT_TI_symbol_name("_AIOCLEAR")
   10875                      .dwattr $C$DW$1917, DW_AT_data_member_location[DW_OP_plus_uconst 0x5c]
   10876                      .dwattr $C$DW$1917, DW_AT_accessibility(DW_ACCESS_public)
   10877              $C$DW$1918      .dwtag  DW_TAG_member
   10878                      .dwattr $C$DW$1918, DW_AT_type(*$C$DW$T$39)
   10879                      .dwattr $C$DW$1918, DW_AT_name("AIOTOGGLE")
   10880                      .dwattr $C$DW$1918, DW_AT_TI_symbol_name("_AIOTOGGLE")
   10881                      .dwattr $C$DW$1918, DW_AT_data_member_location[DW_OP_plus_uconst 0x5e]
   10882                      .dwattr $C$DW$1918, DW_AT_accessibility(DW_ACCESS_public)
   10883              $C$DW$1919      .dwtag  DW_TAG_member
   10884                      .dwattr $C$DW$1919, DW_AT_type(*$C$DW$T$28)
   10885                      .dwattr $C$DW$1919, DW_AT_name("GPIOXINTnSEL")
   10886                      .dwattr $C$DW$1919, DW_AT_TI_symbol_name("_GPIOXINTnSEL")
   10887                      .dwattr $C$DW$1919, DW_AT_data_member_location[DW_OP_plus_uconst 0x60]
   10888                      .dwattr $C$DW$1919, DW_AT_accessibility(DW_ACCESS_public)
   10889              $C$DW$1920      .dwtag  DW_TAG_member
   10890                      .dwattr $C$DW$1920, DW_AT_type(*$C$DW$T$27)
   10891                      .dwattr $C$DW$1920, DW_AT_name("rsvd_8")
   10892                      .dwattr $C$DW$1920, DW_AT_TI_symbol_name("_rsvd_8")
   10893                      .dwattr $C$DW$1920, DW_AT_data_member_location[DW_OP_plus_uconst 0x63]
   10894                      .dwattr $C$DW$1920, DW_AT_accessibility(DW_ACCESS_public)
   10895              $C$DW$1921      .dwtag  DW_TAG_member
   10896                      .dwattr $C$DW$1921, DW_AT_type(*$C$DW$T$39)
   10897                      .dwattr $C$DW$1921, DW_AT_name("GPIOLPMSEL")
   10898                      .dwattr $C$DW$1921, DW_AT_TI_symbol_name("_GPIOLPMSEL")
   10899                      .dwattr $C$DW$1921, DW_AT_data_member_location[DW_OP_plus_uconst 0x68]
   10900                      .dwattr $C$DW$1921, DW_AT_accessibility(DW_ACCESS_public)
   10901                      .dwendtag $C$DW$T$42
   10902              
   10903              $C$DW$T$58      .dwtag  DW_TAG_pointer_type
   10904                      .dwattr $C$DW$T$58, DW_AT_type(*$C$DW$T$42)
TMS320C2000 Assembler PC v6.2.5 Sun Oct 08 22:37:56 2017

Tools Copyright (c) 1996-2014 Texas Instruments Incorporated
C:\Users\wmj\AppData\Local\Temp\0865210                              PAGE  209

   10905                      .dwattr $C$DW$T$58, DW_AT_address_class(0x16)
   10906              $C$DW$T$59      .dwtag  DW_TAG_typedef, DW_AT_name("GPIO_Handle")
   10907                      .dwattr $C$DW$T$59, DW_AT_type(*$C$DW$T$58)
   10908                      .dwattr $C$DW$T$59, DW_AT_language(DW_LANG_C)
   10909              
   10910              $C$DW$T$44      .dwtag  DW_TAG_structure_type
   10911                      .dwattr $C$DW$T$44, DW_AT_name("_HAL_AdcData_t_")
   10912                      .dwattr $C$DW$T$44, DW_AT_byte_size(0x16)
   10913              $C$DW$1922      .dwtag  DW_TAG_member
   10914                      .dwattr $C$DW$1922, DW_AT_type(*$C$DW$T$43)
   10915                      .dwattr $C$DW$1922, DW_AT_name("I")
   10916                      .dwattr $C$DW$1922, DW_AT_TI_symbol_name("_I")
   10917                      .dwattr $C$DW$1922, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
   10918                      .dwattr $C$DW$1922, DW_AT_accessibility(DW_ACCESS_public)
   10919              $C$DW$1923      .dwtag  DW_TAG_member
   10920                      .dwattr $C$DW$1923, DW_AT_type(*$C$DW$T$43)
   10921                      .dwattr $C$DW$1923, DW_AT_name("V")
   10922                      .dwattr $C$DW$1923, DW_AT_TI_symbol_name("_V")
   10923                      .dwattr $C$DW$1923, DW_AT_data_member_location[DW_OP_plus_uconst 0x6]
   10924                      .dwattr $C$DW$1923, DW_AT_accessibility(DW_ACCESS_public)
   10925              $C$DW$1924      .dwtag  DW_TAG_member
   10926                      .dwattr $C$DW$1924, DW_AT_type(*$C$DW$T$35)
   10927                      .dwattr $C$DW$1924, DW_AT_name("dcBus")
   10928                      .dwattr $C$DW$1924, DW_AT_TI_symbol_name("_dcBus")
   10929                      .dwattr $C$DW$1924, DW_AT_data_member_location[DW_OP_plus_uconst 0xc]
   10930                      .dwattr $C$DW$1924, DW_AT_accessibility(DW_ACCESS_public)
   10931              $C$DW$1925      .dwtag  DW_TAG_member
   10932                      .dwattr $C$DW$1925, DW_AT_type(*$C$DW$T$35)
   10933                      .dwattr $C$DW$1925, DW_AT_name("analogSensor1")
   10934                      .dwattr $C$DW$1925, DW_AT_TI_symbol_name("_analogSensor1")
   10935                      .dwattr $C$DW$1925, DW_AT_data_member_location[DW_OP_plus_uconst 0xe]
   10936                      .dwattr $C$DW$1925, DW_AT_accessibility(DW_ACCESS_public)
   10937              $C$DW$1926      .dwtag  DW_TAG_member
   10938                      .dwattr $C$DW$1926, DW_AT_type(*$C$DW$T$35)
   10939                      .dwattr $C$DW$1926, DW_AT_name("analogSensor2")
   10940                      .dwattr $C$DW$1926, DW_AT_TI_symbol_name("_analogSensor2")
   10941                      .dwattr $C$DW$1926, DW_AT_data_member_location[DW_OP_plus_uconst 0x10]
   10942                      .dwattr $C$DW$1926, DW_AT_accessibility(DW_ACCESS_public)
   10943              $C$DW$1927      .dwtag  DW_TAG_member
   10944                      .dwattr $C$DW$1927, DW_AT_type(*$C$DW$T$35)
   10945                      .dwattr $C$DW$1927, DW_AT_name("igbtNTC")
   10946                      .dwattr $C$DW$1927, DW_AT_TI_symbol_name("_igbtNTC")
   10947                      .dwattr $C$DW$1927, DW_AT_data_member_location[DW_OP_plus_uconst 0x12]
   10948                      .dwattr $C$DW$1927, DW_AT_accessibility(DW_ACCESS_public)
   10949              $C$DW$1928      .dwtag  DW_TAG_member
   10950                      .dwattr $C$DW$1928, DW_AT_type(*$C$DW$T$35)
   10951                      .dwattr $C$DW$1928, DW_AT_name("boardAddr")
   10952                      .dwattr $C$DW$1928, DW_AT_TI_symbol_name("_boardAddr")
   10953                      .dwattr $C$DW$1928, DW_AT_data_member_location[DW_OP_plus_uconst 0x14]
   10954                      .dwattr $C$DW$1928, DW_AT_accessibility(DW_ACCESS_public)
   10955                      .dwendtag $C$DW$T$44
   10956              
   10957              $C$DW$T$87      .dwtag  DW_TAG_typedef, DW_AT_name("HAL_AdcData_t")
   10958                      .dwattr $C$DW$T$87, DW_AT_type(*$C$DW$T$44)
   10959                      .dwattr $C$DW$T$87, DW_AT_language(DW_LANG_C)
TMS320C2000 Assembler PC v6.2.5 Sun Oct 08 22:37:56 2017

Tools Copyright (c) 1996-2014 Texas Instruments Incorporated
C:\Users\wmj\AppData\Local\Temp\0865210                              PAGE  210

   10960              
   10961              $C$DW$T$49      .dwtag  DW_TAG_structure_type
   10962                      .dwattr $C$DW$T$49, DW_AT_name("_HAL_DacData_t_")
   10963                      .dwattr $C$DW$T$49, DW_AT_byte_size(0x22)
   10964              $C$DW$1929      .dwtag  DW_TAG_member
   10965                      .dwattr $C$DW$1929, DW_AT_type(*$C$DW$T$22)
   10966                      .dwattr $C$DW$1929, DW_AT_name("PeriodMax")
   10967                      .dwattr $C$DW$1929, DW_AT_TI_symbol_name("_PeriodMax")
   10968                      .dwattr $C$DW$1929, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
   10969                      .dwattr $C$DW$1929, DW_AT_accessibility(DW_ACCESS_public)
   10970              $C$DW$1930      .dwtag  DW_TAG_member
   10971                      .dwattr $C$DW$1930, DW_AT_type(*$C$DW$T$47)
   10972                      .dwattr $C$DW$1930, DW_AT_name("ptrData")
   10973                      .dwattr $C$DW$1930, DW_AT_TI_symbol_name("_ptrData")
   10974                      .dwattr $C$DW$1930, DW_AT_data_member_location[DW_OP_plus_uconst 0x2]
   10975                      .dwattr $C$DW$1930, DW_AT_accessibility(DW_ACCESS_public)
   10976              $C$DW$1931      .dwtag  DW_TAG_member
   10977                      .dwattr $C$DW$1931, DW_AT_type(*$C$DW$T$48)
   10978                      .dwattr $C$DW$1931, DW_AT_name("value")
   10979                      .dwattr $C$DW$1931, DW_AT_TI_symbol_name("_value")
   10980                      .dwattr $C$DW$1931, DW_AT_data_member_location[DW_OP_plus_uconst 0xa]
   10981                      .dwattr $C$DW$1931, DW_AT_accessibility(DW_ACCESS_public)
   10982              $C$DW$1932      .dwtag  DW_TAG_member
   10983                      .dwattr $C$DW$1932, DW_AT_type(*$C$DW$T$48)
   10984                      .dwattr $C$DW$1932, DW_AT_name("offset")
   10985                      .dwattr $C$DW$1932, DW_AT_TI_symbol_name("_offset")
   10986                      .dwattr $C$DW$1932, DW_AT_data_member_location[DW_OP_plus_uconst 0x12]
   10987                      .dwattr $C$DW$1932, DW_AT_accessibility(DW_ACCESS_public)
   10988              $C$DW$1933      .dwtag  DW_TAG_member
   10989                      .dwattr $C$DW$1933, DW_AT_type(*$C$DW$T$48)
   10990                      .dwattr $C$DW$1933, DW_AT_name("gain")
   10991                      .dwattr $C$DW$1933, DW_AT_TI_symbol_name("_gain")
   10992                      .dwattr $C$DW$1933, DW_AT_data_member_location[DW_OP_plus_uconst 0x1a]
   10993                      .dwattr $C$DW$1933, DW_AT_accessibility(DW_ACCESS_public)
   10994                      .dwendtag $C$DW$T$49
   10995              
   10996              $C$DW$T$350     .dwtag  DW_TAG_typedef, DW_AT_name("HAL_DacData_t")
   10997                      .dwattr $C$DW$T$350, DW_AT_type(*$C$DW$T$49)
   10998                      .dwattr $C$DW$T$350, DW_AT_language(DW_LANG_C)
   10999              $C$DW$T$351     .dwtag  DW_TAG_pointer_type
   11000                      .dwattr $C$DW$T$351, DW_AT_type(*$C$DW$T$350)
   11001                      .dwattr $C$DW$T$351, DW_AT_address_class(0x16)
   11002              $C$DW$1934      .dwtag  DW_TAG_TI_far_type
   11003                      .dwattr $C$DW$1934, DW_AT_type(*$C$DW$T$351)
   11004              $C$DW$T$352     .dwtag  DW_TAG_const_type
   11005                      .dwattr $C$DW$T$352, DW_AT_type(*$C$DW$1934)
   11006              
   11007              $C$DW$T$90      .dwtag  DW_TAG_structure_type
   11008                      .dwattr $C$DW$T$90, DW_AT_name("_HAL_Obj_")
   11009                      .dwattr $C$DW$T$90, DW_AT_byte_size(0xb6)
   11010              $C$DW$1935      .dwtag  DW_TAG_member
   11011                      .dwattr $C$DW$1935, DW_AT_type(*$C$DW$T$51)
   11012                      .dwattr $C$DW$1935, DW_AT_name("adcHandle")
   11013                      .dwattr $C$DW$1935, DW_AT_TI_symbol_name("_adcHandle")
   11014                      .dwattr $C$DW$1935, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
TMS320C2000 Assembler PC v6.2.5 Sun Oct 08 22:37:56 2017

Tools Copyright (c) 1996-2014 Texas Instruments Incorporated
C:\Users\wmj\AppData\Local\Temp\0865210                              PAGE  211

   11015                      .dwattr $C$DW$1935, DW_AT_accessibility(DW_ACCESS_public)
   11016              $C$DW$1936      .dwtag  DW_TAG_member
   11017                      .dwattr $C$DW$1936, DW_AT_type(*$C$DW$T$53)
   11018                      .dwattr $C$DW$1936, DW_AT_name("clkHandle")
   11019                      .dwattr $C$DW$1936, DW_AT_TI_symbol_name("_clkHandle")
   11020                      .dwattr $C$DW$1936, DW_AT_data_member_location[DW_OP_plus_uconst 0x2]
   11021                      .dwattr $C$DW$1936, DW_AT_accessibility(DW_ACCESS_public)
   11022              $C$DW$1937      .dwtag  DW_TAG_member
   11023                      .dwattr $C$DW$1937, DW_AT_type(*$C$DW$T$55)
   11024                      .dwattr $C$DW$1937, DW_AT_name("cpuHandle")
   11025                      .dwattr $C$DW$1937, DW_AT_TI_symbol_name("_cpuHandle")
   11026                      .dwattr $C$DW$1937, DW_AT_data_member_location[DW_OP_plus_uconst 0x4]
   11027                      .dwattr $C$DW$1937, DW_AT_accessibility(DW_ACCESS_public)
   11028              $C$DW$1938      .dwtag  DW_TAG_member
   11029                      .dwattr $C$DW$1938, DW_AT_type(*$C$DW$T$57)
   11030                      .dwattr $C$DW$1938, DW_AT_name("flashHandle")
   11031                      .dwattr $C$DW$1938, DW_AT_TI_symbol_name("_flashHandle")
   11032                      .dwattr $C$DW$1938, DW_AT_data_member_location[DW_OP_plus_uconst 0x6]
   11033                      .dwattr $C$DW$1938, DW_AT_accessibility(DW_ACCESS_public)
   11034              $C$DW$1939      .dwtag  DW_TAG_member
   11035                      .dwattr $C$DW$1939, DW_AT_type(*$C$DW$T$59)
   11036                      .dwattr $C$DW$1939, DW_AT_name("gpioHandle")
   11037                      .dwattr $C$DW$1939, DW_AT_TI_symbol_name("_gpioHandle")
   11038                      .dwattr $C$DW$1939, DW_AT_data_member_location[DW_OP_plus_uconst 0x8]
   11039                      .dwattr $C$DW$1939, DW_AT_accessibility(DW_ACCESS_public)
   11040              $C$DW$1940      .dwtag  DW_TAG_member
   11041                      .dwattr $C$DW$1940, DW_AT_type(*$C$DW$T$62)
   11042                      .dwattr $C$DW$1940, DW_AT_name("offsetHandle_I")
   11043                      .dwattr $C$DW$1940, DW_AT_TI_symbol_name("_offsetHandle_I")
   11044                      .dwattr $C$DW$1940, DW_AT_data_member_location[DW_OP_plus_uconst 0xa]
   11045                      .dwattr $C$DW$1940, DW_AT_accessibility(DW_ACCESS_public)
   11046              $C$DW$1941      .dwtag  DW_TAG_member
   11047                      .dwattr $C$DW$1941, DW_AT_type(*$C$DW$T$64)
   11048                      .dwattr $C$DW$1941, DW_AT_name("offset_I")
   11049                      .dwattr $C$DW$1941, DW_AT_TI_symbol_name("_offset_I")
   11050                      .dwattr $C$DW$1941, DW_AT_data_member_location[DW_OP_plus_uconst 0x10]
   11051                      .dwattr $C$DW$1941, DW_AT_accessibility(DW_ACCESS_public)
   11052              $C$DW$1942      .dwtag  DW_TAG_member
   11053                      .dwattr $C$DW$1942, DW_AT_type(*$C$DW$T$62)
   11054                      .dwattr $C$DW$1942, DW_AT_name("offsetHandle_V")
   11055                      .dwattr $C$DW$1942, DW_AT_TI_symbol_name("_offsetHandle_V")
   11056                      .dwattr $C$DW$1942, DW_AT_data_member_location[DW_OP_plus_uconst 0x40]
   11057                      .dwattr $C$DW$1942, DW_AT_accessibility(DW_ACCESS_public)
   11058              $C$DW$1943      .dwtag  DW_TAG_member
   11059                      .dwattr $C$DW$1943, DW_AT_type(*$C$DW$T$64)
   11060                      .dwattr $C$DW$1943, DW_AT_name("offset_V")
   11061                      .dwattr $C$DW$1943, DW_AT_TI_symbol_name("_offset_V")
   11062                      .dwattr $C$DW$1943, DW_AT_data_member_location[DW_OP_plus_uconst 0x46]
   11063                      .dwattr $C$DW$1943, DW_AT_accessibility(DW_ACCESS_public)
   11064              $C$DW$1944      .dwtag  DW_TAG_member
   11065                      .dwattr $C$DW$1944, DW_AT_type(*$C$DW$T$66)
   11066                      .dwattr $C$DW$1944, DW_AT_name("oscHandle")
   11067                      .dwattr $C$DW$1944, DW_AT_TI_symbol_name("_oscHandle")
   11068                      .dwattr $C$DW$1944, DW_AT_data_member_location[DW_OP_plus_uconst 0x76]
   11069                      .dwattr $C$DW$1944, DW_AT_accessibility(DW_ACCESS_public)
TMS320C2000 Assembler PC v6.2.5 Sun Oct 08 22:37:56 2017

Tools Copyright (c) 1996-2014 Texas Instruments Incorporated
C:\Users\wmj\AppData\Local\Temp\0865210                              PAGE  212

   11070              $C$DW$1945      .dwtag  DW_TAG_member
   11071                      .dwattr $C$DW$1945, DW_AT_type(*$C$DW$T$68)
   11072                      .dwattr $C$DW$1945, DW_AT_name("pieHandle")
   11073                      .dwattr $C$DW$1945, DW_AT_TI_symbol_name("_pieHandle")
   11074                      .dwattr $C$DW$1945, DW_AT_data_member_location[DW_OP_plus_uconst 0x78]
   11075                      .dwattr $C$DW$1945, DW_AT_accessibility(DW_ACCESS_public)
   11076              $C$DW$1946      .dwtag  DW_TAG_member
   11077                      .dwattr $C$DW$1946, DW_AT_type(*$C$DW$T$70)
   11078                      .dwattr $C$DW$1946, DW_AT_name("pllHandle")
   11079                      .dwattr $C$DW$1946, DW_AT_TI_symbol_name("_pllHandle")
   11080                      .dwattr $C$DW$1946, DW_AT_data_member_location[DW_OP_plus_uconst 0x7a]
   11081                      .dwattr $C$DW$1946, DW_AT_accessibility(DW_ACCESS_public)
   11082              $C$DW$1947      .dwtag  DW_TAG_member
   11083                      .dwattr $C$DW$1947, DW_AT_type(*$C$DW$T$73)
   11084                      .dwattr $C$DW$1947, DW_AT_name("pwmHandle")
   11085                      .dwattr $C$DW$1947, DW_AT_TI_symbol_name("_pwmHandle")
   11086                      .dwattr $C$DW$1947, DW_AT_data_member_location[DW_OP_plus_uconst 0x7c]
   11087                      .dwattr $C$DW$1947, DW_AT_accessibility(DW_ACCESS_public)
   11088              $C$DW$1948      .dwtag  DW_TAG_member
   11089                      .dwattr $C$DW$1948, DW_AT_type(*$C$DW$T$73)
   11090                      .dwattr $C$DW$1948, DW_AT_name("pwmDacHandle")
   11091                      .dwattr $C$DW$1948, DW_AT_TI_symbol_name("_pwmDacHandle")
   11092                      .dwattr $C$DW$1948, DW_AT_data_member_location[DW_OP_plus_uconst 0x82]
   11093                      .dwattr $C$DW$1948, DW_AT_accessibility(DW_ACCESS_public)
   11094              $C$DW$1949      .dwtag  DW_TAG_member
   11095                      .dwattr $C$DW$1949, DW_AT_type(*$C$DW$T$75)
   11096                      .dwattr $C$DW$1949, DW_AT_name("pwrHandle")
   11097                      .dwattr $C$DW$1949, DW_AT_TI_symbol_name("_pwrHandle")
   11098                      .dwattr $C$DW$1949, DW_AT_data_member_location[DW_OP_plus_uconst 0x88]
   11099                      .dwattr $C$DW$1949, DW_AT_accessibility(DW_ACCESS_public)
   11100              $C$DW$1950      .dwtag  DW_TAG_member
   11101                      .dwattr $C$DW$1950, DW_AT_type(*$C$DW$T$78)
   11102                      .dwattr $C$DW$1950, DW_AT_name("timerHandle")
   11103                      .dwattr $C$DW$1950, DW_AT_TI_symbol_name("_timerHandle")
   11104                      .dwattr $C$DW$1950, DW_AT_data_member_location[DW_OP_plus_uconst 0x8a]
   11105                      .dwattr $C$DW$1950, DW_AT_accessibility(DW_ACCESS_public)
   11106              $C$DW$1951      .dwtag  DW_TAG_member
   11107                      .dwattr $C$DW$1951, DW_AT_type(*$C$DW$T$80)
   11108                      .dwattr $C$DW$1951, DW_AT_name("i2cHandle")
   11109                      .dwattr $C$DW$1951, DW_AT_TI_symbol_name("_i2cHandle")
   11110                      .dwattr $C$DW$1951, DW_AT_data_member_location[DW_OP_plus_uconst 0x90]
   11111                      .dwattr $C$DW$1951, DW_AT_accessibility(DW_ACCESS_public)
   11112              $C$DW$1952      .dwtag  DW_TAG_member
   11113                      .dwattr $C$DW$1952, DW_AT_type(*$C$DW$T$82)
   11114                      .dwattr $C$DW$1952, DW_AT_name("spiAHandle")
   11115                      .dwattr $C$DW$1952, DW_AT_TI_symbol_name("_spiAHandle")
   11116                      .dwattr $C$DW$1952, DW_AT_data_member_location[DW_OP_plus_uconst 0x92]
   11117                      .dwattr $C$DW$1952, DW_AT_accessibility(DW_ACCESS_public)
   11118              $C$DW$1953      .dwtag  DW_TAG_member
   11119                      .dwattr $C$DW$1953, DW_AT_type(*$C$DW$T$84)
   11120                      .dwattr $C$DW$1953, DW_AT_name("wdogHandle")
   11121                      .dwattr $C$DW$1953, DW_AT_TI_symbol_name("_wdogHandle")
   11122                      .dwattr $C$DW$1953, DW_AT_data_member_location[DW_OP_plus_uconst 0x94]
   11123                      .dwattr $C$DW$1953, DW_AT_accessibility(DW_ACCESS_public)
   11124              $C$DW$1954      .dwtag  DW_TAG_member
TMS320C2000 Assembler PC v6.2.5 Sun Oct 08 22:37:56 2017

Tools Copyright (c) 1996-2014 Texas Instruments Incorporated
C:\Users\wmj\AppData\Local\Temp\0865210                              PAGE  213

   11125                      .dwattr $C$DW$1954, DW_AT_type(*$C$DW$T$86)
   11126                      .dwattr $C$DW$1954, DW_AT_name("sciHandle")
   11127                      .dwattr $C$DW$1954, DW_AT_TI_symbol_name("_sciHandle")
   11128                      .dwattr $C$DW$1954, DW_AT_data_member_location[DW_OP_plus_uconst 0x96]
   11129                      .dwattr $C$DW$1954, DW_AT_accessibility(DW_ACCESS_public)
   11130              $C$DW$1955      .dwtag  DW_TAG_member
   11131                      .dwattr $C$DW$1955, DW_AT_type(*$C$DW$T$87)
   11132                      .dwattr $C$DW$1955, DW_AT_name("adcBias")
   11133                      .dwattr $C$DW$1955, DW_AT_TI_symbol_name("_adcBias")
   11134                      .dwattr $C$DW$1955, DW_AT_data_member_location[DW_OP_plus_uconst 0x98]
   11135                      .dwattr $C$DW$1955, DW_AT_accessibility(DW_ACCESS_public)
   11136              $C$DW$1956      .dwtag  DW_TAG_member
   11137                      .dwattr $C$DW$1956, DW_AT_type(*$C$DW$T$35)
   11138                      .dwattr $C$DW$1956, DW_AT_name("current_sf")
   11139                      .dwattr $C$DW$1956, DW_AT_TI_symbol_name("_current_sf")
   11140                      .dwattr $C$DW$1956, DW_AT_data_member_location[DW_OP_plus_uconst 0xae]
   11141                      .dwattr $C$DW$1956, DW_AT_accessibility(DW_ACCESS_public)
   11142              $C$DW$1957      .dwtag  DW_TAG_member
   11143                      .dwattr $C$DW$1957, DW_AT_type(*$C$DW$T$35)
   11144                      .dwattr $C$DW$1957, DW_AT_name("voltage_sf")
   11145                      .dwattr $C$DW$1957, DW_AT_TI_symbol_name("_voltage_sf")
   11146                      .dwattr $C$DW$1957, DW_AT_data_member_location[DW_OP_plus_uconst 0xb0]
   11147                      .dwattr $C$DW$1957, DW_AT_accessibility(DW_ACCESS_public)
   11148              $C$DW$1958      .dwtag  DW_TAG_member
   11149                      .dwattr $C$DW$1958, DW_AT_type(*$C$DW$T$33)
   11150                      .dwattr $C$DW$1958, DW_AT_name("numCurrentSensors")
   11151                      .dwattr $C$DW$1958, DW_AT_TI_symbol_name("_numCurrentSensors")
   11152                      .dwattr $C$DW$1958, DW_AT_data_member_location[DW_OP_plus_uconst 0xb2]
   11153                      .dwattr $C$DW$1958, DW_AT_accessibility(DW_ACCESS_public)
   11154              $C$DW$1959      .dwtag  DW_TAG_member
   11155                      .dwattr $C$DW$1959, DW_AT_type(*$C$DW$T$33)
   11156                      .dwattr $C$DW$1959, DW_AT_name("numVoltageSensors")
   11157                      .dwattr $C$DW$1959, DW_AT_TI_symbol_name("_numVoltageSensors")
   11158                      .dwattr $C$DW$1959, DW_AT_data_member_location[DW_OP_plus_uconst 0xb3]
   11159                      .dwattr $C$DW$1959, DW_AT_accessibility(DW_ACCESS_public)
   11160              $C$DW$1960      .dwtag  DW_TAG_member
   11161                      .dwattr $C$DW$1960, DW_AT_type(*$C$DW$T$89)
   11162                      .dwattr $C$DW$1960, DW_AT_name("boardAddress")
   11163                      .dwattr $C$DW$1960, DW_AT_TI_symbol_name("_boardAddress")
   11164                      .dwattr $C$DW$1960, DW_AT_data_member_location[DW_OP_plus_uconst 0xb4]
   11165                      .dwattr $C$DW$1960, DW_AT_accessibility(DW_ACCESS_public)
   11166                      .dwendtag $C$DW$T$90
   11167              
   11168              $C$DW$T$355     .dwtag  DW_TAG_typedef, DW_AT_name("HAL_Obj")
   11169                      .dwattr $C$DW$T$355, DW_AT_type(*$C$DW$T$90)
   11170                      .dwattr $C$DW$T$355, DW_AT_language(DW_LANG_C)
   11171              $C$DW$T$356     .dwtag  DW_TAG_pointer_type
   11172                      .dwattr $C$DW$T$356, DW_AT_type(*$C$DW$T$355)
   11173                      .dwattr $C$DW$T$356, DW_AT_address_class(0x16)
   11174              $C$DW$T$357     .dwtag  DW_TAG_pointer_type
   11175                      .dwattr $C$DW$T$357, DW_AT_type(*$C$DW$T$90)
   11176                      .dwattr $C$DW$T$357, DW_AT_address_class(0x16)
   11177              $C$DW$T$358     .dwtag  DW_TAG_typedef, DW_AT_name("HAL_Handle")
   11178                      .dwattr $C$DW$T$358, DW_AT_type(*$C$DW$T$357)
   11179                      .dwattr $C$DW$T$358, DW_AT_language(DW_LANG_C)
TMS320C2000 Assembler PC v6.2.5 Sun Oct 08 22:37:56 2017

Tools Copyright (c) 1996-2014 Texas Instruments Incorporated
C:\Users\wmj\AppData\Local\Temp\0865210                              PAGE  214

   11180              $C$DW$1961      .dwtag  DW_TAG_TI_far_type
   11181                      .dwattr $C$DW$1961, DW_AT_type(*$C$DW$T$358)
   11182              $C$DW$T$359     .dwtag  DW_TAG_const_type
   11183                      .dwattr $C$DW$T$359, DW_AT_type(*$C$DW$1961)
   11184              
   11185              $C$DW$T$92      .dwtag  DW_TAG_structure_type
   11186                      .dwattr $C$DW$T$92, DW_AT_name("_MATH_vec3_")
   11187                      .dwattr $C$DW$T$92, DW_AT_byte_size(0x06)
   11188              $C$DW$1962      .dwtag  DW_TAG_member
   11189                      .dwattr $C$DW$1962, DW_AT_type(*$C$DW$T$91)
   11190                      .dwattr $C$DW$1962, DW_AT_name("value")
   11191                      .dwattr $C$DW$1962, DW_AT_TI_symbol_name("_value")
   11192                      .dwattr $C$DW$1962, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
   11193                      .dwattr $C$DW$1962, DW_AT_accessibility(DW_ACCESS_public)
   11194                      .dwendtag $C$DW$T$92
   11195              
   11196              $C$DW$T$43      .dwtag  DW_TAG_typedef, DW_AT_name("MATH_vec3")
   11197                      .dwattr $C$DW$T$43, DW_AT_type(*$C$DW$T$92)
   11198                      .dwattr $C$DW$T$43, DW_AT_language(DW_LANG_C)
   11199              
   11200              $C$DW$T$96      .dwtag  DW_TAG_structure_type
   11201                      .dwattr $C$DW$T$96, DW_AT_name("_OFFSET_")
   11202                      .dwattr $C$DW$T$96, DW_AT_byte_size(0x10)
   11203              $C$DW$1963      .dwtag  DW_TAG_member
   11204                      .dwattr $C$DW$1963, DW_AT_type(*$C$DW$T$35)
   11205                      .dwattr $C$DW$1963, DW_AT_name("value")
   11206                      .dwattr $C$DW$1963, DW_AT_TI_symbol_name("_value")
   11207                      .dwattr $C$DW$1963, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
   11208                      .dwattr $C$DW$1963, DW_AT_accessibility(DW_ACCESS_public)
   11209              $C$DW$1964      .dwtag  DW_TAG_member
   11210                      .dwattr $C$DW$1964, DW_AT_type(*$C$DW$T$35)
   11211                      .dwattr $C$DW$1964, DW_AT_name("bias")
   11212                      .dwattr $C$DW$1964, DW_AT_TI_symbol_name("_bias")
   11213                      .dwattr $C$DW$1964, DW_AT_data_member_location[DW_OP_plus_uconst 0x2]
   11214                      .dwattr $C$DW$1964, DW_AT_accessibility(DW_ACCESS_public)
   11215              $C$DW$1965      .dwtag  DW_TAG_member
   11216                      .dwattr $C$DW$1965, DW_AT_type(*$C$DW$T$93)
   11217                      .dwattr $C$DW$1965, DW_AT_name("filter")
   11218                      .dwattr $C$DW$1965, DW_AT_TI_symbol_name("_filter")
   11219                      .dwattr $C$DW$1965, DW_AT_data_member_location[DW_OP_plus_uconst 0x4]
   11220                      .dwattr $C$DW$1965, DW_AT_accessibility(DW_ACCESS_public)
   11221              $C$DW$1966      .dwtag  DW_TAG_member
   11222                      .dwattr $C$DW$1966, DW_AT_type(*$C$DW$T$95)
   11223                      .dwattr $C$DW$1966, DW_AT_name("filterHandle")
   11224                      .dwattr $C$DW$1966, DW_AT_TI_symbol_name("_filterHandle")
   11225                      .dwattr $C$DW$1966, DW_AT_data_member_location[DW_OP_plus_uconst 0xe]
   11226                      .dwattr $C$DW$1966, DW_AT_accessibility(DW_ACCESS_public)
   11227                      .dwendtag $C$DW$T$96
   11228              
   11229              $C$DW$T$63      .dwtag  DW_TAG_typedef, DW_AT_name("OFFSET_Obj")
   11230                      .dwattr $C$DW$T$63, DW_AT_type(*$C$DW$T$96)
   11231                      .dwattr $C$DW$T$63, DW_AT_language(DW_LANG_C)
   11232              
   11233              $C$DW$T$64      .dwtag  DW_TAG_array_type
   11234                      .dwattr $C$DW$T$64, DW_AT_type(*$C$DW$T$63)
TMS320C2000 Assembler PC v6.2.5 Sun Oct 08 22:37:56 2017

Tools Copyright (c) 1996-2014 Texas Instruments Incorporated
C:\Users\wmj\AppData\Local\Temp\0865210                              PAGE  215

   11235                      .dwattr $C$DW$T$64, DW_AT_language(DW_LANG_C)
   11236                      .dwattr $C$DW$T$64, DW_AT_byte_size(0x30)
   11237              $C$DW$1967      .dwtag  DW_TAG_subrange_type
   11238                      .dwattr $C$DW$1967, DW_AT_upper_bound(0x02)
   11239                      .dwendtag $C$DW$T$64
   11240              
   11241              
   11242              $C$DW$T$21      .dwtag  DW_TAG_structure_type
   11243                      .dwattr $C$DW$T$21, DW_AT_name("_OFFSET_Obj_")
   11244                      .dwattr $C$DW$T$21, DW_AT_declaration
   11245                      .dwendtag $C$DW$T$21
   11246              
   11247              $C$DW$T$60      .dwtag  DW_TAG_pointer_type
   11248                      .dwattr $C$DW$T$60, DW_AT_type(*$C$DW$T$21)
   11249                      .dwattr $C$DW$T$60, DW_AT_address_class(0x16)
   11250              $C$DW$T$61      .dwtag  DW_TAG_typedef, DW_AT_name("OFFSET_Handle")
   11251                      .dwattr $C$DW$T$61, DW_AT_type(*$C$DW$T$60)
   11252                      .dwattr $C$DW$T$61, DW_AT_language(DW_LANG_C)
   11253              
   11254              $C$DW$T$62      .dwtag  DW_TAG_array_type
   11255                      .dwattr $C$DW$T$62, DW_AT_type(*$C$DW$T$61)
   11256                      .dwattr $C$DW$T$62, DW_AT_language(DW_LANG_C)
   11257                      .dwattr $C$DW$T$62, DW_AT_byte_size(0x06)
   11258              $C$DW$1968      .dwtag  DW_TAG_subrange_type
   11259                      .dwattr $C$DW$1968, DW_AT_upper_bound(0x02)
   11260                      .dwendtag $C$DW$T$62
   11261              
   11262              
   11263              $C$DW$T$97      .dwtag  DW_TAG_structure_type
   11264                      .dwattr $C$DW$T$97, DW_AT_name("_OSC_Obj_")
   11265                      .dwattr $C$DW$T$97, DW_AT_byte_size(0x03)
   11266              $C$DW$1969      .dwtag  DW_TAG_member
   11267                      .dwattr $C$DW$1969, DW_AT_type(*$C$DW$T$23)
   11268                      .dwattr $C$DW$1969, DW_AT_name("INTOSC1TRIM")
   11269                      .dwattr $C$DW$1969, DW_AT_TI_symbol_name("_INTOSC1TRIM")
   11270                      .dwattr $C$DW$1969, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
   11271                      .dwattr $C$DW$1969, DW_AT_accessibility(DW_ACCESS_public)
   11272              $C$DW$1970      .dwtag  DW_TAG_member
   11273                      .dwattr $C$DW$1970, DW_AT_type(*$C$DW$T$23)
   11274                      .dwattr $C$DW$1970, DW_AT_name("rsvd_1")
   11275                      .dwattr $C$DW$1970, DW_AT_TI_symbol_name("_rsvd_1")
   11276                      .dwattr $C$DW$1970, DW_AT_data_member_location[DW_OP_plus_uconst 0x1]
   11277                      .dwattr $C$DW$1970, DW_AT_accessibility(DW_ACCESS_public)
   11278              $C$DW$1971      .dwtag  DW_TAG_member
   11279                      .dwattr $C$DW$1971, DW_AT_type(*$C$DW$T$23)
   11280                      .dwattr $C$DW$1971, DW_AT_name("INTOSC2TRIM")
   11281                      .dwattr $C$DW$1971, DW_AT_TI_symbol_name("_INTOSC2TRIM")
   11282                      .dwattr $C$DW$1971, DW_AT_data_member_location[DW_OP_plus_uconst 0x2]
   11283                      .dwattr $C$DW$1971, DW_AT_accessibility(DW_ACCESS_public)
   11284                      .dwendtag $C$DW$T$97
   11285              
   11286              $C$DW$T$65      .dwtag  DW_TAG_pointer_type
   11287                      .dwattr $C$DW$T$65, DW_AT_type(*$C$DW$T$97)
   11288                      .dwattr $C$DW$T$65, DW_AT_address_class(0x16)
   11289              $C$DW$T$66      .dwtag  DW_TAG_typedef, DW_AT_name("OSC_Handle")
TMS320C2000 Assembler PC v6.2.5 Sun Oct 08 22:37:56 2017

Tools Copyright (c) 1996-2014 Texas Instruments Incorporated
C:\Users\wmj\AppData\Local\Temp\0865210                              PAGE  216

   11290                      .dwattr $C$DW$T$66, DW_AT_type(*$C$DW$T$65)
   11291                      .dwattr $C$DW$T$66, DW_AT_language(DW_LANG_C)
   11292              
   11293              $C$DW$T$98      .dwtag  DW_TAG_structure_type
   11294                      .dwattr $C$DW$T$98, DW_AT_name("_PIE_IERIFR_t")
   11295                      .dwattr $C$DW$T$98, DW_AT_byte_size(0x02)
   11296              $C$DW$1972      .dwtag  DW_TAG_member
   11297                      .dwattr $C$DW$1972, DW_AT_type(*$C$DW$T$23)
   11298                      .dwattr $C$DW$1972, DW_AT_name("IER")
   11299                      .dwattr $C$DW$1972, DW_AT_TI_symbol_name("_IER")
   11300                      .dwattr $C$DW$1972, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
   11301                      .dwattr $C$DW$1972, DW_AT_accessibility(DW_ACCESS_public)
   11302              $C$DW$1973      .dwtag  DW_TAG_member
   11303                      .dwattr $C$DW$1973, DW_AT_type(*$C$DW$T$23)
   11304                      .dwattr $C$DW$1973, DW_AT_name("IFR")
   11305                      .dwattr $C$DW$1973, DW_AT_TI_symbol_name("_IFR")
   11306                      .dwattr $C$DW$1973, DW_AT_data_member_location[DW_OP_plus_uconst 0x1]
   11307                      .dwattr $C$DW$1973, DW_AT_accessibility(DW_ACCESS_public)
   11308                      .dwendtag $C$DW$T$98
   11309              
   11310              $C$DW$T$99      .dwtag  DW_TAG_typedef, DW_AT_name("PIE_IERIFR_t")
   11311                      .dwattr $C$DW$T$99, DW_AT_type(*$C$DW$T$98)
   11312                      .dwattr $C$DW$T$99, DW_AT_language(DW_LANG_C)
   11313              $C$DW$1974      .dwtag  DW_TAG_TI_far_type
   11314                      .dwattr $C$DW$1974, DW_AT_type(*$C$DW$T$99)
   11315              $C$DW$T$100     .dwtag  DW_TAG_volatile_type
   11316                      .dwattr $C$DW$T$100, DW_AT_type(*$C$DW$1974)
   11317              
   11318              $C$DW$T$101     .dwtag  DW_TAG_array_type
   11319                      .dwattr $C$DW$T$101, DW_AT_type(*$C$DW$T$100)
   11320                      .dwattr $C$DW$T$101, DW_AT_language(DW_LANG_C)
   11321                      .dwattr $C$DW$T$101, DW_AT_byte_size(0x18)
   11322              $C$DW$1975      .dwtag  DW_TAG_subrange_type
   11323                      .dwattr $C$DW$1975, DW_AT_upper_bound(0x0b)
   11324                      .dwendtag $C$DW$T$101
   11325              
   11326              
   11327              $C$DW$T$108     .dwtag  DW_TAG_structure_type
   11328                      .dwattr $C$DW$T$108, DW_AT_name("_PIE_Obj_")
   11329                      .dwattr $C$DW$T$108, DW_AT_byte_size(0x639c)
   11330              $C$DW$1976      .dwtag  DW_TAG_member
   11331                      .dwattr $C$DW$1976, DW_AT_type(*$C$DW$T$23)
   11332                      .dwattr $C$DW$1976, DW_AT_name("PIECTRL")
   11333                      .dwattr $C$DW$1976, DW_AT_TI_symbol_name("_PIECTRL")
   11334                      .dwattr $C$DW$1976, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
   11335                      .dwattr $C$DW$1976, DW_AT_accessibility(DW_ACCESS_public)
   11336              $C$DW$1977      .dwtag  DW_TAG_member
   11337                      .dwattr $C$DW$1977, DW_AT_type(*$C$DW$T$23)
   11338                      .dwattr $C$DW$1977, DW_AT_name("PIEACK")
   11339                      .dwattr $C$DW$1977, DW_AT_TI_symbol_name("_PIEACK")
   11340                      .dwattr $C$DW$1977, DW_AT_data_member_location[DW_OP_plus_uconst 0x1]
   11341                      .dwattr $C$DW$1977, DW_AT_accessibility(DW_ACCESS_public)
   11342              $C$DW$1978      .dwtag  DW_TAG_member
   11343                      .dwattr $C$DW$1978, DW_AT_type(*$C$DW$T$101)
   11344                      .dwattr $C$DW$1978, DW_AT_name("PIEIER_PIEIFR")
TMS320C2000 Assembler PC v6.2.5 Sun Oct 08 22:37:56 2017

Tools Copyright (c) 1996-2014 Texas Instruments Incorporated
C:\Users\wmj\AppData\Local\Temp\0865210                              PAGE  217

   11345                      .dwattr $C$DW$1978, DW_AT_TI_symbol_name("_PIEIER_PIEIFR")
   11346                      .dwattr $C$DW$1978, DW_AT_data_member_location[DW_OP_plus_uconst 0x2]
   11347                      .dwattr $C$DW$1978, DW_AT_accessibility(DW_ACCESS_public)
   11348              $C$DW$1979      .dwtag  DW_TAG_member
   11349                      .dwattr $C$DW$1979, DW_AT_type(*$C$DW$T$102)
   11350                      .dwattr $C$DW$1979, DW_AT_name("rsvd_1")
   11351                      .dwattr $C$DW$1979, DW_AT_TI_symbol_name("_rsvd_1")
   11352                      .dwattr $C$DW$1979, DW_AT_data_member_location[DW_OP_plus_uconst 0x1a]
   11353                      .dwattr $C$DW$1979, DW_AT_accessibility(DW_ACCESS_public)
   11354              $C$DW$1980      .dwtag  DW_TAG_member
   11355                      .dwattr $C$DW$1980, DW_AT_type(*$C$DW$T$106)
   11356                      .dwattr $C$DW$1980, DW_AT_name("Reset")
   11357                      .dwattr $C$DW$1980, DW_AT_TI_symbol_name("_Reset")
   11358                      .dwattr $C$DW$1980, DW_AT_data_member_location[DW_OP_plus_uconst 0x20]
   11359                      .dwattr $C$DW$1980, DW_AT_accessibility(DW_ACCESS_public)
   11360              $C$DW$1981      .dwtag  DW_TAG_member
   11361                      .dwattr $C$DW$1981, DW_AT_type(*$C$DW$T$106)
   11362                      .dwattr $C$DW$1981, DW_AT_name("INT1")
   11363                      .dwattr $C$DW$1981, DW_AT_TI_symbol_name("_INT1")
   11364                      .dwattr $C$DW$1981, DW_AT_data_member_location[DW_OP_plus_uconst 0x22]
   11365                      .dwattr $C$DW$1981, DW_AT_accessibility(DW_ACCESS_public)
   11366              $C$DW$1982      .dwtag  DW_TAG_member
   11367                      .dwattr $C$DW$1982, DW_AT_type(*$C$DW$T$106)
   11368                      .dwattr $C$DW$1982, DW_AT_name("INT2")
   11369                      .dwattr $C$DW$1982, DW_AT_TI_symbol_name("_INT2")
   11370                      .dwattr $C$DW$1982, DW_AT_data_member_location[DW_OP_plus_uconst 0x24]
   11371                      .dwattr $C$DW$1982, DW_AT_accessibility(DW_ACCESS_public)
   11372              $C$DW$1983      .dwtag  DW_TAG_member
   11373                      .dwattr $C$DW$1983, DW_AT_type(*$C$DW$T$106)
   11374                      .dwattr $C$DW$1983, DW_AT_name("INT3")
   11375                      .dwattr $C$DW$1983, DW_AT_TI_symbol_name("_INT3")
   11376                      .dwattr $C$DW$1983, DW_AT_data_member_location[DW_OP_plus_uconst 0x26]
   11377                      .dwattr $C$DW$1983, DW_AT_accessibility(DW_ACCESS_public)
   11378              $C$DW$1984      .dwtag  DW_TAG_member
   11379                      .dwattr $C$DW$1984, DW_AT_type(*$C$DW$T$106)
   11380                      .dwattr $C$DW$1984, DW_AT_name("INT4")
   11381                      .dwattr $C$DW$1984, DW_AT_TI_symbol_name("_INT4")
   11382                      .dwattr $C$DW$1984, DW_AT_data_member_location[DW_OP_plus_uconst 0x28]
   11383                      .dwattr $C$DW$1984, DW_AT_accessibility(DW_ACCESS_public)
   11384              $C$DW$1985      .dwtag  DW_TAG_member
   11385                      .dwattr $C$DW$1985, DW_AT_type(*$C$DW$T$106)
   11386                      .dwattr $C$DW$1985, DW_AT_name("INT5")
   11387                      .dwattr $C$DW$1985, DW_AT_TI_symbol_name("_INT5")
   11388                      .dwattr $C$DW$1985, DW_AT_data_member_location[DW_OP_plus_uconst 0x2a]
   11389                      .dwattr $C$DW$1985, DW_AT_accessibility(DW_ACCESS_public)
   11390              $C$DW$1986      .dwtag  DW_TAG_member
   11391                      .dwattr $C$DW$1986, DW_AT_type(*$C$DW$T$106)
   11392                      .dwattr $C$DW$1986, DW_AT_name("INT6")
   11393                      .dwattr $C$DW$1986, DW_AT_TI_symbol_name("_INT6")
   11394                      .dwattr $C$DW$1986, DW_AT_data_member_location[DW_OP_plus_uconst 0x2c]
   11395                      .dwattr $C$DW$1986, DW_AT_accessibility(DW_ACCESS_public)
   11396              $C$DW$1987      .dwtag  DW_TAG_member
   11397                      .dwattr $C$DW$1987, DW_AT_type(*$C$DW$T$106)
   11398                      .dwattr $C$DW$1987, DW_AT_name("INT7")
   11399                      .dwattr $C$DW$1987, DW_AT_TI_symbol_name("_INT7")
TMS320C2000 Assembler PC v6.2.5 Sun Oct 08 22:37:56 2017

Tools Copyright (c) 1996-2014 Texas Instruments Incorporated
C:\Users\wmj\AppData\Local\Temp\0865210                              PAGE  218

   11400                      .dwattr $C$DW$1987, DW_AT_data_member_location[DW_OP_plus_uconst 0x2e]
   11401                      .dwattr $C$DW$1987, DW_AT_accessibility(DW_ACCESS_public)
   11402              $C$DW$1988      .dwtag  DW_TAG_member
   11403                      .dwattr $C$DW$1988, DW_AT_type(*$C$DW$T$106)
   11404                      .dwattr $C$DW$1988, DW_AT_name("INT8")
   11405                      .dwattr $C$DW$1988, DW_AT_TI_symbol_name("_INT8")
   11406                      .dwattr $C$DW$1988, DW_AT_data_member_location[DW_OP_plus_uconst 0x30]
   11407                      .dwattr $C$DW$1988, DW_AT_accessibility(DW_ACCESS_public)
   11408              $C$DW$1989      .dwtag  DW_TAG_member
   11409                      .dwattr $C$DW$1989, DW_AT_type(*$C$DW$T$106)
   11410                      .dwattr $C$DW$1989, DW_AT_name("INT9")
   11411                      .dwattr $C$DW$1989, DW_AT_TI_symbol_name("_INT9")
   11412                      .dwattr $C$DW$1989, DW_AT_data_member_location[DW_OP_plus_uconst 0x32]
   11413                      .dwattr $C$DW$1989, DW_AT_accessibility(DW_ACCESS_public)
   11414              $C$DW$1990      .dwtag  DW_TAG_member
   11415                      .dwattr $C$DW$1990, DW_AT_type(*$C$DW$T$106)
   11416                      .dwattr $C$DW$1990, DW_AT_name("INT10")
