TMS320C2000 Assembler PC v6.2.5 Sat Sep 16 15:41:33 2017

Tools Copyright (c) 1996-2014 Texas Instruments Incorporated
C:\Users\wmj\AppData\Local\Temp\1302810                              PAGE    1

       1              ;***************************************************************
       2              ;* TMS320C2000 C/C++ Codegen                         PC v6.2.5 *
       3              ;* Date/Time created: Sat Sep 16 15:41:32 2017                 *
       4              ;***************************************************************
       5                      .compiler_opts --float_support=softlib --hll_source=on --mem_model:code=flat --mem_model:data=large -
       6        0002  FP      .set    XAR2
       7              
       8              $C$DW$CU        .dwtag  DW_TAG_compile_unit
       9                      .dwattr $C$DW$CU, DW_AT_name("D:/BM1000/sw/modules/hal/boards/hvkit_rev1p1/f28x/f2802x/src/hal.c")
      10                      .dwattr $C$DW$CU, DW_AT_producer("TMS320C2000 C/C++ Codegen PC v6.2.5 Copyright (c) 1996-2014 Texas I
      11                      .dwattr $C$DW$CU, DW_AT_TI_version(0x01)
      12                      .dwattr $C$DW$CU, DW_AT_comp_dir("D:\BM1000\sw\solutions\instaspin_foc\boards\hvkit_rev1p1\f28x\f2802
      13              
      14              $C$DW$1 .dwtag  DW_TAG_subprogram, DW_AT_name("SPI_setMode")
      15                      .dwattr $C$DW$1, DW_AT_TI_symbol_name("_SPI_setMode")

   10068                      .dwattr $C$DW$T$314, DW_AT_type(*$C$DW$T$313)
   10069                      .dwattr $C$DW$T$314, DW_AT_language(DW_LANG_C)
   10070              $C$DW$1805      .dwtag  DW_TAG_TI_far_type
   10071                      .dwattr $C$DW$1805, DW_AT_type(*$C$DW$T$314)
   10072              $C$DW$T$315     .dwtag  DW_TAG_const_type
   10073                      .dwattr $C$DW$T$315, DW_AT_type(*$C$DW$1805)
   10074              
   10075              $C$DW$T$316     .dwtag  DW_TAG_enumeration_type
   10076                      .dwattr $C$DW$T$316, DW_AT_byte_size(0x01)
   10077              $C$DW$1806      .dwtag  DW_TAG_enumerator, DW_AT_name("SCI_Mode_IdleLine"), DW_AT_const_value(0x00)
   10078              $C$DW$1807      .dwtag  DW_TAG_enumerator, DW_AT_name("SCI_Mode_AddressBit"), DW_AT_const_value(0x08)
   10079                      .dwendtag $C$DW$T$316
   10080              
   10081              $C$DW$T$317     .dwtag  DW_TAG_typedef, DW_AT_name("SCI_Mode_e")
TMS320C2000 Assembler PC v6.2.5 Sat Sep 16 15:41:33 2017

Tools Copyright (c) 1996-2014 Texas Instruments Incorporated
C:\Users\wmj\AppData\Local\Temp\1302810                              PAGE  194

   10082                      .dwattr $C$DW$T$317, DW_AT_type(*$C$DW$T$316)
   10083                      .dwattr $C$DW$T$317, DW_AT_language(DW_LANG_C)
   10084              $C$DW$1808      .dwtag  DW_TAG_TI_far_type
   10085                      .dwattr $C$DW$1808, DW_AT_type(*$C$DW$T$317)
   10086              $C$DW$T$318     .dwtag  DW_TAG_const_type
   10087                      .dwattr $C$DW$T$318, DW_AT_type(*$C$DW$1808)
   10088              
   10089              $C$DW$T$319     .dwtag  DW_TAG_enumeration_type
   10090                      .dwattr $C$DW$T$319, DW_AT_byte_size(0x01)
   10091              $C$DW$1809      .dwtag  DW_TAG_enumerator, DW_AT_name("SCI_NumStopBits_One"), DW_AT_const_value(0x00)
   10092              $C$DW$1810      .dwtag  DW_TAG_enumerator, DW_AT_name("SCI_NumStopBits_Two"), DW_AT_const_value(0x80)
   10093                      .dwendtag $C$DW$T$319
   10094              
   10095              $C$DW$T$320     .dwtag  DW_TAG_typedef, DW_AT_name("SCI_NumStopBits_e")
   10096                      .dwattr $C$DW$T$320, DW_AT_type(*$C$DW$T$319)
   10097                      .dwattr $C$DW$T$320, DW_AT_language(DW_LANG_C)
   10098              $C$DW$1811      .dwtag  DW_TAG_TI_far_type
   10099                      .dwattr $C$DW$1811, DW_AT_type(*$C$DW$T$320)
   10100              $C$DW$T$321     .dwtag  DW_TAG_const_type
   10101                      .dwattr $C$DW$T$321, DW_AT_type(*$C$DW$1811)
   10102              
   10103              $C$DW$T$322     .dwtag  DW_TAG_enumeration_type
   10104                      .dwattr $C$DW$T$322, DW_AT_byte_size(0x01)
   10105              $C$DW$1812      .dwtag  DW_TAG_enumerator, DW_AT_name("SCI_Parity_Odd"), DW_AT_const_value(0x00)
   10106              $C$DW$1813      .dwtag  DW_TAG_enumerator, DW_AT_name("SCI_Parity_Even"), DW_AT_const_value(0x40)
   10107                      .dwendtag $C$DW$T$322
   10108              
   10109              $C$DW$T$323     .dwtag  DW_TAG_typedef, DW_AT_name("SCI_Parity_e")
   10110                      .dwattr $C$DW$T$323, DW_AT_type(*$C$DW$T$322)
   10111                      .dwattr $C$DW$T$323, DW_AT_language(DW_LANG_C)
   10112              $C$DW$1814      .dwtag  DW_TAG_TI_far_type
   10113                      .dwattr $C$DW$1814, DW_AT_type(*$C$DW$T$323)
   10114              $C$DW$T$324     .dwtag  DW_TAG_const_type
   10115                      .dwattr $C$DW$T$324, DW_AT_type(*$C$DW$1814)
   10116              
   10117              $C$DW$T$325     .dwtag  DW_TAG_enumeration_type
   10118                      .dwattr $C$DW$T$325, DW_AT_byte_size(0x01)
   10119              $C$DW$1815      .dwtag  DW_TAG_enumerator, DW_AT_name("HAL_SensorType_Current"), DW_AT_const_value(0x00)
   10120              $C$DW$1816      .dwtag  DW_TAG_enumerator, DW_AT_name("HAL_SensorType_Voltage"), DW_AT_const_value(0x01)
   10121                      .dwendtag $C$DW$T$325
   10122              
   10123              $C$DW$T$326     .dwtag  DW_TAG_typedef, DW_AT_name("HAL_SensorType_e")
   10124                      .dwattr $C$DW$T$326, DW_AT_type(*$C$DW$T$325)
   10125                      .dwattr $C$DW$T$326, DW_AT_language(DW_LANG_C)
   10126              
   10127              $C$DW$T$19      .dwtag  DW_TAG_structure_type
   10128                      .dwattr $C$DW$T$19, DW_AT_name("I2C_Obj")
   10129                      .dwattr $C$DW$T$19, DW_AT_declaration
   10130                      .dwendtag $C$DW$T$19
   10131              
   10132              $C$DW$T$79      .dwtag  DW_TAG_pointer_type
   10133                      .dwattr $C$DW$T$79, DW_AT_type(*$C$DW$T$19)
   10134                      .dwattr $C$DW$T$79, DW_AT_address_class(0x16)
   10135              $C$DW$T$80      .dwtag  DW_TAG_typedef, DW_AT_name("I2C_Handle")
   10136                      .dwattr $C$DW$T$80, DW_AT_type(*$C$DW$T$79)
TMS320C2000 Assembler PC v6.2.5 Sat Sep 16 15:41:33 2017

Tools Copyright (c) 1996-2014 Texas Instruments Incorporated
C:\Users\wmj\AppData\Local\Temp\1302810                              PAGE  195

   10137                      .dwattr $C$DW$T$80, DW_AT_language(DW_LANG_C)
   10138              
   10139              $C$DW$T$30      .dwtag  DW_TAG_structure_type
   10140                      .dwattr $C$DW$T$30, DW_AT_name("_ADC_Obj_")
   10141                      .dwattr $C$DW$T$30, DW_AT_byte_size(0x6650)
   10142              $C$DW$1817      .dwtag  DW_TAG_member
   10143                      .dwattr $C$DW$1817, DW_AT_type(*$C$DW$T$24)
   10144                      .dwattr $C$DW$1817, DW_AT_name("ADCRESULT")
   10145                      .dwattr $C$DW$1817, DW_AT_TI_symbol_name("_ADCRESULT")
   10146                      .dwattr $C$DW$1817, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
   10147                      .dwattr $C$DW$1817, DW_AT_accessibility(DW_ACCESS_public)
   10148              $C$DW$1818      .dwtag  DW_TAG_member
   10149                      .dwattr $C$DW$1818, DW_AT_type(*$C$DW$T$25)
   10150                      .dwattr $C$DW$1818, DW_AT_name("resvd_1")
   10151                      .dwattr $C$DW$1818, DW_AT_TI_symbol_name("_resvd_1")
   10152                      .dwattr $C$DW$1818, DW_AT_data_member_location[DW_OP_plus_uconst 0x10]
   10153                      .dwattr $C$DW$1818, DW_AT_accessibility(DW_ACCESS_public)
   10154              $C$DW$1819      .dwtag  DW_TAG_member
   10155                      .dwattr $C$DW$1819, DW_AT_type(*$C$DW$T$23)
   10156                      .dwattr $C$DW$1819, DW_AT_name("ADCCTL1")
   10157                      .dwattr $C$DW$1819, DW_AT_TI_symbol_name("_ADCCTL1")
   10158                      .dwattr $C$DW$1819, DW_AT_data_member_location[DW_OP_plus_uconst 0x6600]
   10159                      .dwattr $C$DW$1819, DW_AT_accessibility(DW_ACCESS_public)
   10160              $C$DW$1820      .dwtag  DW_TAG_member
   10161                      .dwattr $C$DW$1820, DW_AT_type(*$C$DW$T$23)
   10162                      .dwattr $C$DW$1820, DW_AT_name("ADCCTL2")
   10163                      .dwattr $C$DW$1820, DW_AT_TI_symbol_name("_ADCCTL2")
   10164                      .dwattr $C$DW$1820, DW_AT_data_member_location[DW_OP_plus_uconst 0x6601]
   10165                      .dwattr $C$DW$1820, DW_AT_accessibility(DW_ACCESS_public)
   10166              $C$DW$1821      .dwtag  DW_TAG_member
   10167                      .dwattr $C$DW$1821, DW_AT_type(*$C$DW$T$26)
   10168                      .dwattr $C$DW$1821, DW_AT_name("rsvd_2")
   10169                      .dwattr $C$DW$1821, DW_AT_TI_symbol_name("_rsvd_2")
   10170                      .dwattr $C$DW$1821, DW_AT_data_member_location[DW_OP_plus_uconst 0x6602]
   10171                      .dwattr $C$DW$1821, DW_AT_accessibility(DW_ACCESS_public)
   10172              $C$DW$1822      .dwtag  DW_TAG_member
   10173                      .dwattr $C$DW$1822, DW_AT_type(*$C$DW$T$23)
   10174                      .dwattr $C$DW$1822, DW_AT_name("ADCINTFLG")
   10175                      .dwattr $C$DW$1822, DW_AT_TI_symbol_name("_ADCINTFLG")
   10176                      .dwattr $C$DW$1822, DW_AT_data_member_location[DW_OP_plus_uconst 0x6604]
   10177                      .dwattr $C$DW$1822, DW_AT_accessibility(DW_ACCESS_public)
   10178              $C$DW$1823      .dwtag  DW_TAG_member
   10179                      .dwattr $C$DW$1823, DW_AT_type(*$C$DW$T$23)
   10180                      .dwattr $C$DW$1823, DW_AT_name("ADCINTFLGCLR")
   10181                      .dwattr $C$DW$1823, DW_AT_TI_symbol_name("_ADCINTFLGCLR")
   10182                      .dwattr $C$DW$1823, DW_AT_data_member_location[DW_OP_plus_uconst 0x6605]
   10183                      .dwattr $C$DW$1823, DW_AT_accessibility(DW_ACCESS_public)
   10184              $C$DW$1824      .dwtag  DW_TAG_member
   10185                      .dwattr $C$DW$1824, DW_AT_type(*$C$DW$T$23)
   10186                      .dwattr $C$DW$1824, DW_AT_name("ADCINTOVF")
   10187                      .dwattr $C$DW$1824, DW_AT_TI_symbol_name("_ADCINTOVF")
   10188                      .dwattr $C$DW$1824, DW_AT_data_member_location[DW_OP_plus_uconst 0x6606]
   10189                      .dwattr $C$DW$1824, DW_AT_accessibility(DW_ACCESS_public)
   10190              $C$DW$1825      .dwtag  DW_TAG_member
   10191                      .dwattr $C$DW$1825, DW_AT_type(*$C$DW$T$23)
TMS320C2000 Assembler PC v6.2.5 Sat Sep 16 15:41:33 2017

Tools Copyright (c) 1996-2014 Texas Instruments Incorporated
C:\Users\wmj\AppData\Local\Temp\1302810                              PAGE  196

   10192                      .dwattr $C$DW$1825, DW_AT_name("ADCINTOVFCLR")
   10193                      .dwattr $C$DW$1825, DW_AT_TI_symbol_name("_ADCINTOVFCLR")
   10194                      .dwattr $C$DW$1825, DW_AT_data_member_location[DW_OP_plus_uconst 0x6607]
   10195                      .dwattr $C$DW$1825, DW_AT_accessibility(DW_ACCESS_public)
   10196              $C$DW$1826      .dwtag  DW_TAG_member
   10197                      .dwattr $C$DW$1826, DW_AT_type(*$C$DW$T$27)
   10198                      .dwattr $C$DW$1826, DW_AT_name("INTSELxNy")
   10199                      .dwattr $C$DW$1826, DW_AT_TI_symbol_name("_INTSELxNy")
   10200                      .dwattr $C$DW$1826, DW_AT_data_member_location[DW_OP_plus_uconst 0x6608]
   10201                      .dwattr $C$DW$1826, DW_AT_accessibility(DW_ACCESS_public)
   10202              $C$DW$1827      .dwtag  DW_TAG_member
   10203                      .dwattr $C$DW$1827, DW_AT_type(*$C$DW$T$28)
   10204                      .dwattr $C$DW$1827, DW_AT_name("rsvd_3")
   10205                      .dwattr $C$DW$1827, DW_AT_TI_symbol_name("_rsvd_3")
   10206                      .dwattr $C$DW$1827, DW_AT_data_member_location[DW_OP_plus_uconst 0x660d]
   10207                      .dwattr $C$DW$1827, DW_AT_accessibility(DW_ACCESS_public)
   10208              $C$DW$1828      .dwtag  DW_TAG_member
   10209                      .dwattr $C$DW$1828, DW_AT_type(*$C$DW$T$23)
   10210                      .dwattr $C$DW$1828, DW_AT_name("SOCPRICTRL")
   10211                      .dwattr $C$DW$1828, DW_AT_TI_symbol_name("_SOCPRICTRL")
   10212                      .dwattr $C$DW$1828, DW_AT_data_member_location[DW_OP_plus_uconst 0x6610]
   10213                      .dwattr $C$DW$1828, DW_AT_accessibility(DW_ACCESS_public)
   10214              $C$DW$1829      .dwtag  DW_TAG_member
   10215                      .dwattr $C$DW$1829, DW_AT_type(*$C$DW$T$23)
   10216                      .dwattr $C$DW$1829, DW_AT_name("rsvd_4")
   10217                      .dwattr $C$DW$1829, DW_AT_TI_symbol_name("_rsvd_4")
   10218                      .dwattr $C$DW$1829, DW_AT_data_member_location[DW_OP_plus_uconst 0x6611]
   10219                      .dwattr $C$DW$1829, DW_AT_accessibility(DW_ACCESS_public)
   10220              $C$DW$1830      .dwtag  DW_TAG_member
   10221                      .dwattr $C$DW$1830, DW_AT_type(*$C$DW$T$23)
   10222                      .dwattr $C$DW$1830, DW_AT_name("ADCSAMPLEMODE")
   10223                      .dwattr $C$DW$1830, DW_AT_TI_symbol_name("_ADCSAMPLEMODE")
   10224                      .dwattr $C$DW$1830, DW_AT_data_member_location[DW_OP_plus_uconst 0x6612]
   10225                      .dwattr $C$DW$1830, DW_AT_accessibility(DW_ACCESS_public)
   10226              $C$DW$1831      .dwtag  DW_TAG_member
   10227                      .dwattr $C$DW$1831, DW_AT_type(*$C$DW$T$23)
   10228                      .dwattr $C$DW$1831, DW_AT_name("rsvd_5")
   10229                      .dwattr $C$DW$1831, DW_AT_TI_symbol_name("_rsvd_5")
   10230                      .dwattr $C$DW$1831, DW_AT_data_member_location[DW_OP_plus_uconst 0x6613]
   10231                      .dwattr $C$DW$1831, DW_AT_accessibility(DW_ACCESS_public)
   10232              $C$DW$1832      .dwtag  DW_TAG_member
   10233                      .dwattr $C$DW$1832, DW_AT_type(*$C$DW$T$23)
   10234                      .dwattr $C$DW$1832, DW_AT_name("ADCINTSOCSEL1")
   10235                      .dwattr $C$DW$1832, DW_AT_TI_symbol_name("_ADCINTSOCSEL1")
   10236                      .dwattr $C$DW$1832, DW_AT_data_member_location[DW_OP_plus_uconst 0x6614]
   10237                      .dwattr $C$DW$1832, DW_AT_accessibility(DW_ACCESS_public)
   10238              $C$DW$1833      .dwtag  DW_TAG_member
   10239                      .dwattr $C$DW$1833, DW_AT_type(*$C$DW$T$23)
   10240                      .dwattr $C$DW$1833, DW_AT_name("ADCINTSOCSEL2")
   10241                      .dwattr $C$DW$1833, DW_AT_TI_symbol_name("_ADCINTSOCSEL2")
   10242                      .dwattr $C$DW$1833, DW_AT_data_member_location[DW_OP_plus_uconst 0x6615]
   10243                      .dwattr $C$DW$1833, DW_AT_accessibility(DW_ACCESS_public)
   10244              $C$DW$1834      .dwtag  DW_TAG_member
   10245                      .dwattr $C$DW$1834, DW_AT_type(*$C$DW$T$26)
   10246                      .dwattr $C$DW$1834, DW_AT_name("rsvd_6")
TMS320C2000 Assembler PC v6.2.5 Sat Sep 16 15:41:33 2017

Tools Copyright (c) 1996-2014 Texas Instruments Incorporated
C:\Users\wmj\AppData\Local\Temp\1302810                              PAGE  197

   10247                      .dwattr $C$DW$1834, DW_AT_TI_symbol_name("_rsvd_6")
   10248                      .dwattr $C$DW$1834, DW_AT_data_member_location[DW_OP_plus_uconst 0x6616]
   10249                      .dwattr $C$DW$1834, DW_AT_accessibility(DW_ACCESS_public)
   10250              $C$DW$1835      .dwtag  DW_TAG_member
   10251                      .dwattr $C$DW$1835, DW_AT_type(*$C$DW$T$23)
   10252                      .dwattr $C$DW$1835, DW_AT_name("ADCSOCFLG1")
   10253                      .dwattr $C$DW$1835, DW_AT_TI_symbol_name("_ADCSOCFLG1")
   10254                      .dwattr $C$DW$1835, DW_AT_data_member_location[DW_OP_plus_uconst 0x6618]
   10255                      .dwattr $C$DW$1835, DW_AT_accessibility(DW_ACCESS_public)
   10256              $C$DW$1836      .dwtag  DW_TAG_member
   10257                      .dwattr $C$DW$1836, DW_AT_type(*$C$DW$T$23)
   10258                      .dwattr $C$DW$1836, DW_AT_name("rsvd_7")
   10259                      .dwattr $C$DW$1836, DW_AT_TI_symbol_name("_rsvd_7")
   10260                      .dwattr $C$DW$1836, DW_AT_data_member_location[DW_OP_plus_uconst 0x6619]
   10261                      .dwattr $C$DW$1836, DW_AT_accessibility(DW_ACCESS_public)
   10262              $C$DW$1837      .dwtag  DW_TAG_member
   10263                      .dwattr $C$DW$1837, DW_AT_type(*$C$DW$T$23)
   10264                      .dwattr $C$DW$1837, DW_AT_name("ADCSOCFRC1")
   10265                      .dwattr $C$DW$1837, DW_AT_TI_symbol_name("_ADCSOCFRC1")
   10266                      .dwattr $C$DW$1837, DW_AT_data_member_location[DW_OP_plus_uconst 0x661a]
   10267                      .dwattr $C$DW$1837, DW_AT_accessibility(DW_ACCESS_public)
   10268              $C$DW$1838      .dwtag  DW_TAG_member
   10269                      .dwattr $C$DW$1838, DW_AT_type(*$C$DW$T$23)
   10270                      .dwattr $C$DW$1838, DW_AT_name("rsvd_8")
   10271                      .dwattr $C$DW$1838, DW_AT_TI_symbol_name("_rsvd_8")
   10272                      .dwattr $C$DW$1838, DW_AT_data_member_location[DW_OP_plus_uconst 0x661b]
   10273                      .dwattr $C$DW$1838, DW_AT_accessibility(DW_ACCESS_public)
   10274              $C$DW$1839      .dwtag  DW_TAG_member
   10275                      .dwattr $C$DW$1839, DW_AT_type(*$C$DW$T$23)
   10276                      .dwattr $C$DW$1839, DW_AT_name("ADCSOCOVF1")
   10277                      .dwattr $C$DW$1839, DW_AT_TI_symbol_name("_ADCSOCOVF1")
   10278                      .dwattr $C$DW$1839, DW_AT_data_member_location[DW_OP_plus_uconst 0x661c]
   10279                      .dwattr $C$DW$1839, DW_AT_accessibility(DW_ACCESS_public)
   10280              $C$DW$1840      .dwtag  DW_TAG_member
   10281                      .dwattr $C$DW$1840, DW_AT_type(*$C$DW$T$23)
   10282                      .dwattr $C$DW$1840, DW_AT_name("rsvd_9")
   10283                      .dwattr $C$DW$1840, DW_AT_TI_symbol_name("_rsvd_9")
   10284                      .dwattr $C$DW$1840, DW_AT_data_member_location[DW_OP_plus_uconst 0x661d]
   10285                      .dwattr $C$DW$1840, DW_AT_accessibility(DW_ACCESS_public)
   10286              $C$DW$1841      .dwtag  DW_TAG_member
   10287                      .dwattr $C$DW$1841, DW_AT_type(*$C$DW$T$23)
   10288                      .dwattr $C$DW$1841, DW_AT_name("ADCSOCOVFCLR1")
   10289                      .dwattr $C$DW$1841, DW_AT_TI_symbol_name("_ADCSOCOVFCLR1")
   10290                      .dwattr $C$DW$1841, DW_AT_data_member_location[DW_OP_plus_uconst 0x661e]
   10291                      .dwattr $C$DW$1841, DW_AT_accessibility(DW_ACCESS_public)
   10292              $C$DW$1842      .dwtag  DW_TAG_member
   10293                      .dwattr $C$DW$1842, DW_AT_type(*$C$DW$T$23)
   10294                      .dwattr $C$DW$1842, DW_AT_name("rsvd_10")
   10295                      .dwattr $C$DW$1842, DW_AT_TI_symbol_name("_rsvd_10")
   10296                      .dwattr $C$DW$1842, DW_AT_data_member_location[DW_OP_plus_uconst 0x661f]
   10297                      .dwattr $C$DW$1842, DW_AT_accessibility(DW_ACCESS_public)
   10298              $C$DW$1843      .dwtag  DW_TAG_member
   10299                      .dwattr $C$DW$1843, DW_AT_type(*$C$DW$T$24)
   10300                      .dwattr $C$DW$1843, DW_AT_name("ADCSOCxCTL")
   10301                      .dwattr $C$DW$1843, DW_AT_TI_symbol_name("_ADCSOCxCTL")
TMS320C2000 Assembler PC v6.2.5 Sat Sep 16 15:41:33 2017

Tools Copyright (c) 1996-2014 Texas Instruments Incorporated
C:\Users\wmj\AppData\Local\Temp\1302810                              PAGE  198

   10302                      .dwattr $C$DW$1843, DW_AT_data_member_location[DW_OP_plus_uconst 0x6620]
   10303                      .dwattr $C$DW$1843, DW_AT_accessibility(DW_ACCESS_public)
   10304              $C$DW$1844      .dwtag  DW_TAG_member
   10305                      .dwattr $C$DW$1844, DW_AT_type(*$C$DW$T$24)
   10306                      .dwattr $C$DW$1844, DW_AT_name("rsvd_11")
   10307                      .dwattr $C$DW$1844, DW_AT_TI_symbol_name("_rsvd_11")
   10308                      .dwattr $C$DW$1844, DW_AT_data_member_location[DW_OP_plus_uconst 0x6630]
   10309                      .dwattr $C$DW$1844, DW_AT_accessibility(DW_ACCESS_public)
   10310              $C$DW$1845      .dwtag  DW_TAG_member
   10311                      .dwattr $C$DW$1845, DW_AT_type(*$C$DW$T$23)
   10312                      .dwattr $C$DW$1845, DW_AT_name("ADCREFTRIM")
   10313                      .dwattr $C$DW$1845, DW_AT_TI_symbol_name("_ADCREFTRIM")
   10314                      .dwattr $C$DW$1845, DW_AT_data_member_location[DW_OP_plus_uconst 0x6640]
   10315                      .dwattr $C$DW$1845, DW_AT_accessibility(DW_ACCESS_public)
   10316              $C$DW$1846      .dwtag  DW_TAG_member
   10317                      .dwattr $C$DW$1846, DW_AT_type(*$C$DW$T$23)
   10318                      .dwattr $C$DW$1846, DW_AT_name("ADCOFFTRIM")
   10319                      .dwattr $C$DW$1846, DW_AT_TI_symbol_name("_ADCOFFTRIM")
   10320                      .dwattr $C$DW$1846, DW_AT_data_member_location[DW_OP_plus_uconst 0x6641]
   10321                      .dwattr $C$DW$1846, DW_AT_accessibility(DW_ACCESS_public)
   10322              $C$DW$1847      .dwtag  DW_TAG_member
   10323                      .dwattr $C$DW$1847, DW_AT_type(*$C$DW$T$29)
   10324                      .dwattr $C$DW$1847, DW_AT_name("resvd_12")
   10325                      .dwattr $C$DW$1847, DW_AT_TI_symbol_name("_resvd_12")
   10326                      .dwattr $C$DW$1847, DW_AT_data_member_location[DW_OP_plus_uconst 0x6642]
   10327                      .dwattr $C$DW$1847, DW_AT_accessibility(DW_ACCESS_public)
   10328              $C$DW$1848      .dwtag  DW_TAG_member
   10329                      .dwattr $C$DW$1848, DW_AT_type(*$C$DW$T$23)
   10330                      .dwattr $C$DW$1848, DW_AT_name("ADCREV")
   10331                      .dwattr $C$DW$1848, DW_AT_TI_symbol_name("_ADCREV")
   10332                      .dwattr $C$DW$1848, DW_AT_data_member_location[DW_OP_plus_uconst 0x664f]
   10333                      .dwattr $C$DW$1848, DW_AT_accessibility(DW_ACCESS_public)
   10334                      .dwendtag $C$DW$T$30
   10335              
   10336              $C$DW$T$333     .dwtag  DW_TAG_typedef, DW_AT_name("ADC_Obj")
   10337                      .dwattr $C$DW$T$333, DW_AT_type(*$C$DW$T$30)
   10338                      .dwattr $C$DW$T$333, DW_AT_language(DW_LANG_C)
   10339              $C$DW$T$50      .dwtag  DW_TAG_pointer_type
   10340                      .dwattr $C$DW$T$50, DW_AT_type(*$C$DW$T$30)
   10341                      .dwattr $C$DW$T$50, DW_AT_address_class(0x16)
   10342              $C$DW$T$51      .dwtag  DW_TAG_typedef, DW_AT_name("ADC_Handle")
   10343                      .dwattr $C$DW$T$51, DW_AT_type(*$C$DW$T$50)
   10344                      .dwattr $C$DW$T$51, DW_AT_language(DW_LANG_C)
   10345              
   10346              $C$DW$T$32      .dwtag  DW_TAG_structure_type
   10347                      .dwattr $C$DW$T$32, DW_AT_name("_CLK_Obj_")
   10348                      .dwattr $C$DW$T$32, DW_AT_byte_size(0x11)
   10349              $C$DW$1849      .dwtag  DW_TAG_member
   10350                      .dwattr $C$DW$1849, DW_AT_type(*$C$DW$T$23)
   10351                      .dwattr $C$DW$1849, DW_AT_name("XCLK")
   10352                      .dwattr $C$DW$1849, DW_AT_TI_symbol_name("_XCLK")
   10353                      .dwattr $C$DW$1849, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
   10354                      .dwattr $C$DW$1849, DW_AT_accessibility(DW_ACCESS_public)
   10355              $C$DW$1850      .dwtag  DW_TAG_member
   10356                      .dwattr $C$DW$1850, DW_AT_type(*$C$DW$T$23)
TMS320C2000 Assembler PC v6.2.5 Sat Sep 16 15:41:33 2017

Tools Copyright (c) 1996-2014 Texas Instruments Incorporated
C:\Users\wmj\AppData\Local\Temp\1302810                              PAGE  199

   10357                      .dwattr $C$DW$1850, DW_AT_name("rsvd_1")
   10358                      .dwattr $C$DW$1850, DW_AT_TI_symbol_name("_rsvd_1")
   10359                      .dwattr $C$DW$1850, DW_AT_data_member_location[DW_OP_plus_uconst 0x1]
   10360                      .dwattr $C$DW$1850, DW_AT_accessibility(DW_ACCESS_public)
   10361              $C$DW$1851      .dwtag  DW_TAG_member
   10362                      .dwattr $C$DW$1851, DW_AT_type(*$C$DW$T$23)
   10363                      .dwattr $C$DW$1851, DW_AT_name("CLKCTL")
   10364                      .dwattr $C$DW$1851, DW_AT_TI_symbol_name("_CLKCTL")
   10365                      .dwattr $C$DW$1851, DW_AT_data_member_location[DW_OP_plus_uconst 0x2]
   10366                      .dwattr $C$DW$1851, DW_AT_accessibility(DW_ACCESS_public)
   10367              $C$DW$1852      .dwtag  DW_TAG_member
   10368                      .dwattr $C$DW$1852, DW_AT_type(*$C$DW$T$31)
   10369                      .dwattr $C$DW$1852, DW_AT_name("rsvd_2")
   10370                      .dwattr $C$DW$1852, DW_AT_TI_symbol_name("_rsvd_2")
   10371                      .dwattr $C$DW$1852, DW_AT_data_member_location[DW_OP_plus_uconst 0x3]
   10372                      .dwattr $C$DW$1852, DW_AT_accessibility(DW_ACCESS_public)
   10373              $C$DW$1853      .dwtag  DW_TAG_member
   10374                      .dwattr $C$DW$1853, DW_AT_type(*$C$DW$T$23)
   10375                      .dwattr $C$DW$1853, DW_AT_name("LOSPCP")
   10376                      .dwattr $C$DW$1853, DW_AT_TI_symbol_name("_LOSPCP")
   10377                      .dwattr $C$DW$1853, DW_AT_data_member_location[DW_OP_plus_uconst 0xb]
   10378                      .dwattr $C$DW$1853, DW_AT_accessibility(DW_ACCESS_public)
   10379              $C$DW$1854      .dwtag  DW_TAG_member
   10380                      .dwattr $C$DW$1854, DW_AT_type(*$C$DW$T$23)
   10381                      .dwattr $C$DW$1854, DW_AT_name("PCLKCR0")
   10382                      .dwattr $C$DW$1854, DW_AT_TI_symbol_name("_PCLKCR0")
   10383                      .dwattr $C$DW$1854, DW_AT_data_member_location[DW_OP_plus_uconst 0xc]
   10384                      .dwattr $C$DW$1854, DW_AT_accessibility(DW_ACCESS_public)
   10385              $C$DW$1855      .dwtag  DW_TAG_member
   10386                      .dwattr $C$DW$1855, DW_AT_type(*$C$DW$T$23)
   10387                      .dwattr $C$DW$1855, DW_AT_name("PCLKCR1")
   10388                      .dwattr $C$DW$1855, DW_AT_TI_symbol_name("_PCLKCR1")
   10389                      .dwattr $C$DW$1855, DW_AT_data_member_location[DW_OP_plus_uconst 0xd]
   10390                      .dwattr $C$DW$1855, DW_AT_accessibility(DW_ACCESS_public)
   10391              $C$DW$1856      .dwtag  DW_TAG_member
   10392                      .dwattr $C$DW$1856, DW_AT_type(*$C$DW$T$26)
   10393                      .dwattr $C$DW$1856, DW_AT_name("rsvd_3")
   10394                      .dwattr $C$DW$1856, DW_AT_TI_symbol_name("_rsvd_3")
   10395                      .dwattr $C$DW$1856, DW_AT_data_member_location[DW_OP_plus_uconst 0xe]
   10396                      .dwattr $C$DW$1856, DW_AT_accessibility(DW_ACCESS_public)
   10397              $C$DW$1857      .dwtag  DW_TAG_member
   10398                      .dwattr $C$DW$1857, DW_AT_type(*$C$DW$T$23)
   10399                      .dwattr $C$DW$1857, DW_AT_name("PCLKCR3")
   10400                      .dwattr $C$DW$1857, DW_AT_TI_symbol_name("_PCLKCR3")
   10401                      .dwattr $C$DW$1857, DW_AT_data_member_location[DW_OP_plus_uconst 0x10]
   10402                      .dwattr $C$DW$1857, DW_AT_accessibility(DW_ACCESS_public)
   10403                      .dwendtag $C$DW$T$32
   10404              
   10405              $C$DW$T$52      .dwtag  DW_TAG_pointer_type
   10406                      .dwattr $C$DW$T$52, DW_AT_type(*$C$DW$T$32)
   10407                      .dwattr $C$DW$T$52, DW_AT_address_class(0x16)
   10408              $C$DW$T$53      .dwtag  DW_TAG_typedef, DW_AT_name("CLK_Handle")
   10409                      .dwattr $C$DW$T$53, DW_AT_type(*$C$DW$T$52)
   10410                      .dwattr $C$DW$T$53, DW_AT_language(DW_LANG_C)
   10411              
TMS320C2000 Assembler PC v6.2.5 Sat Sep 16 15:41:33 2017

Tools Copyright (c) 1996-2014 Texas Instruments Incorporated
C:\Users\wmj\AppData\Local\Temp\1302810                              PAGE  200

   10412              $C$DW$T$34      .dwtag  DW_TAG_structure_type
   10413                      .dwattr $C$DW$T$34, DW_AT_name("_CPU_Obj_")
   10414                      .dwattr $C$DW$T$34, DW_AT_byte_size(0x01)
   10415              $C$DW$1858      .dwtag  DW_TAG_member
   10416                      .dwattr $C$DW$1858, DW_AT_type(*$C$DW$T$33)
   10417                      .dwattr $C$DW$1858, DW_AT_name("tmp")
   10418                      .dwattr $C$DW$1858, DW_AT_TI_symbol_name("_tmp")
   10419                      .dwattr $C$DW$1858, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
   10420                      .dwattr $C$DW$1858, DW_AT_accessibility(DW_ACCESS_public)
   10421                      .dwendtag $C$DW$T$34
   10422              
   10423              $C$DW$T$340     .dwtag  DW_TAG_typedef, DW_AT_name("CPU_Obj")
   10424                      .dwattr $C$DW$T$340, DW_AT_type(*$C$DW$T$34)
   10425                      .dwattr $C$DW$T$340, DW_AT_language(DW_LANG_C)
   10426              $C$DW$T$54      .dwtag  DW_TAG_pointer_type
   10427                      .dwattr $C$DW$T$54, DW_AT_type(*$C$DW$T$34)
   10428                      .dwattr $C$DW$T$54, DW_AT_address_class(0x16)
   10429              $C$DW$T$55      .dwtag  DW_TAG_typedef, DW_AT_name("CPU_Handle")
   10430                      .dwattr $C$DW$T$55, DW_AT_type(*$C$DW$T$54)
   10431                      .dwattr $C$DW$T$55, DW_AT_language(DW_LANG_C)
   10432              
   10433              $C$DW$T$36      .dwtag  DW_TAG_structure_type
   10434                      .dwattr $C$DW$T$36, DW_AT_name("_FILTER_FO_")
   10435                      .dwattr $C$DW$T$36, DW_AT_byte_size(0x0a)
   10436              $C$DW$1859      .dwtag  DW_TAG_member
   10437                      .dwattr $C$DW$1859, DW_AT_type(*$C$DW$T$35)
   10438                      .dwattr $C$DW$1859, DW_AT_name("a1")
   10439                      .dwattr $C$DW$1859, DW_AT_TI_symbol_name("_a1")
   10440                      .dwattr $C$DW$1859, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
   10441                      .dwattr $C$DW$1859, DW_AT_accessibility(DW_ACCESS_public)
   10442              $C$DW$1860      .dwtag  DW_TAG_member
   10443                      .dwattr $C$DW$1860, DW_AT_type(*$C$DW$T$35)
   10444                      .dwattr $C$DW$1860, DW_AT_name("b0")
   10445                      .dwattr $C$DW$1860, DW_AT_TI_symbol_name("_b0")
   10446                      .dwattr $C$DW$1860, DW_AT_data_member_location[DW_OP_plus_uconst 0x2]
   10447                      .dwattr $C$DW$1860, DW_AT_accessibility(DW_ACCESS_public)
   10448              $C$DW$1861      .dwtag  DW_TAG_member
   10449                      .dwattr $C$DW$1861, DW_AT_type(*$C$DW$T$35)
   10450                      .dwattr $C$DW$1861, DW_AT_name("b1")
   10451                      .dwattr $C$DW$1861, DW_AT_TI_symbol_name("_b1")
   10452                      .dwattr $C$DW$1861, DW_AT_data_member_location[DW_OP_plus_uconst 0x4]
   10453                      .dwattr $C$DW$1861, DW_AT_accessibility(DW_ACCESS_public)
   10454              $C$DW$1862      .dwtag  DW_TAG_member
   10455                      .dwattr $C$DW$1862, DW_AT_type(*$C$DW$T$35)
   10456                      .dwattr $C$DW$1862, DW_AT_name("x1")
   10457                      .dwattr $C$DW$1862, DW_AT_TI_symbol_name("_x1")
   10458                      .dwattr $C$DW$1862, DW_AT_data_member_location[DW_OP_plus_uconst 0x6]
   10459                      .dwattr $C$DW$1862, DW_AT_accessibility(DW_ACCESS_public)
   10460              $C$DW$1863      .dwtag  DW_TAG_member
   10461                      .dwattr $C$DW$1863, DW_AT_type(*$C$DW$T$35)
   10462                      .dwattr $C$DW$1863, DW_AT_name("y1")
   10463                      .dwattr $C$DW$1863, DW_AT_TI_symbol_name("_y1")
   10464                      .dwattr $C$DW$1863, DW_AT_data_member_location[DW_OP_plus_uconst 0x8]
   10465                      .dwattr $C$DW$1863, DW_AT_accessibility(DW_ACCESS_public)
   10466                      .dwendtag $C$DW$T$36
TMS320C2000 Assembler PC v6.2.5 Sat Sep 16 15:41:33 2017

Tools Copyright (c) 1996-2014 Texas Instruments Incorporated
C:\Users\wmj\AppData\Local\Temp\1302810                              PAGE  201

   10467              
   10468              $C$DW$T$93      .dwtag  DW_TAG_typedef, DW_AT_name("FILTER_FO_Obj")
   10469                      .dwattr $C$DW$T$93, DW_AT_type(*$C$DW$T$36)
   10470                      .dwattr $C$DW$T$93, DW_AT_language(DW_LANG_C)
   10471              
   10472              $C$DW$T$20      .dwtag  DW_TAG_structure_type
   10473                      .dwattr $C$DW$T$20, DW_AT_name("_FILTER_FO_Obj_")
   10474                      .dwattr $C$DW$T$20, DW_AT_declaration
   10475                      .dwendtag $C$DW$T$20
   10476              
   10477              $C$DW$T$94      .dwtag  DW_TAG_pointer_type
   10478                      .dwattr $C$DW$T$94, DW_AT_type(*$C$DW$T$20)
   10479                      .dwattr $C$DW$T$94, DW_AT_address_class(0x16)
   10480              $C$DW$T$95      .dwtag  DW_TAG_typedef, DW_AT_name("FILTER_FO_Handle")
   10481                      .dwattr $C$DW$T$95, DW_AT_type(*$C$DW$T$94)
   10482                      .dwattr $C$DW$T$95, DW_AT_language(DW_LANG_C)
   10483              
   10484              $C$DW$T$37      .dwtag  DW_TAG_structure_type
   10485                      .dwattr $C$DW$T$37, DW_AT_name("_FLASH_Obj_")
   10486                      .dwattr $C$DW$T$37, DW_AT_byte_size(0x08)
   10487              $C$DW$1864      .dwtag  DW_TAG_member
   10488                      .dwattr $C$DW$1864, DW_AT_type(*$C$DW$T$23)
   10489                      .dwattr $C$DW$1864, DW_AT_name("FOPT")
   10490                      .dwattr $C$DW$1864, DW_AT_TI_symbol_name("_FOPT")
   10491                      .dwattr $C$DW$1864, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
   10492                      .dwattr $C$DW$1864, DW_AT_accessibility(DW_ACCESS_public)
   10493              $C$DW$1865      .dwtag  DW_TAG_member
   10494                      .dwattr $C$DW$1865, DW_AT_type(*$C$DW$T$23)
   10495                      .dwattr $C$DW$1865, DW_AT_name("rsvd_1")
   10496                      .dwattr $C$DW$1865, DW_AT_TI_symbol_name("_rsvd_1")
   10497                      .dwattr $C$DW$1865, DW_AT_data_member_location[DW_OP_plus_uconst 0x1]
   10498                      .dwattr $C$DW$1865, DW_AT_accessibility(DW_ACCESS_public)
   10499              $C$DW$1866      .dwtag  DW_TAG_member
   10500                      .dwattr $C$DW$1866, DW_AT_type(*$C$DW$T$23)
   10501                      .dwattr $C$DW$1866, DW_AT_name("FPWR")
   10502                      .dwattr $C$DW$1866, DW_AT_TI_symbol_name("_FPWR")
   10503                      .dwattr $C$DW$1866, DW_AT_data_member_location[DW_OP_plus_uconst 0x2]
   10504                      .dwattr $C$DW$1866, DW_AT_accessibility(DW_ACCESS_public)
   10505              $C$DW$1867      .dwtag  DW_TAG_member
   10506                      .dwattr $C$DW$1867, DW_AT_type(*$C$DW$T$23)
   10507                      .dwattr $C$DW$1867, DW_AT_name("FSTATUS")
   10508                      .dwattr $C$DW$1867, DW_AT_TI_symbol_name("_FSTATUS")
   10509                      .dwattr $C$DW$1867, DW_AT_data_member_location[DW_OP_plus_uconst 0x3]
   10510                      .dwattr $C$DW$1867, DW_AT_accessibility(DW_ACCESS_public)
   10511              $C$DW$1868      .dwtag  DW_TAG_member
   10512                      .dwattr $C$DW$1868, DW_AT_type(*$C$DW$T$23)
   10513                      .dwattr $C$DW$1868, DW_AT_name("FSTDBYWAIT")
   10514                      .dwattr $C$DW$1868, DW_AT_TI_symbol_name("_FSTDBYWAIT")
   10515                      .dwattr $C$DW$1868, DW_AT_data_member_location[DW_OP_plus_uconst 0x4]
   10516                      .dwattr $C$DW$1868, DW_AT_accessibility(DW_ACCESS_public)
   10517              $C$DW$1869      .dwtag  DW_TAG_member
   10518                      .dwattr $C$DW$1869, DW_AT_type(*$C$DW$T$23)
   10519                      .dwattr $C$DW$1869, DW_AT_name("FACTIVEWAIT")
   10520                      .dwattr $C$DW$1869, DW_AT_TI_symbol_name("_FACTIVEWAIT")
   10521                      .dwattr $C$DW$1869, DW_AT_data_member_location[DW_OP_plus_uconst 0x5]
TMS320C2000 Assembler PC v6.2.5 Sat Sep 16 15:41:33 2017

Tools Copyright (c) 1996-2014 Texas Instruments Incorporated
C:\Users\wmj\AppData\Local\Temp\1302810                              PAGE  202

   10522                      .dwattr $C$DW$1869, DW_AT_accessibility(DW_ACCESS_public)
   10523              $C$DW$1870      .dwtag  DW_TAG_member
   10524                      .dwattr $C$DW$1870, DW_AT_type(*$C$DW$T$23)
   10525                      .dwattr $C$DW$1870, DW_AT_name("FBANKWAIT")
   10526                      .dwattr $C$DW$1870, DW_AT_TI_symbol_name("_FBANKWAIT")
   10527                      .dwattr $C$DW$1870, DW_AT_data_member_location[DW_OP_plus_uconst 0x6]
   10528                      .dwattr $C$DW$1870, DW_AT_accessibility(DW_ACCESS_public)
   10529              $C$DW$1871      .dwtag  DW_TAG_member
   10530                      .dwattr $C$DW$1871, DW_AT_type(*$C$DW$T$23)
   10531                      .dwattr $C$DW$1871, DW_AT_name("FOTPWAIT")
   10532                      .dwattr $C$DW$1871, DW_AT_TI_symbol_name("_FOTPWAIT")
   10533                      .dwattr $C$DW$1871, DW_AT_data_member_location[DW_OP_plus_uconst 0x7]
   10534                      .dwattr $C$DW$1871, DW_AT_accessibility(DW_ACCESS_public)
   10535                      .dwendtag $C$DW$T$37
   10536              
   10537              $C$DW$T$56      .dwtag  DW_TAG_pointer_type
   10538                      .dwattr $C$DW$T$56, DW_AT_type(*$C$DW$T$37)
   10539                      .dwattr $C$DW$T$56, DW_AT_address_class(0x16)
   10540              $C$DW$T$57      .dwtag  DW_TAG_typedef, DW_AT_name("FLASH_Handle")
   10541                      .dwattr $C$DW$T$57, DW_AT_type(*$C$DW$T$56)
   10542                      .dwattr $C$DW$T$57, DW_AT_language(DW_LANG_C)
   10543              
   10544              $C$DW$T$42      .dwtag  DW_TAG_structure_type
   10545                      .dwattr $C$DW$T$42, DW_AT_name("_GPIO_Obj_")
   10546                      .dwattr $C$DW$T$42, DW_AT_byte_size(0x6a)
   10547              $C$DW$1872      .dwtag  DW_TAG_member
   10548                      .dwattr $C$DW$1872, DW_AT_type(*$C$DW$T$39)
   10549                      .dwattr $C$DW$1872, DW_AT_name("GPACTRL")
   10550                      .dwattr $C$DW$1872, DW_AT_TI_symbol_name("_GPACTRL")
   10551                      .dwattr $C$DW$1872, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
   10552                      .dwattr $C$DW$1872, DW_AT_accessibility(DW_ACCESS_public)
   10553              $C$DW$1873      .dwtag  DW_TAG_member
   10554                      .dwattr $C$DW$1873, DW_AT_type(*$C$DW$T$39)
   10555                      .dwattr $C$DW$1873, DW_AT_name("GPAQSEL1")
   10556                      .dwattr $C$DW$1873, DW_AT_TI_symbol_name("_GPAQSEL1")
   10557                      .dwattr $C$DW$1873, DW_AT_data_member_location[DW_OP_plus_uconst 0x2]
   10558                      .dwattr $C$DW$1873, DW_AT_accessibility(DW_ACCESS_public)
   10559              $C$DW$1874      .dwtag  DW_TAG_member
   10560                      .dwattr $C$DW$1874, DW_AT_type(*$C$DW$T$39)
   10561                      .dwattr $C$DW$1874, DW_AT_name("GPAQSEL2")
   10562                      .dwattr $C$DW$1874, DW_AT_TI_symbol_name("_GPAQSEL2")
   10563                      .dwattr $C$DW$1874, DW_AT_data_member_location[DW_OP_plus_uconst 0x4]
   10564                      .dwattr $C$DW$1874, DW_AT_accessibility(DW_ACCESS_public)
   10565              $C$DW$1875      .dwtag  DW_TAG_member
   10566                      .dwattr $C$DW$1875, DW_AT_type(*$C$DW$T$39)
   10567                      .dwattr $C$DW$1875, DW_AT_name("GPAMUX1")
   10568                      .dwattr $C$DW$1875, DW_AT_TI_symbol_name("_GPAMUX1")
   10569                      .dwattr $C$DW$1875, DW_AT_data_member_location[DW_OP_plus_uconst 0x6]
   10570                      .dwattr $C$DW$1875, DW_AT_accessibility(DW_ACCESS_public)
   10571              $C$DW$1876      .dwtag  DW_TAG_member
   10572                      .dwattr $C$DW$1876, DW_AT_type(*$C$DW$T$39)
   10573                      .dwattr $C$DW$1876, DW_AT_name("GPAMUX2")
   10574                      .dwattr $C$DW$1876, DW_AT_TI_symbol_name("_GPAMUX2")
   10575                      .dwattr $C$DW$1876, DW_AT_data_member_location[DW_OP_plus_uconst 0x8]
   10576                      .dwattr $C$DW$1876, DW_AT_accessibility(DW_ACCESS_public)
TMS320C2000 Assembler PC v6.2.5 Sat Sep 16 15:41:33 2017

Tools Copyright (c) 1996-2014 Texas Instruments Incorporated
C:\Users\wmj\AppData\Local\Temp\1302810                              PAGE  203

   10577              $C$DW$1877      .dwtag  DW_TAG_member
   10578                      .dwattr $C$DW$1877, DW_AT_type(*$C$DW$T$39)
   10579                      .dwattr $C$DW$1877, DW_AT_name("GPADIR")
   10580                      .dwattr $C$DW$1877, DW_AT_TI_symbol_name("_GPADIR")
   10581                      .dwattr $C$DW$1877, DW_AT_data_member_location[DW_OP_plus_uconst 0xa]
   10582                      .dwattr $C$DW$1877, DW_AT_accessibility(DW_ACCESS_public)
   10583              $C$DW$1878      .dwtag  DW_TAG_member
   10584                      .dwattr $C$DW$1878, DW_AT_type(*$C$DW$T$39)
   10585                      .dwattr $C$DW$1878, DW_AT_name("GPAPUD")
   10586                      .dwattr $C$DW$1878, DW_AT_TI_symbol_name("_GPAPUD")
   10587                      .dwattr $C$DW$1878, DW_AT_data_member_location[DW_OP_plus_uconst 0xc]
   10588                      .dwattr $C$DW$1878, DW_AT_accessibility(DW_ACCESS_public)
   10589              $C$DW$1879      .dwtag  DW_TAG_member
   10590                      .dwattr $C$DW$1879, DW_AT_type(*$C$DW$T$26)
   10591                      .dwattr $C$DW$1879, DW_AT_name("rsvd_1")
   10592                      .dwattr $C$DW$1879, DW_AT_TI_symbol_name("_rsvd_1")
   10593                      .dwattr $C$DW$1879, DW_AT_data_member_location[DW_OP_plus_uconst 0xe]
   10594                      .dwattr $C$DW$1879, DW_AT_accessibility(DW_ACCESS_public)
   10595              $C$DW$1880      .dwtag  DW_TAG_member
   10596                      .dwattr $C$DW$1880, DW_AT_type(*$C$DW$T$39)
   10597                      .dwattr $C$DW$1880, DW_AT_name("GPBCTRL")
   10598                      .dwattr $C$DW$1880, DW_AT_TI_symbol_name("_GPBCTRL")
   10599                      .dwattr $C$DW$1880, DW_AT_data_member_location[DW_OP_plus_uconst 0x10]
   10600                      .dwattr $C$DW$1880, DW_AT_accessibility(DW_ACCESS_public)
   10601              $C$DW$1881      .dwtag  DW_TAG_member
   10602                      .dwattr $C$DW$1881, DW_AT_type(*$C$DW$T$39)
   10603                      .dwattr $C$DW$1881, DW_AT_name("GPBQSEL1")
   10604                      .dwattr $C$DW$1881, DW_AT_TI_symbol_name("_GPBQSEL1")
   10605                      .dwattr $C$DW$1881, DW_AT_data_member_location[DW_OP_plus_uconst 0x12]
   10606                      .dwattr $C$DW$1881, DW_AT_accessibility(DW_ACCESS_public)
   10607              $C$DW$1882      .dwtag  DW_TAG_member
   10608                      .dwattr $C$DW$1882, DW_AT_type(*$C$DW$T$26)
   10609                      .dwattr $C$DW$1882, DW_AT_name("rsvd_2")
   10610                      .dwattr $C$DW$1882, DW_AT_TI_symbol_name("_rsvd_2")
   10611                      .dwattr $C$DW$1882, DW_AT_data_member_location[DW_OP_plus_uconst 0x14]
   10612                      .dwattr $C$DW$1882, DW_AT_accessibility(DW_ACCESS_public)
   10613              $C$DW$1883      .dwtag  DW_TAG_member
   10614                      .dwattr $C$DW$1883, DW_AT_type(*$C$DW$T$39)
   10615                      .dwattr $C$DW$1883, DW_AT_name("GPBMUX1")
   10616                      .dwattr $C$DW$1883, DW_AT_TI_symbol_name("_GPBMUX1")
   10617                      .dwattr $C$DW$1883, DW_AT_data_member_location[DW_OP_plus_uconst 0x16]
   10618                      .dwattr $C$DW$1883, DW_AT_accessibility(DW_ACCESS_public)
   10619              $C$DW$1884      .dwtag  DW_TAG_member
   10620                      .dwattr $C$DW$1884, DW_AT_type(*$C$DW$T$26)
   10621                      .dwattr $C$DW$1884, DW_AT_name("rsvd_3")
   10622                      .dwattr $C$DW$1884, DW_AT_TI_symbol_name("_rsvd_3")
   10623                      .dwattr $C$DW$1884, DW_AT_data_member_location[DW_OP_plus_uconst 0x18]
   10624                      .dwattr $C$DW$1884, DW_AT_accessibility(DW_ACCESS_public)
   10625              $C$DW$1885      .dwtag  DW_TAG_member
   10626                      .dwattr $C$DW$1885, DW_AT_type(*$C$DW$T$39)
   10627                      .dwattr $C$DW$1885, DW_AT_name("GPBDIR")
   10628                      .dwattr $C$DW$1885, DW_AT_TI_symbol_name("_GPBDIR")
   10629                      .dwattr $C$DW$1885, DW_AT_data_member_location[DW_OP_plus_uconst 0x1a]
   10630                      .dwattr $C$DW$1885, DW_AT_accessibility(DW_ACCESS_public)
   10631              $C$DW$1886      .dwtag  DW_TAG_member
TMS320C2000 Assembler PC v6.2.5 Sat Sep 16 15:41:33 2017

Tools Copyright (c) 1996-2014 Texas Instruments Incorporated
C:\Users\wmj\AppData\Local\Temp\1302810                              PAGE  204

   10632                      .dwattr $C$DW$1886, DW_AT_type(*$C$DW$T$39)
   10633                      .dwattr $C$DW$1886, DW_AT_name("GPBPUD")
   10634                      .dwattr $C$DW$1886, DW_AT_TI_symbol_name("_GPBPUD")
   10635                      .dwattr $C$DW$1886, DW_AT_data_member_location[DW_OP_plus_uconst 0x1c]
   10636                      .dwattr $C$DW$1886, DW_AT_accessibility(DW_ACCESS_public)
   10637              $C$DW$1887      .dwtag  DW_TAG_member
   10638                      .dwattr $C$DW$1887, DW_AT_type(*$C$DW$T$40)
   10639                      .dwattr $C$DW$1887, DW_AT_name("rsvd_4")
   10640                      .dwattr $C$DW$1887, DW_AT_TI_symbol_name("_rsvd_4")
   10641                      .dwattr $C$DW$1887, DW_AT_data_member_location[DW_OP_plus_uconst 0x1e]
   10642                      .dwattr $C$DW$1887, DW_AT_accessibility(DW_ACCESS_public)
   10643              $C$DW$1888      .dwtag  DW_TAG_member
   10644                      .dwattr $C$DW$1888, DW_AT_type(*$C$DW$T$39)
   10645                      .dwattr $C$DW$1888, DW_AT_name("AIOMUX1")
   10646                      .dwattr $C$DW$1888, DW_AT_TI_symbol_name("_AIOMUX1")
   10647                      .dwattr $C$DW$1888, DW_AT_data_member_location[DW_OP_plus_uconst 0x36]
   10648                      .dwattr $C$DW$1888, DW_AT_accessibility(DW_ACCESS_public)
   10649              $C$DW$1889      .dwtag  DW_TAG_member
   10650                      .dwattr $C$DW$1889, DW_AT_type(*$C$DW$T$26)
   10651                      .dwattr $C$DW$1889, DW_AT_name("rsvd_5")
   10652                      .dwattr $C$DW$1889, DW_AT_TI_symbol_name("_rsvd_5")
   10653                      .dwattr $C$DW$1889, DW_AT_data_member_location[DW_OP_plus_uconst 0x38]
   10654                      .dwattr $C$DW$1889, DW_AT_accessibility(DW_ACCESS_public)
   10655              $C$DW$1890      .dwtag  DW_TAG_member
   10656                      .dwattr $C$DW$1890, DW_AT_type(*$C$DW$T$39)
   10657                      .dwattr $C$DW$1890, DW_AT_name("AIODIR")
   10658                      .dwattr $C$DW$1890, DW_AT_TI_symbol_name("_AIODIR")
   10659                      .dwattr $C$DW$1890, DW_AT_data_member_location[DW_OP_plus_uconst 0x3a]
   10660                      .dwattr $C$DW$1890, DW_AT_accessibility(DW_ACCESS_public)
   10661              $C$DW$1891      .dwtag  DW_TAG_member
   10662                      .dwattr $C$DW$1891, DW_AT_type(*$C$DW$T$41)
   10663                      .dwattr $C$DW$1891, DW_AT_name("rsvd_6")
   10664                      .dwattr $C$DW$1891, DW_AT_TI_symbol_name("_rsvd_6")
   10665                      .dwattr $C$DW$1891, DW_AT_data_member_location[DW_OP_plus_uconst 0x3c]
   10666                      .dwattr $C$DW$1891, DW_AT_accessibility(DW_ACCESS_public)
   10667              $C$DW$1892      .dwtag  DW_TAG_member
   10668                      .dwattr $C$DW$1892, DW_AT_type(*$C$DW$T$39)
   10669                      .dwattr $C$DW$1892, DW_AT_name("GPADAT")
   10670                      .dwattr $C$DW$1892, DW_AT_TI_symbol_name("_GPADAT")
   10671                      .dwattr $C$DW$1892, DW_AT_data_member_location[DW_OP_plus_uconst 0x40]
   10672                      .dwattr $C$DW$1892, DW_AT_accessibility(DW_ACCESS_public)
   10673              $C$DW$1893      .dwtag  DW_TAG_member
   10674                      .dwattr $C$DW$1893, DW_AT_type(*$C$DW$T$39)
   10675                      .dwattr $C$DW$1893, DW_AT_name("GPASET")
   10676                      .dwattr $C$DW$1893, DW_AT_TI_symbol_name("_GPASET")
   10677                      .dwattr $C$DW$1893, DW_AT_data_member_location[DW_OP_plus_uconst 0x42]
   10678                      .dwattr $C$DW$1893, DW_AT_accessibility(DW_ACCESS_public)
   10679              $C$DW$1894      .dwtag  DW_TAG_member
   10680                      .dwattr $C$DW$1894, DW_AT_type(*$C$DW$T$39)
   10681                      .dwattr $C$DW$1894, DW_AT_name("GPACLEAR")
   10682                      .dwattr $C$DW$1894, DW_AT_TI_symbol_name("_GPACLEAR")
   10683                      .dwattr $C$DW$1894, DW_AT_data_member_location[DW_OP_plus_uconst 0x44]
   10684                      .dwattr $C$DW$1894, DW_AT_accessibility(DW_ACCESS_public)
   10685              $C$DW$1895      .dwtag  DW_TAG_member
   10686                      .dwattr $C$DW$1895, DW_AT_type(*$C$DW$T$39)
TMS320C2000 Assembler PC v6.2.5 Sat Sep 16 15:41:33 2017

Tools Copyright (c) 1996-2014 Texas Instruments Incorporated
C:\Users\wmj\AppData\Local\Temp\1302810                              PAGE  205

   10687                      .dwattr $C$DW$1895, DW_AT_name("GPATOGGLE")
   10688                      .dwattr $C$DW$1895, DW_AT_TI_symbol_name("_GPATOGGLE")
   10689                      .dwattr $C$DW$1895, DW_AT_data_member_location[DW_OP_plus_uconst 0x46]
   10690                      .dwattr $C$DW$1895, DW_AT_accessibility(DW_ACCESS_public)
   10691              $C$DW$1896      .dwtag  DW_TAG_member
   10692                      .dwattr $C$DW$1896, DW_AT_type(*$C$DW$T$39)
   10693                      .dwattr $C$DW$1896, DW_AT_name("GPBDAT")
   10694                      .dwattr $C$DW$1896, DW_AT_TI_symbol_name("_GPBDAT")
   10695                      .dwattr $C$DW$1896, DW_AT_data_member_location[DW_OP_plus_uconst 0x48]
   10696                      .dwattr $C$DW$1896, DW_AT_accessibility(DW_ACCESS_public)
   10697              $C$DW$1897      .dwtag  DW_TAG_member
   10698                      .dwattr $C$DW$1897, DW_AT_type(*$C$DW$T$39)
   10699                      .dwattr $C$DW$1897, DW_AT_name("GPBSET")
   10700                      .dwattr $C$DW$1897, DW_AT_TI_symbol_name("_GPBSET")
   10701                      .dwattr $C$DW$1897, DW_AT_data_member_location[DW_OP_plus_uconst 0x4a]
   10702                      .dwattr $C$DW$1897, DW_AT_accessibility(DW_ACCESS_public)
   10703              $C$DW$1898      .dwtag  DW_TAG_member
   10704                      .dwattr $C$DW$1898, DW_AT_type(*$C$DW$T$39)
   10705                      .dwattr $C$DW$1898, DW_AT_name("GPBCLEAR")
   10706                      .dwattr $C$DW$1898, DW_AT_TI_symbol_name("_GPBCLEAR")
   10707                      .dwattr $C$DW$1898, DW_AT_data_member_location[DW_OP_plus_uconst 0x4c]
   10708                      .dwattr $C$DW$1898, DW_AT_accessibility(DW_ACCESS_public)
   10709              $C$DW$1899      .dwtag  DW_TAG_member
   10710                      .dwattr $C$DW$1899, DW_AT_type(*$C$DW$T$39)
   10711                      .dwattr $C$DW$1899, DW_AT_name("GPBTOGGLE")
   10712                      .dwattr $C$DW$1899, DW_AT_TI_symbol_name("_GPBTOGGLE")
   10713                      .dwattr $C$DW$1899, DW_AT_data_member_location[DW_OP_plus_uconst 0x4e]
   10714                      .dwattr $C$DW$1899, DW_AT_accessibility(DW_ACCESS_public)
   10715              $C$DW$1900      .dwtag  DW_TAG_member
   10716                      .dwattr $C$DW$1900, DW_AT_type(*$C$DW$T$31)
   10717                      .dwattr $C$DW$1900, DW_AT_name("rsvd_7")
   10718                      .dwattr $C$DW$1900, DW_AT_TI_symbol_name("_rsvd_7")
   10719                      .dwattr $C$DW$1900, DW_AT_data_member_location[DW_OP_plus_uconst 0x50]
   10720                      .dwattr $C$DW$1900, DW_AT_accessibility(DW_ACCESS_public)
   10721              $C$DW$1901      .dwtag  DW_TAG_member
   10722                      .dwattr $C$DW$1901, DW_AT_type(*$C$DW$T$39)
   10723                      .dwattr $C$DW$1901, DW_AT_name("AIODAT")
   10724                      .dwattr $C$DW$1901, DW_AT_TI_symbol_name("_AIODAT")
   10725                      .dwattr $C$DW$1901, DW_AT_data_member_location[DW_OP_plus_uconst 0x58]
   10726                      .dwattr $C$DW$1901, DW_AT_accessibility(DW_ACCESS_public)
   10727              $C$DW$1902      .dwtag  DW_TAG_member
   10728                      .dwattr $C$DW$1902, DW_AT_type(*$C$DW$T$39)
   10729                      .dwattr $C$DW$1902, DW_AT_name("AIOSET")
   10730                      .dwattr $C$DW$1902, DW_AT_TI_symbol_name("_AIOSET")
   10731                      .dwattr $C$DW$1902, DW_AT_data_member_location[DW_OP_plus_uconst 0x5a]
   10732                      .dwattr $C$DW$1902, DW_AT_accessibility(DW_ACCESS_public)
   10733              $C$DW$1903      .dwtag  DW_TAG_member
   10734                      .dwattr $C$DW$1903, DW_AT_type(*$C$DW$T$39)
   10735                      .dwattr $C$DW$1903, DW_AT_name("AIOCLEAR")
   10736                      .dwattr $C$DW$1903, DW_AT_TI_symbol_name("_AIOCLEAR")
   10737                      .dwattr $C$DW$1903, DW_AT_data_member_location[DW_OP_plus_uconst 0x5c]
   10738                      .dwattr $C$DW$1903, DW_AT_accessibility(DW_ACCESS_public)
   10739              $C$DW$1904      .dwtag  DW_TAG_member
   10740                      .dwattr $C$DW$1904, DW_AT_type(*$C$DW$T$39)
   10741                      .dwattr $C$DW$1904, DW_AT_name("AIOTOGGLE")
TMS320C2000 Assembler PC v6.2.5 Sat Sep 16 15:41:33 2017

Tools Copyright (c) 1996-2014 Texas Instruments Incorporated
C:\Users\wmj\AppData\Local\Temp\1302810                              PAGE  206

   10742                      .dwattr $C$DW$1904, DW_AT_TI_symbol_name("_AIOTOGGLE")
   10743                      .dwattr $C$DW$1904, DW_AT_data_member_location[DW_OP_plus_uconst 0x5e]
   10744                      .dwattr $C$DW$1904, DW_AT_accessibility(DW_ACCESS_public)
   10745              $C$DW$1905      .dwtag  DW_TAG_member
   10746                      .dwattr $C$DW$1905, DW_AT_type(*$C$DW$T$28)
   10747                      .dwattr $C$DW$1905, DW_AT_name("GPIOXINTnSEL")
   10748                      .dwattr $C$DW$1905, DW_AT_TI_symbol_name("_GPIOXINTnSEL")
   10749                      .dwattr $C$DW$1905, DW_AT_data_member_location[DW_OP_plus_uconst 0x60]
   10750                      .dwattr $C$DW$1905, DW_AT_accessibility(DW_ACCESS_public)
   10751              $C$DW$1906      .dwtag  DW_TAG_member
   10752                      .dwattr $C$DW$1906, DW_AT_type(*$C$DW$T$27)
   10753                      .dwattr $C$DW$1906, DW_AT_name("rsvd_8")
   10754                      .dwattr $C$DW$1906, DW_AT_TI_symbol_name("_rsvd_8")
   10755                      .dwattr $C$DW$1906, DW_AT_data_member_location[DW_OP_plus_uconst 0x63]
   10756                      .dwattr $C$DW$1906, DW_AT_accessibility(DW_ACCESS_public)
   10757              $C$DW$1907      .dwtag  DW_TAG_member
   10758                      .dwattr $C$DW$1907, DW_AT_type(*$C$DW$T$39)
   10759                      .dwattr $C$DW$1907, DW_AT_name("GPIOLPMSEL")
   10760                      .dwattr $C$DW$1907, DW_AT_TI_symbol_name("_GPIOLPMSEL")
   10761                      .dwattr $C$DW$1907, DW_AT_data_member_location[DW_OP_plus_uconst 0x68]
   10762                      .dwattr $C$DW$1907, DW_AT_accessibility(DW_ACCESS_public)
   10763                      .dwendtag $C$DW$T$42
   10764              
   10765              $C$DW$T$58      .dwtag  DW_TAG_pointer_type
   10766                      .dwattr $C$DW$T$58, DW_AT_type(*$C$DW$T$42)
   10767                      .dwattr $C$DW$T$58, DW_AT_address_class(0x16)
   10768              $C$DW$T$59      .dwtag  DW_TAG_typedef, DW_AT_name("GPIO_Handle")
   10769                      .dwattr $C$DW$T$59, DW_AT_type(*$C$DW$T$58)
   10770                      .dwattr $C$DW$T$59, DW_AT_language(DW_LANG_C)
   10771              
   10772              $C$DW$T$44      .dwtag  DW_TAG_structure_type
   10773                      .dwattr $C$DW$T$44, DW_AT_name("_HAL_AdcData_t_")
   10774                      .dwattr $C$DW$T$44, DW_AT_byte_size(0x16)
   10775              $C$DW$1908      .dwtag  DW_TAG_member
   10776                      .dwattr $C$DW$1908, DW_AT_type(*$C$DW$T$43)
   10777                      .dwattr $C$DW$1908, DW_AT_name("I")
   10778                      .dwattr $C$DW$1908, DW_AT_TI_symbol_name("_I")
   10779                      .dwattr $C$DW$1908, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
   10780                      .dwattr $C$DW$1908, DW_AT_accessibility(DW_ACCESS_public)
   10781              $C$DW$1909      .dwtag  DW_TAG_member
   10782                      .dwattr $C$DW$1909, DW_AT_type(*$C$DW$T$43)
   10783                      .dwattr $C$DW$1909, DW_AT_name("V")
   10784                      .dwattr $C$DW$1909, DW_AT_TI_symbol_name("_V")
   10785                      .dwattr $C$DW$1909, DW_AT_data_member_location[DW_OP_plus_uconst 0x6]
   10786                      .dwattr $C$DW$1909, DW_AT_accessibility(DW_ACCESS_public)
   10787              $C$DW$1910      .dwtag  DW_TAG_member
   10788                      .dwattr $C$DW$1910, DW_AT_type(*$C$DW$T$35)
   10789                      .dwattr $C$DW$1910, DW_AT_name("dcBus")
   10790                      .dwattr $C$DW$1910, DW_AT_TI_symbol_name("_dcBus")
   10791                      .dwattr $C$DW$1910, DW_AT_data_member_location[DW_OP_plus_uconst 0xc]
   10792                      .dwattr $C$DW$1910, DW_AT_accessibility(DW_ACCESS_public)
   10793              $C$DW$1911      .dwtag  DW_TAG_member
   10794                      .dwattr $C$DW$1911, DW_AT_type(*$C$DW$T$35)
   10795                      .dwattr $C$DW$1911, DW_AT_name("analogSensor1")
   10796                      .dwattr $C$DW$1911, DW_AT_TI_symbol_name("_analogSensor1")
TMS320C2000 Assembler PC v6.2.5 Sat Sep 16 15:41:33 2017

Tools Copyright (c) 1996-2014 Texas Instruments Incorporated
C:\Users\wmj\AppData\Local\Temp\1302810                              PAGE  207

   10797                      .dwattr $C$DW$1911, DW_AT_data_member_location[DW_OP_plus_uconst 0xe]
   10798                      .dwattr $C$DW$1911, DW_AT_accessibility(DW_ACCESS_public)
   10799              $C$DW$1912      .dwtag  DW_TAG_member
   10800                      .dwattr $C$DW$1912, DW_AT_type(*$C$DW$T$35)
   10801                      .dwattr $C$DW$1912, DW_AT_name("analogSensor2")
   10802                      .dwattr $C$DW$1912, DW_AT_TI_symbol_name("_analogSensor2")
   10803                      .dwattr $C$DW$1912, DW_AT_data_member_location[DW_OP_plus_uconst 0x10]
   10804                      .dwattr $C$DW$1912, DW_AT_accessibility(DW_ACCESS_public)
   10805              $C$DW$1913      .dwtag  DW_TAG_member
   10806                      .dwattr $C$DW$1913, DW_AT_type(*$C$DW$T$35)
   10807                      .dwattr $C$DW$1913, DW_AT_name("igbtNTC")
   10808                      .dwattr $C$DW$1913, DW_AT_TI_symbol_name("_igbtNTC")
   10809                      .dwattr $C$DW$1913, DW_AT_data_member_location[DW_OP_plus_uconst 0x12]
   10810                      .dwattr $C$DW$1913, DW_AT_accessibility(DW_ACCESS_public)
   10811              $C$DW$1914      .dwtag  DW_TAG_member
   10812                      .dwattr $C$DW$1914, DW_AT_type(*$C$DW$T$35)
   10813                      .dwattr $C$DW$1914, DW_AT_name("boardAddr")
   10814                      .dwattr $C$DW$1914, DW_AT_TI_symbol_name("_boardAddr")
   10815                      .dwattr $C$DW$1914, DW_AT_data_member_location[DW_OP_plus_uconst 0x14]
   10816                      .dwattr $C$DW$1914, DW_AT_accessibility(DW_ACCESS_public)
   10817                      .dwendtag $C$DW$T$44
   10818              
   10819              $C$DW$T$87      .dwtag  DW_TAG_typedef, DW_AT_name("HAL_AdcData_t")
   10820                      .dwattr $C$DW$T$87, DW_AT_type(*$C$DW$T$44)
   10821                      .dwattr $C$DW$T$87, DW_AT_language(DW_LANG_C)
   10822              
   10823              $C$DW$T$49      .dwtag  DW_TAG_structure_type
   10824                      .dwattr $C$DW$T$49, DW_AT_name("_HAL_DacData_t_")
   10825                      .dwattr $C$DW$T$49, DW_AT_byte_size(0x22)
   10826              $C$DW$1915      .dwtag  DW_TAG_member
   10827                      .dwattr $C$DW$1915, DW_AT_type(*$C$DW$T$22)
   10828                      .dwattr $C$DW$1915, DW_AT_name("PeriodMax")
   10829                      .dwattr $C$DW$1915, DW_AT_TI_symbol_name("_PeriodMax")
   10830                      .dwattr $C$DW$1915, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
   10831                      .dwattr $C$DW$1915, DW_AT_accessibility(DW_ACCESS_public)
   10832              $C$DW$1916      .dwtag  DW_TAG_member
   10833                      .dwattr $C$DW$1916, DW_AT_type(*$C$DW$T$47)
   10834                      .dwattr $C$DW$1916, DW_AT_name("ptrData")
   10835                      .dwattr $C$DW$1916, DW_AT_TI_symbol_name("_ptrData")
   10836                      .dwattr $C$DW$1916, DW_AT_data_member_location[DW_OP_plus_uconst 0x2]
   10837                      .dwattr $C$DW$1916, DW_AT_accessibility(DW_ACCESS_public)
   10838              $C$DW$1917      .dwtag  DW_TAG_member
   10839                      .dwattr $C$DW$1917, DW_AT_type(*$C$DW$T$48)
   10840                      .dwattr $C$DW$1917, DW_AT_name("value")
   10841                      .dwattr $C$DW$1917, DW_AT_TI_symbol_name("_value")
   10842                      .dwattr $C$DW$1917, DW_AT_data_member_location[DW_OP_plus_uconst 0xa]
   10843                      .dwattr $C$DW$1917, DW_AT_accessibility(DW_ACCESS_public)
   10844              $C$DW$1918      .dwtag  DW_TAG_member
   10845                      .dwattr $C$DW$1918, DW_AT_type(*$C$DW$T$48)
   10846                      .dwattr $C$DW$1918, DW_AT_name("offset")
   10847                      .dwattr $C$DW$1918, DW_AT_TI_symbol_name("_offset")
   10848                      .dwattr $C$DW$1918, DW_AT_data_member_location[DW_OP_plus_uconst 0x12]
   10849                      .dwattr $C$DW$1918, DW_AT_accessibility(DW_ACCESS_public)
   10850              $C$DW$1919      .dwtag  DW_TAG_member
   10851                      .dwattr $C$DW$1919, DW_AT_type(*$C$DW$T$48)
TMS320C2000 Assembler PC v6.2.5 Sat Sep 16 15:41:33 2017

Tools Copyright (c) 1996-2014 Texas Instruments Incorporated
C:\Users\wmj\AppData\Local\Temp\1302810                              PAGE  208

   10852                      .dwattr $C$DW$1919, DW_AT_name("gain")
   10853                      .dwattr $C$DW$1919, DW_AT_TI_symbol_name("_gain")
   10854                      .dwattr $C$DW$1919, DW_AT_data_member_location[DW_OP_plus_uconst 0x1a]
   10855                      .dwattr $C$DW$1919, DW_AT_accessibility(DW_ACCESS_public)
   10856                      .dwendtag $C$DW$T$49
   10857              
   10858              $C$DW$T$350     .dwtag  DW_TAG_typedef, DW_AT_name("HAL_DacData_t")
   10859                      .dwattr $C$DW$T$350, DW_AT_type(*$C$DW$T$49)
   10860                      .dwattr $C$DW$T$350, DW_AT_language(DW_LANG_C)
   10861              $C$DW$T$351     .dwtag  DW_TAG_pointer_type
   10862                      .dwattr $C$DW$T$351, DW_AT_type(*$C$DW$T$350)
   10863                      .dwattr $C$DW$T$351, DW_AT_address_class(0x16)
   10864              $C$DW$1920      .dwtag  DW_TAG_TI_far_type
   10865                      .dwattr $C$DW$1920, DW_AT_type(*$C$DW$T$351)
   10866              $C$DW$T$352     .dwtag  DW_TAG_const_type
   10867                      .dwattr $C$DW$T$352, DW_AT_type(*$C$DW$1920)
   10868              
   10869              $C$DW$T$90      .dwtag  DW_TAG_structure_type
   10870                      .dwattr $C$DW$T$90, DW_AT_name("_HAL_Obj_")
   10871                      .dwattr $C$DW$T$90, DW_AT_byte_size(0xb6)
   10872              $C$DW$1921      .dwtag  DW_TAG_member
   10873                      .dwattr $C$DW$1921, DW_AT_type(*$C$DW$T$51)
   10874                      .dwattr $C$DW$1921, DW_AT_name("adcHandle")
   10875                      .dwattr $C$DW$1921, DW_AT_TI_symbol_name("_adcHandle")
   10876                      .dwattr $C$DW$1921, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
   10877                      .dwattr $C$DW$1921, DW_AT_accessibility(DW_ACCESS_public)
   10878              $C$DW$1922      .dwtag  DW_TAG_member
   10879                      .dwattr $C$DW$1922, DW_AT_type(*$C$DW$T$53)
   10880                      .dwattr $C$DW$1922, DW_AT_name("clkHandle")
   10881                      .dwattr $C$DW$1922, DW_AT_TI_symbol_name("_clkHandle")
   10882                      .dwattr $C$DW$1922, DW_AT_data_member_location[DW_OP_plus_uconst 0x2]
   10883                      .dwattr $C$DW$1922, DW_AT_accessibility(DW_ACCESS_public)
   10884              $C$DW$1923      .dwtag  DW_TAG_member
   10885                      .dwattr $C$DW$1923, DW_AT_type(*$C$DW$T$55)
   10886                      .dwattr $C$DW$1923, DW_AT_name("cpuHandle")
   10887                      .dwattr $C$DW$1923, DW_AT_TI_symbol_name("_cpuHandle")
   10888                      .dwattr $C$DW$1923, DW_AT_data_member_location[DW_OP_plus_uconst 0x4]
   10889                      .dwattr $C$DW$1923, DW_AT_accessibility(DW_ACCESS_public)
   10890              $C$DW$1924      .dwtag  DW_TAG_member
   10891                      .dwattr $C$DW$1924, DW_AT_type(*$C$DW$T$57)
   10892                      .dwattr $C$DW$1924, DW_AT_name("flashHandle")
   10893                      .dwattr $C$DW$1924, DW_AT_TI_symbol_name("_flashHandle")
   10894                      .dwattr $C$DW$1924, DW_AT_data_member_location[DW_OP_plus_uconst 0x6]
   10895                      .dwattr $C$DW$1924, DW_AT_accessibility(DW_ACCESS_public)
   10896              $C$DW$1925      .dwtag  DW_TAG_member
   10897                      .dwattr $C$DW$1925, DW_AT_type(*$C$DW$T$59)
   10898                      .dwattr $C$DW$1925, DW_AT_name("gpioHandle")
   10899                      .dwattr $C$DW$1925, DW_AT_TI_symbol_name("_gpioHandle")
   10900                      .dwattr $C$DW$1925, DW_AT_data_member_location[DW_OP_plus_uconst 0x8]
   10901                      .dwattr $C$DW$1925, DW_AT_accessibility(DW_ACCESS_public)
   10902              $C$DW$1926      .dwtag  DW_TAG_member
   10903                      .dwattr $C$DW$1926, DW_AT_type(*$C$DW$T$62)
   10904                      .dwattr $C$DW$1926, DW_AT_name("offsetHandle_I")
   10905                      .dwattr $C$DW$1926, DW_AT_TI_symbol_name("_offsetHandle_I")
   10906                      .dwattr $C$DW$1926, DW_AT_data_member_location[DW_OP_plus_uconst 0xa]
TMS320C2000 Assembler PC v6.2.5 Sat Sep 16 15:41:33 2017

Tools Copyright (c) 1996-2014 Texas Instruments Incorporated
C:\Users\wmj\AppData\Local\Temp\1302810                              PAGE  209

   10907                      .dwattr $C$DW$1926, DW_AT_accessibility(DW_ACCESS_public)
   10908              $C$DW$1927      .dwtag  DW_TAG_member
   10909                      .dwattr $C$DW$1927, DW_AT_type(*$C$DW$T$64)
   10910                      .dwattr $C$DW$1927, DW_AT_name("offset_I")
   10911                      .dwattr $C$DW$1927, DW_AT_TI_symbol_name("_offset_I")
   10912                      .dwattr $C$DW$1927, DW_AT_data_member_location[DW_OP_plus_uconst 0x10]
   10913                      .dwattr $C$DW$1927, DW_AT_accessibility(DW_ACCESS_public)
   10914              $C$DW$1928      .dwtag  DW_TAG_member
   10915                      .dwattr $C$DW$1928, DW_AT_type(*$C$DW$T$62)
   10916                      .dwattr $C$DW$1928, DW_AT_name("offsetHandle_V")
   10917                      .dwattr $C$DW$1928, DW_AT_TI_symbol_name("_offsetHandle_V")
   10918                      .dwattr $C$DW$1928, DW_AT_data_member_location[DW_OP_plus_uconst 0x40]
   10919                      .dwattr $C$DW$1928, DW_AT_accessibility(DW_ACCESS_public)
   10920              $C$DW$1929      .dwtag  DW_TAG_member
   10921                      .dwattr $C$DW$1929, DW_AT_type(*$C$DW$T$64)
   10922                      .dwattr $C$DW$1929, DW_AT_name("offset_V")
   10923                      .dwattr $C$DW$1929, DW_AT_TI_symbol_name("_offset_V")
   10924                      .dwattr $C$DW$1929, DW_AT_data_member_location[DW_OP_plus_uconst 0x46]
   10925                      .dwattr $C$DW$1929, DW_AT_accessibility(DW_ACCESS_public)
   10926              $C$DW$1930      .dwtag  DW_TAG_member
   10927                      .dwattr $C$DW$1930, DW_AT_type(*$C$DW$T$66)
   10928                      .dwattr $C$DW$1930, DW_AT_name("oscHandle")
   10929                      .dwattr $C$DW$1930, DW_AT_TI_symbol_name("_oscHandle")
   10930                      .dwattr $C$DW$1930, DW_AT_data_member_location[DW_OP_plus_uconst 0x76]
   10931                      .dwattr $C$DW$1930, DW_AT_accessibility(DW_ACCESS_public)
   10932              $C$DW$1931      .dwtag  DW_TAG_member
   10933                      .dwattr $C$DW$1931, DW_AT_type(*$C$DW$T$68)
   10934                      .dwattr $C$DW$1931, DW_AT_name("pieHandle")
   10935                      .dwattr $C$DW$1931, DW_AT_TI_symbol_name("_pieHandle")
   10936                      .dwattr $C$DW$1931, DW_AT_data_member_location[DW_OP_plus_uconst 0x78]
   10937                      .dwattr $C$DW$1931, DW_AT_accessibility(DW_ACCESS_public)
   10938              $C$DW$1932      .dwtag  DW_TAG_member
   10939                      .dwattr $C$DW$1932, DW_AT_type(*$C$DW$T$70)
   10940                      .dwattr $C$DW$1932, DW_AT_name("pllHandle")
   10941                      .dwattr $C$DW$1932, DW_AT_TI_symbol_name("_pllHandle")
   10942                      .dwattr $C$DW$1932, DW_AT_data_member_location[DW_OP_plus_uconst 0x7a]
   10943                      .dwattr $C$DW$1932, DW_AT_accessibility(DW_ACCESS_public)
   10944              $C$DW$1933      .dwtag  DW_TAG_member
   10945                      .dwattr $C$DW$1933, DW_AT_type(*$C$DW$T$73)
   10946                      .dwattr $C$DW$1933, DW_AT_name("pwmHandle")
   10947                      .dwattr $C$DW$1933, DW_AT_TI_symbol_name("_pwmHandle")
   10948                      .dwattr $C$DW$1933, DW_AT_data_member_location[DW_OP_plus_uconst 0x7c]
   10949                      .dwattr $C$DW$1933, DW_AT_accessibility(DW_ACCESS_public)
   10950              $C$DW$1934      .dwtag  DW_TAG_member
   10951                      .dwattr $C$DW$1934, DW_AT_type(*$C$DW$T$73)
   10952                      .dwattr $C$DW$1934, DW_AT_name("pwmDacHandle")
   10953                      .dwattr $C$DW$1934, DW_AT_TI_symbol_name("_pwmDacHandle")
   10954                      .dwattr $C$DW$1934, DW_AT_data_member_location[DW_OP_plus_uconst 0x82]
   10955                      .dwattr $C$DW$1934, DW_AT_accessibility(DW_ACCESS_public)
   10956              $C$DW$1935      .dwtag  DW_TAG_member
   10957                      .dwattr $C$DW$1935, DW_AT_type(*$C$DW$T$75)
   10958                      .dwattr $C$DW$1935, DW_AT_name("pwrHandle")
   10959                      .dwattr $C$DW$1935, DW_AT_TI_symbol_name("_pwrHandle")
   10960                      .dwattr $C$DW$1935, DW_AT_data_member_location[DW_OP_plus_uconst 0x88]
   10961                      .dwattr $C$DW$1935, DW_AT_accessibility(DW_ACCESS_public)
TMS320C2000 Assembler PC v6.2.5 Sat Sep 16 15:41:33 2017

Tools Copyright (c) 1996-2014 Texas Instruments Incorporated
C:\Users\wmj\AppData\Local\Temp\1302810                              PAGE  210

   10962              $C$DW$1936      .dwtag  DW_TAG_member
   10963                      .dwattr $C$DW$1936, DW_AT_type(*$C$DW$T$78)
   10964                      .dwattr $C$DW$1936, DW_AT_name("timerHandle")
   10965                      .dwattr $C$DW$1936, DW_AT_TI_symbol_name("_timerHandle")
   10966                      .dwattr $C$DW$1936, DW_AT_data_member_location[DW_OP_plus_uconst 0x8a]
   10967                      .dwattr $C$DW$1936, DW_AT_accessibility(DW_ACCESS_public)
   10968              $C$DW$1937      .dwtag  DW_TAG_member
   10969                      .dwattr $C$DW$1937, DW_AT_type(*$C$DW$T$80)
   10970                      .dwattr $C$DW$1937, DW_AT_name("i2cHandle")
   10971                      .dwattr $C$DW$1937, DW_AT_TI_symbol_name("_i2cHandle")
   10972                      .dwattr $C$DW$1937, DW_AT_data_member_location[DW_OP_plus_uconst 0x90]
   10973                      .dwattr $C$DW$1937, DW_AT_accessibility(DW_ACCESS_public)
   10974              $C$DW$1938      .dwtag  DW_TAG_member
   10975                      .dwattr $C$DW$1938, DW_AT_type(*$C$DW$T$82)
   10976                      .dwattr $C$DW$1938, DW_AT_name("spiAHandle")
   10977                      .dwattr $C$DW$1938, DW_AT_TI_symbol_name("_spiAHandle")
   10978                      .dwattr $C$DW$1938, DW_AT_data_member_location[DW_OP_plus_uconst 0x92]
   10979                      .dwattr $C$DW$1938, DW_AT_accessibility(DW_ACCESS_public)
   10980              $C$DW$1939      .dwtag  DW_TAG_member
   10981                      .dwattr $C$DW$1939, DW_AT_type(*$C$DW$T$84)
   10982                      .dwattr $C$DW$1939, DW_AT_name("wdogHandle")
   10983                      .dwattr $C$DW$1939, DW_AT_TI_symbol_name("_wdogHandle")
   10984                      .dwattr $C$DW$1939, DW_AT_data_member_location[DW_OP_plus_uconst 0x94]
   10985                      .dwattr $C$DW$1939, DW_AT_accessibility(DW_ACCESS_public)
   10986              $C$DW$1940      .dwtag  DW_TAG_member
   10987                      .dwattr $C$DW$1940, DW_AT_type(*$C$DW$T$86)
   10988                      .dwattr $C$DW$1940, DW_AT_name("sciHandle")
   10989                      .dwattr $C$DW$1940, DW_AT_TI_symbol_name("_sciHandle")
   10990                      .dwattr $C$DW$1940, DW_AT_data_member_location[DW_OP_plus_uconst 0x96]
   10991                      .dwattr $C$DW$1940, DW_AT_accessibility(DW_ACCESS_public)
   10992              $C$DW$1941      .dwtag  DW_TAG_member
   10993                      .dwattr $C$DW$1941, DW_AT_type(*$C$DW$T$87)
   10994                      .dwattr $C$DW$1941, DW_AT_name("adcBias")
   10995                      .dwattr $C$DW$1941, DW_AT_TI_symbol_name("_adcBias")
   10996                      .dwattr $C$DW$1941, DW_AT_data_member_location[DW_OP_plus_uconst 0x98]
   10997                      .dwattr $C$DW$1941, DW_AT_accessibility(DW_ACCESS_public)
   10998              $C$DW$1942      .dwtag  DW_TAG_member
   10999                      .dwattr $C$DW$1942, DW_AT_type(*$C$DW$T$35)
   11000                      .dwattr $C$DW$1942, DW_AT_name("current_sf")
   11001                      .dwattr $C$DW$1942, DW_AT_TI_symbol_name("_current_sf")
   11002                      .dwattr $C$DW$1942, DW_AT_data_member_location[DW_OP_plus_uconst 0xae]
   11003                      .dwattr $C$DW$1942, DW_AT_accessibility(DW_ACCESS_public)
   11004              $C$DW$1943      .dwtag  DW_TAG_member
   11005                      .dwattr $C$DW$1943, DW_AT_type(*$C$DW$T$35)
   11006                      .dwattr $C$DW$1943, DW_AT_name("voltage_sf")
   11007                      .dwattr $C$DW$1943, DW_AT_TI_symbol_name("_voltage_sf")
   11008                      .dwattr $C$DW$1943, DW_AT_data_member_location[DW_OP_plus_uconst 0xb0]
   11009                      .dwattr $C$DW$1943, DW_AT_accessibility(DW_ACCESS_public)
   11010              $C$DW$1944      .dwtag  DW_TAG_member
   11011                      .dwattr $C$DW$1944, DW_AT_type(*$C$DW$T$33)
   11012                      .dwattr $C$DW$1944, DW_AT_name("numCurrentSensors")
   11013                      .dwattr $C$DW$1944, DW_AT_TI_symbol_name("_numCurrentSensors")
   11014                      .dwattr $C$DW$1944, DW_AT_data_member_location[DW_OP_plus_uconst 0xb2]
   11015                      .dwattr $C$DW$1944, DW_AT_accessibility(DW_ACCESS_public)
   11016              $C$DW$1945      .dwtag  DW_TAG_member
TMS320C2000 Assembler PC v6.2.5 Sat Sep 16 15:41:33 2017

Tools Copyright (c) 1996-2014 Texas Instruments Incorporated
C:\Users\wmj\AppData\Local\Temp\1302810                              PAGE  211

   11017                      .dwattr $C$DW$1945, DW_AT_type(*$C$DW$T$33)
   11018                      .dwattr $C$DW$1945, DW_AT_name("numVoltageSensors")
   11019                      .dwattr $C$DW$1945, DW_AT_TI_symbol_name("_numVoltageSensors")
   11020                      .dwattr $C$DW$1945, DW_AT_data_member_location[DW_OP_plus_uconst 0xb3]
   11021                      .dwattr $C$DW$1945, DW_AT_accessibility(DW_ACCESS_public)
   11022              $C$DW$1946      .dwtag  DW_TAG_member
   11023                      .dwattr $C$DW$1946, DW_AT_type(*$C$DW$T$89)
   11024                      .dwattr $C$DW$1946, DW_AT_name("boardAddress")
   11025                      .dwattr $C$DW$1946, DW_AT_TI_symbol_name("_boardAddress")
   11026                      .dwattr $C$DW$1946, DW_AT_data_member_location[DW_OP_plus_uconst 0xb4]
   11027                      .dwattr $C$DW$1946, DW_AT_accessibility(DW_ACCESS_public)
   11028                      .dwendtag $C$DW$T$90
   11029              
   11030              $C$DW$T$355     .dwtag  DW_TAG_typedef, DW_AT_name("HAL_Obj")
   11031                      .dwattr $C$DW$T$355, DW_AT_type(*$C$DW$T$90)
   11032                      .dwattr $C$DW$T$355, DW_AT_language(DW_LANG_C)
   11033              $C$DW$T$356     .dwtag  DW_TAG_pointer_type
   11034                      .dwattr $C$DW$T$356, DW_AT_type(*$C$DW$T$355)
   11035                      .dwattr $C$DW$T$356, DW_AT_address_class(0x16)
   11036              $C$DW$T$357     .dwtag  DW_TAG_pointer_type
   11037                      .dwattr $C$DW$T$357, DW_AT_type(*$C$DW$T$90)
   11038                      .dwattr $C$DW$T$357, DW_AT_address_class(0x16)
   11039              $C$DW$T$358     .dwtag  DW_TAG_typedef, DW_AT_name("HAL_Handle")
   11040                      .dwattr $C$DW$T$358, DW_AT_type(*$C$DW$T$357)
   11041                      .dwattr $C$DW$T$358, DW_AT_language(DW_LANG_C)
   11042              $C$DW$1947      .dwtag  DW_TAG_TI_far_type
   11043                      .dwattr $C$DW$1947, DW_AT_type(*$C$DW$T$358)
   11044              $C$DW$T$359     .dwtag  DW_TAG_const_type
   11045                      .dwattr $C$DW$T$359, DW_AT_type(*$C$DW$1947)
   11046              
   11047              $C$DW$T$92      .dwtag  DW_TAG_structure_type
   11048                      .dwattr $C$DW$T$92, DW_AT_name("_MATH_vec3_")
   11049                      .dwattr $C$DW$T$92, DW_AT_byte_size(0x06)
   11050              $C$DW$1948      .dwtag  DW_TAG_member
   11051                      .dwattr $C$DW$1948, DW_AT_type(*$C$DW$T$91)
   11052                      .dwattr $C$DW$1948, DW_AT_name("value")
   11053                      .dwattr $C$DW$1948, DW_AT_TI_symbol_name("_value")
   11054                      .dwattr $C$DW$1948, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
   11055                      .dwattr $C$DW$1948, DW_AT_accessibility(DW_ACCESS_public)
   11056                      .dwendtag $C$DW$T$92
   11057              
   11058              $C$DW$T$43      .dwtag  DW_TAG_typedef, DW_AT_name("MATH_vec3")
   11059                      .dwattr $C$DW$T$43, DW_AT_type(*$C$DW$T$92)
   11060                      .dwattr $C$DW$T$43, DW_AT_language(DW_LANG_C)
   11061              
   11062              $C$DW$T$96      .dwtag  DW_TAG_structure_type
   11063                      .dwattr $C$DW$T$96, DW_AT_name("_OFFSET_")
   11064                      .dwattr $C$DW$T$96, DW_AT_byte_size(0x10)
   11065              $C$DW$1949      .dwtag  DW_TAG_member
   11066                      .dwattr $C$DW$1949, DW_AT_type(*$C$DW$T$35)
   11067                      .dwattr $C$DW$1949, DW_AT_name("value")
   11068                      .dwattr $C$DW$1949, DW_AT_TI_symbol_name("_value")
   11069                      .dwattr $C$DW$1949, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
   11070                      .dwattr $C$DW$1949, DW_AT_accessibility(DW_ACCESS_public)
   11071              $C$DW$1950      .dwtag  DW_TAG_member
TMS320C2000 Assembler PC v6.2.5 Sat Sep 16 15:41:33 2017

Tools Copyright (c) 1996-2014 Texas Instruments Incorporated
C:\Users\wmj\AppData\Local\Temp\1302810                              PAGE  212

   11072                      .dwattr $C$DW$1950, DW_AT_type(*$C$DW$T$35)
   11073                      .dwattr $C$DW$1950, DW_AT_name("bias")
   11074                      .dwattr $C$DW$1950, DW_AT_TI_symbol_name("_bias")
   11075                      .dwattr $C$DW$1950, DW_AT_data_member_location[DW_OP_plus_uconst 0x2]
   11076                      .dwattr $C$DW$1950, DW_AT_accessibility(DW_ACCESS_public)
   11077              $C$DW$1951      .dwtag  DW_TAG_member
   11078                      .dwattr $C$DW$1951, DW_AT_type(*$C$DW$T$93)
   11079                      .dwattr $C$DW$1951, DW_AT_name("filter")
   11080                      .dwattr $C$DW$1951, DW_AT_TI_symbol_name("_filter")
   11081                      .dwattr $C$DW$1951, DW_AT_data_member_location[DW_OP_plus_uconst 0x4]
   11082                      .dwattr $C$DW$1951, DW_AT_accessibility(DW_ACCESS_public)
   11083              $C$DW$1952      .dwtag  DW_TAG_member
   11084                      .dwattr $C$DW$1952, DW_AT_type(*$C$DW$T$95)
   11085                      .dwattr $C$DW$1952, DW_AT_name("filterHandle")
   11086                      .dwattr $C$DW$1952, DW_AT_TI_symbol_name("_filterHandle")
   11087                      .dwattr $C$DW$1952, DW_AT_data_member_location[DW_OP_plus_uconst 0xe]
   11088                      .dwattr $C$DW$1952, DW_AT_accessibility(DW_ACCESS_public)
   11089                      .dwendtag $C$DW$T$96
   11090              
   11091              $C$DW$T$63      .dwtag  DW_TAG_typedef, DW_AT_name("OFFSET_Obj")
   11092                      .dwattr $C$DW$T$63, DW_AT_type(*$C$DW$T$96)
   11093                      .dwattr $C$DW$T$63, DW_AT_language(DW_LANG_C)
   11094              
   11095              $C$DW$T$64      .dwtag  DW_TAG_array_type
   11096                      .dwattr $C$DW$T$64, DW_AT_type(*$C$DW$T$63)
   11097                      .dwattr $C$DW$T$64, DW_AT_language(DW_LANG_C)
   11098                      .dwattr $C$DW$T$64, DW_AT_byte_size(0x30)
   11099              $C$DW$1953      .dwtag  DW_TAG_subrange_type
   11100                      .dwattr $C$DW$1953, DW_AT_upper_bound(0x02)
   11101                      .dwendtag $C$DW$T$64
   11102              
   11103              
   11104              $C$DW$T$21      .dwtag  DW_TAG_structure_type
   11105                      .dwattr $C$DW$T$21, DW_AT_name("_OFFSET_Obj_")
   11106                      .dwattr $C$DW$T$21, DW_AT_declaration
   11107                      .dwendtag $C$DW$T$21
   11108              
   11109              $C$DW$T$60      .dwtag  DW_TAG_pointer_type
   11110                      .dwattr $C$DW$T$60, DW_AT_type(*$C$DW$T$21)
   11111                      .dwattr $C$DW$T$60, DW_AT_address_class(0x16)
   11112              $C$DW$T$61      .dwtag  DW_TAG_typedef, DW_AT_name("OFFSET_Handle")
   11113                      .dwattr $C$DW$T$61, DW_AT_type(*$C$DW$T$60)
   11114                      .dwattr $C$DW$T$61, DW_AT_language(DW_LANG_C)
   11115              
   11116              $C$DW$T$62      .dwtag  DW_TAG_array_type
   11117                      .dwattr $C$DW$T$62, DW_AT_type(*$C$DW$T$61)
   11118                      .dwattr $C$DW$T$62, DW_AT_language(DW_LANG_C)
   11119                      .dwattr $C$DW$T$62, DW_AT_byte_size(0x06)
   11120              $C$DW$1954      .dwtag  DW_TAG_subrange_type
   11121                      .dwattr $C$DW$1954, DW_AT_upper_bound(0x02)
   11122                      .dwendtag $C$DW$T$62
   11123              
   11124              
   11125              $C$DW$T$97      .dwtag  DW_TAG_structure_type
   11126                      .dwattr $C$DW$T$97, DW_AT_name("_OSC_Obj_")
TMS320C2000 Assembler PC v6.2.5 Sat Sep 16 15:41:33 2017

Tools Copyright (c) 1996-2014 Texas Instruments Incorporated
C:\Users\wmj\AppData\Local\Temp\1302810                              PAGE  213

   11127                      .dwattr $C$DW$T$97, DW_AT_byte_size(0x03)
   11128              $C$DW$1955      .dwtag  DW_TAG_member
   11129                      .dwattr $C$DW$1955, DW_AT_type(*$C$DW$T$23)
   11130                      .dwattr $C$DW$1955, DW_AT_name("INTOSC1TRIM")
   11131                      .dwattr $C$DW$1955, DW_AT_TI_symbol_name("_INTOSC1TRIM")
   11132                      .dwattr $C$DW$1955, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
   11133                      .dwattr $C$DW$1955, DW_AT_accessibility(DW_ACCESS_public)
   11134              $C$DW$1956      .dwtag  DW_TAG_member
   11135                      .dwattr $C$DW$1956, DW_AT_type(*$C$DW$T$23)
   11136                      .dwattr $C$DW$1956, DW_AT_name("rsvd_1")
   11137                      .dwattr $C$DW$1956, DW_AT_TI_symbol_name("_rsvd_1")
   11138                      .dwattr $C$DW$1956, DW_AT_data_member_location[DW_OP_plus_uconst 0x1]
   11139                      .dwattr $C$DW$1956, DW_AT_accessibility(DW_ACCESS_public)
   11140              $C$DW$1957      .dwtag  DW_TAG_member
   11141                      .dwattr $C$DW$1957, DW_AT_type(*$C$DW$T$23)
   11142                      .dwattr $C$DW$1957, DW_AT_name("INTOSC2TRIM")
   11143                      .dwattr $C$DW$1957, DW_AT_TI_symbol_name("_INTOSC2TRIM")
   11144                      .dwattr $C$DW$1957, DW_AT_data_member_location[DW_OP_plus_uconst 0x2]
   11145                      .dwattr $C$DW$1957, DW_AT_accessibility(DW_ACCESS_public)
   11146                      .dwendtag $C$DW$T$97
   11147              
   11148              $C$DW$T$65      .dwtag  DW_TAG_pointer_type
   11149                      .dwattr $C$DW$T$65, DW_AT_type(*$C$DW$T$97)
   11150                      .dwattr $C$DW$T$65, DW_AT_address_class(0x16)
   11151              $C$DW$T$66      .dwtag  DW_TAG_typedef, DW_AT_name("OSC_Handle")
   11152                      .dwattr $C$DW$T$66, DW_AT_type(*$C$DW$T$65)
   11153                      .dwattr $C$DW$T$66, DW_AT_language(DW_LANG_C)
   11154              
   11155              $C$DW$T$98      .dwtag  DW_TAG_structure_type
   11156                      .dwattr $C$DW$T$98, DW_AT_name("_PIE_IERIFR_t")
   11157                      .dwattr $C$DW$T$98, DW_AT_byte_size(0x02)
   11158              $C$DW$1958      .dwtag  DW_TAG_member
   11159                      .dwattr $C$DW$1958, DW_AT_type(*$C$DW$T$23)
   11160                      .dwattr $C$DW$1958, DW_AT_name("IER")
   11161                      .dwattr $C$DW$1958, DW_AT_TI_symbol_name("_IER")
   11162                      .dwattr $C$DW$1958, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
   11163                      .dwattr $C$DW$1958, DW_AT_accessibility(DW_ACCESS_public)
   11164              $C$DW$1959      .dwtag  DW_TAG_member
   11165                      .dwattr $C$DW$1959, DW_AT_type(*$C$DW$T$23)
   11166                      .dwattr $C$DW$1959, DW_AT_name("IFR")
   11167                      .dwattr $C$DW$1959, DW_AT_TI_symbol_name("_IFR")
   11168                      .dwattr $C$DW$1959, DW_AT_data_member_location[DW_OP_plus_uconst 0x1]
   11169                      .dwattr $C$DW$1959, DW_AT_accessibility(DW_ACCESS_public)
   11170                      .dwendtag $C$DW$T$98
   11171              
   11172              $C$DW$T$99      .dwtag  DW_TAG_typedef, DW_AT_name("PIE_IERIFR_t")
   11173                      .dwattr $C$DW$T$99, DW_AT_type(*$C$DW$T$98)
   11174                      .dwattr $C$DW$T$99, DW_AT_language(DW_LANG_C)
   11175              $C$DW$1960      .dwtag  DW_TAG_TI_far_type
   11176                      .dwattr $C$DW$1960, DW_AT_type(*$C$DW$T$99)
   11177              $C$DW$T$100     .dwtag  DW_TAG_volatile_type
   11178                      .dwattr $C$DW$T$100, DW_AT_type(*$C$DW$1960)
   11179              
   11180              $C$DW$T$101     .dwtag  DW_TAG_array_type
   11181                      .dwattr $C$DW$T$101, DW_AT_type(*$C$DW$T$100)
TMS320C2000 Assembler PC v6.2.5 Sat Sep 16 15:41:33 2017

Tools Copyright (c) 1996-2014 Texas Instruments Incorporated
C:\Users\wmj\AppData\Local\Temp\1302810                              PAGE  214

   11182                      .dwattr $C$DW$T$101, DW_AT_language(DW_LANG_C)
   11183                      .dwattr $C$DW$T$101, DW_AT_byte_size(0x18)
   11184              $C$DW$1961      .dwtag  DW_TAG_subrange_type
   11185                      .dwattr $C$DW$1961, DW_AT_upper_bound(0x0b)
   11186                      .dwendtag $C$DW$T$101
   11187              
   11188              
   11189              $C$DW$T$108     .dwtag  DW_TAG_structure_type
   11190                      .dwattr $C$DW$T$108, DW_AT_name("_PIE_Obj_")
   11191                      .dwattr $C$DW$T$108, DW_AT_byte_size(0x639c)
   11192              $C$DW$1962      .dwtag  DW_TAG_member
   11193                      .dwattr $C$DW$1962, DW_AT_type(*$C$DW$T$23)
   11194                      .dwattr $C$DW$1962, DW_AT_name("PIECTRL")
   11195                      .dwattr $C$DW$1962, DW_AT_TI_symbol_name("_PIECTRL")
   11196                      .dwattr $C$DW$1962, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
   11197                      .dwattr $C$DW$1962, DW_AT_accessibility(DW_ACCESS_public)
   11198              $C$DW$1963      .dwtag  DW_TAG_member
   11199                      .dwattr $C$DW$1963, DW_AT_type(*$C$DW$T$23)
   11200                      .dwattr $C$DW$1963, DW_AT_name("PIEACK")
   11201                      .dwattr $C$DW$1963, DW_AT_TI_symbol_name("_PIEACK")
   11202                      .dwattr $C$DW$1963, DW_AT_data_member_location[DW_OP_plus_uconst 0x1]
   11203                      .dwattr $C$DW$1963, DW_AT_accessibility(DW_ACCESS_public)
   11204              $C$DW$1964      .dwtag  DW_TAG_member
   11205                      .dwattr $C$DW$1964, DW_AT_type(*$C$DW$T$101)
   11206                      .dwattr $C$DW$1964, DW_AT_name("PIEIER_PIEIFR")
   11207                      .dwattr $C$DW$1964, DW_AT_TI_symbol_name("_PIEIER_PIEIFR")
   11208                      .dwattr $C$DW$1964, DW_AT_data_member_location[DW_OP_plus_uconst 0x2]
   11209                      .dwattr $C$DW$1964, DW_AT_accessibility(DW_ACCESS_public)
   11210              $C$DW$1965      .dwtag  DW_TAG_member
   11211                      .dwattr $C$DW$1965, DW_AT_type(*$C$DW$T$102)
   11212                      .dwattr $C$DW$1965, DW_AT_name("rsvd_1")
   11213                      .dwattr $C$DW$1965, DW_AT_TI_symbol_name("_rsvd_1")
   11214                      .dwattr $C$DW$1965, DW_AT_data_member_location[DW_OP_plus_uconst 0x1a]
   11215                      .dwattr $C$DW$1965, DW_AT_accessibility(DW_ACCESS_public)
   11216              $C$DW$1966      .dwtag  DW_TAG_member
   11217                      .dwattr $C$DW$1966, DW_AT_type(*$C$DW$T$106)
   11218                      .dwattr $C$DW$1966, DW_AT_name("Reset")
   11219                      .dwattr $C$DW$1966, DW_AT_TI_symbol_name("_Reset")
   11220                      .dwattr $C$DW$1966, DW_AT_data_member_location[DW_OP_plus_uconst 0x20]
   11221                      .dwattr $C$DW$1966, DW_AT_accessibility(DW_ACCESS_public)
   11222              $C$DW$1967      .dwtag  DW_TAG_member
   11223                      .dwattr $C$DW$1967, DW_AT_type(*$C$DW$T$106)
   11224                      .dwattr $C$DW$1967, DW_AT_name("INT1")
   11225                      .dwattr $C$DW$1967, DW_AT_TI_symbol_name("_INT1")
   11226                      .dwattr $C$DW$1967, DW_AT_data_member_location[DW_OP_plus_uconst 0x22]
   11227                      .dwattr $C$DW$1967, DW_AT_accessibility(DW_ACCESS_public)
   11228              $C$DW$1968      .dwtag  DW_TAG_member
   11229                      .dwattr $C$DW$1968, DW_AT_type(*$C$DW$T$106)
   11230                      .dwattr $C$DW$1968, DW_AT_name("INT2")
   11231                      .dwattr $C$DW$1968, DW_AT_TI_symbol_name("_INT2")
   11232                      .dwattr $C$DW$1968, DW_AT_data_member_location[DW_OP_plus_uconst 0x24]
   11233                      .dwattr $C$DW$1968, DW_AT_accessibility(DW_ACCESS_public)
   11234              $C$DW$1969      .dwtag  DW_TAG_member
   11235                      .dwattr $C$DW$1969, DW_AT_type(*$C$DW$T$106)
   11236                      .dwattr $C$DW$1969, DW_AT_name("INT3")
TMS320C2000 Assembler PC v6.2.5 Sat Sep 16 15:41:33 2017

Tools Copyright (c) 1996-2014 Texas Instruments Incorporated
C:\Users\wmj\AppData\Local\Temp\1302810                              PAGE  215

   11237                      .dwattr $C$DW$1969, DW_AT_TI_symbol_name("_INT3")
   11238                      .dwattr $C$DW$1969, DW_AT_data_member_location[DW_OP_plus_uconst 0x26]
   11239                      .dwattr $C$DW$1969, DW_AT_accessibility(DW_ACCESS_public)
   11240              $C$DW$1970      .dwtag  DW_TAG_member
   11241                      .dwattr $C$DW$1970, DW_AT_type(*$C$DW$T$106)
   11242                      .dwattr $C$DW$1970, DW_AT_name("INT4")
   11243                      .dwattr $C$DW$1970, DW_AT_TI_symbol_name("_INT4")
   11244                      .dwattr $C$DW$1970, DW_AT_data_member_location[DW_OP_plus_uconst 0x28]
   11245                      .dwattr $C$DW$1970, DW_AT_accessibility(DW_ACCESS_public)
   11246              $C$DW$1971      .dwtag  DW_TAG_member
   11247                      .dwattr $C$DW$1971, DW_AT_type(*$C$DW$T$106)
   11248                      .dwattr $C$DW$1971, DW_AT_name("INT5")
   11249                      .dwattr $C$DW$1971, DW_AT_TI_symbol_name("_INT5")
   11250                      .dwattr $C$DW$1971, DW_AT_data_member_location[DW_OP_plus_uconst 0x2a]
   11251                      .dwattr $C$DW$1971, DW_AT_accessibility(DW_ACCESS_public)
   11252              $C$DW$1972      .dwtag  DW_TAG_member
   11253                      .dwattr $C$DW$1972, DW_AT_type(*$C$DW$T$106)
   11254                      .dwattr $C$DW$1972, DW_AT_name("INT6")
   11255                      .dwattr $C$DW$1972, DW_AT_TI_symbol_name("_INT6")
   11256                      .dwattr $C$DW$1972, DW_AT_data_member_location[DW_OP_plus_uconst 0x2c]
   11257                      .dwattr $C$DW$1972, DW_AT_accessibility(DW_ACCESS_public)
   11258              $C$DW$1973      .dwtag  DW_TAG_member
   11259                      .dwattr $C$DW$1973, DW_AT_type(*$C$DW$T$106)
   11260                      .dwattr $C$DW$1973, DW_AT_name("INT7")
   11261                      .dwattr $C$DW$1973, DW_AT_TI_symbol_name("_INT7")
   11262                      .dwattr $C$DW$1973, DW_AT_data_member_location[DW_OP_plus_uconst 0x2e]
   11263                      .dwattr $C$DW$1973, DW_AT_accessibility(DW_ACCESS_public)
   11264              $C$DW$1974      .dwtag  DW_TAG_member
   11265                      .dwattr $C$DW$1974, DW_AT_type(*$C$DW$T$106)
   11266                      .dwattr $C$DW$1974, DW_AT_name("INT8")
   11267                      .dwattr $C$DW$1974, DW_AT_TI_symbol_name("_INT8")
   11268                      .dwattr $C$DW$1974, DW_AT_data_member_location[DW_OP_plus_uconst 0x30]
   11269                      .dwattr $C$DW$1974, DW_AT_accessibility(DW_ACCESS_public)
   11270              $C$DW$1975      .dwtag  DW_TAG_member
   11271                      .dwattr $C$DW$1975, DW_AT_type(*$C$DW$T$106)
   11272                      .dwattr $C$DW$1975, DW_AT_name("INT9")
   11273                      .dwattr $C$DW$1975, DW_AT_TI_symbol_name("_INT9")
   11274                      .dwattr $C$DW$1975, DW_AT_data_member_location[DW_OP_plus_uconst 0x32]
   11275                      .dwattr $C$DW$1975, DW_AT_accessibility(DW_ACCESS_public)
   11276              $C$DW$1976      .dwtag  DW_TAG_member
   11277                      .dwattr $C$DW$1976, DW_AT_type(*$C$DW$T$106)
   11278                      .dwattr $C$DW$1976, DW_AT_name("INT10")
   11279                      .dwattr $C$DW$1976, DW_AT_TI_symbol_name("_INT10")
   11280                      .dwattr $C$DW$1976, DW_AT_data_member_location[DW_OP_plus_uconst 0x34]
   11281                      .dwattr $C$DW$1976, DW_AT_accessibility(DW_ACCESS_public)
