TMS320C2000 Assembler PC v6.2.5 Thu Sep 28 23:35:53 2017

Tools Copyright (c) 1996-2014 Texas Instruments Incorporated
C:\Users\wmj\AppData\Local\Temp\0974411                              PAGE    1

       1              ;***************************************************************
       2              ;* TMS320C2000 C/C++ Codegen                         PC v6.2.5 *
       3              ;* Date/Time created: Thu Sep 28 23:35:53 2017                 *
       4              ;***************************************************************
       5                      .compiler_opts --float_support=softlib --hll_source=on --mem_model:code=flat --mem_model:data=large -
       6        0002  FP      .set    XAR2
       7              
       8              $C$DW$CU        .dwtag  DW_TAG_compile_unit
       9                      .dwattr $C$DW$CU, DW_AT_name("D:/BM1000/sw/drivers/drvic/pca9555.c")
      10                      .dwattr $C$DW$CU, DW_AT_producer("TMS320C2000 C/C++ Codegen PC v6.2.5 Copyright (c) 1996-2014 Texas I
      11                      .dwattr $C$DW$CU, DW_AT_TI_version(0x01)
      12                      .dwattr $C$DW$CU, DW_AT_comp_dir("D:\BM1000\sw\solutions\instaspin_foc\boards\hvkit_rev1p1\f28x\f2802
      13              
      14              $C$DW$1 .dwtag  DW_TAG_subprogram, DW_AT_name("I2C_MasterControl")
      15                      .dwattr $C$DW$1, DW_AT_TI_symbol_name("_I2C_MasterControl")

    1177              $C$DW$133       .dwtag  DW_TAG_enumerator, DW_AT_name("I2C_Status_Stop"), DW_AT_const_value(0x20)
    1178              $C$DW$134       .dwtag  DW_TAG_enumerator, DW_AT_name("I2C_Status_AD0"), DW_AT_const_value(0x100)
    1179              $C$DW$135       .dwtag  DW_TAG_enumerator, DW_AT_name("I2C_Status_Slave_Addr"), DW_AT_const_value(0x200)
    1180              $C$DW$136       .dwtag  DW_TAG_enumerator, DW_AT_name("I2C_Status_Tx_Empty"), DW_AT_const_value(0x400)
    1181              $C$DW$137       .dwtag  DW_TAG_enumerator, DW_AT_name("I2C_Status_Rx_Full"), DW_AT_const_value(0x800)
    1182              $C$DW$138       .dwtag  DW_TAG_enumerator, DW_AT_name("I2C_Status_Busy"), DW_AT_const_value(0x1000)
    1183              $C$DW$139       .dwtag  DW_TAG_enumerator, DW_AT_name("I2C_Status_NACK_Sent"), DW_AT_const_value(0x2000)
    1184              $C$DW$140       .dwtag  DW_TAG_enumerator, DW_AT_name("I2C_Status_Slave_Dir"), DW_AT_const_value(0x4000)
    1185                      .dwendtag $C$DW$T$32
    1186              
    1187              $C$DW$T$33      .dwtag  DW_TAG_typedef, DW_AT_name("I2C_Status_e")
    1188                      .dwattr $C$DW$T$33, DW_AT_type(*$C$DW$T$32)
    1189                      .dwattr $C$DW$T$33, DW_AT_language(DW_LANG_C)
    1190              
    1191              $C$DW$T$37      .dwtag  DW_TAG_enumeration_type
    1192                      .dwattr $C$DW$T$37, DW_AT_byte_size(0x01)
    1193              $C$DW$141       .dwtag  DW_TAG_enumerator, DW_AT_name("PCA955x_RegName_Port0_IN"), DW_AT_const_value(0x00)
    1194              $C$DW$142       .dwtag  DW_TAG_enumerator, DW_AT_name("PCA955x_RegName_Port1_IN"), DW_AT_const_value(0x01)
    1195              $C$DW$143       .dwtag  DW_TAG_enumerator, DW_AT_name("PCA955x_RegName_Port0_OUT"), DW_AT_const_value(0x02)
    1196              $C$DW$144       .dwtag  DW_TAG_enumerator, DW_AT_name("PCA955x_RegName_Port1_OUT"), DW_AT_const_value(0x03)
    1197              $C$DW$145       .dwtag  DW_TAG_enumerator, DW_AT_name("PCA955x_RegName_Port0_PolarInv"), DW_AT_const_value(0x
    1198              $C$DW$146       .dwtag  DW_TAG_enumerator, DW_AT_name("PCA955x_RegName_Port1_PolarInv"), DW_AT_const_value(0x
    1199              $C$DW$147       .dwtag  DW_TAG_enumerator, DW_AT_name("PCA955x_RegName_Port0_Config"), DW_AT_const_value(0x06
    1200              $C$DW$148       .dwtag  DW_TAG_enumerator, DW_AT_name("PCA955x_RegName_Port1_Config"), DW_AT_const_value(0x07
    1201                      .dwendtag $C$DW$T$37
    1202              
    1203              $C$DW$T$38      .dwtag  DW_TAG_typedef, DW_AT_name("PCA955x_RegName_e")
    1204                      .dwattr $C$DW$T$38, DW_AT_type(*$C$DW$T$37)
    1205                      .dwattr $C$DW$T$38, DW_AT_language(DW_LANG_C)
TMS320C2000 Assembler PC v6.2.5 Thu Sep 28 23:35:53 2017

Tools Copyright (c) 1996-2014 Texas Instruments Incorporated
C:\Users\wmj\AppData\Local\Temp\0974411                              PAGE   24

    1206              $C$DW$149       .dwtag  DW_TAG_TI_far_type
    1207                      .dwattr $C$DW$149, DW_AT_type(*$C$DW$T$38)
    1208              $C$DW$T$39      .dwtag  DW_TAG_const_type
    1209                      .dwattr $C$DW$T$39, DW_AT_type(*$C$DW$149)
    1210              $C$DW$150       .dwtag  DW_TAG_TI_far_type
    1211                      .dwattr $C$DW$150, DW_AT_type(*$C$DW$T$38)
    1212              $C$DW$T$40      .dwtag  DW_TAG_const_type
    1213                      .dwattr $C$DW$T$40, DW_AT_type(*$C$DW$150)
    1214              
    1215              $C$DW$T$41      .dwtag  DW_TAG_enumeration_type
    1216                      .dwattr $C$DW$T$41, DW_AT_byte_size(0x01)
    1217              $C$DW$151       .dwtag  DW_TAG_enumerator, DW_AT_name("PCA955x_PortNum_Port0"), DW_AT_const_value(0x00)
    1218              $C$DW$152       .dwtag  DW_TAG_enumerator, DW_AT_name("PCA955x_PortNum_Port1"), DW_AT_const_value(0x01)
    1219                      .dwendtag $C$DW$T$41
    1220              
    1221              $C$DW$T$42      .dwtag  DW_TAG_typedef, DW_AT_name("PCA955x_PortNum_e")
    1222                      .dwattr $C$DW$T$42, DW_AT_type(*$C$DW$T$41)
    1223                      .dwattr $C$DW$T$42, DW_AT_language(DW_LANG_C)
    1224              $C$DW$153       .dwtag  DW_TAG_TI_far_type
    1225                      .dwattr $C$DW$153, DW_AT_type(*$C$DW$T$42)
    1226              $C$DW$T$43      .dwtag  DW_TAG_const_type
    1227                      .dwattr $C$DW$T$43, DW_AT_type(*$C$DW$153)
    1228              $C$DW$154       .dwtag  DW_TAG_TI_far_type
    1229                      .dwattr $C$DW$154, DW_AT_type(*$C$DW$T$42)
    1230              $C$DW$T$44      .dwtag  DW_TAG_const_type
    1231                      .dwattr $C$DW$T$44, DW_AT_type(*$C$DW$154)
    1232              $C$DW$155       .dwtag  DW_TAG_TI_far_type
    1233                      .dwattr $C$DW$155, DW_AT_type(*$C$DW$T$42)
    1234              $C$DW$T$45      .dwtag  DW_TAG_const_type
    1235                      .dwattr $C$DW$T$45, DW_AT_type(*$C$DW$155)
    1236              $C$DW$156       .dwtag  DW_TAG_TI_far_type
    1237                      .dwattr $C$DW$156, DW_AT_type(*$C$DW$T$42)
    1238              $C$DW$T$46      .dwtag  DW_TAG_const_type
    1239                      .dwattr $C$DW$T$46, DW_AT_type(*$C$DW$156)
    1240              
    1241              $C$DW$T$22      .dwtag  DW_TAG_union_type
    1242                      .dwattr $C$DW$T$22, DW_AT_byte_size(0x01)
    1243              $C$DW$157       .dwtag  DW_TAG_member
    1244                      .dwattr $C$DW$157, DW_AT_type(*$C$DW$T$20)
    1245                      .dwattr $C$DW$157, DW_AT_name("Port_Data_all")
    1246                      .dwattr $C$DW$157, DW_AT_TI_symbol_name("_Port_Data_all")
    1247                      .dwattr $C$DW$157, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    1248                      .dwattr $C$DW$157, DW_AT_accessibility(DW_ACCESS_public)
    1249              $C$DW$158       .dwtag  DW_TAG_member
    1250                      .dwattr $C$DW$158, DW_AT_type(*$C$DW$T$21)
    1251                      .dwattr $C$DW$158, DW_AT_name("Port_Data_bit")
    1252                      .dwattr $C$DW$158, DW_AT_TI_symbol_name("_Port_Data_bit")
    1253                      .dwattr $C$DW$158, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    1254                      .dwattr $C$DW$158, DW_AT_accessibility(DW_ACCESS_public)
    1255                      .dwendtag $C$DW$T$22
    1256              
    1257              $C$DW$159       .dwtag  DW_TAG_TI_far_type
    1258                      .dwattr $C$DW$159, DW_AT_type(*$C$DW$T$22)
    1259              $C$DW$T$47      .dwtag  DW_TAG_const_type
    1260                      .dwattr $C$DW$T$47, DW_AT_type(*$C$DW$159)
TMS320C2000 Assembler PC v6.2.5 Thu Sep 28 23:35:53 2017

Tools Copyright (c) 1996-2014 Texas Instruments Incorporated
C:\Users\wmj\AppData\Local\Temp\0974411                              PAGE   25

    1261              
    1262              $C$DW$T$19      .dwtag  DW_TAG_structure_type
    1263                      .dwattr $C$DW$T$19, DW_AT_name("I2C_Obj")
    1264                      .dwattr $C$DW$T$19, DW_AT_declaration
    1265                      .dwendtag $C$DW$T$19
    1266              
    1267              $C$DW$T$23      .dwtag  DW_TAG_pointer_type
    1268                      .dwattr $C$DW$T$23, DW_AT_type(*$C$DW$T$19)
    1269                      .dwattr $C$DW$T$23, DW_AT_address_class(0x16)
    1270              $C$DW$T$24      .dwtag  DW_TAG_typedef, DW_AT_name("I2C_Handle")
    1271                      .dwattr $C$DW$T$24, DW_AT_type(*$C$DW$T$23)
    1272                      .dwattr $C$DW$T$24, DW_AT_language(DW_LANG_C)
    1273              $C$DW$160       .dwtag  DW_TAG_TI_far_type
    1274                      .dwattr $C$DW$160, DW_AT_type(*$C$DW$T$24)
    1275              $C$DW$T$48      .dwtag  DW_TAG_const_type
    1276                      .dwattr $C$DW$T$48, DW_AT_type(*$C$DW$160)
    1277              
    1278              $C$DW$T$26      .dwtag  DW_TAG_structure_type
    1279                      .dwattr $C$DW$T$26, DW_AT_name("_PCA955x_Obj_")
    1280                      .dwattr $C$DW$T$26, DW_AT_byte_size(0x06)
    1281              $C$DW$161       .dwtag  DW_TAG_member
    1282                      .dwattr $C$DW$161, DW_AT_type(*$C$DW$T$24)
    1283                      .dwattr $C$DW$161, DW_AT_name("i2cHandle")
    1284                      .dwattr $C$DW$161, DW_AT_TI_symbol_name("_i2cHandle")
    1285                      .dwattr $C$DW$161, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    1286                      .dwattr $C$DW$161, DW_AT_accessibility(DW_ACCESS_public)
    1287              $C$DW$162       .dwtag  DW_TAG_member
    1288                      .dwattr $C$DW$162, DW_AT_type(*$C$DW$T$21)
    1289                      .dwattr $C$DW$162, DW_AT_name("PortData")
    1290                      .dwattr $C$DW$162, DW_AT_TI_symbol_name("_PortData")
    1291                      .dwattr $C$DW$162, DW_AT_data_member_location[DW_OP_plus_uconst 0x2]
    1292                      .dwattr $C$DW$162, DW_AT_accessibility(DW_ACCESS_public)
    1293              $C$DW$163       .dwtag  DW_TAG_member
    1294                      .dwattr $C$DW$163, DW_AT_type(*$C$DW$T$25)
    1295                      .dwattr $C$DW$163, DW_AT_name("RxTimeOut")
    1296                      .dwattr $C$DW$163, DW_AT_TI_symbol_name("_RxTimeOut")
    1297                      .dwattr $C$DW$163, DW_AT_data_member_location[DW_OP_plus_uconst 0x3]
    1298                      .dwattr $C$DW$163, DW_AT_accessibility(DW_ACCESS_public)
    1299              $C$DW$164       .dwtag  DW_TAG_member
    1300                      .dwattr $C$DW$164, DW_AT_type(*$C$DW$T$25)
    1301                      .dwattr $C$DW$164, DW_AT_name("TxTimeOut")
    1302                      .dwattr $C$DW$164, DW_AT_TI_symbol_name("_TxTimeOut")
    1303                      .dwattr $C$DW$164, DW_AT_data_member_location[DW_OP_plus_uconst 0x4]
    1304                      .dwattr $C$DW$164, DW_AT_accessibility(DW_ACCESS_public)
    1305                      .dwendtag $C$DW$T$26
    1306              
    1307              $C$DW$T$50      .dwtag  DW_TAG_typedef, DW_AT_name("PCA955x_Obj")
    1308                      .dwattr $C$DW$T$50, DW_AT_type(*$C$DW$T$26)
    1309                      .dwattr $C$DW$T$50, DW_AT_language(DW_LANG_C)
    1310              $C$DW$T$51      .dwtag  DW_TAG_pointer_type
    1311                      .dwattr $C$DW$T$51, DW_AT_type(*$C$DW$T$26)
    1312                      .dwattr $C$DW$T$51, DW_AT_address_class(0x16)
    1313              $C$DW$T$52      .dwtag  DW_TAG_typedef, DW_AT_name("PCA955x_Handle")
    1314                      .dwattr $C$DW$T$52, DW_AT_type(*$C$DW$T$51)
    1315                      .dwattr $C$DW$T$52, DW_AT_language(DW_LANG_C)
TMS320C2000 Assembler PC v6.2.5 Thu Sep 28 23:35:53 2017

Tools Copyright (c) 1996-2014 Texas Instruments Incorporated
C:\Users\wmj\AppData\Local\Temp\0974411                              PAGE   26

    1316              $C$DW$165       .dwtag  DW_TAG_TI_far_type
    1317                      .dwattr $C$DW$165, DW_AT_type(*$C$DW$T$52)
    1318              $C$DW$T$53      .dwtag  DW_TAG_const_type
    1319                      .dwattr $C$DW$T$53, DW_AT_type(*$C$DW$165)
    1320              
    1321              $C$DW$T$27      .dwtag  DW_TAG_structure_type
    1322                      .dwattr $C$DW$T$27, DW_AT_name("_PORT_DATA_t_")
    1323                      .dwattr $C$DW$T$27, DW_AT_byte_size(0x01)
    1324              $C$DW$166       .dwtag  DW_TAG_member
    1325                      .dwattr $C$DW$166, DW_AT_type(*$C$DW$T$20)
    1326                      .dwattr $C$DW$166, DW_AT_name("PORT1_IGBT_OC")
    1327                      .dwattr $C$DW$166, DW_AT_TI_symbol_name("_PORT1_IGBT_OC")
    1328                      .dwattr $C$DW$166, DW_AT_bit_offset(0x0f), DW_AT_bit_size(0x01)
    1329                      .dwattr $C$DW$166, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    1330                      .dwattr $C$DW$166, DW_AT_accessibility(DW_ACCESS_public)
    1331              $C$DW$167       .dwtag  DW_TAG_member
    1332                      .dwattr $C$DW$167, DW_AT_type(*$C$DW$T$20)
    1333                      .dwattr $C$DW$167, DW_AT_name("PORT1_IKCM_UV")
    1334                      .dwattr $C$DW$167, DW_AT_TI_symbol_name("_PORT1_IKCM_UV")
    1335                      .dwattr $C$DW$167, DW_AT_bit_offset(0x0e), DW_AT_bit_size(0x01)
    1336                      .dwattr $C$DW$167, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    1337                      .dwattr $C$DW$167, DW_AT_accessibility(DW_ACCESS_public)
    1338              $C$DW$168       .dwtag  DW_TAG_member
    1339                      .dwattr $C$DW$168, DW_AT_type(*$C$DW$T$20)
    1340                      .dwattr $C$DW$168, DW_AT_name("PORT1_RELAY_ON")
    1341                      .dwattr $C$DW$168, DW_AT_TI_symbol_name("_PORT1_RELAY_ON")
    1342                      .dwattr $C$DW$168, DW_AT_bit_offset(0x0d), DW_AT_bit_size(0x01)
    1343                      .dwattr $C$DW$168, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    1344                      .dwattr $C$DW$168, DW_AT_accessibility(DW_ACCESS_public)
    1345              $C$DW$169       .dwtag  DW_TAG_member
    1346                      .dwattr $C$DW$169, DW_AT_type(*$C$DW$T$20)
    1347                      .dwattr $C$DW$169, DW_AT_name("PORT1_Resv")
    1348                      .dwattr $C$DW$169, DW_AT_TI_symbol_name("_PORT1_Resv")
    1349                      .dwattr $C$DW$169, DW_AT_bit_offset(0x0b), DW_AT_bit_size(0x02)
    1350                      .dwattr $C$DW$169, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    1351                      .dwattr $C$DW$169, DW_AT_accessibility(DW_ACCESS_public)
    1352              $C$DW$170       .dwtag  DW_TAG_member
    1353                      .dwattr $C$DW$170, DW_AT_type(*$C$DW$T$20)
    1354                      .dwattr $C$DW$170, DW_AT_name("PORT1_EMERG_STP")
    1355                      .dwattr $C$DW$170, DW_AT_TI_symbol_name("_PORT1_EMERG_STP")
    1356                      .dwattr $C$DW$170, DW_AT_bit_offset(0x0a), DW_AT_bit_size(0x01)
    1357                      .dwattr $C$DW$170, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    1358                      .dwattr $C$DW$170, DW_AT_accessibility(DW_ACCESS_public)
    1359              $C$DW$171       .dwtag  DW_TAG_member
    1360                      .dwattr $C$DW$171, DW_AT_type(*$C$DW$T$20)
    1361                      .dwattr $C$DW$171, DW_AT_name("PORT1_SENSOR0")
    1362                      .dwattr $C$DW$171, DW_AT_TI_symbol_name("_PORT1_SENSOR0")
    1363                      .dwattr $C$DW$171, DW_AT_bit_offset(0x09), DW_AT_bit_size(0x01)
    1364                      .dwattr $C$DW$171, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    1365                      .dwattr $C$DW$171, DW_AT_accessibility(DW_ACCESS_public)
    1366              $C$DW$172       .dwtag  DW_TAG_member
    1367                      .dwattr $C$DW$172, DW_AT_type(*$C$DW$T$20)
    1368                      .dwattr $C$DW$172, DW_AT_name("PORT1_SENSOR1")
    1369                      .dwattr $C$DW$172, DW_AT_TI_symbol_name("_PORT1_SENSOR1")
    1370                      .dwattr $C$DW$172, DW_AT_bit_offset(0x08), DW_AT_bit_size(0x01)
TMS320C2000 Assembler PC v6.2.5 Thu Sep 28 23:35:53 2017

Tools Copyright (c) 1996-2014 Texas Instruments Incorporated
C:\Users\wmj\AppData\Local\Temp\0974411                              PAGE   27

    1371                      .dwattr $C$DW$172, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    1372                      .dwattr $C$DW$172, DW_AT_accessibility(DW_ACCESS_public)
    1373              $C$DW$173       .dwtag  DW_TAG_member
    1374                      .dwattr $C$DW$173, DW_AT_type(*$C$DW$T$20)
    1375                      .dwattr $C$DW$173, DW_AT_name("PORT0_SD")
    1376                      .dwattr $C$DW$173, DW_AT_TI_symbol_name("_PORT0_SD")
    1377                      .dwattr $C$DW$173, DW_AT_bit_offset(0x07), DW_AT_bit_size(0x01)
    1378                      .dwattr $C$DW$173, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    1379                      .dwattr $C$DW$173, DW_AT_accessibility(DW_ACCESS_public)
    1380              $C$DW$174       .dwtag  DW_TAG_member
    1381                      .dwattr $C$DW$174, DW_AT_type(*$C$DW$T$20)
    1382                      .dwattr $C$DW$174, DW_AT_name("PORT0_RELAY_OPEN")
    1383                      .dwattr $C$DW$174, DW_AT_TI_symbol_name("_PORT0_RELAY_OPEN")
    1384                      .dwattr $C$DW$174, DW_AT_bit_offset(0x06), DW_AT_bit_size(0x01)
    1385                      .dwattr $C$DW$174, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    1386                      .dwattr $C$DW$174, DW_AT_accessibility(DW_ACCESS_public)
    1387              $C$DW$175       .dwtag  DW_TAG_member
    1388                      .dwattr $C$DW$175, DW_AT_type(*$C$DW$T$20)
    1389                      .dwattr $C$DW$175, DW_AT_name("PORT0_CLR_OC")
    1390                      .dwattr $C$DW$175, DW_AT_TI_symbol_name("_PORT0_CLR_OC")
    1391                      .dwattr $C$DW$175, DW_AT_bit_offset(0x05), DW_AT_bit_size(0x01)
    1392                      .dwattr $C$DW$175, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    1393                      .dwattr $C$DW$175, DW_AT_accessibility(DW_ACCESS_public)
    1394              $C$DW$176       .dwtag  DW_TAG_member
    1395                      .dwattr $C$DW$176, DW_AT_type(*$C$DW$T$20)
    1396                      .dwattr $C$DW$176, DW_AT_name("PORT0_CPLD_RST")
    1397                      .dwattr $C$DW$176, DW_AT_TI_symbol_name("_PORT0_CPLD_RST")
    1398                      .dwattr $C$DW$176, DW_AT_bit_offset(0x04), DW_AT_bit_size(0x01)
    1399                      .dwattr $C$DW$176, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    1400                      .dwattr $C$DW$176, DW_AT_accessibility(DW_ACCESS_public)
    1401              $C$DW$177       .dwtag  DW_TAG_member
    1402                      .dwattr $C$DW$177, DW_AT_type(*$C$DW$T$20)
    1403                      .dwattr $C$DW$177, DW_AT_name("PORT0_LEDR")
    1404                      .dwattr $C$DW$177, DW_AT_TI_symbol_name("_PORT0_LEDR")
    1405                      .dwattr $C$DW$177, DW_AT_bit_offset(0x03), DW_AT_bit_size(0x01)
    1406                      .dwattr $C$DW$177, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    1407                      .dwattr $C$DW$177, DW_AT_accessibility(DW_ACCESS_public)
    1408              $C$DW$178       .dwtag  DW_TAG_member
    1409                      .dwattr $C$DW$178, DW_AT_type(*$C$DW$T$20)
    1410                      .dwattr $C$DW$178, DW_AT_name("PORT0_LEDY")
    1411                      .dwattr $C$DW$178, DW_AT_TI_symbol_name("_PORT0_LEDY")
    1412                      .dwattr $C$DW$178, DW_AT_bit_offset(0x02), DW_AT_bit_size(0x01)
    1413                      .dwattr $C$DW$178, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    1414                      .dwattr $C$DW$178, DW_AT_accessibility(DW_ACCESS_public)
    1415              $C$DW$179       .dwtag  DW_TAG_member
    1416                      .dwattr $C$DW$179, DW_AT_type(*$C$DW$T$20)
    1417                      .dwattr $C$DW$179, DW_AT_name("PORT0_LEDG")
    1418                      .dwattr $C$DW$179, DW_AT_TI_symbol_name("_PORT0_LEDG")
    1419                      .dwattr $C$DW$179, DW_AT_bit_offset(0x01), DW_AT_bit_size(0x01)
    1420                      .dwattr $C$DW$179, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    1421                      .dwattr $C$DW$179, DW_AT_accessibility(DW_ACCESS_public)
    1422              $C$DW$180       .dwtag  DW_TAG_member
    1423                      .dwattr $C$DW$180, DW_AT_type(*$C$DW$T$20)
    1424                      .dwattr $C$DW$180, DW_AT_name("PORT0_LEDB")
    1425                      .dwattr $C$DW$180, DW_AT_TI_symbol_name("_PORT0_LEDB")
TMS320C2000 Assembler PC v6.2.5 Thu Sep 28 23:35:53 2017

Tools Copyright (c) 1996-2014 Texas Instruments Incorporated
C:\Users\wmj\AppData\Local\Temp\0974411                              PAGE   28

    1426                      .dwattr $C$DW$180, DW_AT_bit_offset(0x00), DW_AT_bit_size(0x01)
    1427                      .dwattr $C$DW$180, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    1428                      .dwattr $C$DW$180, DW_AT_accessibility(DW_ACCESS_public)
    1429                      .dwendtag $C$DW$T$27
    1430              
    1431              $C$DW$T$21      .dwtag  DW_TAG_typedef, DW_AT_name("PORT_DATA_t")
    1432                      .dwattr $C$DW$T$21, DW_AT_type(*$C$DW$T$27)
    1433                      .dwattr $C$DW$T$21, DW_AT_language(DW_LANG_C)
    1434              $C$DW$T$3       .dwtag  DW_TAG_pointer_type
    1435                      .dwattr $C$DW$T$3, DW_AT_address_class(0x16)
    1436              $C$DW$181       .dwtag  DW_TAG_TI_far_type
    1437                      .dwattr $C$DW$181, DW_AT_type(*$C$DW$T$3)
    1438              $C$DW$T$59      .dwtag  DW_TAG_const_type
    1439                      .dwattr $C$DW$T$59, DW_AT_type(*$C$DW$181)
    1440              $C$DW$T$4       .dwtag  DW_TAG_base_type
    1441                      .dwattr $C$DW$T$4, DW_AT_encoding(DW_ATE_boolean)
    1442                      .dwattr $C$DW$T$4, DW_AT_name("bool")
    1443                      .dwattr $C$DW$T$4, DW_AT_byte_size(0x01)
    1444              $C$DW$T$5       .dwtag  DW_TAG_base_type
    1445                      .dwattr $C$DW$T$5, DW_AT_encoding(DW_ATE_signed_char)
    1446                      .dwattr $C$DW$T$5, DW_AT_name("signed char")
    1447                      .dwattr $C$DW$T$5, DW_AT_byte_size(0x01)
    1448              $C$DW$T$6       .dwtag  DW_TAG_base_type
    1449                      .dwattr $C$DW$T$6, DW_AT_encoding(DW_ATE_unsigned_char)
    1450                      .dwattr $C$DW$T$6, DW_AT_name("unsigned char")
    1451                      .dwattr $C$DW$T$6, DW_AT_byte_size(0x01)
    1452              $C$DW$T$25      .dwtag  DW_TAG_typedef, DW_AT_name("_Bool")
    1453                      .dwattr $C$DW$T$25, DW_AT_type(*$C$DW$T$6)
    1454                      .dwattr $C$DW$T$25, DW_AT_language(DW_LANG_C)
    1455              $C$DW$T$7       .dwtag  DW_TAG_base_type
    1456                      .dwattr $C$DW$T$7, DW_AT_encoding(DW_ATE_signed_char)
    1457                      .dwattr $C$DW$T$7, DW_AT_name("wchar_t")
    1458                      .dwattr $C$DW$T$7, DW_AT_byte_size(0x01)
    1459              $C$DW$T$8       .dwtag  DW_TAG_base_type
    1460                      .dwattr $C$DW$T$8, DW_AT_encoding(DW_ATE_signed)
    1461                      .dwattr $C$DW$T$8, DW_AT_name("short")
    1462                      .dwattr $C$DW$T$8, DW_AT_byte_size(0x01)
    1463              $C$DW$T$9       .dwtag  DW_TAG_base_type
    1464                      .dwattr $C$DW$T$9, DW_AT_encoding(DW_ATE_unsigned)
    1465                      .dwattr $C$DW$T$9, DW_AT_name("unsigned short")
    1466                      .dwattr $C$DW$T$9, DW_AT_byte_size(0x01)
    1467              $C$DW$T$20      .dwtag  DW_TAG_typedef, DW_AT_name("uint16_t")
    1468                      .dwattr $C$DW$T$20, DW_AT_type(*$C$DW$T$9)
    1469                      .dwattr $C$DW$T$20, DW_AT_language(DW_LANG_C)
    1470              $C$DW$182       .dwtag  DW_TAG_TI_far_type
    1471                      .dwattr $C$DW$182, DW_AT_type(*$C$DW$T$20)
    1472              $C$DW$T$66      .dwtag  DW_TAG_const_type
    1473                      .dwattr $C$DW$T$66, DW_AT_type(*$C$DW$182)
    1474              $C$DW$183       .dwtag  DW_TAG_TI_far_type
    1475                      .dwattr $C$DW$183, DW_AT_type(*$C$DW$T$20)
    1476              $C$DW$T$79      .dwtag  DW_TAG_volatile_type
    1477                      .dwattr $C$DW$T$79, DW_AT_type(*$C$DW$183)
    1478              $C$DW$T$10      .dwtag  DW_TAG_base_type
    1479                      .dwattr $C$DW$T$10, DW_AT_encoding(DW_ATE_signed)
    1480                      .dwattr $C$DW$T$10, DW_AT_name("int")
TMS320C2000 Assembler PC v6.2.5 Thu Sep 28 23:35:53 2017

