TMS320C2000 Assembler PC v6.2.5 Tue Aug 29 10:13:49 2017

Tools Copyright (c) 1996-2014 Texas Instruments Incorporated
C:\Users\wmj\AppData\Local\Temp\0884811                              PAGE    1

       1              ;***************************************************************
       2              ;* TMS320C2000 C/C++ Codegen                         PC v6.2.5 *
       3              ;* Date/Time created: Tue Aug 29 10:13:49 2017                 *
       4              ;***************************************************************
       5                      .compiler_opts --float_support=softlib --hll_source=on --mem_model:code=flat --mem_model:data=large -
       6        0002  FP      .set    XAR2
       7              
       8              $C$DW$CU        .dwtag  DW_TAG_compile_unit
       9                      .dwattr $C$DW$CU, DW_AT_name("D:/FOC_27/sw/drivers/drvic/process_ctrl.c")
      10                      .dwattr $C$DW$CU, DW_AT_producer("TMS320C2000 C/C++ Codegen PC v6.2.5 Copyright (c) 1996-2014 Texas I
      11                      .dwattr $C$DW$CU, DW_AT_TI_version(0x01)
      12                      .dwattr $C$DW$CU, DW_AT_comp_dir("D:\FOC_27\sw\solutions\instaspin_foc\boards\hvkit_rev1p1\f28x\f2802
      13              
      14              $C$DW$1 .dwtag  DW_TAG_subprogram, DW_AT_name("PCA955x_WriteCommand")
      15                      .dwattr $C$DW$1, DW_AT_TI_symbol_name("_PCA955x_WriteCommand")

     467              $C$DW$97        .dwtag  DW_TAG_enumerator, DW_AT_name("OLED_DATA"), DW_AT_const_value(0x01)
     468                      .dwendtag $C$DW$T$144
     469              
     470              $C$DW$T$145     .dwtag  DW_TAG_typedef, DW_AT_name("OLED_TxType_e")
     471                      .dwattr $C$DW$T$145, DW_AT_type(*$C$DW$T$144)
     472                      .dwattr $C$DW$T$145, DW_AT_language(DW_LANG_C)
     473              
     474              $C$DW$T$182     .dwtag  DW_TAG_enumeration_type
     475                      .dwattr $C$DW$T$182, DW_AT_byte_size(0x01)
     476              $C$DW$98        .dwtag  DW_TAG_enumerator, DW_AT_name("PROCTRL_State_IDLE"), DW_AT_const_value(0x00)
     477              $C$DW$99        .dwtag  DW_TAG_enumerator, DW_AT_name("PROCTRL_State_EditLow"), DW_AT_const_value(0x01)
     478              $C$DW$100       .dwtag  DW_TAG_enumerator, DW_AT_name("PROCTRL_State_EditHigh"), DW_AT_const_value(0x02)
     479              $C$DW$101       .dwtag  DW_TAG_enumerator, DW_AT_name("PROCTRL_State_EditReturn"), DW_AT_const_value(0x03)
     480              $C$DW$102       .dwtag  DW_TAG_enumerator, DW_AT_name("PROCTRL_State_NormalLow"), DW_AT_const_value(0x04)
     481              $C$DW$103       .dwtag  DW_TAG_enumerator, DW_AT_name("PROCTRL_State_NormHiSped"), DW_AT_const_value(0x05)
     482              $C$DW$104       .dwtag  DW_TAG_enumerator, DW_AT_name("PROCTRL_State_NormDecle"), DW_AT_const_value(0x06)
     483              $C$DW$105       .dwtag  DW_TAG_enumerator, DW_AT_name("PROCTRL_State_NormDecle1"), DW_AT_const_value(0x07)
     484              $C$DW$106       .dwtag  DW_TAG_enumerator, DW_AT_name("PROCTRL_State_NormSlow"), DW_AT_const_value(0x08)
     485              $C$DW$107       .dwtag  DW_TAG_enumerator, DW_AT_name("PROCTRL_State_NormAccele"), DW_AT_const_value(0x09)
     486              $C$DW$108       .dwtag  DW_TAG_enumerator, DW_AT_name("PROCTRL_State_NormSate"), DW_AT_const_value(0x0a)
TMS320C2000 Assembler PC v6.2.5 Tue Aug 29 10:13:49 2017

Tools Copyright (c) 1996-2014 Texas Instruments Incorporated
C:\Users\wmj\AppData\Local\Temp\0884811                              PAGE   10

     487              $C$DW$109       .dwtag  DW_TAG_enumerator, DW_AT_name("PROCTRL_State_NormReturn"), DW_AT_const_value(0x0b)
     488              $C$DW$110       .dwtag  DW_TAG_enumerator, DW_AT_name("PROCTRL_State_NormSlow2"), DW_AT_const_value(0x0c)
     489              $C$DW$111       .dwtag  DW_TAG_enumerator, DW_AT_name("PROCTRL_State_NormStop"), DW_AT_const_value(0x0d)
     490              $C$DW$112       .dwtag  DW_TAG_enumerator, DW_AT_name("PROCTRL_State_NormRegulate"), DW_AT_const_value(0x0e)
     491              $C$DW$113       .dwtag  DW_TAG_enumerator, DW_AT_name("PROCTRL_State_ReturnStop"), DW_AT_const_value(0x0f)
     492                      .dwendtag $C$DW$T$182
     493              
     494              $C$DW$T$183     .dwtag  DW_TAG_typedef, DW_AT_name("PROCTRL_State_e")
     495                      .dwattr $C$DW$T$183, DW_AT_type(*$C$DW$T$182)
     496                      .dwattr $C$DW$T$183, DW_AT_language(DW_LANG_C)
     497              
     498              $C$DW$T$195     .dwtag  DW_TAG_enumeration_type
     499                      .dwattr $C$DW$T$195, DW_AT_byte_size(0x01)
     500              $C$DW$114       .dwtag  DW_TAG_enumerator, DW_AT_name("PCA955x_PortNum_Port0"), DW_AT_const_value(0x00)
     501              $C$DW$115       .dwtag  DW_TAG_enumerator, DW_AT_name("PCA955x_PortNum_Port1"), DW_AT_const_value(0x01)
     502                      .dwendtag $C$DW$T$195
     503              
     504              $C$DW$T$196     .dwtag  DW_TAG_typedef, DW_AT_name("PCA955x_PortNum_e")
     505                      .dwattr $C$DW$T$196, DW_AT_type(*$C$DW$T$195)
     506                      .dwattr $C$DW$T$196, DW_AT_language(DW_LANG_C)
     507              
     508              $C$DW$T$19      .dwtag  DW_TAG_structure_type
     509                      .dwattr $C$DW$T$19, DW_AT_name("I2C_Obj")
     510                      .dwattr $C$DW$T$19, DW_AT_declaration
     511                      .dwendtag $C$DW$T$19
     512              
     513              $C$DW$T$93      .dwtag  DW_TAG_pointer_type
     514                      .dwattr $C$DW$T$93, DW_AT_type(*$C$DW$T$19)
     515                      .dwattr $C$DW$T$93, DW_AT_address_class(0x16)
     516              $C$DW$T$94      .dwtag  DW_TAG_typedef, DW_AT_name("I2C_Handle")
     517                      .dwattr $C$DW$T$94, DW_AT_type(*$C$DW$T$93)
     518                      .dwattr $C$DW$T$94, DW_AT_language(DW_LANG_C)
     519              
     520              $C$DW$T$20      .dwtag  DW_TAG_structure_type
     521                      .dwattr $C$DW$T$20, DW_AT_name("LDC161x_REG_Obj")
     522                      .dwattr $C$DW$T$20, DW_AT_declaration
     523                      .dwendtag $C$DW$T$20
     524              
     525              $C$DW$T$108     .dwtag  DW_TAG_pointer_type
     526                      .dwattr $C$DW$T$108, DW_AT_type(*$C$DW$T$20)
     527                      .dwattr $C$DW$T$108, DW_AT_address_class(0x16)
     528              $C$DW$T$109     .dwtag  DW_TAG_typedef, DW_AT_name("LDC_Handle")
     529                      .dwattr $C$DW$T$109, DW_AT_type(*$C$DW$T$108)
     530                      .dwattr $C$DW$T$109, DW_AT_language(DW_LANG_C)
     531              
     532              $C$DW$T$31      .dwtag  DW_TAG_structure_type
     533                      .dwattr $C$DW$T$31, DW_AT_name("_ADC_Obj_")
     534                      .dwattr $C$DW$T$31, DW_AT_byte_size(0x6650)
     535              $C$DW$116       .dwtag  DW_TAG_member
     536                      .dwattr $C$DW$116, DW_AT_type(*$C$DW$T$25)
     537                      .dwattr $C$DW$116, DW_AT_name("ADCRESULT")
     538                      .dwattr $C$DW$116, DW_AT_TI_symbol_name("_ADCRESULT")
     539                      .dwattr $C$DW$116, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
     540                      .dwattr $C$DW$116, DW_AT_accessibility(DW_ACCESS_public)
     541              $C$DW$117       .dwtag  DW_TAG_member
TMS320C2000 Assembler PC v6.2.5 Tue Aug 29 10:13:49 2017

Tools Copyright (c) 1996-2014 Texas Instruments Incorporated
C:\Users\wmj\AppData\Local\Temp\0884811                              PAGE   11

     542                      .dwattr $C$DW$117, DW_AT_type(*$C$DW$T$26)
     543                      .dwattr $C$DW$117, DW_AT_name("resvd_1")
     544                      .dwattr $C$DW$117, DW_AT_TI_symbol_name("_resvd_1")
     545                      .dwattr $C$DW$117, DW_AT_data_member_location[DW_OP_plus_uconst 0x10]
     546                      .dwattr $C$DW$117, DW_AT_accessibility(DW_ACCESS_public)
     547              $C$DW$118       .dwtag  DW_TAG_member
     548                      .dwattr $C$DW$118, DW_AT_type(*$C$DW$T$24)
     549                      .dwattr $C$DW$118, DW_AT_name("ADCCTL1")
     550                      .dwattr $C$DW$118, DW_AT_TI_symbol_name("_ADCCTL1")
     551                      .dwattr $C$DW$118, DW_AT_data_member_location[DW_OP_plus_uconst 0x6600]
     552                      .dwattr $C$DW$118, DW_AT_accessibility(DW_ACCESS_public)
     553              $C$DW$119       .dwtag  DW_TAG_member
     554                      .dwattr $C$DW$119, DW_AT_type(*$C$DW$T$24)
     555                      .dwattr $C$DW$119, DW_AT_name("ADCCTL2")
     556                      .dwattr $C$DW$119, DW_AT_TI_symbol_name("_ADCCTL2")
     557                      .dwattr $C$DW$119, DW_AT_data_member_location[DW_OP_plus_uconst 0x6601]
     558                      .dwattr $C$DW$119, DW_AT_accessibility(DW_ACCESS_public)
     559              $C$DW$120       .dwtag  DW_TAG_member
     560                      .dwattr $C$DW$120, DW_AT_type(*$C$DW$T$27)
     561                      .dwattr $C$DW$120, DW_AT_name("rsvd_2")
     562                      .dwattr $C$DW$120, DW_AT_TI_symbol_name("_rsvd_2")
     563                      .dwattr $C$DW$120, DW_AT_data_member_location[DW_OP_plus_uconst 0x6602]
     564                      .dwattr $C$DW$120, DW_AT_accessibility(DW_ACCESS_public)
     565              $C$DW$121       .dwtag  DW_TAG_member
     566                      .dwattr $C$DW$121, DW_AT_type(*$C$DW$T$24)
     567                      .dwattr $C$DW$121, DW_AT_name("ADCINTFLG")
     568                      .dwattr $C$DW$121, DW_AT_TI_symbol_name("_ADCINTFLG")
     569                      .dwattr $C$DW$121, DW_AT_data_member_location[DW_OP_plus_uconst 0x6604]
     570                      .dwattr $C$DW$121, DW_AT_accessibility(DW_ACCESS_public)
     571              $C$DW$122       .dwtag  DW_TAG_member
     572                      .dwattr $C$DW$122, DW_AT_type(*$C$DW$T$24)
     573                      .dwattr $C$DW$122, DW_AT_name("ADCINTFLGCLR")
     574                      .dwattr $C$DW$122, DW_AT_TI_symbol_name("_ADCINTFLGCLR")
     575                      .dwattr $C$DW$122, DW_AT_data_member_location[DW_OP_plus_uconst 0x6605]
     576                      .dwattr $C$DW$122, DW_AT_accessibility(DW_ACCESS_public)
     577              $C$DW$123       .dwtag  DW_TAG_member
     578                      .dwattr $C$DW$123, DW_AT_type(*$C$DW$T$24)
     579                      .dwattr $C$DW$123, DW_AT_name("ADCINTOVF")
     580                      .dwattr $C$DW$123, DW_AT_TI_symbol_name("_ADCINTOVF")
     581                      .dwattr $C$DW$123, DW_AT_data_member_location[DW_OP_plus_uconst 0x6606]
     582                      .dwattr $C$DW$123, DW_AT_accessibility(DW_ACCESS_public)
     583              $C$DW$124       .dwtag  DW_TAG_member
     584                      .dwattr $C$DW$124, DW_AT_type(*$C$DW$T$24)
     585                      .dwattr $C$DW$124, DW_AT_name("ADCINTOVFCLR")
     586                      .dwattr $C$DW$124, DW_AT_TI_symbol_name("_ADCINTOVFCLR")
     587                      .dwattr $C$DW$124, DW_AT_data_member_location[DW_OP_plus_uconst 0x6607]
     588                      .dwattr $C$DW$124, DW_AT_accessibility(DW_ACCESS_public)
     589              $C$DW$125       .dwtag  DW_TAG_member
     590                      .dwattr $C$DW$125, DW_AT_type(*$C$DW$T$28)
     591                      .dwattr $C$DW$125, DW_AT_name("INTSELxNy")
     592                      .dwattr $C$DW$125, DW_AT_TI_symbol_name("_INTSELxNy")
     593                      .dwattr $C$DW$125, DW_AT_data_member_location[DW_OP_plus_uconst 0x6608]
     594                      .dwattr $C$DW$125, DW_AT_accessibility(DW_ACCESS_public)
     595              $C$DW$126       .dwtag  DW_TAG_member
     596                      .dwattr $C$DW$126, DW_AT_type(*$C$DW$T$29)
TMS320C2000 Assembler PC v6.2.5 Tue Aug 29 10:13:49 2017

Tools Copyright (c) 1996-2014 Texas Instruments Incorporated
C:\Users\wmj\AppData\Local\Temp\0884811                              PAGE   12

     597                      .dwattr $C$DW$126, DW_AT_name("rsvd_3")
     598                      .dwattr $C$DW$126, DW_AT_TI_symbol_name("_rsvd_3")
     599                      .dwattr $C$DW$126, DW_AT_data_member_location[DW_OP_plus_uconst 0x660d]
     600                      .dwattr $C$DW$126, DW_AT_accessibility(DW_ACCESS_public)
     601              $C$DW$127       .dwtag  DW_TAG_member
     602                      .dwattr $C$DW$127, DW_AT_type(*$C$DW$T$24)
     603                      .dwattr $C$DW$127, DW_AT_name("SOCPRICTRL")
     604                      .dwattr $C$DW$127, DW_AT_TI_symbol_name("_SOCPRICTRL")
     605                      .dwattr $C$DW$127, DW_AT_data_member_location[DW_OP_plus_uconst 0x6610]
     606                      .dwattr $C$DW$127, DW_AT_accessibility(DW_ACCESS_public)
     607              $C$DW$128       .dwtag  DW_TAG_member
     608                      .dwattr $C$DW$128, DW_AT_type(*$C$DW$T$24)
     609                      .dwattr $C$DW$128, DW_AT_name("rsvd_4")
     610                      .dwattr $C$DW$128, DW_AT_TI_symbol_name("_rsvd_4")
     611                      .dwattr $C$DW$128, DW_AT_data_member_location[DW_OP_plus_uconst 0x6611]
     612                      .dwattr $C$DW$128, DW_AT_accessibility(DW_ACCESS_public)
     613              $C$DW$129       .dwtag  DW_TAG_member
     614                      .dwattr $C$DW$129, DW_AT_type(*$C$DW$T$24)
     615                      .dwattr $C$DW$129, DW_AT_name("ADCSAMPLEMODE")
     616                      .dwattr $C$DW$129, DW_AT_TI_symbol_name("_ADCSAMPLEMODE")
     617                      .dwattr $C$DW$129, DW_AT_data_member_location[DW_OP_plus_uconst 0x6612]
     618                      .dwattr $C$DW$129, DW_AT_accessibility(DW_ACCESS_public)
     619              $C$DW$130       .dwtag  DW_TAG_member
     620                      .dwattr $C$DW$130, DW_AT_type(*$C$DW$T$24)
     621                      .dwattr $C$DW$130, DW_AT_name("rsvd_5")
     622                      .dwattr $C$DW$130, DW_AT_TI_symbol_name("_rsvd_5")
     623                      .dwattr $C$DW$130, DW_AT_data_member_location[DW_OP_plus_uconst 0x6613]
     624                      .dwattr $C$DW$130, DW_AT_accessibility(DW_ACCESS_public)
     625              $C$DW$131       .dwtag  DW_TAG_member
     626                      .dwattr $C$DW$131, DW_AT_type(*$C$DW$T$24)
     627                      .dwattr $C$DW$131, DW_AT_name("ADCINTSOCSEL1")
     628                      .dwattr $C$DW$131, DW_AT_TI_symbol_name("_ADCINTSOCSEL1")
     629                      .dwattr $C$DW$131, DW_AT_data_member_location[DW_OP_plus_uconst 0x6614]
     630                      .dwattr $C$DW$131, DW_AT_accessibility(DW_ACCESS_public)
     631              $C$DW$132       .dwtag  DW_TAG_member
     632                      .dwattr $C$DW$132, DW_AT_type(*$C$DW$T$24)
     633                      .dwattr $C$DW$132, DW_AT_name("ADCINTSOCSEL2")
     634                      .dwattr $C$DW$132, DW_AT_TI_symbol_name("_ADCINTSOCSEL2")
     635                      .dwattr $C$DW$132, DW_AT_data_member_location[DW_OP_plus_uconst 0x6615]
     636                      .dwattr $C$DW$132, DW_AT_accessibility(DW_ACCESS_public)
     637              $C$DW$133       .dwtag  DW_TAG_member
     638                      .dwattr $C$DW$133, DW_AT_type(*$C$DW$T$27)
     639                      .dwattr $C$DW$133, DW_AT_name("rsvd_6")
     640                      .dwattr $C$DW$133, DW_AT_TI_symbol_name("_rsvd_6")
     641                      .dwattr $C$DW$133, DW_AT_data_member_location[DW_OP_plus_uconst 0x6616]
     642                      .dwattr $C$DW$133, DW_AT_accessibility(DW_ACCESS_public)
     643              $C$DW$134       .dwtag  DW_TAG_member
     644                      .dwattr $C$DW$134, DW_AT_type(*$C$DW$T$24)
     645                      .dwattr $C$DW$134, DW_AT_name("ADCSOCFLG1")
     646                      .dwattr $C$DW$134, DW_AT_TI_symbol_name("_ADCSOCFLG1")
     647                      .dwattr $C$DW$134, DW_AT_data_member_location[DW_OP_plus_uconst 0x6618]
     648                      .dwattr $C$DW$134, DW_AT_accessibility(DW_ACCESS_public)
     649              $C$DW$135       .dwtag  DW_TAG_member
     650                      .dwattr $C$DW$135, DW_AT_type(*$C$DW$T$24)
     651                      .dwattr $C$DW$135, DW_AT_name("rsvd_7")
TMS320C2000 Assembler PC v6.2.5 Tue Aug 29 10:13:49 2017

Tools Copyright (c) 1996-2014 Texas Instruments Incorporated
C:\Users\wmj\AppData\Local\Temp\0884811                              PAGE   13

     652                      .dwattr $C$DW$135, DW_AT_TI_symbol_name("_rsvd_7")
     653                      .dwattr $C$DW$135, DW_AT_data_member_location[DW_OP_plus_uconst 0x6619]
     654                      .dwattr $C$DW$135, DW_AT_accessibility(DW_ACCESS_public)
     655              $C$DW$136       .dwtag  DW_TAG_member
     656                      .dwattr $C$DW$136, DW_AT_type(*$C$DW$T$24)
     657                      .dwattr $C$DW$136, DW_AT_name("ADCSOCFRC1")
     658                      .dwattr $C$DW$136, DW_AT_TI_symbol_name("_ADCSOCFRC1")
     659                      .dwattr $C$DW$136, DW_AT_data_member_location[DW_OP_plus_uconst 0x661a]
     660                      .dwattr $C$DW$136, DW_AT_accessibility(DW_ACCESS_public)
     661              $C$DW$137       .dwtag  DW_TAG_member
     662                      .dwattr $C$DW$137, DW_AT_type(*$C$DW$T$24)
     663                      .dwattr $C$DW$137, DW_AT_name("rsvd_8")
     664                      .dwattr $C$DW$137, DW_AT_TI_symbol_name("_rsvd_8")
     665                      .dwattr $C$DW$137, DW_AT_data_member_location[DW_OP_plus_uconst 0x661b]
     666                      .dwattr $C$DW$137, DW_AT_accessibility(DW_ACCESS_public)
     667              $C$DW$138       .dwtag  DW_TAG_member
     668                      .dwattr $C$DW$138, DW_AT_type(*$C$DW$T$24)
     669                      .dwattr $C$DW$138, DW_AT_name("ADCSOCOVF1")
     670                      .dwattr $C$DW$138, DW_AT_TI_symbol_name("_ADCSOCOVF1")
     671                      .dwattr $C$DW$138, DW_AT_data_member_location[DW_OP_plus_uconst 0x661c]
     672                      .dwattr $C$DW$138, DW_AT_accessibility(DW_ACCESS_public)
     673              $C$DW$139       .dwtag  DW_TAG_member
     674                      .dwattr $C$DW$139, DW_AT_type(*$C$DW$T$24)
     675                      .dwattr $C$DW$139, DW_AT_name("rsvd_9")
     676                      .dwattr $C$DW$139, DW_AT_TI_symbol_name("_rsvd_9")
     677                      .dwattr $C$DW$139, DW_AT_data_member_location[DW_OP_plus_uconst 0x661d]
     678                      .dwattr $C$DW$139, DW_AT_accessibility(DW_ACCESS_public)
     679              $C$DW$140       .dwtag  DW_TAG_member
     680                      .dwattr $C$DW$140, DW_AT_type(*$C$DW$T$24)
     681                      .dwattr $C$DW$140, DW_AT_name("ADCSOCOVFCLR1")
     682                      .dwattr $C$DW$140, DW_AT_TI_symbol_name("_ADCSOCOVFCLR1")
     683                      .dwattr $C$DW$140, DW_AT_data_member_location[DW_OP_plus_uconst 0x661e]
     684                      .dwattr $C$DW$140, DW_AT_accessibility(DW_ACCESS_public)
     685              $C$DW$141       .dwtag  DW_TAG_member
     686                      .dwattr $C$DW$141, DW_AT_type(*$C$DW$T$24)
     687                      .dwattr $C$DW$141, DW_AT_name("rsvd_10")
     688                      .dwattr $C$DW$141, DW_AT_TI_symbol_name("_rsvd_10")
     689                      .dwattr $C$DW$141, DW_AT_data_member_location[DW_OP_plus_uconst 0x661f]
     690                      .dwattr $C$DW$141, DW_AT_accessibility(DW_ACCESS_public)
     691              $C$DW$142       .dwtag  DW_TAG_member
     692                      .dwattr $C$DW$142, DW_AT_type(*$C$DW$T$25)
     693                      .dwattr $C$DW$142, DW_AT_name("ADCSOCxCTL")
     694                      .dwattr $C$DW$142, DW_AT_TI_symbol_name("_ADCSOCxCTL")
     695                      .dwattr $C$DW$142, DW_AT_data_member_location[DW_OP_plus_uconst 0x6620]
     696                      .dwattr $C$DW$142, DW_AT_accessibility(DW_ACCESS_public)
     697              $C$DW$143       .dwtag  DW_TAG_member
     698                      .dwattr $C$DW$143, DW_AT_type(*$C$DW$T$25)
     699                      .dwattr $C$DW$143, DW_AT_name("rsvd_11")
     700                      .dwattr $C$DW$143, DW_AT_TI_symbol_name("_rsvd_11")
     701                      .dwattr $C$DW$143, DW_AT_data_member_location[DW_OP_plus_uconst 0x6630]
     702                      .dwattr $C$DW$143, DW_AT_accessibility(DW_ACCESS_public)
     703              $C$DW$144       .dwtag  DW_TAG_member
     704                      .dwattr $C$DW$144, DW_AT_type(*$C$DW$T$24)
     705                      .dwattr $C$DW$144, DW_AT_name("ADCREFTRIM")
     706                      .dwattr $C$DW$144, DW_AT_TI_symbol_name("_ADCREFTRIM")
TMS320C2000 Assembler PC v6.2.5 Tue Aug 29 10:13:49 2017

Tools Copyright (c) 1996-2014 Texas Instruments Incorporated
C:\Users\wmj\AppData\Local\Temp\0884811                              PAGE   14

     707                      .dwattr $C$DW$144, DW_AT_data_member_location[DW_OP_plus_uconst 0x6640]
     708                      .dwattr $C$DW$144, DW_AT_accessibility(DW_ACCESS_public)
     709              $C$DW$145       .dwtag  DW_TAG_member
     710                      .dwattr $C$DW$145, DW_AT_type(*$C$DW$T$24)
     711                      .dwattr $C$DW$145, DW_AT_name("ADCOFFTRIM")
     712                      .dwattr $C$DW$145, DW_AT_TI_symbol_name("_ADCOFFTRIM")
     713                      .dwattr $C$DW$145, DW_AT_data_member_location[DW_OP_plus_uconst 0x6641]
     714                      .dwattr $C$DW$145, DW_AT_accessibility(DW_ACCESS_public)
     715              $C$DW$146       .dwtag  DW_TAG_member
     716                      .dwattr $C$DW$146, DW_AT_type(*$C$DW$T$30)
     717                      .dwattr $C$DW$146, DW_AT_name("resvd_12")
     718                      .dwattr $C$DW$146, DW_AT_TI_symbol_name("_resvd_12")
     719                      .dwattr $C$DW$146, DW_AT_data_member_location[DW_OP_plus_uconst 0x6642]
     720                      .dwattr $C$DW$146, DW_AT_accessibility(DW_ACCESS_public)
     721              $C$DW$147       .dwtag  DW_TAG_member
     722                      .dwattr $C$DW$147, DW_AT_type(*$C$DW$T$24)
     723                      .dwattr $C$DW$147, DW_AT_name("ADCREV")
     724                      .dwattr $C$DW$147, DW_AT_TI_symbol_name("_ADCREV")
     725                      .dwattr $C$DW$147, DW_AT_data_member_location[DW_OP_plus_uconst 0x664f]
     726                      .dwattr $C$DW$147, DW_AT_accessibility(DW_ACCESS_public)
     727                      .dwendtag $C$DW$T$31
     728              
     729              $C$DW$T$66      .dwtag  DW_TAG_pointer_type
     730                      .dwattr $C$DW$T$66, DW_AT_type(*$C$DW$T$31)
     731                      .dwattr $C$DW$T$66, DW_AT_address_class(0x16)
     732              $C$DW$T$67      .dwtag  DW_TAG_typedef, DW_AT_name("ADC_Handle")
     733                      .dwattr $C$DW$T$67, DW_AT_type(*$C$DW$T$66)
     734                      .dwattr $C$DW$T$67, DW_AT_language(DW_LANG_C)
     735              
     736              $C$DW$T$43      .dwtag  DW_TAG_structure_type
     737                      .dwattr $C$DW$T$43, DW_AT_name("_BRAKE_Obj_")
     738                      .dwattr $C$DW$T$43, DW_AT_byte_size(0x2c)
     739              $C$DW$148       .dwtag  DW_TAG_member
     740                      .dwattr $C$DW$148, DW_AT_type(*$C$DW$T$33)
     741                      .dwattr $C$DW$148, DW_AT_name("state")
     742                      .dwattr $C$DW$148, DW_AT_TI_symbol_name("_state")
     743                      .dwattr $C$DW$148, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
     744                      .dwattr $C$DW$148, DW_AT_accessibility(DW_ACCESS_public)
     745              $C$DW$149       .dwtag  DW_TAG_member
     746                      .dwattr $C$DW$149, DW_AT_type(*$C$DW$T$35)
     747                      .dwattr $C$DW$149, DW_AT_name("pidHandle_Ibrake")
     748                      .dwattr $C$DW$149, DW_AT_TI_symbol_name("_pidHandle_Ibrake")
     749                      .dwattr $C$DW$149, DW_AT_data_member_location[DW_OP_plus_uconst 0x2]
     750                      .dwattr $C$DW$149, DW_AT_accessibility(DW_ACCESS_public)
     751              $C$DW$150       .dwtag  DW_TAG_member
     752                      .dwattr $C$DW$150, DW_AT_type(*$C$DW$T$36)
     753                      .dwattr $C$DW$150, DW_AT_name("pid_Ibrake")
     754                      .dwattr $C$DW$150, DW_AT_TI_symbol_name("_pid_Ibrake")
     755                      .dwattr $C$DW$150, DW_AT_data_member_location[DW_OP_plus_uconst 0x4]
     756                      .dwattr $C$DW$150, DW_AT_accessibility(DW_ACCESS_public)
     757              $C$DW$151       .dwtag  DW_TAG_member
     758                      .dwattr $C$DW$151, DW_AT_type(*$C$DW$T$37)
     759                      .dwattr $C$DW$151, DW_AT_name("Kp_Ibrake")
     760                      .dwattr $C$DW$151, DW_AT_TI_symbol_name("_Kp_Ibrake")
     761                      .dwattr $C$DW$151, DW_AT_data_member_location[DW_OP_plus_uconst 0x14]
TMS320C2000 Assembler PC v6.2.5 Tue Aug 29 10:13:49 2017

Tools Copyright (c) 1996-2014 Texas Instruments Incorporated
C:\Users\wmj\AppData\Local\Temp\0884811                              PAGE   15

     762                      .dwattr $C$DW$151, DW_AT_accessibility(DW_ACCESS_public)
     763              $C$DW$152       .dwtag  DW_TAG_member
     764                      .dwattr $C$DW$152, DW_AT_type(*$C$DW$T$37)
     765                      .dwattr $C$DW$152, DW_AT_name("Ki_Ibrake")
     766                      .dwattr $C$DW$152, DW_AT_TI_symbol_name("_Ki_Ibrake")
     767                      .dwattr $C$DW$152, DW_AT_data_member_location[DW_OP_plus_uconst 0x16]
     768                      .dwattr $C$DW$152, DW_AT_accessibility(DW_ACCESS_public)
     769              $C$DW$153       .dwtag  DW_TAG_member
     770                      .dwattr $C$DW$153, DW_AT_type(*$C$DW$T$37)
     771                      .dwattr $C$DW$153, DW_AT_name("Kd_Ibrake")
     772                      .dwattr $C$DW$153, DW_AT_TI_symbol_name("_Kd_Ibrake")
     773                      .dwattr $C$DW$153, DW_AT_data_member_location[DW_OP_plus_uconst 0x18]
     774                      .dwattr $C$DW$153, DW_AT_accessibility(DW_ACCESS_public)
     775              $C$DW$154       .dwtag  DW_TAG_member
     776                      .dwattr $C$DW$154, DW_AT_type(*$C$DW$T$37)
     777                      .dwattr $C$DW$154, DW_AT_name("Ibrake_ref")
     778                      .dwattr $C$DW$154, DW_AT_TI_symbol_name("_Ibrake_ref")
     779                      .dwattr $C$DW$154, DW_AT_data_member_location[DW_OP_plus_uconst 0x1a]
     780                      .dwattr $C$DW$154, DW_AT_accessibility(DW_ACCESS_public)
     781              $C$DW$155       .dwtag  DW_TAG_member
     782                      .dwattr $C$DW$155, DW_AT_type(*$C$DW$T$37)
     783                      .dwattr $C$DW$155, DW_AT_name("Ibrake_fbk")
     784                      .dwattr $C$DW$155, DW_AT_TI_symbol_name("_Ibrake_fbk")
     785                      .dwattr $C$DW$155, DW_AT_data_member_location[DW_OP_plus_uconst 0x1c]
     786                      .dwattr $C$DW$155, DW_AT_accessibility(DW_ACCESS_public)
     787              $C$DW$156       .dwtag  DW_TAG_member
     788                      .dwattr $C$DW$156, DW_AT_type(*$C$DW$T$38)
     789                      .dwattr $C$DW$156, DW_AT_name("AdcValue_I")
     790                      .dwattr $C$DW$156, DW_AT_TI_symbol_name("_AdcValue_I")
     791                      .dwattr $C$DW$156, DW_AT_data_member_location[DW_OP_plus_uconst 0x1e]
     792                      .dwattr $C$DW$156, DW_AT_accessibility(DW_ACCESS_public)
     793              $C$DW$157       .dwtag  DW_TAG_member
     794                      .dwattr $C$DW$157, DW_AT_type(*$C$DW$T$37)
     795                      .dwattr $C$DW$157, DW_AT_name("Ibrake_out")
     796                      .dwattr $C$DW$157, DW_AT_TI_symbol_name("_Ibrake_out")
     797                      .dwattr $C$DW$157, DW_AT_data_member_location[DW_OP_plus_uconst 0x22]
     798                      .dwattr $C$DW$157, DW_AT_accessibility(DW_ACCESS_public)
     799              $C$DW$158       .dwtag  DW_TAG_member
     800                      .dwattr $C$DW$158, DW_AT_type(*$C$DW$T$37)
     801                      .dwattr $C$DW$158, DW_AT_name("Irated")
     802                      .dwattr $C$DW$158, DW_AT_TI_symbol_name("_Irated")
     803                      .dwattr $C$DW$158, DW_AT_data_member_location[DW_OP_plus_uconst 0x24]
     804                      .dwattr $C$DW$158, DW_AT_accessibility(DW_ACCESS_public)
     805              $C$DW$159       .dwtag  DW_TAG_member
     806                      .dwattr $C$DW$159, DW_AT_type(*$C$DW$T$37)
     807                      .dwattr $C$DW$159, DW_AT_name("current_rate")
     808                      .dwattr $C$DW$159, DW_AT_TI_symbol_name("_current_rate")
     809                      .dwattr $C$DW$159, DW_AT_data_member_location[DW_OP_plus_uconst 0x26]
     810                      .dwattr $C$DW$159, DW_AT_accessibility(DW_ACCESS_public)
     811              $C$DW$160       .dwtag  DW_TAG_member
     812                      .dwattr $C$DW$160, DW_AT_type(*$C$DW$T$40)
     813                      .dwattr $C$DW$160, DW_AT_name("brake_type")
     814                      .dwattr $C$DW$160, DW_AT_TI_symbol_name("_brake_type")
     815                      .dwattr $C$DW$160, DW_AT_data_member_location[DW_OP_plus_uconst 0x28]
     816                      .dwattr $C$DW$160, DW_AT_accessibility(DW_ACCESS_public)
TMS320C2000 Assembler PC v6.2.5 Tue Aug 29 10:13:49 2017

Tools Copyright (c) 1996-2014 Texas Instruments Incorporated
C:\Users\wmj\AppData\Local\Temp\0884811                              PAGE   16

     817              $C$DW$161       .dwtag  DW_TAG_member
     818                      .dwattr $C$DW$161, DW_AT_type(*$C$DW$T$41)
     819                      .dwattr $C$DW$161, DW_AT_name("counter_current")
     820                      .dwattr $C$DW$161, DW_AT_TI_symbol_name("_counter_current")
     821                      .dwattr $C$DW$161, DW_AT_data_member_location[DW_OP_plus_uconst 0x29]
     822                      .dwattr $C$DW$161, DW_AT_accessibility(DW_ACCESS_public)
     823              $C$DW$162       .dwtag  DW_TAG_member
     824                      .dwattr $C$DW$162, DW_AT_type(*$C$DW$T$42)
     825                      .dwattr $C$DW$162, DW_AT_name("flag_enableBrake")
     826                      .dwattr $C$DW$162, DW_AT_TI_symbol_name("_flag_enableBrake")
     827                      .dwattr $C$DW$162, DW_AT_data_member_location[DW_OP_plus_uconst 0x2a]
     828                      .dwattr $C$DW$162, DW_AT_accessibility(DW_ACCESS_public)
     829              $C$DW$163       .dwtag  DW_TAG_member
     830                      .dwattr $C$DW$163, DW_AT_type(*$C$DW$T$42)
     831                      .dwattr $C$DW$163, DW_AT_name("flag_enableOffset")
     832                      .dwattr $C$DW$163, DW_AT_TI_symbol_name("_flag_enableOffset")
     833                      .dwattr $C$DW$163, DW_AT_data_member_location[DW_OP_plus_uconst 0x2b]
     834                      .dwattr $C$DW$163, DW_AT_accessibility(DW_ACCESS_public)
     835                      .dwendtag $C$DW$T$43
     836              
     837              $C$DW$T$181     .dwtag  DW_TAG_typedef, DW_AT_name("BRAKE_Obj")
     838                      .dwattr $C$DW$T$181, DW_AT_type(*$C$DW$T$43)
     839                      .dwattr $C$DW$T$181, DW_AT_language(DW_LANG_C)
     840              $C$DW$T$179     .dwtag  DW_TAG_pointer_type
     841                      .dwattr $C$DW$T$179, DW_AT_type(*$C$DW$T$43)
     842                      .dwattr $C$DW$T$179, DW_AT_address_class(0x16)
     843              $C$DW$T$180     .dwtag  DW_TAG_typedef, DW_AT_name("BRAKE_Handle")
     844                      .dwattr $C$DW$T$180, DW_AT_type(*$C$DW$T$179)
     845                      .dwattr $C$DW$T$180, DW_AT_language(DW_LANG_C)
     846              
     847              $C$DW$T$44      .dwtag  DW_TAG_structure_type
     848                      .dwattr $C$DW$T$44, DW_AT_name("_CLK_DIV_t_")
     849                      .dwattr $C$DW$T$44, DW_AT_byte_size(0x02)
     850              $C$DW$164       .dwtag  DW_TAG_member
     851                      .dwattr $C$DW$164, DW_AT_type(*$C$DW$T$23)
     852                      .dwattr $C$DW$164, DW_AT_name("FREF_DIVIDER")
     853                      .dwattr $C$DW$164, DW_AT_TI_symbol_name("_FREF_DIVIDER")
     854                      .dwattr $C$DW$164, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
     855                      .dwattr $C$DW$164, DW_AT_accessibility(DW_ACCESS_public)
     856              $C$DW$165       .dwtag  DW_TAG_member
     857                      .dwattr $C$DW$165, DW_AT_type(*$C$DW$T$23)
     858                      .dwattr $C$DW$165, DW_AT_name("FIN_DIVIDER")
     859                      .dwattr $C$DW$165, DW_AT_TI_symbol_name("_FIN_DIVIDER")
     860                      .dwattr $C$DW$165, DW_AT_data_member_location[DW_OP_plus_uconst 0x1]
     861                      .dwattr $C$DW$165, DW_AT_accessibility(DW_ACCESS_public)
     862                      .dwendtag $C$DW$T$44
     863              
     864              $C$DW$T$102     .dwtag  DW_TAG_typedef, DW_AT_name("CLK_DIV_t_")
     865                      .dwattr $C$DW$T$102, DW_AT_type(*$C$DW$T$44)
     866                      .dwattr $C$DW$T$102, DW_AT_language(DW_LANG_C)
     867              
     868              $C$DW$T$46      .dwtag  DW_TAG_structure_type
     869                      .dwattr $C$DW$T$46, DW_AT_name("_CLK_Obj_")
     870                      .dwattr $C$DW$T$46, DW_AT_byte_size(0x11)
     871              $C$DW$166       .dwtag  DW_TAG_member
TMS320C2000 Assembler PC v6.2.5 Tue Aug 29 10:13:49 2017

Tools Copyright (c) 1996-2014 Texas Instruments Incorporated
C:\Users\wmj\AppData\Local\Temp\0884811                              PAGE   17

     872                      .dwattr $C$DW$166, DW_AT_type(*$C$DW$T$24)
     873                      .dwattr $C$DW$166, DW_AT_name("XCLK")
     874                      .dwattr $C$DW$166, DW_AT_TI_symbol_name("_XCLK")
     875                      .dwattr $C$DW$166, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
     876                      .dwattr $C$DW$166, DW_AT_accessibility(DW_ACCESS_public)
     877              $C$DW$167       .dwtag  DW_TAG_member
     878                      .dwattr $C$DW$167, DW_AT_type(*$C$DW$T$24)
     879                      .dwattr $C$DW$167, DW_AT_name("rsvd_1")
     880                      .dwattr $C$DW$167, DW_AT_TI_symbol_name("_rsvd_1")
     881                      .dwattr $C$DW$167, DW_AT_data_member_location[DW_OP_plus_uconst 0x1]
     882                      .dwattr $C$DW$167, DW_AT_accessibility(DW_ACCESS_public)
     883              $C$DW$168       .dwtag  DW_TAG_member
     884                      .dwattr $C$DW$168, DW_AT_type(*$C$DW$T$24)
     885                      .dwattr $C$DW$168, DW_AT_name("CLKCTL")
     886                      .dwattr $C$DW$168, DW_AT_TI_symbol_name("_CLKCTL")
     887                      .dwattr $C$DW$168, DW_AT_data_member_location[DW_OP_plus_uconst 0x2]
     888                      .dwattr $C$DW$168, DW_AT_accessibility(DW_ACCESS_public)
     889              $C$DW$169       .dwtag  DW_TAG_member
     890                      .dwattr $C$DW$169, DW_AT_type(*$C$DW$T$45)
     891                      .dwattr $C$DW$169, DW_AT_name("rsvd_2")
     892                      .dwattr $C$DW$169, DW_AT_TI_symbol_name("_rsvd_2")
     893                      .dwattr $C$DW$169, DW_AT_data_member_location[DW_OP_plus_uconst 0x3]
     894                      .dwattr $C$DW$169, DW_AT_accessibility(DW_ACCESS_public)
     895              $C$DW$170       .dwtag  DW_TAG_member
     896                      .dwattr $C$DW$170, DW_AT_type(*$C$DW$T$24)
     897                      .dwattr $C$DW$170, DW_AT_name("LOSPCP")
     898                      .dwattr $C$DW$170, DW_AT_TI_symbol_name("_LOSPCP")
     899                      .dwattr $C$DW$170, DW_AT_data_member_location[DW_OP_plus_uconst 0xb]
     900                      .dwattr $C$DW$170, DW_AT_accessibility(DW_ACCESS_public)
     901              $C$DW$171       .dwtag  DW_TAG_member
     902                      .dwattr $C$DW$171, DW_AT_type(*$C$DW$T$24)
     903                      .dwattr $C$DW$171, DW_AT_name("PCLKCR0")
     904                      .dwattr $C$DW$171, DW_AT_TI_symbol_name("_PCLKCR0")
     905                      .dwattr $C$DW$171, DW_AT_data_member_location[DW_OP_plus_uconst 0xc]
     906                      .dwattr $C$DW$171, DW_AT_accessibility(DW_ACCESS_public)
     907              $C$DW$172       .dwtag  DW_TAG_member
     908                      .dwattr $C$DW$172, DW_AT_type(*$C$DW$T$24)
     909                      .dwattr $C$DW$172, DW_AT_name("PCLKCR1")
     910                      .dwattr $C$DW$172, DW_AT_TI_symbol_name("_PCLKCR1")
     911                      .dwattr $C$DW$172, DW_AT_data_member_location[DW_OP_plus_uconst 0xd]
     912                      .dwattr $C$DW$172, DW_AT_accessibility(DW_ACCESS_public)
     913              $C$DW$173       .dwtag  DW_TAG_member
     914                      .dwattr $C$DW$173, DW_AT_type(*$C$DW$T$27)
     915                      .dwattr $C$DW$173, DW_AT_name("rsvd_3")
     916                      .dwattr $C$DW$173, DW_AT_TI_symbol_name("_rsvd_3")
     917                      .dwattr $C$DW$173, DW_AT_data_member_location[DW_OP_plus_uconst 0xe]
     918                      .dwattr $C$DW$173, DW_AT_accessibility(DW_ACCESS_public)
     919              $C$DW$174       .dwtag  DW_TAG_member
     920                      .dwattr $C$DW$174, DW_AT_type(*$C$DW$T$24)
     921                      .dwattr $C$DW$174, DW_AT_name("PCLKCR3")
     922                      .dwattr $C$DW$174, DW_AT_TI_symbol_name("_PCLKCR3")
     923                      .dwattr $C$DW$174, DW_AT_data_member_location[DW_OP_plus_uconst 0x10]
     924                      .dwattr $C$DW$174, DW_AT_accessibility(DW_ACCESS_public)
     925                      .dwendtag $C$DW$T$46
     926              
TMS320C2000 Assembler PC v6.2.5 Tue Aug 29 10:13:49 2017

Tools Copyright (c) 1996-2014 Texas Instruments Incorporated
C:\Users\wmj\AppData\Local\Temp\0884811                              PAGE   18

     927              $C$DW$T$68      .dwtag  DW_TAG_pointer_type
     928                      .dwattr $C$DW$T$68, DW_AT_type(*$C$DW$T$46)
     929                      .dwattr $C$DW$T$68, DW_AT_address_class(0x16)
     930              $C$DW$T$69      .dwtag  DW_TAG_typedef, DW_AT_name("CLK_Handle")
     931                      .dwattr $C$DW$T$69, DW_AT_type(*$C$DW$T$68)
     932                      .dwattr $C$DW$T$69, DW_AT_language(DW_LANG_C)
     933              
     934              $C$DW$T$48      .dwtag  DW_TAG_structure_type
     935                      .dwattr $C$DW$T$48, DW_AT_name("_CPU_Obj_")
     936                      .dwattr $C$DW$T$48, DW_AT_byte_size(0x01)
     937              $C$DW$175       .dwtag  DW_TAG_member
     938                      .dwattr $C$DW$175, DW_AT_type(*$C$DW$T$47)
     939                      .dwattr $C$DW$175, DW_AT_name("tmp")
     940                      .dwattr $C$DW$175, DW_AT_TI_symbol_name("_tmp")
     941                      .dwattr $C$DW$175, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
     942                      .dwattr $C$DW$175, DW_AT_accessibility(DW_ACCESS_public)
     943                      .dwendtag $C$DW$T$48
     944              
     945              $C$DW$T$70      .dwtag  DW_TAG_pointer_type
     946                      .dwattr $C$DW$T$70, DW_AT_type(*$C$DW$T$48)
     947                      .dwattr $C$DW$T$70, DW_AT_address_class(0x16)
     948              $C$DW$T$71      .dwtag  DW_TAG_typedef, DW_AT_name("CPU_Handle")
     949                      .dwattr $C$DW$T$71, DW_AT_type(*$C$DW$T$70)
     950                      .dwattr $C$DW$T$71, DW_AT_language(DW_LANG_C)
     951              
     952              $C$DW$T$55      .dwtag  DW_TAG_structure_type
     953                      .dwattr $C$DW$T$55, DW_AT_name("_DECODER_Obj_")
     954                      .dwattr $C$DW$T$55, DW_AT_byte_size(0x06)
     955              $C$DW$176       .dwtag  DW_TAG_member
     956                      .dwattr $C$DW$176, DW_AT_type(*$C$DW$T$50)
     957                      .dwattr $C$DW$176, DW_AT_name("spiHandle")
     958                      .dwattr $C$DW$176, DW_AT_TI_symbol_name("_spiHandle")
     959                      .dwattr $C$DW$176, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
     960                      .dwattr $C$DW$176, DW_AT_accessibility(DW_ACCESS_public)
     961              $C$DW$177       .dwtag  DW_TAG_member
     962                      .dwattr $C$DW$177, DW_AT_type(*$C$DW$T$52)
     963                      .dwattr $C$DW$177, DW_AT_name("gpioHandle")
     964                      .dwattr $C$DW$177, DW_AT_TI_symbol_name("_gpioHandle")
     965                      .dwattr $C$DW$177, DW_AT_data_member_location[DW_OP_plus_uconst 0x2]
     966                      .dwattr $C$DW$177, DW_AT_accessibility(DW_ACCESS_public)
     967              $C$DW$178       .dwtag  DW_TAG_member
     968                      .dwattr $C$DW$178, DW_AT_type(*$C$DW$T$54)
     969                      .dwattr $C$DW$178, DW_AT_name("gpioNumber")
     970                      .dwattr $C$DW$178, DW_AT_TI_symbol_name("_gpioNumber")
     971                      .dwattr $C$DW$178, DW_AT_data_member_location[DW_OP_plus_uconst 0x4]
     972                      .dwattr $C$DW$178, DW_AT_accessibility(DW_ACCESS_public)
     973              $C$DW$179       .dwtag  DW_TAG_member
     974                      .dwattr $C$DW$179, DW_AT_type(*$C$DW$T$42)
     975                      .dwattr $C$DW$179, DW_AT_name("RxTimeOut")
     976                      .dwattr $C$DW$179, DW_AT_TI_symbol_name("_RxTimeOut")
     977                      .dwattr $C$DW$179, DW_AT_data_member_location[DW_OP_plus_uconst 0x5]
     978                      .dwattr $C$DW$179, DW_AT_accessibility(DW_ACCESS_public)
     979                      .dwendtag $C$DW$T$55
     980              
     981              $C$DW$T$178     .dwtag  DW_TAG_typedef, DW_AT_name("DECODER_Obj")
TMS320C2000 Assembler PC v6.2.5 Tue Aug 29 10:13:49 2017

Tools Copyright (c) 1996-2014 Texas Instruments Incorporated
C:\Users\wmj\AppData\Local\Temp\0884811                              PAGE   19

     982                      .dwattr $C$DW$T$178, DW_AT_type(*$C$DW$T$55)
     983                      .dwattr $C$DW$T$178, DW_AT_language(DW_LANG_C)
     984              $C$DW$T$176     .dwtag  DW_TAG_pointer_type
     985                      .dwattr $C$DW$T$176, DW_AT_type(*$C$DW$T$55)
     986                      .dwattr $C$DW$T$176, DW_AT_address_class(0x16)
     987              $C$DW$T$177     .dwtag  DW_TAG_typedef, DW_AT_name("DECODER_Handle")
     988                      .dwattr $C$DW$T$177, DW_AT_type(*$C$DW$T$176)
     989                      .dwattr $C$DW$T$177, DW_AT_language(DW_LANG_C)
     990              
     991              $C$DW$T$56      .dwtag  DW_TAG_structure_type
     992                      .dwattr $C$DW$T$56, DW_AT_name("_DRIVE_CURRENT_t_")
     993                      .dwattr $C$DW$T$56, DW_AT_byte_size(0x02)
     994              $C$DW$180       .dwtag  DW_TAG_member
     995                      .dwattr $C$DW$180, DW_AT_type(*$C$DW$T$23)
     996                      .dwattr $C$DW$180, DW_AT_name("IDRIVE")
     997                      .dwattr $C$DW$180, DW_AT_TI_symbol_name("_IDRIVE")
     998                      .dwattr $C$DW$180, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
     999                      .dwattr $C$DW$180, DW_AT_accessibility(DW_ACCESS_public)
    1000              $C$DW$181       .dwtag  DW_TAG_member
    1001                      .dwattr $C$DW$181, DW_AT_type(*$C$DW$T$23)
    1002                      .dwattr $C$DW$181, DW_AT_name("INIT_IDRIVE")
    1003                      .dwattr $C$DW$181, DW_AT_TI_symbol_name("_INIT_IDRIVE")
    1004                      .dwattr $C$DW$181, DW_AT_data_member_location[DW_OP_plus_uconst 0x1]
    1005                      .dwattr $C$DW$181, DW_AT_accessibility(DW_ACCESS_public)
    1006                      .dwendtag $C$DW$T$56
    1007              
    1008              $C$DW$T$122     .dwtag  DW_TAG_typedef, DW_AT_name("DRIVE_CURRENT_t_")
    1009                      .dwattr $C$DW$T$122, DW_AT_type(*$C$DW$T$56)
    1010                      .dwattr $C$DW$T$122, DW_AT_language(DW_LANG_C)
    1011              
    1012              $C$DW$T$57      .dwtag  DW_TAG_structure_type
    1013                      .dwattr $C$DW$T$57, DW_AT_name("_FILTER_FO_")
    1014                      .dwattr $C$DW$T$57, DW_AT_byte_size(0x0a)
    1015              $C$DW$182       .dwtag  DW_TAG_member
    1016                      .dwattr $C$DW$182, DW_AT_type(*$C$DW$T$37)
    1017                      .dwattr $C$DW$182, DW_AT_name("a1")
    1018                      .dwattr $C$DW$182, DW_AT_TI_symbol_name("_a1")
    1019                      .dwattr $C$DW$182, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    1020                      .dwattr $C$DW$182, DW_AT_accessibility(DW_ACCESS_public)
    1021              $C$DW$183       .dwtag  DW_TAG_member
    1022                      .dwattr $C$DW$183, DW_AT_type(*$C$DW$T$37)
    1023                      .dwattr $C$DW$183, DW_AT_name("b0")
    1024                      .dwattr $C$DW$183, DW_AT_TI_symbol_name("_b0")
    1025                      .dwattr $C$DW$183, DW_AT_data_member_location[DW_OP_plus_uconst 0x2]
    1026                      .dwattr $C$DW$183, DW_AT_accessibility(DW_ACCESS_public)
    1027              $C$DW$184       .dwtag  DW_TAG_member
    1028                      .dwattr $C$DW$184, DW_AT_type(*$C$DW$T$37)
    1029                      .dwattr $C$DW$184, DW_AT_name("b1")
    1030                      .dwattr $C$DW$184, DW_AT_TI_symbol_name("_b1")
    1031                      .dwattr $C$DW$184, DW_AT_data_member_location[DW_OP_plus_uconst 0x4]
    1032                      .dwattr $C$DW$184, DW_AT_accessibility(DW_ACCESS_public)
    1033              $C$DW$185       .dwtag  DW_TAG_member
    1034                      .dwattr $C$DW$185, DW_AT_type(*$C$DW$T$37)
    1035                      .dwattr $C$DW$185, DW_AT_name("x1")
    1036                      .dwattr $C$DW$185, DW_AT_TI_symbol_name("_x1")
TMS320C2000 Assembler PC v6.2.5 Tue Aug 29 10:13:49 2017

Tools Copyright (c) 1996-2014 Texas Instruments Incorporated
C:\Users\wmj\AppData\Local\Temp\0884811                              PAGE   20

    1037                      .dwattr $C$DW$185, DW_AT_data_member_location[DW_OP_plus_uconst 0x6]
    1038                      .dwattr $C$DW$185, DW_AT_accessibility(DW_ACCESS_public)
    1039              $C$DW$186       .dwtag  DW_TAG_member
    1040                      .dwattr $C$DW$186, DW_AT_type(*$C$DW$T$37)
    1041                      .dwattr $C$DW$186, DW_AT_name("y1")
    1042                      .dwattr $C$DW$186, DW_AT_TI_symbol_name("_y1")
    1043                      .dwattr $C$DW$186, DW_AT_data_member_location[DW_OP_plus_uconst 0x8]
    1044                      .dwattr $C$DW$186, DW_AT_accessibility(DW_ACCESS_public)
    1045                      .dwendtag $C$DW$T$57
    1046              
    1047              $C$DW$T$140     .dwtag  DW_TAG_typedef, DW_AT_name("FILTER_FO_Obj")
    1048                      .dwattr $C$DW$T$140, DW_AT_type(*$C$DW$T$57)
    1049                      .dwattr $C$DW$T$140, DW_AT_language(DW_LANG_C)
    1050              
    1051              $C$DW$T$21      .dwtag  DW_TAG_structure_type
    1052                      .dwattr $C$DW$T$21, DW_AT_name("_FILTER_FO_Obj_")
    1053                      .dwattr $C$DW$T$21, DW_AT_declaration
    1054                      .dwendtag $C$DW$T$21
    1055              
    1056              $C$DW$T$141     .dwtag  DW_TAG_pointer_type
    1057                      .dwattr $C$DW$T$141, DW_AT_type(*$C$DW$T$21)
    1058                      .dwattr $C$DW$T$141, DW_AT_address_class(0x16)
    1059              $C$DW$T$142     .dwtag  DW_TAG_typedef, DW_AT_name("FILTER_FO_Handle")
    1060                      .dwattr $C$DW$T$142, DW_AT_type(*$C$DW$T$141)
    1061                      .dwattr $C$DW$T$142, DW_AT_language(DW_LANG_C)
    1062              
    1063              $C$DW$T$58      .dwtag  DW_TAG_structure_type
    1064                      .dwattr $C$DW$T$58, DW_AT_name("_FLASH_Obj_")
    1065                      .dwattr $C$DW$T$58, DW_AT_byte_size(0x08)
    1066              $C$DW$187       .dwtag  DW_TAG_member
    1067                      .dwattr $C$DW$187, DW_AT_type(*$C$DW$T$24)
    1068                      .dwattr $C$DW$187, DW_AT_name("FOPT")
    1069                      .dwattr $C$DW$187, DW_AT_TI_symbol_name("_FOPT")
    1070                      .dwattr $C$DW$187, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    1071                      .dwattr $C$DW$187, DW_AT_accessibility(DW_ACCESS_public)
    1072              $C$DW$188       .dwtag  DW_TAG_member
    1073                      .dwattr $C$DW$188, DW_AT_type(*$C$DW$T$24)
    1074                      .dwattr $C$DW$188, DW_AT_name("rsvd_1")
    1075                      .dwattr $C$DW$188, DW_AT_TI_symbol_name("_rsvd_1")
    1076                      .dwattr $C$DW$188, DW_AT_data_member_location[DW_OP_plus_uconst 0x1]
    1077                      .dwattr $C$DW$188, DW_AT_accessibility(DW_ACCESS_public)
    1078              $C$DW$189       .dwtag  DW_TAG_member
    1079                      .dwattr $C$DW$189, DW_AT_type(*$C$DW$T$24)
    1080                      .dwattr $C$DW$189, DW_AT_name("FPWR")
    1081                      .dwattr $C$DW$189, DW_AT_TI_symbol_name("_FPWR")
    1082                      .dwattr $C$DW$189, DW_AT_data_member_location[DW_OP_plus_uconst 0x2]
    1083                      .dwattr $C$DW$189, DW_AT_accessibility(DW_ACCESS_public)
    1084              $C$DW$190       .dwtag  DW_TAG_member
    1085                      .dwattr $C$DW$190, DW_AT_type(*$C$DW$T$24)
    1086                      .dwattr $C$DW$190, DW_AT_name("FSTATUS")
    1087                      .dwattr $C$DW$190, DW_AT_TI_symbol_name("_FSTATUS")
    1088                      .dwattr $C$DW$190, DW_AT_data_member_location[DW_OP_plus_uconst 0x3]
    1089                      .dwattr $C$DW$190, DW_AT_accessibility(DW_ACCESS_public)
    1090              $C$DW$191       .dwtag  DW_TAG_member
    1091                      .dwattr $C$DW$191, DW_AT_type(*$C$DW$T$24)
TMS320C2000 Assembler PC v6.2.5 Tue Aug 29 10:13:49 2017

Tools Copyright (c) 1996-2014 Texas Instruments Incorporated
C:\Users\wmj\AppData\Local\Temp\0884811                              PAGE   21

    1092                      .dwattr $C$DW$191, DW_AT_name("FSTDBYWAIT")
    1093                      .dwattr $C$DW$191, DW_AT_TI_symbol_name("_FSTDBYWAIT")
    1094                      .dwattr $C$DW$191, DW_AT_data_member_location[DW_OP_plus_uconst 0x4]
    1095                      .dwattr $C$DW$191, DW_AT_accessibility(DW_ACCESS_public)
    1096              $C$DW$192       .dwtag  DW_TAG_member
    1097                      .dwattr $C$DW$192, DW_AT_type(*$C$DW$T$24)
    1098                      .dwattr $C$DW$192, DW_AT_name("FACTIVEWAIT")
    1099                      .dwattr $C$DW$192, DW_AT_TI_symbol_name("_FACTIVEWAIT")
    1100                      .dwattr $C$DW$192, DW_AT_data_member_location[DW_OP_plus_uconst 0x5]
    1101                      .dwattr $C$DW$192, DW_AT_accessibility(DW_ACCESS_public)
    1102              $C$DW$193       .dwtag  DW_TAG_member
    1103                      .dwattr $C$DW$193, DW_AT_type(*$C$DW$T$24)
    1104                      .dwattr $C$DW$193, DW_AT_name("FBANKWAIT")
    1105                      .dwattr $C$DW$193, DW_AT_TI_symbol_name("_FBANKWAIT")
    1106                      .dwattr $C$DW$193, DW_AT_data_member_location[DW_OP_plus_uconst 0x6]
    1107                      .dwattr $C$DW$193, DW_AT_accessibility(DW_ACCESS_public)
    1108              $C$DW$194       .dwtag  DW_TAG_member
    1109                      .dwattr $C$DW$194, DW_AT_type(*$C$DW$T$24)
    1110                      .dwattr $C$DW$194, DW_AT_name("FOTPWAIT")
    1111                      .dwattr $C$DW$194, DW_AT_TI_symbol_name("_FOTPWAIT")
    1112                      .dwattr $C$DW$194, DW_AT_data_member_location[DW_OP_plus_uconst 0x7]
    1113                      .dwattr $C$DW$194, DW_AT_accessibility(DW_ACCESS_public)
    1114                      .dwendtag $C$DW$T$58
    1115              
    1116              $C$DW$T$72      .dwtag  DW_TAG_pointer_type
    1117                      .dwattr $C$DW$T$72, DW_AT_type(*$C$DW$T$58)
    1118                      .dwattr $C$DW$T$72, DW_AT_address_class(0x16)
    1119              $C$DW$T$73      .dwtag  DW_TAG_typedef, DW_AT_name("FLASH_Handle")
    1120                      .dwattr $C$DW$T$73, DW_AT_type(*$C$DW$T$72)
    1121                      .dwattr $C$DW$T$73, DW_AT_language(DW_LANG_C)
    1122              
    1123              $C$DW$T$63      .dwtag  DW_TAG_structure_type
    1124                      .dwattr $C$DW$T$63, DW_AT_name("_GPIO_Obj_")
    1125                      .dwattr $C$DW$T$63, DW_AT_byte_size(0x6a)
    1126              $C$DW$195       .dwtag  DW_TAG_member
    1127                      .dwattr $C$DW$195, DW_AT_type(*$C$DW$T$60)
    1128                      .dwattr $C$DW$195, DW_AT_name("GPACTRL")
    1129                      .dwattr $C$DW$195, DW_AT_TI_symbol_name("_GPACTRL")
    1130                      .dwattr $C$DW$195, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    1131                      .dwattr $C$DW$195, DW_AT_accessibility(DW_ACCESS_public)
    1132              $C$DW$196       .dwtag  DW_TAG_member
    1133                      .dwattr $C$DW$196, DW_AT_type(*$C$DW$T$60)
    1134                      .dwattr $C$DW$196, DW_AT_name("GPAQSEL1")
    1135                      .dwattr $C$DW$196, DW_AT_TI_symbol_name("_GPAQSEL1")
    1136                      .dwattr $C$DW$196, DW_AT_data_member_location[DW_OP_plus_uconst 0x2]
    1137                      .dwattr $C$DW$196, DW_AT_accessibility(DW_ACCESS_public)
    1138              $C$DW$197       .dwtag  DW_TAG_member
    1139                      .dwattr $C$DW$197, DW_AT_type(*$C$DW$T$60)
    1140                      .dwattr $C$DW$197, DW_AT_name("GPAQSEL2")
    1141                      .dwattr $C$DW$197, DW_AT_TI_symbol_name("_GPAQSEL2")
    1142                      .dwattr $C$DW$197, DW_AT_data_member_location[DW_OP_plus_uconst 0x4]
    1143                      .dwattr $C$DW$197, DW_AT_accessibility(DW_ACCESS_public)
    1144              $C$DW$198       .dwtag  DW_TAG_member
    1145                      .dwattr $C$DW$198, DW_AT_type(*$C$DW$T$60)
    1146                      .dwattr $C$DW$198, DW_AT_name("GPAMUX1")
TMS320C2000 Assembler PC v6.2.5 Tue Aug 29 10:13:49 2017

Tools Copyright (c) 1996-2014 Texas Instruments Incorporated
C:\Users\wmj\AppData\Local\Temp\0884811                              PAGE   22

    1147                      .dwattr $C$DW$198, DW_AT_TI_symbol_name("_GPAMUX1")
    1148                      .dwattr $C$DW$198, DW_AT_data_member_location[DW_OP_plus_uconst 0x6]
    1149                      .dwattr $C$DW$198, DW_AT_accessibility(DW_ACCESS_public)
    1150              $C$DW$199       .dwtag  DW_TAG_member
    1151                      .dwattr $C$DW$199, DW_AT_type(*$C$DW$T$60)
    1152                      .dwattr $C$DW$199, DW_AT_name("GPAMUX2")
    1153                      .dwattr $C$DW$199, DW_AT_TI_symbol_name("_GPAMUX2")
    1154                      .dwattr $C$DW$199, DW_AT_data_member_location[DW_OP_plus_uconst 0x8]
    1155                      .dwattr $C$DW$199, DW_AT_accessibility(DW_ACCESS_public)
    1156              $C$DW$200       .dwtag  DW_TAG_member
    1157                      .dwattr $C$DW$200, DW_AT_type(*$C$DW$T$60)
    1158                      .dwattr $C$DW$200, DW_AT_name("GPADIR")
    1159                      .dwattr $C$DW$200, DW_AT_TI_symbol_name("_GPADIR")
    1160                      .dwattr $C$DW$200, DW_AT_data_member_location[DW_OP_plus_uconst 0xa]
    1161                      .dwattr $C$DW$200, DW_AT_accessibility(DW_ACCESS_public)
    1162              $C$DW$201       .dwtag  DW_TAG_member
    1163                      .dwattr $C$DW$201, DW_AT_type(*$C$DW$T$60)
    1164                      .dwattr $C$DW$201, DW_AT_name("GPAPUD")
    1165                      .dwattr $C$DW$201, DW_AT_TI_symbol_name("_GPAPUD")
    1166                      .dwattr $C$DW$201, DW_AT_data_member_location[DW_OP_plus_uconst 0xc]
    1167                      .dwattr $C$DW$201, DW_AT_accessibility(DW_ACCESS_public)
    1168              $C$DW$202       .dwtag  DW_TAG_member
    1169                      .dwattr $C$DW$202, DW_AT_type(*$C$DW$T$27)
    1170                      .dwattr $C$DW$202, DW_AT_name("rsvd_1")
    1171                      .dwattr $C$DW$202, DW_AT_TI_symbol_name("_rsvd_1")
    1172                      .dwattr $C$DW$202, DW_AT_data_member_location[DW_OP_plus_uconst 0xe]
    1173                      .dwattr $C$DW$202, DW_AT_accessibility(DW_ACCESS_public)
    1174              $C$DW$203       .dwtag  DW_TAG_member
    1175                      .dwattr $C$DW$203, DW_AT_type(*$C$DW$T$60)
    1176                      .dwattr $C$DW$203, DW_AT_name("GPBCTRL")
    1177                      .dwattr $C$DW$203, DW_AT_TI_symbol_name("_GPBCTRL")
    1178                      .dwattr $C$DW$203, DW_AT_data_member_location[DW_OP_plus_uconst 0x10]
    1179                      .dwattr $C$DW$203, DW_AT_accessibility(DW_ACCESS_public)
    1180              $C$DW$204       .dwtag  DW_TAG_member
    1181                      .dwattr $C$DW$204, DW_AT_type(*$C$DW$T$60)
    1182                      .dwattr $C$DW$204, DW_AT_name("GPBQSEL1")
    1183                      .dwattr $C$DW$204, DW_AT_TI_symbol_name("_GPBQSEL1")
    1184                      .dwattr $C$DW$204, DW_AT_data_member_location[DW_OP_plus_uconst 0x12]
    1185                      .dwattr $C$DW$204, DW_AT_accessibility(DW_ACCESS_public)
    1186              $C$DW$205       .dwtag  DW_TAG_member
    1187                      .dwattr $C$DW$205, DW_AT_type(*$C$DW$T$27)
    1188                      .dwattr $C$DW$205, DW_AT_name("rsvd_2")
    1189                      .dwattr $C$DW$205, DW_AT_TI_symbol_name("_rsvd_2")
    1190                      .dwattr $C$DW$205, DW_AT_data_member_location[DW_OP_plus_uconst 0x14]
    1191                      .dwattr $C$DW$205, DW_AT_accessibility(DW_ACCESS_public)
    1192              $C$DW$206       .dwtag  DW_TAG_member
    1193                      .dwattr $C$DW$206, DW_AT_type(*$C$DW$T$60)
    1194                      .dwattr $C$DW$206, DW_AT_name("GPBMUX1")
    1195                      .dwattr $C$DW$206, DW_AT_TI_symbol_name("_GPBMUX1")
    1196                      .dwattr $C$DW$206, DW_AT_data_member_location[DW_OP_plus_uconst 0x16]
    1197                      .dwattr $C$DW$206, DW_AT_accessibility(DW_ACCESS_public)
    1198              $C$DW$207       .dwtag  DW_TAG_member
    1199                      .dwattr $C$DW$207, DW_AT_type(*$C$DW$T$27)
    1200                      .dwattr $C$DW$207, DW_AT_name("rsvd_3")
    1201                      .dwattr $C$DW$207, DW_AT_TI_symbol_name("_rsvd_3")
TMS320C2000 Assembler PC v6.2.5 Tue Aug 29 10:13:49 2017

Tools Copyright (c) 1996-2014 Texas Instruments Incorporated
C:\Users\wmj\AppData\Local\Temp\0884811                              PAGE   23

    1202                      .dwattr $C$DW$207, DW_AT_data_member_location[DW_OP_plus_uconst 0x18]
    1203                      .dwattr $C$DW$207, DW_AT_accessibility(DW_ACCESS_public)
    1204              $C$DW$208       .dwtag  DW_TAG_member
    1205                      .dwattr $C$DW$208, DW_AT_type(*$C$DW$T$60)
    1206                      .dwattr $C$DW$208, DW_AT_name("GPBDIR")
    1207                      .dwattr $C$DW$208, DW_AT_TI_symbol_name("_GPBDIR")
    1208                      .dwattr $C$DW$208, DW_AT_data_member_location[DW_OP_plus_uconst 0x1a]
    1209                      .dwattr $C$DW$208, DW_AT_accessibility(DW_ACCESS_public)
    1210              $C$DW$209       .dwtag  DW_TAG_member
    1211                      .dwattr $C$DW$209, DW_AT_type(*$C$DW$T$60)
    1212                      .dwattr $C$DW$209, DW_AT_name("GPBPUD")
    1213                      .dwattr $C$DW$209, DW_AT_TI_symbol_name("_GPBPUD")
    1214                      .dwattr $C$DW$209, DW_AT_data_member_location[DW_OP_plus_uconst 0x1c]
    1215                      .dwattr $C$DW$209, DW_AT_accessibility(DW_ACCESS_public)
    1216              $C$DW$210       .dwtag  DW_TAG_member
    1217                      .dwattr $C$DW$210, DW_AT_type(*$C$DW$T$61)
    1218                      .dwattr $C$DW$210, DW_AT_name("rsvd_4")
    1219                      .dwattr $C$DW$210, DW_AT_TI_symbol_name("_rsvd_4")
    1220                      .dwattr $C$DW$210, DW_AT_data_member_location[DW_OP_plus_uconst 0x1e]
    1221                      .dwattr $C$DW$210, DW_AT_accessibility(DW_ACCESS_public)
    1222              $C$DW$211       .dwtag  DW_TAG_member
    1223                      .dwattr $C$DW$211, DW_AT_type(*$C$DW$T$60)
    1224                      .dwattr $C$DW$211, DW_AT_name("AIOMUX1")
    1225                      .dwattr $C$DW$211, DW_AT_TI_symbol_name("_AIOMUX1")
    1226                      .dwattr $C$DW$211, DW_AT_data_member_location[DW_OP_plus_uconst 0x36]
    1227                      .dwattr $C$DW$211, DW_AT_accessibility(DW_ACCESS_public)
    1228              $C$DW$212       .dwtag  DW_TAG_member
    1229                      .dwattr $C$DW$212, DW_AT_type(*$C$DW$T$27)
    1230                      .dwattr $C$DW$212, DW_AT_name("rsvd_5")
    1231                      .dwattr $C$DW$212, DW_AT_TI_symbol_name("_rsvd_5")
    1232                      .dwattr $C$DW$212, DW_AT_data_member_location[DW_OP_plus_uconst 0x38]
    1233                      .dwattr $C$DW$212, DW_AT_accessibility(DW_ACCESS_public)
    1234              $C$DW$213       .dwtag  DW_TAG_member
    1235                      .dwattr $C$DW$213, DW_AT_type(*$C$DW$T$60)
    1236                      .dwattr $C$DW$213, DW_AT_name("AIODIR")
    1237                      .dwattr $C$DW$213, DW_AT_TI_symbol_name("_AIODIR")
    1238                      .dwattr $C$DW$213, DW_AT_data_member_location[DW_OP_plus_uconst 0x3a]
    1239                      .dwattr $C$DW$213, DW_AT_accessibility(DW_ACCESS_public)
    1240              $C$DW$214       .dwtag  DW_TAG_member
    1241                      .dwattr $C$DW$214, DW_AT_type(*$C$DW$T$62)
    1242                      .dwattr $C$DW$214, DW_AT_name("rsvd_6")
    1243                      .dwattr $C$DW$214, DW_AT_TI_symbol_name("_rsvd_6")
    1244                      .dwattr $C$DW$214, DW_AT_data_member_location[DW_OP_plus_uconst 0x3c]
    1245                      .dwattr $C$DW$214, DW_AT_accessibility(DW_ACCESS_public)
    1246              $C$DW$215       .dwtag  DW_TAG_member
    1247                      .dwattr $C$DW$215, DW_AT_type(*$C$DW$T$60)
    1248                      .dwattr $C$DW$215, DW_AT_name("GPADAT")
    1249                      .dwattr $C$DW$215, DW_AT_TI_symbol_name("_GPADAT")
    1250                      .dwattr $C$DW$215, DW_AT_data_member_location[DW_OP_plus_uconst 0x40]
    1251                      .dwattr $C$DW$215, DW_AT_accessibility(DW_ACCESS_public)
    1252              $C$DW$216       .dwtag  DW_TAG_member
    1253                      .dwattr $C$DW$216, DW_AT_type(*$C$DW$T$60)
    1254                      .dwattr $C$DW$216, DW_AT_name("GPASET")
    1255                      .dwattr $C$DW$216, DW_AT_TI_symbol_name("_GPASET")
    1256                      .dwattr $C$DW$216, DW_AT_data_member_location[DW_OP_plus_uconst 0x42]
TMS320C2000 Assembler PC v6.2.5 Tue Aug 29 10:13:49 2017

Tools Copyright (c) 1996-2014 Texas Instruments Incorporated
C:\Users\wmj\AppData\Local\Temp\0884811                              PAGE   24

    1257                      .dwattr $C$DW$216, DW_AT_accessibility(DW_ACCESS_public)
    1258              $C$DW$217       .dwtag  DW_TAG_member
    1259                      .dwattr $C$DW$217, DW_AT_type(*$C$DW$T$60)
    1260                      .dwattr $C$DW$217, DW_AT_name("GPACLEAR")
    1261                      .dwattr $C$DW$217, DW_AT_TI_symbol_name("_GPACLEAR")
    1262                      .dwattr $C$DW$217, DW_AT_data_member_location[DW_OP_plus_uconst 0x44]
    1263                      .dwattr $C$DW$217, DW_AT_accessibility(DW_ACCESS_public)
    1264              $C$DW$218       .dwtag  DW_TAG_member
    1265                      .dwattr $C$DW$218, DW_AT_type(*$C$DW$T$60)
    1266                      .dwattr $C$DW$218, DW_AT_name("GPATOGGLE")
    1267                      .dwattr $C$DW$218, DW_AT_TI_symbol_name("_GPATOGGLE")
    1268                      .dwattr $C$DW$218, DW_AT_data_member_location[DW_OP_plus_uconst 0x46]
    1269                      .dwattr $C$DW$218, DW_AT_accessibility(DW_ACCESS_public)
    1270              $C$DW$219       .dwtag  DW_TAG_member
    1271                      .dwattr $C$DW$219, DW_AT_type(*$C$DW$T$60)
    1272                      .dwattr $C$DW$219, DW_AT_name("GPBDAT")
    1273                      .dwattr $C$DW$219, DW_AT_TI_symbol_name("_GPBDAT")
    1274                      .dwattr $C$DW$219, DW_AT_data_member_location[DW_OP_plus_uconst 0x48]
    1275                      .dwattr $C$DW$219, DW_AT_accessibility(DW_ACCESS_public)
    1276              $C$DW$220       .dwtag  DW_TAG_member
    1277                      .dwattr $C$DW$220, DW_AT_type(*$C$DW$T$60)
    1278                      .dwattr $C$DW$220, DW_AT_name("GPBSET")
    1279                      .dwattr $C$DW$220, DW_AT_TI_symbol_name("_GPBSET")
    1280                      .dwattr $C$DW$220, DW_AT_data_member_location[DW_OP_plus_uconst 0x4a]
    1281                      .dwattr $C$DW$220, DW_AT_accessibility(DW_ACCESS_public)
    1282              $C$DW$221       .dwtag  DW_TAG_member
    1283                      .dwattr $C$DW$221, DW_AT_type(*$C$DW$T$60)
    1284                      .dwattr $C$DW$221, DW_AT_name("GPBCLEAR")
    1285                      .dwattr $C$DW$221, DW_AT_TI_symbol_name("_GPBCLEAR")
    1286                      .dwattr $C$DW$221, DW_AT_data_member_location[DW_OP_plus_uconst 0x4c]
    1287                      .dwattr $C$DW$221, DW_AT_accessibility(DW_ACCESS_public)
    1288              $C$DW$222       .dwtag  DW_TAG_member
    1289                      .dwattr $C$DW$222, DW_AT_type(*$C$DW$T$60)
    1290                      .dwattr $C$DW$222, DW_AT_name("GPBTOGGLE")
    1291                      .dwattr $C$DW$222, DW_AT_TI_symbol_name("_GPBTOGGLE")
    1292                      .dwattr $C$DW$222, DW_AT_data_member_location[DW_OP_plus_uconst 0x4e]
    1293                      .dwattr $C$DW$222, DW_AT_accessibility(DW_ACCESS_public)
    1294              $C$DW$223       .dwtag  DW_TAG_member
    1295                      .dwattr $C$DW$223, DW_AT_type(*$C$DW$T$45)
    1296                      .dwattr $C$DW$223, DW_AT_name("rsvd_7")
    1297                      .dwattr $C$DW$223, DW_AT_TI_symbol_name("_rsvd_7")
    1298                      .dwattr $C$DW$223, DW_AT_data_member_location[DW_OP_plus_uconst 0x50]
    1299                      .dwattr $C$DW$223, DW_AT_accessibility(DW_ACCESS_public)
    1300              $C$DW$224       .dwtag  DW_TAG_member
    1301                      .dwattr $C$DW$224, DW_AT_type(*$C$DW$T$60)
    1302                      .dwattr $C$DW$224, DW_AT_name("AIODAT")
    1303                      .dwattr $C$DW$224, DW_AT_TI_symbol_name("_AIODAT")
    1304                      .dwattr $C$DW$224, DW_AT_data_member_location[DW_OP_plus_uconst 0x58]
    1305                      .dwattr $C$DW$224, DW_AT_accessibility(DW_ACCESS_public)
    1306              $C$DW$225       .dwtag  DW_TAG_member
    1307                      .dwattr $C$DW$225, DW_AT_type(*$C$DW$T$60)
    1308                      .dwattr $C$DW$225, DW_AT_name("AIOSET")
    1309                      .dwattr $C$DW$225, DW_AT_TI_symbol_name("_AIOSET")
    1310                      .dwattr $C$DW$225, DW_AT_data_member_location[DW_OP_plus_uconst 0x5a]
    1311                      .dwattr $C$DW$225, DW_AT_accessibility(DW_ACCESS_public)
TMS320C2000 Assembler PC v6.2.5 Tue Aug 29 10:13:49 2017

Tools Copyright (c) 1996-2014 Texas Instruments Incorporated
C:\Users\wmj\AppData\Local\Temp\0884811                              PAGE   25

    1312              $C$DW$226       .dwtag  DW_TAG_member
    1313                      .dwattr $C$DW$226, DW_AT_type(*$C$DW$T$60)
    1314                      .dwattr $C$DW$226, DW_AT_name("AIOCLEAR")
    1315                      .dwattr $C$DW$226, DW_AT_TI_symbol_name("_AIOCLEAR")
    1316                      .dwattr $C$DW$226, DW_AT_data_member_location[DW_OP_plus_uconst 0x5c]
    1317                      .dwattr $C$DW$226, DW_AT_accessibility(DW_ACCESS_public)
    1318              $C$DW$227       .dwtag  DW_TAG_member
    1319                      .dwattr $C$DW$227, DW_AT_type(*$C$DW$T$60)
    1320                      .dwattr $C$DW$227, DW_AT_name("AIOTOGGLE")
    1321                      .dwattr $C$DW$227, DW_AT_TI_symbol_name("_AIOTOGGLE")
    1322                      .dwattr $C$DW$227, DW_AT_data_member_location[DW_OP_plus_uconst 0x5e]
    1323                      .dwattr $C$DW$227, DW_AT_accessibility(DW_ACCESS_public)
    1324              $C$DW$228       .dwtag  DW_TAG_member
    1325                      .dwattr $C$DW$228, DW_AT_type(*$C$DW$T$29)
    1326                      .dwattr $C$DW$228, DW_AT_name("GPIOXINTnSEL")
    1327                      .dwattr $C$DW$228, DW_AT_TI_symbol_name("_GPIOXINTnSEL")
    1328                      .dwattr $C$DW$228, DW_AT_data_member_location[DW_OP_plus_uconst 0x60]
    1329                      .dwattr $C$DW$228, DW_AT_accessibility(DW_ACCESS_public)
    1330              $C$DW$229       .dwtag  DW_TAG_member
    1331                      .dwattr $C$DW$229, DW_AT_type(*$C$DW$T$28)
    1332                      .dwattr $C$DW$229, DW_AT_name("rsvd_8")
    1333                      .dwattr $C$DW$229, DW_AT_TI_symbol_name("_rsvd_8")
    1334                      .dwattr $C$DW$229, DW_AT_data_member_location[DW_OP_plus_uconst 0x63]
    1335                      .dwattr $C$DW$229, DW_AT_accessibility(DW_ACCESS_public)
    1336              $C$DW$230       .dwtag  DW_TAG_member
    1337                      .dwattr $C$DW$230, DW_AT_type(*$C$DW$T$60)
    1338                      .dwattr $C$DW$230, DW_AT_name("GPIOLPMSEL")
    1339                      .dwattr $C$DW$230, DW_AT_TI_symbol_name("_GPIOLPMSEL")
    1340                      .dwattr $C$DW$230, DW_AT_data_member_location[DW_OP_plus_uconst 0x68]
    1341                      .dwattr $C$DW$230, DW_AT_accessibility(DW_ACCESS_public)
    1342                      .dwendtag $C$DW$T$63
    1343              
    1344              $C$DW$T$51      .dwtag  DW_TAG_pointer_type
    1345                      .dwattr $C$DW$T$51, DW_AT_type(*$C$DW$T$63)
    1346                      .dwattr $C$DW$T$51, DW_AT_address_class(0x16)
    1347              $C$DW$T$52      .dwtag  DW_TAG_typedef, DW_AT_name("GPIO_Handle")
    1348                      .dwattr $C$DW$T$52, DW_AT_type(*$C$DW$T$51)
    1349                      .dwattr $C$DW$T$52, DW_AT_language(DW_LANG_C)
    1350              
    1351              $C$DW$T$65      .dwtag  DW_TAG_structure_type
    1352                      .dwattr $C$DW$T$65, DW_AT_name("_HAL_AdcData_t_")
    1353                      .dwattr $C$DW$T$65, DW_AT_byte_size(0x16)
    1354              $C$DW$231       .dwtag  DW_TAG_member
    1355                      .dwattr $C$DW$231, DW_AT_type(*$C$DW$T$64)
    1356                      .dwattr $C$DW$231, DW_AT_name("I")
    1357                      .dwattr $C$DW$231, DW_AT_TI_symbol_name("_I")
    1358                      .dwattr $C$DW$231, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    1359                      .dwattr $C$DW$231, DW_AT_accessibility(DW_ACCESS_public)
    1360              $C$DW$232       .dwtag  DW_TAG_member
    1361                      .dwattr $C$DW$232, DW_AT_type(*$C$DW$T$64)
    1362                      .dwattr $C$DW$232, DW_AT_name("V")
    1363                      .dwattr $C$DW$232, DW_AT_TI_symbol_name("_V")
    1364                      .dwattr $C$DW$232, DW_AT_data_member_location[DW_OP_plus_uconst 0x6]
    1365                      .dwattr $C$DW$232, DW_AT_accessibility(DW_ACCESS_public)
    1366              $C$DW$233       .dwtag  DW_TAG_member
TMS320C2000 Assembler PC v6.2.5 Tue Aug 29 10:13:49 2017

Tools Copyright (c) 1996-2014 Texas Instruments Incorporated
C:\Users\wmj\AppData\Local\Temp\0884811                              PAGE   26

    1367                      .dwattr $C$DW$233, DW_AT_type(*$C$DW$T$37)
    1368                      .dwattr $C$DW$233, DW_AT_name("dcBus")
    1369                      .dwattr $C$DW$233, DW_AT_TI_symbol_name("_dcBus")
    1370                      .dwattr $C$DW$233, DW_AT_data_member_location[DW_OP_plus_uconst 0xc]
    1371                      .dwattr $C$DW$233, DW_AT_accessibility(DW_ACCESS_public)
    1372              $C$DW$234       .dwtag  DW_TAG_member
    1373                      .dwattr $C$DW$234, DW_AT_type(*$C$DW$T$37)
    1374                      .dwattr $C$DW$234, DW_AT_name("analogSensor1")
    1375                      .dwattr $C$DW$234, DW_AT_TI_symbol_name("_analogSensor1")
    1376                      .dwattr $C$DW$234, DW_AT_data_member_location[DW_OP_plus_uconst 0xe]
    1377                      .dwattr $C$DW$234, DW_AT_accessibility(DW_ACCESS_public)
    1378              $C$DW$235       .dwtag  DW_TAG_member
    1379                      .dwattr $C$DW$235, DW_AT_type(*$C$DW$T$37)
    1380                      .dwattr $C$DW$235, DW_AT_name("analogSensor2")
    1381                      .dwattr $C$DW$235, DW_AT_TI_symbol_name("_analogSensor2")
    1382                      .dwattr $C$DW$235, DW_AT_data_member_location[DW_OP_plus_uconst 0x10]
    1383                      .dwattr $C$DW$235, DW_AT_accessibility(DW_ACCESS_public)
    1384              $C$DW$236       .dwtag  DW_TAG_member
    1385                      .dwattr $C$DW$236, DW_AT_type(*$C$DW$T$37)
    1386                      .dwattr $C$DW$236, DW_AT_name("igbtNTC")
    1387                      .dwattr $C$DW$236, DW_AT_TI_symbol_name("_igbtNTC")
    1388                      .dwattr $C$DW$236, DW_AT_data_member_location[DW_OP_plus_uconst 0x12]
    1389                      .dwattr $C$DW$236, DW_AT_accessibility(DW_ACCESS_public)
    1390              $C$DW$237       .dwtag  DW_TAG_member
    1391                      .dwattr $C$DW$237, DW_AT_type(*$C$DW$T$37)
    1392                      .dwattr $C$DW$237, DW_AT_name("boardAddr")
    1393                      .dwattr $C$DW$237, DW_AT_TI_symbol_name("_boardAddr")
    1394                      .dwattr $C$DW$237, DW_AT_data_member_location[DW_OP_plus_uconst 0x14]
    1395                      .dwattr $C$DW$237, DW_AT_accessibility(DW_ACCESS_public)
    1396                      .dwendtag $C$DW$T$65
    1397              
    1398              $C$DW$T$99      .dwtag  DW_TAG_typedef, DW_AT_name("HAL_AdcData_t")
    1399                      .dwattr $C$DW$T$99, DW_AT_type(*$C$DW$T$65)
    1400                      .dwattr $C$DW$T$99, DW_AT_language(DW_LANG_C)
    1401              
    1402              $C$DW$T$100     .dwtag  DW_TAG_structure_type
    1403                      .dwattr $C$DW$T$100, DW_AT_name("_HAL_Obj_")
    1404                      .dwattr $C$DW$T$100, DW_AT_byte_size(0xb4)
    1405              $C$DW$238       .dwtag  DW_TAG_member
    1406                      .dwattr $C$DW$238, DW_AT_type(*$C$DW$T$67)
    1407                      .dwattr $C$DW$238, DW_AT_name("adcHandle")
    1408                      .dwattr $C$DW$238, DW_AT_TI_symbol_name("_adcHandle")
    1409                      .dwattr $C$DW$238, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    1410                      .dwattr $C$DW$238, DW_AT_accessibility(DW_ACCESS_public)
    1411              $C$DW$239       .dwtag  DW_TAG_member
    1412                      .dwattr $C$DW$239, DW_AT_type(*$C$DW$T$69)
    1413                      .dwattr $C$DW$239, DW_AT_name("clkHandle")
    1414                      .dwattr $C$DW$239, DW_AT_TI_symbol_name("_clkHandle")
    1415                      .dwattr $C$DW$239, DW_AT_data_member_location[DW_OP_plus_uconst 0x2]
    1416                      .dwattr $C$DW$239, DW_AT_accessibility(DW_ACCESS_public)
    1417              $C$DW$240       .dwtag  DW_TAG_member
    1418                      .dwattr $C$DW$240, DW_AT_type(*$C$DW$T$71)
    1419                      .dwattr $C$DW$240, DW_AT_name("cpuHandle")
    1420                      .dwattr $C$DW$240, DW_AT_TI_symbol_name("_cpuHandle")
    1421                      .dwattr $C$DW$240, DW_AT_data_member_location[DW_OP_plus_uconst 0x4]
TMS320C2000 Assembler PC v6.2.5 Tue Aug 29 10:13:49 2017

Tools Copyright (c) 1996-2014 Texas Instruments Incorporated
C:\Users\wmj\AppData\Local\Temp\0884811                              PAGE   27

    1422                      .dwattr $C$DW$240, DW_AT_accessibility(DW_ACCESS_public)
    1423              $C$DW$241       .dwtag  DW_TAG_member
    1424                      .dwattr $C$DW$241, DW_AT_type(*$C$DW$T$73)
    1425                      .dwattr $C$DW$241, DW_AT_name("flashHandle")
    1426                      .dwattr $C$DW$241, DW_AT_TI_symbol_name("_flashHandle")
    1427                      .dwattr $C$DW$241, DW_AT_data_member_location[DW_OP_plus_uconst 0x6]
    1428                      .dwattr $C$DW$241, DW_AT_accessibility(DW_ACCESS_public)
    1429              $C$DW$242       .dwtag  DW_TAG_member
    1430                      .dwattr $C$DW$242, DW_AT_type(*$C$DW$T$52)
    1431                      .dwattr $C$DW$242, DW_AT_name("gpioHandle")
    1432                      .dwattr $C$DW$242, DW_AT_TI_symbol_name("_gpioHandle")
    1433                      .dwattr $C$DW$242, DW_AT_data_member_location[DW_OP_plus_uconst 0x8]
    1434                      .dwattr $C$DW$242, DW_AT_accessibility(DW_ACCESS_public)
    1435              $C$DW$243       .dwtag  DW_TAG_member
    1436                      .dwattr $C$DW$243, DW_AT_type(*$C$DW$T$76)
    1437                      .dwattr $C$DW$243, DW_AT_name("offsetHandle_I")
    1438                      .dwattr $C$DW$243, DW_AT_TI_symbol_name("_offsetHandle_I")
    1439                      .dwattr $C$DW$243, DW_AT_data_member_location[DW_OP_plus_uconst 0xa]
    1440                      .dwattr $C$DW$243, DW_AT_accessibility(DW_ACCESS_public)
    1441              $C$DW$244       .dwtag  DW_TAG_member
    1442                      .dwattr $C$DW$244, DW_AT_type(*$C$DW$T$78)
    1443                      .dwattr $C$DW$244, DW_AT_name("offset_I")
    1444                      .dwattr $C$DW$244, DW_AT_TI_symbol_name("_offset_I")
    1445                      .dwattr $C$DW$244, DW_AT_data_member_location[DW_OP_plus_uconst 0x10]
    1446                      .dwattr $C$DW$244, DW_AT_accessibility(DW_ACCESS_public)
    1447              $C$DW$245       .dwtag  DW_TAG_member
    1448                      .dwattr $C$DW$245, DW_AT_type(*$C$DW$T$76)
    1449                      .dwattr $C$DW$245, DW_AT_name("offsetHandle_V")
    1450                      .dwattr $C$DW$245, DW_AT_TI_symbol_name("_offsetHandle_V")
    1451                      .dwattr $C$DW$245, DW_AT_data_member_location[DW_OP_plus_uconst 0x40]
    1452                      .dwattr $C$DW$245, DW_AT_accessibility(DW_ACCESS_public)
    1453              $C$DW$246       .dwtag  DW_TAG_member
    1454                      .dwattr $C$DW$246, DW_AT_type(*$C$DW$T$78)
    1455                      .dwattr $C$DW$246, DW_AT_name("offset_V")
    1456                      .dwattr $C$DW$246, DW_AT_TI_symbol_name("_offset_V")
    1457                      .dwattr $C$DW$246, DW_AT_data_member_location[DW_OP_plus_uconst 0x46]
    1458                      .dwattr $C$DW$246, DW_AT_accessibility(DW_ACCESS_public)
    1459              $C$DW$247       .dwtag  DW_TAG_member
    1460                      .dwattr $C$DW$247, DW_AT_type(*$C$DW$T$80)
    1461                      .dwattr $C$DW$247, DW_AT_name("oscHandle")
    1462                      .dwattr $C$DW$247, DW_AT_TI_symbol_name("_oscHandle")
    1463                      .dwattr $C$DW$247, DW_AT_data_member_location[DW_OP_plus_uconst 0x76]
    1464                      .dwattr $C$DW$247, DW_AT_accessibility(DW_ACCESS_public)
    1465              $C$DW$248       .dwtag  DW_TAG_member
    1466                      .dwattr $C$DW$248, DW_AT_type(*$C$DW$T$82)
    1467                      .dwattr $C$DW$248, DW_AT_name("pieHandle")
    1468                      .dwattr $C$DW$248, DW_AT_TI_symbol_name("_pieHandle")
    1469                      .dwattr $C$DW$248, DW_AT_data_member_location[DW_OP_plus_uconst 0x78]
    1470                      .dwattr $C$DW$248, DW_AT_accessibility(DW_ACCESS_public)
    1471              $C$DW$249       .dwtag  DW_TAG_member
    1472                      .dwattr $C$DW$249, DW_AT_type(*$C$DW$T$84)
    1473                      .dwattr $C$DW$249, DW_AT_name("pllHandle")
    1474                      .dwattr $C$DW$249, DW_AT_TI_symbol_name("_pllHandle")
    1475                      .dwattr $C$DW$249, DW_AT_data_member_location[DW_OP_plus_uconst 0x7a]
    1476                      .dwattr $C$DW$249, DW_AT_accessibility(DW_ACCESS_public)
TMS320C2000 Assembler PC v6.2.5 Tue Aug 29 10:13:49 2017

Tools Copyright (c) 1996-2014 Texas Instruments Incorporated
C:\Users\wmj\AppData\Local\Temp\0884811                              PAGE   28

    1477              $C$DW$250       .dwtag  DW_TAG_member
    1478                      .dwattr $C$DW$250, DW_AT_type(*$C$DW$T$87)
    1479                      .dwattr $C$DW$250, DW_AT_name("pwmHandle")
    1480                      .dwattr $C$DW$250, DW_AT_TI_symbol_name("_pwmHandle")
    1481                      .dwattr $C$DW$250, DW_AT_data_member_location[DW_OP_plus_uconst 0x7c]
    1482                      .dwattr $C$DW$250, DW_AT_accessibility(DW_ACCESS_public)
    1483              $C$DW$251       .dwtag  DW_TAG_member
    1484                      .dwattr $C$DW$251, DW_AT_type(*$C$DW$T$87)
    1485                      .dwattr $C$DW$251, DW_AT_name("pwmDacHandle")
    1486                      .dwattr $C$DW$251, DW_AT_TI_symbol_name("_pwmDacHandle")
    1487                      .dwattr $C$DW$251, DW_AT_data_member_location[DW_OP_plus_uconst 0x82]
    1488                      .dwattr $C$DW$251, DW_AT_accessibility(DW_ACCESS_public)
    1489              $C$DW$252       .dwtag  DW_TAG_member
    1490                      .dwattr $C$DW$252, DW_AT_type(*$C$DW$T$89)
    1491                      .dwattr $C$DW$252, DW_AT_name("pwrHandle")
    1492                      .dwattr $C$DW$252, DW_AT_TI_symbol_name("_pwrHandle")
    1493                      .dwattr $C$DW$252, DW_AT_data_member_location[DW_OP_plus_uconst 0x88]
    1494                      .dwattr $C$DW$252, DW_AT_accessibility(DW_ACCESS_public)
    1495              $C$DW$253       .dwtag  DW_TAG_member
    1496                      .dwattr $C$DW$253, DW_AT_type(*$C$DW$T$92)
    1497                      .dwattr $C$DW$253, DW_AT_name("timerHandle")
    1498                      .dwattr $C$DW$253, DW_AT_TI_symbol_name("_timerHandle")
    1499                      .dwattr $C$DW$253, DW_AT_data_member_location[DW_OP_plus_uconst 0x8a]
    1500                      .dwattr $C$DW$253, DW_AT_accessibility(DW_ACCESS_public)
    1501              $C$DW$254       .dwtag  DW_TAG_member
    1502                      .dwattr $C$DW$254, DW_AT_type(*$C$DW$T$94)
    1503                      .dwattr $C$DW$254, DW_AT_name("i2cHandle")
    1504                      .dwattr $C$DW$254, DW_AT_TI_symbol_name("_i2cHandle")
    1505                      .dwattr $C$DW$254, DW_AT_data_member_location[DW_OP_plus_uconst 0x90]
    1506                      .dwattr $C$DW$254, DW_AT_accessibility(DW_ACCESS_public)
    1507              $C$DW$255       .dwtag  DW_TAG_member
    1508                      .dwattr $C$DW$255, DW_AT_type(*$C$DW$T$50)
    1509                      .dwattr $C$DW$255, DW_AT_name("spiAHandle")
    1510                      .dwattr $C$DW$255, DW_AT_TI_symbol_name("_spiAHandle")
    1511                      .dwattr $C$DW$255, DW_AT_data_member_location[DW_OP_plus_uconst 0x92]
    1512                      .dwattr $C$DW$255, DW_AT_accessibility(DW_ACCESS_public)
    1513              $C$DW$256       .dwtag  DW_TAG_member
    1514                      .dwattr $C$DW$256, DW_AT_type(*$C$DW$T$96)
    1515                      .dwattr $C$DW$256, DW_AT_name("wdogHandle")
    1516                      .dwattr $C$DW$256, DW_AT_TI_symbol_name("_wdogHandle")
    1517                      .dwattr $C$DW$256, DW_AT_data_member_location[DW_OP_plus_uconst 0x94]
    1518                      .dwattr $C$DW$256, DW_AT_accessibility(DW_ACCESS_public)
    1519              $C$DW$257       .dwtag  DW_TAG_member
    1520                      .dwattr $C$DW$257, DW_AT_type(*$C$DW$T$98)
    1521                      .dwattr $C$DW$257, DW_AT_name("sciHandle")
    1522                      .dwattr $C$DW$257, DW_AT_TI_symbol_name("_sciHandle")
    1523                      .dwattr $C$DW$257, DW_AT_data_member_location[DW_OP_plus_uconst 0x96]
    1524                      .dwattr $C$DW$257, DW_AT_accessibility(DW_ACCESS_public)
    1525              $C$DW$258       .dwtag  DW_TAG_member
    1526                      .dwattr $C$DW$258, DW_AT_type(*$C$DW$T$99)
    1527                      .dwattr $C$DW$258, DW_AT_name("adcBias")
    1528                      .dwattr $C$DW$258, DW_AT_TI_symbol_name("_adcBias")
    1529                      .dwattr $C$DW$258, DW_AT_data_member_location[DW_OP_plus_uconst 0x98]
    1530                      .dwattr $C$DW$258, DW_AT_accessibility(DW_ACCESS_public)
    1531              $C$DW$259       .dwtag  DW_TAG_member
TMS320C2000 Assembler PC v6.2.5 Tue Aug 29 10:13:49 2017

Tools Copyright (c) 1996-2014 Texas Instruments Incorporated
C:\Users\wmj\AppData\Local\Temp\0884811                              PAGE   29

    1532                      .dwattr $C$DW$259, DW_AT_type(*$C$DW$T$37)
    1533                      .dwattr $C$DW$259, DW_AT_name("current_sf")
    1534                      .dwattr $C$DW$259, DW_AT_TI_symbol_name("_current_sf")
    1535                      .dwattr $C$DW$259, DW_AT_data_member_location[DW_OP_plus_uconst 0xae]
    1536                      .dwattr $C$DW$259, DW_AT_accessibility(DW_ACCESS_public)
    1537              $C$DW$260       .dwtag  DW_TAG_member
    1538                      .dwattr $C$DW$260, DW_AT_type(*$C$DW$T$37)
    1539                      .dwattr $C$DW$260, DW_AT_name("voltage_sf")
    1540                      .dwattr $C$DW$260, DW_AT_TI_symbol_name("_voltage_sf")
    1541                      .dwattr $C$DW$260, DW_AT_data_member_location[DW_OP_plus_uconst 0xb0]
    1542                      .dwattr $C$DW$260, DW_AT_accessibility(DW_ACCESS_public)
    1543              $C$DW$261       .dwtag  DW_TAG_member
    1544                      .dwattr $C$DW$261, DW_AT_type(*$C$DW$T$47)
    1545                      .dwattr $C$DW$261, DW_AT_name("numCurrentSensors")
    1546                      .dwattr $C$DW$261, DW_AT_TI_symbol_name("_numCurrentSensors")
    1547                      .dwattr $C$DW$261, DW_AT_data_member_location[DW_OP_plus_uconst 0xb2]
    1548                      .dwattr $C$DW$261, DW_AT_accessibility(DW_ACCESS_public)
    1549              $C$DW$262       .dwtag  DW_TAG_member
    1550                      .dwattr $C$DW$262, DW_AT_type(*$C$DW$T$47)
    1551                      .dwattr $C$DW$262, DW_AT_name("numVoltageSensors")
    1552                      .dwattr $C$DW$262, DW_AT_TI_symbol_name("_numVoltageSensors")
    1553                      .dwattr $C$DW$262, DW_AT_data_member_location[DW_OP_plus_uconst 0xb3]
    1554                      .dwattr $C$DW$262, DW_AT_accessibility(DW_ACCESS_public)
    1555                      .dwendtag $C$DW$T$100
    1556              
    1557              $C$DW$T$165     .dwtag  DW_TAG_pointer_type
    1558                      .dwattr $C$DW$T$165, DW_AT_type(*$C$DW$T$100)
    1559                      .dwattr $C$DW$T$165, DW_AT_address_class(0x16)
    1560              $C$DW$T$166     .dwtag  DW_TAG_typedef, DW_AT_name("HAL_Handle")
    1561                      .dwattr $C$DW$T$166, DW_AT_type(*$C$DW$T$165)
    1562                      .dwattr $C$DW$T$166, DW_AT_language(DW_LANG_C)
    1563              $C$DW$263       .dwtag  DW_TAG_TI_far_type
    1564                      .dwattr $C$DW$263, DW_AT_type(*$C$DW$T$166)
    1565              $C$DW$T$202     .dwtag  DW_TAG_const_type
    1566                      .dwattr $C$DW$T$202, DW_AT_type(*$C$DW$263)
    1567              
    1568              $C$DW$T$101     .dwtag  DW_TAG_structure_type
    1569                      .dwattr $C$DW$T$101, DW_AT_name("_LDC1612_CONFIG_t_")
    1570                      .dwattr $C$DW$T$101, DW_AT_byte_size(0x09)
    1571              $C$DW$264       .dwtag  DW_TAG_member
    1572                      .dwattr $C$DW$264, DW_AT_type(*$C$DW$T$42)
    1573                      .dwattr $C$DW$264, DW_AT_name("ACTIVE_CHAN_0")
    1574                      .dwattr $C$DW$264, DW_AT_TI_symbol_name("_ACTIVE_CHAN_0")
    1575                      .dwattr $C$DW$264, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    1576                      .dwattr $C$DW$264, DW_AT_accessibility(DW_ACCESS_public)
    1577              $C$DW$265       .dwtag  DW_TAG_member
    1578                      .dwattr $C$DW$265, DW_AT_type(*$C$DW$T$42)
    1579                      .dwattr $C$DW$265, DW_AT_name("ACTIVE_CHAN_1")
    1580                      .dwattr $C$DW$265, DW_AT_TI_symbol_name("_ACTIVE_CHAN_1")
    1581                      .dwattr $C$DW$265, DW_AT_data_member_location[DW_OP_plus_uconst 0x1]
    1582                      .dwattr $C$DW$265, DW_AT_accessibility(DW_ACCESS_public)
    1583              $C$DW$266       .dwtag  DW_TAG_member
    1584                      .dwattr $C$DW$266, DW_AT_type(*$C$DW$T$42)
    1585                      .dwattr $C$DW$266, DW_AT_name("SLEEP_MODE_EN")
    1586                      .dwattr $C$DW$266, DW_AT_TI_symbol_name("_SLEEP_MODE_EN")
TMS320C2000 Assembler PC v6.2.5 Tue Aug 29 10:13:49 2017

Tools Copyright (c) 1996-2014 Texas Instruments Incorporated
C:\Users\wmj\AppData\Local\Temp\0884811                              PAGE   30

    1587                      .dwattr $C$DW$266, DW_AT_data_member_location[DW_OP_plus_uconst 0x2]
    1588                      .dwattr $C$DW$266, DW_AT_accessibility(DW_ACCESS_public)
    1589              $C$DW$267       .dwtag  DW_TAG_member
    1590                      .dwattr $C$DW$267, DW_AT_type(*$C$DW$T$42)
    1591                      .dwattr $C$DW$267, DW_AT_name("RP_OVERRIDE_EN")
    1592                      .dwattr $C$DW$267, DW_AT_TI_symbol_name("_RP_OVERRIDE_EN")
    1593                      .dwattr $C$DW$267, DW_AT_data_member_location[DW_OP_plus_uconst 0x3]
    1594                      .dwattr $C$DW$267, DW_AT_accessibility(DW_ACCESS_public)
    1595              $C$DW$268       .dwtag  DW_TAG_member
    1596                      .dwattr $C$DW$268, DW_AT_type(*$C$DW$T$42)
    1597                      .dwattr $C$DW$268, DW_AT_name("SENSOR_ACTV_SEL")
    1598                      .dwattr $C$DW$268, DW_AT_TI_symbol_name("_SENSOR_ACTV_SEL")
    1599                      .dwattr $C$DW$268, DW_AT_data_member_location[DW_OP_plus_uconst 0x4]
    1600                      .dwattr $C$DW$268, DW_AT_accessibility(DW_ACCESS_public)
    1601              $C$DW$269       .dwtag  DW_TAG_member
    1602                      .dwattr $C$DW$269, DW_AT_type(*$C$DW$T$42)
    1603                      .dwattr $C$DW$269, DW_AT_name("AUTO_AMP_DIS")
    1604                      .dwattr $C$DW$269, DW_AT_TI_symbol_name("_AUTO_AMP_DIS")
    1605                      .dwattr $C$DW$269, DW_AT_data_member_location[DW_OP_plus_uconst 0x5]
    1606                      .dwattr $C$DW$269, DW_AT_accessibility(DW_ACCESS_public)
    1607              $C$DW$270       .dwtag  DW_TAG_member
    1608                      .dwattr $C$DW$270, DW_AT_type(*$C$DW$T$42)
    1609                      .dwattr $C$DW$270, DW_AT_name("REF_CLK_SRC")
    1610                      .dwattr $C$DW$270, DW_AT_TI_symbol_name("_REF_CLK_SRC")
    1611                      .dwattr $C$DW$270, DW_AT_data_member_location[DW_OP_plus_uconst 0x6]
    1612                      .dwattr $C$DW$270, DW_AT_accessibility(DW_ACCESS_public)
    1613              $C$DW$271       .dwtag  DW_TAG_member
    1614                      .dwattr $C$DW$271, DW_AT_type(*$C$DW$T$42)
    1615                      .dwattr $C$DW$271, DW_AT_name("INTB_DIS")
    1616                      .dwattr $C$DW$271, DW_AT_TI_symbol_name("_INTB_DIS")
    1617                      .dwattr $C$DW$271, DW_AT_data_member_location[DW_OP_plus_uconst 0x7]
    1618                      .dwattr $C$DW$271, DW_AT_accessibility(DW_ACCESS_public)
    1619              $C$DW$272       .dwtag  DW_TAG_member
    1620                      .dwattr $C$DW$272, DW_AT_type(*$C$DW$T$42)
    1621                      .dwattr $C$DW$272, DW_AT_name("HIGH_CURRENT_DRV")
    1622                      .dwattr $C$DW$272, DW_AT_TI_symbol_name("_HIGH_CURRENT_DRV")
    1623                      .dwattr $C$DW$272, DW_AT_data_member_location[DW_OP_plus_uconst 0x8]
    1624                      .dwattr $C$DW$272, DW_AT_accessibility(DW_ACCESS_public)
    1625                      .dwendtag $C$DW$T$101
    1626              
    1627              $C$DW$T$120     .dwtag  DW_TAG_typedef, DW_AT_name("LDC1612_CONFIG_t_")
    1628                      .dwattr $C$DW$T$120, DW_AT_type(*$C$DW$T$101)
    1629                      .dwattr $C$DW$T$120, DW_AT_language(DW_LANG_C)
    1630              
    1631              $C$DW$T$103     .dwtag  DW_TAG_structure_type
    1632                      .dwattr $C$DW$T$103, DW_AT_name("_LDC161x_CLK_DIVS_t_")
    1633                      .dwattr $C$DW$T$103, DW_AT_byte_size(0x02)
    1634              $C$DW$273       .dwtag  DW_TAG_member
    1635                      .dwattr $C$DW$273, DW_AT_type(*$C$DW$T$102)
    1636                      .dwattr $C$DW$273, DW_AT_name("CLK_DIVS_CH0")
    1637                      .dwattr $C$DW$273, DW_AT_TI_symbol_name("_CLK_DIVS_CH0")
    1638                      .dwattr $C$DW$273, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    1639                      .dwattr $C$DW$273, DW_AT_accessibility(DW_ACCESS_public)
    1640                      .dwendtag $C$DW$T$103
    1641              
TMS320C2000 Assembler PC v6.2.5 Tue Aug 29 10:13:49 2017

Tools Copyright (c) 1996-2014 Texas Instruments Incorporated
C:\Users\wmj\AppData\Local\Temp\0884811                              PAGE   31

    1642              $C$DW$T$117     .dwtag  DW_TAG_typedef, DW_AT_name("LDC161x_CLK_DIVS_t_")
    1643                      .dwattr $C$DW$T$117, DW_AT_type(*$C$DW$T$103)
    1644                      .dwattr $C$DW$T$117, DW_AT_language(DW_LANG_C)
    1645              
    1646              $C$DW$T$104     .dwtag  DW_TAG_structure_type
    1647                      .dwattr $C$DW$T$104, DW_AT_name("_LDC161x_ERROR_CONFIG_t_")
    1648                      .dwattr $C$DW$T$104, DW_AT_byte_size(0x0c)
    1649              $C$DW$274       .dwtag  DW_TAG_member
    1650                      .dwattr $C$DW$274, DW_AT_type(*$C$DW$T$42)
    1651                      .dwattr $C$DW$274, DW_AT_name("UR_ERR2OUT")
    1652                      .dwattr $C$DW$274, DW_AT_TI_symbol_name("_UR_ERR2OUT")
    1653                      .dwattr $C$DW$274, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    1654                      .dwattr $C$DW$274, DW_AT_accessibility(DW_ACCESS_public)
    1655              $C$DW$275       .dwtag  DW_TAG_member
    1656                      .dwattr $C$DW$275, DW_AT_type(*$C$DW$T$42)
    1657                      .dwattr $C$DW$275, DW_AT_name("OR_ERR2OUT")
    1658                      .dwattr $C$DW$275, DW_AT_TI_symbol_name("_OR_ERR2OUT")
    1659                      .dwattr $C$DW$275, DW_AT_data_member_location[DW_OP_plus_uconst 0x1]
    1660                      .dwattr $C$DW$275, DW_AT_accessibility(DW_ACCESS_public)
    1661              $C$DW$276       .dwtag  DW_TAG_member
    1662                      .dwattr $C$DW$276, DW_AT_type(*$C$DW$T$42)
    1663                      .dwattr $C$DW$276, DW_AT_name("WD_ERR2OUT")
    1664                      .dwattr $C$DW$276, DW_AT_TI_symbol_name("_WD_ERR2OUT")
    1665                      .dwattr $C$DW$276, DW_AT_data_member_location[DW_OP_plus_uconst 0x2]
    1666                      .dwattr $C$DW$276, DW_AT_accessibility(DW_ACCESS_public)
    1667              $C$DW$277       .dwtag  DW_TAG_member
    1668                      .dwattr $C$DW$277, DW_AT_type(*$C$DW$T$42)
    1669                      .dwattr $C$DW$277, DW_AT_name("AH_ERR2OUT")
    1670                      .dwattr $C$DW$277, DW_AT_TI_symbol_name("_AH_ERR2OUT")
    1671                      .dwattr $C$DW$277, DW_AT_data_member_location[DW_OP_plus_uconst 0x3]
    1672                      .dwattr $C$DW$277, DW_AT_accessibility(DW_ACCESS_public)
    1673              $C$DW$278       .dwtag  DW_TAG_member
    1674                      .dwattr $C$DW$278, DW_AT_type(*$C$DW$T$42)
    1675                      .dwattr $C$DW$278, DW_AT_name("AL_ERR2OUT")
    1676                      .dwattr $C$DW$278, DW_AT_TI_symbol_name("_AL_ERR2OUT")
    1677                      .dwattr $C$DW$278, DW_AT_data_member_location[DW_OP_plus_uconst 0x4]
    1678                      .dwattr $C$DW$278, DW_AT_accessibility(DW_ACCESS_public)
    1679              $C$DW$279       .dwtag  DW_TAG_member
    1680                      .dwattr $C$DW$279, DW_AT_type(*$C$DW$T$42)
    1681                      .dwattr $C$DW$279, DW_AT_name("UR_ERR2INT")
    1682                      .dwattr $C$DW$279, DW_AT_TI_symbol_name("_UR_ERR2INT")
    1683                      .dwattr $C$DW$279, DW_AT_data_member_location[DW_OP_plus_uconst 0x5]
