TMS320C2000 Assembler PC v6.2.5 Thu Sep 21 15:49:24 2017

Tools Copyright (c) 1996-2014 Texas Instruments Incorporated
C:\Users\wmj\AppData\Local\Temp\1688411                              PAGE    1

       1              ;***************************************************************
       2              ;* TMS320C2000 C/C++ Codegen                         PC v6.2.5 *
       3              ;* Date/Time created: Thu Sep 21 15:49:24 2017                 *
       4              ;***************************************************************
       5                      .compiler_opts --float_support=softlib --hll_source=on --mem_model:code=flat --mem_model:data=large -
       6        0002  FP      .set    XAR2
       7              
       8              $C$DW$CU        .dwtag  DW_TAG_compile_unit
       9                      .dwattr $C$DW$CU, DW_AT_name("D:/BM1000/sw/solutions/instaspin_foc/src/proj_lab02b.c")
      10                      .dwattr $C$DW$CU, DW_AT_producer("TMS320C2000 C/C++ Codegen PC v6.2.5 Copyright (c) 1996-2014 Texas I
      11                      .dwattr $C$DW$CU, DW_AT_TI_version(0x01)
      12                      .dwattr $C$DW$CU, DW_AT_comp_dir("D:\BM1000\sw\solutions\instaspin_foc\boards\hvkit_rev1p1\f28x\f2802
      13              ;**************************************************************
      14              ;* CINIT RECORDS                                              *

    3322              $C$DW$509       .dwtag  DW_TAG_enumerator, DW_AT_name("ADC_ResultNumber_11"), DW_AT_const_value(0x0b)
    3323              $C$DW$510       .dwtag  DW_TAG_enumerator, DW_AT_name("ADC_ResultNumber_12"), DW_AT_const_value(0x0c)
    3324              $C$DW$511       .dwtag  DW_TAG_enumerator, DW_AT_name("ADC_ResultNumber_13"), DW_AT_const_value(0x0d)
    3325              $C$DW$512       .dwtag  DW_TAG_enumerator, DW_AT_name("ADC_ResultNumber_14"), DW_AT_const_value(0x0e)
    3326              $C$DW$513       .dwtag  DW_TAG_enumerator, DW_AT_name("ADC_ResultNumber_15"), DW_AT_const_value(0x0f)
    3327                      .dwendtag $C$DW$T$259
    3328              
    3329              $C$DW$T$260     .dwtag  DW_TAG_typedef, DW_AT_name("ADC_ResultNumber_e")
    3330                      .dwattr $C$DW$T$260, DW_AT_type(*$C$DW$T$259)
    3331                      .dwattr $C$DW$T$260, DW_AT_language(DW_LANG_C)
    3332              
    3333              $C$DW$T$262     .dwtag  DW_TAG_enumeration_type
    3334                      .dwattr $C$DW$T$262, DW_AT_byte_size(0x01)
    3335              $C$DW$514       .dwtag  DW_TAG_enumerator, DW_AT_name("PIE_GroupNumber_1"), DW_AT_const_value(0x00)
    3336              $C$DW$515       .dwtag  DW_TAG_enumerator, DW_AT_name("PIE_GroupNumber_2"), DW_AT_const_value(0x01)
    3337              $C$DW$516       .dwtag  DW_TAG_enumerator, DW_AT_name("PIE_GroupNumber_3"), DW_AT_const_value(0x02)
    3338              $C$DW$517       .dwtag  DW_TAG_enumerator, DW_AT_name("PIE_GroupNumber_4"), DW_AT_const_value(0x03)
    3339              $C$DW$518       .dwtag  DW_TAG_enumerator, DW_AT_name("PIE_GroupNumber_5"), DW_AT_const_value(0x04)
    3340              $C$DW$519       .dwtag  DW_TAG_enumerator, DW_AT_name("PIE_GroupNumber_6"), DW_AT_const_value(0x05)
    3341              $C$DW$520       .dwtag  DW_TAG_enumerator, DW_AT_name("PIE_GroupNumber_7"), DW_AT_const_value(0x06)
    3342              $C$DW$521       .dwtag  DW_TAG_enumerator, DW_AT_name("PIE_GroupNumber_8"), DW_AT_const_value(0x07)
    3343              $C$DW$522       .dwtag  DW_TAG_enumerator, DW_AT_name("PIE_GroupNumber_9"), DW_AT_const_value(0x08)
    3344              $C$DW$523       .dwtag  DW_TAG_enumerator, DW_AT_name("PIE_GroupNumber_10"), DW_AT_const_value(0x09)
    3345              $C$DW$524       .dwtag  DW_TAG_enumerator, DW_AT_name("PIE_GroupNumber_11"), DW_AT_const_value(0x0a)
    3346              $C$DW$525       .dwtag  DW_TAG_enumerator, DW_AT_name("PIE_GroupNumber_12"), DW_AT_const_value(0x0b)
    3347                      .dwendtag $C$DW$T$262
    3348              
    3349              $C$DW$T$263     .dwtag  DW_TAG_typedef, DW_AT_name("PIE_GroupNumber_e")
    3350                      .dwattr $C$DW$T$263, DW_AT_type(*$C$DW$T$262)
TMS320C2000 Assembler PC v6.2.5 Thu Sep 21 15:49:24 2017

Tools Copyright (c) 1996-2014 Texas Instruments Incorporated
C:\Users\wmj\AppData\Local\Temp\1688411                              PAGE   67

    3351                      .dwattr $C$DW$T$263, DW_AT_language(DW_LANG_C)
    3352              
    3353              $C$DW$T$265     .dwtag  DW_TAG_enumeration_type
    3354                      .dwattr $C$DW$T$265, DW_AT_byte_size(0x01)
    3355              $C$DW$526       .dwtag  DW_TAG_enumerator, DW_AT_name("HAL_SensorType_Current"), DW_AT_const_value(0x00)
    3356              $C$DW$527       .dwtag  DW_TAG_enumerator, DW_AT_name("HAL_SensorType_Voltage"), DW_AT_const_value(0x01)
    3357                      .dwendtag $C$DW$T$265
    3358              
    3359              $C$DW$T$266     .dwtag  DW_TAG_typedef, DW_AT_name("HAL_SensorType_e")
    3360                      .dwattr $C$DW$T$266, DW_AT_type(*$C$DW$T$265)
    3361                      .dwattr $C$DW$T$266, DW_AT_language(DW_LANG_C)
    3362              
    3363              $C$DW$T$19      .dwtag  DW_TAG_structure_type
    3364                      .dwattr $C$DW$T$19, DW_AT_name("I2C_Obj")
    3365                      .dwattr $C$DW$T$19, DW_AT_declaration
    3366                      .dwendtag $C$DW$T$19
    3367              
    3368              $C$DW$T$124     .dwtag  DW_TAG_pointer_type
    3369                      .dwattr $C$DW$T$124, DW_AT_type(*$C$DW$T$19)
    3370                      .dwattr $C$DW$T$124, DW_AT_address_class(0x16)
    3371              $C$DW$T$125     .dwtag  DW_TAG_typedef, DW_AT_name("I2C_Handle")
    3372                      .dwattr $C$DW$T$125, DW_AT_type(*$C$DW$T$124)
    3373                      .dwattr $C$DW$T$125, DW_AT_language(DW_LANG_C)
    3374              
    3375              $C$DW$T$20      .dwtag  DW_TAG_structure_type
    3376                      .dwattr $C$DW$T$20, DW_AT_name("LDC161x_REG_Obj")
    3377                      .dwattr $C$DW$T$20, DW_AT_declaration
    3378                      .dwendtag $C$DW$T$20
    3379              
    3380              $C$DW$T$143     .dwtag  DW_TAG_pointer_type
    3381                      .dwattr $C$DW$T$143, DW_AT_type(*$C$DW$T$20)
    3382                      .dwattr $C$DW$T$143, DW_AT_address_class(0x16)
    3383              $C$DW$T$144     .dwtag  DW_TAG_typedef, DW_AT_name("LDC_Handle")
    3384                      .dwattr $C$DW$T$144, DW_AT_type(*$C$DW$T$143)
    3385                      .dwattr $C$DW$T$144, DW_AT_language(DW_LANG_C)
    3386              
    3387              $C$DW$T$32      .dwtag  DW_TAG_structure_type
    3388                      .dwattr $C$DW$T$32, DW_AT_name("_ADC_Obj_")
    3389                      .dwattr $C$DW$T$32, DW_AT_byte_size(0x6650)
    3390              $C$DW$528       .dwtag  DW_TAG_member
    3391                      .dwattr $C$DW$528, DW_AT_type(*$C$DW$T$26)
    3392                      .dwattr $C$DW$528, DW_AT_name("ADCRESULT")
    3393                      .dwattr $C$DW$528, DW_AT_TI_symbol_name("_ADCRESULT")
    3394                      .dwattr $C$DW$528, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    3395                      .dwattr $C$DW$528, DW_AT_accessibility(DW_ACCESS_public)
    3396              $C$DW$529       .dwtag  DW_TAG_member
    3397                      .dwattr $C$DW$529, DW_AT_type(*$C$DW$T$27)
    3398                      .dwattr $C$DW$529, DW_AT_name("resvd_1")
    3399                      .dwattr $C$DW$529, DW_AT_TI_symbol_name("_resvd_1")
    3400                      .dwattr $C$DW$529, DW_AT_data_member_location[DW_OP_plus_uconst 0x10]
    3401                      .dwattr $C$DW$529, DW_AT_accessibility(DW_ACCESS_public)
    3402              $C$DW$530       .dwtag  DW_TAG_member
    3403                      .dwattr $C$DW$530, DW_AT_type(*$C$DW$T$25)
    3404                      .dwattr $C$DW$530, DW_AT_name("ADCCTL1")
    3405                      .dwattr $C$DW$530, DW_AT_TI_symbol_name("_ADCCTL1")
TMS320C2000 Assembler PC v6.2.5 Thu Sep 21 15:49:24 2017

Tools Copyright (c) 1996-2014 Texas Instruments Incorporated
C:\Users\wmj\AppData\Local\Temp\1688411                              PAGE   68

    3406                      .dwattr $C$DW$530, DW_AT_data_member_location[DW_OP_plus_uconst 0x6600]
    3407                      .dwattr $C$DW$530, DW_AT_accessibility(DW_ACCESS_public)
    3408              $C$DW$531       .dwtag  DW_TAG_member
    3409                      .dwattr $C$DW$531, DW_AT_type(*$C$DW$T$25)
    3410                      .dwattr $C$DW$531, DW_AT_name("ADCCTL2")
    3411                      .dwattr $C$DW$531, DW_AT_TI_symbol_name("_ADCCTL2")
    3412                      .dwattr $C$DW$531, DW_AT_data_member_location[DW_OP_plus_uconst 0x6601]
    3413                      .dwattr $C$DW$531, DW_AT_accessibility(DW_ACCESS_public)
    3414              $C$DW$532       .dwtag  DW_TAG_member
    3415                      .dwattr $C$DW$532, DW_AT_type(*$C$DW$T$28)
    3416                      .dwattr $C$DW$532, DW_AT_name("rsvd_2")
    3417                      .dwattr $C$DW$532, DW_AT_TI_symbol_name("_rsvd_2")
    3418                      .dwattr $C$DW$532, DW_AT_data_member_location[DW_OP_plus_uconst 0x6602]
    3419                      .dwattr $C$DW$532, DW_AT_accessibility(DW_ACCESS_public)
    3420              $C$DW$533       .dwtag  DW_TAG_member
    3421                      .dwattr $C$DW$533, DW_AT_type(*$C$DW$T$25)
    3422                      .dwattr $C$DW$533, DW_AT_name("ADCINTFLG")
    3423                      .dwattr $C$DW$533, DW_AT_TI_symbol_name("_ADCINTFLG")
    3424                      .dwattr $C$DW$533, DW_AT_data_member_location[DW_OP_plus_uconst 0x6604]
    3425                      .dwattr $C$DW$533, DW_AT_accessibility(DW_ACCESS_public)
    3426              $C$DW$534       .dwtag  DW_TAG_member
    3427                      .dwattr $C$DW$534, DW_AT_type(*$C$DW$T$25)
    3428                      .dwattr $C$DW$534, DW_AT_name("ADCINTFLGCLR")
    3429                      .dwattr $C$DW$534, DW_AT_TI_symbol_name("_ADCINTFLGCLR")
    3430                      .dwattr $C$DW$534, DW_AT_data_member_location[DW_OP_plus_uconst 0x6605]
    3431                      .dwattr $C$DW$534, DW_AT_accessibility(DW_ACCESS_public)
    3432              $C$DW$535       .dwtag  DW_TAG_member
    3433                      .dwattr $C$DW$535, DW_AT_type(*$C$DW$T$25)
    3434                      .dwattr $C$DW$535, DW_AT_name("ADCINTOVF")
    3435                      .dwattr $C$DW$535, DW_AT_TI_symbol_name("_ADCINTOVF")
    3436                      .dwattr $C$DW$535, DW_AT_data_member_location[DW_OP_plus_uconst 0x6606]
    3437                      .dwattr $C$DW$535, DW_AT_accessibility(DW_ACCESS_public)
    3438              $C$DW$536       .dwtag  DW_TAG_member
    3439                      .dwattr $C$DW$536, DW_AT_type(*$C$DW$T$25)
    3440                      .dwattr $C$DW$536, DW_AT_name("ADCINTOVFCLR")
    3441                      .dwattr $C$DW$536, DW_AT_TI_symbol_name("_ADCINTOVFCLR")
    3442                      .dwattr $C$DW$536, DW_AT_data_member_location[DW_OP_plus_uconst 0x6607]
    3443                      .dwattr $C$DW$536, DW_AT_accessibility(DW_ACCESS_public)
    3444              $C$DW$537       .dwtag  DW_TAG_member
    3445                      .dwattr $C$DW$537, DW_AT_type(*$C$DW$T$29)
    3446                      .dwattr $C$DW$537, DW_AT_name("INTSELxNy")
    3447                      .dwattr $C$DW$537, DW_AT_TI_symbol_name("_INTSELxNy")
    3448                      .dwattr $C$DW$537, DW_AT_data_member_location[DW_OP_plus_uconst 0x6608]
    3449                      .dwattr $C$DW$537, DW_AT_accessibility(DW_ACCESS_public)
    3450              $C$DW$538       .dwtag  DW_TAG_member
    3451                      .dwattr $C$DW$538, DW_AT_type(*$C$DW$T$30)
    3452                      .dwattr $C$DW$538, DW_AT_name("rsvd_3")
    3453                      .dwattr $C$DW$538, DW_AT_TI_symbol_name("_rsvd_3")
    3454                      .dwattr $C$DW$538, DW_AT_data_member_location[DW_OP_plus_uconst 0x660d]
    3455                      .dwattr $C$DW$538, DW_AT_accessibility(DW_ACCESS_public)
    3456              $C$DW$539       .dwtag  DW_TAG_member
    3457                      .dwattr $C$DW$539, DW_AT_type(*$C$DW$T$25)
    3458                      .dwattr $C$DW$539, DW_AT_name("SOCPRICTRL")
    3459                      .dwattr $C$DW$539, DW_AT_TI_symbol_name("_SOCPRICTRL")
    3460                      .dwattr $C$DW$539, DW_AT_data_member_location[DW_OP_plus_uconst 0x6610]
TMS320C2000 Assembler PC v6.2.5 Thu Sep 21 15:49:24 2017

Tools Copyright (c) 1996-2014 Texas Instruments Incorporated
C:\Users\wmj\AppData\Local\Temp\1688411                              PAGE   69

    3461                      .dwattr $C$DW$539, DW_AT_accessibility(DW_ACCESS_public)
    3462              $C$DW$540       .dwtag  DW_TAG_member
    3463                      .dwattr $C$DW$540, DW_AT_type(*$C$DW$T$25)
    3464                      .dwattr $C$DW$540, DW_AT_name("rsvd_4")
    3465                      .dwattr $C$DW$540, DW_AT_TI_symbol_name("_rsvd_4")
    3466                      .dwattr $C$DW$540, DW_AT_data_member_location[DW_OP_plus_uconst 0x6611]
    3467                      .dwattr $C$DW$540, DW_AT_accessibility(DW_ACCESS_public)
    3468              $C$DW$541       .dwtag  DW_TAG_member
    3469                      .dwattr $C$DW$541, DW_AT_type(*$C$DW$T$25)
    3470                      .dwattr $C$DW$541, DW_AT_name("ADCSAMPLEMODE")
    3471                      .dwattr $C$DW$541, DW_AT_TI_symbol_name("_ADCSAMPLEMODE")
    3472                      .dwattr $C$DW$541, DW_AT_data_member_location[DW_OP_plus_uconst 0x6612]
    3473                      .dwattr $C$DW$541, DW_AT_accessibility(DW_ACCESS_public)
    3474              $C$DW$542       .dwtag  DW_TAG_member
    3475                      .dwattr $C$DW$542, DW_AT_type(*$C$DW$T$25)
    3476                      .dwattr $C$DW$542, DW_AT_name("rsvd_5")
    3477                      .dwattr $C$DW$542, DW_AT_TI_symbol_name("_rsvd_5")
    3478                      .dwattr $C$DW$542, DW_AT_data_member_location[DW_OP_plus_uconst 0x6613]
    3479                      .dwattr $C$DW$542, DW_AT_accessibility(DW_ACCESS_public)
    3480              $C$DW$543       .dwtag  DW_TAG_member
    3481                      .dwattr $C$DW$543, DW_AT_type(*$C$DW$T$25)
    3482                      .dwattr $C$DW$543, DW_AT_name("ADCINTSOCSEL1")
    3483                      .dwattr $C$DW$543, DW_AT_TI_symbol_name("_ADCINTSOCSEL1")
    3484                      .dwattr $C$DW$543, DW_AT_data_member_location[DW_OP_plus_uconst 0x6614]
    3485                      .dwattr $C$DW$543, DW_AT_accessibility(DW_ACCESS_public)
    3486              $C$DW$544       .dwtag  DW_TAG_member
    3487                      .dwattr $C$DW$544, DW_AT_type(*$C$DW$T$25)
    3488                      .dwattr $C$DW$544, DW_AT_name("ADCINTSOCSEL2")
    3489                      .dwattr $C$DW$544, DW_AT_TI_symbol_name("_ADCINTSOCSEL2")
    3490                      .dwattr $C$DW$544, DW_AT_data_member_location[DW_OP_plus_uconst 0x6615]
    3491                      .dwattr $C$DW$544, DW_AT_accessibility(DW_ACCESS_public)
    3492              $C$DW$545       .dwtag  DW_TAG_member
    3493                      .dwattr $C$DW$545, DW_AT_type(*$C$DW$T$28)
    3494                      .dwattr $C$DW$545, DW_AT_name("rsvd_6")
    3495                      .dwattr $C$DW$545, DW_AT_TI_symbol_name("_rsvd_6")
    3496                      .dwattr $C$DW$545, DW_AT_data_member_location[DW_OP_plus_uconst 0x6616]
    3497                      .dwattr $C$DW$545, DW_AT_accessibility(DW_ACCESS_public)
    3498              $C$DW$546       .dwtag  DW_TAG_member
    3499                      .dwattr $C$DW$546, DW_AT_type(*$C$DW$T$25)
    3500                      .dwattr $C$DW$546, DW_AT_name("ADCSOCFLG1")
    3501                      .dwattr $C$DW$546, DW_AT_TI_symbol_name("_ADCSOCFLG1")
    3502                      .dwattr $C$DW$546, DW_AT_data_member_location[DW_OP_plus_uconst 0x6618]
    3503                      .dwattr $C$DW$546, DW_AT_accessibility(DW_ACCESS_public)
    3504              $C$DW$547       .dwtag  DW_TAG_member
    3505                      .dwattr $C$DW$547, DW_AT_type(*$C$DW$T$25)
    3506                      .dwattr $C$DW$547, DW_AT_name("rsvd_7")
    3507                      .dwattr $C$DW$547, DW_AT_TI_symbol_name("_rsvd_7")
    3508                      .dwattr $C$DW$547, DW_AT_data_member_location[DW_OP_plus_uconst 0x6619]
    3509                      .dwattr $C$DW$547, DW_AT_accessibility(DW_ACCESS_public)
    3510              $C$DW$548       .dwtag  DW_TAG_member
    3511                      .dwattr $C$DW$548, DW_AT_type(*$C$DW$T$25)
    3512                      .dwattr $C$DW$548, DW_AT_name("ADCSOCFRC1")
    3513                      .dwattr $C$DW$548, DW_AT_TI_symbol_name("_ADCSOCFRC1")
    3514                      .dwattr $C$DW$548, DW_AT_data_member_location[DW_OP_plus_uconst 0x661a]
    3515                      .dwattr $C$DW$548, DW_AT_accessibility(DW_ACCESS_public)
TMS320C2000 Assembler PC v6.2.5 Thu Sep 21 15:49:24 2017

Tools Copyright (c) 1996-2014 Texas Instruments Incorporated
C:\Users\wmj\AppData\Local\Temp\1688411                              PAGE   70

    3516              $C$DW$549       .dwtag  DW_TAG_member
    3517                      .dwattr $C$DW$549, DW_AT_type(*$C$DW$T$25)
    3518                      .dwattr $C$DW$549, DW_AT_name("rsvd_8")
    3519                      .dwattr $C$DW$549, DW_AT_TI_symbol_name("_rsvd_8")
    3520                      .dwattr $C$DW$549, DW_AT_data_member_location[DW_OP_plus_uconst 0x661b]
    3521                      .dwattr $C$DW$549, DW_AT_accessibility(DW_ACCESS_public)
    3522              $C$DW$550       .dwtag  DW_TAG_member
    3523                      .dwattr $C$DW$550, DW_AT_type(*$C$DW$T$25)
    3524                      .dwattr $C$DW$550, DW_AT_name("ADCSOCOVF1")
    3525                      .dwattr $C$DW$550, DW_AT_TI_symbol_name("_ADCSOCOVF1")
    3526                      .dwattr $C$DW$550, DW_AT_data_member_location[DW_OP_plus_uconst 0x661c]
    3527                      .dwattr $C$DW$550, DW_AT_accessibility(DW_ACCESS_public)
    3528              $C$DW$551       .dwtag  DW_TAG_member
    3529                      .dwattr $C$DW$551, DW_AT_type(*$C$DW$T$25)
    3530                      .dwattr $C$DW$551, DW_AT_name("rsvd_9")
    3531                      .dwattr $C$DW$551, DW_AT_TI_symbol_name("_rsvd_9")
    3532                      .dwattr $C$DW$551, DW_AT_data_member_location[DW_OP_plus_uconst 0x661d]
    3533                      .dwattr $C$DW$551, DW_AT_accessibility(DW_ACCESS_public)
    3534              $C$DW$552       .dwtag  DW_TAG_member
    3535                      .dwattr $C$DW$552, DW_AT_type(*$C$DW$T$25)
    3536                      .dwattr $C$DW$552, DW_AT_name("ADCSOCOVFCLR1")
    3537                      .dwattr $C$DW$552, DW_AT_TI_symbol_name("_ADCSOCOVFCLR1")
    3538                      .dwattr $C$DW$552, DW_AT_data_member_location[DW_OP_plus_uconst 0x661e]
    3539                      .dwattr $C$DW$552, DW_AT_accessibility(DW_ACCESS_public)
    3540              $C$DW$553       .dwtag  DW_TAG_member
    3541                      .dwattr $C$DW$553, DW_AT_type(*$C$DW$T$25)
    3542                      .dwattr $C$DW$553, DW_AT_name("rsvd_10")
    3543                      .dwattr $C$DW$553, DW_AT_TI_symbol_name("_rsvd_10")
    3544                      .dwattr $C$DW$553, DW_AT_data_member_location[DW_OP_plus_uconst 0x661f]
    3545                      .dwattr $C$DW$553, DW_AT_accessibility(DW_ACCESS_public)
    3546              $C$DW$554       .dwtag  DW_TAG_member
    3547                      .dwattr $C$DW$554, DW_AT_type(*$C$DW$T$26)
    3548                      .dwattr $C$DW$554, DW_AT_name("ADCSOCxCTL")
    3549                      .dwattr $C$DW$554, DW_AT_TI_symbol_name("_ADCSOCxCTL")
    3550                      .dwattr $C$DW$554, DW_AT_data_member_location[DW_OP_plus_uconst 0x6620]
    3551                      .dwattr $C$DW$554, DW_AT_accessibility(DW_ACCESS_public)
    3552              $C$DW$555       .dwtag  DW_TAG_member
    3553                      .dwattr $C$DW$555, DW_AT_type(*$C$DW$T$26)
    3554                      .dwattr $C$DW$555, DW_AT_name("rsvd_11")
    3555                      .dwattr $C$DW$555, DW_AT_TI_symbol_name("_rsvd_11")
    3556                      .dwattr $C$DW$555, DW_AT_data_member_location[DW_OP_plus_uconst 0x6630]
    3557                      .dwattr $C$DW$555, DW_AT_accessibility(DW_ACCESS_public)
    3558              $C$DW$556       .dwtag  DW_TAG_member
    3559                      .dwattr $C$DW$556, DW_AT_type(*$C$DW$T$25)
    3560                      .dwattr $C$DW$556, DW_AT_name("ADCREFTRIM")
    3561                      .dwattr $C$DW$556, DW_AT_TI_symbol_name("_ADCREFTRIM")
    3562                      .dwattr $C$DW$556, DW_AT_data_member_location[DW_OP_plus_uconst 0x6640]
    3563                      .dwattr $C$DW$556, DW_AT_accessibility(DW_ACCESS_public)
    3564              $C$DW$557       .dwtag  DW_TAG_member
    3565                      .dwattr $C$DW$557, DW_AT_type(*$C$DW$T$25)
    3566                      .dwattr $C$DW$557, DW_AT_name("ADCOFFTRIM")
    3567                      .dwattr $C$DW$557, DW_AT_TI_symbol_name("_ADCOFFTRIM")
    3568                      .dwattr $C$DW$557, DW_AT_data_member_location[DW_OP_plus_uconst 0x6641]
    3569                      .dwattr $C$DW$557, DW_AT_accessibility(DW_ACCESS_public)
    3570              $C$DW$558       .dwtag  DW_TAG_member
TMS320C2000 Assembler PC v6.2.5 Thu Sep 21 15:49:24 2017

Tools Copyright (c) 1996-2014 Texas Instruments Incorporated
C:\Users\wmj\AppData\Local\Temp\1688411                              PAGE   71

    3571                      .dwattr $C$DW$558, DW_AT_type(*$C$DW$T$31)
    3572                      .dwattr $C$DW$558, DW_AT_name("resvd_12")
    3573                      .dwattr $C$DW$558, DW_AT_TI_symbol_name("_resvd_12")
    3574                      .dwattr $C$DW$558, DW_AT_data_member_location[DW_OP_plus_uconst 0x6642]
    3575                      .dwattr $C$DW$558, DW_AT_accessibility(DW_ACCESS_public)
    3576              $C$DW$559       .dwtag  DW_TAG_member
    3577                      .dwattr $C$DW$559, DW_AT_type(*$C$DW$T$25)
    3578                      .dwattr $C$DW$559, DW_AT_name("ADCREV")
    3579                      .dwattr $C$DW$559, DW_AT_TI_symbol_name("_ADCREV")
    3580                      .dwattr $C$DW$559, DW_AT_data_member_location[DW_OP_plus_uconst 0x664f]
    3581                      .dwattr $C$DW$559, DW_AT_accessibility(DW_ACCESS_public)
    3582                      .dwendtag $C$DW$T$32
    3583              
    3584              $C$DW$T$268     .dwtag  DW_TAG_typedef, DW_AT_name("ADC_Obj")
    3585                      .dwattr $C$DW$T$268, DW_AT_type(*$C$DW$T$32)
    3586                      .dwattr $C$DW$T$268, DW_AT_language(DW_LANG_C)
    3587              $C$DW$T$97      .dwtag  DW_TAG_pointer_type
    3588                      .dwattr $C$DW$T$97, DW_AT_type(*$C$DW$T$32)
    3589                      .dwattr $C$DW$T$97, DW_AT_address_class(0x16)
    3590              $C$DW$T$98      .dwtag  DW_TAG_typedef, DW_AT_name("ADC_Handle")
    3591                      .dwattr $C$DW$T$98, DW_AT_type(*$C$DW$T$97)
    3592                      .dwattr $C$DW$T$98, DW_AT_language(DW_LANG_C)
    3593              
    3594              $C$DW$T$36      .dwtag  DW_TAG_structure_type
    3595                      .dwattr $C$DW$T$36, DW_AT_name("_BRAKE_Obj_")
    3596                      .dwattr $C$DW$T$36, DW_AT_byte_size(0x08)
    3597              $C$DW$560       .dwtag  DW_TAG_member
    3598                      .dwattr $C$DW$560, DW_AT_type(*$C$DW$T$33)
    3599                      .dwattr $C$DW$560, DW_AT_name("angle_pu")
    3600                      .dwattr $C$DW$560, DW_AT_TI_symbol_name("_angle_pu")
    3601                      .dwattr $C$DW$560, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    3602                      .dwattr $C$DW$560, DW_AT_accessibility(DW_ACCESS_public)
    3603              $C$DW$561       .dwtag  DW_TAG_member
    3604                      .dwattr $C$DW$561, DW_AT_type(*$C$DW$T$34)
    3605                      .dwattr $C$DW$561, DW_AT_name("Idq_brake")
    3606                      .dwattr $C$DW$561, DW_AT_TI_symbol_name("_Idq_brake")
    3607                      .dwattr $C$DW$561, DW_AT_data_member_location[DW_OP_plus_uconst 0x2]
    3608                      .dwattr $C$DW$561, DW_AT_accessibility(DW_ACCESS_public)
    3609              $C$DW$562       .dwtag  DW_TAG_member
    3610                      .dwattr $C$DW$562, DW_AT_type(*$C$DW$T$35)
    3611                      .dwattr $C$DW$562, DW_AT_name("brake_enable")
    3612                      .dwattr $C$DW$562, DW_AT_TI_symbol_name("_brake_enable")
    3613                      .dwattr $C$DW$562, DW_AT_data_member_location[DW_OP_plus_uconst 0x6]
    3614                      .dwattr $C$DW$562, DW_AT_accessibility(DW_ACCESS_public)
    3615                      .dwendtag $C$DW$T$36
    3616              
    3617              $C$DW$T$76      .dwtag  DW_TAG_typedef, DW_AT_name("BRAKE_Obj")
    3618                      .dwattr $C$DW$T$76, DW_AT_type(*$C$DW$T$36)
    3619                      .dwattr $C$DW$T$76, DW_AT_language(DW_LANG_C)
    3620              $C$DW$T$74      .dwtag  DW_TAG_pointer_type
    3621                      .dwattr $C$DW$T$74, DW_AT_type(*$C$DW$T$36)
    3622                      .dwattr $C$DW$T$74, DW_AT_address_class(0x16)
    3623              $C$DW$T$75      .dwtag  DW_TAG_typedef, DW_AT_name("BRAKE_Handle")
    3624                      .dwattr $C$DW$T$75, DW_AT_type(*$C$DW$T$74)
    3625                      .dwattr $C$DW$T$75, DW_AT_language(DW_LANG_C)
TMS320C2000 Assembler PC v6.2.5 Thu Sep 21 15:49:24 2017

Tools Copyright (c) 1996-2014 Texas Instruments Incorporated
C:\Users\wmj\AppData\Local\Temp\1688411                              PAGE   72

    3626              
    3627              $C$DW$T$38      .dwtag  DW_TAG_structure_type
    3628                      .dwattr $C$DW$T$38, DW_AT_name("_CLARKE_Obj_")
    3629                      .dwattr $C$DW$T$38, DW_AT_byte_size(0x06)
    3630              $C$DW$563       .dwtag  DW_TAG_member
    3631                      .dwattr $C$DW$563, DW_AT_type(*$C$DW$T$33)
    3632                      .dwattr $C$DW$563, DW_AT_name("alpha_sf")
    3633                      .dwattr $C$DW$563, DW_AT_TI_symbol_name("_alpha_sf")
    3634                      .dwattr $C$DW$563, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    3635                      .dwattr $C$DW$563, DW_AT_accessibility(DW_ACCESS_public)
    3636              $C$DW$564       .dwtag  DW_TAG_member
    3637                      .dwattr $C$DW$564, DW_AT_type(*$C$DW$T$33)
    3638                      .dwattr $C$DW$564, DW_AT_name("beta_sf")
    3639                      .dwattr $C$DW$564, DW_AT_TI_symbol_name("_beta_sf")
    3640                      .dwattr $C$DW$564, DW_AT_data_member_location[DW_OP_plus_uconst 0x2]
    3641                      .dwattr $C$DW$564, DW_AT_accessibility(DW_ACCESS_public)
    3642              $C$DW$565       .dwtag  DW_TAG_member
    3643                      .dwattr $C$DW$565, DW_AT_type(*$C$DW$T$37)
    3644                      .dwattr $C$DW$565, DW_AT_name("numSensors")
    3645                      .dwattr $C$DW$565, DW_AT_TI_symbol_name("_numSensors")
    3646                      .dwattr $C$DW$565, DW_AT_data_member_location[DW_OP_plus_uconst 0x4]
    3647                      .dwattr $C$DW$565, DW_AT_accessibility(DW_ACCESS_public)
    3648                      .dwendtag $C$DW$T$38
    3649              
    3650              $C$DW$T$50      .dwtag  DW_TAG_typedef, DW_AT_name("CLARKE_Obj")
    3651                      .dwattr $C$DW$T$50, DW_AT_type(*$C$DW$T$38)
    3652                      .dwattr $C$DW$T$50, DW_AT_language(DW_LANG_C)
    3653              $C$DW$T$48      .dwtag  DW_TAG_pointer_type
    3654                      .dwattr $C$DW$T$48, DW_AT_type(*$C$DW$T$38)
    3655                      .dwattr $C$DW$T$48, DW_AT_address_class(0x16)
    3656              $C$DW$T$49      .dwtag  DW_TAG_typedef, DW_AT_name("CLARKE_Handle")
    3657                      .dwattr $C$DW$T$49, DW_AT_type(*$C$DW$T$48)
    3658                      .dwattr $C$DW$T$49, DW_AT_language(DW_LANG_C)
    3659              
    3660              $C$DW$T$39      .dwtag  DW_TAG_structure_type
    3661                      .dwattr $C$DW$T$39, DW_AT_name("_CLK_DIV_t_")
    3662                      .dwattr $C$DW$T$39, DW_AT_byte_size(0x02)
    3663              $C$DW$566       .dwtag  DW_TAG_member
    3664                      .dwattr $C$DW$566, DW_AT_type(*$C$DW$T$24)
    3665                      .dwattr $C$DW$566, DW_AT_name("FREF_DIVIDER")
    3666                      .dwattr $C$DW$566, DW_AT_TI_symbol_name("_FREF_DIVIDER")
    3667                      .dwattr $C$DW$566, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    3668                      .dwattr $C$DW$566, DW_AT_accessibility(DW_ACCESS_public)
    3669              $C$DW$567       .dwtag  DW_TAG_member
    3670                      .dwattr $C$DW$567, DW_AT_type(*$C$DW$T$24)
    3671                      .dwattr $C$DW$567, DW_AT_name("FIN_DIVIDER")
    3672                      .dwattr $C$DW$567, DW_AT_TI_symbol_name("_FIN_DIVIDER")
    3673                      .dwattr $C$DW$567, DW_AT_data_member_location[DW_OP_plus_uconst 0x1]
    3674                      .dwattr $C$DW$567, DW_AT_accessibility(DW_ACCESS_public)
    3675                      .dwendtag $C$DW$T$39
    3676              
    3677              $C$DW$T$137     .dwtag  DW_TAG_typedef, DW_AT_name("CLK_DIV_t_")
    3678                      .dwattr $C$DW$T$137, DW_AT_type(*$C$DW$T$39)
    3679                      .dwattr $C$DW$T$137, DW_AT_language(DW_LANG_C)
    3680              
TMS320C2000 Assembler PC v6.2.5 Thu Sep 21 15:49:24 2017

Tools Copyright (c) 1996-2014 Texas Instruments Incorporated
C:\Users\wmj\AppData\Local\Temp\1688411                              PAGE   73

    3681              $C$DW$T$41      .dwtag  DW_TAG_structure_type
    3682                      .dwattr $C$DW$T$41, DW_AT_name("_CLK_Obj_")
    3683                      .dwattr $C$DW$T$41, DW_AT_byte_size(0x11)
    3684              $C$DW$568       .dwtag  DW_TAG_member
    3685                      .dwattr $C$DW$568, DW_AT_type(*$C$DW$T$25)
    3686                      .dwattr $C$DW$568, DW_AT_name("XCLK")
    3687                      .dwattr $C$DW$568, DW_AT_TI_symbol_name("_XCLK")
    3688                      .dwattr $C$DW$568, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    3689                      .dwattr $C$DW$568, DW_AT_accessibility(DW_ACCESS_public)
    3690              $C$DW$569       .dwtag  DW_TAG_member
    3691                      .dwattr $C$DW$569, DW_AT_type(*$C$DW$T$25)
    3692                      .dwattr $C$DW$569, DW_AT_name("rsvd_1")
    3693                      .dwattr $C$DW$569, DW_AT_TI_symbol_name("_rsvd_1")
    3694                      .dwattr $C$DW$569, DW_AT_data_member_location[DW_OP_plus_uconst 0x1]
    3695                      .dwattr $C$DW$569, DW_AT_accessibility(DW_ACCESS_public)
    3696              $C$DW$570       .dwtag  DW_TAG_member
    3697                      .dwattr $C$DW$570, DW_AT_type(*$C$DW$T$25)
    3698                      .dwattr $C$DW$570, DW_AT_name("CLKCTL")
    3699                      .dwattr $C$DW$570, DW_AT_TI_symbol_name("_CLKCTL")
    3700                      .dwattr $C$DW$570, DW_AT_data_member_location[DW_OP_plus_uconst 0x2]
    3701                      .dwattr $C$DW$570, DW_AT_accessibility(DW_ACCESS_public)
    3702              $C$DW$571       .dwtag  DW_TAG_member
    3703                      .dwattr $C$DW$571, DW_AT_type(*$C$DW$T$40)
    3704                      .dwattr $C$DW$571, DW_AT_name("rsvd_2")
    3705                      .dwattr $C$DW$571, DW_AT_TI_symbol_name("_rsvd_2")
    3706                      .dwattr $C$DW$571, DW_AT_data_member_location[DW_OP_plus_uconst 0x3]
    3707                      .dwattr $C$DW$571, DW_AT_accessibility(DW_ACCESS_public)
    3708              $C$DW$572       .dwtag  DW_TAG_member
    3709                      .dwattr $C$DW$572, DW_AT_type(*$C$DW$T$25)
    3710                      .dwattr $C$DW$572, DW_AT_name("LOSPCP")
    3711                      .dwattr $C$DW$572, DW_AT_TI_symbol_name("_LOSPCP")
    3712                      .dwattr $C$DW$572, DW_AT_data_member_location[DW_OP_plus_uconst 0xb]
    3713                      .dwattr $C$DW$572, DW_AT_accessibility(DW_ACCESS_public)
    3714              $C$DW$573       .dwtag  DW_TAG_member
    3715                      .dwattr $C$DW$573, DW_AT_type(*$C$DW$T$25)
    3716                      .dwattr $C$DW$573, DW_AT_name("PCLKCR0")
    3717                      .dwattr $C$DW$573, DW_AT_TI_symbol_name("_PCLKCR0")
    3718                      .dwattr $C$DW$573, DW_AT_data_member_location[DW_OP_plus_uconst 0xc]
    3719                      .dwattr $C$DW$573, DW_AT_accessibility(DW_ACCESS_public)
    3720              $C$DW$574       .dwtag  DW_TAG_member
    3721                      .dwattr $C$DW$574, DW_AT_type(*$C$DW$T$25)
    3722                      .dwattr $C$DW$574, DW_AT_name("PCLKCR1")
    3723                      .dwattr $C$DW$574, DW_AT_TI_symbol_name("_PCLKCR1")
    3724                      .dwattr $C$DW$574, DW_AT_data_member_location[DW_OP_plus_uconst 0xd]
    3725                      .dwattr $C$DW$574, DW_AT_accessibility(DW_ACCESS_public)
    3726              $C$DW$575       .dwtag  DW_TAG_member
    3727                      .dwattr $C$DW$575, DW_AT_type(*$C$DW$T$28)
    3728                      .dwattr $C$DW$575, DW_AT_name("rsvd_3")
    3729                      .dwattr $C$DW$575, DW_AT_TI_symbol_name("_rsvd_3")
    3730                      .dwattr $C$DW$575, DW_AT_data_member_location[DW_OP_plus_uconst 0xe]
    3731                      .dwattr $C$DW$575, DW_AT_accessibility(DW_ACCESS_public)
    3732              $C$DW$576       .dwtag  DW_TAG_member
    3733                      .dwattr $C$DW$576, DW_AT_type(*$C$DW$T$25)
    3734                      .dwattr $C$DW$576, DW_AT_name("PCLKCR3")
    3735                      .dwattr $C$DW$576, DW_AT_TI_symbol_name("_PCLKCR3")
TMS320C2000 Assembler PC v6.2.5 Thu Sep 21 15:49:24 2017

Tools Copyright (c) 1996-2014 Texas Instruments Incorporated
C:\Users\wmj\AppData\Local\Temp\1688411                              PAGE   74

    3736                      .dwattr $C$DW$576, DW_AT_data_member_location[DW_OP_plus_uconst 0x10]
    3737                      .dwattr $C$DW$576, DW_AT_accessibility(DW_ACCESS_public)
    3738                      .dwendtag $C$DW$T$41
    3739              
    3740              $C$DW$T$99      .dwtag  DW_TAG_pointer_type
    3741                      .dwattr $C$DW$T$99, DW_AT_type(*$C$DW$T$41)
    3742                      .dwattr $C$DW$T$99, DW_AT_address_class(0x16)
    3743              $C$DW$T$100     .dwtag  DW_TAG_typedef, DW_AT_name("CLK_Handle")
    3744                      .dwattr $C$DW$T$100, DW_AT_type(*$C$DW$T$99)
    3745                      .dwattr $C$DW$T$100, DW_AT_language(DW_LANG_C)
    3746              
    3747              $C$DW$T$42      .dwtag  DW_TAG_structure_type
    3748                      .dwattr $C$DW$T$42, DW_AT_name("_CPU_Obj_")
    3749                      .dwattr $C$DW$T$42, DW_AT_byte_size(0x01)
    3750              $C$DW$577       .dwtag  DW_TAG_member
    3751                      .dwattr $C$DW$577, DW_AT_type(*$C$DW$T$37)
    3752                      .dwattr $C$DW$577, DW_AT_name("tmp")
    3753                      .dwattr $C$DW$577, DW_AT_TI_symbol_name("_tmp")
    3754                      .dwattr $C$DW$577, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    3755                      .dwattr $C$DW$577, DW_AT_accessibility(DW_ACCESS_public)
    3756                      .dwendtag $C$DW$T$42
    3757              
    3758              $C$DW$T$101     .dwtag  DW_TAG_pointer_type
    3759                      .dwattr $C$DW$T$101, DW_AT_type(*$C$DW$T$42)
    3760                      .dwattr $C$DW$T$101, DW_AT_address_class(0x16)
    3761              $C$DW$T$102     .dwtag  DW_TAG_typedef, DW_AT_name("CPU_Handle")
    3762                      .dwattr $C$DW$T$102, DW_AT_type(*$C$DW$T$101)
    3763                      .dwattr $C$DW$T$102, DW_AT_language(DW_LANG_C)
    3764              
    3765              $C$DW$T$77      .dwtag  DW_TAG_structure_type
    3766                      .dwattr $C$DW$T$77, DW_AT_name("_CTRL_Obj_")
    3767                      .dwattr $C$DW$T$77, DW_AT_byte_size(0x112)
    3768              $C$DW$578       .dwtag  DW_TAG_member
    3769                      .dwattr $C$DW$578, DW_AT_type(*$C$DW$T$43)
    3770                      .dwattr $C$DW$578, DW_AT_name("version")
    3771                      .dwattr $C$DW$578, DW_AT_TI_symbol_name("_version")
    3772                      .dwattr $C$DW$578, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    3773                      .dwattr $C$DW$578, DW_AT_accessibility(DW_ACCESS_public)
    3774              $C$DW$579       .dwtag  DW_TAG_member
    3775                      .dwattr $C$DW$579, DW_AT_type(*$C$DW$T$45)
    3776                      .dwattr $C$DW$579, DW_AT_name("state")
    3777                      .dwattr $C$DW$579, DW_AT_TI_symbol_name("_state")
    3778                      .dwattr $C$DW$579, DW_AT_data_member_location[DW_OP_plus_uconst 0x4]
    3779                      .dwattr $C$DW$579, DW_AT_accessibility(DW_ACCESS_public)
    3780              $C$DW$580       .dwtag  DW_TAG_member
    3781                      .dwattr $C$DW$580, DW_AT_type(*$C$DW$T$45)
    3782                      .dwattr $C$DW$580, DW_AT_name("prevState")
    3783                      .dwattr $C$DW$580, DW_AT_TI_symbol_name("_prevState")
    3784                      .dwattr $C$DW$580, DW_AT_data_member_location[DW_OP_plus_uconst 0x5]
    3785                      .dwattr $C$DW$580, DW_AT_accessibility(DW_ACCESS_public)
    3786              $C$DW$581       .dwtag  DW_TAG_member
    3787                      .dwattr $C$DW$581, DW_AT_type(*$C$DW$T$47)
    3788                      .dwattr $C$DW$581, DW_AT_name("errorCode")
    3789                      .dwattr $C$DW$581, DW_AT_TI_symbol_name("_errorCode")
    3790                      .dwattr $C$DW$581, DW_AT_data_member_location[DW_OP_plus_uconst 0x6]
TMS320C2000 Assembler PC v6.2.5 Thu Sep 21 15:49:24 2017

Tools Copyright (c) 1996-2014 Texas Instruments Incorporated
C:\Users\wmj\AppData\Local\Temp\1688411                              PAGE   75

    3791                      .dwattr $C$DW$581, DW_AT_accessibility(DW_ACCESS_public)
    3792              $C$DW$582       .dwtag  DW_TAG_member
    3793                      .dwattr $C$DW$582, DW_AT_type(*$C$DW$T$49)
    3794                      .dwattr $C$DW$582, DW_AT_name("clarkeHandle_I")
    3795                      .dwattr $C$DW$582, DW_AT_TI_symbol_name("_clarkeHandle_I")
    3796                      .dwattr $C$DW$582, DW_AT_data_member_location[DW_OP_plus_uconst 0x8]
    3797                      .dwattr $C$DW$582, DW_AT_accessibility(DW_ACCESS_public)
    3798              $C$DW$583       .dwtag  DW_TAG_member
    3799                      .dwattr $C$DW$583, DW_AT_type(*$C$DW$T$50)
    3800                      .dwattr $C$DW$583, DW_AT_name("clarke_I")
    3801                      .dwattr $C$DW$583, DW_AT_TI_symbol_name("_clarke_I")
    3802                      .dwattr $C$DW$583, DW_AT_data_member_location[DW_OP_plus_uconst 0xa]
    3803                      .dwattr $C$DW$583, DW_AT_accessibility(DW_ACCESS_public)
    3804              $C$DW$584       .dwtag  DW_TAG_member
    3805                      .dwattr $C$DW$584, DW_AT_type(*$C$DW$T$49)
    3806                      .dwattr $C$DW$584, DW_AT_name("clarkeHandle_V")
    3807                      .dwattr $C$DW$584, DW_AT_TI_symbol_name("_clarkeHandle_V")
    3808                      .dwattr $C$DW$584, DW_AT_data_member_location[DW_OP_plus_uconst 0x10]
    3809                      .dwattr $C$DW$584, DW_AT_accessibility(DW_ACCESS_public)
    3810              $C$DW$585       .dwtag  DW_TAG_member
    3811                      .dwattr $C$DW$585, DW_AT_type(*$C$DW$T$50)
    3812                      .dwattr $C$DW$585, DW_AT_name("clarke_V")
    3813                      .dwattr $C$DW$585, DW_AT_TI_symbol_name("_clarke_V")
    3814                      .dwattr $C$DW$585, DW_AT_data_member_location[DW_OP_plus_uconst 0x12]
    3815                      .dwattr $C$DW$585, DW_AT_accessibility(DW_ACCESS_public)
    3816              $C$DW$586       .dwtag  DW_TAG_member
    3817                      .dwattr $C$DW$586, DW_AT_type(*$C$DW$T$52)
    3818                      .dwattr $C$DW$586, DW_AT_name("estHandle")
    3819                      .dwattr $C$DW$586, DW_AT_TI_symbol_name("_estHandle")
    3820                      .dwattr $C$DW$586, DW_AT_data_member_location[DW_OP_plus_uconst 0x18]
    3821                      .dwattr $C$DW$586, DW_AT_accessibility(DW_ACCESS_public)
    3822              $C$DW$587       .dwtag  DW_TAG_member
    3823                      .dwattr $C$DW$587, DW_AT_type(*$C$DW$T$54)
    3824                      .dwattr $C$DW$587, DW_AT_name("parkHandle")
    3825                      .dwattr $C$DW$587, DW_AT_TI_symbol_name("_parkHandle")
    3826                      .dwattr $C$DW$587, DW_AT_data_member_location[DW_OP_plus_uconst 0x1a]
    3827                      .dwattr $C$DW$587, DW_AT_accessibility(DW_ACCESS_public)
    3828              $C$DW$588       .dwtag  DW_TAG_member
    3829                      .dwattr $C$DW$588, DW_AT_type(*$C$DW$T$55)
    3830                      .dwattr $C$DW$588, DW_AT_name("park")
    3831                      .dwattr $C$DW$588, DW_AT_TI_symbol_name("_park")
    3832                      .dwattr $C$DW$588, DW_AT_data_member_location[DW_OP_plus_uconst 0x1c]
    3833                      .dwattr $C$DW$588, DW_AT_accessibility(DW_ACCESS_public)
    3834              $C$DW$589       .dwtag  DW_TAG_member
    3835                      .dwattr $C$DW$589, DW_AT_type(*$C$DW$T$57)
    3836                      .dwattr $C$DW$589, DW_AT_name("pidHandle_Id")
    3837                      .dwattr $C$DW$589, DW_AT_TI_symbol_name("_pidHandle_Id")
    3838                      .dwattr $C$DW$589, DW_AT_data_member_location[DW_OP_plus_uconst 0x20]
    3839                      .dwattr $C$DW$589, DW_AT_accessibility(DW_ACCESS_public)
    3840              $C$DW$590       .dwtag  DW_TAG_member
    3841                      .dwattr $C$DW$590, DW_AT_type(*$C$DW$T$58)
    3842                      .dwattr $C$DW$590, DW_AT_name("pid_Id")
    3843                      .dwattr $C$DW$590, DW_AT_TI_symbol_name("_pid_Id")
    3844                      .dwattr $C$DW$590, DW_AT_data_member_location[DW_OP_plus_uconst 0x22]
    3845                      .dwattr $C$DW$590, DW_AT_accessibility(DW_ACCESS_public)
TMS320C2000 Assembler PC v6.2.5 Thu Sep 21 15:49:24 2017

Tools Copyright (c) 1996-2014 Texas Instruments Incorporated
C:\Users\wmj\AppData\Local\Temp\1688411                              PAGE   76

    3846              $C$DW$591       .dwtag  DW_TAG_member
    3847                      .dwattr $C$DW$591, DW_AT_type(*$C$DW$T$57)
    3848                      .dwattr $C$DW$591, DW_AT_name("pidHandle_Iq")
    3849                      .dwattr $C$DW$591, DW_AT_TI_symbol_name("_pidHandle_Iq")
    3850                      .dwattr $C$DW$591, DW_AT_data_member_location[DW_OP_plus_uconst 0x32]
    3851                      .dwattr $C$DW$591, DW_AT_accessibility(DW_ACCESS_public)
    3852              $C$DW$592       .dwtag  DW_TAG_member
    3853                      .dwattr $C$DW$592, DW_AT_type(*$C$DW$T$58)
    3854                      .dwattr $C$DW$592, DW_AT_name("pid_Iq")
    3855                      .dwattr $C$DW$592, DW_AT_TI_symbol_name("_pid_Iq")
    3856                      .dwattr $C$DW$592, DW_AT_data_member_location[DW_OP_plus_uconst 0x34]
    3857                      .dwattr $C$DW$592, DW_AT_accessibility(DW_ACCESS_public)
    3858              $C$DW$593       .dwtag  DW_TAG_member
    3859                      .dwattr $C$DW$593, DW_AT_type(*$C$DW$T$57)
    3860                      .dwattr $C$DW$593, DW_AT_name("pidHandle_spd")
    3861                      .dwattr $C$DW$593, DW_AT_TI_symbol_name("_pidHandle_spd")
    3862                      .dwattr $C$DW$593, DW_AT_data_member_location[DW_OP_plus_uconst 0x44]
    3863                      .dwattr $C$DW$593, DW_AT_accessibility(DW_ACCESS_public)
    3864              $C$DW$594       .dwtag  DW_TAG_member
    3865                      .dwattr $C$DW$594, DW_AT_type(*$C$DW$T$58)
    3866                      .dwattr $C$DW$594, DW_AT_name("pid_spd")
    3867                      .dwattr $C$DW$594, DW_AT_TI_symbol_name("_pid_spd")
    3868                      .dwattr $C$DW$594, DW_AT_data_member_location[DW_OP_plus_uconst 0x46]
    3869                      .dwattr $C$DW$594, DW_AT_accessibility(DW_ACCESS_public)
    3870              $C$DW$595       .dwtag  DW_TAG_member
    3871                      .dwattr $C$DW$595, DW_AT_type(*$C$DW$T$60)
    3872                      .dwattr $C$DW$595, DW_AT_name("iparkHandle")
    3873                      .dwattr $C$DW$595, DW_AT_TI_symbol_name("_iparkHandle")
    3874                      .dwattr $C$DW$595, DW_AT_data_member_location[DW_OP_plus_uconst 0x56]
    3875                      .dwattr $C$DW$595, DW_AT_accessibility(DW_ACCESS_public)
    3876              $C$DW$596       .dwtag  DW_TAG_member
    3877                      .dwattr $C$DW$596, DW_AT_type(*$C$DW$T$61)
    3878                      .dwattr $C$DW$596, DW_AT_name("ipark")
    3879                      .dwattr $C$DW$596, DW_AT_TI_symbol_name("_ipark")
    3880                      .dwattr $C$DW$596, DW_AT_data_member_location[DW_OP_plus_uconst 0x58]
    3881                      .dwattr $C$DW$596, DW_AT_accessibility(DW_ACCESS_public)
    3882              $C$DW$597       .dwtag  DW_TAG_member
    3883                      .dwattr $C$DW$597, DW_AT_type(*$C$DW$T$63)
    3884                      .dwattr $C$DW$597, DW_AT_name("svgenHandle")
    3885                      .dwattr $C$DW$597, DW_AT_TI_symbol_name("_svgenHandle")
    3886                      .dwattr $C$DW$597, DW_AT_data_member_location[DW_OP_plus_uconst 0x5c]
    3887                      .dwattr $C$DW$597, DW_AT_accessibility(DW_ACCESS_public)
    3888              $C$DW$598       .dwtag  DW_TAG_member
    3889                      .dwattr $C$DW$598, DW_AT_type(*$C$DW$T$64)
    3890                      .dwattr $C$DW$598, DW_AT_name("svgen")
    3891                      .dwattr $C$DW$598, DW_AT_TI_symbol_name("_svgen")
    3892                      .dwattr $C$DW$598, DW_AT_data_member_location[DW_OP_plus_uconst 0x5e]
    3893                      .dwattr $C$DW$598, DW_AT_accessibility(DW_ACCESS_public)
    3894              $C$DW$599       .dwtag  DW_TAG_member
    3895                      .dwattr $C$DW$599, DW_AT_type(*$C$DW$T$66)
    3896                      .dwattr $C$DW$599, DW_AT_name("trajHandle_Id")
    3897                      .dwattr $C$DW$599, DW_AT_TI_symbol_name("_trajHandle_Id")
    3898                      .dwattr $C$DW$599, DW_AT_data_member_location[DW_OP_plus_uconst 0x60]
    3899                      .dwattr $C$DW$599, DW_AT_accessibility(DW_ACCESS_public)
    3900              $C$DW$600       .dwtag  DW_TAG_member
TMS320C2000 Assembler PC v6.2.5 Thu Sep 21 15:49:24 2017

Tools Copyright (c) 1996-2014 Texas Instruments Incorporated
C:\Users\wmj\AppData\Local\Temp\1688411                              PAGE   77

    3901                      .dwattr $C$DW$600, DW_AT_type(*$C$DW$T$67)
    3902                      .dwattr $C$DW$600, DW_AT_name("traj_Id")
    3903                      .dwattr $C$DW$600, DW_AT_TI_symbol_name("_traj_Id")
    3904                      .dwattr $C$DW$600, DW_AT_data_member_location[DW_OP_plus_uconst 0x62]
    3905                      .dwattr $C$DW$600, DW_AT_accessibility(DW_ACCESS_public)
    3906              $C$DW$601       .dwtag  DW_TAG_member
    3907                      .dwattr $C$DW$601, DW_AT_type(*$C$DW$T$66)
    3908                      .dwattr $C$DW$601, DW_AT_name("trajHandle_spd")
    3909                      .dwattr $C$DW$601, DW_AT_TI_symbol_name("_trajHandle_spd")
    3910                      .dwattr $C$DW$601, DW_AT_data_member_location[DW_OP_plus_uconst 0x6c]
    3911                      .dwattr $C$DW$601, DW_AT_accessibility(DW_ACCESS_public)
    3912              $C$DW$602       .dwtag  DW_TAG_member
    3913                      .dwattr $C$DW$602, DW_AT_type(*$C$DW$T$67)
    3914                      .dwattr $C$DW$602, DW_AT_name("traj_spd")
    3915                      .dwattr $C$DW$602, DW_AT_TI_symbol_name("_traj_spd")
    3916                      .dwattr $C$DW$602, DW_AT_data_member_location[DW_OP_plus_uconst 0x6e]
    3917                      .dwattr $C$DW$602, DW_AT_accessibility(DW_ACCESS_public)
    3918              $C$DW$603       .dwtag  DW_TAG_member
    3919                      .dwattr $C$DW$603, DW_AT_type(*$C$DW$T$66)
    3920                      .dwattr $C$DW$603, DW_AT_name("trajHandle_spdMax")
    3921                      .dwattr $C$DW$603, DW_AT_TI_symbol_name("_trajHandle_spdMax")
    3922                      .dwattr $C$DW$603, DW_AT_data_member_location[DW_OP_plus_uconst 0x78]
    3923                      .dwattr $C$DW$603, DW_AT_accessibility(DW_ACCESS_public)
    3924              $C$DW$604       .dwtag  DW_TAG_member
    3925                      .dwattr $C$DW$604, DW_AT_type(*$C$DW$T$67)
    3926                      .dwattr $C$DW$604, DW_AT_name("traj_spdMax")
    3927                      .dwattr $C$DW$604, DW_AT_TI_symbol_name("_traj_spdMax")
    3928                      .dwattr $C$DW$604, DW_AT_data_member_location[DW_OP_plus_uconst 0x7a]
    3929                      .dwattr $C$DW$604, DW_AT_accessibility(DW_ACCESS_public)
    3930              $C$DW$605       .dwtag  DW_TAG_member
    3931                      .dwattr $C$DW$605, DW_AT_type(*$C$DW$T$68)
    3932                      .dwattr $C$DW$605, DW_AT_name("motorParams")
    3933                      .dwattr $C$DW$605, DW_AT_TI_symbol_name("_motorParams")
    3934                      .dwattr $C$DW$605, DW_AT_data_member_location[DW_OP_plus_uconst 0x84]
    3935                      .dwattr $C$DW$605, DW_AT_accessibility(DW_ACCESS_public)
    3936              $C$DW$606       .dwtag  DW_TAG_member
    3937                      .dwattr $C$DW$606, DW_AT_type(*$C$DW$T$71)
    3938                      .dwattr $C$DW$606, DW_AT_name("waitTimes")
    3939                      .dwattr $C$DW$606, DW_AT_TI_symbol_name("_waitTimes")
    3940                      .dwattr $C$DW$606, DW_AT_data_member_location[DW_OP_plus_uconst 0x92]
    3941                      .dwattr $C$DW$606, DW_AT_accessibility(DW_ACCESS_public)
    3942              $C$DW$607       .dwtag  DW_TAG_member
    3943                      .dwattr $C$DW$607, DW_AT_type(*$C$DW$T$70)
    3944                      .dwattr $C$DW$607, DW_AT_name("counter_state")
    3945                      .dwattr $C$DW$607, DW_AT_TI_symbol_name("_counter_state")
    3946                      .dwattr $C$DW$607, DW_AT_data_member_location[DW_OP_plus_uconst 0x9a]
    3947                      .dwattr $C$DW$607, DW_AT_accessibility(DW_ACCESS_public)
    3948              $C$DW$608       .dwtag  DW_TAG_member
    3949                      .dwattr $C$DW$608, DW_AT_type(*$C$DW$T$72)
    3950                      .dwattr $C$DW$608, DW_AT_name("numIsrTicksPerCtrlTick")
    3951                      .dwattr $C$DW$608, DW_AT_TI_symbol_name("_numIsrTicksPerCtrlTick")
    3952                      .dwattr $C$DW$608, DW_AT_data_member_location[DW_OP_plus_uconst 0x9c]
    3953                      .dwattr $C$DW$608, DW_AT_accessibility(DW_ACCESS_public)
    3954              $C$DW$609       .dwtag  DW_TAG_member
    3955                      .dwattr $C$DW$609, DW_AT_type(*$C$DW$T$72)
TMS320C2000 Assembler PC v6.2.5 Thu Sep 21 15:49:24 2017

Tools Copyright (c) 1996-2014 Texas Instruments Incorporated
C:\Users\wmj\AppData\Local\Temp\1688411                              PAGE   78

    3956                      .dwattr $C$DW$609, DW_AT_name("numCtrlTicksPerCurrentTick")
    3957                      .dwattr $C$DW$609, DW_AT_TI_symbol_name("_numCtrlTicksPerCurrentTick")
    3958                      .dwattr $C$DW$609, DW_AT_data_member_location[DW_OP_plus_uconst 0x9d]
    3959                      .dwattr $C$DW$609, DW_AT_accessibility(DW_ACCESS_public)
    3960              $C$DW$610       .dwtag  DW_TAG_member
    3961                      .dwattr $C$DW$610, DW_AT_type(*$C$DW$T$72)
    3962                      .dwattr $C$DW$610, DW_AT_name("numCtrlTicksPerSpeedTick")
    3963                      .dwattr $C$DW$610, DW_AT_TI_symbol_name("_numCtrlTicksPerSpeedTick")
    3964                      .dwattr $C$DW$610, DW_AT_data_member_location[DW_OP_plus_uconst 0x9e]
    3965                      .dwattr $C$DW$610, DW_AT_accessibility(DW_ACCESS_public)
    3966              $C$DW$611       .dwtag  DW_TAG_member
    3967                      .dwattr $C$DW$611, DW_AT_type(*$C$DW$T$72)
    3968                      .dwattr $C$DW$611, DW_AT_name("numCtrlTicksPerTrajTick")
    3969                      .dwattr $C$DW$611, DW_AT_TI_symbol_name("_numCtrlTicksPerTrajTick")
    3970                      .dwattr $C$DW$611, DW_AT_data_member_location[DW_OP_plus_uconst 0x9f]
    3971                      .dwattr $C$DW$611, DW_AT_accessibility(DW_ACCESS_public)
    3972              $C$DW$612       .dwtag  DW_TAG_member
    3973                      .dwattr $C$DW$612, DW_AT_type(*$C$DW$T$70)
    3974                      .dwattr $C$DW$612, DW_AT_name("ctrlFreq_Hz")
    3975                      .dwattr $C$DW$612, DW_AT_TI_symbol_name("_ctrlFreq_Hz")
    3976                      .dwattr $C$DW$612, DW_AT_data_member_location[DW_OP_plus_uconst 0xa0]
    3977                      .dwattr $C$DW$612, DW_AT_accessibility(DW_ACCESS_public)
    3978              $C$DW$613       .dwtag  DW_TAG_member
    3979                      .dwattr $C$DW$613, DW_AT_type(*$C$DW$T$70)
    3980                      .dwattr $C$DW$613, DW_AT_name("trajFreq_Hz")
    3981                      .dwattr $C$DW$613, DW_AT_TI_symbol_name("_trajFreq_Hz")
    3982                      .dwattr $C$DW$613, DW_AT_data_member_location[DW_OP_plus_uconst 0xa2]
    3983                      .dwattr $C$DW$613, DW_AT_accessibility(DW_ACCESS_public)
    3984              $C$DW$614       .dwtag  DW_TAG_member
    3985                      .dwattr $C$DW$614, DW_AT_type(*$C$DW$T$33)
    3986                      .dwattr $C$DW$614, DW_AT_name("trajPeriod_sec")
    3987                      .dwattr $C$DW$614, DW_AT_TI_symbol_name("_trajPeriod_sec")
    3988                      .dwattr $C$DW$614, DW_AT_data_member_location[DW_OP_plus_uconst 0xa4]
    3989                      .dwattr $C$DW$614, DW_AT_accessibility(DW_ACCESS_public)
    3990              $C$DW$615       .dwtag  DW_TAG_member
    3991                      .dwattr $C$DW$615, DW_AT_type(*$C$DW$T$73)
    3992                      .dwattr $C$DW$615, DW_AT_name("ctrlPeriod_sec")
    3993                      .dwattr $C$DW$615, DW_AT_TI_symbol_name("_ctrlPeriod_sec")
    3994                      .dwattr $C$DW$615, DW_AT_data_member_location[DW_OP_plus_uconst 0xa6]
    3995                      .dwattr $C$DW$615, DW_AT_accessibility(DW_ACCESS_public)
    3996              $C$DW$616       .dwtag  DW_TAG_member
    3997                      .dwattr $C$DW$616, DW_AT_type(*$C$DW$T$33)
    3998                      .dwattr $C$DW$616, DW_AT_name("maxVsMag_pu")
    3999                      .dwattr $C$DW$616, DW_AT_TI_symbol_name("_maxVsMag_pu")
    4000                      .dwattr $C$DW$616, DW_AT_data_member_location[DW_OP_plus_uconst 0xa8]
    4001                      .dwattr $C$DW$616, DW_AT_accessibility(DW_ACCESS_public)
    4002              $C$DW$617       .dwtag  DW_TAG_member
    4003                      .dwattr $C$DW$617, DW_AT_type(*$C$DW$T$34)
    4004                      .dwattr $C$DW$617, DW_AT_name("Iab_in")
    4005                      .dwattr $C$DW$617, DW_AT_TI_symbol_name("_Iab_in")
    4006                      .dwattr $C$DW$617, DW_AT_data_member_location[DW_OP_plus_uconst 0xaa]
    4007                      .dwattr $C$DW$617, DW_AT_accessibility(DW_ACCESS_public)
    4008              $C$DW$618       .dwtag  DW_TAG_member
    4009                      .dwattr $C$DW$618, DW_AT_type(*$C$DW$T$34)
    4010                      .dwattr $C$DW$618, DW_AT_name("Iab_filt")
TMS320C2000 Assembler PC v6.2.5 Thu Sep 21 15:49:24 2017

Tools Copyright (c) 1996-2014 Texas Instruments Incorporated
C:\Users\wmj\AppData\Local\Temp\1688411                              PAGE   79

    4011                      .dwattr $C$DW$618, DW_AT_TI_symbol_name("_Iab_filt")
    4012                      .dwattr $C$DW$618, DW_AT_data_member_location[DW_OP_plus_uconst 0xae]
    4013                      .dwattr $C$DW$618, DW_AT_accessibility(DW_ACCESS_public)
    4014              $C$DW$619       .dwtag  DW_TAG_member
    4015                      .dwattr $C$DW$619, DW_AT_type(*$C$DW$T$34)
    4016                      .dwattr $C$DW$619, DW_AT_name("Idq_in")
    4017                      .dwattr $C$DW$619, DW_AT_TI_symbol_name("_Idq_in")
    4018                      .dwattr $C$DW$619, DW_AT_data_member_location[DW_OP_plus_uconst 0xb2]
    4019                      .dwattr $C$DW$619, DW_AT_accessibility(DW_ACCESS_public)
    4020              $C$DW$620       .dwtag  DW_TAG_member
    4021                      .dwattr $C$DW$620, DW_AT_type(*$C$DW$T$34)
    4022                      .dwattr $C$DW$620, DW_AT_name("Vab_in")
    4023                      .dwattr $C$DW$620, DW_AT_TI_symbol_name("_Vab_in")
    4024                      .dwattr $C$DW$620, DW_AT_data_member_location[DW_OP_plus_uconst 0xb6]
    4025                      .dwattr $C$DW$620, DW_AT_accessibility(DW_ACCESS_public)
    4026              $C$DW$621       .dwtag  DW_TAG_member
    4027                      .dwattr $C$DW$621, DW_AT_type(*$C$DW$T$33)
    4028                      .dwattr $C$DW$621, DW_AT_name("spd_out")
    4029                      .dwattr $C$DW$621, DW_AT_TI_symbol_name("_spd_out")
    4030                      .dwattr $C$DW$621, DW_AT_data_member_location[DW_OP_plus_uconst 0xba]
    4031                      .dwattr $C$DW$621, DW_AT_accessibility(DW_ACCESS_public)
    4032              $C$DW$622       .dwtag  DW_TAG_member
    4033                      .dwattr $C$DW$622, DW_AT_type(*$C$DW$T$34)
    4034                      .dwattr $C$DW$622, DW_AT_name("Vab_out")
    4035                      .dwattr $C$DW$622, DW_AT_TI_symbol_name("_Vab_out")
    4036                      .dwattr $C$DW$622, DW_AT_data_member_location[DW_OP_plus_uconst 0xbc]
    4037                      .dwattr $C$DW$622, DW_AT_accessibility(DW_ACCESS_public)
    4038              $C$DW$623       .dwtag  DW_TAG_member
    4039                      .dwattr $C$DW$623, DW_AT_type(*$C$DW$T$34)
    4040                      .dwattr $C$DW$623, DW_AT_name("Vdq_out")
    4041                      .dwattr $C$DW$623, DW_AT_TI_symbol_name("_Vdq_out")
    4042                      .dwattr $C$DW$623, DW_AT_data_member_location[DW_OP_plus_uconst 0xc0]
    4043                      .dwattr $C$DW$623, DW_AT_accessibility(DW_ACCESS_public)
    4044              $C$DW$624       .dwtag  DW_TAG_member
    4045                      .dwattr $C$DW$624, DW_AT_type(*$C$DW$T$73)
    4046                      .dwattr $C$DW$624, DW_AT_name("Rhf")
    4047                      .dwattr $C$DW$624, DW_AT_TI_symbol_name("_Rhf")
    4048                      .dwattr $C$DW$624, DW_AT_data_member_location[DW_OP_plus_uconst 0xc4]
    4049                      .dwattr $C$DW$624, DW_AT_accessibility(DW_ACCESS_public)
    4050              $C$DW$625       .dwtag  DW_TAG_member
    4051                      .dwattr $C$DW$625, DW_AT_type(*$C$DW$T$73)
    4052                      .dwattr $C$DW$625, DW_AT_name("Lhf")
    4053                      .dwattr $C$DW$625, DW_AT_TI_symbol_name("_Lhf")
    4054                      .dwattr $C$DW$625, DW_AT_data_member_location[DW_OP_plus_uconst 0xc6]
    4055                      .dwattr $C$DW$625, DW_AT_accessibility(DW_ACCESS_public)
    4056              $C$DW$626       .dwtag  DW_TAG_member
    4057                      .dwattr $C$DW$626, DW_AT_type(*$C$DW$T$73)
    4058                      .dwattr $C$DW$626, DW_AT_name("RoverL")
    4059                      .dwattr $C$DW$626, DW_AT_TI_symbol_name("_RoverL")
    4060                      .dwattr $C$DW$626, DW_AT_data_member_location[DW_OP_plus_uconst 0xc8]
    4061                      .dwattr $C$DW$626, DW_AT_accessibility(DW_ACCESS_public)
    4062              $C$DW$627       .dwtag  DW_TAG_member
    4063                      .dwattr $C$DW$627, DW_AT_type(*$C$DW$T$33)
    4064                      .dwattr $C$DW$627, DW_AT_name("Kp_Id")
    4065                      .dwattr $C$DW$627, DW_AT_TI_symbol_name("_Kp_Id")
TMS320C2000 Assembler PC v6.2.5 Thu Sep 21 15:49:24 2017

Tools Copyright (c) 1996-2014 Texas Instruments Incorporated
C:\Users\wmj\AppData\Local\Temp\1688411                              PAGE   80

    4066                      .dwattr $C$DW$627, DW_AT_data_member_location[DW_OP_plus_uconst 0xca]
    4067                      .dwattr $C$DW$627, DW_AT_accessibility(DW_ACCESS_public)
    4068              $C$DW$628       .dwtag  DW_TAG_member
    4069                      .dwattr $C$DW$628, DW_AT_type(*$C$DW$T$33)
    4070                      .dwattr $C$DW$628, DW_AT_name("Kp_Iq")
    4071                      .dwattr $C$DW$628, DW_AT_TI_symbol_name("_Kp_Iq")
    4072                      .dwattr $C$DW$628, DW_AT_data_member_location[DW_OP_plus_uconst 0xcc]
    4073                      .dwattr $C$DW$628, DW_AT_accessibility(DW_ACCESS_public)
    4074              $C$DW$629       .dwtag  DW_TAG_member
    4075                      .dwattr $C$DW$629, DW_AT_type(*$C$DW$T$33)
    4076                      .dwattr $C$DW$629, DW_AT_name("Kp_spd")
    4077                      .dwattr $C$DW$629, DW_AT_TI_symbol_name("_Kp_spd")
    4078                      .dwattr $C$DW$629, DW_AT_data_member_location[DW_OP_plus_uconst 0xce]
    4079                      .dwattr $C$DW$629, DW_AT_accessibility(DW_ACCESS_public)
    4080              $C$DW$630       .dwtag  DW_TAG_member
    4081                      .dwattr $C$DW$630, DW_AT_type(*$C$DW$T$33)
    4082                      .dwattr $C$DW$630, DW_AT_name("Ki_Id")
    4083                      .dwattr $C$DW$630, DW_AT_TI_symbol_name("_Ki_Id")
    4084                      .dwattr $C$DW$630, DW_AT_data_member_location[DW_OP_plus_uconst 0xd0]
    4085                      .dwattr $C$DW$630, DW_AT_accessibility(DW_ACCESS_public)
    4086              $C$DW$631       .dwtag  DW_TAG_member
    4087                      .dwattr $C$DW$631, DW_AT_type(*$C$DW$T$33)
    4088                      .dwattr $C$DW$631, DW_AT_name("Ki_Iq")
    4089                      .dwattr $C$DW$631, DW_AT_TI_symbol_name("_Ki_Iq")
    4090                      .dwattr $C$DW$631, DW_AT_data_member_location[DW_OP_plus_uconst 0xd2]
    4091                      .dwattr $C$DW$631, DW_AT_accessibility(DW_ACCESS_public)
    4092              $C$DW$632       .dwtag  DW_TAG_member
    4093                      .dwattr $C$DW$632, DW_AT_type(*$C$DW$T$33)
    4094                      .dwattr $C$DW$632, DW_AT_name("Ki_spd")
    4095                      .dwattr $C$DW$632, DW_AT_TI_symbol_name("_Ki_spd")
    4096                      .dwattr $C$DW$632, DW_AT_data_member_location[DW_OP_plus_uconst 0xd4]
    4097                      .dwattr $C$DW$632, DW_AT_accessibility(DW_ACCESS_public)
    4098              $C$DW$633       .dwtag  DW_TAG_member
    4099                      .dwattr $C$DW$633, DW_AT_type(*$C$DW$T$33)
    4100                      .dwattr $C$DW$633, DW_AT_name("Kd_Id")
    4101                      .dwattr $C$DW$633, DW_AT_TI_symbol_name("_Kd_Id")
    4102                      .dwattr $C$DW$633, DW_AT_data_member_location[DW_OP_plus_uconst 0xd6]
    4103                      .dwattr $C$DW$633, DW_AT_accessibility(DW_ACCESS_public)
    4104              $C$DW$634       .dwtag  DW_TAG_member
    4105                      .dwattr $C$DW$634, DW_AT_type(*$C$DW$T$33)
    4106                      .dwattr $C$DW$634, DW_AT_name("Kd_Iq")
    4107                      .dwattr $C$DW$634, DW_AT_TI_symbol_name("_Kd_Iq")
    4108                      .dwattr $C$DW$634, DW_AT_data_member_location[DW_OP_plus_uconst 0xd8]
    4109                      .dwattr $C$DW$634, DW_AT_accessibility(DW_ACCESS_public)
    4110              $C$DW$635       .dwtag  DW_TAG_member
    4111                      .dwattr $C$DW$635, DW_AT_type(*$C$DW$T$33)
    4112                      .dwattr $C$DW$635, DW_AT_name("Kd_spd")
    4113                      .dwattr $C$DW$635, DW_AT_TI_symbol_name("_Kd_spd")
    4114                      .dwattr $C$DW$635, DW_AT_data_member_location[DW_OP_plus_uconst 0xda]
    4115                      .dwattr $C$DW$635, DW_AT_accessibility(DW_ACCESS_public)
    4116              $C$DW$636       .dwtag  DW_TAG_member
    4117                      .dwattr $C$DW$636, DW_AT_type(*$C$DW$T$33)
    4118                      .dwattr $C$DW$636, DW_AT_name("Ui_Id")
    4119                      .dwattr $C$DW$636, DW_AT_TI_symbol_name("_Ui_Id")
    4120                      .dwattr $C$DW$636, DW_AT_data_member_location[DW_OP_plus_uconst 0xdc]
TMS320C2000 Assembler PC v6.2.5 Thu Sep 21 15:49:24 2017

Tools Copyright (c) 1996-2014 Texas Instruments Incorporated
C:\Users\wmj\AppData\Local\Temp\1688411                              PAGE   81

    4121                      .dwattr $C$DW$636, DW_AT_accessibility(DW_ACCESS_public)
    4122              $C$DW$637       .dwtag  DW_TAG_member
    4123                      .dwattr $C$DW$637, DW_AT_type(*$C$DW$T$33)
    4124                      .dwattr $C$DW$637, DW_AT_name("Ui_Iq")
    4125                      .dwattr $C$DW$637, DW_AT_TI_symbol_name("_Ui_Iq")
    4126                      .dwattr $C$DW$637, DW_AT_data_member_location[DW_OP_plus_uconst 0xde]
    4127                      .dwattr $C$DW$637, DW_AT_accessibility(DW_ACCESS_public)
    4128              $C$DW$638       .dwtag  DW_TAG_member
    4129                      .dwattr $C$DW$638, DW_AT_type(*$C$DW$T$33)
    4130                      .dwattr $C$DW$638, DW_AT_name("Ui_spd")
    4131                      .dwattr $C$DW$638, DW_AT_TI_symbol_name("_Ui_spd")
    4132                      .dwattr $C$DW$638, DW_AT_data_member_location[DW_OP_plus_uconst 0xe0]
    4133                      .dwattr $C$DW$638, DW_AT_accessibility(DW_ACCESS_public)
    4134              $C$DW$639       .dwtag  DW_TAG_member
    4135                      .dwattr $C$DW$639, DW_AT_type(*$C$DW$T$34)
    4136                      .dwattr $C$DW$639, DW_AT_name("Idq_ref")
    4137                      .dwattr $C$DW$639, DW_AT_TI_symbol_name("_Idq_ref")
    4138                      .dwattr $C$DW$639, DW_AT_data_member_location[DW_OP_plus_uconst 0xe2]
    4139                      .dwattr $C$DW$639, DW_AT_accessibility(DW_ACCESS_public)
    4140              $C$DW$640       .dwtag  DW_TAG_member
    4141                      .dwattr $C$DW$640, DW_AT_type(*$C$DW$T$33)
    4142                      .dwattr $C$DW$640, DW_AT_name("IdRated")
    4143                      .dwattr $C$DW$640, DW_AT_TI_symbol_name("_IdRated")
    4144                      .dwattr $C$DW$640, DW_AT_data_member_location[DW_OP_plus_uconst 0xe6]
    4145                      .dwattr $C$DW$640, DW_AT_accessibility(DW_ACCESS_public)
    4146              $C$DW$641       .dwtag  DW_TAG_member
    4147                      .dwattr $C$DW$641, DW_AT_type(*$C$DW$T$33)
    4148                      .dwattr $C$DW$641, DW_AT_name("spd_ref")
    4149                      .dwattr $C$DW$641, DW_AT_TI_symbol_name("_spd_ref")
    4150                      .dwattr $C$DW$641, DW_AT_data_member_location[DW_OP_plus_uconst 0xe8]
    4151                      .dwattr $C$DW$641, DW_AT_accessibility(DW_ACCESS_public)
    4152              $C$DW$642       .dwtag  DW_TAG_member
    4153                      .dwattr $C$DW$642, DW_AT_type(*$C$DW$T$33)
    4154                      .dwattr $C$DW$642, DW_AT_name("spd_max")
    4155                      .dwattr $C$DW$642, DW_AT_TI_symbol_name("_spd_max")
    4156                      .dwattr $C$DW$642, DW_AT_data_member_location[DW_OP_plus_uconst 0xea]
    4157                      .dwattr $C$DW$642, DW_AT_accessibility(DW_ACCESS_public)
    4158              $C$DW$643       .dwtag  DW_TAG_member
    4159                      .dwattr $C$DW$643, DW_AT_type(*$C$DW$T$72)
    4160                      .dwattr $C$DW$643, DW_AT_name("counter_current")
    4161                      .dwattr $C$DW$643, DW_AT_TI_symbol_name("_counter_current")
    4162                      .dwattr $C$DW$643, DW_AT_data_member_location[DW_OP_plus_uconst 0xec]
    4163                      .dwattr $C$DW$643, DW_AT_accessibility(DW_ACCESS_public)
    4164              $C$DW$644       .dwtag  DW_TAG_member
    4165                      .dwattr $C$DW$644, DW_AT_type(*$C$DW$T$72)
    4166                      .dwattr $C$DW$644, DW_AT_name("counter_isr")
    4167                      .dwattr $C$DW$644, DW_AT_TI_symbol_name("_counter_isr")
    4168                      .dwattr $C$DW$644, DW_AT_data_member_location[DW_OP_plus_uconst 0xed]
    4169                      .dwattr $C$DW$644, DW_AT_accessibility(DW_ACCESS_public)
    4170              $C$DW$645       .dwtag  DW_TAG_member
    4171                      .dwattr $C$DW$645, DW_AT_type(*$C$DW$T$72)
    4172                      .dwattr $C$DW$645, DW_AT_name("counter_speed")
    4173                      .dwattr $C$DW$645, DW_AT_TI_symbol_name("_counter_speed")
    4174                      .dwattr $C$DW$645, DW_AT_data_member_location[DW_OP_plus_uconst 0xee]
    4175                      .dwattr $C$DW$645, DW_AT_accessibility(DW_ACCESS_public)
TMS320C2000 Assembler PC v6.2.5 Thu Sep 21 15:49:24 2017

Tools Copyright (c) 1996-2014 Texas Instruments Incorporated
C:\Users\wmj\AppData\Local\Temp\1688411                              PAGE   82

    4176              $C$DW$646       .dwtag  DW_TAG_member
    4177                      .dwattr $C$DW$646, DW_AT_type(*$C$DW$T$72)
    4178                      .dwattr $C$DW$646, DW_AT_name("counter_traj")
    4179                      .dwattr $C$DW$646, DW_AT_TI_symbol_name("_counter_traj")
    4180                      .dwattr $C$DW$646, DW_AT_data_member_location[DW_OP_plus_uconst 0xef]
    4181                      .dwattr $C$DW$646, DW_AT_accessibility(DW_ACCESS_public)
    4182              $C$DW$647       .dwtag  DW_TAG_member
    4183                      .dwattr $C$DW$647, DW_AT_type(*$C$DW$T$35)
    4184                      .dwattr $C$DW$647, DW_AT_name("flag_enableCtrl")
    4185                      .dwattr $C$DW$647, DW_AT_TI_symbol_name("_flag_enableCtrl")
    4186                      .dwattr $C$DW$647, DW_AT_data_member_location[DW_OP_plus_uconst 0xf0]
    4187                      .dwattr $C$DW$647, DW_AT_accessibility(DW_ACCESS_public)
    4188              $C$DW$648       .dwtag  DW_TAG_member
    4189                      .dwattr $C$DW$648, DW_AT_type(*$C$DW$T$35)
    4190                      .dwattr $C$DW$648, DW_AT_name("flag_enableDcBusComp")
    4191                      .dwattr $C$DW$648, DW_AT_TI_symbol_name("_flag_enableDcBusComp")
    4192                      .dwattr $C$DW$648, DW_AT_data_member_location[DW_OP_plus_uconst 0xf1]
    4193                      .dwattr $C$DW$648, DW_AT_accessibility(DW_ACCESS_public)
    4194              $C$DW$649       .dwtag  DW_TAG_member
    4195                      .dwattr $C$DW$649, DW_AT_type(*$C$DW$T$35)
    4196                      .dwattr $C$DW$649, DW_AT_name("flag_enablePowerWarp")
    4197                      .dwattr $C$DW$649, DW_AT_TI_symbol_name("_flag_enablePowerWarp")
    4198                      .dwattr $C$DW$649, DW_AT_data_member_location[DW_OP_plus_uconst 0xf2]
    4199                      .dwattr $C$DW$649, DW_AT_accessibility(DW_ACCESS_public)
    4200              $C$DW$650       .dwtag  DW_TAG_member
    4201                      .dwattr $C$DW$650, DW_AT_type(*$C$DW$T$35)
    4202                      .dwattr $C$DW$650, DW_AT_name("flag_enableOffset")
    4203                      .dwattr $C$DW$650, DW_AT_TI_symbol_name("_flag_enableOffset")
    4204                      .dwattr $C$DW$650, DW_AT_data_member_location[DW_OP_plus_uconst 0xf3]
    4205                      .dwattr $C$DW$650, DW_AT_accessibility(DW_ACCESS_public)
    4206              $C$DW$651       .dwtag  DW_TAG_member
    4207                      .dwattr $C$DW$651, DW_AT_type(*$C$DW$T$35)
    4208                      .dwattr $C$DW$651, DW_AT_name("flag_enableSpeedCtrl")
    4209                      .dwattr $C$DW$651, DW_AT_TI_symbol_name("_flag_enableSpeedCtrl")
    4210                      .dwattr $C$DW$651, DW_AT_data_member_location[DW_OP_plus_uconst 0xf4]
    4211                      .dwattr $C$DW$651, DW_AT_accessibility(DW_ACCESS_public)
    4212              $C$DW$652       .dwtag  DW_TAG_member
    4213                      .dwattr $C$DW$652, DW_AT_type(*$C$DW$T$35)
    4214                      .dwattr $C$DW$652, DW_AT_name("flag_enableUserMotorParams")
    4215                      .dwattr $C$DW$652, DW_AT_TI_symbol_name("_flag_enableUserMotorParams")
    4216                      .dwattr $C$DW$652, DW_AT_data_member_location[DW_OP_plus_uconst 0xf5]
    4217                      .dwattr $C$DW$652, DW_AT_accessibility(DW_ACCESS_public)
    4218              $C$DW$653       .dwtag  DW_TAG_member
    4219                      .dwattr $C$DW$653, DW_AT_type(*$C$DW$T$34)
    4220                      .dwattr $C$DW$653, DW_AT_name("Idq_offset_pu")
    4221                      .dwattr $C$DW$653, DW_AT_TI_symbol_name("_Idq_offset_pu")
    4222                      .dwattr $C$DW$653, DW_AT_data_member_location[DW_OP_plus_uconst 0xf6]
    4223                      .dwattr $C$DW$653, DW_AT_accessibility(DW_ACCESS_public)
    4224              $C$DW$654       .dwtag  DW_TAG_member
    4225                      .dwattr $C$DW$654, DW_AT_type(*$C$DW$T$34)
    4226                      .dwattr $C$DW$654, DW_AT_name("Vdq_offset_pu")
    4227                      .dwattr $C$DW$654, DW_AT_TI_symbol_name("_Vdq_offset_pu")
    4228                      .dwattr $C$DW$654, DW_AT_data_member_location[DW_OP_plus_uconst 0xfa]
    4229                      .dwattr $C$DW$654, DW_AT_accessibility(DW_ACCESS_public)
    4230              $C$DW$655       .dwtag  DW_TAG_member
TMS320C2000 Assembler PC v6.2.5 Thu Sep 21 15:49:24 2017

Tools Copyright (c) 1996-2014 Texas Instruments Incorporated
C:\Users\wmj\AppData\Local\Temp\1688411                              PAGE   83

    4231                      .dwattr $C$DW$655, DW_AT_type(*$C$DW$T$33)
    4232                      .dwattr $C$DW$655, DW_AT_name("angle_pu")
    4233                      .dwattr $C$DW$655, DW_AT_TI_symbol_name("_angle_pu")
    4234                      .dwattr $C$DW$655, DW_AT_data_member_location[DW_OP_plus_uconst 0xfe]
    4235                      .dwattr $C$DW$655, DW_AT_accessibility(DW_ACCESS_public)
    4236              $C$DW$656       .dwtag  DW_TAG_member
    4237                      .dwattr $C$DW$656, DW_AT_type(*$C$DW$T$33)
    4238                      .dwattr $C$DW$656, DW_AT_name("speed_ref_pu")
    4239                      .dwattr $C$DW$656, DW_AT_TI_symbol_name("_speed_ref_pu")
    4240                      .dwattr $C$DW$656, DW_AT_data_member_location[DW_OP_plus_uconst 0x100]
    4241                      .dwattr $C$DW$656, DW_AT_accessibility(DW_ACCESS_public)
    4242              $C$DW$657       .dwtag  DW_TAG_member
    4243                      .dwattr $C$DW$657, DW_AT_type(*$C$DW$T$33)
    4244                      .dwattr $C$DW$657, DW_AT_name("speed_fb_pu")
    4245                      .dwattr $C$DW$657, DW_AT_TI_symbol_name("_speed_fb_pu")
    4246                      .dwattr $C$DW$657, DW_AT_data_member_location[DW_OP_plus_uconst 0x102]
    4247                      .dwattr $C$DW$657, DW_AT_accessibility(DW_ACCESS_public)
    4248              $C$DW$658       .dwtag  DW_TAG_member
    4249                      .dwattr $C$DW$658, DW_AT_type(*$C$DW$T$33)
    4250                      .dwattr $C$DW$658, DW_AT_name("speed_outMax_pu")
    4251                      .dwattr $C$DW$658, DW_AT_TI_symbol_name("_speed_outMax_pu")
    4252                      .dwattr $C$DW$658, DW_AT_data_member_location[DW_OP_plus_uconst 0x104]
    4253                      .dwattr $C$DW$658, DW_AT_accessibility(DW_ACCESS_public)
    4254              $C$DW$659       .dwtag  DW_TAG_member
    4255                      .dwattr $C$DW$659, DW_AT_type(*$C$DW$T$35)
    4256                      .dwattr $C$DW$659, DW_AT_name("flag_enableCurrentCtrl")
    4257                      .dwattr $C$DW$659, DW_AT_TI_symbol_name("_flag_enableCurrentCtrl")
    4258                      .dwattr $C$DW$659, DW_AT_data_member_location[DW_OP_plus_uconst 0x106]
    4259                      .dwattr $C$DW$659, DW_AT_accessibility(DW_ACCESS_public)
    4260              $C$DW$660       .dwtag  DW_TAG_member
    4261                      .dwattr $C$DW$660, DW_AT_type(*$C$DW$T$75)
    4262                      .dwattr $C$DW$660, DW_AT_name("brakeHandle")
    4263                      .dwattr $C$DW$660, DW_AT_TI_symbol_name("_brakeHandle")
    4264                      .dwattr $C$DW$660, DW_AT_data_member_location[DW_OP_plus_uconst 0x108]
    4265                      .dwattr $C$DW$660, DW_AT_accessibility(DW_ACCESS_public)
    4266              $C$DW$661       .dwtag  DW_TAG_member
    4267                      .dwattr $C$DW$661, DW_AT_type(*$C$DW$T$76)
    4268                      .dwattr $C$DW$661, DW_AT_name("brake")
    4269                      .dwattr $C$DW$661, DW_AT_TI_symbol_name("_brake")
    4270                      .dwattr $C$DW$661, DW_AT_data_member_location[DW_OP_plus_uconst 0x10a]
    4271                      .dwattr $C$DW$661, DW_AT_accessibility(DW_ACCESS_public)
    4272                      .dwendtag $C$DW$T$77
    4273              
    4274              $C$DW$T$269     .dwtag  DW_TAG_typedef, DW_AT_name("CTRL_Obj")
    4275                      .dwattr $C$DW$T$269, DW_AT_type(*$C$DW$T$77)
    4276                      .dwattr $C$DW$T$269, DW_AT_language(DW_LANG_C)
    4277              $C$DW$T$270     .dwtag  DW_TAG_pointer_type
    4278                      .dwattr $C$DW$T$270, DW_AT_type(*$C$DW$T$269)
    4279                      .dwattr $C$DW$T$270, DW_AT_address_class(0x16)
    4280              $C$DW$T$213     .dwtag  DW_TAG_pointer_type
    4281                      .dwattr $C$DW$T$213, DW_AT_type(*$C$DW$T$77)
    4282                      .dwattr $C$DW$T$213, DW_AT_address_class(0x16)
    4283              $C$DW$T$214     .dwtag  DW_TAG_typedef, DW_AT_name("CTRL_Handle")
    4284                      .dwattr $C$DW$T$214, DW_AT_type(*$C$DW$T$213)
    4285                      .dwattr $C$DW$T$214, DW_AT_language(DW_LANG_C)
TMS320C2000 Assembler PC v6.2.5 Thu Sep 21 15:49:24 2017

Tools Copyright (c) 1996-2014 Texas Instruments Incorporated
C:\Users\wmj\AppData\Local\Temp\1688411                              PAGE   84

    4286              $C$DW$662       .dwtag  DW_TAG_TI_far_type
    4287                      .dwattr $C$DW$662, DW_AT_type(*$C$DW$T$214)
    4288              $C$DW$T$271     .dwtag  DW_TAG_const_type
    4289                      .dwattr $C$DW$T$271, DW_AT_type(*$C$DW$662)
    4290              
    4291              $C$DW$T$80      .dwtag  DW_TAG_structure_type
    4292                      .dwattr $C$DW$T$80, DW_AT_name("_CTRL_Version_")
    4293                      .dwattr $C$DW$T$80, DW_AT_byte_size(0x04)
    4294              $C$DW$663       .dwtag  DW_TAG_member
    4295                      .dwattr $C$DW$663, DW_AT_type(*$C$DW$T$24)
    4296                      .dwattr $C$DW$663, DW_AT_name("rsvd")
    4297                      .dwattr $C$DW$663, DW_AT_TI_symbol_name("_rsvd")
    4298                      .dwattr $C$DW$663, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    4299                      .dwattr $C$DW$663, DW_AT_accessibility(DW_ACCESS_public)
    4300              $C$DW$664       .dwtag  DW_TAG_member
    4301                      .dwattr $C$DW$664, DW_AT_type(*$C$DW$T$79)
    4302                      .dwattr $C$DW$664, DW_AT_name("targetProc")
    4303                      .dwattr $C$DW$664, DW_AT_TI_symbol_name("_targetProc")
    4304                      .dwattr $C$DW$664, DW_AT_data_member_location[DW_OP_plus_uconst 0x1]
    4305                      .dwattr $C$DW$664, DW_AT_accessibility(DW_ACCESS_public)
    4306              $C$DW$665       .dwtag  DW_TAG_member
    4307                      .dwattr $C$DW$665, DW_AT_type(*$C$DW$T$24)
    4308                      .dwattr $C$DW$665, DW_AT_name("major")
    4309                      .dwattr $C$DW$665, DW_AT_TI_symbol_name("_major")
    4310                      .dwattr $C$DW$665, DW_AT_data_member_location[DW_OP_plus_uconst 0x2]
    4311                      .dwattr $C$DW$665, DW_AT_accessibility(DW_ACCESS_public)
    4312              $C$DW$666       .dwtag  DW_TAG_member
    4313                      .dwattr $C$DW$666, DW_AT_type(*$C$DW$T$24)
    4314                      .dwattr $C$DW$666, DW_AT_name("minor")
    4315                      .dwattr $C$DW$666, DW_AT_TI_symbol_name("_minor")
    4316                      .dwattr $C$DW$666, DW_AT_data_member_location[DW_OP_plus_uconst 0x3]
    4317                      .dwattr $C$DW$666, DW_AT_accessibility(DW_ACCESS_public)
    4318                      .dwendtag $C$DW$T$80
    4319              
    4320              $C$DW$T$43      .dwtag  DW_TAG_typedef, DW_AT_name("CTRL_Version")
    4321                      .dwattr $C$DW$T$43, DW_AT_type(*$C$DW$T$80)
    4322                      .dwattr $C$DW$T$43, DW_AT_language(DW_LANG_C)
    4323              $C$DW$T$279     .dwtag  DW_TAG_pointer_type
    4324                      .dwattr $C$DW$T$279, DW_AT_type(*$C$DW$T$43)
    4325                      .dwattr $C$DW$T$279, DW_AT_address_class(0x16)
    4326              
    4327              $C$DW$T$87      .dwtag  DW_TAG_structure_type
    4328                      .dwattr $C$DW$T$87, DW_AT_name("_DECODER_Obj_")
    4329                      .dwattr $C$DW$T$87, DW_AT_byte_size(0x06)
    4330              $C$DW$667       .dwtag  DW_TAG_member
    4331                      .dwattr $C$DW$667, DW_AT_type(*$C$DW$T$82)
    4332                      .dwattr $C$DW$667, DW_AT_name("spiHandle")
    4333                      .dwattr $C$DW$667, DW_AT_TI_symbol_name("_spiHandle")
    4334                      .dwattr $C$DW$667, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    4335                      .dwattr $C$DW$667, DW_AT_accessibility(DW_ACCESS_public)
    4336              $C$DW$668       .dwtag  DW_TAG_member
    4337                      .dwattr $C$DW$668, DW_AT_type(*$C$DW$T$84)
    4338                      .dwattr $C$DW$668, DW_AT_name("gpioHandle")
    4339                      .dwattr $C$DW$668, DW_AT_TI_symbol_name("_gpioHandle")
    4340                      .dwattr $C$DW$668, DW_AT_data_member_location[DW_OP_plus_uconst 0x2]
TMS320C2000 Assembler PC v6.2.5 Thu Sep 21 15:49:24 2017

Tools Copyright (c) 1996-2014 Texas Instruments Incorporated
C:\Users\wmj\AppData\Local\Temp\1688411                              PAGE   85

    4341                      .dwattr $C$DW$668, DW_AT_accessibility(DW_ACCESS_public)
    4342              $C$DW$669       .dwtag  DW_TAG_member
    4343                      .dwattr $C$DW$669, DW_AT_type(*$C$DW$T$86)
    4344                      .dwattr $C$DW$669, DW_AT_name("gpioNumber")
    4345                      .dwattr $C$DW$669, DW_AT_TI_symbol_name("_gpioNumber")
    4346                      .dwattr $C$DW$669, DW_AT_data_member_location[DW_OP_plus_uconst 0x4]
    4347                      .dwattr $C$DW$669, DW_AT_accessibility(DW_ACCESS_public)
    4348              $C$DW$670       .dwtag  DW_TAG_member
    4349                      .dwattr $C$DW$670, DW_AT_type(*$C$DW$T$35)
    4350                      .dwattr $C$DW$670, DW_AT_name("RxTimeOut")
    4351                      .dwattr $C$DW$670, DW_AT_TI_symbol_name("_RxTimeOut")
    4352                      .dwattr $C$DW$670, DW_AT_data_member_location[DW_OP_plus_uconst 0x5]
    4353                      .dwattr $C$DW$670, DW_AT_accessibility(DW_ACCESS_public)
    4354                      .dwendtag $C$DW$T$87
    4355              
    4356              $C$DW$T$226     .dwtag  DW_TAG_typedef, DW_AT_name("DECODER_Obj")
    4357                      .dwattr $C$DW$T$226, DW_AT_type(*$C$DW$T$87)
    4358                      .dwattr $C$DW$T$226, DW_AT_language(DW_LANG_C)
    4359              $C$DW$T$224     .dwtag  DW_TAG_pointer_type
    4360                      .dwattr $C$DW$T$224, DW_AT_type(*$C$DW$T$87)
    4361                      .dwattr $C$DW$T$224, DW_AT_address_class(0x16)
    4362              $C$DW$T$225     .dwtag  DW_TAG_typedef, DW_AT_name("DECODER_Handle")
    4363                      .dwattr $C$DW$T$225, DW_AT_type(*$C$DW$T$224)
    4364                      .dwattr $C$DW$T$225, DW_AT_language(DW_LANG_C)
    4365              
    4366              $C$DW$T$88      .dwtag  DW_TAG_structure_type
    4367                      .dwattr $C$DW$T$88, DW_AT_name("_DRIVE_CURRENT_t_")
    4368                      .dwattr $C$DW$T$88, DW_AT_byte_size(0x02)
    4369              $C$DW$671       .dwtag  DW_TAG_member
    4370                      .dwattr $C$DW$671, DW_AT_type(*$C$DW$T$24)
    4371                      .dwattr $C$DW$671, DW_AT_name("IDRIVE")
    4372                      .dwattr $C$DW$671, DW_AT_TI_symbol_name("_IDRIVE")
    4373                      .dwattr $C$DW$671, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    4374                      .dwattr $C$DW$671, DW_AT_accessibility(DW_ACCESS_public)
    4375              $C$DW$672       .dwtag  DW_TAG_member
    4376                      .dwattr $C$DW$672, DW_AT_type(*$C$DW$T$24)
    4377                      .dwattr $C$DW$672, DW_AT_name("INIT_IDRIVE")
    4378                      .dwattr $C$DW$672, DW_AT_TI_symbol_name("_INIT_IDRIVE")
    4379                      .dwattr $C$DW$672, DW_AT_data_member_location[DW_OP_plus_uconst 0x1]
    4380                      .dwattr $C$DW$672, DW_AT_accessibility(DW_ACCESS_public)
    4381                      .dwendtag $C$DW$T$88
    4382              
    4383              $C$DW$T$157     .dwtag  DW_TAG_typedef, DW_AT_name("DRIVE_CURRENT_t_")
    4384                      .dwattr $C$DW$T$157, DW_AT_type(*$C$DW$T$88)
    4385                      .dwattr $C$DW$T$157, DW_AT_language(DW_LANG_C)
    4386              
    4387              $C$DW$T$21      .dwtag  DW_TAG_structure_type
    4388                      .dwattr $C$DW$T$21, DW_AT_name("_EST_Obj_")
    4389                      .dwattr $C$DW$T$21, DW_AT_declaration
    4390                      .dwendtag $C$DW$T$21
    4391              
    4392              $C$DW$T$51      .dwtag  DW_TAG_pointer_type
    4393                      .dwattr $C$DW$T$51, DW_AT_type(*$C$DW$T$21)
    4394                      .dwattr $C$DW$T$51, DW_AT_address_class(0x16)
    4395              $C$DW$T$52      .dwtag  DW_TAG_typedef, DW_AT_name("EST_Handle")
TMS320C2000 Assembler PC v6.2.5 Thu Sep 21 15:49:24 2017

Tools Copyright (c) 1996-2014 Texas Instruments Incorporated
C:\Users\wmj\AppData\Local\Temp\1688411                              PAGE   86

    4396                      .dwattr $C$DW$T$52, DW_AT_type(*$C$DW$T$51)
    4397                      .dwattr $C$DW$T$52, DW_AT_language(DW_LANG_C)
    4398              
    4399              $C$DW$T$89      .dwtag  DW_TAG_structure_type
    4400                      .dwattr $C$DW$T$89, DW_AT_name("_FILTER_FO_")
    4401                      .dwattr $C$DW$T$89, DW_AT_byte_size(0x0a)
    4402              $C$DW$673       .dwtag  DW_TAG_member
    4403                      .dwattr $C$DW$673, DW_AT_type(*$C$DW$T$33)
    4404                      .dwattr $C$DW$673, DW_AT_name("a1")
    4405                      .dwattr $C$DW$673, DW_AT_TI_symbol_name("_a1")
    4406                      .dwattr $C$DW$673, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    4407                      .dwattr $C$DW$673, DW_AT_accessibility(DW_ACCESS_public)
    4408              $C$DW$674       .dwtag  DW_TAG_member
    4409                      .dwattr $C$DW$674, DW_AT_type(*$C$DW$T$33)
    4410                      .dwattr $C$DW$674, DW_AT_name("b0")
    4411                      .dwattr $C$DW$674, DW_AT_TI_symbol_name("_b0")
    4412                      .dwattr $C$DW$674, DW_AT_data_member_location[DW_OP_plus_uconst 0x2]
    4413                      .dwattr $C$DW$674, DW_AT_accessibility(DW_ACCESS_public)
    4414              $C$DW$675       .dwtag  DW_TAG_member
    4415                      .dwattr $C$DW$675, DW_AT_type(*$C$DW$T$33)
    4416                      .dwattr $C$DW$675, DW_AT_name("b1")
    4417                      .dwattr $C$DW$675, DW_AT_TI_symbol_name("_b1")
    4418                      .dwattr $C$DW$675, DW_AT_data_member_location[DW_OP_plus_uconst 0x4]
    4419                      .dwattr $C$DW$675, DW_AT_accessibility(DW_ACCESS_public)
    4420              $C$DW$676       .dwtag  DW_TAG_member
    4421                      .dwattr $C$DW$676, DW_AT_type(*$C$DW$T$33)
    4422                      .dwattr $C$DW$676, DW_AT_name("x1")
    4423                      .dwattr $C$DW$676, DW_AT_TI_symbol_name("_x1")
    4424                      .dwattr $C$DW$676, DW_AT_data_member_location[DW_OP_plus_uconst 0x6]
    4425                      .dwattr $C$DW$676, DW_AT_accessibility(DW_ACCESS_public)
    4426              $C$DW$677       .dwtag  DW_TAG_member
    4427                      .dwattr $C$DW$677, DW_AT_type(*$C$DW$T$33)
    4428                      .dwattr $C$DW$677, DW_AT_name("y1")
    4429                      .dwattr $C$DW$677, DW_AT_TI_symbol_name("_y1")
    4430                      .dwattr $C$DW$677, DW_AT_data_member_location[DW_OP_plus_uconst 0x8]
    4431                      .dwattr $C$DW$677, DW_AT_accessibility(DW_ACCESS_public)
    4432                      .dwendtag $C$DW$T$89
    4433              
    4434              $C$DW$T$183     .dwtag  DW_TAG_typedef, DW_AT_name("FILTER_FO_Obj")
    4435                      .dwattr $C$DW$T$183, DW_AT_type(*$C$DW$T$89)
    4436                      .dwattr $C$DW$T$183, DW_AT_language(DW_LANG_C)
    4437              
    4438              $C$DW$T$22      .dwtag  DW_TAG_structure_type
    4439                      .dwattr $C$DW$T$22, DW_AT_name("_FILTER_FO_Obj_")
    4440                      .dwattr $C$DW$T$22, DW_AT_declaration
    4441                      .dwendtag $C$DW$T$22
    4442              
    4443              $C$DW$T$184     .dwtag  DW_TAG_pointer_type
    4444                      .dwattr $C$DW$T$184, DW_AT_type(*$C$DW$T$22)
    4445                      .dwattr $C$DW$T$184, DW_AT_address_class(0x16)
    4446              $C$DW$T$185     .dwtag  DW_TAG_typedef, DW_AT_name("FILTER_FO_Handle")
    4447                      .dwattr $C$DW$T$185, DW_AT_type(*$C$DW$T$184)
    4448                      .dwattr $C$DW$T$185, DW_AT_language(DW_LANG_C)
    4449              
    4450              $C$DW$T$90      .dwtag  DW_TAG_structure_type
TMS320C2000 Assembler PC v6.2.5 Thu Sep 21 15:49:24 2017

Tools Copyright (c) 1996-2014 Texas Instruments Incorporated
C:\Users\wmj\AppData\Local\Temp\1688411                              PAGE   87

    4451                      .dwattr $C$DW$T$90, DW_AT_name("_FLASH_Obj_")
    4452                      .dwattr $C$DW$T$90, DW_AT_byte_size(0x08)
    4453              $C$DW$678       .dwtag  DW_TAG_member
    4454                      .dwattr $C$DW$678, DW_AT_type(*$C$DW$T$25)
    4455                      .dwattr $C$DW$678, DW_AT_name("FOPT")
    4456                      .dwattr $C$DW$678, DW_AT_TI_symbol_name("_FOPT")
    4457                      .dwattr $C$DW$678, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    4458                      .dwattr $C$DW$678, DW_AT_accessibility(DW_ACCESS_public)
    4459              $C$DW$679       .dwtag  DW_TAG_member
    4460                      .dwattr $C$DW$679, DW_AT_type(*$C$DW$T$25)
    4461                      .dwattr $C$DW$679, DW_AT_name("rsvd_1")
    4462                      .dwattr $C$DW$679, DW_AT_TI_symbol_name("_rsvd_1")
    4463                      .dwattr $C$DW$679, DW_AT_data_member_location[DW_OP_plus_uconst 0x1]
    4464                      .dwattr $C$DW$679, DW_AT_accessibility(DW_ACCESS_public)
    4465              $C$DW$680       .dwtag  DW_TAG_member
    4466                      .dwattr $C$DW$680, DW_AT_type(*$C$DW$T$25)
    4467                      .dwattr $C$DW$680, DW_AT_name("FPWR")
    4468                      .dwattr $C$DW$680, DW_AT_TI_symbol_name("_FPWR")
    4469                      .dwattr $C$DW$680, DW_AT_data_member_location[DW_OP_plus_uconst 0x2]
    4470                      .dwattr $C$DW$680, DW_AT_accessibility(DW_ACCESS_public)
    4471              $C$DW$681       .dwtag  DW_TAG_member
    4472                      .dwattr $C$DW$681, DW_AT_type(*$C$DW$T$25)
    4473                      .dwattr $C$DW$681, DW_AT_name("FSTATUS")
    4474                      .dwattr $C$DW$681, DW_AT_TI_symbol_name("_FSTATUS")
    4475                      .dwattr $C$DW$681, DW_AT_data_member_location[DW_OP_plus_uconst 0x3]
    4476                      .dwattr $C$DW$681, DW_AT_accessibility(DW_ACCESS_public)
    4477              $C$DW$682       .dwtag  DW_TAG_member
    4478                      .dwattr $C$DW$682, DW_AT_type(*$C$DW$T$25)
    4479                      .dwattr $C$DW$682, DW_AT_name("FSTDBYWAIT")
    4480                      .dwattr $C$DW$682, DW_AT_TI_symbol_name("_FSTDBYWAIT")
    4481                      .dwattr $C$DW$682, DW_AT_data_member_location[DW_OP_plus_uconst 0x4]
    4482                      .dwattr $C$DW$682, DW_AT_accessibility(DW_ACCESS_public)
    4483              $C$DW$683       .dwtag  DW_TAG_member
    4484                      .dwattr $C$DW$683, DW_AT_type(*$C$DW$T$25)
    4485                      .dwattr $C$DW$683, DW_AT_name("FACTIVEWAIT")
    4486                      .dwattr $C$DW$683, DW_AT_TI_symbol_name("_FACTIVEWAIT")
    4487                      .dwattr $C$DW$683, DW_AT_data_member_location[DW_OP_plus_uconst 0x5]
    4488                      .dwattr $C$DW$683, DW_AT_accessibility(DW_ACCESS_public)
    4489              $C$DW$684       .dwtag  DW_TAG_member
    4490                      .dwattr $C$DW$684, DW_AT_type(*$C$DW$T$25)
    4491                      .dwattr $C$DW$684, DW_AT_name("FBANKWAIT")
    4492                      .dwattr $C$DW$684, DW_AT_TI_symbol_name("_FBANKWAIT")
    4493                      .dwattr $C$DW$684, DW_AT_data_member_location[DW_OP_plus_uconst 0x6]
    4494                      .dwattr $C$DW$684, DW_AT_accessibility(DW_ACCESS_public)
    4495              $C$DW$685       .dwtag  DW_TAG_member
    4496                      .dwattr $C$DW$685, DW_AT_type(*$C$DW$T$25)
    4497                      .dwattr $C$DW$685, DW_AT_name("FOTPWAIT")
    4498                      .dwattr $C$DW$685, DW_AT_TI_symbol_name("_FOTPWAIT")
    4499                      .dwattr $C$DW$685, DW_AT_data_member_location[DW_OP_plus_uconst 0x7]
    4500                      .dwattr $C$DW$685, DW_AT_accessibility(DW_ACCESS_public)
    4501                      .dwendtag $C$DW$T$90
    4502              
    4503              $C$DW$T$103     .dwtag  DW_TAG_pointer_type
    4504                      .dwattr $C$DW$T$103, DW_AT_type(*$C$DW$T$90)
    4505                      .dwattr $C$DW$T$103, DW_AT_address_class(0x16)
TMS320C2000 Assembler PC v6.2.5 Thu Sep 21 15:49:24 2017

Tools Copyright (c) 1996-2014 Texas Instruments Incorporated
C:\Users\wmj\AppData\Local\Temp\1688411                              PAGE   88

    4506              $C$DW$T$104     .dwtag  DW_TAG_typedef, DW_AT_name("FLASH_Handle")
    4507                      .dwattr $C$DW$T$104, DW_AT_type(*$C$DW$T$103)
    4508                      .dwattr $C$DW$T$104, DW_AT_language(DW_LANG_C)
    4509              
    4510              $C$DW$T$94      .dwtag  DW_TAG_structure_type
    4511                      .dwattr $C$DW$T$94, DW_AT_name("_GPIO_Obj_")
    4512                      .dwattr $C$DW$T$94, DW_AT_byte_size(0x6a)
    4513              $C$DW$686       .dwtag  DW_TAG_member
    4514                      .dwattr $C$DW$686, DW_AT_type(*$C$DW$T$91)
    4515                      .dwattr $C$DW$686, DW_AT_name("GPACTRL")
    4516                      .dwattr $C$DW$686, DW_AT_TI_symbol_name("_GPACTRL")
    4517                      .dwattr $C$DW$686, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    4518                      .dwattr $C$DW$686, DW_AT_accessibility(DW_ACCESS_public)
    4519              $C$DW$687       .dwtag  DW_TAG_member
    4520                      .dwattr $C$DW$687, DW_AT_type(*$C$DW$T$91)
