TMS320C2000 Assembler PC v6.2.5 Tue Aug 29 10:15:18 2017

Tools Copyright (c) 1996-2014 Texas Instruments Incorporated
C:\Users\wmj\AppData\Local\Temp\1176011                              PAGE    1

       1              ;***************************************************************
       2              ;* TMS320C2000 C/C++ Codegen                         PC v6.2.5 *
       3              ;* Date/Time created: Tue Aug 29 10:15:18 2017                 *
       4              ;***************************************************************
       5                      .compiler_opts --float_support=softlib --hll_source=on --mem_model:code=flat --mem_model:data=large -
       6        0002  FP      .set    XAR2
       7              
       8              $C$DW$CU        .dwtag  DW_TAG_compile_unit
       9                      .dwattr $C$DW$CU, DW_AT_name("D:/FOC_27/sw/solutions/instaspin_foc/src/proj_lab02b.c")
      10                      .dwattr $C$DW$CU, DW_AT_producer("TMS320C2000 C/C++ Codegen PC v6.2.5 Copyright (c) 1996-2014 Texas I
      11                      .dwattr $C$DW$CU, DW_AT_TI_version(0x01)
      12                      .dwattr $C$DW$CU, DW_AT_comp_dir("D:\FOC_27\sw\solutions\instaspin_foc\boards\hvkit_rev1p1\f28x\f2802
      13              ;**************************************************************
      14              ;* CINIT RECORDS                                              *

    3680                      .dwattr $C$DW$T$260, DW_AT_type(*$C$DW$T$259)
    3681                      .dwattr $C$DW$T$260, DW_AT_language(DW_LANG_C)
    3682              
    3683              $C$DW$T$262     .dwtag  DW_TAG_enumeration_type
    3684                      .dwattr $C$DW$T$262, DW_AT_byte_size(0x01)
    3685              $C$DW$533       .dwtag  DW_TAG_enumerator, DW_AT_name("PIE_GroupNumber_1"), DW_AT_const_value(0x00)
    3686              $C$DW$534       .dwtag  DW_TAG_enumerator, DW_AT_name("PIE_GroupNumber_2"), DW_AT_const_value(0x01)
    3687              $C$DW$535       .dwtag  DW_TAG_enumerator, DW_AT_name("PIE_GroupNumber_3"), DW_AT_const_value(0x02)
    3688              $C$DW$536       .dwtag  DW_TAG_enumerator, DW_AT_name("PIE_GroupNumber_4"), DW_AT_const_value(0x03)
    3689              $C$DW$537       .dwtag  DW_TAG_enumerator, DW_AT_name("PIE_GroupNumber_5"), DW_AT_const_value(0x04)
    3690              $C$DW$538       .dwtag  DW_TAG_enumerator, DW_AT_name("PIE_GroupNumber_6"), DW_AT_const_value(0x05)
    3691              $C$DW$539       .dwtag  DW_TAG_enumerator, DW_AT_name("PIE_GroupNumber_7"), DW_AT_const_value(0x06)
    3692              $C$DW$540       .dwtag  DW_TAG_enumerator, DW_AT_name("PIE_GroupNumber_8"), DW_AT_const_value(0x07)
    3693              $C$DW$541       .dwtag  DW_TAG_enumerator, DW_AT_name("PIE_GroupNumber_9"), DW_AT_const_value(0x08)
    3694              $C$DW$542       .dwtag  DW_TAG_enumerator, DW_AT_name("PIE_GroupNumber_10"), DW_AT_const_value(0x09)
    3695              $C$DW$543       .dwtag  DW_TAG_enumerator, DW_AT_name("PIE_GroupNumber_11"), DW_AT_const_value(0x0a)
    3696              $C$DW$544       .dwtag  DW_TAG_enumerator, DW_AT_name("PIE_GroupNumber_12"), DW_AT_const_value(0x0b)
    3697                      .dwendtag $C$DW$T$262
    3698              
    3699              $C$DW$T$263     .dwtag  DW_TAG_typedef, DW_AT_name("PIE_GroupNumber_e")
    3700                      .dwattr $C$DW$T$263, DW_AT_type(*$C$DW$T$262)
    3701                      .dwattr $C$DW$T$263, DW_AT_language(DW_LANG_C)
    3702              
    3703              $C$DW$T$265     .dwtag  DW_TAG_enumeration_type
    3704                      .dwattr $C$DW$T$265, DW_AT_byte_size(0x01)
    3705              $C$DW$545       .dwtag  DW_TAG_enumerator, DW_AT_name("CTRL_Type_PID_spd"), DW_AT_const_value(0x00)
    3706              $C$DW$546       .dwtag  DW_TAG_enumerator, DW_AT_name("CTRL_Type_PID_Id"), DW_AT_const_value(0x01)
    3707              $C$DW$547       .dwtag  DW_TAG_enumerator, DW_AT_name("CTRL_Type_PID_Iq"), DW_AT_const_value(0x02)
    3708                      .dwendtag $C$DW$T$265
    3709              
    3710              $C$DW$T$266     .dwtag  DW_TAG_typedef, DW_AT_name("CTRL_Type_e")
    3711                      .dwattr $C$DW$T$266, DW_AT_type(*$C$DW$T$265)
    3712                      .dwattr $C$DW$T$266, DW_AT_language(DW_LANG_C)
    3713              
    3714              $C$DW$T$268     .dwtag  DW_TAG_enumeration_type
    3715                      .dwattr $C$DW$T$268, DW_AT_byte_size(0x01)
    3716              $C$DW$548       .dwtag  DW_TAG_enumerator, DW_AT_name("HAL_SensorType_Current"), DW_AT_const_value(0x00)
    3717              $C$DW$549       .dwtag  DW_TAG_enumerator, DW_AT_name("HAL_SensorType_Voltage"), DW_AT_const_value(0x01)
    3718                      .dwendtag $C$DW$T$268
    3719              
    3720              $C$DW$T$269     .dwtag  DW_TAG_typedef, DW_AT_name("HAL_SensorType_e")
    3721                      .dwattr $C$DW$T$269, DW_AT_type(*$C$DW$T$268)
TMS320C2000 Assembler PC v6.2.5 Tue Aug 29 10:15:18 2017

Tools Copyright (c) 1996-2014 Texas Instruments Incorporated
C:\Users\wmj\AppData\Local\Temp\1176011                              PAGE   74

    3722                      .dwattr $C$DW$T$269, DW_AT_language(DW_LANG_C)
    3723              
    3724              $C$DW$T$19      .dwtag  DW_TAG_structure_type
    3725                      .dwattr $C$DW$T$19, DW_AT_name("I2C_Obj")
    3726                      .dwattr $C$DW$T$19, DW_AT_declaration
    3727                      .dwendtag $C$DW$T$19
    3728              
    3729              $C$DW$T$125     .dwtag  DW_TAG_pointer_type
    3730                      .dwattr $C$DW$T$125, DW_AT_type(*$C$DW$T$19)
    3731                      .dwattr $C$DW$T$125, DW_AT_address_class(0x16)
    3732              $C$DW$T$126     .dwtag  DW_TAG_typedef, DW_AT_name("I2C_Handle")
    3733                      .dwattr $C$DW$T$126, DW_AT_type(*$C$DW$T$125)
    3734                      .dwattr $C$DW$T$126, DW_AT_language(DW_LANG_C)
    3735              
    3736              $C$DW$T$20      .dwtag  DW_TAG_structure_type
    3737                      .dwattr $C$DW$T$20, DW_AT_name("LDC161x_REG_Obj")
    3738                      .dwattr $C$DW$T$20, DW_AT_declaration
    3739                      .dwendtag $C$DW$T$20
    3740              
    3741              $C$DW$T$142     .dwtag  DW_TAG_pointer_type
    3742                      .dwattr $C$DW$T$142, DW_AT_type(*$C$DW$T$20)
    3743                      .dwattr $C$DW$T$142, DW_AT_address_class(0x16)
    3744              $C$DW$T$143     .dwtag  DW_TAG_typedef, DW_AT_name("LDC_Handle")
    3745                      .dwattr $C$DW$T$143, DW_AT_type(*$C$DW$T$142)
    3746                      .dwattr $C$DW$T$143, DW_AT_language(DW_LANG_C)
    3747              
    3748              $C$DW$T$32      .dwtag  DW_TAG_structure_type
    3749                      .dwattr $C$DW$T$32, DW_AT_name("_ADC_Obj_")
    3750                      .dwattr $C$DW$T$32, DW_AT_byte_size(0x6650)
    3751              $C$DW$550       .dwtag  DW_TAG_member
    3752                      .dwattr $C$DW$550, DW_AT_type(*$C$DW$T$26)
    3753                      .dwattr $C$DW$550, DW_AT_name("ADCRESULT")
    3754                      .dwattr $C$DW$550, DW_AT_TI_symbol_name("_ADCRESULT")
    3755                      .dwattr $C$DW$550, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    3756                      .dwattr $C$DW$550, DW_AT_accessibility(DW_ACCESS_public)
    3757              $C$DW$551       .dwtag  DW_TAG_member
    3758                      .dwattr $C$DW$551, DW_AT_type(*$C$DW$T$27)
    3759                      .dwattr $C$DW$551, DW_AT_name("resvd_1")
    3760                      .dwattr $C$DW$551, DW_AT_TI_symbol_name("_resvd_1")
    3761                      .dwattr $C$DW$551, DW_AT_data_member_location[DW_OP_plus_uconst 0x10]
    3762                      .dwattr $C$DW$551, DW_AT_accessibility(DW_ACCESS_public)
    3763              $C$DW$552       .dwtag  DW_TAG_member
    3764                      .dwattr $C$DW$552, DW_AT_type(*$C$DW$T$25)
    3765                      .dwattr $C$DW$552, DW_AT_name("ADCCTL1")
    3766                      .dwattr $C$DW$552, DW_AT_TI_symbol_name("_ADCCTL1")
    3767                      .dwattr $C$DW$552, DW_AT_data_member_location[DW_OP_plus_uconst 0x6600]
    3768                      .dwattr $C$DW$552, DW_AT_accessibility(DW_ACCESS_public)
    3769              $C$DW$553       .dwtag  DW_TAG_member
    3770                      .dwattr $C$DW$553, DW_AT_type(*$C$DW$T$25)
    3771                      .dwattr $C$DW$553, DW_AT_name("ADCCTL2")
    3772                      .dwattr $C$DW$553, DW_AT_TI_symbol_name("_ADCCTL2")
    3773                      .dwattr $C$DW$553, DW_AT_data_member_location[DW_OP_plus_uconst 0x6601]
    3774                      .dwattr $C$DW$553, DW_AT_accessibility(DW_ACCESS_public)
    3775              $C$DW$554       .dwtag  DW_TAG_member
    3776                      .dwattr $C$DW$554, DW_AT_type(*$C$DW$T$28)
TMS320C2000 Assembler PC v6.2.5 Tue Aug 29 10:15:18 2017

Tools Copyright (c) 1996-2014 Texas Instruments Incorporated
C:\Users\wmj\AppData\Local\Temp\1176011                              PAGE   75

    3777                      .dwattr $C$DW$554, DW_AT_name("rsvd_2")
    3778                      .dwattr $C$DW$554, DW_AT_TI_symbol_name("_rsvd_2")
    3779                      .dwattr $C$DW$554, DW_AT_data_member_location[DW_OP_plus_uconst 0x6602]
    3780                      .dwattr $C$DW$554, DW_AT_accessibility(DW_ACCESS_public)
    3781              $C$DW$555       .dwtag  DW_TAG_member
    3782                      .dwattr $C$DW$555, DW_AT_type(*$C$DW$T$25)
    3783                      .dwattr $C$DW$555, DW_AT_name("ADCINTFLG")
    3784                      .dwattr $C$DW$555, DW_AT_TI_symbol_name("_ADCINTFLG")
    3785                      .dwattr $C$DW$555, DW_AT_data_member_location[DW_OP_plus_uconst 0x6604]
    3786                      .dwattr $C$DW$555, DW_AT_accessibility(DW_ACCESS_public)
    3787              $C$DW$556       .dwtag  DW_TAG_member
    3788                      .dwattr $C$DW$556, DW_AT_type(*$C$DW$T$25)
    3789                      .dwattr $C$DW$556, DW_AT_name("ADCINTFLGCLR")
    3790                      .dwattr $C$DW$556, DW_AT_TI_symbol_name("_ADCINTFLGCLR")
    3791                      .dwattr $C$DW$556, DW_AT_data_member_location[DW_OP_plus_uconst 0x6605]
    3792                      .dwattr $C$DW$556, DW_AT_accessibility(DW_ACCESS_public)
    3793              $C$DW$557       .dwtag  DW_TAG_member
    3794                      .dwattr $C$DW$557, DW_AT_type(*$C$DW$T$25)
    3795                      .dwattr $C$DW$557, DW_AT_name("ADCINTOVF")
    3796                      .dwattr $C$DW$557, DW_AT_TI_symbol_name("_ADCINTOVF")
    3797                      .dwattr $C$DW$557, DW_AT_data_member_location[DW_OP_plus_uconst 0x6606]
    3798                      .dwattr $C$DW$557, DW_AT_accessibility(DW_ACCESS_public)
    3799              $C$DW$558       .dwtag  DW_TAG_member
    3800                      .dwattr $C$DW$558, DW_AT_type(*$C$DW$T$25)
    3801                      .dwattr $C$DW$558, DW_AT_name("ADCINTOVFCLR")
    3802                      .dwattr $C$DW$558, DW_AT_TI_symbol_name("_ADCINTOVFCLR")
    3803                      .dwattr $C$DW$558, DW_AT_data_member_location[DW_OP_plus_uconst 0x6607]
    3804                      .dwattr $C$DW$558, DW_AT_accessibility(DW_ACCESS_public)
    3805              $C$DW$559       .dwtag  DW_TAG_member
    3806                      .dwattr $C$DW$559, DW_AT_type(*$C$DW$T$29)
    3807                      .dwattr $C$DW$559, DW_AT_name("INTSELxNy")
    3808                      .dwattr $C$DW$559, DW_AT_TI_symbol_name("_INTSELxNy")
    3809                      .dwattr $C$DW$559, DW_AT_data_member_location[DW_OP_plus_uconst 0x6608]
    3810                      .dwattr $C$DW$559, DW_AT_accessibility(DW_ACCESS_public)
    3811              $C$DW$560       .dwtag  DW_TAG_member
    3812                      .dwattr $C$DW$560, DW_AT_type(*$C$DW$T$30)
    3813                      .dwattr $C$DW$560, DW_AT_name("rsvd_3")
    3814                      .dwattr $C$DW$560, DW_AT_TI_symbol_name("_rsvd_3")
    3815                      .dwattr $C$DW$560, DW_AT_data_member_location[DW_OP_plus_uconst 0x660d]
    3816                      .dwattr $C$DW$560, DW_AT_accessibility(DW_ACCESS_public)
    3817              $C$DW$561       .dwtag  DW_TAG_member
    3818                      .dwattr $C$DW$561, DW_AT_type(*$C$DW$T$25)
    3819                      .dwattr $C$DW$561, DW_AT_name("SOCPRICTRL")
    3820                      .dwattr $C$DW$561, DW_AT_TI_symbol_name("_SOCPRICTRL")
    3821                      .dwattr $C$DW$561, DW_AT_data_member_location[DW_OP_plus_uconst 0x6610]
    3822                      .dwattr $C$DW$561, DW_AT_accessibility(DW_ACCESS_public)
    3823              $C$DW$562       .dwtag  DW_TAG_member
    3824                      .dwattr $C$DW$562, DW_AT_type(*$C$DW$T$25)
    3825                      .dwattr $C$DW$562, DW_AT_name("rsvd_4")
    3826                      .dwattr $C$DW$562, DW_AT_TI_symbol_name("_rsvd_4")
    3827                      .dwattr $C$DW$562, DW_AT_data_member_location[DW_OP_plus_uconst 0x6611]
    3828                      .dwattr $C$DW$562, DW_AT_accessibility(DW_ACCESS_public)
    3829              $C$DW$563       .dwtag  DW_TAG_member
    3830                      .dwattr $C$DW$563, DW_AT_type(*$C$DW$T$25)
    3831                      .dwattr $C$DW$563, DW_AT_name("ADCSAMPLEMODE")
TMS320C2000 Assembler PC v6.2.5 Tue Aug 29 10:15:18 2017

Tools Copyright (c) 1996-2014 Texas Instruments Incorporated
C:\Users\wmj\AppData\Local\Temp\1176011                              PAGE   76

    3832                      .dwattr $C$DW$563, DW_AT_TI_symbol_name("_ADCSAMPLEMODE")
    3833                      .dwattr $C$DW$563, DW_AT_data_member_location[DW_OP_plus_uconst 0x6612]
    3834                      .dwattr $C$DW$563, DW_AT_accessibility(DW_ACCESS_public)
    3835              $C$DW$564       .dwtag  DW_TAG_member
    3836                      .dwattr $C$DW$564, DW_AT_type(*$C$DW$T$25)
    3837                      .dwattr $C$DW$564, DW_AT_name("rsvd_5")
    3838                      .dwattr $C$DW$564, DW_AT_TI_symbol_name("_rsvd_5")
    3839                      .dwattr $C$DW$564, DW_AT_data_member_location[DW_OP_plus_uconst 0x6613]
    3840                      .dwattr $C$DW$564, DW_AT_accessibility(DW_ACCESS_public)
    3841              $C$DW$565       .dwtag  DW_TAG_member
    3842                      .dwattr $C$DW$565, DW_AT_type(*$C$DW$T$25)
    3843                      .dwattr $C$DW$565, DW_AT_name("ADCINTSOCSEL1")
    3844                      .dwattr $C$DW$565, DW_AT_TI_symbol_name("_ADCINTSOCSEL1")
    3845                      .dwattr $C$DW$565, DW_AT_data_member_location[DW_OP_plus_uconst 0x6614]
    3846                      .dwattr $C$DW$565, DW_AT_accessibility(DW_ACCESS_public)
    3847              $C$DW$566       .dwtag  DW_TAG_member
    3848                      .dwattr $C$DW$566, DW_AT_type(*$C$DW$T$25)
    3849                      .dwattr $C$DW$566, DW_AT_name("ADCINTSOCSEL2")
    3850                      .dwattr $C$DW$566, DW_AT_TI_symbol_name("_ADCINTSOCSEL2")
    3851                      .dwattr $C$DW$566, DW_AT_data_member_location[DW_OP_plus_uconst 0x6615]
    3852                      .dwattr $C$DW$566, DW_AT_accessibility(DW_ACCESS_public)
    3853              $C$DW$567       .dwtag  DW_TAG_member
    3854                      .dwattr $C$DW$567, DW_AT_type(*$C$DW$T$28)
    3855                      .dwattr $C$DW$567, DW_AT_name("rsvd_6")
    3856                      .dwattr $C$DW$567, DW_AT_TI_symbol_name("_rsvd_6")
    3857                      .dwattr $C$DW$567, DW_AT_data_member_location[DW_OP_plus_uconst 0x6616]
    3858                      .dwattr $C$DW$567, DW_AT_accessibility(DW_ACCESS_public)
    3859              $C$DW$568       .dwtag  DW_TAG_member
    3860                      .dwattr $C$DW$568, DW_AT_type(*$C$DW$T$25)
    3861                      .dwattr $C$DW$568, DW_AT_name("ADCSOCFLG1")
    3862                      .dwattr $C$DW$568, DW_AT_TI_symbol_name("_ADCSOCFLG1")
    3863                      .dwattr $C$DW$568, DW_AT_data_member_location[DW_OP_plus_uconst 0x6618]
    3864                      .dwattr $C$DW$568, DW_AT_accessibility(DW_ACCESS_public)
    3865              $C$DW$569       .dwtag  DW_TAG_member
    3866                      .dwattr $C$DW$569, DW_AT_type(*$C$DW$T$25)
    3867                      .dwattr $C$DW$569, DW_AT_name("rsvd_7")
    3868                      .dwattr $C$DW$569, DW_AT_TI_symbol_name("_rsvd_7")
    3869                      .dwattr $C$DW$569, DW_AT_data_member_location[DW_OP_plus_uconst 0x6619]
    3870                      .dwattr $C$DW$569, DW_AT_accessibility(DW_ACCESS_public)
    3871              $C$DW$570       .dwtag  DW_TAG_member
    3872                      .dwattr $C$DW$570, DW_AT_type(*$C$DW$T$25)
    3873                      .dwattr $C$DW$570, DW_AT_name("ADCSOCFRC1")
    3874                      .dwattr $C$DW$570, DW_AT_TI_symbol_name("_ADCSOCFRC1")
    3875                      .dwattr $C$DW$570, DW_AT_data_member_location[DW_OP_plus_uconst 0x661a]
    3876                      .dwattr $C$DW$570, DW_AT_accessibility(DW_ACCESS_public)
    3877              $C$DW$571       .dwtag  DW_TAG_member
    3878                      .dwattr $C$DW$571, DW_AT_type(*$C$DW$T$25)
    3879                      .dwattr $C$DW$571, DW_AT_name("rsvd_8")
    3880                      .dwattr $C$DW$571, DW_AT_TI_symbol_name("_rsvd_8")
    3881                      .dwattr $C$DW$571, DW_AT_data_member_location[DW_OP_plus_uconst 0x661b]
    3882                      .dwattr $C$DW$571, DW_AT_accessibility(DW_ACCESS_public)
    3883              $C$DW$572       .dwtag  DW_TAG_member
    3884                      .dwattr $C$DW$572, DW_AT_type(*$C$DW$T$25)
    3885                      .dwattr $C$DW$572, DW_AT_name("ADCSOCOVF1")
    3886                      .dwattr $C$DW$572, DW_AT_TI_symbol_name("_ADCSOCOVF1")
TMS320C2000 Assembler PC v6.2.5 Tue Aug 29 10:15:18 2017

Tools Copyright (c) 1996-2014 Texas Instruments Incorporated
C:\Users\wmj\AppData\Local\Temp\1176011                              PAGE   77

    3887                      .dwattr $C$DW$572, DW_AT_data_member_location[DW_OP_plus_uconst 0x661c]
    3888                      .dwattr $C$DW$572, DW_AT_accessibility(DW_ACCESS_public)
    3889              $C$DW$573       .dwtag  DW_TAG_member
    3890                      .dwattr $C$DW$573, DW_AT_type(*$C$DW$T$25)
    3891                      .dwattr $C$DW$573, DW_AT_name("rsvd_9")
    3892                      .dwattr $C$DW$573, DW_AT_TI_symbol_name("_rsvd_9")
    3893                      .dwattr $C$DW$573, DW_AT_data_member_location[DW_OP_plus_uconst 0x661d]
    3894                      .dwattr $C$DW$573, DW_AT_accessibility(DW_ACCESS_public)
    3895              $C$DW$574       .dwtag  DW_TAG_member
    3896                      .dwattr $C$DW$574, DW_AT_type(*$C$DW$T$25)
    3897                      .dwattr $C$DW$574, DW_AT_name("ADCSOCOVFCLR1")
    3898                      .dwattr $C$DW$574, DW_AT_TI_symbol_name("_ADCSOCOVFCLR1")
    3899                      .dwattr $C$DW$574, DW_AT_data_member_location[DW_OP_plus_uconst 0x661e]
    3900                      .dwattr $C$DW$574, DW_AT_accessibility(DW_ACCESS_public)
    3901              $C$DW$575       .dwtag  DW_TAG_member
    3902                      .dwattr $C$DW$575, DW_AT_type(*$C$DW$T$25)
    3903                      .dwattr $C$DW$575, DW_AT_name("rsvd_10")
    3904                      .dwattr $C$DW$575, DW_AT_TI_symbol_name("_rsvd_10")
    3905                      .dwattr $C$DW$575, DW_AT_data_member_location[DW_OP_plus_uconst 0x661f]
    3906                      .dwattr $C$DW$575, DW_AT_accessibility(DW_ACCESS_public)
    3907              $C$DW$576       .dwtag  DW_TAG_member
    3908                      .dwattr $C$DW$576, DW_AT_type(*$C$DW$T$26)
    3909                      .dwattr $C$DW$576, DW_AT_name("ADCSOCxCTL")
    3910                      .dwattr $C$DW$576, DW_AT_TI_symbol_name("_ADCSOCxCTL")
    3911                      .dwattr $C$DW$576, DW_AT_data_member_location[DW_OP_plus_uconst 0x6620]
    3912                      .dwattr $C$DW$576, DW_AT_accessibility(DW_ACCESS_public)
    3913              $C$DW$577       .dwtag  DW_TAG_member
    3914                      .dwattr $C$DW$577, DW_AT_type(*$C$DW$T$26)
    3915                      .dwattr $C$DW$577, DW_AT_name("rsvd_11")
    3916                      .dwattr $C$DW$577, DW_AT_TI_symbol_name("_rsvd_11")
    3917                      .dwattr $C$DW$577, DW_AT_data_member_location[DW_OP_plus_uconst 0x6630]
    3918                      .dwattr $C$DW$577, DW_AT_accessibility(DW_ACCESS_public)
    3919              $C$DW$578       .dwtag  DW_TAG_member
    3920                      .dwattr $C$DW$578, DW_AT_type(*$C$DW$T$25)
    3921                      .dwattr $C$DW$578, DW_AT_name("ADCREFTRIM")
    3922                      .dwattr $C$DW$578, DW_AT_TI_symbol_name("_ADCREFTRIM")
    3923                      .dwattr $C$DW$578, DW_AT_data_member_location[DW_OP_plus_uconst 0x6640]
    3924                      .dwattr $C$DW$578, DW_AT_accessibility(DW_ACCESS_public)
    3925              $C$DW$579       .dwtag  DW_TAG_member
    3926                      .dwattr $C$DW$579, DW_AT_type(*$C$DW$T$25)
    3927                      .dwattr $C$DW$579, DW_AT_name("ADCOFFTRIM")
    3928                      .dwattr $C$DW$579, DW_AT_TI_symbol_name("_ADCOFFTRIM")
    3929                      .dwattr $C$DW$579, DW_AT_data_member_location[DW_OP_plus_uconst 0x6641]
    3930                      .dwattr $C$DW$579, DW_AT_accessibility(DW_ACCESS_public)
    3931              $C$DW$580       .dwtag  DW_TAG_member
    3932                      .dwattr $C$DW$580, DW_AT_type(*$C$DW$T$31)
    3933                      .dwattr $C$DW$580, DW_AT_name("resvd_12")
    3934                      .dwattr $C$DW$580, DW_AT_TI_symbol_name("_resvd_12")
    3935                      .dwattr $C$DW$580, DW_AT_data_member_location[DW_OP_plus_uconst 0x6642]
    3936                      .dwattr $C$DW$580, DW_AT_accessibility(DW_ACCESS_public)
    3937              $C$DW$581       .dwtag  DW_TAG_member
    3938                      .dwattr $C$DW$581, DW_AT_type(*$C$DW$T$25)
    3939                      .dwattr $C$DW$581, DW_AT_name("ADCREV")
    3940                      .dwattr $C$DW$581, DW_AT_TI_symbol_name("_ADCREV")
    3941                      .dwattr $C$DW$581, DW_AT_data_member_location[DW_OP_plus_uconst 0x664f]
TMS320C2000 Assembler PC v6.2.5 Tue Aug 29 10:15:18 2017

Tools Copyright (c) 1996-2014 Texas Instruments Incorporated
C:\Users\wmj\AppData\Local\Temp\1176011                              PAGE   78

    3942                      .dwattr $C$DW$581, DW_AT_accessibility(DW_ACCESS_public)
    3943                      .dwendtag $C$DW$T$32
    3944              
    3945              $C$DW$T$271     .dwtag  DW_TAG_typedef, DW_AT_name("ADC_Obj")
    3946                      .dwattr $C$DW$T$271, DW_AT_type(*$C$DW$T$32)
    3947                      .dwattr $C$DW$T$271, DW_AT_language(DW_LANG_C)
    3948              $C$DW$T$98      .dwtag  DW_TAG_pointer_type
    3949                      .dwattr $C$DW$T$98, DW_AT_type(*$C$DW$T$32)
    3950                      .dwattr $C$DW$T$98, DW_AT_address_class(0x16)
    3951              $C$DW$T$99      .dwtag  DW_TAG_typedef, DW_AT_name("ADC_Handle")
    3952                      .dwattr $C$DW$T$99, DW_AT_type(*$C$DW$T$98)
    3953                      .dwattr $C$DW$T$99, DW_AT_language(DW_LANG_C)
    3954              
    3955              $C$DW$T$44      .dwtag  DW_TAG_structure_type
    3956                      .dwattr $C$DW$T$44, DW_AT_name("_BRAKE_Obj_")
    3957                      .dwattr $C$DW$T$44, DW_AT_byte_size(0x2c)
    3958              $C$DW$582       .dwtag  DW_TAG_member
    3959                      .dwattr $C$DW$582, DW_AT_type(*$C$DW$T$34)
    3960                      .dwattr $C$DW$582, DW_AT_name("state")
    3961                      .dwattr $C$DW$582, DW_AT_TI_symbol_name("_state")
    3962                      .dwattr $C$DW$582, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    3963                      .dwattr $C$DW$582, DW_AT_accessibility(DW_ACCESS_public)
    3964              $C$DW$583       .dwtag  DW_TAG_member
    3965                      .dwattr $C$DW$583, DW_AT_type(*$C$DW$T$36)
    3966                      .dwattr $C$DW$583, DW_AT_name("pidHandle_Ibrake")
    3967                      .dwattr $C$DW$583, DW_AT_TI_symbol_name("_pidHandle_Ibrake")
    3968                      .dwattr $C$DW$583, DW_AT_data_member_location[DW_OP_plus_uconst 0x2]
    3969                      .dwattr $C$DW$583, DW_AT_accessibility(DW_ACCESS_public)
    3970              $C$DW$584       .dwtag  DW_TAG_member
    3971                      .dwattr $C$DW$584, DW_AT_type(*$C$DW$T$37)
    3972                      .dwattr $C$DW$584, DW_AT_name("pid_Ibrake")
    3973                      .dwattr $C$DW$584, DW_AT_TI_symbol_name("_pid_Ibrake")
    3974                      .dwattr $C$DW$584, DW_AT_data_member_location[DW_OP_plus_uconst 0x4]
    3975                      .dwattr $C$DW$584, DW_AT_accessibility(DW_ACCESS_public)
    3976              $C$DW$585       .dwtag  DW_TAG_member
    3977                      .dwattr $C$DW$585, DW_AT_type(*$C$DW$T$38)
    3978                      .dwattr $C$DW$585, DW_AT_name("Kp_Ibrake")
    3979                      .dwattr $C$DW$585, DW_AT_TI_symbol_name("_Kp_Ibrake")
    3980                      .dwattr $C$DW$585, DW_AT_data_member_location[DW_OP_plus_uconst 0x14]
    3981                      .dwattr $C$DW$585, DW_AT_accessibility(DW_ACCESS_public)
    3982              $C$DW$586       .dwtag  DW_TAG_member
    3983                      .dwattr $C$DW$586, DW_AT_type(*$C$DW$T$38)
    3984                      .dwattr $C$DW$586, DW_AT_name("Ki_Ibrake")
    3985                      .dwattr $C$DW$586, DW_AT_TI_symbol_name("_Ki_Ibrake")
    3986                      .dwattr $C$DW$586, DW_AT_data_member_location[DW_OP_plus_uconst 0x16]
    3987                      .dwattr $C$DW$586, DW_AT_accessibility(DW_ACCESS_public)
    3988              $C$DW$587       .dwtag  DW_TAG_member
    3989                      .dwattr $C$DW$587, DW_AT_type(*$C$DW$T$38)
    3990                      .dwattr $C$DW$587, DW_AT_name("Kd_Ibrake")
    3991                      .dwattr $C$DW$587, DW_AT_TI_symbol_name("_Kd_Ibrake")
    3992                      .dwattr $C$DW$587, DW_AT_data_member_location[DW_OP_plus_uconst 0x18]
    3993                      .dwattr $C$DW$587, DW_AT_accessibility(DW_ACCESS_public)
    3994              $C$DW$588       .dwtag  DW_TAG_member
    3995                      .dwattr $C$DW$588, DW_AT_type(*$C$DW$T$38)
    3996                      .dwattr $C$DW$588, DW_AT_name("Ibrake_ref")
TMS320C2000 Assembler PC v6.2.5 Tue Aug 29 10:15:18 2017

Tools Copyright (c) 1996-2014 Texas Instruments Incorporated
C:\Users\wmj\AppData\Local\Temp\1176011                              PAGE   79

    3997                      .dwattr $C$DW$588, DW_AT_TI_symbol_name("_Ibrake_ref")
    3998                      .dwattr $C$DW$588, DW_AT_data_member_location[DW_OP_plus_uconst 0x1a]
    3999                      .dwattr $C$DW$588, DW_AT_accessibility(DW_ACCESS_public)
    4000              $C$DW$589       .dwtag  DW_TAG_member
    4001                      .dwattr $C$DW$589, DW_AT_type(*$C$DW$T$38)
    4002                      .dwattr $C$DW$589, DW_AT_name("Ibrake_fbk")
    4003                      .dwattr $C$DW$589, DW_AT_TI_symbol_name("_Ibrake_fbk")
    4004                      .dwattr $C$DW$589, DW_AT_data_member_location[DW_OP_plus_uconst 0x1c]
    4005                      .dwattr $C$DW$589, DW_AT_accessibility(DW_ACCESS_public)
    4006              $C$DW$590       .dwtag  DW_TAG_member
    4007                      .dwattr $C$DW$590, DW_AT_type(*$C$DW$T$39)
    4008                      .dwattr $C$DW$590, DW_AT_name("AdcValue_I")
    4009                      .dwattr $C$DW$590, DW_AT_TI_symbol_name("_AdcValue_I")
    4010                      .dwattr $C$DW$590, DW_AT_data_member_location[DW_OP_plus_uconst 0x1e]
    4011                      .dwattr $C$DW$590, DW_AT_accessibility(DW_ACCESS_public)
    4012              $C$DW$591       .dwtag  DW_TAG_member
    4013                      .dwattr $C$DW$591, DW_AT_type(*$C$DW$T$38)
    4014                      .dwattr $C$DW$591, DW_AT_name("Ibrake_out")
    4015                      .dwattr $C$DW$591, DW_AT_TI_symbol_name("_Ibrake_out")
    4016                      .dwattr $C$DW$591, DW_AT_data_member_location[DW_OP_plus_uconst 0x22]
    4017                      .dwattr $C$DW$591, DW_AT_accessibility(DW_ACCESS_public)
    4018              $C$DW$592       .dwtag  DW_TAG_member
    4019                      .dwattr $C$DW$592, DW_AT_type(*$C$DW$T$38)
    4020                      .dwattr $C$DW$592, DW_AT_name("Irated")
    4021                      .dwattr $C$DW$592, DW_AT_TI_symbol_name("_Irated")
    4022                      .dwattr $C$DW$592, DW_AT_data_member_location[DW_OP_plus_uconst 0x24]
    4023                      .dwattr $C$DW$592, DW_AT_accessibility(DW_ACCESS_public)
    4024              $C$DW$593       .dwtag  DW_TAG_member
    4025                      .dwattr $C$DW$593, DW_AT_type(*$C$DW$T$38)
    4026                      .dwattr $C$DW$593, DW_AT_name("current_rate")
    4027                      .dwattr $C$DW$593, DW_AT_TI_symbol_name("_current_rate")
    4028                      .dwattr $C$DW$593, DW_AT_data_member_location[DW_OP_plus_uconst 0x26]
    4029                      .dwattr $C$DW$593, DW_AT_accessibility(DW_ACCESS_public)
    4030              $C$DW$594       .dwtag  DW_TAG_member
    4031                      .dwattr $C$DW$594, DW_AT_type(*$C$DW$T$41)
    4032                      .dwattr $C$DW$594, DW_AT_name("brake_type")
    4033                      .dwattr $C$DW$594, DW_AT_TI_symbol_name("_brake_type")
    4034                      .dwattr $C$DW$594, DW_AT_data_member_location[DW_OP_plus_uconst 0x28]
    4035                      .dwattr $C$DW$594, DW_AT_accessibility(DW_ACCESS_public)
    4036              $C$DW$595       .dwtag  DW_TAG_member
    4037                      .dwattr $C$DW$595, DW_AT_type(*$C$DW$T$42)
    4038                      .dwattr $C$DW$595, DW_AT_name("counter_current")
    4039                      .dwattr $C$DW$595, DW_AT_TI_symbol_name("_counter_current")
    4040                      .dwattr $C$DW$595, DW_AT_data_member_location[DW_OP_plus_uconst 0x29]
    4041                      .dwattr $C$DW$595, DW_AT_accessibility(DW_ACCESS_public)
    4042              $C$DW$596       .dwtag  DW_TAG_member
    4043                      .dwattr $C$DW$596, DW_AT_type(*$C$DW$T$43)
    4044                      .dwattr $C$DW$596, DW_AT_name("flag_enableBrake")
    4045                      .dwattr $C$DW$596, DW_AT_TI_symbol_name("_flag_enableBrake")
    4046                      .dwattr $C$DW$596, DW_AT_data_member_location[DW_OP_plus_uconst 0x2a]
    4047                      .dwattr $C$DW$596, DW_AT_accessibility(DW_ACCESS_public)
    4048              $C$DW$597       .dwtag  DW_TAG_member
    4049                      .dwattr $C$DW$597, DW_AT_type(*$C$DW$T$43)
    4050                      .dwattr $C$DW$597, DW_AT_name("flag_enableOffset")
    4051                      .dwattr $C$DW$597, DW_AT_TI_symbol_name("_flag_enableOffset")
TMS320C2000 Assembler PC v6.2.5 Tue Aug 29 10:15:18 2017

Tools Copyright (c) 1996-2014 Texas Instruments Incorporated
C:\Users\wmj\AppData\Local\Temp\1176011                              PAGE   80

    4052                      .dwattr $C$DW$597, DW_AT_data_member_location[DW_OP_plus_uconst 0x2b]
    4053                      .dwattr $C$DW$597, DW_AT_accessibility(DW_ACCESS_public)
    4054                      .dwendtag $C$DW$T$44
    4055              
    4056              $C$DW$T$224     .dwtag  DW_TAG_typedef, DW_AT_name("BRAKE_Obj")
    4057                      .dwattr $C$DW$T$224, DW_AT_type(*$C$DW$T$44)
    4058                      .dwattr $C$DW$T$224, DW_AT_language(DW_LANG_C)
    4059              $C$DW$T$222     .dwtag  DW_TAG_pointer_type
    4060                      .dwattr $C$DW$T$222, DW_AT_type(*$C$DW$T$44)
    4061                      .dwattr $C$DW$T$222, DW_AT_address_class(0x16)
    4062              $C$DW$T$223     .dwtag  DW_TAG_typedef, DW_AT_name("BRAKE_Handle")
    4063                      .dwattr $C$DW$T$223, DW_AT_type(*$C$DW$T$222)
    4064                      .dwattr $C$DW$T$223, DW_AT_language(DW_LANG_C)
    4065              
    4066              $C$DW$T$46      .dwtag  DW_TAG_structure_type
    4067                      .dwattr $C$DW$T$46, DW_AT_name("_CLARKE_Obj_")
    4068                      .dwattr $C$DW$T$46, DW_AT_byte_size(0x06)
    4069              $C$DW$598       .dwtag  DW_TAG_member
    4070                      .dwattr $C$DW$598, DW_AT_type(*$C$DW$T$38)
    4071                      .dwattr $C$DW$598, DW_AT_name("alpha_sf")
    4072                      .dwattr $C$DW$598, DW_AT_TI_symbol_name("_alpha_sf")
    4073                      .dwattr $C$DW$598, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    4074                      .dwattr $C$DW$598, DW_AT_accessibility(DW_ACCESS_public)
    4075              $C$DW$599       .dwtag  DW_TAG_member
    4076                      .dwattr $C$DW$599, DW_AT_type(*$C$DW$T$38)
    4077                      .dwattr $C$DW$599, DW_AT_name("beta_sf")
    4078                      .dwattr $C$DW$599, DW_AT_TI_symbol_name("_beta_sf")
    4079                      .dwattr $C$DW$599, DW_AT_data_member_location[DW_OP_plus_uconst 0x2]
    4080                      .dwattr $C$DW$599, DW_AT_accessibility(DW_ACCESS_public)
    4081              $C$DW$600       .dwtag  DW_TAG_member
    4082                      .dwattr $C$DW$600, DW_AT_type(*$C$DW$T$45)
    4083                      .dwattr $C$DW$600, DW_AT_name("numSensors")
    4084                      .dwattr $C$DW$600, DW_AT_TI_symbol_name("_numSensors")
    4085                      .dwattr $C$DW$600, DW_AT_data_member_location[DW_OP_plus_uconst 0x4]
    4086                      .dwattr $C$DW$600, DW_AT_accessibility(DW_ACCESS_public)
    4087                      .dwendtag $C$DW$T$46
    4088              
    4089              $C$DW$T$58      .dwtag  DW_TAG_typedef, DW_AT_name("CLARKE_Obj")
    4090                      .dwattr $C$DW$T$58, DW_AT_type(*$C$DW$T$46)
    4091                      .dwattr $C$DW$T$58, DW_AT_language(DW_LANG_C)
    4092              $C$DW$T$56      .dwtag  DW_TAG_pointer_type
    4093                      .dwattr $C$DW$T$56, DW_AT_type(*$C$DW$T$46)
    4094                      .dwattr $C$DW$T$56, DW_AT_address_class(0x16)
    4095              $C$DW$T$57      .dwtag  DW_TAG_typedef, DW_AT_name("CLARKE_Handle")
    4096                      .dwattr $C$DW$T$57, DW_AT_type(*$C$DW$T$56)
    4097                      .dwattr $C$DW$T$57, DW_AT_language(DW_LANG_C)
    4098              
    4099              $C$DW$T$47      .dwtag  DW_TAG_structure_type
    4100                      .dwattr $C$DW$T$47, DW_AT_name("_CLK_DIV_t_")
    4101                      .dwattr $C$DW$T$47, DW_AT_byte_size(0x02)
    4102              $C$DW$601       .dwtag  DW_TAG_member
    4103                      .dwattr $C$DW$601, DW_AT_type(*$C$DW$T$24)
    4104                      .dwattr $C$DW$601, DW_AT_name("FREF_DIVIDER")
    4105                      .dwattr $C$DW$601, DW_AT_TI_symbol_name("_FREF_DIVIDER")
    4106                      .dwattr $C$DW$601, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
TMS320C2000 Assembler PC v6.2.5 Tue Aug 29 10:15:18 2017

Tools Copyright (c) 1996-2014 Texas Instruments Incorporated
C:\Users\wmj\AppData\Local\Temp\1176011                              PAGE   81

    4107                      .dwattr $C$DW$601, DW_AT_accessibility(DW_ACCESS_public)
    4108              $C$DW$602       .dwtag  DW_TAG_member
    4109                      .dwattr $C$DW$602, DW_AT_type(*$C$DW$T$24)
    4110                      .dwattr $C$DW$602, DW_AT_name("FIN_DIVIDER")
    4111                      .dwattr $C$DW$602, DW_AT_TI_symbol_name("_FIN_DIVIDER")
    4112                      .dwattr $C$DW$602, DW_AT_data_member_location[DW_OP_plus_uconst 0x1]
    4113                      .dwattr $C$DW$602, DW_AT_accessibility(DW_ACCESS_public)
    4114                      .dwendtag $C$DW$T$47
    4115              
    4116              $C$DW$T$136     .dwtag  DW_TAG_typedef, DW_AT_name("CLK_DIV_t_")
    4117                      .dwattr $C$DW$T$136, DW_AT_type(*$C$DW$T$47)
    4118                      .dwattr $C$DW$T$136, DW_AT_language(DW_LANG_C)
    4119              
    4120              $C$DW$T$49      .dwtag  DW_TAG_structure_type
    4121                      .dwattr $C$DW$T$49, DW_AT_name("_CLK_Obj_")
    4122                      .dwattr $C$DW$T$49, DW_AT_byte_size(0x11)
    4123              $C$DW$603       .dwtag  DW_TAG_member
    4124                      .dwattr $C$DW$603, DW_AT_type(*$C$DW$T$25)
    4125                      .dwattr $C$DW$603, DW_AT_name("XCLK")
    4126                      .dwattr $C$DW$603, DW_AT_TI_symbol_name("_XCLK")
    4127                      .dwattr $C$DW$603, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    4128                      .dwattr $C$DW$603, DW_AT_accessibility(DW_ACCESS_public)
    4129              $C$DW$604       .dwtag  DW_TAG_member
    4130                      .dwattr $C$DW$604, DW_AT_type(*$C$DW$T$25)
    4131                      .dwattr $C$DW$604, DW_AT_name("rsvd_1")
    4132                      .dwattr $C$DW$604, DW_AT_TI_symbol_name("_rsvd_1")
    4133                      .dwattr $C$DW$604, DW_AT_data_member_location[DW_OP_plus_uconst 0x1]
    4134                      .dwattr $C$DW$604, DW_AT_accessibility(DW_ACCESS_public)
    4135              $C$DW$605       .dwtag  DW_TAG_member
    4136                      .dwattr $C$DW$605, DW_AT_type(*$C$DW$T$25)
    4137                      .dwattr $C$DW$605, DW_AT_name("CLKCTL")
    4138                      .dwattr $C$DW$605, DW_AT_TI_symbol_name("_CLKCTL")
    4139                      .dwattr $C$DW$605, DW_AT_data_member_location[DW_OP_plus_uconst 0x2]
    4140                      .dwattr $C$DW$605, DW_AT_accessibility(DW_ACCESS_public)
    4141              $C$DW$606       .dwtag  DW_TAG_member
    4142                      .dwattr $C$DW$606, DW_AT_type(*$C$DW$T$48)
    4143                      .dwattr $C$DW$606, DW_AT_name("rsvd_2")
    4144                      .dwattr $C$DW$606, DW_AT_TI_symbol_name("_rsvd_2")
    4145                      .dwattr $C$DW$606, DW_AT_data_member_location[DW_OP_plus_uconst 0x3]
    4146                      .dwattr $C$DW$606, DW_AT_accessibility(DW_ACCESS_public)
    4147              $C$DW$607       .dwtag  DW_TAG_member
    4148                      .dwattr $C$DW$607, DW_AT_type(*$C$DW$T$25)
    4149                      .dwattr $C$DW$607, DW_AT_name("LOSPCP")
    4150                      .dwattr $C$DW$607, DW_AT_TI_symbol_name("_LOSPCP")
    4151                      .dwattr $C$DW$607, DW_AT_data_member_location[DW_OP_plus_uconst 0xb]
    4152                      .dwattr $C$DW$607, DW_AT_accessibility(DW_ACCESS_public)
    4153              $C$DW$608       .dwtag  DW_TAG_member
    4154                      .dwattr $C$DW$608, DW_AT_type(*$C$DW$T$25)
    4155                      .dwattr $C$DW$608, DW_AT_name("PCLKCR0")
    4156                      .dwattr $C$DW$608, DW_AT_TI_symbol_name("_PCLKCR0")
    4157                      .dwattr $C$DW$608, DW_AT_data_member_location[DW_OP_plus_uconst 0xc]
    4158                      .dwattr $C$DW$608, DW_AT_accessibility(DW_ACCESS_public)
    4159              $C$DW$609       .dwtag  DW_TAG_member
    4160                      .dwattr $C$DW$609, DW_AT_type(*$C$DW$T$25)
    4161                      .dwattr $C$DW$609, DW_AT_name("PCLKCR1")
TMS320C2000 Assembler PC v6.2.5 Tue Aug 29 10:15:18 2017

Tools Copyright (c) 1996-2014 Texas Instruments Incorporated
C:\Users\wmj\AppData\Local\Temp\1176011                              PAGE   82

    4162                      .dwattr $C$DW$609, DW_AT_TI_symbol_name("_PCLKCR1")
    4163                      .dwattr $C$DW$609, DW_AT_data_member_location[DW_OP_plus_uconst 0xd]
    4164                      .dwattr $C$DW$609, DW_AT_accessibility(DW_ACCESS_public)
    4165              $C$DW$610       .dwtag  DW_TAG_member
    4166                      .dwattr $C$DW$610, DW_AT_type(*$C$DW$T$28)
    4167                      .dwattr $C$DW$610, DW_AT_name("rsvd_3")
    4168                      .dwattr $C$DW$610, DW_AT_TI_symbol_name("_rsvd_3")
    4169                      .dwattr $C$DW$610, DW_AT_data_member_location[DW_OP_plus_uconst 0xe]
    4170                      .dwattr $C$DW$610, DW_AT_accessibility(DW_ACCESS_public)
    4171              $C$DW$611       .dwtag  DW_TAG_member
    4172                      .dwattr $C$DW$611, DW_AT_type(*$C$DW$T$25)
    4173                      .dwattr $C$DW$611, DW_AT_name("PCLKCR3")
    4174                      .dwattr $C$DW$611, DW_AT_TI_symbol_name("_PCLKCR3")
    4175                      .dwattr $C$DW$611, DW_AT_data_member_location[DW_OP_plus_uconst 0x10]
    4176                      .dwattr $C$DW$611, DW_AT_accessibility(DW_ACCESS_public)
    4177                      .dwendtag $C$DW$T$49
    4178              
    4179              $C$DW$T$100     .dwtag  DW_TAG_pointer_type
    4180                      .dwattr $C$DW$T$100, DW_AT_type(*$C$DW$T$49)
    4181                      .dwattr $C$DW$T$100, DW_AT_address_class(0x16)
    4182              $C$DW$T$101     .dwtag  DW_TAG_typedef, DW_AT_name("CLK_Handle")
    4183                      .dwattr $C$DW$T$101, DW_AT_type(*$C$DW$T$100)
    4184                      .dwattr $C$DW$T$101, DW_AT_language(DW_LANG_C)
    4185              
    4186              $C$DW$T$50      .dwtag  DW_TAG_structure_type
    4187                      .dwattr $C$DW$T$50, DW_AT_name("_CPU_Obj_")
    4188                      .dwattr $C$DW$T$50, DW_AT_byte_size(0x01)
    4189              $C$DW$612       .dwtag  DW_TAG_member
    4190                      .dwattr $C$DW$612, DW_AT_type(*$C$DW$T$45)
    4191                      .dwattr $C$DW$612, DW_AT_name("tmp")
    4192                      .dwattr $C$DW$612, DW_AT_TI_symbol_name("_tmp")
    4193                      .dwattr $C$DW$612, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    4194                      .dwattr $C$DW$612, DW_AT_accessibility(DW_ACCESS_public)
    4195                      .dwendtag $C$DW$T$50
    4196              
    4197              $C$DW$T$102     .dwtag  DW_TAG_pointer_type
    4198                      .dwattr $C$DW$T$102, DW_AT_type(*$C$DW$T$50)
    4199                      .dwattr $C$DW$T$102, DW_AT_address_class(0x16)
    4200              $C$DW$T$103     .dwtag  DW_TAG_typedef, DW_AT_name("CPU_Handle")
    4201                      .dwattr $C$DW$T$103, DW_AT_type(*$C$DW$T$102)
    4202                      .dwattr $C$DW$T$103, DW_AT_language(DW_LANG_C)
    4203              
    4204              $C$DW$T$78      .dwtag  DW_TAG_structure_type
    4205                      .dwattr $C$DW$T$78, DW_AT_name("_CTRL_Obj_")
    4206                      .dwattr $C$DW$T$78, DW_AT_byte_size(0x108)
    4207              $C$DW$613       .dwtag  DW_TAG_member
    4208                      .dwattr $C$DW$613, DW_AT_type(*$C$DW$T$51)
    4209                      .dwattr $C$DW$613, DW_AT_name("version")
    4210                      .dwattr $C$DW$613, DW_AT_TI_symbol_name("_version")
    4211                      .dwattr $C$DW$613, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    4212                      .dwattr $C$DW$613, DW_AT_accessibility(DW_ACCESS_public)
    4213              $C$DW$614       .dwtag  DW_TAG_member
    4214                      .dwattr $C$DW$614, DW_AT_type(*$C$DW$T$53)
    4215                      .dwattr $C$DW$614, DW_AT_name("state")
    4216                      .dwattr $C$DW$614, DW_AT_TI_symbol_name("_state")
TMS320C2000 Assembler PC v6.2.5 Tue Aug 29 10:15:18 2017

Tools Copyright (c) 1996-2014 Texas Instruments Incorporated
C:\Users\wmj\AppData\Local\Temp\1176011                              PAGE   83

    4217                      .dwattr $C$DW$614, DW_AT_data_member_location[DW_OP_plus_uconst 0x4]
    4218                      .dwattr $C$DW$614, DW_AT_accessibility(DW_ACCESS_public)
    4219              $C$DW$615       .dwtag  DW_TAG_member
    4220                      .dwattr $C$DW$615, DW_AT_type(*$C$DW$T$53)
    4221                      .dwattr $C$DW$615, DW_AT_name("prevState")
    4222                      .dwattr $C$DW$615, DW_AT_TI_symbol_name("_prevState")
    4223                      .dwattr $C$DW$615, DW_AT_data_member_location[DW_OP_plus_uconst 0x5]
    4224                      .dwattr $C$DW$615, DW_AT_accessibility(DW_ACCESS_public)
    4225              $C$DW$616       .dwtag  DW_TAG_member
    4226                      .dwattr $C$DW$616, DW_AT_type(*$C$DW$T$55)
    4227                      .dwattr $C$DW$616, DW_AT_name("errorCode")
    4228                      .dwattr $C$DW$616, DW_AT_TI_symbol_name("_errorCode")
    4229                      .dwattr $C$DW$616, DW_AT_data_member_location[DW_OP_plus_uconst 0x6]
    4230                      .dwattr $C$DW$616, DW_AT_accessibility(DW_ACCESS_public)
    4231              $C$DW$617       .dwtag  DW_TAG_member
    4232                      .dwattr $C$DW$617, DW_AT_type(*$C$DW$T$57)
    4233                      .dwattr $C$DW$617, DW_AT_name("clarkeHandle_I")
    4234                      .dwattr $C$DW$617, DW_AT_TI_symbol_name("_clarkeHandle_I")
    4235                      .dwattr $C$DW$617, DW_AT_data_member_location[DW_OP_plus_uconst 0x8]
    4236                      .dwattr $C$DW$617, DW_AT_accessibility(DW_ACCESS_public)
    4237              $C$DW$618       .dwtag  DW_TAG_member
    4238                      .dwattr $C$DW$618, DW_AT_type(*$C$DW$T$58)
    4239                      .dwattr $C$DW$618, DW_AT_name("clarke_I")
    4240                      .dwattr $C$DW$618, DW_AT_TI_symbol_name("_clarke_I")
    4241                      .dwattr $C$DW$618, DW_AT_data_member_location[DW_OP_plus_uconst 0xa]
    4242                      .dwattr $C$DW$618, DW_AT_accessibility(DW_ACCESS_public)
    4243              $C$DW$619       .dwtag  DW_TAG_member
    4244                      .dwattr $C$DW$619, DW_AT_type(*$C$DW$T$57)
    4245                      .dwattr $C$DW$619, DW_AT_name("clarkeHandle_V")
    4246                      .dwattr $C$DW$619, DW_AT_TI_symbol_name("_clarkeHandle_V")
    4247                      .dwattr $C$DW$619, DW_AT_data_member_location[DW_OP_plus_uconst 0x10]
    4248                      .dwattr $C$DW$619, DW_AT_accessibility(DW_ACCESS_public)
    4249              $C$DW$620       .dwtag  DW_TAG_member
    4250                      .dwattr $C$DW$620, DW_AT_type(*$C$DW$T$58)
    4251                      .dwattr $C$DW$620, DW_AT_name("clarke_V")
    4252                      .dwattr $C$DW$620, DW_AT_TI_symbol_name("_clarke_V")
    4253                      .dwattr $C$DW$620, DW_AT_data_member_location[DW_OP_plus_uconst 0x12]
    4254                      .dwattr $C$DW$620, DW_AT_accessibility(DW_ACCESS_public)
    4255              $C$DW$621       .dwtag  DW_TAG_member
    4256                      .dwattr $C$DW$621, DW_AT_type(*$C$DW$T$60)
    4257                      .dwattr $C$DW$621, DW_AT_name("estHandle")
    4258                      .dwattr $C$DW$621, DW_AT_TI_symbol_name("_estHandle")
    4259                      .dwattr $C$DW$621, DW_AT_data_member_location[DW_OP_plus_uconst 0x18]
    4260                      .dwattr $C$DW$621, DW_AT_accessibility(DW_ACCESS_public)
    4261              $C$DW$622       .dwtag  DW_TAG_member
    4262                      .dwattr $C$DW$622, DW_AT_type(*$C$DW$T$62)
    4263                      .dwattr $C$DW$622, DW_AT_name("parkHandle")
    4264                      .dwattr $C$DW$622, DW_AT_TI_symbol_name("_parkHandle")
    4265                      .dwattr $C$DW$622, DW_AT_data_member_location[DW_OP_plus_uconst 0x1a]
    4266                      .dwattr $C$DW$622, DW_AT_accessibility(DW_ACCESS_public)
    4267              $C$DW$623       .dwtag  DW_TAG_member
    4268                      .dwattr $C$DW$623, DW_AT_type(*$C$DW$T$63)
    4269                      .dwattr $C$DW$623, DW_AT_name("park")
    4270                      .dwattr $C$DW$623, DW_AT_TI_symbol_name("_park")
    4271                      .dwattr $C$DW$623, DW_AT_data_member_location[DW_OP_plus_uconst 0x1c]
TMS320C2000 Assembler PC v6.2.5 Tue Aug 29 10:15:18 2017

Tools Copyright (c) 1996-2014 Texas Instruments Incorporated
C:\Users\wmj\AppData\Local\Temp\1176011                              PAGE   84

    4272                      .dwattr $C$DW$623, DW_AT_accessibility(DW_ACCESS_public)
    4273              $C$DW$624       .dwtag  DW_TAG_member
    4274                      .dwattr $C$DW$624, DW_AT_type(*$C$DW$T$36)
    4275                      .dwattr $C$DW$624, DW_AT_name("pidHandle_Id")
    4276                      .dwattr $C$DW$624, DW_AT_TI_symbol_name("_pidHandle_Id")
    4277                      .dwattr $C$DW$624, DW_AT_data_member_location[DW_OP_plus_uconst 0x20]
    4278                      .dwattr $C$DW$624, DW_AT_accessibility(DW_ACCESS_public)
    4279              $C$DW$625       .dwtag  DW_TAG_member
    4280                      .dwattr $C$DW$625, DW_AT_type(*$C$DW$T$37)
    4281                      .dwattr $C$DW$625, DW_AT_name("pid_Id")
    4282                      .dwattr $C$DW$625, DW_AT_TI_symbol_name("_pid_Id")
    4283                      .dwattr $C$DW$625, DW_AT_data_member_location[DW_OP_plus_uconst 0x22]
    4284                      .dwattr $C$DW$625, DW_AT_accessibility(DW_ACCESS_public)
    4285              $C$DW$626       .dwtag  DW_TAG_member
    4286                      .dwattr $C$DW$626, DW_AT_type(*$C$DW$T$36)
    4287                      .dwattr $C$DW$626, DW_AT_name("pidHandle_Iq")
    4288                      .dwattr $C$DW$626, DW_AT_TI_symbol_name("_pidHandle_Iq")
    4289                      .dwattr $C$DW$626, DW_AT_data_member_location[DW_OP_plus_uconst 0x32]
    4290                      .dwattr $C$DW$626, DW_AT_accessibility(DW_ACCESS_public)
    4291              $C$DW$627       .dwtag  DW_TAG_member
    4292                      .dwattr $C$DW$627, DW_AT_type(*$C$DW$T$37)
    4293                      .dwattr $C$DW$627, DW_AT_name("pid_Iq")
    4294                      .dwattr $C$DW$627, DW_AT_TI_symbol_name("_pid_Iq")
    4295                      .dwattr $C$DW$627, DW_AT_data_member_location[DW_OP_plus_uconst 0x34]
    4296                      .dwattr $C$DW$627, DW_AT_accessibility(DW_ACCESS_public)
    4297              $C$DW$628       .dwtag  DW_TAG_member
    4298                      .dwattr $C$DW$628, DW_AT_type(*$C$DW$T$36)
    4299                      .dwattr $C$DW$628, DW_AT_name("pidHandle_spd")
    4300                      .dwattr $C$DW$628, DW_AT_TI_symbol_name("_pidHandle_spd")
    4301                      .dwattr $C$DW$628, DW_AT_data_member_location[DW_OP_plus_uconst 0x44]
    4302                      .dwattr $C$DW$628, DW_AT_accessibility(DW_ACCESS_public)
    4303              $C$DW$629       .dwtag  DW_TAG_member
    4304                      .dwattr $C$DW$629, DW_AT_type(*$C$DW$T$37)
    4305                      .dwattr $C$DW$629, DW_AT_name("pid_spd")
    4306                      .dwattr $C$DW$629, DW_AT_TI_symbol_name("_pid_spd")
    4307                      .dwattr $C$DW$629, DW_AT_data_member_location[DW_OP_plus_uconst 0x46]
    4308                      .dwattr $C$DW$629, DW_AT_accessibility(DW_ACCESS_public)
    4309              $C$DW$630       .dwtag  DW_TAG_member
    4310                      .dwattr $C$DW$630, DW_AT_type(*$C$DW$T$65)
    4311                      .dwattr $C$DW$630, DW_AT_name("iparkHandle")
    4312                      .dwattr $C$DW$630, DW_AT_TI_symbol_name("_iparkHandle")
    4313                      .dwattr $C$DW$630, DW_AT_data_member_location[DW_OP_plus_uconst 0x56]
    4314                      .dwattr $C$DW$630, DW_AT_accessibility(DW_ACCESS_public)
    4315              $C$DW$631       .dwtag  DW_TAG_member
    4316                      .dwattr $C$DW$631, DW_AT_type(*$C$DW$T$66)
    4317                      .dwattr $C$DW$631, DW_AT_name("ipark")
    4318                      .dwattr $C$DW$631, DW_AT_TI_symbol_name("_ipark")
    4319                      .dwattr $C$DW$631, DW_AT_data_member_location[DW_OP_plus_uconst 0x58]
    4320                      .dwattr $C$DW$631, DW_AT_accessibility(DW_ACCESS_public)
    4321              $C$DW$632       .dwtag  DW_TAG_member
    4322                      .dwattr $C$DW$632, DW_AT_type(*$C$DW$T$68)
    4323                      .dwattr $C$DW$632, DW_AT_name("svgenHandle")
    4324                      .dwattr $C$DW$632, DW_AT_TI_symbol_name("_svgenHandle")
    4325                      .dwattr $C$DW$632, DW_AT_data_member_location[DW_OP_plus_uconst 0x5c]
    4326                      .dwattr $C$DW$632, DW_AT_accessibility(DW_ACCESS_public)
TMS320C2000 Assembler PC v6.2.5 Tue Aug 29 10:15:18 2017

Tools Copyright (c) 1996-2014 Texas Instruments Incorporated
C:\Users\wmj\AppData\Local\Temp\1176011                              PAGE   85

    4327              $C$DW$633       .dwtag  DW_TAG_member
    4328                      .dwattr $C$DW$633, DW_AT_type(*$C$DW$T$69)
    4329                      .dwattr $C$DW$633, DW_AT_name("svgen")
    4330                      .dwattr $C$DW$633, DW_AT_TI_symbol_name("_svgen")
    4331                      .dwattr $C$DW$633, DW_AT_data_member_location[DW_OP_plus_uconst 0x5e]
    4332                      .dwattr $C$DW$633, DW_AT_accessibility(DW_ACCESS_public)
    4333              $C$DW$634       .dwtag  DW_TAG_member
    4334                      .dwattr $C$DW$634, DW_AT_type(*$C$DW$T$71)
    4335                      .dwattr $C$DW$634, DW_AT_name("trajHandle_Id")
    4336                      .dwattr $C$DW$634, DW_AT_TI_symbol_name("_trajHandle_Id")
    4337                      .dwattr $C$DW$634, DW_AT_data_member_location[DW_OP_plus_uconst 0x60]
    4338                      .dwattr $C$DW$634, DW_AT_accessibility(DW_ACCESS_public)
    4339              $C$DW$635       .dwtag  DW_TAG_member
    4340                      .dwattr $C$DW$635, DW_AT_type(*$C$DW$T$72)
    4341                      .dwattr $C$DW$635, DW_AT_name("traj_Id")
    4342                      .dwattr $C$DW$635, DW_AT_TI_symbol_name("_traj_Id")
    4343                      .dwattr $C$DW$635, DW_AT_data_member_location[DW_OP_plus_uconst 0x62]
    4344                      .dwattr $C$DW$635, DW_AT_accessibility(DW_ACCESS_public)
    4345              $C$DW$636       .dwtag  DW_TAG_member
    4346                      .dwattr $C$DW$636, DW_AT_type(*$C$DW$T$71)
    4347                      .dwattr $C$DW$636, DW_AT_name("trajHandle_spd")
    4348                      .dwattr $C$DW$636, DW_AT_TI_symbol_name("_trajHandle_spd")
    4349                      .dwattr $C$DW$636, DW_AT_data_member_location[DW_OP_plus_uconst 0x6c]
    4350                      .dwattr $C$DW$636, DW_AT_accessibility(DW_ACCESS_public)
    4351              $C$DW$637       .dwtag  DW_TAG_member
    4352                      .dwattr $C$DW$637, DW_AT_type(*$C$DW$T$72)
    4353                      .dwattr $C$DW$637, DW_AT_name("traj_spd")
    4354                      .dwattr $C$DW$637, DW_AT_TI_symbol_name("_traj_spd")
    4355                      .dwattr $C$DW$637, DW_AT_data_member_location[DW_OP_plus_uconst 0x6e]
    4356                      .dwattr $C$DW$637, DW_AT_accessibility(DW_ACCESS_public)
    4357              $C$DW$638       .dwtag  DW_TAG_member
    4358                      .dwattr $C$DW$638, DW_AT_type(*$C$DW$T$71)
    4359                      .dwattr $C$DW$638, DW_AT_name("trajHandle_spdMax")
    4360                      .dwattr $C$DW$638, DW_AT_TI_symbol_name("_trajHandle_spdMax")
    4361                      .dwattr $C$DW$638, DW_AT_data_member_location[DW_OP_plus_uconst 0x78]
    4362                      .dwattr $C$DW$638, DW_AT_accessibility(DW_ACCESS_public)
    4363              $C$DW$639       .dwtag  DW_TAG_member
    4364                      .dwattr $C$DW$639, DW_AT_type(*$C$DW$T$72)
    4365                      .dwattr $C$DW$639, DW_AT_name("traj_spdMax")
    4366                      .dwattr $C$DW$639, DW_AT_TI_symbol_name("_traj_spdMax")
    4367                      .dwattr $C$DW$639, DW_AT_data_member_location[DW_OP_plus_uconst 0x7a]
    4368                      .dwattr $C$DW$639, DW_AT_accessibility(DW_ACCESS_public)
    4369              $C$DW$640       .dwtag  DW_TAG_member
    4370                      .dwattr $C$DW$640, DW_AT_type(*$C$DW$T$73)
    4371                      .dwattr $C$DW$640, DW_AT_name("motorParams")
    4372                      .dwattr $C$DW$640, DW_AT_TI_symbol_name("_motorParams")
    4373                      .dwattr $C$DW$640, DW_AT_data_member_location[DW_OP_plus_uconst 0x84]
    4374                      .dwattr $C$DW$640, DW_AT_accessibility(DW_ACCESS_public)
    4375              $C$DW$641       .dwtag  DW_TAG_member
    4376                      .dwattr $C$DW$641, DW_AT_type(*$C$DW$T$76)
    4377                      .dwattr $C$DW$641, DW_AT_name("waitTimes")
    4378                      .dwattr $C$DW$641, DW_AT_TI_symbol_name("_waitTimes")
    4379                      .dwattr $C$DW$641, DW_AT_data_member_location[DW_OP_plus_uconst 0x92]
    4380                      .dwattr $C$DW$641, DW_AT_accessibility(DW_ACCESS_public)
    4381              $C$DW$642       .dwtag  DW_TAG_member
TMS320C2000 Assembler PC v6.2.5 Tue Aug 29 10:15:18 2017

Tools Copyright (c) 1996-2014 Texas Instruments Incorporated
C:\Users\wmj\AppData\Local\Temp\1176011                              PAGE   86

    4382                      .dwattr $C$DW$642, DW_AT_type(*$C$DW$T$75)
    4383                      .dwattr $C$DW$642, DW_AT_name("counter_state")
    4384                      .dwattr $C$DW$642, DW_AT_TI_symbol_name("_counter_state")
    4385                      .dwattr $C$DW$642, DW_AT_data_member_location[DW_OP_plus_uconst 0x9a]
    4386                      .dwattr $C$DW$642, DW_AT_accessibility(DW_ACCESS_public)
    4387              $C$DW$643       .dwtag  DW_TAG_member
    4388                      .dwattr $C$DW$643, DW_AT_type(*$C$DW$T$42)
    4389                      .dwattr $C$DW$643, DW_AT_name("numIsrTicksPerCtrlTick")
    4390                      .dwattr $C$DW$643, DW_AT_TI_symbol_name("_numIsrTicksPerCtrlTick")
    4391                      .dwattr $C$DW$643, DW_AT_data_member_location[DW_OP_plus_uconst 0x9c]
    4392                      .dwattr $C$DW$643, DW_AT_accessibility(DW_ACCESS_public)
    4393              $C$DW$644       .dwtag  DW_TAG_member
    4394                      .dwattr $C$DW$644, DW_AT_type(*$C$DW$T$42)
    4395                      .dwattr $C$DW$644, DW_AT_name("numCtrlTicksPerCurrentTick")
    4396                      .dwattr $C$DW$644, DW_AT_TI_symbol_name("_numCtrlTicksPerCurrentTick")
    4397                      .dwattr $C$DW$644, DW_AT_data_member_location[DW_OP_plus_uconst 0x9d]
    4398                      .dwattr $C$DW$644, DW_AT_accessibility(DW_ACCESS_public)
    4399              $C$DW$645       .dwtag  DW_TAG_member
    4400                      .dwattr $C$DW$645, DW_AT_type(*$C$DW$T$42)
    4401                      .dwattr $C$DW$645, DW_AT_name("numCtrlTicksPerSpeedTick")
    4402                      .dwattr $C$DW$645, DW_AT_TI_symbol_name("_numCtrlTicksPerSpeedTick")
    4403                      .dwattr $C$DW$645, DW_AT_data_member_location[DW_OP_plus_uconst 0x9e]
    4404                      .dwattr $C$DW$645, DW_AT_accessibility(DW_ACCESS_public)
    4405              $C$DW$646       .dwtag  DW_TAG_member
    4406                      .dwattr $C$DW$646, DW_AT_type(*$C$DW$T$42)
    4407                      .dwattr $C$DW$646, DW_AT_name("numCtrlTicksPerTrajTick")
    4408                      .dwattr $C$DW$646, DW_AT_TI_symbol_name("_numCtrlTicksPerTrajTick")
    4409                      .dwattr $C$DW$646, DW_AT_data_member_location[DW_OP_plus_uconst 0x9f]
    4410                      .dwattr $C$DW$646, DW_AT_accessibility(DW_ACCESS_public)
    4411              $C$DW$647       .dwtag  DW_TAG_member
    4412                      .dwattr $C$DW$647, DW_AT_type(*$C$DW$T$75)
    4413                      .dwattr $C$DW$647, DW_AT_name("ctrlFreq_Hz")
    4414                      .dwattr $C$DW$647, DW_AT_TI_symbol_name("_ctrlFreq_Hz")
    4415                      .dwattr $C$DW$647, DW_AT_data_member_location[DW_OP_plus_uconst 0xa0]
    4416                      .dwattr $C$DW$647, DW_AT_accessibility(DW_ACCESS_public)
    4417              $C$DW$648       .dwtag  DW_TAG_member
    4418                      .dwattr $C$DW$648, DW_AT_type(*$C$DW$T$75)
    4419                      .dwattr $C$DW$648, DW_AT_name("trajFreq_Hz")
    4420                      .dwattr $C$DW$648, DW_AT_TI_symbol_name("_trajFreq_Hz")
    4421                      .dwattr $C$DW$648, DW_AT_data_member_location[DW_OP_plus_uconst 0xa2]
    4422                      .dwattr $C$DW$648, DW_AT_accessibility(DW_ACCESS_public)
    4423              $C$DW$649       .dwtag  DW_TAG_member
    4424                      .dwattr $C$DW$649, DW_AT_type(*$C$DW$T$38)
    4425                      .dwattr $C$DW$649, DW_AT_name("trajPeriod_sec")
    4426                      .dwattr $C$DW$649, DW_AT_TI_symbol_name("_trajPeriod_sec")
    4427                      .dwattr $C$DW$649, DW_AT_data_member_location[DW_OP_plus_uconst 0xa4]
    4428                      .dwattr $C$DW$649, DW_AT_accessibility(DW_ACCESS_public)
    4429              $C$DW$650       .dwtag  DW_TAG_member
    4430                      .dwattr $C$DW$650, DW_AT_type(*$C$DW$T$77)
    4431                      .dwattr $C$DW$650, DW_AT_name("ctrlPeriod_sec")
    4432                      .dwattr $C$DW$650, DW_AT_TI_symbol_name("_ctrlPeriod_sec")
    4433                      .dwattr $C$DW$650, DW_AT_data_member_location[DW_OP_plus_uconst 0xa6]
    4434                      .dwattr $C$DW$650, DW_AT_accessibility(DW_ACCESS_public)
    4435              $C$DW$651       .dwtag  DW_TAG_member
    4436                      .dwattr $C$DW$651, DW_AT_type(*$C$DW$T$38)
TMS320C2000 Assembler PC v6.2.5 Tue Aug 29 10:15:18 2017

Tools Copyright (c) 1996-2014 Texas Instruments Incorporated
C:\Users\wmj\AppData\Local\Temp\1176011                              PAGE   87

    4437                      .dwattr $C$DW$651, DW_AT_name("maxVsMag_pu")
    4438                      .dwattr $C$DW$651, DW_AT_TI_symbol_name("_maxVsMag_pu")
    4439                      .dwattr $C$DW$651, DW_AT_data_member_location[DW_OP_plus_uconst 0xa8]
    4440                      .dwattr $C$DW$651, DW_AT_accessibility(DW_ACCESS_public)
    4441              $C$DW$652       .dwtag  DW_TAG_member
    4442                      .dwattr $C$DW$652, DW_AT_type(*$C$DW$T$39)
    4443                      .dwattr $C$DW$652, DW_AT_name("Iab_in")
    4444                      .dwattr $C$DW$652, DW_AT_TI_symbol_name("_Iab_in")
    4445                      .dwattr $C$DW$652, DW_AT_data_member_location[DW_OP_plus_uconst 0xaa]
    4446                      .dwattr $C$DW$652, DW_AT_accessibility(DW_ACCESS_public)
    4447              $C$DW$653       .dwtag  DW_TAG_member
    4448                      .dwattr $C$DW$653, DW_AT_type(*$C$DW$T$39)
    4449                      .dwattr $C$DW$653, DW_AT_name("Iab_filt")
    4450                      .dwattr $C$DW$653, DW_AT_TI_symbol_name("_Iab_filt")
    4451                      .dwattr $C$DW$653, DW_AT_data_member_location[DW_OP_plus_uconst 0xae]
    4452                      .dwattr $C$DW$653, DW_AT_accessibility(DW_ACCESS_public)
    4453              $C$DW$654       .dwtag  DW_TAG_member
    4454                      .dwattr $C$DW$654, DW_AT_type(*$C$DW$T$39)
    4455                      .dwattr $C$DW$654, DW_AT_name("Idq_in")
    4456                      .dwattr $C$DW$654, DW_AT_TI_symbol_name("_Idq_in")
    4457                      .dwattr $C$DW$654, DW_AT_data_member_location[DW_OP_plus_uconst 0xb2]
    4458                      .dwattr $C$DW$654, DW_AT_accessibility(DW_ACCESS_public)
    4459              $C$DW$655       .dwtag  DW_TAG_member
    4460                      .dwattr $C$DW$655, DW_AT_type(*$C$DW$T$39)
    4461                      .dwattr $C$DW$655, DW_AT_name("Vab_in")
    4462                      .dwattr $C$DW$655, DW_AT_TI_symbol_name("_Vab_in")
    4463                      .dwattr $C$DW$655, DW_AT_data_member_location[DW_OP_plus_uconst 0xb6]
    4464                      .dwattr $C$DW$655, DW_AT_accessibility(DW_ACCESS_public)
    4465              $C$DW$656       .dwtag  DW_TAG_member
    4466                      .dwattr $C$DW$656, DW_AT_type(*$C$DW$T$38)
    4467                      .dwattr $C$DW$656, DW_AT_name("spd_out")
    4468                      .dwattr $C$DW$656, DW_AT_TI_symbol_name("_spd_out")
    4469                      .dwattr $C$DW$656, DW_AT_data_member_location[DW_OP_plus_uconst 0xba]
    4470                      .dwattr $C$DW$656, DW_AT_accessibility(DW_ACCESS_public)
    4471              $C$DW$657       .dwtag  DW_TAG_member
    4472                      .dwattr $C$DW$657, DW_AT_type(*$C$DW$T$39)
    4473                      .dwattr $C$DW$657, DW_AT_name("Vab_out")
    4474                      .dwattr $C$DW$657, DW_AT_TI_symbol_name("_Vab_out")
    4475                      .dwattr $C$DW$657, DW_AT_data_member_location[DW_OP_plus_uconst 0xbc]
    4476                      .dwattr $C$DW$657, DW_AT_accessibility(DW_ACCESS_public)
    4477              $C$DW$658       .dwtag  DW_TAG_member
    4478                      .dwattr $C$DW$658, DW_AT_type(*$C$DW$T$39)
    4479                      .dwattr $C$DW$658, DW_AT_name("Vdq_out")
    4480                      .dwattr $C$DW$658, DW_AT_TI_symbol_name("_Vdq_out")
    4481                      .dwattr $C$DW$658, DW_AT_data_member_location[DW_OP_plus_uconst 0xc0]
    4482                      .dwattr $C$DW$658, DW_AT_accessibility(DW_ACCESS_public)
    4483              $C$DW$659       .dwtag  DW_TAG_member
    4484                      .dwattr $C$DW$659, DW_AT_type(*$C$DW$T$77)
    4485                      .dwattr $C$DW$659, DW_AT_name("Rhf")
    4486                      .dwattr $C$DW$659, DW_AT_TI_symbol_name("_Rhf")
    4487                      .dwattr $C$DW$659, DW_AT_data_member_location[DW_OP_plus_uconst 0xc4]
    4488                      .dwattr $C$DW$659, DW_AT_accessibility(DW_ACCESS_public)
    4489              $C$DW$660       .dwtag  DW_TAG_member
    4490                      .dwattr $C$DW$660, DW_AT_type(*$C$DW$T$77)
    4491                      .dwattr $C$DW$660, DW_AT_name("Lhf")
TMS320C2000 Assembler PC v6.2.5 Tue Aug 29 10:15:18 2017

Tools Copyright (c) 1996-2014 Texas Instruments Incorporated
C:\Users\wmj\AppData\Local\Temp\1176011                              PAGE   88

    4492                      .dwattr $C$DW$660, DW_AT_TI_symbol_name("_Lhf")
    4493                      .dwattr $C$DW$660, DW_AT_data_member_location[DW_OP_plus_uconst 0xc6]
    4494                      .dwattr $C$DW$660, DW_AT_accessibility(DW_ACCESS_public)
    4495              $C$DW$661       .dwtag  DW_TAG_member
    4496                      .dwattr $C$DW$661, DW_AT_type(*$C$DW$T$77)
    4497                      .dwattr $C$DW$661, DW_AT_name("RoverL")
    4498                      .dwattr $C$DW$661, DW_AT_TI_symbol_name("_RoverL")
    4499                      .dwattr $C$DW$661, DW_AT_data_member_location[DW_OP_plus_uconst 0xc8]
    4500                      .dwattr $C$DW$661, DW_AT_accessibility(DW_ACCESS_public)
    4501              $C$DW$662       .dwtag  DW_TAG_member
    4502                      .dwattr $C$DW$662, DW_AT_type(*$C$DW$T$38)
    4503                      .dwattr $C$DW$662, DW_AT_name("Kp_Id")
    4504                      .dwattr $C$DW$662, DW_AT_TI_symbol_name("_Kp_Id")
    4505                      .dwattr $C$DW$662, DW_AT_data_member_location[DW_OP_plus_uconst 0xca]
    4506                      .dwattr $C$DW$662, DW_AT_accessibility(DW_ACCESS_public)
    4507              $C$DW$663       .dwtag  DW_TAG_member
    4508                      .dwattr $C$DW$663, DW_AT_type(*$C$DW$T$38)
    4509                      .dwattr $C$DW$663, DW_AT_name("Kp_Iq")
    4510                      .dwattr $C$DW$663, DW_AT_TI_symbol_name("_Kp_Iq")
    4511                      .dwattr $C$DW$663, DW_AT_data_member_location[DW_OP_plus_uconst 0xcc]
    4512                      .dwattr $C$DW$663, DW_AT_accessibility(DW_ACCESS_public)
    4513              $C$DW$664       .dwtag  DW_TAG_member
    4514                      .dwattr $C$DW$664, DW_AT_type(*$C$DW$T$38)
    4515                      .dwattr $C$DW$664, DW_AT_name("Kp_spd")
    4516                      .dwattr $C$DW$664, DW_AT_TI_symbol_name("_Kp_spd")
    4517                      .dwattr $C$DW$664, DW_AT_data_member_location[DW_OP_plus_uconst 0xce]
    4518                      .dwattr $C$DW$664, DW_AT_accessibility(DW_ACCESS_public)
    4519              $C$DW$665       .dwtag  DW_TAG_member
    4520                      .dwattr $C$DW$665, DW_AT_type(*$C$DW$T$38)
    4521                      .dwattr $C$DW$665, DW_AT_name("Ki_Id")
    4522                      .dwattr $C$DW$665, DW_AT_TI_symbol_name("_Ki_Id")
    4523                      .dwattr $C$DW$665, DW_AT_data_member_location[DW_OP_plus_uconst 0xd0]
    4524                      .dwattr $C$DW$665, DW_AT_accessibility(DW_ACCESS_public)
    4525              $C$DW$666       .dwtag  DW_TAG_member
    4526                      .dwattr $C$DW$666, DW_AT_type(*$C$DW$T$38)
    4527                      .dwattr $C$DW$666, DW_AT_name("Ki_Iq")
    4528                      .dwattr $C$DW$666, DW_AT_TI_symbol_name("_Ki_Iq")
    4529                      .dwattr $C$DW$666, DW_AT_data_member_location[DW_OP_plus_uconst 0xd2]
    4530                      .dwattr $C$DW$666, DW_AT_accessibility(DW_ACCESS_public)
    4531              $C$DW$667       .dwtag  DW_TAG_member
    4532                      .dwattr $C$DW$667, DW_AT_type(*$C$DW$T$38)
    4533                      .dwattr $C$DW$667, DW_AT_name("Ki_spd")
    4534                      .dwattr $C$DW$667, DW_AT_TI_symbol_name("_Ki_spd")
    4535                      .dwattr $C$DW$667, DW_AT_data_member_location[DW_OP_plus_uconst 0xd4]
    4536                      .dwattr $C$DW$667, DW_AT_accessibility(DW_ACCESS_public)
    4537              $C$DW$668       .dwtag  DW_TAG_member
    4538                      .dwattr $C$DW$668, DW_AT_type(*$C$DW$T$38)
    4539                      .dwattr $C$DW$668, DW_AT_name("Kd_Id")
    4540                      .dwattr $C$DW$668, DW_AT_TI_symbol_name("_Kd_Id")
    4541                      .dwattr $C$DW$668, DW_AT_data_member_location[DW_OP_plus_uconst 0xd6]
    4542                      .dwattr $C$DW$668, DW_AT_accessibility(DW_ACCESS_public)
    4543              $C$DW$669       .dwtag  DW_TAG_member
    4544                      .dwattr $C$DW$669, DW_AT_type(*$C$DW$T$38)
    4545                      .dwattr $C$DW$669, DW_AT_name("Kd_Iq")
    4546                      .dwattr $C$DW$669, DW_AT_TI_symbol_name("_Kd_Iq")
TMS320C2000 Assembler PC v6.2.5 Tue Aug 29 10:15:18 2017

Tools Copyright (c) 1996-2014 Texas Instruments Incorporated
C:\Users\wmj\AppData\Local\Temp\1176011                              PAGE   89

    4547                      .dwattr $C$DW$669, DW_AT_data_member_location[DW_OP_plus_uconst 0xd8]
    4548                      .dwattr $C$DW$669, DW_AT_accessibility(DW_ACCESS_public)
    4549              $C$DW$670       .dwtag  DW_TAG_member
    4550                      .dwattr $C$DW$670, DW_AT_type(*$C$DW$T$38)
    4551                      .dwattr $C$DW$670, DW_AT_name("Kd_spd")
    4552                      .dwattr $C$DW$670, DW_AT_TI_symbol_name("_Kd_spd")
    4553                      .dwattr $C$DW$670, DW_AT_data_member_location[DW_OP_plus_uconst 0xda]
    4554                      .dwattr $C$DW$670, DW_AT_accessibility(DW_ACCESS_public)
    4555              $C$DW$671       .dwtag  DW_TAG_member
    4556                      .dwattr $C$DW$671, DW_AT_type(*$C$DW$T$38)
    4557                      .dwattr $C$DW$671, DW_AT_name("Ui_Id")
    4558                      .dwattr $C$DW$671, DW_AT_TI_symbol_name("_Ui_Id")
    4559                      .dwattr $C$DW$671, DW_AT_data_member_location[DW_OP_plus_uconst 0xdc]
    4560                      .dwattr $C$DW$671, DW_AT_accessibility(DW_ACCESS_public)
    4561              $C$DW$672       .dwtag  DW_TAG_member
    4562                      .dwattr $C$DW$672, DW_AT_type(*$C$DW$T$38)
    4563                      .dwattr $C$DW$672, DW_AT_name("Ui_Iq")
    4564                      .dwattr $C$DW$672, DW_AT_TI_symbol_name("_Ui_Iq")
    4565                      .dwattr $C$DW$672, DW_AT_data_member_location[DW_OP_plus_uconst 0xde]
    4566                      .dwattr $C$DW$672, DW_AT_accessibility(DW_ACCESS_public)
    4567              $C$DW$673       .dwtag  DW_TAG_member
    4568                      .dwattr $C$DW$673, DW_AT_type(*$C$DW$T$38)
    4569                      .dwattr $C$DW$673, DW_AT_name("Ui_spd")
    4570                      .dwattr $C$DW$673, DW_AT_TI_symbol_name("_Ui_spd")
    4571                      .dwattr $C$DW$673, DW_AT_data_member_location[DW_OP_plus_uconst 0xe0]
    4572                      .dwattr $C$DW$673, DW_AT_accessibility(DW_ACCESS_public)
    4573              $C$DW$674       .dwtag  DW_TAG_member
    4574                      .dwattr $C$DW$674, DW_AT_type(*$C$DW$T$39)
    4575                      .dwattr $C$DW$674, DW_AT_name("Idq_ref")
    4576                      .dwattr $C$DW$674, DW_AT_TI_symbol_name("_Idq_ref")
    4577                      .dwattr $C$DW$674, DW_AT_data_member_location[DW_OP_plus_uconst 0xe2]
    4578                      .dwattr $C$DW$674, DW_AT_accessibility(DW_ACCESS_public)
    4579              $C$DW$675       .dwtag  DW_TAG_member
    4580                      .dwattr $C$DW$675, DW_AT_type(*$C$DW$T$38)
    4581                      .dwattr $C$DW$675, DW_AT_name("IdRated")
    4582                      .dwattr $C$DW$675, DW_AT_TI_symbol_name("_IdRated")
    4583                      .dwattr $C$DW$675, DW_AT_data_member_location[DW_OP_plus_uconst 0xe6]
    4584                      .dwattr $C$DW$675, DW_AT_accessibility(DW_ACCESS_public)
    4585              $C$DW$676       .dwtag  DW_TAG_member
    4586                      .dwattr $C$DW$676, DW_AT_type(*$C$DW$T$38)
    4587                      .dwattr $C$DW$676, DW_AT_name("spd_ref")
    4588                      .dwattr $C$DW$676, DW_AT_TI_symbol_name("_spd_ref")
    4589                      .dwattr $C$DW$676, DW_AT_data_member_location[DW_OP_plus_uconst 0xe8]
    4590                      .dwattr $C$DW$676, DW_AT_accessibility(DW_ACCESS_public)
    4591              $C$DW$677       .dwtag  DW_TAG_member
    4592                      .dwattr $C$DW$677, DW_AT_type(*$C$DW$T$38)
    4593                      .dwattr $C$DW$677, DW_AT_name("spd_max")
    4594                      .dwattr $C$DW$677, DW_AT_TI_symbol_name("_spd_max")
    4595                      .dwattr $C$DW$677, DW_AT_data_member_location[DW_OP_plus_uconst 0xea]
    4596                      .dwattr $C$DW$677, DW_AT_accessibility(DW_ACCESS_public)
    4597              $C$DW$678       .dwtag  DW_TAG_member
    4598                      .dwattr $C$DW$678, DW_AT_type(*$C$DW$T$42)
    4599                      .dwattr $C$DW$678, DW_AT_name("counter_current")
    4600                      .dwattr $C$DW$678, DW_AT_TI_symbol_name("_counter_current")
    4601                      .dwattr $C$DW$678, DW_AT_data_member_location[DW_OP_plus_uconst 0xec]
TMS320C2000 Assembler PC v6.2.5 Tue Aug 29 10:15:18 2017

Tools Copyright (c) 1996-2014 Texas Instruments Incorporated
C:\Users\wmj\AppData\Local\Temp\1176011                              PAGE   90

    4602                      .dwattr $C$DW$678, DW_AT_accessibility(DW_ACCESS_public)
    4603              $C$DW$679       .dwtag  DW_TAG_member
    4604                      .dwattr $C$DW$679, DW_AT_type(*$C$DW$T$42)
    4605                      .dwattr $C$DW$679, DW_AT_name("counter_isr")
    4606                      .dwattr $C$DW$679, DW_AT_TI_symbol_name("_counter_isr")
    4607                      .dwattr $C$DW$679, DW_AT_data_member_location[DW_OP_plus_uconst 0xed]
    4608                      .dwattr $C$DW$679, DW_AT_accessibility(DW_ACCESS_public)
    4609              $C$DW$680       .dwtag  DW_TAG_member
    4610                      .dwattr $C$DW$680, DW_AT_type(*$C$DW$T$42)
    4611                      .dwattr $C$DW$680, DW_AT_name("counter_speed")
    4612                      .dwattr $C$DW$680, DW_AT_TI_symbol_name("_counter_speed")
    4613                      .dwattr $C$DW$680, DW_AT_data_member_location[DW_OP_plus_uconst 0xee]
    4614                      .dwattr $C$DW$680, DW_AT_accessibility(DW_ACCESS_public)
    4615              $C$DW$681       .dwtag  DW_TAG_member
    4616                      .dwattr $C$DW$681, DW_AT_type(*$C$DW$T$42)
    4617                      .dwattr $C$DW$681, DW_AT_name("counter_traj")
    4618                      .dwattr $C$DW$681, DW_AT_TI_symbol_name("_counter_traj")
    4619                      .dwattr $C$DW$681, DW_AT_data_member_location[DW_OP_plus_uconst 0xef]
    4620                      .dwattr $C$DW$681, DW_AT_accessibility(DW_ACCESS_public)
    4621              $C$DW$682       .dwtag  DW_TAG_member
    4622                      .dwattr $C$DW$682, DW_AT_type(*$C$DW$T$43)
    4623                      .dwattr $C$DW$682, DW_AT_name("flag_enableCtrl")
    4624                      .dwattr $C$DW$682, DW_AT_TI_symbol_name("_flag_enableCtrl")
    4625                      .dwattr $C$DW$682, DW_AT_data_member_location[DW_OP_plus_uconst 0xf0]
    4626                      .dwattr $C$DW$682, DW_AT_accessibility(DW_ACCESS_public)
    4627              $C$DW$683       .dwtag  DW_TAG_member
    4628                      .dwattr $C$DW$683, DW_AT_type(*$C$DW$T$43)
    4629                      .dwattr $C$DW$683, DW_AT_name("flag_enableDcBusComp")
    4630                      .dwattr $C$DW$683, DW_AT_TI_symbol_name("_flag_enableDcBusComp")
    4631                      .dwattr $C$DW$683, DW_AT_data_member_location[DW_OP_plus_uconst 0xf1]
    4632                      .dwattr $C$DW$683, DW_AT_accessibility(DW_ACCESS_public)
    4633              $C$DW$684       .dwtag  DW_TAG_member
    4634                      .dwattr $C$DW$684, DW_AT_type(*$C$DW$T$43)
    4635                      .dwattr $C$DW$684, DW_AT_name("flag_enablePowerWarp")
    4636                      .dwattr $C$DW$684, DW_AT_TI_symbol_name("_flag_enablePowerWarp")
    4637                      .dwattr $C$DW$684, DW_AT_data_member_location[DW_OP_plus_uconst 0xf2]
    4638                      .dwattr $C$DW$684, DW_AT_accessibility(DW_ACCESS_public)
    4639              $C$DW$685       .dwtag  DW_TAG_member
    4640                      .dwattr $C$DW$685, DW_AT_type(*$C$DW$T$43)
    4641                      .dwattr $C$DW$685, DW_AT_name("flag_enableOffset")
    4642                      .dwattr $C$DW$685, DW_AT_TI_symbol_name("_flag_enableOffset")
    4643                      .dwattr $C$DW$685, DW_AT_data_member_location[DW_OP_plus_uconst 0xf3]
    4644                      .dwattr $C$DW$685, DW_AT_accessibility(DW_ACCESS_public)
    4645              $C$DW$686       .dwtag  DW_TAG_member
    4646                      .dwattr $C$DW$686, DW_AT_type(*$C$DW$T$43)
    4647                      .dwattr $C$DW$686, DW_AT_name("flag_enableSpeedCtrl")
    4648                      .dwattr $C$DW$686, DW_AT_TI_symbol_name("_flag_enableSpeedCtrl")
    4649                      .dwattr $C$DW$686, DW_AT_data_member_location[DW_OP_plus_uconst 0xf4]
    4650                      .dwattr $C$DW$686, DW_AT_accessibility(DW_ACCESS_public)
    4651              $C$DW$687       .dwtag  DW_TAG_member
    4652                      .dwattr $C$DW$687, DW_AT_type(*$C$DW$T$43)
    4653                      .dwattr $C$DW$687, DW_AT_name("flag_enableUserMotorParams")
    4654                      .dwattr $C$DW$687, DW_AT_TI_symbol_name("_flag_enableUserMotorParams")
    4655                      .dwattr $C$DW$687, DW_AT_data_member_location[DW_OP_plus_uconst 0xf5]
    4656                      .dwattr $C$DW$687, DW_AT_accessibility(DW_ACCESS_public)
TMS320C2000 Assembler PC v6.2.5 Tue Aug 29 10:15:18 2017

Tools Copyright (c) 1996-2014 Texas Instruments Incorporated
C:\Users\wmj\AppData\Local\Temp\1176011                              PAGE   91

    4657              $C$DW$688       .dwtag  DW_TAG_member
    4658                      .dwattr $C$DW$688, DW_AT_type(*$C$DW$T$39)
    4659                      .dwattr $C$DW$688, DW_AT_name("Idq_offset_pu")
    4660                      .dwattr $C$DW$688, DW_AT_TI_symbol_name("_Idq_offset_pu")
    4661                      .dwattr $C$DW$688, DW_AT_data_member_location[DW_OP_plus_uconst 0xf6]
    4662                      .dwattr $C$DW$688, DW_AT_accessibility(DW_ACCESS_public)
    4663              $C$DW$689       .dwtag  DW_TAG_member
    4664                      .dwattr $C$DW$689, DW_AT_type(*$C$DW$T$39)
    4665                      .dwattr $C$DW$689, DW_AT_name("Vdq_offset_pu")
    4666                      .dwattr $C$DW$689, DW_AT_TI_symbol_name("_Vdq_offset_pu")
    4667                      .dwattr $C$DW$689, DW_AT_data_member_location[DW_OP_plus_uconst 0xfa]
    4668                      .dwattr $C$DW$689, DW_AT_accessibility(DW_ACCESS_public)
    4669              $C$DW$690       .dwtag  DW_TAG_member
    4670                      .dwattr $C$DW$690, DW_AT_type(*$C$DW$T$38)
    4671                      .dwattr $C$DW$690, DW_AT_name("angle_pu")
    4672                      .dwattr $C$DW$690, DW_AT_TI_symbol_name("_angle_pu")
    4673                      .dwattr $C$DW$690, DW_AT_data_member_location[DW_OP_plus_uconst 0xfe]
    4674                      .dwattr $C$DW$690, DW_AT_accessibility(DW_ACCESS_public)
    4675              $C$DW$691       .dwtag  DW_TAG_member
    4676                      .dwattr $C$DW$691, DW_AT_type(*$C$DW$T$38)
    4677                      .dwattr $C$DW$691, DW_AT_name("speed_ref_pu")
    4678                      .dwattr $C$DW$691, DW_AT_TI_symbol_name("_speed_ref_pu")
    4679                      .dwattr $C$DW$691, DW_AT_data_member_location[DW_OP_plus_uconst 0x100]
    4680                      .dwattr $C$DW$691, DW_AT_accessibility(DW_ACCESS_public)
    4681              $C$DW$692       .dwtag  DW_TAG_member
    4682                      .dwattr $C$DW$692, DW_AT_type(*$C$DW$T$38)
    4683                      .dwattr $C$DW$692, DW_AT_name("speed_fb_pu")
    4684                      .dwattr $C$DW$692, DW_AT_TI_symbol_name("_speed_fb_pu")
    4685                      .dwattr $C$DW$692, DW_AT_data_member_location[DW_OP_plus_uconst 0x102]
    4686                      .dwattr $C$DW$692, DW_AT_accessibility(DW_ACCESS_public)
    4687              $C$DW$693       .dwtag  DW_TAG_member
    4688                      .dwattr $C$DW$693, DW_AT_type(*$C$DW$T$38)
    4689                      .dwattr $C$DW$693, DW_AT_name("speed_outMax_pu")
    4690                      .dwattr $C$DW$693, DW_AT_TI_symbol_name("_speed_outMax_pu")
    4691                      .dwattr $C$DW$693, DW_AT_data_member_location[DW_OP_plus_uconst 0x104]
    4692                      .dwattr $C$DW$693, DW_AT_accessibility(DW_ACCESS_public)
    4693              $C$DW$694       .dwtag  DW_TAG_member
    4694                      .dwattr $C$DW$694, DW_AT_type(*$C$DW$T$43)
    4695                      .dwattr $C$DW$694, DW_AT_name("flag_enableCurrentCtrl")
    4696                      .dwattr $C$DW$694, DW_AT_TI_symbol_name("_flag_enableCurrentCtrl")
    4697                      .dwattr $C$DW$694, DW_AT_data_member_location[DW_OP_plus_uconst 0x106]
    4698                      .dwattr $C$DW$694, DW_AT_accessibility(DW_ACCESS_public)
    4699                      .dwendtag $C$DW$T$78
    4700              
    4701              $C$DW$T$272     .dwtag  DW_TAG_typedef, DW_AT_name("CTRL_Obj")
    4702                      .dwattr $C$DW$T$272, DW_AT_type(*$C$DW$T$78)
    4703                      .dwattr $C$DW$T$272, DW_AT_language(DW_LANG_C)
    4704              $C$DW$T$273     .dwtag  DW_TAG_pointer_type
    4705                      .dwattr $C$DW$T$273, DW_AT_type(*$C$DW$T$272)
    4706                      .dwattr $C$DW$T$273, DW_AT_address_class(0x16)
    4707              $C$DW$T$244     .dwtag  DW_TAG_pointer_type
    4708                      .dwattr $C$DW$T$244, DW_AT_type(*$C$DW$T$78)
    4709                      .dwattr $C$DW$T$244, DW_AT_address_class(0x16)
    4710              $C$DW$T$245     .dwtag  DW_TAG_typedef, DW_AT_name("CTRL_Handle")
    4711                      .dwattr $C$DW$T$245, DW_AT_type(*$C$DW$T$244)
TMS320C2000 Assembler PC v6.2.5 Tue Aug 29 10:15:18 2017

Tools Copyright (c) 1996-2014 Texas Instruments Incorporated
C:\Users\wmj\AppData\Local\Temp\1176011                              PAGE   92

    4712                      .dwattr $C$DW$T$245, DW_AT_language(DW_LANG_C)
    4713              $C$DW$695       .dwtag  DW_TAG_TI_far_type
    4714                      .dwattr $C$DW$695, DW_AT_type(*$C$DW$T$245)
    4715              $C$DW$T$274     .dwtag  DW_TAG_const_type
    4716                      .dwattr $C$DW$T$274, DW_AT_type(*$C$DW$695)
    4717              
    4718              $C$DW$T$81      .dwtag  DW_TAG_structure_type
    4719                      .dwattr $C$DW$T$81, DW_AT_name("_CTRL_Version_")
    4720                      .dwattr $C$DW$T$81, DW_AT_byte_size(0x04)
    4721              $C$DW$696       .dwtag  DW_TAG_member
    4722                      .dwattr $C$DW$696, DW_AT_type(*$C$DW$T$24)
    4723                      .dwattr $C$DW$696, DW_AT_name("rsvd")
    4724                      .dwattr $C$DW$696, DW_AT_TI_symbol_name("_rsvd")
    4725                      .dwattr $C$DW$696, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    4726                      .dwattr $C$DW$696, DW_AT_accessibility(DW_ACCESS_public)
    4727              $C$DW$697       .dwtag  DW_TAG_member
    4728                      .dwattr $C$DW$697, DW_AT_type(*$C$DW$T$80)
    4729                      .dwattr $C$DW$697, DW_AT_name("targetProc")
    4730                      .dwattr $C$DW$697, DW_AT_TI_symbol_name("_targetProc")
    4731                      .dwattr $C$DW$697, DW_AT_data_member_location[DW_OP_plus_uconst 0x1]
    4732                      .dwattr $C$DW$697, DW_AT_accessibility(DW_ACCESS_public)
    4733              $C$DW$698       .dwtag  DW_TAG_member
    4734                      .dwattr $C$DW$698, DW_AT_type(*$C$DW$T$24)
    4735                      .dwattr $C$DW$698, DW_AT_name("major")
    4736                      .dwattr $C$DW$698, DW_AT_TI_symbol_name("_major")
    4737                      .dwattr $C$DW$698, DW_AT_data_member_location[DW_OP_plus_uconst 0x2]
    4738                      .dwattr $C$DW$698, DW_AT_accessibility(DW_ACCESS_public)
    4739              $C$DW$699       .dwtag  DW_TAG_member
    4740                      .dwattr $C$DW$699, DW_AT_type(*$C$DW$T$24)
    4741                      .dwattr $C$DW$699, DW_AT_name("minor")
    4742                      .dwattr $C$DW$699, DW_AT_TI_symbol_name("_minor")
    4743                      .dwattr $C$DW$699, DW_AT_data_member_location[DW_OP_plus_uconst 0x3]
    4744                      .dwattr $C$DW$699, DW_AT_accessibility(DW_ACCESS_public)
    4745                      .dwendtag $C$DW$T$81
    4746              
    4747              $C$DW$T$51      .dwtag  DW_TAG_typedef, DW_AT_name("CTRL_Version")
    4748                      .dwattr $C$DW$T$51, DW_AT_type(*$C$DW$T$81)
    4749                      .dwattr $C$DW$T$51, DW_AT_language(DW_LANG_C)
    4750              $C$DW$T$282     .dwtag  DW_TAG_pointer_type
    4751                      .dwattr $C$DW$T$282, DW_AT_type(*$C$DW$T$51)
    4752                      .dwattr $C$DW$T$282, DW_AT_address_class(0x16)
    4753              
    4754              $C$DW$T$88      .dwtag  DW_TAG_structure_type
    4755                      .dwattr $C$DW$T$88, DW_AT_name("_DECODER_Obj_")
    4756                      .dwattr $C$DW$T$88, DW_AT_byte_size(0x06)
    4757              $C$DW$700       .dwtag  DW_TAG_member
    4758                      .dwattr $C$DW$700, DW_AT_type(*$C$DW$T$83)
    4759                      .dwattr $C$DW$700, DW_AT_name("spiHandle")
    4760                      .dwattr $C$DW$700, DW_AT_TI_symbol_name("_spiHandle")
    4761                      .dwattr $C$DW$700, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    4762                      .dwattr $C$DW$700, DW_AT_accessibility(DW_ACCESS_public)
    4763              $C$DW$701       .dwtag  DW_TAG_member
    4764                      .dwattr $C$DW$701, DW_AT_type(*$C$DW$T$85)
    4765                      .dwattr $C$DW$701, DW_AT_name("gpioHandle")
    4766                      .dwattr $C$DW$701, DW_AT_TI_symbol_name("_gpioHandle")
TMS320C2000 Assembler PC v6.2.5 Tue Aug 29 10:15:18 2017

Tools Copyright (c) 1996-2014 Texas Instruments Incorporated
C:\Users\wmj\AppData\Local\Temp\1176011                              PAGE   93

    4767                      .dwattr $C$DW$701, DW_AT_data_member_location[DW_OP_plus_uconst 0x2]
    4768                      .dwattr $C$DW$701, DW_AT_accessibility(DW_ACCESS_public)
    4769              $C$DW$702       .dwtag  DW_TAG_member
    4770                      .dwattr $C$DW$702, DW_AT_type(*$C$DW$T$87)
    4771                      .dwattr $C$DW$702, DW_AT_name("gpioNumber")
    4772                      .dwattr $C$DW$702, DW_AT_TI_symbol_name("_gpioNumber")
    4773                      .dwattr $C$DW$702, DW_AT_data_member_location[DW_OP_plus_uconst 0x4]
    4774                      .dwattr $C$DW$702, DW_AT_accessibility(DW_ACCESS_public)
    4775              $C$DW$703       .dwtag  DW_TAG_member
    4776                      .dwattr $C$DW$703, DW_AT_type(*$C$DW$T$43)
    4777                      .dwattr $C$DW$703, DW_AT_name("RxTimeOut")
    4778                      .dwattr $C$DW$703, DW_AT_TI_symbol_name("_RxTimeOut")
    4779                      .dwattr $C$DW$703, DW_AT_data_member_location[DW_OP_plus_uconst 0x5]
    4780                      .dwattr $C$DW$703, DW_AT_accessibility(DW_ACCESS_public)
    4781                      .dwendtag $C$DW$T$88
    4782              
    4783              $C$DW$T$221     .dwtag  DW_TAG_typedef, DW_AT_name("DECODER_Obj")
    4784                      .dwattr $C$DW$T$221, DW_AT_type(*$C$DW$T$88)
    4785                      .dwattr $C$DW$T$221, DW_AT_language(DW_LANG_C)
    4786              $C$DW$T$219     .dwtag  DW_TAG_pointer_type
    4787                      .dwattr $C$DW$T$219, DW_AT_type(*$C$DW$T$88)
    4788                      .dwattr $C$DW$T$219, DW_AT_address_class(0x16)
    4789              $C$DW$T$220     .dwtag  DW_TAG_typedef, DW_AT_name("DECODER_Handle")
    4790                      .dwattr $C$DW$T$220, DW_AT_type(*$C$DW$T$219)
    4791                      .dwattr $C$DW$T$220, DW_AT_language(DW_LANG_C)
    4792              
    4793              $C$DW$T$89      .dwtag  DW_TAG_structure_type
    4794                      .dwattr $C$DW$T$89, DW_AT_name("_DRIVE_CURRENT_t_")
    4795                      .dwattr $C$DW$T$89, DW_AT_byte_size(0x02)
    4796              $C$DW$704       .dwtag  DW_TAG_member
    4797                      .dwattr $C$DW$704, DW_AT_type(*$C$DW$T$24)
    4798                      .dwattr $C$DW$704, DW_AT_name("IDRIVE")
    4799                      .dwattr $C$DW$704, DW_AT_TI_symbol_name("_IDRIVE")
    4800                      .dwattr $C$DW$704, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    4801                      .dwattr $C$DW$704, DW_AT_accessibility(DW_ACCESS_public)
    4802              $C$DW$705       .dwtag  DW_TAG_member
    4803                      .dwattr $C$DW$705, DW_AT_type(*$C$DW$T$24)
    4804                      .dwattr $C$DW$705, DW_AT_name("INIT_IDRIVE")
    4805                      .dwattr $C$DW$705, DW_AT_TI_symbol_name("_INIT_IDRIVE")
    4806                      .dwattr $C$DW$705, DW_AT_data_member_location[DW_OP_plus_uconst 0x1]
    4807                      .dwattr $C$DW$705, DW_AT_accessibility(DW_ACCESS_public)
    4808                      .dwendtag $C$DW$T$89
    4809              
    4810              $C$DW$T$156     .dwtag  DW_TAG_typedef, DW_AT_name("DRIVE_CURRENT_t_")
    4811                      .dwattr $C$DW$T$156, DW_AT_type(*$C$DW$T$89)
    4812                      .dwattr $C$DW$T$156, DW_AT_language(DW_LANG_C)
    4813              
    4814              $C$DW$T$21      .dwtag  DW_TAG_structure_type
    4815                      .dwattr $C$DW$T$21, DW_AT_name("_EST_Obj_")
    4816                      .dwattr $C$DW$T$21, DW_AT_declaration
    4817                      .dwendtag $C$DW$T$21
    4818              
    4819              $C$DW$T$59      .dwtag  DW_TAG_pointer_type
    4820                      .dwattr $C$DW$T$59, DW_AT_type(*$C$DW$T$21)
    4821                      .dwattr $C$DW$T$59, DW_AT_address_class(0x16)
TMS320C2000 Assembler PC v6.2.5 Tue Aug 29 10:15:18 2017

Tools Copyright (c) 1996-2014 Texas Instruments Incorporated
C:\Users\wmj\AppData\Local\Temp\1176011                              PAGE   94

    4822              $C$DW$T$60      .dwtag  DW_TAG_typedef, DW_AT_name("EST_Handle")
    4823                      .dwattr $C$DW$T$60, DW_AT_type(*$C$DW$T$59)
    4824                      .dwattr $C$DW$T$60, DW_AT_language(DW_LANG_C)
    4825              
    4826              $C$DW$T$90      .dwtag  DW_TAG_structure_type
    4827                      .dwattr $C$DW$T$90, DW_AT_name("_FILTER_FO_")
    4828                      .dwattr $C$DW$T$90, DW_AT_byte_size(0x0a)
    4829              $C$DW$706       .dwtag  DW_TAG_member
    4830                      .dwattr $C$DW$706, DW_AT_type(*$C$DW$T$38)
    4831                      .dwattr $C$DW$706, DW_AT_name("a1")
    4832                      .dwattr $C$DW$706, DW_AT_TI_symbol_name("_a1")
    4833                      .dwattr $C$DW$706, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    4834                      .dwattr $C$DW$706, DW_AT_accessibility(DW_ACCESS_public)
    4835              $C$DW$707       .dwtag  DW_TAG_member
    4836                      .dwattr $C$DW$707, DW_AT_type(*$C$DW$T$38)
    4837                      .dwattr $C$DW$707, DW_AT_name("b0")
    4838                      .dwattr $C$DW$707, DW_AT_TI_symbol_name("_b0")
    4839                      .dwattr $C$DW$707, DW_AT_data_member_location[DW_OP_plus_uconst 0x2]
    4840                      .dwattr $C$DW$707, DW_AT_accessibility(DW_ACCESS_public)
    4841              $C$DW$708       .dwtag  DW_TAG_member
    4842                      .dwattr $C$DW$708, DW_AT_type(*$C$DW$T$38)
    4843                      .dwattr $C$DW$708, DW_AT_name("b1")
    4844                      .dwattr $C$DW$708, DW_AT_TI_symbol_name("_b1")
    4845                      .dwattr $C$DW$708, DW_AT_data_member_location[DW_OP_plus_uconst 0x4]
    4846                      .dwattr $C$DW$708, DW_AT_accessibility(DW_ACCESS_public)
    4847              $C$DW$709       .dwtag  DW_TAG_member
    4848                      .dwattr $C$DW$709, DW_AT_type(*$C$DW$T$38)
    4849                      .dwattr $C$DW$709, DW_AT_name("x1")
    4850                      .dwattr $C$DW$709, DW_AT_TI_symbol_name("_x1")
    4851                      .dwattr $C$DW$709, DW_AT_data_member_location[DW_OP_plus_uconst 0x6]
    4852                      .dwattr $C$DW$709, DW_AT_accessibility(DW_ACCESS_public)
    4853              $C$DW$710       .dwtag  DW_TAG_member
    4854                      .dwattr $C$DW$710, DW_AT_type(*$C$DW$T$38)
    4855                      .dwattr $C$DW$710, DW_AT_name("y1")
    4856                      .dwattr $C$DW$710, DW_AT_TI_symbol_name("_y1")
    4857                      .dwattr $C$DW$710, DW_AT_data_member_location[DW_OP_plus_uconst 0x8]
    4858                      .dwattr $C$DW$710, DW_AT_accessibility(DW_ACCESS_public)
    4859                      .dwendtag $C$DW$T$90
    4860              
    4861              $C$DW$T$182     .dwtag  DW_TAG_typedef, DW_AT_name("FILTER_FO_Obj")
    4862                      .dwattr $C$DW$T$182, DW_AT_type(*$C$DW$T$90)
    4863                      .dwattr $C$DW$T$182, DW_AT_language(DW_LANG_C)
    4864              
    4865              $C$DW$T$22      .dwtag  DW_TAG_structure_type
    4866                      .dwattr $C$DW$T$22, DW_AT_name("_FILTER_FO_Obj_")
    4867                      .dwattr $C$DW$T$22, DW_AT_declaration
    4868                      .dwendtag $C$DW$T$22
    4869              
    4870              $C$DW$T$183     .dwtag  DW_TAG_pointer_type
    4871                      .dwattr $C$DW$T$183, DW_AT_type(*$C$DW$T$22)
    4872                      .dwattr $C$DW$T$183, DW_AT_address_class(0x16)
    4873              $C$DW$T$184     .dwtag  DW_TAG_typedef, DW_AT_name("FILTER_FO_Handle")
    4874                      .dwattr $C$DW$T$184, DW_AT_type(*$C$DW$T$183)
    4875                      .dwattr $C$DW$T$184, DW_AT_language(DW_LANG_C)
    4876              
TMS320C2000 Assembler PC v6.2.5 Tue Aug 29 10:15:18 2017

Tools Copyright (c) 1996-2014 Texas Instruments Incorporated
C:\Users\wmj\AppData\Local\Temp\1176011                              PAGE   95

    4877              $C$DW$T$91      .dwtag  DW_TAG_structure_type
    4878                      .dwattr $C$DW$T$91, DW_AT_name("_FLASH_Obj_")
    4879                      .dwattr $C$DW$T$91, DW_AT_byte_size(0x08)
    4880              $C$DW$711       .dwtag  DW_TAG_member
    4881                      .dwattr $C$DW$711, DW_AT_type(*$C$DW$T$25)
    4882                      .dwattr $C$DW$711, DW_AT_name("FOPT")
    4883                      .dwattr $C$DW$711, DW_AT_TI_symbol_name("_FOPT")
    4884                      .dwattr $C$DW$711, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    4885                      .dwattr $C$DW$711, DW_AT_accessibility(DW_ACCESS_public)
    4886              $C$DW$712       .dwtag  DW_TAG_member
    4887                      .dwattr $C$DW$712, DW_AT_type(*$C$DW$T$25)
    4888                      .dwattr $C$DW$712, DW_AT_name("rsvd_1")
    4889                      .dwattr $C$DW$712, DW_AT_TI_symbol_name("_rsvd_1")
    4890                      .dwattr $C$DW$712, DW_AT_data_member_location[DW_OP_plus_uconst 0x1]
    4891                      .dwattr $C$DW$712, DW_AT_accessibility(DW_ACCESS_public)
    4892              $C$DW$713       .dwtag  DW_TAG_member
    4893                      .dwattr $C$DW$713, DW_AT_type(*$C$DW$T$25)
    4894                      .dwattr $C$DW$713, DW_AT_name("FPWR")
