TMS320C2000 Assembler PC v6.2.5 Sat Sep 16 15:41:34 2017

Tools Copyright (c) 1996-2014 Texas Instruments Incorporated
C:\Users\wmj\AppData\Local\Temp\1144410                              PAGE    1

       1              ;***************************************************************
       2              ;* TMS320C2000 C/C++ Codegen                         PC v6.2.5 *
       3              ;* Date/Time created: Sat Sep 16 15:41:33 2017                 *
       4              ;***************************************************************
       5                      .compiler_opts --float_support=softlib --hll_source=on --mem_model:code=flat --mem_model:data=large -
       6        0002  FP      .set    XAR2
       7              
       8              $C$DW$CU        .dwtag  DW_TAG_compile_unit
       9                      .dwattr $C$DW$CU, DW_AT_name("D:/BM1000/sw/solutions/instaspin_foc/src/proj_lab02b.c")
      10                      .dwattr $C$DW$CU, DW_AT_producer("TMS320C2000 C/C++ Codegen PC v6.2.5 Copyright (c) 1996-2014 Texas I
      11                      .dwattr $C$DW$CU, DW_AT_TI_version(0x01)
      12                      .dwattr $C$DW$CU, DW_AT_comp_dir("D:\BM1000\sw\solutions\instaspin_foc\boards\hvkit_rev1p1\f28x\f2802
      13              ;**************************************************************
      14              ;* CINIT RECORDS                                              *

    3834                      .dwattr $C$DW$T$256, DW_AT_language(DW_LANG_C)
    3835              
    3836              $C$DW$T$258     .dwtag  DW_TAG_enumeration_type
    3837                      .dwattr $C$DW$T$258, DW_AT_byte_size(0x01)
    3838              $C$DW$557       .dwtag  DW_TAG_enumerator, DW_AT_name("PIE_GroupNumber_1"), DW_AT_const_value(0x00)
    3839              $C$DW$558       .dwtag  DW_TAG_enumerator, DW_AT_name("PIE_GroupNumber_2"), DW_AT_const_value(0x01)
    3840              $C$DW$559       .dwtag  DW_TAG_enumerator, DW_AT_name("PIE_GroupNumber_3"), DW_AT_const_value(0x02)
    3841              $C$DW$560       .dwtag  DW_TAG_enumerator, DW_AT_name("PIE_GroupNumber_4"), DW_AT_const_value(0x03)
    3842              $C$DW$561       .dwtag  DW_TAG_enumerator, DW_AT_name("PIE_GroupNumber_5"), DW_AT_const_value(0x04)
    3843              $C$DW$562       .dwtag  DW_TAG_enumerator, DW_AT_name("PIE_GroupNumber_6"), DW_AT_const_value(0x05)
    3844              $C$DW$563       .dwtag  DW_TAG_enumerator, DW_AT_name("PIE_GroupNumber_7"), DW_AT_const_value(0x06)
    3845              $C$DW$564       .dwtag  DW_TAG_enumerator, DW_AT_name("PIE_GroupNumber_8"), DW_AT_const_value(0x07)
    3846              $C$DW$565       .dwtag  DW_TAG_enumerator, DW_AT_name("PIE_GroupNumber_9"), DW_AT_const_value(0x08)
    3847              $C$DW$566       .dwtag  DW_TAG_enumerator, DW_AT_name("PIE_GroupNumber_10"), DW_AT_const_value(0x09)
    3848              $C$DW$567       .dwtag  DW_TAG_enumerator, DW_AT_name("PIE_GroupNumber_11"), DW_AT_const_value(0x0a)
    3849              $C$DW$568       .dwtag  DW_TAG_enumerator, DW_AT_name("PIE_GroupNumber_12"), DW_AT_const_value(0x0b)
    3850                      .dwendtag $C$DW$T$258
    3851              
    3852              $C$DW$T$259     .dwtag  DW_TAG_typedef, DW_AT_name("PIE_GroupNumber_e")
    3853                      .dwattr $C$DW$T$259, DW_AT_type(*$C$DW$T$258)
    3854                      .dwattr $C$DW$T$259, DW_AT_language(DW_LANG_C)
    3855              
    3856              $C$DW$T$261     .dwtag  DW_TAG_enumeration_type
    3857                      .dwattr $C$DW$T$261, DW_AT_byte_size(0x01)
    3858              $C$DW$569       .dwtag  DW_TAG_enumerator, DW_AT_name("CTRL_Type_PID_spd"), DW_AT_const_value(0x00)
    3859              $C$DW$570       .dwtag  DW_TAG_enumerator, DW_AT_name("CTRL_Type_PID_Id"), DW_AT_const_value(0x01)
    3860              $C$DW$571       .dwtag  DW_TAG_enumerator, DW_AT_name("CTRL_Type_PID_Iq"), DW_AT_const_value(0x02)
    3861                      .dwendtag $C$DW$T$261
    3862              
    3863              $C$DW$T$262     .dwtag  DW_TAG_typedef, DW_AT_name("CTRL_Type_e")
    3864                      .dwattr $C$DW$T$262, DW_AT_type(*$C$DW$T$261)
    3865                      .dwattr $C$DW$T$262, DW_AT_language(DW_LANG_C)
    3866              
    3867              $C$DW$T$264     .dwtag  DW_TAG_enumeration_type
TMS320C2000 Assembler PC v6.2.5 Sat Sep 16 15:41:34 2017

Tools Copyright (c) 1996-2014 Texas Instruments Incorporated
C:\Users\wmj\AppData\Local\Temp\1144410                              PAGE   77

    3868                      .dwattr $C$DW$T$264, DW_AT_byte_size(0x01)
    3869              $C$DW$572       .dwtag  DW_TAG_enumerator, DW_AT_name("HAL_SensorType_Current"), DW_AT_const_value(0x00)
    3870              $C$DW$573       .dwtag  DW_TAG_enumerator, DW_AT_name("HAL_SensorType_Voltage"), DW_AT_const_value(0x01)
    3871                      .dwendtag $C$DW$T$264
    3872              
    3873              $C$DW$T$265     .dwtag  DW_TAG_typedef, DW_AT_name("HAL_SensorType_e")
    3874                      .dwattr $C$DW$T$265, DW_AT_type(*$C$DW$T$264)
    3875                      .dwattr $C$DW$T$265, DW_AT_language(DW_LANG_C)
    3876              
    3877              $C$DW$T$19      .dwtag  DW_TAG_structure_type
    3878                      .dwattr $C$DW$T$19, DW_AT_name("I2C_Obj")
    3879                      .dwattr $C$DW$T$19, DW_AT_declaration
    3880                      .dwendtag $C$DW$T$19
    3881              
    3882              $C$DW$T$120     .dwtag  DW_TAG_pointer_type
    3883                      .dwattr $C$DW$T$120, DW_AT_type(*$C$DW$T$19)
    3884                      .dwattr $C$DW$T$120, DW_AT_address_class(0x16)
    3885              $C$DW$T$121     .dwtag  DW_TAG_typedef, DW_AT_name("I2C_Handle")
    3886                      .dwattr $C$DW$T$121, DW_AT_type(*$C$DW$T$120)
    3887                      .dwattr $C$DW$T$121, DW_AT_language(DW_LANG_C)
    3888              
    3889              $C$DW$T$20      .dwtag  DW_TAG_structure_type
    3890                      .dwattr $C$DW$T$20, DW_AT_name("LDC161x_REG_Obj")
    3891                      .dwattr $C$DW$T$20, DW_AT_declaration
    3892                      .dwendtag $C$DW$T$20
    3893              
    3894              $C$DW$T$139     .dwtag  DW_TAG_pointer_type
    3895                      .dwattr $C$DW$T$139, DW_AT_type(*$C$DW$T$20)
    3896                      .dwattr $C$DW$T$139, DW_AT_address_class(0x16)
    3897              $C$DW$T$140     .dwtag  DW_TAG_typedef, DW_AT_name("LDC_Handle")
    3898                      .dwattr $C$DW$T$140, DW_AT_type(*$C$DW$T$139)
    3899                      .dwattr $C$DW$T$140, DW_AT_language(DW_LANG_C)
    3900              
    3901              $C$DW$T$32      .dwtag  DW_TAG_structure_type
    3902                      .dwattr $C$DW$T$32, DW_AT_name("_ADC_Obj_")
    3903                      .dwattr $C$DW$T$32, DW_AT_byte_size(0x6650)
    3904              $C$DW$574       .dwtag  DW_TAG_member
    3905                      .dwattr $C$DW$574, DW_AT_type(*$C$DW$T$26)
    3906                      .dwattr $C$DW$574, DW_AT_name("ADCRESULT")
    3907                      .dwattr $C$DW$574, DW_AT_TI_symbol_name("_ADCRESULT")
    3908                      .dwattr $C$DW$574, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    3909                      .dwattr $C$DW$574, DW_AT_accessibility(DW_ACCESS_public)
    3910              $C$DW$575       .dwtag  DW_TAG_member
    3911                      .dwattr $C$DW$575, DW_AT_type(*$C$DW$T$27)
    3912                      .dwattr $C$DW$575, DW_AT_name("resvd_1")
    3913                      .dwattr $C$DW$575, DW_AT_TI_symbol_name("_resvd_1")
    3914                      .dwattr $C$DW$575, DW_AT_data_member_location[DW_OP_plus_uconst 0x10]
    3915                      .dwattr $C$DW$575, DW_AT_accessibility(DW_ACCESS_public)
    3916              $C$DW$576       .dwtag  DW_TAG_member
    3917                      .dwattr $C$DW$576, DW_AT_type(*$C$DW$T$25)
    3918                      .dwattr $C$DW$576, DW_AT_name("ADCCTL1")
    3919                      .dwattr $C$DW$576, DW_AT_TI_symbol_name("_ADCCTL1")
    3920                      .dwattr $C$DW$576, DW_AT_data_member_location[DW_OP_plus_uconst 0x6600]
    3921                      .dwattr $C$DW$576, DW_AT_accessibility(DW_ACCESS_public)
    3922              $C$DW$577       .dwtag  DW_TAG_member
TMS320C2000 Assembler PC v6.2.5 Sat Sep 16 15:41:34 2017

Tools Copyright (c) 1996-2014 Texas Instruments Incorporated
C:\Users\wmj\AppData\Local\Temp\1144410                              PAGE   78

    3923                      .dwattr $C$DW$577, DW_AT_type(*$C$DW$T$25)
    3924                      .dwattr $C$DW$577, DW_AT_name("ADCCTL2")
    3925                      .dwattr $C$DW$577, DW_AT_TI_symbol_name("_ADCCTL2")
    3926                      .dwattr $C$DW$577, DW_AT_data_member_location[DW_OP_plus_uconst 0x6601]
    3927                      .dwattr $C$DW$577, DW_AT_accessibility(DW_ACCESS_public)
    3928              $C$DW$578       .dwtag  DW_TAG_member
    3929                      .dwattr $C$DW$578, DW_AT_type(*$C$DW$T$28)
    3930                      .dwattr $C$DW$578, DW_AT_name("rsvd_2")
    3931                      .dwattr $C$DW$578, DW_AT_TI_symbol_name("_rsvd_2")
    3932                      .dwattr $C$DW$578, DW_AT_data_member_location[DW_OP_plus_uconst 0x6602]
    3933                      .dwattr $C$DW$578, DW_AT_accessibility(DW_ACCESS_public)
    3934              $C$DW$579       .dwtag  DW_TAG_member
    3935                      .dwattr $C$DW$579, DW_AT_type(*$C$DW$T$25)
    3936                      .dwattr $C$DW$579, DW_AT_name("ADCINTFLG")
    3937                      .dwattr $C$DW$579, DW_AT_TI_symbol_name("_ADCINTFLG")
    3938                      .dwattr $C$DW$579, DW_AT_data_member_location[DW_OP_plus_uconst 0x6604]
    3939                      .dwattr $C$DW$579, DW_AT_accessibility(DW_ACCESS_public)
    3940              $C$DW$580       .dwtag  DW_TAG_member
    3941                      .dwattr $C$DW$580, DW_AT_type(*$C$DW$T$25)
    3942                      .dwattr $C$DW$580, DW_AT_name("ADCINTFLGCLR")
    3943                      .dwattr $C$DW$580, DW_AT_TI_symbol_name("_ADCINTFLGCLR")
    3944                      .dwattr $C$DW$580, DW_AT_data_member_location[DW_OP_plus_uconst 0x6605]
    3945                      .dwattr $C$DW$580, DW_AT_accessibility(DW_ACCESS_public)
    3946              $C$DW$581       .dwtag  DW_TAG_member
    3947                      .dwattr $C$DW$581, DW_AT_type(*$C$DW$T$25)
    3948                      .dwattr $C$DW$581, DW_AT_name("ADCINTOVF")
    3949                      .dwattr $C$DW$581, DW_AT_TI_symbol_name("_ADCINTOVF")
    3950                      .dwattr $C$DW$581, DW_AT_data_member_location[DW_OP_plus_uconst 0x6606]
    3951                      .dwattr $C$DW$581, DW_AT_accessibility(DW_ACCESS_public)
    3952              $C$DW$582       .dwtag  DW_TAG_member
    3953                      .dwattr $C$DW$582, DW_AT_type(*$C$DW$T$25)
    3954                      .dwattr $C$DW$582, DW_AT_name("ADCINTOVFCLR")
    3955                      .dwattr $C$DW$582, DW_AT_TI_symbol_name("_ADCINTOVFCLR")
    3956                      .dwattr $C$DW$582, DW_AT_data_member_location[DW_OP_plus_uconst 0x6607]
    3957                      .dwattr $C$DW$582, DW_AT_accessibility(DW_ACCESS_public)
    3958              $C$DW$583       .dwtag  DW_TAG_member
    3959                      .dwattr $C$DW$583, DW_AT_type(*$C$DW$T$29)
    3960                      .dwattr $C$DW$583, DW_AT_name("INTSELxNy")
    3961                      .dwattr $C$DW$583, DW_AT_TI_symbol_name("_INTSELxNy")
    3962                      .dwattr $C$DW$583, DW_AT_data_member_location[DW_OP_plus_uconst 0x6608]
    3963                      .dwattr $C$DW$583, DW_AT_accessibility(DW_ACCESS_public)
    3964              $C$DW$584       .dwtag  DW_TAG_member
    3965                      .dwattr $C$DW$584, DW_AT_type(*$C$DW$T$30)
    3966                      .dwattr $C$DW$584, DW_AT_name("rsvd_3")
    3967                      .dwattr $C$DW$584, DW_AT_TI_symbol_name("_rsvd_3")
    3968                      .dwattr $C$DW$584, DW_AT_data_member_location[DW_OP_plus_uconst 0x660d]
    3969                      .dwattr $C$DW$584, DW_AT_accessibility(DW_ACCESS_public)
    3970              $C$DW$585       .dwtag  DW_TAG_member
    3971                      .dwattr $C$DW$585, DW_AT_type(*$C$DW$T$25)
    3972                      .dwattr $C$DW$585, DW_AT_name("SOCPRICTRL")
    3973                      .dwattr $C$DW$585, DW_AT_TI_symbol_name("_SOCPRICTRL")
    3974                      .dwattr $C$DW$585, DW_AT_data_member_location[DW_OP_plus_uconst 0x6610]
    3975                      .dwattr $C$DW$585, DW_AT_accessibility(DW_ACCESS_public)
    3976              $C$DW$586       .dwtag  DW_TAG_member
    3977                      .dwattr $C$DW$586, DW_AT_type(*$C$DW$T$25)
TMS320C2000 Assembler PC v6.2.5 Sat Sep 16 15:41:34 2017

Tools Copyright (c) 1996-2014 Texas Instruments Incorporated
C:\Users\wmj\AppData\Local\Temp\1144410                              PAGE   79

    3978                      .dwattr $C$DW$586, DW_AT_name("rsvd_4")
    3979                      .dwattr $C$DW$586, DW_AT_TI_symbol_name("_rsvd_4")
    3980                      .dwattr $C$DW$586, DW_AT_data_member_location[DW_OP_plus_uconst 0x6611]
    3981                      .dwattr $C$DW$586, DW_AT_accessibility(DW_ACCESS_public)
    3982              $C$DW$587       .dwtag  DW_TAG_member
    3983                      .dwattr $C$DW$587, DW_AT_type(*$C$DW$T$25)
    3984                      .dwattr $C$DW$587, DW_AT_name("ADCSAMPLEMODE")
    3985                      .dwattr $C$DW$587, DW_AT_TI_symbol_name("_ADCSAMPLEMODE")
    3986                      .dwattr $C$DW$587, DW_AT_data_member_location[DW_OP_plus_uconst 0x6612]
    3987                      .dwattr $C$DW$587, DW_AT_accessibility(DW_ACCESS_public)
    3988              $C$DW$588       .dwtag  DW_TAG_member
    3989                      .dwattr $C$DW$588, DW_AT_type(*$C$DW$T$25)
    3990                      .dwattr $C$DW$588, DW_AT_name("rsvd_5")
    3991                      .dwattr $C$DW$588, DW_AT_TI_symbol_name("_rsvd_5")
    3992                      .dwattr $C$DW$588, DW_AT_data_member_location[DW_OP_plus_uconst 0x6613]
    3993                      .dwattr $C$DW$588, DW_AT_accessibility(DW_ACCESS_public)
    3994              $C$DW$589       .dwtag  DW_TAG_member
    3995                      .dwattr $C$DW$589, DW_AT_type(*$C$DW$T$25)
    3996                      .dwattr $C$DW$589, DW_AT_name("ADCINTSOCSEL1")
    3997                      .dwattr $C$DW$589, DW_AT_TI_symbol_name("_ADCINTSOCSEL1")
    3998                      .dwattr $C$DW$589, DW_AT_data_member_location[DW_OP_plus_uconst 0x6614]
    3999                      .dwattr $C$DW$589, DW_AT_accessibility(DW_ACCESS_public)
    4000              $C$DW$590       .dwtag  DW_TAG_member
    4001                      .dwattr $C$DW$590, DW_AT_type(*$C$DW$T$25)
    4002                      .dwattr $C$DW$590, DW_AT_name("ADCINTSOCSEL2")
    4003                      .dwattr $C$DW$590, DW_AT_TI_symbol_name("_ADCINTSOCSEL2")
    4004                      .dwattr $C$DW$590, DW_AT_data_member_location[DW_OP_plus_uconst 0x6615]
    4005                      .dwattr $C$DW$590, DW_AT_accessibility(DW_ACCESS_public)
    4006              $C$DW$591       .dwtag  DW_TAG_member
    4007                      .dwattr $C$DW$591, DW_AT_type(*$C$DW$T$28)
    4008                      .dwattr $C$DW$591, DW_AT_name("rsvd_6")
    4009                      .dwattr $C$DW$591, DW_AT_TI_symbol_name("_rsvd_6")
    4010                      .dwattr $C$DW$591, DW_AT_data_member_location[DW_OP_plus_uconst 0x6616]
    4011                      .dwattr $C$DW$591, DW_AT_accessibility(DW_ACCESS_public)
    4012              $C$DW$592       .dwtag  DW_TAG_member
    4013                      .dwattr $C$DW$592, DW_AT_type(*$C$DW$T$25)
    4014                      .dwattr $C$DW$592, DW_AT_name("ADCSOCFLG1")
    4015                      .dwattr $C$DW$592, DW_AT_TI_symbol_name("_ADCSOCFLG1")
    4016                      .dwattr $C$DW$592, DW_AT_data_member_location[DW_OP_plus_uconst 0x6618]
    4017                      .dwattr $C$DW$592, DW_AT_accessibility(DW_ACCESS_public)
    4018              $C$DW$593       .dwtag  DW_TAG_member
    4019                      .dwattr $C$DW$593, DW_AT_type(*$C$DW$T$25)
    4020                      .dwattr $C$DW$593, DW_AT_name("rsvd_7")
    4021                      .dwattr $C$DW$593, DW_AT_TI_symbol_name("_rsvd_7")
    4022                      .dwattr $C$DW$593, DW_AT_data_member_location[DW_OP_plus_uconst 0x6619]
    4023                      .dwattr $C$DW$593, DW_AT_accessibility(DW_ACCESS_public)
    4024              $C$DW$594       .dwtag  DW_TAG_member
    4025                      .dwattr $C$DW$594, DW_AT_type(*$C$DW$T$25)
    4026                      .dwattr $C$DW$594, DW_AT_name("ADCSOCFRC1")
    4027                      .dwattr $C$DW$594, DW_AT_TI_symbol_name("_ADCSOCFRC1")
    4028                      .dwattr $C$DW$594, DW_AT_data_member_location[DW_OP_plus_uconst 0x661a]
    4029                      .dwattr $C$DW$594, DW_AT_accessibility(DW_ACCESS_public)
    4030              $C$DW$595       .dwtag  DW_TAG_member
    4031                      .dwattr $C$DW$595, DW_AT_type(*$C$DW$T$25)
    4032                      .dwattr $C$DW$595, DW_AT_name("rsvd_8")
TMS320C2000 Assembler PC v6.2.5 Sat Sep 16 15:41:34 2017

Tools Copyright (c) 1996-2014 Texas Instruments Incorporated
C:\Users\wmj\AppData\Local\Temp\1144410                              PAGE   80

    4033                      .dwattr $C$DW$595, DW_AT_TI_symbol_name("_rsvd_8")
    4034                      .dwattr $C$DW$595, DW_AT_data_member_location[DW_OP_plus_uconst 0x661b]
    4035                      .dwattr $C$DW$595, DW_AT_accessibility(DW_ACCESS_public)
    4036              $C$DW$596       .dwtag  DW_TAG_member
    4037                      .dwattr $C$DW$596, DW_AT_type(*$C$DW$T$25)
    4038                      .dwattr $C$DW$596, DW_AT_name("ADCSOCOVF1")
    4039                      .dwattr $C$DW$596, DW_AT_TI_symbol_name("_ADCSOCOVF1")
    4040                      .dwattr $C$DW$596, DW_AT_data_member_location[DW_OP_plus_uconst 0x661c]
    4041                      .dwattr $C$DW$596, DW_AT_accessibility(DW_ACCESS_public)
    4042              $C$DW$597       .dwtag  DW_TAG_member
    4043                      .dwattr $C$DW$597, DW_AT_type(*$C$DW$T$25)
    4044                      .dwattr $C$DW$597, DW_AT_name("rsvd_9")
    4045                      .dwattr $C$DW$597, DW_AT_TI_symbol_name("_rsvd_9")
    4046                      .dwattr $C$DW$597, DW_AT_data_member_location[DW_OP_plus_uconst 0x661d]
    4047                      .dwattr $C$DW$597, DW_AT_accessibility(DW_ACCESS_public)
    4048              $C$DW$598       .dwtag  DW_TAG_member
    4049                      .dwattr $C$DW$598, DW_AT_type(*$C$DW$T$25)
    4050                      .dwattr $C$DW$598, DW_AT_name("ADCSOCOVFCLR1")
    4051                      .dwattr $C$DW$598, DW_AT_TI_symbol_name("_ADCSOCOVFCLR1")
    4052                      .dwattr $C$DW$598, DW_AT_data_member_location[DW_OP_plus_uconst 0x661e]
    4053                      .dwattr $C$DW$598, DW_AT_accessibility(DW_ACCESS_public)
    4054              $C$DW$599       .dwtag  DW_TAG_member
    4055                      .dwattr $C$DW$599, DW_AT_type(*$C$DW$T$25)
    4056                      .dwattr $C$DW$599, DW_AT_name("rsvd_10")
    4057                      .dwattr $C$DW$599, DW_AT_TI_symbol_name("_rsvd_10")
    4058                      .dwattr $C$DW$599, DW_AT_data_member_location[DW_OP_plus_uconst 0x661f]
    4059                      .dwattr $C$DW$599, DW_AT_accessibility(DW_ACCESS_public)
    4060              $C$DW$600       .dwtag  DW_TAG_member
    4061                      .dwattr $C$DW$600, DW_AT_type(*$C$DW$T$26)
    4062                      .dwattr $C$DW$600, DW_AT_name("ADCSOCxCTL")
    4063                      .dwattr $C$DW$600, DW_AT_TI_symbol_name("_ADCSOCxCTL")
    4064                      .dwattr $C$DW$600, DW_AT_data_member_location[DW_OP_plus_uconst 0x6620]
    4065                      .dwattr $C$DW$600, DW_AT_accessibility(DW_ACCESS_public)
    4066              $C$DW$601       .dwtag  DW_TAG_member
    4067                      .dwattr $C$DW$601, DW_AT_type(*$C$DW$T$26)
    4068                      .dwattr $C$DW$601, DW_AT_name("rsvd_11")
    4069                      .dwattr $C$DW$601, DW_AT_TI_symbol_name("_rsvd_11")
    4070                      .dwattr $C$DW$601, DW_AT_data_member_location[DW_OP_plus_uconst 0x6630]
    4071                      .dwattr $C$DW$601, DW_AT_accessibility(DW_ACCESS_public)
    4072              $C$DW$602       .dwtag  DW_TAG_member
    4073                      .dwattr $C$DW$602, DW_AT_type(*$C$DW$T$25)
    4074                      .dwattr $C$DW$602, DW_AT_name("ADCREFTRIM")
    4075                      .dwattr $C$DW$602, DW_AT_TI_symbol_name("_ADCREFTRIM")
    4076                      .dwattr $C$DW$602, DW_AT_data_member_location[DW_OP_plus_uconst 0x6640]
    4077                      .dwattr $C$DW$602, DW_AT_accessibility(DW_ACCESS_public)
    4078              $C$DW$603       .dwtag  DW_TAG_member
    4079                      .dwattr $C$DW$603, DW_AT_type(*$C$DW$T$25)
    4080                      .dwattr $C$DW$603, DW_AT_name("ADCOFFTRIM")
    4081                      .dwattr $C$DW$603, DW_AT_TI_symbol_name("_ADCOFFTRIM")
    4082                      .dwattr $C$DW$603, DW_AT_data_member_location[DW_OP_plus_uconst 0x6641]
    4083                      .dwattr $C$DW$603, DW_AT_accessibility(DW_ACCESS_public)
    4084              $C$DW$604       .dwtag  DW_TAG_member
    4085                      .dwattr $C$DW$604, DW_AT_type(*$C$DW$T$31)
    4086                      .dwattr $C$DW$604, DW_AT_name("resvd_12")
    4087                      .dwattr $C$DW$604, DW_AT_TI_symbol_name("_resvd_12")
TMS320C2000 Assembler PC v6.2.5 Sat Sep 16 15:41:34 2017

Tools Copyright (c) 1996-2014 Texas Instruments Incorporated
C:\Users\wmj\AppData\Local\Temp\1144410                              PAGE   81

    4088                      .dwattr $C$DW$604, DW_AT_data_member_location[DW_OP_plus_uconst 0x6642]
    4089                      .dwattr $C$DW$604, DW_AT_accessibility(DW_ACCESS_public)
    4090              $C$DW$605       .dwtag  DW_TAG_member
    4091                      .dwattr $C$DW$605, DW_AT_type(*$C$DW$T$25)
    4092                      .dwattr $C$DW$605, DW_AT_name("ADCREV")
    4093                      .dwattr $C$DW$605, DW_AT_TI_symbol_name("_ADCREV")
    4094                      .dwattr $C$DW$605, DW_AT_data_member_location[DW_OP_plus_uconst 0x664f]
    4095                      .dwattr $C$DW$605, DW_AT_accessibility(DW_ACCESS_public)
    4096                      .dwendtag $C$DW$T$32
    4097              
    4098              $C$DW$T$267     .dwtag  DW_TAG_typedef, DW_AT_name("ADC_Obj")
    4099                      .dwattr $C$DW$T$267, DW_AT_type(*$C$DW$T$32)
    4100                      .dwattr $C$DW$T$267, DW_AT_language(DW_LANG_C)
    4101              $C$DW$T$93      .dwtag  DW_TAG_pointer_type
    4102                      .dwattr $C$DW$T$93, DW_AT_type(*$C$DW$T$32)
    4103                      .dwattr $C$DW$T$93, DW_AT_address_class(0x16)
    4104              $C$DW$T$94      .dwtag  DW_TAG_typedef, DW_AT_name("ADC_Handle")
    4105                      .dwattr $C$DW$T$94, DW_AT_type(*$C$DW$T$93)
    4106                      .dwattr $C$DW$T$94, DW_AT_language(DW_LANG_C)
    4107              
    4108              $C$DW$T$35      .dwtag  DW_TAG_structure_type
    4109                      .dwattr $C$DW$T$35, DW_AT_name("_CLARKE_Obj_")
    4110                      .dwattr $C$DW$T$35, DW_AT_byte_size(0x06)
    4111              $C$DW$606       .dwtag  DW_TAG_member
    4112                      .dwattr $C$DW$606, DW_AT_type(*$C$DW$T$33)
    4113                      .dwattr $C$DW$606, DW_AT_name("alpha_sf")
    4114                      .dwattr $C$DW$606, DW_AT_TI_symbol_name("_alpha_sf")
    4115                      .dwattr $C$DW$606, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    4116                      .dwattr $C$DW$606, DW_AT_accessibility(DW_ACCESS_public)
    4117              $C$DW$607       .dwtag  DW_TAG_member
    4118                      .dwattr $C$DW$607, DW_AT_type(*$C$DW$T$33)
    4119                      .dwattr $C$DW$607, DW_AT_name("beta_sf")
    4120                      .dwattr $C$DW$607, DW_AT_TI_symbol_name("_beta_sf")
    4121                      .dwattr $C$DW$607, DW_AT_data_member_location[DW_OP_plus_uconst 0x2]
    4122                      .dwattr $C$DW$607, DW_AT_accessibility(DW_ACCESS_public)
    4123              $C$DW$608       .dwtag  DW_TAG_member
    4124                      .dwattr $C$DW$608, DW_AT_type(*$C$DW$T$34)
    4125                      .dwattr $C$DW$608, DW_AT_name("numSensors")
    4126                      .dwattr $C$DW$608, DW_AT_TI_symbol_name("_numSensors")
    4127                      .dwattr $C$DW$608, DW_AT_data_member_location[DW_OP_plus_uconst 0x4]
    4128                      .dwattr $C$DW$608, DW_AT_accessibility(DW_ACCESS_public)
    4129                      .dwendtag $C$DW$T$35
    4130              
    4131              $C$DW$T$47      .dwtag  DW_TAG_typedef, DW_AT_name("CLARKE_Obj")
    4132                      .dwattr $C$DW$T$47, DW_AT_type(*$C$DW$T$35)
    4133                      .dwattr $C$DW$T$47, DW_AT_language(DW_LANG_C)
    4134              $C$DW$T$45      .dwtag  DW_TAG_pointer_type
    4135                      .dwattr $C$DW$T$45, DW_AT_type(*$C$DW$T$35)
    4136                      .dwattr $C$DW$T$45, DW_AT_address_class(0x16)
    4137              $C$DW$T$46      .dwtag  DW_TAG_typedef, DW_AT_name("CLARKE_Handle")
    4138                      .dwattr $C$DW$T$46, DW_AT_type(*$C$DW$T$45)
    4139                      .dwattr $C$DW$T$46, DW_AT_language(DW_LANG_C)
    4140              
    4141              $C$DW$T$36      .dwtag  DW_TAG_structure_type
    4142                      .dwattr $C$DW$T$36, DW_AT_name("_CLK_DIV_t_")
TMS320C2000 Assembler PC v6.2.5 Sat Sep 16 15:41:34 2017

Tools Copyright (c) 1996-2014 Texas Instruments Incorporated
C:\Users\wmj\AppData\Local\Temp\1144410                              PAGE   82

    4143                      .dwattr $C$DW$T$36, DW_AT_byte_size(0x02)
    4144              $C$DW$609       .dwtag  DW_TAG_member
    4145                      .dwattr $C$DW$609, DW_AT_type(*$C$DW$T$24)
    4146                      .dwattr $C$DW$609, DW_AT_name("FREF_DIVIDER")
    4147                      .dwattr $C$DW$609, DW_AT_TI_symbol_name("_FREF_DIVIDER")
    4148                      .dwattr $C$DW$609, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    4149                      .dwattr $C$DW$609, DW_AT_accessibility(DW_ACCESS_public)
    4150              $C$DW$610       .dwtag  DW_TAG_member
    4151                      .dwattr $C$DW$610, DW_AT_type(*$C$DW$T$24)
    4152                      .dwattr $C$DW$610, DW_AT_name("FIN_DIVIDER")
    4153                      .dwattr $C$DW$610, DW_AT_TI_symbol_name("_FIN_DIVIDER")
    4154                      .dwattr $C$DW$610, DW_AT_data_member_location[DW_OP_plus_uconst 0x1]
    4155                      .dwattr $C$DW$610, DW_AT_accessibility(DW_ACCESS_public)
    4156                      .dwendtag $C$DW$T$36
    4157              
    4158              $C$DW$T$133     .dwtag  DW_TAG_typedef, DW_AT_name("CLK_DIV_t_")
    4159                      .dwattr $C$DW$T$133, DW_AT_type(*$C$DW$T$36)
    4160                      .dwattr $C$DW$T$133, DW_AT_language(DW_LANG_C)
    4161              
    4162              $C$DW$T$38      .dwtag  DW_TAG_structure_type
    4163                      .dwattr $C$DW$T$38, DW_AT_name("_CLK_Obj_")
    4164                      .dwattr $C$DW$T$38, DW_AT_byte_size(0x11)
    4165              $C$DW$611       .dwtag  DW_TAG_member
    4166                      .dwattr $C$DW$611, DW_AT_type(*$C$DW$T$25)
    4167                      .dwattr $C$DW$611, DW_AT_name("XCLK")
    4168                      .dwattr $C$DW$611, DW_AT_TI_symbol_name("_XCLK")
    4169                      .dwattr $C$DW$611, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    4170                      .dwattr $C$DW$611, DW_AT_accessibility(DW_ACCESS_public)
    4171              $C$DW$612       .dwtag  DW_TAG_member
    4172                      .dwattr $C$DW$612, DW_AT_type(*$C$DW$T$25)
    4173                      .dwattr $C$DW$612, DW_AT_name("rsvd_1")
    4174                      .dwattr $C$DW$612, DW_AT_TI_symbol_name("_rsvd_1")
    4175                      .dwattr $C$DW$612, DW_AT_data_member_location[DW_OP_plus_uconst 0x1]
    4176                      .dwattr $C$DW$612, DW_AT_accessibility(DW_ACCESS_public)
    4177              $C$DW$613       .dwtag  DW_TAG_member
    4178                      .dwattr $C$DW$613, DW_AT_type(*$C$DW$T$25)
    4179                      .dwattr $C$DW$613, DW_AT_name("CLKCTL")
    4180                      .dwattr $C$DW$613, DW_AT_TI_symbol_name("_CLKCTL")
    4181                      .dwattr $C$DW$613, DW_AT_data_member_location[DW_OP_plus_uconst 0x2]
    4182                      .dwattr $C$DW$613, DW_AT_accessibility(DW_ACCESS_public)
    4183              $C$DW$614       .dwtag  DW_TAG_member
    4184                      .dwattr $C$DW$614, DW_AT_type(*$C$DW$T$37)
    4185                      .dwattr $C$DW$614, DW_AT_name("rsvd_2")
    4186                      .dwattr $C$DW$614, DW_AT_TI_symbol_name("_rsvd_2")
    4187                      .dwattr $C$DW$614, DW_AT_data_member_location[DW_OP_plus_uconst 0x3]
    4188                      .dwattr $C$DW$614, DW_AT_accessibility(DW_ACCESS_public)
    4189              $C$DW$615       .dwtag  DW_TAG_member
    4190                      .dwattr $C$DW$615, DW_AT_type(*$C$DW$T$25)
    4191                      .dwattr $C$DW$615, DW_AT_name("LOSPCP")
    4192                      .dwattr $C$DW$615, DW_AT_TI_symbol_name("_LOSPCP")
    4193                      .dwattr $C$DW$615, DW_AT_data_member_location[DW_OP_plus_uconst 0xb]
    4194                      .dwattr $C$DW$615, DW_AT_accessibility(DW_ACCESS_public)
    4195              $C$DW$616       .dwtag  DW_TAG_member
    4196                      .dwattr $C$DW$616, DW_AT_type(*$C$DW$T$25)
    4197                      .dwattr $C$DW$616, DW_AT_name("PCLKCR0")
TMS320C2000 Assembler PC v6.2.5 Sat Sep 16 15:41:34 2017

Tools Copyright (c) 1996-2014 Texas Instruments Incorporated
C:\Users\wmj\AppData\Local\Temp\1144410                              PAGE   83

    4198                      .dwattr $C$DW$616, DW_AT_TI_symbol_name("_PCLKCR0")
    4199                      .dwattr $C$DW$616, DW_AT_data_member_location[DW_OP_plus_uconst 0xc]
    4200                      .dwattr $C$DW$616, DW_AT_accessibility(DW_ACCESS_public)
    4201              $C$DW$617       .dwtag  DW_TAG_member
    4202                      .dwattr $C$DW$617, DW_AT_type(*$C$DW$T$25)
    4203                      .dwattr $C$DW$617, DW_AT_name("PCLKCR1")
    4204                      .dwattr $C$DW$617, DW_AT_TI_symbol_name("_PCLKCR1")
    4205                      .dwattr $C$DW$617, DW_AT_data_member_location[DW_OP_plus_uconst 0xd]
    4206                      .dwattr $C$DW$617, DW_AT_accessibility(DW_ACCESS_public)
    4207              $C$DW$618       .dwtag  DW_TAG_member
    4208                      .dwattr $C$DW$618, DW_AT_type(*$C$DW$T$28)
    4209                      .dwattr $C$DW$618, DW_AT_name("rsvd_3")
    4210                      .dwattr $C$DW$618, DW_AT_TI_symbol_name("_rsvd_3")
    4211                      .dwattr $C$DW$618, DW_AT_data_member_location[DW_OP_plus_uconst 0xe]
    4212                      .dwattr $C$DW$618, DW_AT_accessibility(DW_ACCESS_public)
    4213              $C$DW$619       .dwtag  DW_TAG_member
    4214                      .dwattr $C$DW$619, DW_AT_type(*$C$DW$T$25)
    4215                      .dwattr $C$DW$619, DW_AT_name("PCLKCR3")
    4216                      .dwattr $C$DW$619, DW_AT_TI_symbol_name("_PCLKCR3")
    4217                      .dwattr $C$DW$619, DW_AT_data_member_location[DW_OP_plus_uconst 0x10]
    4218                      .dwattr $C$DW$619, DW_AT_accessibility(DW_ACCESS_public)
    4219                      .dwendtag $C$DW$T$38
    4220              
    4221              $C$DW$T$95      .dwtag  DW_TAG_pointer_type
    4222                      .dwattr $C$DW$T$95, DW_AT_type(*$C$DW$T$38)
    4223                      .dwattr $C$DW$T$95, DW_AT_address_class(0x16)
    4224              $C$DW$T$96      .dwtag  DW_TAG_typedef, DW_AT_name("CLK_Handle")
    4225                      .dwattr $C$DW$T$96, DW_AT_type(*$C$DW$T$95)
    4226                      .dwattr $C$DW$T$96, DW_AT_language(DW_LANG_C)
    4227              
    4228              $C$DW$T$39      .dwtag  DW_TAG_structure_type
    4229                      .dwattr $C$DW$T$39, DW_AT_name("_CPU_Obj_")
    4230                      .dwattr $C$DW$T$39, DW_AT_byte_size(0x01)
    4231              $C$DW$620       .dwtag  DW_TAG_member
    4232                      .dwattr $C$DW$620, DW_AT_type(*$C$DW$T$34)
    4233                      .dwattr $C$DW$620, DW_AT_name("tmp")
    4234                      .dwattr $C$DW$620, DW_AT_TI_symbol_name("_tmp")
    4235                      .dwattr $C$DW$620, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    4236                      .dwattr $C$DW$620, DW_AT_accessibility(DW_ACCESS_public)
    4237                      .dwendtag $C$DW$T$39
    4238              
    4239              $C$DW$T$97      .dwtag  DW_TAG_pointer_type
    4240                      .dwattr $C$DW$T$97, DW_AT_type(*$C$DW$T$39)
    4241                      .dwattr $C$DW$T$97, DW_AT_address_class(0x16)
    4242              $C$DW$T$98      .dwtag  DW_TAG_typedef, DW_AT_name("CPU_Handle")
    4243                      .dwattr $C$DW$T$98, DW_AT_type(*$C$DW$T$97)
    4244                      .dwattr $C$DW$T$98, DW_AT_language(DW_LANG_C)
    4245              
    4246              $C$DW$T$73      .dwtag  DW_TAG_structure_type
    4247                      .dwattr $C$DW$T$73, DW_AT_name("_CTRL_Obj_")
    4248                      .dwattr $C$DW$T$73, DW_AT_byte_size(0x108)
    4249              $C$DW$621       .dwtag  DW_TAG_member
    4250                      .dwattr $C$DW$621, DW_AT_type(*$C$DW$T$40)
    4251                      .dwattr $C$DW$621, DW_AT_name("version")
    4252                      .dwattr $C$DW$621, DW_AT_TI_symbol_name("_version")
TMS320C2000 Assembler PC v6.2.5 Sat Sep 16 15:41:34 2017

Tools Copyright (c) 1996-2014 Texas Instruments Incorporated
C:\Users\wmj\AppData\Local\Temp\1144410                              PAGE   84

    4253                      .dwattr $C$DW$621, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    4254                      .dwattr $C$DW$621, DW_AT_accessibility(DW_ACCESS_public)
    4255              $C$DW$622       .dwtag  DW_TAG_member
    4256                      .dwattr $C$DW$622, DW_AT_type(*$C$DW$T$42)
    4257                      .dwattr $C$DW$622, DW_AT_name("state")
    4258                      .dwattr $C$DW$622, DW_AT_TI_symbol_name("_state")
    4259                      .dwattr $C$DW$622, DW_AT_data_member_location[DW_OP_plus_uconst 0x4]
    4260                      .dwattr $C$DW$622, DW_AT_accessibility(DW_ACCESS_public)
    4261              $C$DW$623       .dwtag  DW_TAG_member
    4262                      .dwattr $C$DW$623, DW_AT_type(*$C$DW$T$42)
    4263                      .dwattr $C$DW$623, DW_AT_name("prevState")
    4264                      .dwattr $C$DW$623, DW_AT_TI_symbol_name("_prevState")
    4265                      .dwattr $C$DW$623, DW_AT_data_member_location[DW_OP_plus_uconst 0x5]
    4266                      .dwattr $C$DW$623, DW_AT_accessibility(DW_ACCESS_public)
    4267              $C$DW$624       .dwtag  DW_TAG_member
    4268                      .dwattr $C$DW$624, DW_AT_type(*$C$DW$T$44)
    4269                      .dwattr $C$DW$624, DW_AT_name("errorCode")
    4270                      .dwattr $C$DW$624, DW_AT_TI_symbol_name("_errorCode")
    4271                      .dwattr $C$DW$624, DW_AT_data_member_location[DW_OP_plus_uconst 0x6]
    4272                      .dwattr $C$DW$624, DW_AT_accessibility(DW_ACCESS_public)
    4273              $C$DW$625       .dwtag  DW_TAG_member
    4274                      .dwattr $C$DW$625, DW_AT_type(*$C$DW$T$46)
    4275                      .dwattr $C$DW$625, DW_AT_name("clarkeHandle_I")
    4276                      .dwattr $C$DW$625, DW_AT_TI_symbol_name("_clarkeHandle_I")
    4277                      .dwattr $C$DW$625, DW_AT_data_member_location[DW_OP_plus_uconst 0x8]
    4278                      .dwattr $C$DW$625, DW_AT_accessibility(DW_ACCESS_public)
    4279              $C$DW$626       .dwtag  DW_TAG_member
    4280                      .dwattr $C$DW$626, DW_AT_type(*$C$DW$T$47)
    4281                      .dwattr $C$DW$626, DW_AT_name("clarke_I")
    4282                      .dwattr $C$DW$626, DW_AT_TI_symbol_name("_clarke_I")
    4283                      .dwattr $C$DW$626, DW_AT_data_member_location[DW_OP_plus_uconst 0xa]
    4284                      .dwattr $C$DW$626, DW_AT_accessibility(DW_ACCESS_public)
    4285              $C$DW$627       .dwtag  DW_TAG_member
    4286                      .dwattr $C$DW$627, DW_AT_type(*$C$DW$T$46)
    4287                      .dwattr $C$DW$627, DW_AT_name("clarkeHandle_V")
    4288                      .dwattr $C$DW$627, DW_AT_TI_symbol_name("_clarkeHandle_V")
    4289                      .dwattr $C$DW$627, DW_AT_data_member_location[DW_OP_plus_uconst 0x10]
    4290                      .dwattr $C$DW$627, DW_AT_accessibility(DW_ACCESS_public)
    4291              $C$DW$628       .dwtag  DW_TAG_member
    4292                      .dwattr $C$DW$628, DW_AT_type(*$C$DW$T$47)
    4293                      .dwattr $C$DW$628, DW_AT_name("clarke_V")
    4294                      .dwattr $C$DW$628, DW_AT_TI_symbol_name("_clarke_V")
    4295                      .dwattr $C$DW$628, DW_AT_data_member_location[DW_OP_plus_uconst 0x12]
    4296                      .dwattr $C$DW$628, DW_AT_accessibility(DW_ACCESS_public)
    4297              $C$DW$629       .dwtag  DW_TAG_member
    4298                      .dwattr $C$DW$629, DW_AT_type(*$C$DW$T$49)
    4299                      .dwattr $C$DW$629, DW_AT_name("estHandle")
    4300                      .dwattr $C$DW$629, DW_AT_TI_symbol_name("_estHandle")
    4301                      .dwattr $C$DW$629, DW_AT_data_member_location[DW_OP_plus_uconst 0x18]
    4302                      .dwattr $C$DW$629, DW_AT_accessibility(DW_ACCESS_public)
    4303              $C$DW$630       .dwtag  DW_TAG_member
    4304                      .dwattr $C$DW$630, DW_AT_type(*$C$DW$T$51)
    4305                      .dwattr $C$DW$630, DW_AT_name("parkHandle")
    4306                      .dwattr $C$DW$630, DW_AT_TI_symbol_name("_parkHandle")
    4307                      .dwattr $C$DW$630, DW_AT_data_member_location[DW_OP_plus_uconst 0x1a]
TMS320C2000 Assembler PC v6.2.5 Sat Sep 16 15:41:34 2017

Tools Copyright (c) 1996-2014 Texas Instruments Incorporated
C:\Users\wmj\AppData\Local\Temp\1144410                              PAGE   85

    4308                      .dwattr $C$DW$630, DW_AT_accessibility(DW_ACCESS_public)
    4309              $C$DW$631       .dwtag  DW_TAG_member
    4310                      .dwattr $C$DW$631, DW_AT_type(*$C$DW$T$52)
    4311                      .dwattr $C$DW$631, DW_AT_name("park")
    4312                      .dwattr $C$DW$631, DW_AT_TI_symbol_name("_park")
    4313                      .dwattr $C$DW$631, DW_AT_data_member_location[DW_OP_plus_uconst 0x1c]
    4314                      .dwattr $C$DW$631, DW_AT_accessibility(DW_ACCESS_public)
    4315              $C$DW$632       .dwtag  DW_TAG_member
    4316                      .dwattr $C$DW$632, DW_AT_type(*$C$DW$T$54)
    4317                      .dwattr $C$DW$632, DW_AT_name("pidHandle_Id")
    4318                      .dwattr $C$DW$632, DW_AT_TI_symbol_name("_pidHandle_Id")
    4319                      .dwattr $C$DW$632, DW_AT_data_member_location[DW_OP_plus_uconst 0x20]
    4320                      .dwattr $C$DW$632, DW_AT_accessibility(DW_ACCESS_public)
    4321              $C$DW$633       .dwtag  DW_TAG_member
    4322                      .dwattr $C$DW$633, DW_AT_type(*$C$DW$T$55)
    4323                      .dwattr $C$DW$633, DW_AT_name("pid_Id")
    4324                      .dwattr $C$DW$633, DW_AT_TI_symbol_name("_pid_Id")
    4325                      .dwattr $C$DW$633, DW_AT_data_member_location[DW_OP_plus_uconst 0x22]
    4326                      .dwattr $C$DW$633, DW_AT_accessibility(DW_ACCESS_public)
    4327              $C$DW$634       .dwtag  DW_TAG_member
    4328                      .dwattr $C$DW$634, DW_AT_type(*$C$DW$T$54)
    4329                      .dwattr $C$DW$634, DW_AT_name("pidHandle_Iq")
    4330                      .dwattr $C$DW$634, DW_AT_TI_symbol_name("_pidHandle_Iq")
    4331                      .dwattr $C$DW$634, DW_AT_data_member_location[DW_OP_plus_uconst 0x32]
    4332                      .dwattr $C$DW$634, DW_AT_accessibility(DW_ACCESS_public)
    4333              $C$DW$635       .dwtag  DW_TAG_member
    4334                      .dwattr $C$DW$635, DW_AT_type(*$C$DW$T$55)
    4335                      .dwattr $C$DW$635, DW_AT_name("pid_Iq")
    4336                      .dwattr $C$DW$635, DW_AT_TI_symbol_name("_pid_Iq")
    4337                      .dwattr $C$DW$635, DW_AT_data_member_location[DW_OP_plus_uconst 0x34]
    4338                      .dwattr $C$DW$635, DW_AT_accessibility(DW_ACCESS_public)
    4339              $C$DW$636       .dwtag  DW_TAG_member
    4340                      .dwattr $C$DW$636, DW_AT_type(*$C$DW$T$54)
    4341                      .dwattr $C$DW$636, DW_AT_name("pidHandle_spd")
    4342                      .dwattr $C$DW$636, DW_AT_TI_symbol_name("_pidHandle_spd")
    4343                      .dwattr $C$DW$636, DW_AT_data_member_location[DW_OP_plus_uconst 0x44]
    4344                      .dwattr $C$DW$636, DW_AT_accessibility(DW_ACCESS_public)
    4345              $C$DW$637       .dwtag  DW_TAG_member
    4346                      .dwattr $C$DW$637, DW_AT_type(*$C$DW$T$55)
    4347                      .dwattr $C$DW$637, DW_AT_name("pid_spd")
    4348                      .dwattr $C$DW$637, DW_AT_TI_symbol_name("_pid_spd")
    4349                      .dwattr $C$DW$637, DW_AT_data_member_location[DW_OP_plus_uconst 0x46]
    4350                      .dwattr $C$DW$637, DW_AT_accessibility(DW_ACCESS_public)
    4351              $C$DW$638       .dwtag  DW_TAG_member
    4352                      .dwattr $C$DW$638, DW_AT_type(*$C$DW$T$57)
    4353                      .dwattr $C$DW$638, DW_AT_name("iparkHandle")
    4354                      .dwattr $C$DW$638, DW_AT_TI_symbol_name("_iparkHandle")
    4355                      .dwattr $C$DW$638, DW_AT_data_member_location[DW_OP_plus_uconst 0x56]
    4356                      .dwattr $C$DW$638, DW_AT_accessibility(DW_ACCESS_public)
    4357              $C$DW$639       .dwtag  DW_TAG_member
    4358                      .dwattr $C$DW$639, DW_AT_type(*$C$DW$T$58)
    4359                      .dwattr $C$DW$639, DW_AT_name("ipark")
    4360                      .dwattr $C$DW$639, DW_AT_TI_symbol_name("_ipark")
    4361                      .dwattr $C$DW$639, DW_AT_data_member_location[DW_OP_plus_uconst 0x58]
    4362                      .dwattr $C$DW$639, DW_AT_accessibility(DW_ACCESS_public)
TMS320C2000 Assembler PC v6.2.5 Sat Sep 16 15:41:34 2017

Tools Copyright (c) 1996-2014 Texas Instruments Incorporated
C:\Users\wmj\AppData\Local\Temp\1144410                              PAGE   86

    4363              $C$DW$640       .dwtag  DW_TAG_member
    4364                      .dwattr $C$DW$640, DW_AT_type(*$C$DW$T$60)
    4365                      .dwattr $C$DW$640, DW_AT_name("svgenHandle")
    4366                      .dwattr $C$DW$640, DW_AT_TI_symbol_name("_svgenHandle")
    4367                      .dwattr $C$DW$640, DW_AT_data_member_location[DW_OP_plus_uconst 0x5c]
    4368                      .dwattr $C$DW$640, DW_AT_accessibility(DW_ACCESS_public)
    4369              $C$DW$641       .dwtag  DW_TAG_member
    4370                      .dwattr $C$DW$641, DW_AT_type(*$C$DW$T$61)
    4371                      .dwattr $C$DW$641, DW_AT_name("svgen")
    4372                      .dwattr $C$DW$641, DW_AT_TI_symbol_name("_svgen")
    4373                      .dwattr $C$DW$641, DW_AT_data_member_location[DW_OP_plus_uconst 0x5e]
    4374                      .dwattr $C$DW$641, DW_AT_accessibility(DW_ACCESS_public)
    4375              $C$DW$642       .dwtag  DW_TAG_member
    4376                      .dwattr $C$DW$642, DW_AT_type(*$C$DW$T$63)
    4377                      .dwattr $C$DW$642, DW_AT_name("trajHandle_Id")
    4378                      .dwattr $C$DW$642, DW_AT_TI_symbol_name("_trajHandle_Id")
    4379                      .dwattr $C$DW$642, DW_AT_data_member_location[DW_OP_plus_uconst 0x60]
    4380                      .dwattr $C$DW$642, DW_AT_accessibility(DW_ACCESS_public)
    4381              $C$DW$643       .dwtag  DW_TAG_member
    4382                      .dwattr $C$DW$643, DW_AT_type(*$C$DW$T$64)
    4383                      .dwattr $C$DW$643, DW_AT_name("traj_Id")
    4384                      .dwattr $C$DW$643, DW_AT_TI_symbol_name("_traj_Id")
    4385                      .dwattr $C$DW$643, DW_AT_data_member_location[DW_OP_plus_uconst 0x62]
    4386                      .dwattr $C$DW$643, DW_AT_accessibility(DW_ACCESS_public)
    4387              $C$DW$644       .dwtag  DW_TAG_member
    4388                      .dwattr $C$DW$644, DW_AT_type(*$C$DW$T$63)
    4389                      .dwattr $C$DW$644, DW_AT_name("trajHandle_spd")
    4390                      .dwattr $C$DW$644, DW_AT_TI_symbol_name("_trajHandle_spd")
    4391                      .dwattr $C$DW$644, DW_AT_data_member_location[DW_OP_plus_uconst 0x6c]
    4392                      .dwattr $C$DW$644, DW_AT_accessibility(DW_ACCESS_public)
    4393              $C$DW$645       .dwtag  DW_TAG_member
    4394                      .dwattr $C$DW$645, DW_AT_type(*$C$DW$T$64)
    4395                      .dwattr $C$DW$645, DW_AT_name("traj_spd")
    4396                      .dwattr $C$DW$645, DW_AT_TI_symbol_name("_traj_spd")
    4397                      .dwattr $C$DW$645, DW_AT_data_member_location[DW_OP_plus_uconst 0x6e]
    4398                      .dwattr $C$DW$645, DW_AT_accessibility(DW_ACCESS_public)
    4399              $C$DW$646       .dwtag  DW_TAG_member
    4400                      .dwattr $C$DW$646, DW_AT_type(*$C$DW$T$63)
    4401                      .dwattr $C$DW$646, DW_AT_name("trajHandle_spdMax")
    4402                      .dwattr $C$DW$646, DW_AT_TI_symbol_name("_trajHandle_spdMax")
    4403                      .dwattr $C$DW$646, DW_AT_data_member_location[DW_OP_plus_uconst 0x78]
    4404                      .dwattr $C$DW$646, DW_AT_accessibility(DW_ACCESS_public)
    4405              $C$DW$647       .dwtag  DW_TAG_member
    4406                      .dwattr $C$DW$647, DW_AT_type(*$C$DW$T$64)
    4407                      .dwattr $C$DW$647, DW_AT_name("traj_spdMax")
    4408                      .dwattr $C$DW$647, DW_AT_TI_symbol_name("_traj_spdMax")
    4409                      .dwattr $C$DW$647, DW_AT_data_member_location[DW_OP_plus_uconst 0x7a]
    4410                      .dwattr $C$DW$647, DW_AT_accessibility(DW_ACCESS_public)
    4411              $C$DW$648       .dwtag  DW_TAG_member
    4412                      .dwattr $C$DW$648, DW_AT_type(*$C$DW$T$65)
    4413                      .dwattr $C$DW$648, DW_AT_name("motorParams")
    4414                      .dwattr $C$DW$648, DW_AT_TI_symbol_name("_motorParams")
    4415                      .dwattr $C$DW$648, DW_AT_data_member_location[DW_OP_plus_uconst 0x84]
    4416                      .dwattr $C$DW$648, DW_AT_accessibility(DW_ACCESS_public)
    4417              $C$DW$649       .dwtag  DW_TAG_member
TMS320C2000 Assembler PC v6.2.5 Sat Sep 16 15:41:34 2017

Tools Copyright (c) 1996-2014 Texas Instruments Incorporated
C:\Users\wmj\AppData\Local\Temp\1144410                              PAGE   87

    4418                      .dwattr $C$DW$649, DW_AT_type(*$C$DW$T$68)
    4419                      .dwattr $C$DW$649, DW_AT_name("waitTimes")
    4420                      .dwattr $C$DW$649, DW_AT_TI_symbol_name("_waitTimes")
    4421                      .dwattr $C$DW$649, DW_AT_data_member_location[DW_OP_plus_uconst 0x92]
    4422                      .dwattr $C$DW$649, DW_AT_accessibility(DW_ACCESS_public)
    4423              $C$DW$650       .dwtag  DW_TAG_member
    4424                      .dwattr $C$DW$650, DW_AT_type(*$C$DW$T$67)
    4425                      .dwattr $C$DW$650, DW_AT_name("counter_state")
    4426                      .dwattr $C$DW$650, DW_AT_TI_symbol_name("_counter_state")
    4427                      .dwattr $C$DW$650, DW_AT_data_member_location[DW_OP_plus_uconst 0x9a]
    4428                      .dwattr $C$DW$650, DW_AT_accessibility(DW_ACCESS_public)
    4429              $C$DW$651       .dwtag  DW_TAG_member
    4430                      .dwattr $C$DW$651, DW_AT_type(*$C$DW$T$69)
    4431                      .dwattr $C$DW$651, DW_AT_name("numIsrTicksPerCtrlTick")
    4432                      .dwattr $C$DW$651, DW_AT_TI_symbol_name("_numIsrTicksPerCtrlTick")
    4433                      .dwattr $C$DW$651, DW_AT_data_member_location[DW_OP_plus_uconst 0x9c]
    4434                      .dwattr $C$DW$651, DW_AT_accessibility(DW_ACCESS_public)
    4435              $C$DW$652       .dwtag  DW_TAG_member
    4436                      .dwattr $C$DW$652, DW_AT_type(*$C$DW$T$69)
    4437                      .dwattr $C$DW$652, DW_AT_name("numCtrlTicksPerCurrentTick")
    4438                      .dwattr $C$DW$652, DW_AT_TI_symbol_name("_numCtrlTicksPerCurrentTick")
    4439                      .dwattr $C$DW$652, DW_AT_data_member_location[DW_OP_plus_uconst 0x9d]
    4440                      .dwattr $C$DW$652, DW_AT_accessibility(DW_ACCESS_public)
    4441              $C$DW$653       .dwtag  DW_TAG_member
    4442                      .dwattr $C$DW$653, DW_AT_type(*$C$DW$T$69)
    4443                      .dwattr $C$DW$653, DW_AT_name("numCtrlTicksPerSpeedTick")
    4444                      .dwattr $C$DW$653, DW_AT_TI_symbol_name("_numCtrlTicksPerSpeedTick")
    4445                      .dwattr $C$DW$653, DW_AT_data_member_location[DW_OP_plus_uconst 0x9e]
    4446                      .dwattr $C$DW$653, DW_AT_accessibility(DW_ACCESS_public)
    4447              $C$DW$654       .dwtag  DW_TAG_member
    4448                      .dwattr $C$DW$654, DW_AT_type(*$C$DW$T$69)
    4449                      .dwattr $C$DW$654, DW_AT_name("numCtrlTicksPerTrajTick")
    4450                      .dwattr $C$DW$654, DW_AT_TI_symbol_name("_numCtrlTicksPerTrajTick")
    4451                      .dwattr $C$DW$654, DW_AT_data_member_location[DW_OP_plus_uconst 0x9f]
    4452                      .dwattr $C$DW$654, DW_AT_accessibility(DW_ACCESS_public)
    4453              $C$DW$655       .dwtag  DW_TAG_member
    4454                      .dwattr $C$DW$655, DW_AT_type(*$C$DW$T$67)
    4455                      .dwattr $C$DW$655, DW_AT_name("ctrlFreq_Hz")
    4456                      .dwattr $C$DW$655, DW_AT_TI_symbol_name("_ctrlFreq_Hz")
    4457                      .dwattr $C$DW$655, DW_AT_data_member_location[DW_OP_plus_uconst 0xa0]
    4458                      .dwattr $C$DW$655, DW_AT_accessibility(DW_ACCESS_public)
    4459              $C$DW$656       .dwtag  DW_TAG_member
    4460                      .dwattr $C$DW$656, DW_AT_type(*$C$DW$T$67)
    4461                      .dwattr $C$DW$656, DW_AT_name("trajFreq_Hz")
    4462                      .dwattr $C$DW$656, DW_AT_TI_symbol_name("_trajFreq_Hz")
    4463                      .dwattr $C$DW$656, DW_AT_data_member_location[DW_OP_plus_uconst 0xa2]
    4464                      .dwattr $C$DW$656, DW_AT_accessibility(DW_ACCESS_public)
    4465              $C$DW$657       .dwtag  DW_TAG_member
    4466                      .dwattr $C$DW$657, DW_AT_type(*$C$DW$T$33)
    4467                      .dwattr $C$DW$657, DW_AT_name("trajPeriod_sec")
    4468                      .dwattr $C$DW$657, DW_AT_TI_symbol_name("_trajPeriod_sec")
    4469                      .dwattr $C$DW$657, DW_AT_data_member_location[DW_OP_plus_uconst 0xa4]
    4470                      .dwattr $C$DW$657, DW_AT_accessibility(DW_ACCESS_public)
    4471              $C$DW$658       .dwtag  DW_TAG_member
    4472                      .dwattr $C$DW$658, DW_AT_type(*$C$DW$T$70)
TMS320C2000 Assembler PC v6.2.5 Sat Sep 16 15:41:34 2017

Tools Copyright (c) 1996-2014 Texas Instruments Incorporated
C:\Users\wmj\AppData\Local\Temp\1144410                              PAGE   88

    4473                      .dwattr $C$DW$658, DW_AT_name("ctrlPeriod_sec")
    4474                      .dwattr $C$DW$658, DW_AT_TI_symbol_name("_ctrlPeriod_sec")
    4475                      .dwattr $C$DW$658, DW_AT_data_member_location[DW_OP_plus_uconst 0xa6]
    4476                      .dwattr $C$DW$658, DW_AT_accessibility(DW_ACCESS_public)
    4477              $C$DW$659       .dwtag  DW_TAG_member
    4478                      .dwattr $C$DW$659, DW_AT_type(*$C$DW$T$33)
    4479                      .dwattr $C$DW$659, DW_AT_name("maxVsMag_pu")
    4480                      .dwattr $C$DW$659, DW_AT_TI_symbol_name("_maxVsMag_pu")
    4481                      .dwattr $C$DW$659, DW_AT_data_member_location[DW_OP_plus_uconst 0xa8]
    4482                      .dwattr $C$DW$659, DW_AT_accessibility(DW_ACCESS_public)
    4483              $C$DW$660       .dwtag  DW_TAG_member
    4484                      .dwattr $C$DW$660, DW_AT_type(*$C$DW$T$71)
    4485                      .dwattr $C$DW$660, DW_AT_name("Iab_in")
    4486                      .dwattr $C$DW$660, DW_AT_TI_symbol_name("_Iab_in")
    4487                      .dwattr $C$DW$660, DW_AT_data_member_location[DW_OP_plus_uconst 0xaa]
    4488                      .dwattr $C$DW$660, DW_AT_accessibility(DW_ACCESS_public)
    4489              $C$DW$661       .dwtag  DW_TAG_member
    4490                      .dwattr $C$DW$661, DW_AT_type(*$C$DW$T$71)
    4491                      .dwattr $C$DW$661, DW_AT_name("Iab_filt")
    4492                      .dwattr $C$DW$661, DW_AT_TI_symbol_name("_Iab_filt")
    4493                      .dwattr $C$DW$661, DW_AT_data_member_location[DW_OP_plus_uconst 0xae]
    4494                      .dwattr $C$DW$661, DW_AT_accessibility(DW_ACCESS_public)
    4495              $C$DW$662       .dwtag  DW_TAG_member
    4496                      .dwattr $C$DW$662, DW_AT_type(*$C$DW$T$71)
    4497                      .dwattr $C$DW$662, DW_AT_name("Idq_in")
    4498                      .dwattr $C$DW$662, DW_AT_TI_symbol_name("_Idq_in")
    4499                      .dwattr $C$DW$662, DW_AT_data_member_location[DW_OP_plus_uconst 0xb2]
    4500                      .dwattr $C$DW$662, DW_AT_accessibility(DW_ACCESS_public)
    4501              $C$DW$663       .dwtag  DW_TAG_member
    4502                      .dwattr $C$DW$663, DW_AT_type(*$C$DW$T$71)
    4503                      .dwattr $C$DW$663, DW_AT_name("Vab_in")
    4504                      .dwattr $C$DW$663, DW_AT_TI_symbol_name("_Vab_in")
    4505                      .dwattr $C$DW$663, DW_AT_data_member_location[DW_OP_plus_uconst 0xb6]
    4506                      .dwattr $C$DW$663, DW_AT_accessibility(DW_ACCESS_public)
    4507              $C$DW$664       .dwtag  DW_TAG_member
    4508                      .dwattr $C$DW$664, DW_AT_type(*$C$DW$T$33)
    4509                      .dwattr $C$DW$664, DW_AT_name("spd_out")
    4510                      .dwattr $C$DW$664, DW_AT_TI_symbol_name("_spd_out")
    4511                      .dwattr $C$DW$664, DW_AT_data_member_location[DW_OP_plus_uconst 0xba]
    4512                      .dwattr $C$DW$664, DW_AT_accessibility(DW_ACCESS_public)
    4513              $C$DW$665       .dwtag  DW_TAG_member
    4514                      .dwattr $C$DW$665, DW_AT_type(*$C$DW$T$71)
    4515                      .dwattr $C$DW$665, DW_AT_name("Vab_out")
    4516                      .dwattr $C$DW$665, DW_AT_TI_symbol_name("_Vab_out")
    4517                      .dwattr $C$DW$665, DW_AT_data_member_location[DW_OP_plus_uconst 0xbc]
    4518                      .dwattr $C$DW$665, DW_AT_accessibility(DW_ACCESS_public)
    4519              $C$DW$666       .dwtag  DW_TAG_member
    4520                      .dwattr $C$DW$666, DW_AT_type(*$C$DW$T$71)
    4521                      .dwattr $C$DW$666, DW_AT_name("Vdq_out")
    4522                      .dwattr $C$DW$666, DW_AT_TI_symbol_name("_Vdq_out")
    4523                      .dwattr $C$DW$666, DW_AT_data_member_location[DW_OP_plus_uconst 0xc0]
    4524                      .dwattr $C$DW$666, DW_AT_accessibility(DW_ACCESS_public)
    4525              $C$DW$667       .dwtag  DW_TAG_member
    4526                      .dwattr $C$DW$667, DW_AT_type(*$C$DW$T$70)
    4527                      .dwattr $C$DW$667, DW_AT_name("Rhf")
TMS320C2000 Assembler PC v6.2.5 Sat Sep 16 15:41:34 2017

Tools Copyright (c) 1996-2014 Texas Instruments Incorporated
C:\Users\wmj\AppData\Local\Temp\1144410                              PAGE   89

    4528                      .dwattr $C$DW$667, DW_AT_TI_symbol_name("_Rhf")
    4529                      .dwattr $C$DW$667, DW_AT_data_member_location[DW_OP_plus_uconst 0xc4]
    4530                      .dwattr $C$DW$667, DW_AT_accessibility(DW_ACCESS_public)
    4531              $C$DW$668       .dwtag  DW_TAG_member
    4532                      .dwattr $C$DW$668, DW_AT_type(*$C$DW$T$70)
    4533                      .dwattr $C$DW$668, DW_AT_name("Lhf")
    4534                      .dwattr $C$DW$668, DW_AT_TI_symbol_name("_Lhf")
    4535                      .dwattr $C$DW$668, DW_AT_data_member_location[DW_OP_plus_uconst 0xc6]
    4536                      .dwattr $C$DW$668, DW_AT_accessibility(DW_ACCESS_public)
    4537              $C$DW$669       .dwtag  DW_TAG_member
    4538                      .dwattr $C$DW$669, DW_AT_type(*$C$DW$T$70)
    4539                      .dwattr $C$DW$669, DW_AT_name("RoverL")
    4540                      .dwattr $C$DW$669, DW_AT_TI_symbol_name("_RoverL")
    4541                      .dwattr $C$DW$669, DW_AT_data_member_location[DW_OP_plus_uconst 0xc8]
    4542                      .dwattr $C$DW$669, DW_AT_accessibility(DW_ACCESS_public)
    4543              $C$DW$670       .dwtag  DW_TAG_member
    4544                      .dwattr $C$DW$670, DW_AT_type(*$C$DW$T$33)
    4545                      .dwattr $C$DW$670, DW_AT_name("Kp_Id")
    4546                      .dwattr $C$DW$670, DW_AT_TI_symbol_name("_Kp_Id")
    4547                      .dwattr $C$DW$670, DW_AT_data_member_location[DW_OP_plus_uconst 0xca]
    4548                      .dwattr $C$DW$670, DW_AT_accessibility(DW_ACCESS_public)
    4549              $C$DW$671       .dwtag  DW_TAG_member
    4550                      .dwattr $C$DW$671, DW_AT_type(*$C$DW$T$33)
    4551                      .dwattr $C$DW$671, DW_AT_name("Kp_Iq")
    4552                      .dwattr $C$DW$671, DW_AT_TI_symbol_name("_Kp_Iq")
    4553                      .dwattr $C$DW$671, DW_AT_data_member_location[DW_OP_plus_uconst 0xcc]
    4554                      .dwattr $C$DW$671, DW_AT_accessibility(DW_ACCESS_public)
    4555              $C$DW$672       .dwtag  DW_TAG_member
    4556                      .dwattr $C$DW$672, DW_AT_type(*$C$DW$T$33)
    4557                      .dwattr $C$DW$672, DW_AT_name("Kp_spd")
    4558                      .dwattr $C$DW$672, DW_AT_TI_symbol_name("_Kp_spd")
    4559                      .dwattr $C$DW$672, DW_AT_data_member_location[DW_OP_plus_uconst 0xce]
    4560                      .dwattr $C$DW$672, DW_AT_accessibility(DW_ACCESS_public)
    4561              $C$DW$673       .dwtag  DW_TAG_member
    4562                      .dwattr $C$DW$673, DW_AT_type(*$C$DW$T$33)
    4563                      .dwattr $C$DW$673, DW_AT_name("Ki_Id")
    4564                      .dwattr $C$DW$673, DW_AT_TI_symbol_name("_Ki_Id")
    4565                      .dwattr $C$DW$673, DW_AT_data_member_location[DW_OP_plus_uconst 0xd0]
    4566                      .dwattr $C$DW$673, DW_AT_accessibility(DW_ACCESS_public)
    4567              $C$DW$674       .dwtag  DW_TAG_member
    4568                      .dwattr $C$DW$674, DW_AT_type(*$C$DW$T$33)
    4569                      .dwattr $C$DW$674, DW_AT_name("Ki_Iq")
    4570                      .dwattr $C$DW$674, DW_AT_TI_symbol_name("_Ki_Iq")
    4571                      .dwattr $C$DW$674, DW_AT_data_member_location[DW_OP_plus_uconst 0xd2]
    4572                      .dwattr $C$DW$674, DW_AT_accessibility(DW_ACCESS_public)
    4573              $C$DW$675       .dwtag  DW_TAG_member
    4574                      .dwattr $C$DW$675, DW_AT_type(*$C$DW$T$33)
    4575                      .dwattr $C$DW$675, DW_AT_name("Ki_spd")
    4576                      .dwattr $C$DW$675, DW_AT_TI_symbol_name("_Ki_spd")
    4577                      .dwattr $C$DW$675, DW_AT_data_member_location[DW_OP_plus_uconst 0xd4]
    4578                      .dwattr $C$DW$675, DW_AT_accessibility(DW_ACCESS_public)
    4579              $C$DW$676       .dwtag  DW_TAG_member
    4580                      .dwattr $C$DW$676, DW_AT_type(*$C$DW$T$33)
    4581                      .dwattr $C$DW$676, DW_AT_name("Kd_Id")
    4582                      .dwattr $C$DW$676, DW_AT_TI_symbol_name("_Kd_Id")
TMS320C2000 Assembler PC v6.2.5 Sat Sep 16 15:41:34 2017

Tools Copyright (c) 1996-2014 Texas Instruments Incorporated
C:\Users\wmj\AppData\Local\Temp\1144410                              PAGE   90

    4583                      .dwattr $C$DW$676, DW_AT_data_member_location[DW_OP_plus_uconst 0xd6]
    4584                      .dwattr $C$DW$676, DW_AT_accessibility(DW_ACCESS_public)
    4585              $C$DW$677       .dwtag  DW_TAG_member
    4586                      .dwattr $C$DW$677, DW_AT_type(*$C$DW$T$33)
    4587                      .dwattr $C$DW$677, DW_AT_name("Kd_Iq")
    4588                      .dwattr $C$DW$677, DW_AT_TI_symbol_name("_Kd_Iq")
    4589                      .dwattr $C$DW$677, DW_AT_data_member_location[DW_OP_plus_uconst 0xd8]
    4590                      .dwattr $C$DW$677, DW_AT_accessibility(DW_ACCESS_public)
    4591              $C$DW$678       .dwtag  DW_TAG_member
    4592                      .dwattr $C$DW$678, DW_AT_type(*$C$DW$T$33)
    4593                      .dwattr $C$DW$678, DW_AT_name("Kd_spd")
    4594                      .dwattr $C$DW$678, DW_AT_TI_symbol_name("_Kd_spd")
    4595                      .dwattr $C$DW$678, DW_AT_data_member_location[DW_OP_plus_uconst 0xda]
    4596                      .dwattr $C$DW$678, DW_AT_accessibility(DW_ACCESS_public)
    4597              $C$DW$679       .dwtag  DW_TAG_member
    4598                      .dwattr $C$DW$679, DW_AT_type(*$C$DW$T$33)
    4599                      .dwattr $C$DW$679, DW_AT_name("Ui_Id")
    4600                      .dwattr $C$DW$679, DW_AT_TI_symbol_name("_Ui_Id")
    4601                      .dwattr $C$DW$679, DW_AT_data_member_location[DW_OP_plus_uconst 0xdc]
    4602                      .dwattr $C$DW$679, DW_AT_accessibility(DW_ACCESS_public)
    4603              $C$DW$680       .dwtag  DW_TAG_member
    4604                      .dwattr $C$DW$680, DW_AT_type(*$C$DW$T$33)
    4605                      .dwattr $C$DW$680, DW_AT_name("Ui_Iq")
    4606                      .dwattr $C$DW$680, DW_AT_TI_symbol_name("_Ui_Iq")
    4607                      .dwattr $C$DW$680, DW_AT_data_member_location[DW_OP_plus_uconst 0xde]
    4608                      .dwattr $C$DW$680, DW_AT_accessibility(DW_ACCESS_public)
    4609              $C$DW$681       .dwtag  DW_TAG_member
    4610                      .dwattr $C$DW$681, DW_AT_type(*$C$DW$T$33)
    4611                      .dwattr $C$DW$681, DW_AT_name("Ui_spd")
    4612                      .dwattr $C$DW$681, DW_AT_TI_symbol_name("_Ui_spd")
    4613                      .dwattr $C$DW$681, DW_AT_data_member_location[DW_OP_plus_uconst 0xe0]
    4614                      .dwattr $C$DW$681, DW_AT_accessibility(DW_ACCESS_public)
    4615              $C$DW$682       .dwtag  DW_TAG_member
    4616                      .dwattr $C$DW$682, DW_AT_type(*$C$DW$T$71)
    4617                      .dwattr $C$DW$682, DW_AT_name("Idq_ref")
    4618                      .dwattr $C$DW$682, DW_AT_TI_symbol_name("_Idq_ref")
    4619                      .dwattr $C$DW$682, DW_AT_data_member_location[DW_OP_plus_uconst 0xe2]
    4620                      .dwattr $C$DW$682, DW_AT_accessibility(DW_ACCESS_public)
    4621              $C$DW$683       .dwtag  DW_TAG_member
    4622                      .dwattr $C$DW$683, DW_AT_type(*$C$DW$T$33)
    4623                      .dwattr $C$DW$683, DW_AT_name("IdRated")
    4624                      .dwattr $C$DW$683, DW_AT_TI_symbol_name("_IdRated")
    4625                      .dwattr $C$DW$683, DW_AT_data_member_location[DW_OP_plus_uconst 0xe6]
    4626                      .dwattr $C$DW$683, DW_AT_accessibility(DW_ACCESS_public)
    4627              $C$DW$684       .dwtag  DW_TAG_member
    4628                      .dwattr $C$DW$684, DW_AT_type(*$C$DW$T$33)
    4629                      .dwattr $C$DW$684, DW_AT_name("spd_ref")
    4630                      .dwattr $C$DW$684, DW_AT_TI_symbol_name("_spd_ref")
    4631                      .dwattr $C$DW$684, DW_AT_data_member_location[DW_OP_plus_uconst 0xe8]
    4632                      .dwattr $C$DW$684, DW_AT_accessibility(DW_ACCESS_public)
    4633              $C$DW$685       .dwtag  DW_TAG_member
    4634                      .dwattr $C$DW$685, DW_AT_type(*$C$DW$T$33)
    4635                      .dwattr $C$DW$685, DW_AT_name("spd_max")
    4636                      .dwattr $C$DW$685, DW_AT_TI_symbol_name("_spd_max")
    4637                      .dwattr $C$DW$685, DW_AT_data_member_location[DW_OP_plus_uconst 0xea]
TMS320C2000 Assembler PC v6.2.5 Sat Sep 16 15:41:34 2017

Tools Copyright (c) 1996-2014 Texas Instruments Incorporated
C:\Users\wmj\AppData\Local\Temp\1144410                              PAGE   91

    4638                      .dwattr $C$DW$685, DW_AT_accessibility(DW_ACCESS_public)
    4639              $C$DW$686       .dwtag  DW_TAG_member
    4640                      .dwattr $C$DW$686, DW_AT_type(*$C$DW$T$69)
    4641                      .dwattr $C$DW$686, DW_AT_name("counter_current")
    4642                      .dwattr $C$DW$686, DW_AT_TI_symbol_name("_counter_current")
    4643                      .dwattr $C$DW$686, DW_AT_data_member_location[DW_OP_plus_uconst 0xec]
    4644                      .dwattr $C$DW$686, DW_AT_accessibility(DW_ACCESS_public)
    4645              $C$DW$687       .dwtag  DW_TAG_member
    4646                      .dwattr $C$DW$687, DW_AT_type(*$C$DW$T$69)
    4647                      .dwattr $C$DW$687, DW_AT_name("counter_isr")
    4648                      .dwattr $C$DW$687, DW_AT_TI_symbol_name("_counter_isr")
    4649                      .dwattr $C$DW$687, DW_AT_data_member_location[DW_OP_plus_uconst 0xed]
    4650                      .dwattr $C$DW$687, DW_AT_accessibility(DW_ACCESS_public)
    4651              $C$DW$688       .dwtag  DW_TAG_member
    4652                      .dwattr $C$DW$688, DW_AT_type(*$C$DW$T$69)
    4653                      .dwattr $C$DW$688, DW_AT_name("counter_speed")
    4654                      .dwattr $C$DW$688, DW_AT_TI_symbol_name("_counter_speed")
    4655                      .dwattr $C$DW$688, DW_AT_data_member_location[DW_OP_plus_uconst 0xee]
    4656                      .dwattr $C$DW$688, DW_AT_accessibility(DW_ACCESS_public)
    4657              $C$DW$689       .dwtag  DW_TAG_member
    4658                      .dwattr $C$DW$689, DW_AT_type(*$C$DW$T$69)
    4659                      .dwattr $C$DW$689, DW_AT_name("counter_traj")
    4660                      .dwattr $C$DW$689, DW_AT_TI_symbol_name("_counter_traj")
    4661                      .dwattr $C$DW$689, DW_AT_data_member_location[DW_OP_plus_uconst 0xef]
    4662                      .dwattr $C$DW$689, DW_AT_accessibility(DW_ACCESS_public)
    4663              $C$DW$690       .dwtag  DW_TAG_member
    4664                      .dwattr $C$DW$690, DW_AT_type(*$C$DW$T$72)
    4665                      .dwattr $C$DW$690, DW_AT_name("flag_enableCtrl")
    4666                      .dwattr $C$DW$690, DW_AT_TI_symbol_name("_flag_enableCtrl")
    4667                      .dwattr $C$DW$690, DW_AT_data_member_location[DW_OP_plus_uconst 0xf0]
    4668                      .dwattr $C$DW$690, DW_AT_accessibility(DW_ACCESS_public)
    4669              $C$DW$691       .dwtag  DW_TAG_member
    4670                      .dwattr $C$DW$691, DW_AT_type(*$C$DW$T$72)
    4671                      .dwattr $C$DW$691, DW_AT_name("flag_enableDcBusComp")
    4672                      .dwattr $C$DW$691, DW_AT_TI_symbol_name("_flag_enableDcBusComp")
    4673                      .dwattr $C$DW$691, DW_AT_data_member_location[DW_OP_plus_uconst 0xf1]
    4674                      .dwattr $C$DW$691, DW_AT_accessibility(DW_ACCESS_public)
    4675              $C$DW$692       .dwtag  DW_TAG_member
    4676                      .dwattr $C$DW$692, DW_AT_type(*$C$DW$T$72)
    4677                      .dwattr $C$DW$692, DW_AT_name("flag_enablePowerWarp")
    4678                      .dwattr $C$DW$692, DW_AT_TI_symbol_name("_flag_enablePowerWarp")
    4679                      .dwattr $C$DW$692, DW_AT_data_member_location[DW_OP_plus_uconst 0xf2]
    4680                      .dwattr $C$DW$692, DW_AT_accessibility(DW_ACCESS_public)
    4681              $C$DW$693       .dwtag  DW_TAG_member
    4682                      .dwattr $C$DW$693, DW_AT_type(*$C$DW$T$72)
    4683                      .dwattr $C$DW$693, DW_AT_name("flag_enableOffset")
    4684                      .dwattr $C$DW$693, DW_AT_TI_symbol_name("_flag_enableOffset")
    4685                      .dwattr $C$DW$693, DW_AT_data_member_location[DW_OP_plus_uconst 0xf3]
    4686                      .dwattr $C$DW$693, DW_AT_accessibility(DW_ACCESS_public)
    4687              $C$DW$694       .dwtag  DW_TAG_member
    4688                      .dwattr $C$DW$694, DW_AT_type(*$C$DW$T$72)
    4689                      .dwattr $C$DW$694, DW_AT_name("flag_enableSpeedCtrl")
    4690                      .dwattr $C$DW$694, DW_AT_TI_symbol_name("_flag_enableSpeedCtrl")
    4691                      .dwattr $C$DW$694, DW_AT_data_member_location[DW_OP_plus_uconst 0xf4]
    4692                      .dwattr $C$DW$694, DW_AT_accessibility(DW_ACCESS_public)
TMS320C2000 Assembler PC v6.2.5 Sat Sep 16 15:41:34 2017

Tools Copyright (c) 1996-2014 Texas Instruments Incorporated
C:\Users\wmj\AppData\Local\Temp\1144410                              PAGE   92

    4693              $C$DW$695       .dwtag  DW_TAG_member
    4694                      .dwattr $C$DW$695, DW_AT_type(*$C$DW$T$72)
    4695                      .dwattr $C$DW$695, DW_AT_name("flag_enableUserMotorParams")
    4696                      .dwattr $C$DW$695, DW_AT_TI_symbol_name("_flag_enableUserMotorParams")
    4697                      .dwattr $C$DW$695, DW_AT_data_member_location[DW_OP_plus_uconst 0xf5]
    4698                      .dwattr $C$DW$695, DW_AT_accessibility(DW_ACCESS_public)
    4699              $C$DW$696       .dwtag  DW_TAG_member
    4700                      .dwattr $C$DW$696, DW_AT_type(*$C$DW$T$71)
    4701                      .dwattr $C$DW$696, DW_AT_name("Idq_offset_pu")
    4702                      .dwattr $C$DW$696, DW_AT_TI_symbol_name("_Idq_offset_pu")
    4703                      .dwattr $C$DW$696, DW_AT_data_member_location[DW_OP_plus_uconst 0xf6]
    4704                      .dwattr $C$DW$696, DW_AT_accessibility(DW_ACCESS_public)
    4705              $C$DW$697       .dwtag  DW_TAG_member
    4706                      .dwattr $C$DW$697, DW_AT_type(*$C$DW$T$71)
    4707                      .dwattr $C$DW$697, DW_AT_name("Vdq_offset_pu")
    4708                      .dwattr $C$DW$697, DW_AT_TI_symbol_name("_Vdq_offset_pu")
    4709                      .dwattr $C$DW$697, DW_AT_data_member_location[DW_OP_plus_uconst 0xfa]
    4710                      .dwattr $C$DW$697, DW_AT_accessibility(DW_ACCESS_public)
    4711              $C$DW$698       .dwtag  DW_TAG_member
    4712                      .dwattr $C$DW$698, DW_AT_type(*$C$DW$T$33)
    4713                      .dwattr $C$DW$698, DW_AT_name("angle_pu")
    4714                      .dwattr $C$DW$698, DW_AT_TI_symbol_name("_angle_pu")
    4715                      .dwattr $C$DW$698, DW_AT_data_member_location[DW_OP_plus_uconst 0xfe]
    4716                      .dwattr $C$DW$698, DW_AT_accessibility(DW_ACCESS_public)
    4717              $C$DW$699       .dwtag  DW_TAG_member
    4718                      .dwattr $C$DW$699, DW_AT_type(*$C$DW$T$33)
    4719                      .dwattr $C$DW$699, DW_AT_name("speed_ref_pu")
    4720                      .dwattr $C$DW$699, DW_AT_TI_symbol_name("_speed_ref_pu")
    4721                      .dwattr $C$DW$699, DW_AT_data_member_location[DW_OP_plus_uconst 0x100]
    4722                      .dwattr $C$DW$699, DW_AT_accessibility(DW_ACCESS_public)
    4723              $C$DW$700       .dwtag  DW_TAG_member
    4724                      .dwattr $C$DW$700, DW_AT_type(*$C$DW$T$33)
    4725                      .dwattr $C$DW$700, DW_AT_name("speed_fb_pu")
    4726                      .dwattr $C$DW$700, DW_AT_TI_symbol_name("_speed_fb_pu")
    4727                      .dwattr $C$DW$700, DW_AT_data_member_location[DW_OP_plus_uconst 0x102]
    4728                      .dwattr $C$DW$700, DW_AT_accessibility(DW_ACCESS_public)
    4729              $C$DW$701       .dwtag  DW_TAG_member
    4730                      .dwattr $C$DW$701, DW_AT_type(*$C$DW$T$33)
    4731                      .dwattr $C$DW$701, DW_AT_name("speed_outMax_pu")
    4732                      .dwattr $C$DW$701, DW_AT_TI_symbol_name("_speed_outMax_pu")
    4733                      .dwattr $C$DW$701, DW_AT_data_member_location[DW_OP_plus_uconst 0x104]
    4734                      .dwattr $C$DW$701, DW_AT_accessibility(DW_ACCESS_public)
    4735              $C$DW$702       .dwtag  DW_TAG_member
    4736                      .dwattr $C$DW$702, DW_AT_type(*$C$DW$T$72)
    4737                      .dwattr $C$DW$702, DW_AT_name("flag_enableCurrentCtrl")
    4738                      .dwattr $C$DW$702, DW_AT_TI_symbol_name("_flag_enableCurrentCtrl")
    4739                      .dwattr $C$DW$702, DW_AT_data_member_location[DW_OP_plus_uconst 0x106]
    4740                      .dwattr $C$DW$702, DW_AT_accessibility(DW_ACCESS_public)
    4741                      .dwendtag $C$DW$T$73
    4742              
    4743              $C$DW$T$268     .dwtag  DW_TAG_typedef, DW_AT_name("CTRL_Obj")
    4744                      .dwattr $C$DW$T$268, DW_AT_type(*$C$DW$T$73)
    4745                      .dwattr $C$DW$T$268, DW_AT_language(DW_LANG_C)
    4746              $C$DW$T$269     .dwtag  DW_TAG_pointer_type
    4747                      .dwattr $C$DW$T$269, DW_AT_type(*$C$DW$T$268)
TMS320C2000 Assembler PC v6.2.5 Sat Sep 16 15:41:34 2017

Tools Copyright (c) 1996-2014 Texas Instruments Incorporated
C:\Users\wmj\AppData\Local\Temp\1144410                              PAGE   93

    4748                      .dwattr $C$DW$T$269, DW_AT_address_class(0x16)
    4749              $C$DW$T$240     .dwtag  DW_TAG_pointer_type
    4750                      .dwattr $C$DW$T$240, DW_AT_type(*$C$DW$T$73)
    4751                      .dwattr $C$DW$T$240, DW_AT_address_class(0x16)
    4752              $C$DW$T$241     .dwtag  DW_TAG_typedef, DW_AT_name("CTRL_Handle")
    4753                      .dwattr $C$DW$T$241, DW_AT_type(*$C$DW$T$240)
    4754                      .dwattr $C$DW$T$241, DW_AT_language(DW_LANG_C)
    4755              $C$DW$703       .dwtag  DW_TAG_TI_far_type
    4756                      .dwattr $C$DW$703, DW_AT_type(*$C$DW$T$241)
    4757              $C$DW$T$270     .dwtag  DW_TAG_const_type
    4758                      .dwattr $C$DW$T$270, DW_AT_type(*$C$DW$703)
    4759              
    4760              $C$DW$T$76      .dwtag  DW_TAG_structure_type
    4761                      .dwattr $C$DW$T$76, DW_AT_name("_CTRL_Version_")
    4762                      .dwattr $C$DW$T$76, DW_AT_byte_size(0x04)
    4763              $C$DW$704       .dwtag  DW_TAG_member
    4764                      .dwattr $C$DW$704, DW_AT_type(*$C$DW$T$24)
    4765                      .dwattr $C$DW$704, DW_AT_name("rsvd")
    4766                      .dwattr $C$DW$704, DW_AT_TI_symbol_name("_rsvd")
    4767                      .dwattr $C$DW$704, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    4768                      .dwattr $C$DW$704, DW_AT_accessibility(DW_ACCESS_public)
    4769              $C$DW$705       .dwtag  DW_TAG_member
    4770                      .dwattr $C$DW$705, DW_AT_type(*$C$DW$T$75)
    4771                      .dwattr $C$DW$705, DW_AT_name("targetProc")
    4772                      .dwattr $C$DW$705, DW_AT_TI_symbol_name("_targetProc")
    4773                      .dwattr $C$DW$705, DW_AT_data_member_location[DW_OP_plus_uconst 0x1]
    4774                      .dwattr $C$DW$705, DW_AT_accessibility(DW_ACCESS_public)
    4775              $C$DW$706       .dwtag  DW_TAG_member
    4776                      .dwattr $C$DW$706, DW_AT_type(*$C$DW$T$24)
    4777                      .dwattr $C$DW$706, DW_AT_name("major")
    4778                      .dwattr $C$DW$706, DW_AT_TI_symbol_name("_major")
    4779                      .dwattr $C$DW$706, DW_AT_data_member_location[DW_OP_plus_uconst 0x2]
    4780                      .dwattr $C$DW$706, DW_AT_accessibility(DW_ACCESS_public)
    4781              $C$DW$707       .dwtag  DW_TAG_member
    4782                      .dwattr $C$DW$707, DW_AT_type(*$C$DW$T$24)
    4783                      .dwattr $C$DW$707, DW_AT_name("minor")
    4784                      .dwattr $C$DW$707, DW_AT_TI_symbol_name("_minor")
    4785                      .dwattr $C$DW$707, DW_AT_data_member_location[DW_OP_plus_uconst 0x3]
    4786                      .dwattr $C$DW$707, DW_AT_accessibility(DW_ACCESS_public)
    4787                      .dwendtag $C$DW$T$76
    4788              
    4789              $C$DW$T$40      .dwtag  DW_TAG_typedef, DW_AT_name("CTRL_Version")
    4790                      .dwattr $C$DW$T$40, DW_AT_type(*$C$DW$T$76)
    4791                      .dwattr $C$DW$T$40, DW_AT_language(DW_LANG_C)
    4792              $C$DW$T$278     .dwtag  DW_TAG_pointer_type
    4793                      .dwattr $C$DW$T$278, DW_AT_type(*$C$DW$T$40)
    4794                      .dwattr $C$DW$T$278, DW_AT_address_class(0x16)
    4795              
    4796              $C$DW$T$83      .dwtag  DW_TAG_structure_type
    4797                      .dwattr $C$DW$T$83, DW_AT_name("_DECODER_Obj_")
    4798                      .dwattr $C$DW$T$83, DW_AT_byte_size(0x06)
    4799              $C$DW$708       .dwtag  DW_TAG_member
    4800                      .dwattr $C$DW$708, DW_AT_type(*$C$DW$T$78)
    4801                      .dwattr $C$DW$708, DW_AT_name("spiHandle")
    4802                      .dwattr $C$DW$708, DW_AT_TI_symbol_name("_spiHandle")
TMS320C2000 Assembler PC v6.2.5 Sat Sep 16 15:41:34 2017

Tools Copyright (c) 1996-2014 Texas Instruments Incorporated
C:\Users\wmj\AppData\Local\Temp\1144410                              PAGE   94

    4803                      .dwattr $C$DW$708, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    4804                      .dwattr $C$DW$708, DW_AT_accessibility(DW_ACCESS_public)
    4805              $C$DW$709       .dwtag  DW_TAG_member
    4806                      .dwattr $C$DW$709, DW_AT_type(*$C$DW$T$80)
    4807                      .dwattr $C$DW$709, DW_AT_name("gpioHandle")
    4808                      .dwattr $C$DW$709, DW_AT_TI_symbol_name("_gpioHandle")
    4809                      .dwattr $C$DW$709, DW_AT_data_member_location[DW_OP_plus_uconst 0x2]
    4810                      .dwattr $C$DW$709, DW_AT_accessibility(DW_ACCESS_public)
    4811              $C$DW$710       .dwtag  DW_TAG_member
    4812                      .dwattr $C$DW$710, DW_AT_type(*$C$DW$T$82)
    4813                      .dwattr $C$DW$710, DW_AT_name("gpioNumber")
    4814                      .dwattr $C$DW$710, DW_AT_TI_symbol_name("_gpioNumber")
    4815                      .dwattr $C$DW$710, DW_AT_data_member_location[DW_OP_plus_uconst 0x4]
    4816                      .dwattr $C$DW$710, DW_AT_accessibility(DW_ACCESS_public)
    4817              $C$DW$711       .dwtag  DW_TAG_member
    4818                      .dwattr $C$DW$711, DW_AT_type(*$C$DW$T$72)
    4819                      .dwattr $C$DW$711, DW_AT_name("RxTimeOut")
    4820                      .dwattr $C$DW$711, DW_AT_TI_symbol_name("_RxTimeOut")
    4821                      .dwattr $C$DW$711, DW_AT_data_member_location[DW_OP_plus_uconst 0x5]
    4822                      .dwattr $C$DW$711, DW_AT_accessibility(DW_ACCESS_public)
    4823                      .dwendtag $C$DW$T$83
    4824              
    4825              $C$DW$T$220     .dwtag  DW_TAG_typedef, DW_AT_name("DECODER_Obj")
    4826                      .dwattr $C$DW$T$220, DW_AT_type(*$C$DW$T$83)
    4827                      .dwattr $C$DW$T$220, DW_AT_language(DW_LANG_C)
    4828              $C$DW$T$218     .dwtag  DW_TAG_pointer_type
    4829                      .dwattr $C$DW$T$218, DW_AT_type(*$C$DW$T$83)
    4830                      .dwattr $C$DW$T$218, DW_AT_address_class(0x16)
    4831              $C$DW$T$219     .dwtag  DW_TAG_typedef, DW_AT_name("DECODER_Handle")
    4832                      .dwattr $C$DW$T$219, DW_AT_type(*$C$DW$T$218)
    4833                      .dwattr $C$DW$T$219, DW_AT_language(DW_LANG_C)
    4834              
    4835              $C$DW$T$84      .dwtag  DW_TAG_structure_type
    4836                      .dwattr $C$DW$T$84, DW_AT_name("_DRIVE_CURRENT_t_")
    4837                      .dwattr $C$DW$T$84, DW_AT_byte_size(0x02)
    4838              $C$DW$712       .dwtag  DW_TAG_member
    4839                      .dwattr $C$DW$712, DW_AT_type(*$C$DW$T$24)
    4840                      .dwattr $C$DW$712, DW_AT_name("IDRIVE")
    4841                      .dwattr $C$DW$712, DW_AT_TI_symbol_name("_IDRIVE")
    4842                      .dwattr $C$DW$712, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    4843                      .dwattr $C$DW$712, DW_AT_accessibility(DW_ACCESS_public)
    4844              $C$DW$713       .dwtag  DW_TAG_member
    4845                      .dwattr $C$DW$713, DW_AT_type(*$C$DW$T$24)
    4846                      .dwattr $C$DW$713, DW_AT_name("INIT_IDRIVE")
    4847                      .dwattr $C$DW$713, DW_AT_TI_symbol_name("_INIT_IDRIVE")
    4848                      .dwattr $C$DW$713, DW_AT_data_member_location[DW_OP_plus_uconst 0x1]
    4849                      .dwattr $C$DW$713, DW_AT_accessibility(DW_ACCESS_public)
    4850                      .dwendtag $C$DW$T$84
    4851              
    4852              $C$DW$T$153     .dwtag  DW_TAG_typedef, DW_AT_name("DRIVE_CURRENT_t_")
    4853                      .dwattr $C$DW$T$153, DW_AT_type(*$C$DW$T$84)
    4854                      .dwattr $C$DW$T$153, DW_AT_language(DW_LANG_C)
    4855              
    4856              $C$DW$T$21      .dwtag  DW_TAG_structure_type
    4857                      .dwattr $C$DW$T$21, DW_AT_name("_EST_Obj_")
TMS320C2000 Assembler PC v6.2.5 Sat Sep 16 15:41:34 2017

Tools Copyright (c) 1996-2014 Texas Instruments Incorporated
C:\Users\wmj\AppData\Local\Temp\1144410                              PAGE   95

    4858                      .dwattr $C$DW$T$21, DW_AT_declaration
    4859                      .dwendtag $C$DW$T$21
    4860              
    4861              $C$DW$T$48      .dwtag  DW_TAG_pointer_type
    4862                      .dwattr $C$DW$T$48, DW_AT_type(*$C$DW$T$21)
    4863                      .dwattr $C$DW$T$48, DW_AT_address_class(0x16)
    4864              $C$DW$T$49      .dwtag  DW_TAG_typedef, DW_AT_name("EST_Handle")
    4865                      .dwattr $C$DW$T$49, DW_AT_type(*$C$DW$T$48)
    4866                      .dwattr $C$DW$T$49, DW_AT_language(DW_LANG_C)
    4867              
    4868              $C$DW$T$85      .dwtag  DW_TAG_structure_type
    4869                      .dwattr $C$DW$T$85, DW_AT_name("_FILTER_FO_")
    4870                      .dwattr $C$DW$T$85, DW_AT_byte_size(0x0a)
    4871              $C$DW$714       .dwtag  DW_TAG_member
    4872                      .dwattr $C$DW$714, DW_AT_type(*$C$DW$T$33)
    4873                      .dwattr $C$DW$714, DW_AT_name("a1")
    4874                      .dwattr $C$DW$714, DW_AT_TI_symbol_name("_a1")
    4875                      .dwattr $C$DW$714, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    4876                      .dwattr $C$DW$714, DW_AT_accessibility(DW_ACCESS_public)
    4877              $C$DW$715       .dwtag  DW_TAG_member
    4878                      .dwattr $C$DW$715, DW_AT_type(*$C$DW$T$33)
    4879                      .dwattr $C$DW$715, DW_AT_name("b0")
    4880                      .dwattr $C$DW$715, DW_AT_TI_symbol_name("_b0")
    4881                      .dwattr $C$DW$715, DW_AT_data_member_location[DW_OP_plus_uconst 0x2]
    4882                      .dwattr $C$DW$715, DW_AT_accessibility(DW_ACCESS_public)
    4883              $C$DW$716       .dwtag  DW_TAG_member
    4884                      .dwattr $C$DW$716, DW_AT_type(*$C$DW$T$33)
    4885                      .dwattr $C$DW$716, DW_AT_name("b1")
    4886                      .dwattr $C$DW$716, DW_AT_TI_symbol_name("_b1")
    4887                      .dwattr $C$DW$716, DW_AT_data_member_location[DW_OP_plus_uconst 0x4]
    4888                      .dwattr $C$DW$716, DW_AT_accessibility(DW_ACCESS_public)
    4889              $C$DW$717       .dwtag  DW_TAG_member
    4890                      .dwattr $C$DW$717, DW_AT_type(*$C$DW$T$33)
    4891                      .dwattr $C$DW$717, DW_AT_name("x1")
    4892                      .dwattr $C$DW$717, DW_AT_TI_symbol_name("_x1")
    4893                      .dwattr $C$DW$717, DW_AT_data_member_location[DW_OP_plus_uconst 0x6]
    4894                      .dwattr $C$DW$717, DW_AT_accessibility(DW_ACCESS_public)
    4895              $C$DW$718       .dwtag  DW_TAG_member
    4896                      .dwattr $C$DW$718, DW_AT_type(*$C$DW$T$33)
    4897                      .dwattr $C$DW$718, DW_AT_name("y1")
    4898                      .dwattr $C$DW$718, DW_AT_TI_symbol_name("_y1")
    4899                      .dwattr $C$DW$718, DW_AT_data_member_location[DW_OP_plus_uconst 0x8]
    4900                      .dwattr $C$DW$718, DW_AT_accessibility(DW_ACCESS_public)
    4901                      .dwendtag $C$DW$T$85
    4902              
    4903              $C$DW$T$179     .dwtag  DW_TAG_typedef, DW_AT_name("FILTER_FO_Obj")
    4904                      .dwattr $C$DW$T$179, DW_AT_type(*$C$DW$T$85)
    4905                      .dwattr $C$DW$T$179, DW_AT_language(DW_LANG_C)
    4906              
    4907              $C$DW$T$22      .dwtag  DW_TAG_structure_type
    4908                      .dwattr $C$DW$T$22, DW_AT_name("_FILTER_FO_Obj_")
    4909                      .dwattr $C$DW$T$22, DW_AT_declaration
    4910                      .dwendtag $C$DW$T$22
    4911              
    4912              $C$DW$T$180     .dwtag  DW_TAG_pointer_type
TMS320C2000 Assembler PC v6.2.5 Sat Sep 16 15:41:34 2017

Tools Copyright (c) 1996-2014 Texas Instruments Incorporated
C:\Users\wmj\AppData\Local\Temp\1144410                              PAGE   96

    4913                      .dwattr $C$DW$T$180, DW_AT_type(*$C$DW$T$22)
    4914                      .dwattr $C$DW$T$180, DW_AT_address_class(0x16)
    4915              $C$DW$T$181     .dwtag  DW_TAG_typedef, DW_AT_name("FILTER_FO_Handle")
    4916                      .dwattr $C$DW$T$181, DW_AT_type(*$C$DW$T$180)
    4917                      .dwattr $C$DW$T$181, DW_AT_language(DW_LANG_C)
    4918              
    4919              $C$DW$T$86      .dwtag  DW_TAG_structure_type
    4920                      .dwattr $C$DW$T$86, DW_AT_name("_FLASH_Obj_")
    4921                      .dwattr $C$DW$T$86, DW_AT_byte_size(0x08)
    4922              $C$DW$719       .dwtag  DW_TAG_member
    4923                      .dwattr $C$DW$719, DW_AT_type(*$C$DW$T$25)
    4924                      .dwattr $C$DW$719, DW_AT_name("FOPT")
    4925                      .dwattr $C$DW$719, DW_AT_TI_symbol_name("_FOPT")
    4926                      .dwattr $C$DW$719, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    4927                      .dwattr $C$DW$719, DW_AT_accessibility(DW_ACCESS_public)
    4928              $C$DW$720       .dwtag  DW_TAG_member
    4929                      .dwattr $C$DW$720, DW_AT_type(*$C$DW$T$25)
    4930                      .dwattr $C$DW$720, DW_AT_name("rsvd_1")
    4931                      .dwattr $C$DW$720, DW_AT_TI_symbol_name("_rsvd_1")
    4932                      .dwattr $C$DW$720, DW_AT_data_member_location[DW_OP_plus_uconst 0x1]
    4933                      .dwattr $C$DW$720, DW_AT_accessibility(DW_ACCESS_public)
    4934              $C$DW$721       .dwtag  DW_TAG_member
    4935                      .dwattr $C$DW$721, DW_AT_type(*$C$DW$T$25)
    4936                      .dwattr $C$DW$721, DW_AT_name("FPWR")
    4937                      .dwattr $C$DW$721, DW_AT_TI_symbol_name("_FPWR")
    4938                      .dwattr $C$DW$721, DW_AT_data_member_location[DW_OP_plus_uconst 0x2]
    4939                      .dwattr $C$DW$721, DW_AT_accessibility(DW_ACCESS_public)
    4940              $C$DW$722       .dwtag  DW_TAG_member
    4941                      .dwattr $C$DW$722, DW_AT_type(*$C$DW$T$25)
    4942                      .dwattr $C$DW$722, DW_AT_name("FSTATUS")
    4943                      .dwattr $C$DW$722, DW_AT_TI_symbol_name("_FSTATUS")
    4944                      .dwattr $C$DW$722, DW_AT_data_member_location[DW_OP_plus_uconst 0x3]
    4945                      .dwattr $C$DW$722, DW_AT_accessibility(DW_ACCESS_public)
    4946              $C$DW$723       .dwtag  DW_TAG_member
    4947                      .dwattr $C$DW$723, DW_AT_type(*$C$DW$T$25)
    4948                      .dwattr $C$DW$723, DW_AT_name("FSTDBYWAIT")
    4949                      .dwattr $C$DW$723, DW_AT_TI_symbol_name("_FSTDBYWAIT")
    4950                      .dwattr $C$DW$723, DW_AT_data_member_location[DW_OP_plus_uconst 0x4]
    4951                      .dwattr $C$DW$723, DW_AT_accessibility(DW_ACCESS_public)
    4952              $C$DW$724       .dwtag  DW_TAG_member
    4953                      .dwattr $C$DW$724, DW_AT_type(*$C$DW$T$25)
    4954                      .dwattr $C$DW$724, DW_AT_name("FACTIVEWAIT")
    4955                      .dwattr $C$DW$724, DW_AT_TI_symbol_name("_FACTIVEWAIT")
    4956                      .dwattr $C$DW$724, DW_AT_data_member_location[DW_OP_plus_uconst 0x5]
    4957                      .dwattr $C$DW$724, DW_AT_accessibility(DW_ACCESS_public)
    4958              $C$DW$725       .dwtag  DW_TAG_member
    4959                      .dwattr $C$DW$725, DW_AT_type(*$C$DW$T$25)
    4960                      .dwattr $C$DW$725, DW_AT_name("FBANKWAIT")
    4961                      .dwattr $C$DW$725, DW_AT_TI_symbol_name("_FBANKWAIT")
    4962                      .dwattr $C$DW$725, DW_AT_data_member_location[DW_OP_plus_uconst 0x6]
    4963                      .dwattr $C$DW$725, DW_AT_accessibility(DW_ACCESS_public)
    4964              $C$DW$726       .dwtag  DW_TAG_member
    4965                      .dwattr $C$DW$726, DW_AT_type(*$C$DW$T$25)
    4966                      .dwattr $C$DW$726, DW_AT_name("FOTPWAIT")
    4967                      .dwattr $C$DW$726, DW_AT_TI_symbol_name("_FOTPWAIT")
TMS320C2000 Assembler PC v6.2.5 Sat Sep 16 15:41:34 2017

Tools Copyright (c) 1996-2014 Texas Instruments Incorporated
C:\Users\wmj\AppData\Local\Temp\1144410                              PAGE   97

    4968                      .dwattr $C$DW$726, DW_AT_data_member_location[DW_OP_plus_uconst 0x7]
    4969                      .dwattr $C$DW$726, DW_AT_accessibility(DW_ACCESS_public)
    4970                      .dwendtag $C$DW$T$86
    4971              
    4972              $C$DW$T$99      .dwtag  DW_TAG_pointer_type
    4973                      .dwattr $C$DW$T$99, DW_AT_type(*$C$DW$T$86)
    4974                      .dwattr $C$DW$T$99, DW_AT_address_class(0x16)
    4975              $C$DW$T$100     .dwtag  DW_TAG_typedef, DW_AT_name("FLASH_Handle")
    4976                      .dwattr $C$DW$T$100, DW_AT_type(*$C$DW$T$99)
    4977                      .dwattr $C$DW$T$100, DW_AT_language(DW_LANG_C)
    4978              
    4979              $C$DW$T$90      .dwtag  DW_TAG_structure_type
    4980                      .dwattr $C$DW$T$90, DW_AT_name("_GPIO_Obj_")
    4981                      .dwattr $C$DW$T$90, DW_AT_byte_size(0x6a)
    4982              $C$DW$727       .dwtag  DW_TAG_member
    4983                      .dwattr $C$DW$727, DW_AT_type(*$C$DW$T$87)
    4984                      .dwattr $C$DW$727, DW_AT_name("GPACTRL")
    4985                      .dwattr $C$DW$727, DW_AT_TI_symbol_name("_GPACTRL")
    4986                      .dwattr $C$DW$727, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    4987                      .dwattr $C$DW$727, DW_AT_accessibility(DW_ACCESS_public)
    4988              $C$DW$728       .dwtag  DW_TAG_member
    4989                      .dwattr $C$DW$728, DW_AT_type(*$C$DW$T$87)
    4990                      .dwattr $C$DW$728, DW_AT_name("GPAQSEL1")
    4991                      .dwattr $C$DW$728, DW_AT_TI_symbol_name("_GPAQSEL1")
    4992                      .dwattr $C$DW$728, DW_AT_data_member_location[DW_OP_plus_uconst 0x2]
    4993                      .dwattr $C$DW$728, DW_AT_accessibility(DW_ACCESS_public)
    4994              $C$DW$729       .dwtag  DW_TAG_member
    4995                      .dwattr $C$DW$729, DW_AT_type(*$C$DW$T$87)
    4996                      .dwattr $C$DW$729, DW_AT_name("GPAQSEL2")
    4997                      .dwattr $C$DW$729, DW_AT_TI_symbol_name("_GPAQSEL2")
    4998                      .dwattr $C$DW$729, DW_AT_data_member_location[DW_OP_plus_uconst 0x4]
    4999                      .dwattr $C$DW$729, DW_AT_accessibility(DW_ACCESS_public)
    5000              $C$DW$730       .dwtag  DW_TAG_member
    5001                      .dwattr $C$DW$730, DW_AT_type(*$C$DW$T$87)
    5002                      .dwattr $C$DW$730, DW_AT_name("GPAMUX1")
    5003                      .dwattr $C$DW$730, DW_AT_TI_symbol_name("_GPAMUX1")
    5004                      .dwattr $C$DW$730, DW_AT_data_member_location[DW_OP_plus_uconst 0x6]
    5005                      .dwattr $C$DW$730, DW_AT_accessibility(DW_ACCESS_public)
    5006              $C$DW$731       .dwtag  DW_TAG_member
    5007                      .dwattr $C$DW$731, DW_AT_type(*$C$DW$T$87)
    5008                      .dwattr $C$DW$731, DW_AT_name("GPAMUX2")
    5009                      .dwattr $C$DW$731, DW_AT_TI_symbol_name("_GPAMUX2")
    5010                      .dwattr $C$DW$731, DW_AT_data_member_location[DW_OP_plus_uconst 0x8]
    5011                      .dwattr $C$DW$731, DW_AT_accessibility(DW_ACCESS_public)
    5012              $C$DW$732       .dwtag  DW_TAG_member
    5013                      .dwattr $C$DW$732, DW_AT_type(*$C$DW$T$87)
    5014                      .dwattr $C$DW$732, DW_AT_name("GPADIR")
    5015                      .dwattr $C$DW$732, DW_AT_TI_symbol_name("_GPADIR")
    5016                      .dwattr $C$DW$732, DW_AT_data_member_location[DW_OP_plus_uconst 0xa]
    5017                      .dwattr $C$DW$732, DW_AT_accessibility(DW_ACCESS_public)
    5018              $C$DW$733       .dwtag  DW_TAG_member
    5019                      .dwattr $C$DW$733, DW_AT_type(*$C$DW$T$87)
    5020                      .dwattr $C$DW$733, DW_AT_name("GPAPUD")
    5021                      .dwattr $C$DW$733, DW_AT_TI_symbol_name("_GPAPUD")
    5022                      .dwattr $C$DW$733, DW_AT_data_member_location[DW_OP_plus_uconst 0xc]
TMS320C2000 Assembler PC v6.2.5 Sat Sep 16 15:41:34 2017

Tools Copyright (c) 1996-2014 Texas Instruments Incorporated
C:\Users\wmj\AppData\Local\Temp\1144410                              PAGE   98

    5023                      .dwattr $C$DW$733, DW_AT_accessibility(DW_ACCESS_public)
    5024              $C$DW$734       .dwtag  DW_TAG_member
    5025                      .dwattr $C$DW$734, DW_AT_type(*$C$DW$T$28)
    5026                      .dwattr $C$DW$734, DW_AT_name("rsvd_1")
    5027                      .dwattr $C$DW$734, DW_AT_TI_symbol_name("_rsvd_1")
    5028                      .dwattr $C$DW$734, DW_AT_data_member_location[DW_OP_plus_uconst 0xe]
    5029                      .dwattr $C$DW$734, DW_AT_accessibility(DW_ACCESS_public)
    5030              $C$DW$735       .dwtag  DW_TAG_member
    5031                      .dwattr $C$DW$735, DW_AT_type(*$C$DW$T$87)
    5032                      .dwattr $C$DW$735, DW_AT_name("GPBCTRL")
    5033                      .dwattr $C$DW$735, DW_AT_TI_symbol_name("_GPBCTRL")
