TMS320C2000 Assembler PC v6.2.5 Sat Sep 16 15:52:23 2017

Tools Copyright (c) 1996-2014 Texas Instruments Incorporated
C:\Users\wmj\AppData\Local\Temp\1651210                              PAGE    1

       1              ;***************************************************************
       2              ;* TMS320C2000 C/C++ Codegen                         PC v6.2.5 *
       3              ;* Date/Time created: Sat Sep 16 15:52:22 2017                 *
       4              ;***************************************************************
       5                      .compiler_opts --float_support=softlib --hll_source=on --mem_model:code=flat --mem_model:data=large -
       6        0002  FP      .set    XAR2
       7              
       8              $C$DW$CU        .dwtag  DW_TAG_compile_unit
       9                      .dwattr $C$DW$CU, DW_AT_name("D:/BM1000/sw/modules/user/src/32b/user.c")
      10                      .dwattr $C$DW$CU, DW_AT_producer("TMS320C2000 C/C++ Codegen PC v6.2.5 Copyright (c) 1996-2014 Texas I
      11                      .dwattr $C$DW$CU, DW_AT_TI_version(0x01)
      12                      .dwattr $C$DW$CU, DW_AT_comp_dir("D:\BM1000\sw\solutions\instaspin_foc\boards\hvkit_rev1p1\f28x\f2802
      13              ;**************************************************************
      14              ;* CINIT RECORDS                                              *

    5930              $C$DW$571       .dwtag  DW_TAG_enumerator, DW_AT_name("USER_ErrorCode_maxCurrentSlope_High"), DW_AT_const_val
    5931              $C$DW$572       .dwtag  DW_TAG_enumerator, DW_AT_name("USER_ErrorCode_maxCurrentSlope_Low"), DW_AT_const_valu
    5932              $C$DW$573       .dwtag  DW_TAG_enumerator, DW_AT_name("USER_ErrorCode_maxCurrentSlope_powerWarp_High"), DW_AT
    5933              $C$DW$574       .dwtag  DW_TAG_enumerator, DW_AT_name("USER_ErrorCode_maxCurrentSlope_powerWarp_Low"), DW_AT_
    5934              $C$DW$575       .dwtag  DW_TAG_enumerator, DW_AT_name("USER_ErrorCode_IdRated_High"), DW_AT_const_value(0x54)
    5935              $C$DW$576       .dwtag  DW_TAG_enumerator, DW_AT_name("USER_ErrorCode_IdRated_Low"), DW_AT_const_value(0x55)
    5936              $C$DW$577       .dwtag  DW_TAG_enumerator, DW_AT_name("USER_ErrorCode_IdRatedFraction_indEst_High"), DW_AT_co
    5937              $C$DW$578       .dwtag  DW_TAG_enumerator, DW_AT_name("USER_ErrorCode_IdRatedFraction_indEst_Low"), DW_AT_con
    5938              $C$DW$579       .dwtag  DW_TAG_enumerator, DW_AT_name("USER_ErrorCode_IdRatedFraction_ratedFlux_High"), DW_AT
    5939              $C$DW$580       .dwtag  DW_TAG_enumerator, DW_AT_name("USER_ErrorCode_IdRatedFraction_ratedFlux_Low"), DW_AT_
    5940              $C$DW$581       .dwtag  DW_TAG_enumerator, DW_AT_name("USER_ErrorCode_IdRated_delta_High"), DW_AT_const_value
    5941              $C$DW$582       .dwtag  DW_TAG_enumerator, DW_AT_name("USER_ErrorCode_IdRated_delta_Low"), DW_AT_const_value(
    5942              $C$DW$583       .dwtag  DW_TAG_enumerator, DW_AT_name("USER_ErrorCode_fluxEstFreq_Hz_High"), DW_AT_const_valu
    5943              $C$DW$584       .dwtag  DW_TAG_enumerator, DW_AT_name("USER_ErrorCode_fluxEstFreq_Hz_Low"), DW_AT_const_value
TMS320C2000 Assembler PC v6.2.5 Sat Sep 16 15:52:23 2017

Tools Copyright (c) 1996-2014 Texas Instruments Incorporated
C:\Users\wmj\AppData\Local\Temp\1651210                              PAGE  121

    5944              $C$DW$585       .dwtag  DW_TAG_enumerator, DW_AT_name("USER_ErrorCode_ctrlFreq_Hz_High"), DW_AT_const_value(0
    5945              $C$DW$586       .dwtag  DW_TAG_enumerator, DW_AT_name("USER_ErrorCode_ctrlFreq_Hz_Low"), DW_AT_const_value(0x
    5946              $C$DW$587       .dwtag  DW_TAG_enumerator, DW_AT_name("USER_ErrorCode_estFreq_Hz_High"), DW_AT_const_value(0x
    5947              $C$DW$588       .dwtag  DW_TAG_enumerator, DW_AT_name("USER_ErrorCode_estFreq_Hz_Low"), DW_AT_const_value(0x6
    5948              $C$DW$589       .dwtag  DW_TAG_enumerator, DW_AT_name("USER_ErrorCode_RoverL_estFreq_Hz_High"), DW_AT_const_v
    5949              $C$DW$590       .dwtag  DW_TAG_enumerator, DW_AT_name("USER_ErrorCode_RoverL_estFreq_Hz_Low"), DW_AT_const_va
    5950              $C$DW$591       .dwtag  DW_TAG_enumerator, DW_AT_name("USER_ErrorCode_trajFreq_Hz_High"), DW_AT_const_value(0
    5951              $C$DW$592       .dwtag  DW_TAG_enumerator, DW_AT_name("USER_ErrorCode_trajFreq_Hz_Low"), DW_AT_const_value(0x
    5952              $C$DW$593       .dwtag  DW_TAG_enumerator, DW_AT_name("USER_ErrorCode_ctrlPeriod_sec_High"), DW_AT_const_valu
    5953              $C$DW$594       .dwtag  DW_TAG_enumerator, DW_AT_name("USER_ErrorCode_ctrlPeriod_sec_Low"), DW_AT_const_value
    5954              $C$DW$595       .dwtag  DW_TAG_enumerator, DW_AT_name("USER_ErrorCode_maxNegativeIdCurrent_a_High"), DW_AT_co
    5955              $C$DW$596       .dwtag  DW_TAG_enumerator, DW_AT_name("USER_ErrorCode_maxNegativeIdCurrent_a_Low"), DW_AT_con
    5956              $C$DW$597       .dwtag  DW_TAG_enumerator, DW_AT_name("USER_numErrorCodes"), DW_AT_const_value(0x6a)
    5957                      .dwendtag $C$DW$T$74
    5958              
    5959              $C$DW$T$75      .dwtag  DW_TAG_typedef, DW_AT_name("USER_ErrorCode_e")
    5960                      .dwattr $C$DW$T$75, DW_AT_type(*$C$DW$T$74)
    5961                      .dwattr $C$DW$T$75, DW_AT_language(DW_LANG_C)
    5962              $C$DW$598       .dwtag  DW_TAG_TI_far_type
    5963                      .dwattr $C$DW$598, DW_AT_type(*$C$DW$T$75)
    5964              $C$DW$T$78      .dwtag  DW_TAG_const_type
    5965                      .dwattr $C$DW$T$78, DW_AT_type(*$C$DW$598)
    5966              
    5967              $C$DW$T$83      .dwtag  DW_TAG_enumeration_type
    5968                      .dwattr $C$DW$T$83, DW_AT_byte_size(0x01)
    5969              $C$DW$599       .dwtag  DW_TAG_enumerator, DW_AT_name("CTRL_Type_PID_spd"), DW_AT_const_value(0x00)
    5970              $C$DW$600       .dwtag  DW_TAG_enumerator, DW_AT_name("CTRL_Type_PID_Id"), DW_AT_const_value(0x01)
    5971              $C$DW$601       .dwtag  DW_TAG_enumerator, DW_AT_name("CTRL_Type_PID_Iq"), DW_AT_const_value(0x02)
    5972                      .dwendtag $C$DW$T$83
    5973              
    5974              $C$DW$T$84      .dwtag  DW_TAG_typedef, DW_AT_name("CTRL_Type_e")
    5975                      .dwattr $C$DW$T$84, DW_AT_type(*$C$DW$T$83)
    5976                      .dwattr $C$DW$T$84, DW_AT_language(DW_LANG_C)
    5977              $C$DW$602       .dwtag  DW_TAG_TI_far_type
    5978                      .dwattr $C$DW$602, DW_AT_type(*$C$DW$T$84)
    5979              $C$DW$T$85      .dwtag  DW_TAG_const_type
    5980                      .dwattr $C$DW$T$85, DW_AT_type(*$C$DW$602)
    5981              
    5982              $C$DW$T$23      .dwtag  DW_TAG_structure_type
    5983                      .dwattr $C$DW$T$23, DW_AT_name("_CLARKE_Obj_")
    5984                      .dwattr $C$DW$T$23, DW_AT_byte_size(0x06)
    5985              $C$DW$603       .dwtag  DW_TAG_member
    5986                      .dwattr $C$DW$603, DW_AT_type(*$C$DW$T$20)
    5987                      .dwattr $C$DW$603, DW_AT_name("alpha_sf")
    5988                      .dwattr $C$DW$603, DW_AT_TI_symbol_name("_alpha_sf")
    5989                      .dwattr $C$DW$603, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    5990                      .dwattr $C$DW$603, DW_AT_accessibility(DW_ACCESS_public)
    5991              $C$DW$604       .dwtag  DW_TAG_member
    5992                      .dwattr $C$DW$604, DW_AT_type(*$C$DW$T$20)
    5993                      .dwattr $C$DW$604, DW_AT_name("beta_sf")
    5994                      .dwattr $C$DW$604, DW_AT_TI_symbol_name("_beta_sf")
    5995                      .dwattr $C$DW$604, DW_AT_data_member_location[DW_OP_plus_uconst 0x2]
    5996                      .dwattr $C$DW$604, DW_AT_accessibility(DW_ACCESS_public)
    5997              $C$DW$605       .dwtag  DW_TAG_member
    5998                      .dwattr $C$DW$605, DW_AT_type(*$C$DW$T$22)
TMS320C2000 Assembler PC v6.2.5 Sat Sep 16 15:52:23 2017

Tools Copyright (c) 1996-2014 Texas Instruments Incorporated
C:\Users\wmj\AppData\Local\Temp\1651210                              PAGE  122

    5999                      .dwattr $C$DW$605, DW_AT_name("numSensors")
    6000                      .dwattr $C$DW$605, DW_AT_TI_symbol_name("_numSensors")
    6001                      .dwattr $C$DW$605, DW_AT_data_member_location[DW_OP_plus_uconst 0x4]
    6002                      .dwattr $C$DW$605, DW_AT_accessibility(DW_ACCESS_public)
    6003                      .dwendtag $C$DW$T$23
    6004              
    6005              $C$DW$T$31      .dwtag  DW_TAG_typedef, DW_AT_name("CLARKE_Obj")
    6006                      .dwattr $C$DW$T$31, DW_AT_type(*$C$DW$T$23)
    6007                      .dwattr $C$DW$T$31, DW_AT_language(DW_LANG_C)
    6008              $C$DW$T$29      .dwtag  DW_TAG_pointer_type
    6009                      .dwattr $C$DW$T$29, DW_AT_type(*$C$DW$T$23)
    6010                      .dwattr $C$DW$T$29, DW_AT_address_class(0x16)
    6011              $C$DW$T$30      .dwtag  DW_TAG_typedef, DW_AT_name("CLARKE_Handle")
    6012                      .dwattr $C$DW$T$30, DW_AT_type(*$C$DW$T$29)
    6013                      .dwattr $C$DW$T$30, DW_AT_language(DW_LANG_C)
    6014              
    6015              $C$DW$T$57      .dwtag  DW_TAG_structure_type
    6016                      .dwattr $C$DW$T$57, DW_AT_name("_CTRL_Obj_")
    6017                      .dwattr $C$DW$T$57, DW_AT_byte_size(0x108)
    6018              $C$DW$606       .dwtag  DW_TAG_member
    6019                      .dwattr $C$DW$606, DW_AT_type(*$C$DW$T$24)
    6020                      .dwattr $C$DW$606, DW_AT_name("version")
    6021                      .dwattr $C$DW$606, DW_AT_TI_symbol_name("_version")
    6022                      .dwattr $C$DW$606, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    6023                      .dwattr $C$DW$606, DW_AT_accessibility(DW_ACCESS_public)
    6024              $C$DW$607       .dwtag  DW_TAG_member
    6025                      .dwattr $C$DW$607, DW_AT_type(*$C$DW$T$26)
    6026                      .dwattr $C$DW$607, DW_AT_name("state")
    6027                      .dwattr $C$DW$607, DW_AT_TI_symbol_name("_state")
    6028                      .dwattr $C$DW$607, DW_AT_data_member_location[DW_OP_plus_uconst 0x4]
    6029                      .dwattr $C$DW$607, DW_AT_accessibility(DW_ACCESS_public)
    6030              $C$DW$608       .dwtag  DW_TAG_member
    6031                      .dwattr $C$DW$608, DW_AT_type(*$C$DW$T$26)
    6032                      .dwattr $C$DW$608, DW_AT_name("prevState")
    6033                      .dwattr $C$DW$608, DW_AT_TI_symbol_name("_prevState")
    6034                      .dwattr $C$DW$608, DW_AT_data_member_location[DW_OP_plus_uconst 0x5]
    6035                      .dwattr $C$DW$608, DW_AT_accessibility(DW_ACCESS_public)
    6036              $C$DW$609       .dwtag  DW_TAG_member
    6037                      .dwattr $C$DW$609, DW_AT_type(*$C$DW$T$28)
    6038                      .dwattr $C$DW$609, DW_AT_name("errorCode")
    6039                      .dwattr $C$DW$609, DW_AT_TI_symbol_name("_errorCode")
    6040                      .dwattr $C$DW$609, DW_AT_data_member_location[DW_OP_plus_uconst 0x6]
    6041                      .dwattr $C$DW$609, DW_AT_accessibility(DW_ACCESS_public)
    6042              $C$DW$610       .dwtag  DW_TAG_member
    6043                      .dwattr $C$DW$610, DW_AT_type(*$C$DW$T$30)
    6044                      .dwattr $C$DW$610, DW_AT_name("clarkeHandle_I")
    6045                      .dwattr $C$DW$610, DW_AT_TI_symbol_name("_clarkeHandle_I")
    6046                      .dwattr $C$DW$610, DW_AT_data_member_location[DW_OP_plus_uconst 0x8]
    6047                      .dwattr $C$DW$610, DW_AT_accessibility(DW_ACCESS_public)
    6048              $C$DW$611       .dwtag  DW_TAG_member
    6049                      .dwattr $C$DW$611, DW_AT_type(*$C$DW$T$31)
    6050                      .dwattr $C$DW$611, DW_AT_name("clarke_I")
    6051                      .dwattr $C$DW$611, DW_AT_TI_symbol_name("_clarke_I")
    6052                      .dwattr $C$DW$611, DW_AT_data_member_location[DW_OP_plus_uconst 0xa]
    6053                      .dwattr $C$DW$611, DW_AT_accessibility(DW_ACCESS_public)
TMS320C2000 Assembler PC v6.2.5 Sat Sep 16 15:52:23 2017

Tools Copyright (c) 1996-2014 Texas Instruments Incorporated
C:\Users\wmj\AppData\Local\Temp\1651210                              PAGE  123

    6054              $C$DW$612       .dwtag  DW_TAG_member
    6055                      .dwattr $C$DW$612, DW_AT_type(*$C$DW$T$30)
    6056                      .dwattr $C$DW$612, DW_AT_name("clarkeHandle_V")
    6057                      .dwattr $C$DW$612, DW_AT_TI_symbol_name("_clarkeHandle_V")
    6058                      .dwattr $C$DW$612, DW_AT_data_member_location[DW_OP_plus_uconst 0x10]
    6059                      .dwattr $C$DW$612, DW_AT_accessibility(DW_ACCESS_public)
    6060              $C$DW$613       .dwtag  DW_TAG_member
    6061                      .dwattr $C$DW$613, DW_AT_type(*$C$DW$T$31)
    6062                      .dwattr $C$DW$613, DW_AT_name("clarke_V")
    6063                      .dwattr $C$DW$613, DW_AT_TI_symbol_name("_clarke_V")
    6064                      .dwattr $C$DW$613, DW_AT_data_member_location[DW_OP_plus_uconst 0x12]
    6065                      .dwattr $C$DW$613, DW_AT_accessibility(DW_ACCESS_public)
    6066              $C$DW$614       .dwtag  DW_TAG_member
    6067                      .dwattr $C$DW$614, DW_AT_type(*$C$DW$T$33)
    6068                      .dwattr $C$DW$614, DW_AT_name("estHandle")
    6069                      .dwattr $C$DW$614, DW_AT_TI_symbol_name("_estHandle")
    6070                      .dwattr $C$DW$614, DW_AT_data_member_location[DW_OP_plus_uconst 0x18]
    6071                      .dwattr $C$DW$614, DW_AT_accessibility(DW_ACCESS_public)
    6072              $C$DW$615       .dwtag  DW_TAG_member
    6073                      .dwattr $C$DW$615, DW_AT_type(*$C$DW$T$35)
    6074                      .dwattr $C$DW$615, DW_AT_name("parkHandle")
    6075                      .dwattr $C$DW$615, DW_AT_TI_symbol_name("_parkHandle")
    6076                      .dwattr $C$DW$615, DW_AT_data_member_location[DW_OP_plus_uconst 0x1a]
    6077                      .dwattr $C$DW$615, DW_AT_accessibility(DW_ACCESS_public)
    6078              $C$DW$616       .dwtag  DW_TAG_member
    6079                      .dwattr $C$DW$616, DW_AT_type(*$C$DW$T$36)
    6080                      .dwattr $C$DW$616, DW_AT_name("park")
    6081                      .dwattr $C$DW$616, DW_AT_TI_symbol_name("_park")
    6082                      .dwattr $C$DW$616, DW_AT_data_member_location[DW_OP_plus_uconst 0x1c]
    6083                      .dwattr $C$DW$616, DW_AT_accessibility(DW_ACCESS_public)
    6084              $C$DW$617       .dwtag  DW_TAG_member
    6085                      .dwattr $C$DW$617, DW_AT_type(*$C$DW$T$38)
    6086                      .dwattr $C$DW$617, DW_AT_name("pidHandle_Id")
    6087                      .dwattr $C$DW$617, DW_AT_TI_symbol_name("_pidHandle_Id")
    6088                      .dwattr $C$DW$617, DW_AT_data_member_location[DW_OP_plus_uconst 0x20]
    6089                      .dwattr $C$DW$617, DW_AT_accessibility(DW_ACCESS_public)
    6090              $C$DW$618       .dwtag  DW_TAG_member
    6091                      .dwattr $C$DW$618, DW_AT_type(*$C$DW$T$39)
    6092                      .dwattr $C$DW$618, DW_AT_name("pid_Id")
    6093                      .dwattr $C$DW$618, DW_AT_TI_symbol_name("_pid_Id")
    6094                      .dwattr $C$DW$618, DW_AT_data_member_location[DW_OP_plus_uconst 0x22]
    6095                      .dwattr $C$DW$618, DW_AT_accessibility(DW_ACCESS_public)
    6096              $C$DW$619       .dwtag  DW_TAG_member
    6097                      .dwattr $C$DW$619, DW_AT_type(*$C$DW$T$38)
    6098                      .dwattr $C$DW$619, DW_AT_name("pidHandle_Iq")
    6099                      .dwattr $C$DW$619, DW_AT_TI_symbol_name("_pidHandle_Iq")
    6100                      .dwattr $C$DW$619, DW_AT_data_member_location[DW_OP_plus_uconst 0x32]
    6101                      .dwattr $C$DW$619, DW_AT_accessibility(DW_ACCESS_public)
    6102              $C$DW$620       .dwtag  DW_TAG_member
    6103                      .dwattr $C$DW$620, DW_AT_type(*$C$DW$T$39)
    6104                      .dwattr $C$DW$620, DW_AT_name("pid_Iq")
    6105                      .dwattr $C$DW$620, DW_AT_TI_symbol_name("_pid_Iq")
    6106                      .dwattr $C$DW$620, DW_AT_data_member_location[DW_OP_plus_uconst 0x34]
    6107                      .dwattr $C$DW$620, DW_AT_accessibility(DW_ACCESS_public)
    6108              $C$DW$621       .dwtag  DW_TAG_member
TMS320C2000 Assembler PC v6.2.5 Sat Sep 16 15:52:23 2017

Tools Copyright (c) 1996-2014 Texas Instruments Incorporated
C:\Users\wmj\AppData\Local\Temp\1651210                              PAGE  124

    6109                      .dwattr $C$DW$621, DW_AT_type(*$C$DW$T$38)
    6110                      .dwattr $C$DW$621, DW_AT_name("pidHandle_spd")
    6111                      .dwattr $C$DW$621, DW_AT_TI_symbol_name("_pidHandle_spd")
    6112                      .dwattr $C$DW$621, DW_AT_data_member_location[DW_OP_plus_uconst 0x44]
    6113                      .dwattr $C$DW$621, DW_AT_accessibility(DW_ACCESS_public)
    6114              $C$DW$622       .dwtag  DW_TAG_member
    6115                      .dwattr $C$DW$622, DW_AT_type(*$C$DW$T$39)
    6116                      .dwattr $C$DW$622, DW_AT_name("pid_spd")
    6117                      .dwattr $C$DW$622, DW_AT_TI_symbol_name("_pid_spd")
    6118                      .dwattr $C$DW$622, DW_AT_data_member_location[DW_OP_plus_uconst 0x46]
    6119                      .dwattr $C$DW$622, DW_AT_accessibility(DW_ACCESS_public)
    6120              $C$DW$623       .dwtag  DW_TAG_member
    6121                      .dwattr $C$DW$623, DW_AT_type(*$C$DW$T$41)
    6122                      .dwattr $C$DW$623, DW_AT_name("iparkHandle")
    6123                      .dwattr $C$DW$623, DW_AT_TI_symbol_name("_iparkHandle")
    6124                      .dwattr $C$DW$623, DW_AT_data_member_location[DW_OP_plus_uconst 0x56]
    6125                      .dwattr $C$DW$623, DW_AT_accessibility(DW_ACCESS_public)
    6126              $C$DW$624       .dwtag  DW_TAG_member
    6127                      .dwattr $C$DW$624, DW_AT_type(*$C$DW$T$42)
    6128                      .dwattr $C$DW$624, DW_AT_name("ipark")
    6129                      .dwattr $C$DW$624, DW_AT_TI_symbol_name("_ipark")
    6130                      .dwattr $C$DW$624, DW_AT_data_member_location[DW_OP_plus_uconst 0x58]
    6131                      .dwattr $C$DW$624, DW_AT_accessibility(DW_ACCESS_public)
    6132              $C$DW$625       .dwtag  DW_TAG_member
    6133                      .dwattr $C$DW$625, DW_AT_type(*$C$DW$T$44)
    6134                      .dwattr $C$DW$625, DW_AT_name("svgenHandle")
    6135                      .dwattr $C$DW$625, DW_AT_TI_symbol_name("_svgenHandle")
    6136                      .dwattr $C$DW$625, DW_AT_data_member_location[DW_OP_plus_uconst 0x5c]
    6137                      .dwattr $C$DW$625, DW_AT_accessibility(DW_ACCESS_public)
    6138              $C$DW$626       .dwtag  DW_TAG_member
    6139                      .dwattr $C$DW$626, DW_AT_type(*$C$DW$T$45)
    6140                      .dwattr $C$DW$626, DW_AT_name("svgen")
    6141                      .dwattr $C$DW$626, DW_AT_TI_symbol_name("_svgen")
    6142                      .dwattr $C$DW$626, DW_AT_data_member_location[DW_OP_plus_uconst 0x5e]
    6143                      .dwattr $C$DW$626, DW_AT_accessibility(DW_ACCESS_public)
    6144              $C$DW$627       .dwtag  DW_TAG_member
    6145                      .dwattr $C$DW$627, DW_AT_type(*$C$DW$T$47)
    6146                      .dwattr $C$DW$627, DW_AT_name("trajHandle_Id")
    6147                      .dwattr $C$DW$627, DW_AT_TI_symbol_name("_trajHandle_Id")
    6148                      .dwattr $C$DW$627, DW_AT_data_member_location[DW_OP_plus_uconst 0x60]
    6149                      .dwattr $C$DW$627, DW_AT_accessibility(DW_ACCESS_public)
    6150              $C$DW$628       .dwtag  DW_TAG_member
    6151                      .dwattr $C$DW$628, DW_AT_type(*$C$DW$T$48)
    6152                      .dwattr $C$DW$628, DW_AT_name("traj_Id")
    6153                      .dwattr $C$DW$628, DW_AT_TI_symbol_name("_traj_Id")
    6154                      .dwattr $C$DW$628, DW_AT_data_member_location[DW_OP_plus_uconst 0x62]
    6155                      .dwattr $C$DW$628, DW_AT_accessibility(DW_ACCESS_public)
    6156              $C$DW$629       .dwtag  DW_TAG_member
    6157                      .dwattr $C$DW$629, DW_AT_type(*$C$DW$T$47)
    6158                      .dwattr $C$DW$629, DW_AT_name("trajHandle_spd")
    6159                      .dwattr $C$DW$629, DW_AT_TI_symbol_name("_trajHandle_spd")
    6160                      .dwattr $C$DW$629, DW_AT_data_member_location[DW_OP_plus_uconst 0x6c]
    6161                      .dwattr $C$DW$629, DW_AT_accessibility(DW_ACCESS_public)
    6162              $C$DW$630       .dwtag  DW_TAG_member
    6163                      .dwattr $C$DW$630, DW_AT_type(*$C$DW$T$48)
TMS320C2000 Assembler PC v6.2.5 Sat Sep 16 15:52:23 2017

Tools Copyright (c) 1996-2014 Texas Instruments Incorporated
C:\Users\wmj\AppData\Local\Temp\1651210                              PAGE  125

    6164                      .dwattr $C$DW$630, DW_AT_name("traj_spd")
    6165                      .dwattr $C$DW$630, DW_AT_TI_symbol_name("_traj_spd")
    6166                      .dwattr $C$DW$630, DW_AT_data_member_location[DW_OP_plus_uconst 0x6e]
    6167                      .dwattr $C$DW$630, DW_AT_accessibility(DW_ACCESS_public)
    6168              $C$DW$631       .dwtag  DW_TAG_member
    6169                      .dwattr $C$DW$631, DW_AT_type(*$C$DW$T$47)
    6170                      .dwattr $C$DW$631, DW_AT_name("trajHandle_spdMax")
    6171                      .dwattr $C$DW$631, DW_AT_TI_symbol_name("_trajHandle_spdMax")
    6172                      .dwattr $C$DW$631, DW_AT_data_member_location[DW_OP_plus_uconst 0x78]
    6173                      .dwattr $C$DW$631, DW_AT_accessibility(DW_ACCESS_public)
    6174              $C$DW$632       .dwtag  DW_TAG_member
    6175                      .dwattr $C$DW$632, DW_AT_type(*$C$DW$T$48)
    6176                      .dwattr $C$DW$632, DW_AT_name("traj_spdMax")
    6177                      .dwattr $C$DW$632, DW_AT_TI_symbol_name("_traj_spdMax")
    6178                      .dwattr $C$DW$632, DW_AT_data_member_location[DW_OP_plus_uconst 0x7a]
    6179                      .dwattr $C$DW$632, DW_AT_accessibility(DW_ACCESS_public)
    6180              $C$DW$633       .dwtag  DW_TAG_member
    6181                      .dwattr $C$DW$633, DW_AT_type(*$C$DW$T$49)
    6182                      .dwattr $C$DW$633, DW_AT_name("motorParams")
    6183                      .dwattr $C$DW$633, DW_AT_TI_symbol_name("_motorParams")
    6184                      .dwattr $C$DW$633, DW_AT_data_member_location[DW_OP_plus_uconst 0x84]
    6185                      .dwattr $C$DW$633, DW_AT_accessibility(DW_ACCESS_public)
    6186              $C$DW$634       .dwtag  DW_TAG_member
    6187                      .dwattr $C$DW$634, DW_AT_type(*$C$DW$T$52)
    6188                      .dwattr $C$DW$634, DW_AT_name("waitTimes")
    6189                      .dwattr $C$DW$634, DW_AT_TI_symbol_name("_waitTimes")
    6190                      .dwattr $C$DW$634, DW_AT_data_member_location[DW_OP_plus_uconst 0x92]
    6191                      .dwattr $C$DW$634, DW_AT_accessibility(DW_ACCESS_public)
    6192              $C$DW$635       .dwtag  DW_TAG_member
    6193                      .dwattr $C$DW$635, DW_AT_type(*$C$DW$T$51)
    6194                      .dwattr $C$DW$635, DW_AT_name("counter_state")
    6195                      .dwattr $C$DW$635, DW_AT_TI_symbol_name("_counter_state")
    6196                      .dwattr $C$DW$635, DW_AT_data_member_location[DW_OP_plus_uconst 0x9a]
    6197                      .dwattr $C$DW$635, DW_AT_accessibility(DW_ACCESS_public)
    6198              $C$DW$636       .dwtag  DW_TAG_member
    6199                      .dwattr $C$DW$636, DW_AT_type(*$C$DW$T$53)
    6200                      .dwattr $C$DW$636, DW_AT_name("numIsrTicksPerCtrlTick")
    6201                      .dwattr $C$DW$636, DW_AT_TI_symbol_name("_numIsrTicksPerCtrlTick")
    6202                      .dwattr $C$DW$636, DW_AT_data_member_location[DW_OP_plus_uconst 0x9c]
    6203                      .dwattr $C$DW$636, DW_AT_accessibility(DW_ACCESS_public)
    6204              $C$DW$637       .dwtag  DW_TAG_member
    6205                      .dwattr $C$DW$637, DW_AT_type(*$C$DW$T$53)
    6206                      .dwattr $C$DW$637, DW_AT_name("numCtrlTicksPerCurrentTick")
    6207                      .dwattr $C$DW$637, DW_AT_TI_symbol_name("_numCtrlTicksPerCurrentTick")
    6208                      .dwattr $C$DW$637, DW_AT_data_member_location[DW_OP_plus_uconst 0x9d]
    6209                      .dwattr $C$DW$637, DW_AT_accessibility(DW_ACCESS_public)
    6210              $C$DW$638       .dwtag  DW_TAG_member
    6211                      .dwattr $C$DW$638, DW_AT_type(*$C$DW$T$53)
    6212                      .dwattr $C$DW$638, DW_AT_name("numCtrlTicksPerSpeedTick")
    6213                      .dwattr $C$DW$638, DW_AT_TI_symbol_name("_numCtrlTicksPerSpeedTick")
    6214                      .dwattr $C$DW$638, DW_AT_data_member_location[DW_OP_plus_uconst 0x9e]
    6215                      .dwattr $C$DW$638, DW_AT_accessibility(DW_ACCESS_public)
    6216              $C$DW$639       .dwtag  DW_TAG_member
    6217                      .dwattr $C$DW$639, DW_AT_type(*$C$DW$T$53)
    6218                      .dwattr $C$DW$639, DW_AT_name("numCtrlTicksPerTrajTick")
TMS320C2000 Assembler PC v6.2.5 Sat Sep 16 15:52:23 2017

Tools Copyright (c) 1996-2014 Texas Instruments Incorporated
C:\Users\wmj\AppData\Local\Temp\1651210                              PAGE  126

    6219                      .dwattr $C$DW$639, DW_AT_TI_symbol_name("_numCtrlTicksPerTrajTick")
    6220                      .dwattr $C$DW$639, DW_AT_data_member_location[DW_OP_plus_uconst 0x9f]
    6221                      .dwattr $C$DW$639, DW_AT_accessibility(DW_ACCESS_public)
    6222              $C$DW$640       .dwtag  DW_TAG_member
    6223                      .dwattr $C$DW$640, DW_AT_type(*$C$DW$T$51)
    6224                      .dwattr $C$DW$640, DW_AT_name("ctrlFreq_Hz")
    6225                      .dwattr $C$DW$640, DW_AT_TI_symbol_name("_ctrlFreq_Hz")
    6226                      .dwattr $C$DW$640, DW_AT_data_member_location[DW_OP_plus_uconst 0xa0]
    6227                      .dwattr $C$DW$640, DW_AT_accessibility(DW_ACCESS_public)
    6228              $C$DW$641       .dwtag  DW_TAG_member
    6229                      .dwattr $C$DW$641, DW_AT_type(*$C$DW$T$51)
    6230                      .dwattr $C$DW$641, DW_AT_name("trajFreq_Hz")
    6231                      .dwattr $C$DW$641, DW_AT_TI_symbol_name("_trajFreq_Hz")
    6232                      .dwattr $C$DW$641, DW_AT_data_member_location[DW_OP_plus_uconst 0xa2]
    6233                      .dwattr $C$DW$641, DW_AT_accessibility(DW_ACCESS_public)
    6234              $C$DW$642       .dwtag  DW_TAG_member
    6235                      .dwattr $C$DW$642, DW_AT_type(*$C$DW$T$20)
    6236                      .dwattr $C$DW$642, DW_AT_name("trajPeriod_sec")
    6237                      .dwattr $C$DW$642, DW_AT_TI_symbol_name("_trajPeriod_sec")
    6238                      .dwattr $C$DW$642, DW_AT_data_member_location[DW_OP_plus_uconst 0xa4]
    6239                      .dwattr $C$DW$642, DW_AT_accessibility(DW_ACCESS_public)
    6240              $C$DW$643       .dwtag  DW_TAG_member
    6241                      .dwattr $C$DW$643, DW_AT_type(*$C$DW$T$54)
    6242                      .dwattr $C$DW$643, DW_AT_name("ctrlPeriod_sec")
    6243                      .dwattr $C$DW$643, DW_AT_TI_symbol_name("_ctrlPeriod_sec")
    6244                      .dwattr $C$DW$643, DW_AT_data_member_location[DW_OP_plus_uconst 0xa6]
    6245                      .dwattr $C$DW$643, DW_AT_accessibility(DW_ACCESS_public)
    6246              $C$DW$644       .dwtag  DW_TAG_member
    6247                      .dwattr $C$DW$644, DW_AT_type(*$C$DW$T$20)
    6248                      .dwattr $C$DW$644, DW_AT_name("maxVsMag_pu")
    6249                      .dwattr $C$DW$644, DW_AT_TI_symbol_name("_maxVsMag_pu")
    6250                      .dwattr $C$DW$644, DW_AT_data_member_location[DW_OP_plus_uconst 0xa8]
    6251                      .dwattr $C$DW$644, DW_AT_accessibility(DW_ACCESS_public)
    6252              $C$DW$645       .dwtag  DW_TAG_member
    6253                      .dwattr $C$DW$645, DW_AT_type(*$C$DW$T$55)
    6254                      .dwattr $C$DW$645, DW_AT_name("Iab_in")
    6255                      .dwattr $C$DW$645, DW_AT_TI_symbol_name("_Iab_in")
    6256                      .dwattr $C$DW$645, DW_AT_data_member_location[DW_OP_plus_uconst 0xaa]
    6257                      .dwattr $C$DW$645, DW_AT_accessibility(DW_ACCESS_public)
    6258              $C$DW$646       .dwtag  DW_TAG_member
    6259                      .dwattr $C$DW$646, DW_AT_type(*$C$DW$T$55)
    6260                      .dwattr $C$DW$646, DW_AT_name("Iab_filt")
    6261                      .dwattr $C$DW$646, DW_AT_TI_symbol_name("_Iab_filt")
    6262                      .dwattr $C$DW$646, DW_AT_data_member_location[DW_OP_plus_uconst 0xae]
    6263                      .dwattr $C$DW$646, DW_AT_accessibility(DW_ACCESS_public)
    6264              $C$DW$647       .dwtag  DW_TAG_member
    6265                      .dwattr $C$DW$647, DW_AT_type(*$C$DW$T$55)
    6266                      .dwattr $C$DW$647, DW_AT_name("Idq_in")
    6267                      .dwattr $C$DW$647, DW_AT_TI_symbol_name("_Idq_in")
    6268                      .dwattr $C$DW$647, DW_AT_data_member_location[DW_OP_plus_uconst 0xb2]
    6269                      .dwattr $C$DW$647, DW_AT_accessibility(DW_ACCESS_public)
    6270              $C$DW$648       .dwtag  DW_TAG_member
    6271                      .dwattr $C$DW$648, DW_AT_type(*$C$DW$T$55)
    6272                      .dwattr $C$DW$648, DW_AT_name("Vab_in")
    6273                      .dwattr $C$DW$648, DW_AT_TI_symbol_name("_Vab_in")
TMS320C2000 Assembler PC v6.2.5 Sat Sep 16 15:52:23 2017

Tools Copyright (c) 1996-2014 Texas Instruments Incorporated
C:\Users\wmj\AppData\Local\Temp\1651210                              PAGE  127

    6274                      .dwattr $C$DW$648, DW_AT_data_member_location[DW_OP_plus_uconst 0xb6]
    6275                      .dwattr $C$DW$648, DW_AT_accessibility(DW_ACCESS_public)
    6276              $C$DW$649       .dwtag  DW_TAG_member
    6277                      .dwattr $C$DW$649, DW_AT_type(*$C$DW$T$20)
    6278                      .dwattr $C$DW$649, DW_AT_name("spd_out")
    6279                      .dwattr $C$DW$649, DW_AT_TI_symbol_name("_spd_out")
    6280                      .dwattr $C$DW$649, DW_AT_data_member_location[DW_OP_plus_uconst 0xba]
    6281                      .dwattr $C$DW$649, DW_AT_accessibility(DW_ACCESS_public)
    6282              $C$DW$650       .dwtag  DW_TAG_member
    6283                      .dwattr $C$DW$650, DW_AT_type(*$C$DW$T$55)
    6284                      .dwattr $C$DW$650, DW_AT_name("Vab_out")
    6285                      .dwattr $C$DW$650, DW_AT_TI_symbol_name("_Vab_out")
    6286                      .dwattr $C$DW$650, DW_AT_data_member_location[DW_OP_plus_uconst 0xbc]
    6287                      .dwattr $C$DW$650, DW_AT_accessibility(DW_ACCESS_public)
    6288              $C$DW$651       .dwtag  DW_TAG_member
    6289                      .dwattr $C$DW$651, DW_AT_type(*$C$DW$T$55)
    6290                      .dwattr $C$DW$651, DW_AT_name("Vdq_out")
    6291                      .dwattr $C$DW$651, DW_AT_TI_symbol_name("_Vdq_out")
    6292                      .dwattr $C$DW$651, DW_AT_data_member_location[DW_OP_plus_uconst 0xc0]
    6293                      .dwattr $C$DW$651, DW_AT_accessibility(DW_ACCESS_public)
    6294              $C$DW$652       .dwtag  DW_TAG_member
    6295                      .dwattr $C$DW$652, DW_AT_type(*$C$DW$T$54)
    6296                      .dwattr $C$DW$652, DW_AT_name("Rhf")
    6297                      .dwattr $C$DW$652, DW_AT_TI_symbol_name("_Rhf")
    6298                      .dwattr $C$DW$652, DW_AT_data_member_location[DW_OP_plus_uconst 0xc4]
    6299                      .dwattr $C$DW$652, DW_AT_accessibility(DW_ACCESS_public)
    6300              $C$DW$653       .dwtag  DW_TAG_member
    6301                      .dwattr $C$DW$653, DW_AT_type(*$C$DW$T$54)
    6302                      .dwattr $C$DW$653, DW_AT_name("Lhf")
    6303                      .dwattr $C$DW$653, DW_AT_TI_symbol_name("_Lhf")
    6304                      .dwattr $C$DW$653, DW_AT_data_member_location[DW_OP_plus_uconst 0xc6]
    6305                      .dwattr $C$DW$653, DW_AT_accessibility(DW_ACCESS_public)
    6306              $C$DW$654       .dwtag  DW_TAG_member
    6307                      .dwattr $C$DW$654, DW_AT_type(*$C$DW$T$54)
    6308                      .dwattr $C$DW$654, DW_AT_name("RoverL")
    6309                      .dwattr $C$DW$654, DW_AT_TI_symbol_name("_RoverL")
    6310                      .dwattr $C$DW$654, DW_AT_data_member_location[DW_OP_plus_uconst 0xc8]
    6311                      .dwattr $C$DW$654, DW_AT_accessibility(DW_ACCESS_public)
    6312              $C$DW$655       .dwtag  DW_TAG_member
    6313                      .dwattr $C$DW$655, DW_AT_type(*$C$DW$T$20)
    6314                      .dwattr $C$DW$655, DW_AT_name("Kp_Id")
    6315                      .dwattr $C$DW$655, DW_AT_TI_symbol_name("_Kp_Id")
    6316                      .dwattr $C$DW$655, DW_AT_data_member_location[DW_OP_plus_uconst 0xca]
    6317                      .dwattr $C$DW$655, DW_AT_accessibility(DW_ACCESS_public)
    6318              $C$DW$656       .dwtag  DW_TAG_member
    6319                      .dwattr $C$DW$656, DW_AT_type(*$C$DW$T$20)
    6320                      .dwattr $C$DW$656, DW_AT_name("Kp_Iq")
    6321                      .dwattr $C$DW$656, DW_AT_TI_symbol_name("_Kp_Iq")
    6322                      .dwattr $C$DW$656, DW_AT_data_member_location[DW_OP_plus_uconst 0xcc]
    6323                      .dwattr $C$DW$656, DW_AT_accessibility(DW_ACCESS_public)
    6324              $C$DW$657       .dwtag  DW_TAG_member
    6325                      .dwattr $C$DW$657, DW_AT_type(*$C$DW$T$20)
    6326                      .dwattr $C$DW$657, DW_AT_name("Kp_spd")
    6327                      .dwattr $C$DW$657, DW_AT_TI_symbol_name("_Kp_spd")
    6328                      .dwattr $C$DW$657, DW_AT_data_member_location[DW_OP_plus_uconst 0xce]
TMS320C2000 Assembler PC v6.2.5 Sat Sep 16 15:52:23 2017

Tools Copyright (c) 1996-2014 Texas Instruments Incorporated
C:\Users\wmj\AppData\Local\Temp\1651210                              PAGE  128

    6329                      .dwattr $C$DW$657, DW_AT_accessibility(DW_ACCESS_public)
    6330              $C$DW$658       .dwtag  DW_TAG_member
    6331                      .dwattr $C$DW$658, DW_AT_type(*$C$DW$T$20)
    6332                      .dwattr $C$DW$658, DW_AT_name("Ki_Id")
    6333                      .dwattr $C$DW$658, DW_AT_TI_symbol_name("_Ki_Id")
    6334                      .dwattr $C$DW$658, DW_AT_data_member_location[DW_OP_plus_uconst 0xd0]
    6335                      .dwattr $C$DW$658, DW_AT_accessibility(DW_ACCESS_public)
    6336              $C$DW$659       .dwtag  DW_TAG_member
    6337                      .dwattr $C$DW$659, DW_AT_type(*$C$DW$T$20)
    6338                      .dwattr $C$DW$659, DW_AT_name("Ki_Iq")
    6339                      .dwattr $C$DW$659, DW_AT_TI_symbol_name("_Ki_Iq")
    6340                      .dwattr $C$DW$659, DW_AT_data_member_location[DW_OP_plus_uconst 0xd2]
    6341                      .dwattr $C$DW$659, DW_AT_accessibility(DW_ACCESS_public)
    6342              $C$DW$660       .dwtag  DW_TAG_member
    6343                      .dwattr $C$DW$660, DW_AT_type(*$C$DW$T$20)
    6344                      .dwattr $C$DW$660, DW_AT_name("Ki_spd")
    6345                      .dwattr $C$DW$660, DW_AT_TI_symbol_name("_Ki_spd")
    6346                      .dwattr $C$DW$660, DW_AT_data_member_location[DW_OP_plus_uconst 0xd4]
    6347                      .dwattr $C$DW$660, DW_AT_accessibility(DW_ACCESS_public)
    6348              $C$DW$661       .dwtag  DW_TAG_member
    6349                      .dwattr $C$DW$661, DW_AT_type(*$C$DW$T$20)
    6350                      .dwattr $C$DW$661, DW_AT_name("Kd_Id")
    6351                      .dwattr $C$DW$661, DW_AT_TI_symbol_name("_Kd_Id")
    6352                      .dwattr $C$DW$661, DW_AT_data_member_location[DW_OP_plus_uconst 0xd6]
    6353                      .dwattr $C$DW$661, DW_AT_accessibility(DW_ACCESS_public)
    6354              $C$DW$662       .dwtag  DW_TAG_member
    6355                      .dwattr $C$DW$662, DW_AT_type(*$C$DW$T$20)
    6356                      .dwattr $C$DW$662, DW_AT_name("Kd_Iq")
    6357                      .dwattr $C$DW$662, DW_AT_TI_symbol_name("_Kd_Iq")
    6358                      .dwattr $C$DW$662, DW_AT_data_member_location[DW_OP_plus_uconst 0xd8]
    6359                      .dwattr $C$DW$662, DW_AT_accessibility(DW_ACCESS_public)
    6360              $C$DW$663       .dwtag  DW_TAG_member
    6361                      .dwattr $C$DW$663, DW_AT_type(*$C$DW$T$20)
    6362                      .dwattr $C$DW$663, DW_AT_name("Kd_spd")
    6363                      .dwattr $C$DW$663, DW_AT_TI_symbol_name("_Kd_spd")
    6364                      .dwattr $C$DW$663, DW_AT_data_member_location[DW_OP_plus_uconst 0xda]
    6365                      .dwattr $C$DW$663, DW_AT_accessibility(DW_ACCESS_public)
    6366              $C$DW$664       .dwtag  DW_TAG_member
    6367                      .dwattr $C$DW$664, DW_AT_type(*$C$DW$T$20)
    6368                      .dwattr $C$DW$664, DW_AT_name("Ui_Id")
    6369                      .dwattr $C$DW$664, DW_AT_TI_symbol_name("_Ui_Id")
    6370                      .dwattr $C$DW$664, DW_AT_data_member_location[DW_OP_plus_uconst 0xdc]
    6371                      .dwattr $C$DW$664, DW_AT_accessibility(DW_ACCESS_public)
    6372              $C$DW$665       .dwtag  DW_TAG_member
    6373                      .dwattr $C$DW$665, DW_AT_type(*$C$DW$T$20)
    6374                      .dwattr $C$DW$665, DW_AT_name("Ui_Iq")
    6375                      .dwattr $C$DW$665, DW_AT_TI_symbol_name("_Ui_Iq")
    6376                      .dwattr $C$DW$665, DW_AT_data_member_location[DW_OP_plus_uconst 0xde]
    6377                      .dwattr $C$DW$665, DW_AT_accessibility(DW_ACCESS_public)
    6378              $C$DW$666       .dwtag  DW_TAG_member
    6379                      .dwattr $C$DW$666, DW_AT_type(*$C$DW$T$20)
    6380                      .dwattr $C$DW$666, DW_AT_name("Ui_spd")
    6381                      .dwattr $C$DW$666, DW_AT_TI_symbol_name("_Ui_spd")
    6382                      .dwattr $C$DW$666, DW_AT_data_member_location[DW_OP_plus_uconst 0xe0]
    6383                      .dwattr $C$DW$666, DW_AT_accessibility(DW_ACCESS_public)
TMS320C2000 Assembler PC v6.2.5 Sat Sep 16 15:52:23 2017

Tools Copyright (c) 1996-2014 Texas Instruments Incorporated
C:\Users\wmj\AppData\Local\Temp\1651210                              PAGE  129

    6384              $C$DW$667       .dwtag  DW_TAG_member
    6385                      .dwattr $C$DW$667, DW_AT_type(*$C$DW$T$55)
    6386                      .dwattr $C$DW$667, DW_AT_name("Idq_ref")
    6387                      .dwattr $C$DW$667, DW_AT_TI_symbol_name("_Idq_ref")
    6388                      .dwattr $C$DW$667, DW_AT_data_member_location[DW_OP_plus_uconst 0xe2]
    6389                      .dwattr $C$DW$667, DW_AT_accessibility(DW_ACCESS_public)
    6390              $C$DW$668       .dwtag  DW_TAG_member
    6391                      .dwattr $C$DW$668, DW_AT_type(*$C$DW$T$20)
    6392                      .dwattr $C$DW$668, DW_AT_name("IdRated")
    6393                      .dwattr $C$DW$668, DW_AT_TI_symbol_name("_IdRated")
    6394                      .dwattr $C$DW$668, DW_AT_data_member_location[DW_OP_plus_uconst 0xe6]
    6395                      .dwattr $C$DW$668, DW_AT_accessibility(DW_ACCESS_public)
    6396              $C$DW$669       .dwtag  DW_TAG_member
    6397                      .dwattr $C$DW$669, DW_AT_type(*$C$DW$T$20)
    6398                      .dwattr $C$DW$669, DW_AT_name("spd_ref")
    6399                      .dwattr $C$DW$669, DW_AT_TI_symbol_name("_spd_ref")
    6400                      .dwattr $C$DW$669, DW_AT_data_member_location[DW_OP_plus_uconst 0xe8]
    6401                      .dwattr $C$DW$669, DW_AT_accessibility(DW_ACCESS_public)
    6402              $C$DW$670       .dwtag  DW_TAG_member
    6403                      .dwattr $C$DW$670, DW_AT_type(*$C$DW$T$20)
    6404                      .dwattr $C$DW$670, DW_AT_name("spd_max")
    6405                      .dwattr $C$DW$670, DW_AT_TI_symbol_name("_spd_max")
    6406                      .dwattr $C$DW$670, DW_AT_data_member_location[DW_OP_plus_uconst 0xea]
    6407                      .dwattr $C$DW$670, DW_AT_accessibility(DW_ACCESS_public)
    6408              $C$DW$671       .dwtag  DW_TAG_member
    6409                      .dwattr $C$DW$671, DW_AT_type(*$C$DW$T$53)
    6410                      .dwattr $C$DW$671, DW_AT_name("counter_current")
    6411                      .dwattr $C$DW$671, DW_AT_TI_symbol_name("_counter_current")
    6412                      .dwattr $C$DW$671, DW_AT_data_member_location[DW_OP_plus_uconst 0xec]
    6413                      .dwattr $C$DW$671, DW_AT_accessibility(DW_ACCESS_public)
    6414              $C$DW$672       .dwtag  DW_TAG_member
    6415                      .dwattr $C$DW$672, DW_AT_type(*$C$DW$T$53)
    6416                      .dwattr $C$DW$672, DW_AT_name("counter_isr")
    6417                      .dwattr $C$DW$672, DW_AT_TI_symbol_name("_counter_isr")
    6418                      .dwattr $C$DW$672, DW_AT_data_member_location[DW_OP_plus_uconst 0xed]
    6419                      .dwattr $C$DW$672, DW_AT_accessibility(DW_ACCESS_public)
    6420              $C$DW$673       .dwtag  DW_TAG_member
    6421                      .dwattr $C$DW$673, DW_AT_type(*$C$DW$T$53)
    6422                      .dwattr $C$DW$673, DW_AT_name("counter_speed")
    6423                      .dwattr $C$DW$673, DW_AT_TI_symbol_name("_counter_speed")
    6424                      .dwattr $C$DW$673, DW_AT_data_member_location[DW_OP_plus_uconst 0xee]
    6425                      .dwattr $C$DW$673, DW_AT_accessibility(DW_ACCESS_public)
    6426              $C$DW$674       .dwtag  DW_TAG_member
    6427                      .dwattr $C$DW$674, DW_AT_type(*$C$DW$T$53)
    6428                      .dwattr $C$DW$674, DW_AT_name("counter_traj")
    6429                      .dwattr $C$DW$674, DW_AT_TI_symbol_name("_counter_traj")
    6430                      .dwattr $C$DW$674, DW_AT_data_member_location[DW_OP_plus_uconst 0xef]
    6431                      .dwattr $C$DW$674, DW_AT_accessibility(DW_ACCESS_public)
    6432              $C$DW$675       .dwtag  DW_TAG_member
    6433                      .dwattr $C$DW$675, DW_AT_type(*$C$DW$T$56)
    6434                      .dwattr $C$DW$675, DW_AT_name("flag_enableCtrl")
    6435                      .dwattr $C$DW$675, DW_AT_TI_symbol_name("_flag_enableCtrl")
    6436                      .dwattr $C$DW$675, DW_AT_data_member_location[DW_OP_plus_uconst 0xf0]
    6437                      .dwattr $C$DW$675, DW_AT_accessibility(DW_ACCESS_public)
    6438              $C$DW$676       .dwtag  DW_TAG_member
TMS320C2000 Assembler PC v6.2.5 Sat Sep 16 15:52:23 2017

Tools Copyright (c) 1996-2014 Texas Instruments Incorporated
C:\Users\wmj\AppData\Local\Temp\1651210                              PAGE  130

    6439                      .dwattr $C$DW$676, DW_AT_type(*$C$DW$T$56)
    6440                      .dwattr $C$DW$676, DW_AT_name("flag_enableDcBusComp")
    6441                      .dwattr $C$DW$676, DW_AT_TI_symbol_name("_flag_enableDcBusComp")
    6442                      .dwattr $C$DW$676, DW_AT_data_member_location[DW_OP_plus_uconst 0xf1]
    6443                      .dwattr $C$DW$676, DW_AT_accessibility(DW_ACCESS_public)
    6444              $C$DW$677       .dwtag  DW_TAG_member
    6445                      .dwattr $C$DW$677, DW_AT_type(*$C$DW$T$56)
    6446                      .dwattr $C$DW$677, DW_AT_name("flag_enablePowerWarp")
    6447                      .dwattr $C$DW$677, DW_AT_TI_symbol_name("_flag_enablePowerWarp")
    6448                      .dwattr $C$DW$677, DW_AT_data_member_location[DW_OP_plus_uconst 0xf2]
    6449                      .dwattr $C$DW$677, DW_AT_accessibility(DW_ACCESS_public)
    6450              $C$DW$678       .dwtag  DW_TAG_member
    6451                      .dwattr $C$DW$678, DW_AT_type(*$C$DW$T$56)
    6452                      .dwattr $C$DW$678, DW_AT_name("flag_enableOffset")
    6453                      .dwattr $C$DW$678, DW_AT_TI_symbol_name("_flag_enableOffset")
    6454                      .dwattr $C$DW$678, DW_AT_data_member_location[DW_OP_plus_uconst 0xf3]
    6455                      .dwattr $C$DW$678, DW_AT_accessibility(DW_ACCESS_public)
    6456              $C$DW$679       .dwtag  DW_TAG_member
    6457                      .dwattr $C$DW$679, DW_AT_type(*$C$DW$T$56)
    6458                      .dwattr $C$DW$679, DW_AT_name("flag_enableSpeedCtrl")
    6459                      .dwattr $C$DW$679, DW_AT_TI_symbol_name("_flag_enableSpeedCtrl")
    6460                      .dwattr $C$DW$679, DW_AT_data_member_location[DW_OP_plus_uconst 0xf4]
    6461                      .dwattr $C$DW$679, DW_AT_accessibility(DW_ACCESS_public)
    6462              $C$DW$680       .dwtag  DW_TAG_member
    6463                      .dwattr $C$DW$680, DW_AT_type(*$C$DW$T$56)
    6464                      .dwattr $C$DW$680, DW_AT_name("flag_enableUserMotorParams")
    6465                      .dwattr $C$DW$680, DW_AT_TI_symbol_name("_flag_enableUserMotorParams")
    6466                      .dwattr $C$DW$680, DW_AT_data_member_location[DW_OP_plus_uconst 0xf5]
    6467                      .dwattr $C$DW$680, DW_AT_accessibility(DW_ACCESS_public)
    6468              $C$DW$681       .dwtag  DW_TAG_member
    6469                      .dwattr $C$DW$681, DW_AT_type(*$C$DW$T$55)
    6470                      .dwattr $C$DW$681, DW_AT_name("Idq_offset_pu")
    6471                      .dwattr $C$DW$681, DW_AT_TI_symbol_name("_Idq_offset_pu")
    6472                      .dwattr $C$DW$681, DW_AT_data_member_location[DW_OP_plus_uconst 0xf6]
    6473                      .dwattr $C$DW$681, DW_AT_accessibility(DW_ACCESS_public)
    6474              $C$DW$682       .dwtag  DW_TAG_member
    6475                      .dwattr $C$DW$682, DW_AT_type(*$C$DW$T$55)
    6476                      .dwattr $C$DW$682, DW_AT_name("Vdq_offset_pu")
    6477                      .dwattr $C$DW$682, DW_AT_TI_symbol_name("_Vdq_offset_pu")
    6478                      .dwattr $C$DW$682, DW_AT_data_member_location[DW_OP_plus_uconst 0xfa]
    6479                      .dwattr $C$DW$682, DW_AT_accessibility(DW_ACCESS_public)
    6480              $C$DW$683       .dwtag  DW_TAG_member
    6481                      .dwattr $C$DW$683, DW_AT_type(*$C$DW$T$20)
    6482                      .dwattr $C$DW$683, DW_AT_name("angle_pu")
    6483                      .dwattr $C$DW$683, DW_AT_TI_symbol_name("_angle_pu")
    6484                      .dwattr $C$DW$683, DW_AT_data_member_location[DW_OP_plus_uconst 0xfe]
    6485                      .dwattr $C$DW$683, DW_AT_accessibility(DW_ACCESS_public)
    6486              $C$DW$684       .dwtag  DW_TAG_member
    6487                      .dwattr $C$DW$684, DW_AT_type(*$C$DW$T$20)
    6488                      .dwattr $C$DW$684, DW_AT_name("speed_ref_pu")
    6489                      .dwattr $C$DW$684, DW_AT_TI_symbol_name("_speed_ref_pu")
    6490                      .dwattr $C$DW$684, DW_AT_data_member_location[DW_OP_plus_uconst 0x100]
    6491                      .dwattr $C$DW$684, DW_AT_accessibility(DW_ACCESS_public)
    6492              $C$DW$685       .dwtag  DW_TAG_member
    6493                      .dwattr $C$DW$685, DW_AT_type(*$C$DW$T$20)
TMS320C2000 Assembler PC v6.2.5 Sat Sep 16 15:52:23 2017

Tools Copyright (c) 1996-2014 Texas Instruments Incorporated
C:\Users\wmj\AppData\Local\Temp\1651210                              PAGE  131

    6494                      .dwattr $C$DW$685, DW_AT_name("speed_fb_pu")
    6495                      .dwattr $C$DW$685, DW_AT_TI_symbol_name("_speed_fb_pu")
    6496                      .dwattr $C$DW$685, DW_AT_data_member_location[DW_OP_plus_uconst 0x102]
    6497                      .dwattr $C$DW$685, DW_AT_accessibility(DW_ACCESS_public)
    6498              $C$DW$686       .dwtag  DW_TAG_member
    6499                      .dwattr $C$DW$686, DW_AT_type(*$C$DW$T$20)
    6500                      .dwattr $C$DW$686, DW_AT_name("speed_outMax_pu")
    6501                      .dwattr $C$DW$686, DW_AT_TI_symbol_name("_speed_outMax_pu")
    6502                      .dwattr $C$DW$686, DW_AT_data_member_location[DW_OP_plus_uconst 0x104]
    6503                      .dwattr $C$DW$686, DW_AT_accessibility(DW_ACCESS_public)
    6504              $C$DW$687       .dwtag  DW_TAG_member
    6505                      .dwattr $C$DW$687, DW_AT_type(*$C$DW$T$56)
    6506                      .dwattr $C$DW$687, DW_AT_name("flag_enableCurrentCtrl")
    6507                      .dwattr $C$DW$687, DW_AT_TI_symbol_name("_flag_enableCurrentCtrl")
    6508                      .dwattr $C$DW$687, DW_AT_data_member_location[DW_OP_plus_uconst 0x106]
    6509                      .dwattr $C$DW$687, DW_AT_accessibility(DW_ACCESS_public)
    6510                      .dwendtag $C$DW$T$57
    6511              
    6512              $C$DW$T$86      .dwtag  DW_TAG_typedef, DW_AT_name("CTRL_Obj")
    6513                      .dwattr $C$DW$T$86, DW_AT_type(*$C$DW$T$57)
    6514                      .dwattr $C$DW$T$86, DW_AT_language(DW_LANG_C)
    6515              $C$DW$T$87      .dwtag  DW_TAG_pointer_type
    6516                      .dwattr $C$DW$T$87, DW_AT_type(*$C$DW$T$57)
    6517                      .dwattr $C$DW$T$87, DW_AT_address_class(0x16)
    6518              $C$DW$T$88      .dwtag  DW_TAG_typedef, DW_AT_name("CTRL_Handle")
    6519                      .dwattr $C$DW$T$88, DW_AT_type(*$C$DW$T$87)
    6520                      .dwattr $C$DW$T$88, DW_AT_language(DW_LANG_C)
    6521              $C$DW$688       .dwtag  DW_TAG_TI_far_type
    6522                      .dwattr $C$DW$688, DW_AT_type(*$C$DW$T$88)
    6523              $C$DW$T$89      .dwtag  DW_TAG_const_type
    6524                      .dwattr $C$DW$T$89, DW_AT_type(*$C$DW$688)
    6525              
    6526              $C$DW$T$60      .dwtag  DW_TAG_structure_type
    6527                      .dwattr $C$DW$T$60, DW_AT_name("_CTRL_Version_")
    6528                      .dwattr $C$DW$T$60, DW_AT_byte_size(0x04)
    6529              $C$DW$689       .dwtag  DW_TAG_member
    6530                      .dwattr $C$DW$689, DW_AT_type(*$C$DW$T$21)
    6531                      .dwattr $C$DW$689, DW_AT_name("rsvd")
    6532                      .dwattr $C$DW$689, DW_AT_TI_symbol_name("_rsvd")
    6533                      .dwattr $C$DW$689, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    6534                      .dwattr $C$DW$689, DW_AT_accessibility(DW_ACCESS_public)
    6535              $C$DW$690       .dwtag  DW_TAG_member
    6536                      .dwattr $C$DW$690, DW_AT_type(*$C$DW$T$59)
    6537                      .dwattr $C$DW$690, DW_AT_name("targetProc")
    6538                      .dwattr $C$DW$690, DW_AT_TI_symbol_name("_targetProc")
    6539                      .dwattr $C$DW$690, DW_AT_data_member_location[DW_OP_plus_uconst 0x1]
    6540                      .dwattr $C$DW$690, DW_AT_accessibility(DW_ACCESS_public)
    6541              $C$DW$691       .dwtag  DW_TAG_member
    6542                      .dwattr $C$DW$691, DW_AT_type(*$C$DW$T$21)
    6543                      .dwattr $C$DW$691, DW_AT_name("major")
    6544                      .dwattr $C$DW$691, DW_AT_TI_symbol_name("_major")
    6545                      .dwattr $C$DW$691, DW_AT_data_member_location[DW_OP_plus_uconst 0x2]
    6546                      .dwattr $C$DW$691, DW_AT_accessibility(DW_ACCESS_public)
    6547              $C$DW$692       .dwtag  DW_TAG_member
    6548                      .dwattr $C$DW$692, DW_AT_type(*$C$DW$T$21)
TMS320C2000 Assembler PC v6.2.5 Sat Sep 16 15:52:23 2017

Tools Copyright (c) 1996-2014 Texas Instruments Incorporated
C:\Users\wmj\AppData\Local\Temp\1651210                              PAGE  132

    6549                      .dwattr $C$DW$692, DW_AT_name("minor")
    6550                      .dwattr $C$DW$692, DW_AT_TI_symbol_name("_minor")
    6551                      .dwattr $C$DW$692, DW_AT_data_member_location[DW_OP_plus_uconst 0x3]
    6552                      .dwattr $C$DW$692, DW_AT_accessibility(DW_ACCESS_public)
    6553                      .dwendtag $C$DW$T$60
    6554              
    6555              $C$DW$T$24      .dwtag  DW_TAG_typedef, DW_AT_name("CTRL_Version")
    6556                      .dwattr $C$DW$T$24, DW_AT_type(*$C$DW$T$60)
    6557                      .dwattr $C$DW$T$24, DW_AT_language(DW_LANG_C)
    6558              
    6559              $C$DW$T$19      .dwtag  DW_TAG_structure_type
    6560                      .dwattr $C$DW$T$19, DW_AT_name("_EST_Obj_")
    6561                      .dwattr $C$DW$T$19, DW_AT_declaration
    6562                      .dwendtag $C$DW$T$19
    6563              
    6564              $C$DW$T$32      .dwtag  DW_TAG_pointer_type
    6565                      .dwattr $C$DW$T$32, DW_AT_type(*$C$DW$T$19)
    6566                      .dwattr $C$DW$T$32, DW_AT_address_class(0x16)
    6567              $C$DW$T$33      .dwtag  DW_TAG_typedef, DW_AT_name("EST_Handle")
    6568                      .dwattr $C$DW$T$33, DW_AT_type(*$C$DW$T$32)
    6569                      .dwattr $C$DW$T$33, DW_AT_language(DW_LANG_C)
    6570              
    6571              $C$DW$T$61      .dwtag  DW_TAG_structure_type
    6572                      .dwattr $C$DW$T$61, DW_AT_name("_IPARK_Obj_")
    6573                      .dwattr $C$DW$T$61, DW_AT_byte_size(0x04)
    6574              $C$DW$693       .dwtag  DW_TAG_member
    6575                      .dwattr $C$DW$693, DW_AT_type(*$C$DW$T$20)
    6576                      .dwattr $C$DW$693, DW_AT_name("sinTh")
    6577                      .dwattr $C$DW$693, DW_AT_TI_symbol_name("_sinTh")
    6578                      .dwattr $C$DW$693, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    6579                      .dwattr $C$DW$693, DW_AT_accessibility(DW_ACCESS_public)
    6580              $C$DW$694       .dwtag  DW_TAG_member
    6581                      .dwattr $C$DW$694, DW_AT_type(*$C$DW$T$20)
    6582                      .dwattr $C$DW$694, DW_AT_name("cosTh")
    6583                      .dwattr $C$DW$694, DW_AT_TI_symbol_name("_cosTh")
    6584                      .dwattr $C$DW$694, DW_AT_data_member_location[DW_OP_plus_uconst 0x2]
    6585                      .dwattr $C$DW$694, DW_AT_accessibility(DW_ACCESS_public)
    6586                      .dwendtag $C$DW$T$61
    6587              
    6588              $C$DW$T$42      .dwtag  DW_TAG_typedef, DW_AT_name("IPARK_Obj")
    6589                      .dwattr $C$DW$T$42, DW_AT_type(*$C$DW$T$61)
    6590                      .dwattr $C$DW$T$42, DW_AT_language(DW_LANG_C)
    6591              $C$DW$T$40      .dwtag  DW_TAG_pointer_type
    6592                      .dwattr $C$DW$T$40, DW_AT_type(*$C$DW$T$61)
    6593                      .dwattr $C$DW$T$40, DW_AT_address_class(0x16)
    6594              $C$DW$T$41      .dwtag  DW_TAG_typedef, DW_AT_name("IPARK_Handle")
    6595                      .dwattr $C$DW$T$41, DW_AT_type(*$C$DW$T$40)
    6596                      .dwattr $C$DW$T$41, DW_AT_language(DW_LANG_C)
    6597              
    6598              $C$DW$T$63      .dwtag  DW_TAG_structure_type
    6599                      .dwattr $C$DW$T$63, DW_AT_name("_MATH_vec2_")
    6600                      .dwattr $C$DW$T$63, DW_AT_byte_size(0x04)
    6601              $C$DW$695       .dwtag  DW_TAG_member
    6602                      .dwattr $C$DW$695, DW_AT_type(*$C$DW$T$62)
    6603                      .dwattr $C$DW$695, DW_AT_name("value")
TMS320C2000 Assembler PC v6.2.5 Sat Sep 16 15:52:23 2017

Tools Copyright (c) 1996-2014 Texas Instruments Incorporated
C:\Users\wmj\AppData\Local\Temp\1651210                              PAGE  133

    6604                      .dwattr $C$DW$695, DW_AT_TI_symbol_name("_value")
    6605                      .dwattr $C$DW$695, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    6606                      .dwattr $C$DW$695, DW_AT_accessibility(DW_ACCESS_public)
    6607                      .dwendtag $C$DW$T$63
    6608              
    6609              $C$DW$T$55      .dwtag  DW_TAG_typedef, DW_AT_name("MATH_vec2")
    6610                      .dwattr $C$DW$T$55, DW_AT_type(*$C$DW$T$63)
    6611                      .dwattr $C$DW$T$55, DW_AT_language(DW_LANG_C)
    6612              
    6613              $C$DW$T$66      .dwtag  DW_TAG_structure_type
    6614                      .dwattr $C$DW$T$66, DW_AT_name("_MOTOR_Params_")
    6615                      .dwattr $C$DW$T$66, DW_AT_byte_size(0x0e)
    6616              $C$DW$696       .dwtag  DW_TAG_member
    6617                      .dwattr $C$DW$696, DW_AT_type(*$C$DW$T$65)
    6618                      .dwattr $C$DW$696, DW_AT_name("type")
    6619                      .dwattr $C$DW$696, DW_AT_TI_symbol_name("_type")
    6620                      .dwattr $C$DW$696, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    6621                      .dwattr $C$DW$696, DW_AT_accessibility(DW_ACCESS_public)
    6622              $C$DW$697       .dwtag  DW_TAG_member
    6623                      .dwattr $C$DW$697, DW_AT_type(*$C$DW$T$53)
    6624                      .dwattr $C$DW$697, DW_AT_name("numPolePairs")
    6625                      .dwattr $C$DW$697, DW_AT_TI_symbol_name("_numPolePairs")
    6626                      .dwattr $C$DW$697, DW_AT_data_member_location[DW_OP_plus_uconst 0x1]
    6627                      .dwattr $C$DW$697, DW_AT_accessibility(DW_ACCESS_public)
    6628              $C$DW$698       .dwtag  DW_TAG_member
    6629                      .dwattr $C$DW$698, DW_AT_type(*$C$DW$T$54)
    6630                      .dwattr $C$DW$698, DW_AT_name("Lr_H")
    6631                      .dwattr $C$DW$698, DW_AT_TI_symbol_name("_Lr_H")
    6632                      .dwattr $C$DW$698, DW_AT_data_member_location[DW_OP_plus_uconst 0x2]
    6633                      .dwattr $C$DW$698, DW_AT_accessibility(DW_ACCESS_public)
    6634              $C$DW$699       .dwtag  DW_TAG_member
    6635                      .dwattr $C$DW$699, DW_AT_type(*$C$DW$T$54)
    6636                      .dwattr $C$DW$699, DW_AT_name("Ls_d_H")
    6637                      .dwattr $C$DW$699, DW_AT_TI_symbol_name("_Ls_d_H")
    6638                      .dwattr $C$DW$699, DW_AT_data_member_location[DW_OP_plus_uconst 0x4]
    6639                      .dwattr $C$DW$699, DW_AT_accessibility(DW_ACCESS_public)
    6640              $C$DW$700       .dwtag  DW_TAG_member
    6641                      .dwattr $C$DW$700, DW_AT_type(*$C$DW$T$54)
    6642                      .dwattr $C$DW$700, DW_AT_name("Ls_q_H")
    6643                      .dwattr $C$DW$700, DW_AT_TI_symbol_name("_Ls_q_H")
    6644                      .dwattr $C$DW$700, DW_AT_data_member_location[DW_OP_plus_uconst 0x6]
    6645                      .dwattr $C$DW$700, DW_AT_accessibility(DW_ACCESS_public)
    6646              $C$DW$701       .dwtag  DW_TAG_member
    6647                      .dwattr $C$DW$701, DW_AT_type(*$C$DW$T$54)
    6648                      .dwattr $C$DW$701, DW_AT_name("Rr_Ohm")
    6649                      .dwattr $C$DW$701, DW_AT_TI_symbol_name("_Rr_Ohm")
    6650                      .dwattr $C$DW$701, DW_AT_data_member_location[DW_OP_plus_uconst 0x8]
    6651                      .dwattr $C$DW$701, DW_AT_accessibility(DW_ACCESS_public)
    6652              $C$DW$702       .dwtag  DW_TAG_member
    6653                      .dwattr $C$DW$702, DW_AT_type(*$C$DW$T$54)
    6654                      .dwattr $C$DW$702, DW_AT_name("Rs_Ohm")
    6655                      .dwattr $C$DW$702, DW_AT_TI_symbol_name("_Rs_Ohm")
    6656                      .dwattr $C$DW$702, DW_AT_data_member_location[DW_OP_plus_uconst 0xa]
    6657                      .dwattr $C$DW$702, DW_AT_accessibility(DW_ACCESS_public)
    6658              $C$DW$703       .dwtag  DW_TAG_member
TMS320C2000 Assembler PC v6.2.5 Sat Sep 16 15:52:23 2017

Tools Copyright (c) 1996-2014 Texas Instruments Incorporated
C:\Users\wmj\AppData\Local\Temp\1651210                              PAGE  134

    6659                      .dwattr $C$DW$703, DW_AT_type(*$C$DW$T$54)
    6660                      .dwattr $C$DW$703, DW_AT_name("ratedFlux_VpHz")
    6661                      .dwattr $C$DW$703, DW_AT_TI_symbol_name("_ratedFlux_VpHz")
    6662                      .dwattr $C$DW$703, DW_AT_data_member_location[DW_OP_plus_uconst 0xc]
    6663                      .dwattr $C$DW$703, DW_AT_accessibility(DW_ACCESS_public)
    6664                      .dwendtag $C$DW$T$66
    6665              
    6666              $C$DW$T$49      .dwtag  DW_TAG_typedef, DW_AT_name("MOTOR_Params")
    6667                      .dwattr $C$DW$T$49, DW_AT_type(*$C$DW$T$66)
    6668                      .dwattr $C$DW$T$49, DW_AT_language(DW_LANG_C)
    6669              
    6670              $C$DW$T$67      .dwtag  DW_TAG_structure_type
    6671                      .dwattr $C$DW$T$67, DW_AT_name("_PARK_Obj_")
    6672                      .dwattr $C$DW$T$67, DW_AT_byte_size(0x04)
    6673              $C$DW$704       .dwtag  DW_TAG_member
    6674                      .dwattr $C$DW$704, DW_AT_type(*$C$DW$T$20)
    6675                      .dwattr $C$DW$704, DW_AT_name("sinTh")
    6676                      .dwattr $C$DW$704, DW_AT_TI_symbol_name("_sinTh")
    6677                      .dwattr $C$DW$704, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    6678                      .dwattr $C$DW$704, DW_AT_accessibility(DW_ACCESS_public)
    6679              $C$DW$705       .dwtag  DW_TAG_member
    6680                      .dwattr $C$DW$705, DW_AT_type(*$C$DW$T$20)
    6681                      .dwattr $C$DW$705, DW_AT_name("cosTh")
    6682                      .dwattr $C$DW$705, DW_AT_TI_symbol_name("_cosTh")
    6683                      .dwattr $C$DW$705, DW_AT_data_member_location[DW_OP_plus_uconst 0x2]
    6684                      .dwattr $C$DW$705, DW_AT_accessibility(DW_ACCESS_public)
    6685                      .dwendtag $C$DW$T$67
    6686              
    6687              $C$DW$T$36      .dwtag  DW_TAG_typedef, DW_AT_name("PARK_Obj")
    6688                      .dwattr $C$DW$T$36, DW_AT_type(*$C$DW$T$67)
    6689                      .dwattr $C$DW$T$36, DW_AT_language(DW_LANG_C)
    6690              $C$DW$T$34      .dwtag  DW_TAG_pointer_type
    6691                      .dwattr $C$DW$T$34, DW_AT_type(*$C$DW$T$67)
    6692                      .dwattr $C$DW$T$34, DW_AT_address_class(0x16)
    6693              $C$DW$T$35      .dwtag  DW_TAG_typedef, DW_AT_name("PARK_Handle")
    6694                      .dwattr $C$DW$T$35, DW_AT_type(*$C$DW$T$34)
    6695                      .dwattr $C$DW$T$35, DW_AT_language(DW_LANG_C)
    6696              
    6697              $C$DW$T$68      .dwtag  DW_TAG_structure_type
    6698                      .dwattr $C$DW$T$68, DW_AT_name("_PID_Obj_")
    6699                      .dwattr $C$DW$T$68, DW_AT_byte_size(0x10)
    6700              $C$DW$706       .dwtag  DW_TAG_member
    6701                      .dwattr $C$DW$706, DW_AT_type(*$C$DW$T$20)
    6702                      .dwattr $C$DW$706, DW_AT_name("Kp")
    6703                      .dwattr $C$DW$706, DW_AT_TI_symbol_name("_Kp")
    6704                      .dwattr $C$DW$706, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    6705                      .dwattr $C$DW$706, DW_AT_accessibility(DW_ACCESS_public)
    6706              $C$DW$707       .dwtag  DW_TAG_member
    6707                      .dwattr $C$DW$707, DW_AT_type(*$C$DW$T$20)
    6708                      .dwattr $C$DW$707, DW_AT_name("Ki")
    6709                      .dwattr $C$DW$707, DW_AT_TI_symbol_name("_Ki")
    6710                      .dwattr $C$DW$707, DW_AT_data_member_location[DW_OP_plus_uconst 0x2]
    6711                      .dwattr $C$DW$707, DW_AT_accessibility(DW_ACCESS_public)
    6712              $C$DW$708       .dwtag  DW_TAG_member
    6713                      .dwattr $C$DW$708, DW_AT_type(*$C$DW$T$20)
TMS320C2000 Assembler PC v6.2.5 Sat Sep 16 15:52:23 2017

Tools Copyright (c) 1996-2014 Texas Instruments Incorporated
C:\Users\wmj\AppData\Local\Temp\1651210                              PAGE  135

    6714                      .dwattr $C$DW$708, DW_AT_name("Kd")
    6715                      .dwattr $C$DW$708, DW_AT_TI_symbol_name("_Kd")
    6716                      .dwattr $C$DW$708, DW_AT_data_member_location[DW_OP_plus_uconst 0x4]
    6717                      .dwattr $C$DW$708, DW_AT_accessibility(DW_ACCESS_public)
    6718              $C$DW$709       .dwtag  DW_TAG_member
    6719                      .dwattr $C$DW$709, DW_AT_type(*$C$DW$T$20)
    6720                      .dwattr $C$DW$709, DW_AT_name("Ui")
    6721                      .dwattr $C$DW$709, DW_AT_TI_symbol_name("_Ui")
    6722                      .dwattr $C$DW$709, DW_AT_data_member_location[DW_OP_plus_uconst 0x6]
    6723                      .dwattr $C$DW$709, DW_AT_accessibility(DW_ACCESS_public)
    6724              $C$DW$710       .dwtag  DW_TAG_member
    6725                      .dwattr $C$DW$710, DW_AT_type(*$C$DW$T$20)
    6726                      .dwattr $C$DW$710, DW_AT_name("refValue")
    6727                      .dwattr $C$DW$710, DW_AT_TI_symbol_name("_refValue")
    6728                      .dwattr $C$DW$710, DW_AT_data_member_location[DW_OP_plus_uconst 0x8]
    6729                      .dwattr $C$DW$710, DW_AT_accessibility(DW_ACCESS_public)
    6730              $C$DW$711       .dwtag  DW_TAG_member
    6731                      .dwattr $C$DW$711, DW_AT_type(*$C$DW$T$20)
    6732                      .dwattr $C$DW$711, DW_AT_name("fbackValue")
    6733                      .dwattr $C$DW$711, DW_AT_TI_symbol_name("_fbackValue")
    6734                      .dwattr $C$DW$711, DW_AT_data_member_location[DW_OP_plus_uconst 0xa]
    6735                      .dwattr $C$DW$711, DW_AT_accessibility(DW_ACCESS_public)
    6736              $C$DW$712       .dwtag  DW_TAG_member
    6737                      .dwattr $C$DW$712, DW_AT_type(*$C$DW$T$20)
    6738                      .dwattr $C$DW$712, DW_AT_name("outMin")
    6739                      .dwattr $C$DW$712, DW_AT_TI_symbol_name("_outMin")
    6740                      .dwattr $C$DW$712, DW_AT_data_member_location[DW_OP_plus_uconst 0xc]
    6741                      .dwattr $C$DW$712, DW_AT_accessibility(DW_ACCESS_public)
    6742              $C$DW$713       .dwtag  DW_TAG_member
    6743                      .dwattr $C$DW$713, DW_AT_type(*$C$DW$T$20)
    6744                      .dwattr $C$DW$713, DW_AT_name("outMax")
    6745                      .dwattr $C$DW$713, DW_AT_TI_symbol_name("_outMax")
    6746                      .dwattr $C$DW$713, DW_AT_data_member_location[DW_OP_plus_uconst 0xe]
    6747                      .dwattr $C$DW$713, DW_AT_accessibility(DW_ACCESS_public)
    6748                      .dwendtag $C$DW$T$68
    6749              
    6750              $C$DW$T$39      .dwtag  DW_TAG_typedef, DW_AT_name("PID_Obj")
    6751                      .dwattr $C$DW$T$39, DW_AT_type(*$C$DW$T$68)
    6752                      .dwattr $C$DW$T$39, DW_AT_language(DW_LANG_C)
    6753              $C$DW$T$37      .dwtag  DW_TAG_pointer_type
    6754                      .dwattr $C$DW$T$37, DW_AT_type(*$C$DW$T$68)
    6755                      .dwattr $C$DW$T$37, DW_AT_address_class(0x16)
    6756              $C$DW$T$38      .dwtag  DW_TAG_typedef, DW_AT_name("PID_Handle")
    6757                      .dwattr $C$DW$T$38, DW_AT_type(*$C$DW$T$37)
    6758                      .dwattr $C$DW$T$38, DW_AT_language(DW_LANG_C)
    6759              
    6760              $C$DW$T$69      .dwtag  DW_TAG_structure_type
    6761                      .dwattr $C$DW$T$69, DW_AT_name("_SVGEN_Obj_")
    6762                      .dwattr $C$DW$T$69, DW_AT_byte_size(0x02)
    6763              $C$DW$714       .dwtag  DW_TAG_member
    6764                      .dwattr $C$DW$714, DW_AT_type(*$C$DW$T$20)
    6765                      .dwattr $C$DW$714, DW_AT_name("maxModulation")
    6766                      .dwattr $C$DW$714, DW_AT_TI_symbol_name("_maxModulation")
    6767                      .dwattr $C$DW$714, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    6768                      .dwattr $C$DW$714, DW_AT_accessibility(DW_ACCESS_public)
TMS320C2000 Assembler PC v6.2.5 Sat Sep 16 15:52:23 2017

Tools Copyright (c) 1996-2014 Texas Instruments Incorporated
C:\Users\wmj\AppData\Local\Temp\1651210                              PAGE  136

    6769                      .dwendtag $C$DW$T$69
    6770              
    6771              $C$DW$T$45      .dwtag  DW_TAG_typedef, DW_AT_name("SVGEN_Obj")
    6772                      .dwattr $C$DW$T$45, DW_AT_type(*$C$DW$T$69)
    6773                      .dwattr $C$DW$T$45, DW_AT_language(DW_LANG_C)
    6774              $C$DW$T$43      .dwtag  DW_TAG_pointer_type
    6775                      .dwattr $C$DW$T$43, DW_AT_type(*$C$DW$T$69)
    6776                      .dwattr $C$DW$T$43, DW_AT_address_class(0x16)
    6777              $C$DW$T$44      .dwtag  DW_TAG_typedef, DW_AT_name("SVGEN_Handle")
    6778                      .dwattr $C$DW$T$44, DW_AT_type(*$C$DW$T$43)
    6779                      .dwattr $C$DW$T$44, DW_AT_language(DW_LANG_C)
    6780              
    6781              $C$DW$T$70      .dwtag  DW_TAG_structure_type
    6782                      .dwattr $C$DW$T$70, DW_AT_name("_TRAJ_Obj_")
    6783                      .dwattr $C$DW$T$70, DW_AT_byte_size(0x0a)
    6784              $C$DW$715       .dwtag  DW_TAG_member
    6785                      .dwattr $C$DW$715, DW_AT_type(*$C$DW$T$20)
    6786                      .dwattr $C$DW$715, DW_AT_name("targetValue")
    6787                      .dwattr $C$DW$715, DW_AT_TI_symbol_name("_targetValue")
    6788                      .dwattr $C$DW$715, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    6789                      .dwattr $C$DW$715, DW_AT_accessibility(DW_ACCESS_public)
    6790              $C$DW$716       .dwtag  DW_TAG_member
    6791                      .dwattr $C$DW$716, DW_AT_type(*$C$DW$T$20)
    6792                      .dwattr $C$DW$716, DW_AT_name("intValue")
    6793                      .dwattr $C$DW$716, DW_AT_TI_symbol_name("_intValue")
    6794                      .dwattr $C$DW$716, DW_AT_data_member_location[DW_OP_plus_uconst 0x2]
    6795                      .dwattr $C$DW$716, DW_AT_accessibility(DW_ACCESS_public)
    6796              $C$DW$717       .dwtag  DW_TAG_member
    6797                      .dwattr $C$DW$717, DW_AT_type(*$C$DW$T$20)
    6798                      .dwattr $C$DW$717, DW_AT_name("minValue")
    6799                      .dwattr $C$DW$717, DW_AT_TI_symbol_name("_minValue")
    6800                      .dwattr $C$DW$717, DW_AT_data_member_location[DW_OP_plus_uconst 0x4]
    6801                      .dwattr $C$DW$717, DW_AT_accessibility(DW_ACCESS_public)
    6802              $C$DW$718       .dwtag  DW_TAG_member
    6803                      .dwattr $C$DW$718, DW_AT_type(*$C$DW$T$20)
    6804                      .dwattr $C$DW$718, DW_AT_name("maxValue")
    6805                      .dwattr $C$DW$718, DW_AT_TI_symbol_name("_maxValue")
    6806                      .dwattr $C$DW$718, DW_AT_data_member_location[DW_OP_plus_uconst 0x6]
    6807                      .dwattr $C$DW$718, DW_AT_accessibility(DW_ACCESS_public)
    6808              $C$DW$719       .dwtag  DW_TAG_member
    6809                      .dwattr $C$DW$719, DW_AT_type(*$C$DW$T$20)
    6810                      .dwattr $C$DW$719, DW_AT_name("maxDelta")
    6811                      .dwattr $C$DW$719, DW_AT_TI_symbol_name("_maxDelta")
    6812                      .dwattr $C$DW$719, DW_AT_data_member_location[DW_OP_plus_uconst 0x8]
    6813                      .dwattr $C$DW$719, DW_AT_accessibility(DW_ACCESS_public)
    6814                      .dwendtag $C$DW$T$70
    6815              
    6816              $C$DW$T$48      .dwtag  DW_TAG_typedef, DW_AT_name("TRAJ_Obj")
    6817                      .dwattr $C$DW$T$48, DW_AT_type(*$C$DW$T$70)
    6818                      .dwattr $C$DW$T$48, DW_AT_language(DW_LANG_C)
    6819              $C$DW$T$46      .dwtag  DW_TAG_pointer_type
    6820                      .dwattr $C$DW$T$46, DW_AT_type(*$C$DW$T$70)
    6821                      .dwattr $C$DW$T$46, DW_AT_address_class(0x16)
    6822              $C$DW$T$47      .dwtag  DW_TAG_typedef, DW_AT_name("TRAJ_Handle")
    6823                      .dwattr $C$DW$T$47, DW_AT_type(*$C$DW$T$46)
TMS320C2000 Assembler PC v6.2.5 Sat Sep 16 15:52:23 2017

Tools Copyright (c) 1996-2014 Texas Instruments Incorporated
C:\Users\wmj\AppData\Local\Temp\1651210                              PAGE  137

    6824                      .dwattr $C$DW$T$47, DW_AT_language(DW_LANG_C)
    6825              
    6826              $C$DW$T$76      .dwtag  DW_TAG_structure_type
    6827                      .dwattr $C$DW$T$76, DW_AT_name("_USER_Params_")
    6828                      .dwattr $C$DW$T$76, DW_AT_byte_size(0xac)
    6829              $C$DW$720       .dwtag  DW_TAG_member
    6830                      .dwattr $C$DW$720, DW_AT_type(*$C$DW$T$54)
    6831                      .dwattr $C$DW$720, DW_AT_name("iqFullScaleCurrent_A")
    6832                      .dwattr $C$DW$720, DW_AT_TI_symbol_name("_iqFullScaleCurrent_A")
    6833                      .dwattr $C$DW$720, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    6834                      .dwattr $C$DW$720, DW_AT_accessibility(DW_ACCESS_public)
    6835              $C$DW$721       .dwtag  DW_TAG_member
    6836                      .dwattr $C$DW$721, DW_AT_type(*$C$DW$T$54)
    6837                      .dwattr $C$DW$721, DW_AT_name("iqFullScaleVoltage_V")
    6838                      .dwattr $C$DW$721, DW_AT_TI_symbol_name("_iqFullScaleVoltage_V")
    6839                      .dwattr $C$DW$721, DW_AT_data_member_location[DW_OP_plus_uconst 0x2]
    6840                      .dwattr $C$DW$721, DW_AT_accessibility(DW_ACCESS_public)
    6841              $C$DW$722       .dwtag  DW_TAG_member
    6842                      .dwattr $C$DW$722, DW_AT_type(*$C$DW$T$54)
    6843                      .dwattr $C$DW$722, DW_AT_name("iqFullScaleFreq_Hz")
    6844                      .dwattr $C$DW$722, DW_AT_TI_symbol_name("_iqFullScaleFreq_Hz")
    6845                      .dwattr $C$DW$722, DW_AT_data_member_location[DW_OP_plus_uconst 0x4]
    6846                      .dwattr $C$DW$722, DW_AT_accessibility(DW_ACCESS_public)
    6847              $C$DW$723       .dwtag  DW_TAG_member
    6848                      .dwattr $C$DW$723, DW_AT_type(*$C$DW$T$53)
    6849                      .dwattr $C$DW$723, DW_AT_name("numIsrTicksPerCtrlTick")
    6850                      .dwattr $C$DW$723, DW_AT_TI_symbol_name("_numIsrTicksPerCtrlTick")
    6851                      .dwattr $C$DW$723, DW_AT_data_member_location[DW_OP_plus_uconst 0x6]
    6852                      .dwattr $C$DW$723, DW_AT_accessibility(DW_ACCESS_public)
    6853              $C$DW$724       .dwtag  DW_TAG_member
    6854                      .dwattr $C$DW$724, DW_AT_type(*$C$DW$T$53)
    6855                      .dwattr $C$DW$724, DW_AT_name("numCtrlTicksPerCurrentTick")
    6856                      .dwattr $C$DW$724, DW_AT_TI_symbol_name("_numCtrlTicksPerCurrentTick")
    6857                      .dwattr $C$DW$724, DW_AT_data_member_location[DW_OP_plus_uconst 0x7]
    6858                      .dwattr $C$DW$724, DW_AT_accessibility(DW_ACCESS_public)
    6859              $C$DW$725       .dwtag  DW_TAG_member
    6860                      .dwattr $C$DW$725, DW_AT_type(*$C$DW$T$53)
    6861                      .dwattr $C$DW$725, DW_AT_name("numCtrlTicksPerEstTick")
    6862                      .dwattr $C$DW$725, DW_AT_TI_symbol_name("_numCtrlTicksPerEstTick")
    6863                      .dwattr $C$DW$725, DW_AT_data_member_location[DW_OP_plus_uconst 0x8]
    6864                      .dwattr $C$DW$725, DW_AT_accessibility(DW_ACCESS_public)
    6865              $C$DW$726       .dwtag  DW_TAG_member
    6866                      .dwattr $C$DW$726, DW_AT_type(*$C$DW$T$53)
    6867                      .dwattr $C$DW$726, DW_AT_name("numCtrlTicksPerSpeedTick")
    6868                      .dwattr $C$DW$726, DW_AT_TI_symbol_name("_numCtrlTicksPerSpeedTick")
    6869                      .dwattr $C$DW$726, DW_AT_data_member_location[DW_OP_plus_uconst 0x9]
    6870                      .dwattr $C$DW$726, DW_AT_accessibility(DW_ACCESS_public)
    6871              $C$DW$727       .dwtag  DW_TAG_member
    6872                      .dwattr $C$DW$727, DW_AT_type(*$C$DW$T$53)
    6873                      .dwattr $C$DW$727, DW_AT_name("numCtrlTicksPerTrajTick")
    6874                      .dwattr $C$DW$727, DW_AT_TI_symbol_name("_numCtrlTicksPerTrajTick")
    6875                      .dwattr $C$DW$727, DW_AT_data_member_location[DW_OP_plus_uconst 0xa]
    6876                      .dwattr $C$DW$727, DW_AT_accessibility(DW_ACCESS_public)
    6877              $C$DW$728       .dwtag  DW_TAG_member
    6878                      .dwattr $C$DW$728, DW_AT_type(*$C$DW$T$22)
TMS320C2000 Assembler PC v6.2.5 Sat Sep 16 15:52:23 2017

Tools Copyright (c) 1996-2014 Texas Instruments Incorporated
C:\Users\wmj\AppData\Local\Temp\1651210                              PAGE  138

    6879                      .dwattr $C$DW$728, DW_AT_name("numCurrentSensors")
    6880                      .dwattr $C$DW$728, DW_AT_TI_symbol_name("_numCurrentSensors")
    6881                      .dwattr $C$DW$728, DW_AT_data_member_location[DW_OP_plus_uconst 0xb]
    6882                      .dwattr $C$DW$728, DW_AT_accessibility(DW_ACCESS_public)
    6883              $C$DW$729       .dwtag  DW_TAG_member
    6884                      .dwattr $C$DW$729, DW_AT_type(*$C$DW$T$22)
    6885                      .dwattr $C$DW$729, DW_AT_name("numVoltageSensors")
    6886                      .dwattr $C$DW$729, DW_AT_TI_symbol_name("_numVoltageSensors")
    6887                      .dwattr $C$DW$729, DW_AT_data_member_location[DW_OP_plus_uconst 0xc]
    6888                      .dwattr $C$DW$729, DW_AT_accessibility(DW_ACCESS_public)
    6889              $C$DW$730       .dwtag  DW_TAG_member
    6890                      .dwattr $C$DW$730, DW_AT_type(*$C$DW$T$54)
    6891                      .dwattr $C$DW$730, DW_AT_name("offsetPole_rps")
    6892                      .dwattr $C$DW$730, DW_AT_TI_symbol_name("_offsetPole_rps")
    6893                      .dwattr $C$DW$730, DW_AT_data_member_location[DW_OP_plus_uconst 0xe]
    6894                      .dwattr $C$DW$730, DW_AT_accessibility(DW_ACCESS_public)
    6895              $C$DW$731       .dwtag  DW_TAG_member
    6896                      .dwattr $C$DW$731, DW_AT_type(*$C$DW$T$54)
    6897                      .dwattr $C$DW$731, DW_AT_name("fluxPole_rps")
    6898                      .dwattr $C$DW$731, DW_AT_TI_symbol_name("_fluxPole_rps")
    6899                      .dwattr $C$DW$731, DW_AT_data_member_location[DW_OP_plus_uconst 0x10]
    6900                      .dwattr $C$DW$731, DW_AT_accessibility(DW_ACCESS_public)
    6901              $C$DW$732       .dwtag  DW_TAG_member
    6902                      .dwattr $C$DW$732, DW_AT_type(*$C$DW$T$54)
    6903                      .dwattr $C$DW$732, DW_AT_name("zeroSpeedLimit")
    6904                      .dwattr $C$DW$732, DW_AT_TI_symbol_name("_zeroSpeedLimit")
    6905                      .dwattr $C$DW$732, DW_AT_data_member_location[DW_OP_plus_uconst 0x12]
    6906                      .dwattr $C$DW$732, DW_AT_accessibility(DW_ACCESS_public)
    6907              $C$DW$733       .dwtag  DW_TAG_member
    6908                      .dwattr $C$DW$733, DW_AT_type(*$C$DW$T$54)
    6909                      .dwattr $C$DW$733, DW_AT_name("forceAngleFreq_Hz")
    6910                      .dwattr $C$DW$733, DW_AT_TI_symbol_name("_forceAngleFreq_Hz")
    6911                      .dwattr $C$DW$733, DW_AT_data_member_location[DW_OP_plus_uconst 0x14]
    6912                      .dwattr $C$DW$733, DW_AT_accessibility(DW_ACCESS_public)
    6913              $C$DW$734       .dwtag  DW_TAG_member
    6914                      .dwattr $C$DW$734, DW_AT_type(*$C$DW$T$54)
    6915                      .dwattr $C$DW$734, DW_AT_name("maxAccel_Hzps")
    6916                      .dwattr $C$DW$734, DW_AT_TI_symbol_name("_maxAccel_Hzps")
    6917                      .dwattr $C$DW$734, DW_AT_data_member_location[DW_OP_plus_uconst 0x16]
    6918                      .dwattr $C$DW$734, DW_AT_accessibility(DW_ACCESS_public)
    6919              $C$DW$735       .dwtag  DW_TAG_member
    6920                      .dwattr $C$DW$735, DW_AT_type(*$C$DW$T$54)
    6921                      .dwattr $C$DW$735, DW_AT_name("maxAccel_est_Hzps")
    6922                      .dwattr $C$DW$735, DW_AT_TI_symbol_name("_maxAccel_est_Hzps")
    6923                      .dwattr $C$DW$735, DW_AT_data_member_location[DW_OP_plus_uconst 0x18]
    6924                      .dwattr $C$DW$735, DW_AT_accessibility(DW_ACCESS_public)
    6925              $C$DW$736       .dwtag  DW_TAG_member
    6926                      .dwattr $C$DW$736, DW_AT_type(*$C$DW$T$54)
    6927                      .dwattr $C$DW$736, DW_AT_name("directionPole_rps")
    6928                      .dwattr $C$DW$736, DW_AT_TI_symbol_name("_directionPole_rps")
    6929                      .dwattr $C$DW$736, DW_AT_data_member_location[DW_OP_plus_uconst 0x1a]
    6930                      .dwattr $C$DW$736, DW_AT_accessibility(DW_ACCESS_public)
    6931              $C$DW$737       .dwtag  DW_TAG_member
    6932                      .dwattr $C$DW$737, DW_AT_type(*$C$DW$T$54)
    6933                      .dwattr $C$DW$737, DW_AT_name("speedPole_rps")
TMS320C2000 Assembler PC v6.2.5 Sat Sep 16 15:52:23 2017

Tools Copyright (c) 1996-2014 Texas Instruments Incorporated
C:\Users\wmj\AppData\Local\Temp\1651210                              PAGE  139

    6934                      .dwattr $C$DW$737, DW_AT_TI_symbol_name("_speedPole_rps")
    6935                      .dwattr $C$DW$737, DW_AT_data_member_location[DW_OP_plus_uconst 0x1c]
    6936                      .dwattr $C$DW$737, DW_AT_accessibility(DW_ACCESS_public)
    6937              $C$DW$738       .dwtag  DW_TAG_member
    6938                      .dwattr $C$DW$738, DW_AT_type(*$C$DW$T$54)
    6939                      .dwattr $C$DW$738, DW_AT_name("dcBusPole_rps")
    6940                      .dwattr $C$DW$738, DW_AT_TI_symbol_name("_dcBusPole_rps")
    6941                      .dwattr $C$DW$738, DW_AT_data_member_location[DW_OP_plus_uconst 0x1e]
    6942                      .dwattr $C$DW$738, DW_AT_accessibility(DW_ACCESS_public)
    6943              $C$DW$739       .dwtag  DW_TAG_member
    6944                      .dwattr $C$DW$739, DW_AT_type(*$C$DW$T$54)
    6945                      .dwattr $C$DW$739, DW_AT_name("fluxFraction")
    6946                      .dwattr $C$DW$739, DW_AT_TI_symbol_name("_fluxFraction")
    6947                      .dwattr $C$DW$739, DW_AT_data_member_location[DW_OP_plus_uconst 0x20]
    6948                      .dwattr $C$DW$739, DW_AT_accessibility(DW_ACCESS_public)
    6949              $C$DW$740       .dwtag  DW_TAG_member
    6950                      .dwattr $C$DW$740, DW_AT_type(*$C$DW$T$54)
    6951                      .dwattr $C$DW$740, DW_AT_name("indEst_speedMaxFraction")
    6952                      .dwattr $C$DW$740, DW_AT_TI_symbol_name("_indEst_speedMaxFraction")
    6953                      .dwattr $C$DW$740, DW_AT_data_member_location[DW_OP_plus_uconst 0x22]
    6954                      .dwattr $C$DW$740, DW_AT_accessibility(DW_ACCESS_public)
    6955              $C$DW$741       .dwtag  DW_TAG_member
    6956                      .dwattr $C$DW$741, DW_AT_type(*$C$DW$T$54)
    6957                      .dwattr $C$DW$741, DW_AT_name("powerWarpGain")
    6958                      .dwattr $C$DW$741, DW_AT_TI_symbol_name("_powerWarpGain")
    6959                      .dwattr $C$DW$741, DW_AT_data_member_location[DW_OP_plus_uconst 0x24]
    6960                      .dwattr $C$DW$741, DW_AT_accessibility(DW_ACCESS_public)
    6961              $C$DW$742       .dwtag  DW_TAG_member
    6962                      .dwattr $C$DW$742, DW_AT_type(*$C$DW$T$53)
    6963                      .dwattr $C$DW$742, DW_AT_name("systemFreq_MHz")
    6964                      .dwattr $C$DW$742, DW_AT_TI_symbol_name("_systemFreq_MHz")
    6965                      .dwattr $C$DW$742, DW_AT_data_member_location[DW_OP_plus_uconst 0x26]
    6966                      .dwattr $C$DW$742, DW_AT_accessibility(DW_ACCESS_public)
    6967              $C$DW$743       .dwtag  DW_TAG_member
    6968                      .dwattr $C$DW$743, DW_AT_type(*$C$DW$T$54)
    6969                      .dwattr $C$DW$743, DW_AT_name("pwmPeriod_usec")
    6970                      .dwattr $C$DW$743, DW_AT_TI_symbol_name("_pwmPeriod_usec")
    6971                      .dwattr $C$DW$743, DW_AT_data_member_location[DW_OP_plus_uconst 0x28]
    6972                      .dwattr $C$DW$743, DW_AT_accessibility(DW_ACCESS_public)
    6973              $C$DW$744       .dwtag  DW_TAG_member
    6974                      .dwattr $C$DW$744, DW_AT_type(*$C$DW$T$54)
    6975                      .dwattr $C$DW$744, DW_AT_name("voltage_sf")
    6976                      .dwattr $C$DW$744, DW_AT_TI_symbol_name("_voltage_sf")
    6977                      .dwattr $C$DW$744, DW_AT_data_member_location[DW_OP_plus_uconst 0x2a]
    6978                      .dwattr $C$DW$744, DW_AT_accessibility(DW_ACCESS_public)
    6979              $C$DW$745       .dwtag  DW_TAG_member
    6980                      .dwattr $C$DW$745, DW_AT_type(*$C$DW$T$54)
    6981                      .dwattr $C$DW$745, DW_AT_name("current_sf")
    6982                      .dwattr $C$DW$745, DW_AT_TI_symbol_name("_current_sf")
    6983                      .dwattr $C$DW$745, DW_AT_data_member_location[DW_OP_plus_uconst 0x2c]
    6984                      .dwattr $C$DW$745, DW_AT_accessibility(DW_ACCESS_public)
    6985              $C$DW$746       .dwtag  DW_TAG_member
    6986                      .dwattr $C$DW$746, DW_AT_type(*$C$DW$T$54)
    6987                      .dwattr $C$DW$746, DW_AT_name("voltageFilterPole_rps")
    6988                      .dwattr $C$DW$746, DW_AT_TI_symbol_name("_voltageFilterPole_rps")
TMS320C2000 Assembler PC v6.2.5 Sat Sep 16 15:52:23 2017

Tools Copyright (c) 1996-2014 Texas Instruments Incorporated
C:\Users\wmj\AppData\Local\Temp\1651210                              PAGE  140

    6989                      .dwattr $C$DW$746, DW_AT_data_member_location[DW_OP_plus_uconst 0x2e]
    6990                      .dwattr $C$DW$746, DW_AT_accessibility(DW_ACCESS_public)
    6991              $C$DW$747       .dwtag  DW_TAG_member
    6992                      .dwattr $C$DW$747, DW_AT_type(*$C$DW$T$54)
    6993                      .dwattr $C$DW$747, DW_AT_name("maxVsMag_pu")
    6994                      .dwattr $C$DW$747, DW_AT_TI_symbol_name("_maxVsMag_pu")
    6995                      .dwattr $C$DW$747, DW_AT_data_member_location[DW_OP_plus_uconst 0x30]
    6996                      .dwattr $C$DW$747, DW_AT_accessibility(DW_ACCESS_public)
    6997              $C$DW$748       .dwtag  DW_TAG_member
    6998                      .dwattr $C$DW$748, DW_AT_type(*$C$DW$T$54)
    6999                      .dwattr $C$DW$748, DW_AT_name("estKappa")
    7000                      .dwattr $C$DW$748, DW_AT_TI_symbol_name("_estKappa")
    7001                      .dwattr $C$DW$748, DW_AT_data_member_location[DW_OP_plus_uconst 0x32]
    7002                      .dwattr $C$DW$748, DW_AT_accessibility(DW_ACCESS_public)
    7003              $C$DW$749       .dwtag  DW_TAG_member
    7004                      .dwattr $C$DW$749, DW_AT_type(*$C$DW$T$65)
    7005                      .dwattr $C$DW$749, DW_AT_name("motor_type")
    7006                      .dwattr $C$DW$749, DW_AT_TI_symbol_name("_motor_type")
    7007                      .dwattr $C$DW$749, DW_AT_data_member_location[DW_OP_plus_uconst 0x34]
    7008                      .dwattr $C$DW$749, DW_AT_accessibility(DW_ACCESS_public)
    7009              $C$DW$750       .dwtag  DW_TAG_member
    7010                      .dwattr $C$DW$750, DW_AT_type(*$C$DW$T$53)
    7011                      .dwattr $C$DW$750, DW_AT_name("motor_numPolePairs")
    7012                      .dwattr $C$DW$750, DW_AT_TI_symbol_name("_motor_numPolePairs")
    7013                      .dwattr $C$DW$750, DW_AT_data_member_location[DW_OP_plus_uconst 0x35]
    7014                      .dwattr $C$DW$750, DW_AT_accessibility(DW_ACCESS_public)
    7015              $C$DW$751       .dwtag  DW_TAG_member
    7016                      .dwattr $C$DW$751, DW_AT_type(*$C$DW$T$54)
    7017                      .dwattr $C$DW$751, DW_AT_name("motor_ratedFlux")
    7018                      .dwattr $C$DW$751, DW_AT_TI_symbol_name("_motor_ratedFlux")
    7019                      .dwattr $C$DW$751, DW_AT_data_member_location[DW_OP_plus_uconst 0x36]
    7020                      .dwattr $C$DW$751, DW_AT_accessibility(DW_ACCESS_public)
    7021              $C$DW$752       .dwtag  DW_TAG_member
    7022                      .dwattr $C$DW$752, DW_AT_type(*$C$DW$T$54)
    7023                      .dwattr $C$DW$752, DW_AT_name("motor_Rr")
    7024                      .dwattr $C$DW$752, DW_AT_TI_symbol_name("_motor_Rr")
    7025                      .dwattr $C$DW$752, DW_AT_data_member_location[DW_OP_plus_uconst 0x38]
    7026                      .dwattr $C$DW$752, DW_AT_accessibility(DW_ACCESS_public)
    7027              $C$DW$753       .dwtag  DW_TAG_member
    7028                      .dwattr $C$DW$753, DW_AT_type(*$C$DW$T$54)
    7029                      .dwattr $C$DW$753, DW_AT_name("motor_Rs")
    7030                      .dwattr $C$DW$753, DW_AT_TI_symbol_name("_motor_Rs")
    7031                      .dwattr $C$DW$753, DW_AT_data_member_location[DW_OP_plus_uconst 0x3a]
    7032                      .dwattr $C$DW$753, DW_AT_accessibility(DW_ACCESS_public)
    7033              $C$DW$754       .dwtag  DW_TAG_member
    7034                      .dwattr $C$DW$754, DW_AT_type(*$C$DW$T$54)
    7035                      .dwattr $C$DW$754, DW_AT_name("motor_Ls_d")
    7036                      .dwattr $C$DW$754, DW_AT_TI_symbol_name("_motor_Ls_d")
    7037                      .dwattr $C$DW$754, DW_AT_data_member_location[DW_OP_plus_uconst 0x3c]
    7038                      .dwattr $C$DW$754, DW_AT_accessibility(DW_ACCESS_public)
    7039              $C$DW$755       .dwtag  DW_TAG_member
    7040                      .dwattr $C$DW$755, DW_AT_type(*$C$DW$T$54)
    7041                      .dwattr $C$DW$755, DW_AT_name("motor_Ls_q")
    7042                      .dwattr $C$DW$755, DW_AT_TI_symbol_name("_motor_Ls_q")
    7043                      .dwattr $C$DW$755, DW_AT_data_member_location[DW_OP_plus_uconst 0x3e]
TMS320C2000 Assembler PC v6.2.5 Sat Sep 16 15:52:23 2017

Tools Copyright (c) 1996-2014 Texas Instruments Incorporated
C:\Users\wmj\AppData\Local\Temp\1651210                              PAGE  141

    7044                      .dwattr $C$DW$755, DW_AT_accessibility(DW_ACCESS_public)
    7045              $C$DW$756       .dwtag  DW_TAG_member
    7046                      .dwattr $C$DW$756, DW_AT_type(*$C$DW$T$54)
    7047                      .dwattr $C$DW$756, DW_AT_name("maxCurrent")
    7048                      .dwattr $C$DW$756, DW_AT_TI_symbol_name("_maxCurrent")
    7049                      .dwattr $C$DW$756, DW_AT_data_member_location[DW_OP_plus_uconst 0x40]
    7050                      .dwattr $C$DW$756, DW_AT_accessibility(DW_ACCESS_public)
    7051              $C$DW$757       .dwtag  DW_TAG_member
    7052                      .dwattr $C$DW$757, DW_AT_type(*$C$DW$T$54)
    7053                      .dwattr $C$DW$757, DW_AT_name("maxCurrent_resEst")
    7054                      .dwattr $C$DW$757, DW_AT_TI_symbol_name("_maxCurrent_resEst")
    7055                      .dwattr $C$DW$757, DW_AT_data_member_location[DW_OP_plus_uconst 0x42]
    7056                      .dwattr $C$DW$757, DW_AT_accessibility(DW_ACCESS_public)
    7057              $C$DW$758       .dwtag  DW_TAG_member
    7058                      .dwattr $C$DW$758, DW_AT_type(*$C$DW$T$54)
    7059                      .dwattr $C$DW$758, DW_AT_name("maxCurrent_indEst")
    7060                      .dwattr $C$DW$758, DW_AT_TI_symbol_name("_maxCurrent_indEst")
    7061                      .dwattr $C$DW$758, DW_AT_data_member_location[DW_OP_plus_uconst 0x44]
    7062                      .dwattr $C$DW$758, DW_AT_accessibility(DW_ACCESS_public)
    7063              $C$DW$759       .dwtag  DW_TAG_member
    7064                      .dwattr $C$DW$759, DW_AT_type(*$C$DW$T$54)
    7065                      .dwattr $C$DW$759, DW_AT_name("maxCurrentSlope")
    7066                      .dwattr $C$DW$759, DW_AT_TI_symbol_name("_maxCurrentSlope")
    7067                      .dwattr $C$DW$759, DW_AT_data_member_location[DW_OP_plus_uconst 0x46]
    7068                      .dwattr $C$DW$759, DW_AT_accessibility(DW_ACCESS_public)
    7069              $C$DW$760       .dwtag  DW_TAG_member
    7070                      .dwattr $C$DW$760, DW_AT_type(*$C$DW$T$54)
    7071                      .dwattr $C$DW$760, DW_AT_name("maxCurrentSlope_powerWarp")
    7072                      .dwattr $C$DW$760, DW_AT_TI_symbol_name("_maxCurrentSlope_powerWarp")
    7073                      .dwattr $C$DW$760, DW_AT_data_member_location[DW_OP_plus_uconst 0x48]
    7074                      .dwattr $C$DW$760, DW_AT_accessibility(DW_ACCESS_public)
    7075              $C$DW$761       .dwtag  DW_TAG_member
    7076                      .dwattr $C$DW$761, DW_AT_type(*$C$DW$T$54)
    7077                      .dwattr $C$DW$761, DW_AT_name("IdRated")
    7078                      .dwattr $C$DW$761, DW_AT_TI_symbol_name("_IdRated")
    7079                      .dwattr $C$DW$761, DW_AT_data_member_location[DW_OP_plus_uconst 0x4a]
    7080                      .dwattr $C$DW$761, DW_AT_accessibility(DW_ACCESS_public)
    7081              $C$DW$762       .dwtag  DW_TAG_member
    7082                      .dwattr $C$DW$762, DW_AT_type(*$C$DW$T$54)
    7083                      .dwattr $C$DW$762, DW_AT_name("IdRatedFraction_indEst")
    7084                      .dwattr $C$DW$762, DW_AT_TI_symbol_name("_IdRatedFraction_indEst")
    7085                      .dwattr $C$DW$762, DW_AT_data_member_location[DW_OP_plus_uconst 0x4c]
    7086                      .dwattr $C$DW$762, DW_AT_accessibility(DW_ACCESS_public)
    7087              $C$DW$763       .dwtag  DW_TAG_member
    7088                      .dwattr $C$DW$763, DW_AT_type(*$C$DW$T$54)
    7089                      .dwattr $C$DW$763, DW_AT_name("IdRatedFraction_ratedFlux")
    7090                      .dwattr $C$DW$763, DW_AT_TI_symbol_name("_IdRatedFraction_ratedFlux")
    7091                      .dwattr $C$DW$763, DW_AT_data_member_location[DW_OP_plus_uconst 0x4e]
    7092                      .dwattr $C$DW$763, DW_AT_accessibility(DW_ACCESS_public)
    7093              $C$DW$764       .dwtag  DW_TAG_member
    7094                      .dwattr $C$DW$764, DW_AT_type(*$C$DW$T$54)
    7095                      .dwattr $C$DW$764, DW_AT_name("IdRated_delta")
    7096                      .dwattr $C$DW$764, DW_AT_TI_symbol_name("_IdRated_delta")
    7097                      .dwattr $C$DW$764, DW_AT_data_member_location[DW_OP_plus_uconst 0x50]
    7098                      .dwattr $C$DW$764, DW_AT_accessibility(DW_ACCESS_public)
TMS320C2000 Assembler PC v6.2.5 Sat Sep 16 15:52:23 2017

Tools Copyright (c) 1996-2014 Texas Instruments Incorporated
C:\Users\wmj\AppData\Local\Temp\1651210                              PAGE  142

    7099              $C$DW$765       .dwtag  DW_TAG_member
    7100                      .dwattr $C$DW$765, DW_AT_type(*$C$DW$T$54)
    7101                      .dwattr $C$DW$765, DW_AT_name("fluxEstFreq_Hz")
