TMS320C2000 Assembler PC v6.2.5 Fri Sep 15 11:07:47 2017

Tools Copyright (c) 1996-2014 Texas Instruments Incorporated
C:\Users\wmj\AppData\Local\Temp\1342011                              PAGE    1

       1              ;***************************************************************
       2              ;* TMS320C2000 C/C++ Codegen                         PC v6.2.5 *
       3              ;* Date/Time created: Fri Sep 15 11:07:47 2017                 *
       4              ;***************************************************************
       5                      .compiler_opts --float_support=softlib --hll_source=on --mem_model:code=flat --mem_model:data=large -
       6        0002  FP      .set    XAR2
       7              
       8              $C$DW$CU        .dwtag  DW_TAG_compile_unit
       9                      .dwattr $C$DW$CU, DW_AT_name("D:/BM1000/sw/drivers/drvic/decoder.c")
      10                      .dwattr $C$DW$CU, DW_AT_producer("TMS320C2000 C/C++ Codegen PC v6.2.5 Copyright (c) 1996-2014 Texas I
      11                      .dwattr $C$DW$CU, DW_AT_TI_version(0x01)
      12                      .dwattr $C$DW$CU, DW_AT_comp_dir("D:\BM1000\sw\solutions\instaspin_foc\boards\hvkit_rev1p1\f28x\f2802
      13              
      14              $C$DW$1 .dwtag  DW_TAG_subprogram, DW_AT_name("SPI_enableRxFifo")
      15                      .dwattr $C$DW$1, DW_AT_TI_symbol_name("_SPI_enableRxFifo")

     488              $C$DW$75        .dwtag  DW_TAG_enumerator, DW_AT_name("GPIO_Number_33"), DW_AT_const_value(0x21)
     489              $C$DW$76        .dwtag  DW_TAG_enumerator, DW_AT_name("GPIO_Number_34"), DW_AT_const_value(0x22)
     490              $C$DW$77        .dwtag  DW_TAG_enumerator, DW_AT_name("GPIO_Number_35"), DW_AT_const_value(0x23)
     491              $C$DW$78        .dwtag  DW_TAG_enumerator, DW_AT_name("GPIO_Number_36"), DW_AT_const_value(0x24)
     492              $C$DW$79        .dwtag  DW_TAG_enumerator, DW_AT_name("GPIO_Number_37"), DW_AT_const_value(0x25)
     493              $C$DW$80        .dwtag  DW_TAG_enumerator, DW_AT_name("GPIO_Number_38"), DW_AT_const_value(0x26)
     494              $C$DW$81        .dwtag  DW_TAG_enumerator, DW_AT_name("GPIO_Number_39"), DW_AT_const_value(0x27)
     495              $C$DW$82        .dwtag  DW_TAG_enumerator, DW_AT_name("GPIO_Number_40"), DW_AT_const_value(0x28)
     496              $C$DW$83        .dwtag  DW_TAG_enumerator, DW_AT_name("GPIO_Number_41"), DW_AT_const_value(0x29)
     497              $C$DW$84        .dwtag  DW_TAG_enumerator, DW_AT_name("GPIO_Number_42"), DW_AT_const_value(0x2a)
     498              $C$DW$85        .dwtag  DW_TAG_enumerator, DW_AT_name("GPIO_Number_43"), DW_AT_const_value(0x2b)
     499              $C$DW$86        .dwtag  DW_TAG_enumerator, DW_AT_name("GPIO_Number_44"), DW_AT_const_value(0x2c)
     500              $C$DW$87        .dwtag  DW_TAG_enumerator, DW_AT_name("GPIO_Number_50"), DW_AT_const_value(0x32)
     501              $C$DW$88        .dwtag  DW_TAG_enumerator, DW_AT_name("GPIO_Number_51"), DW_AT_const_value(0x33)
     502              $C$DW$89        .dwtag  DW_TAG_enumerator, DW_AT_name("GPIO_Number_52"), DW_AT_const_value(0x34)
     503              $C$DW$90        .dwtag  DW_TAG_enumerator, DW_AT_name("GPIO_Number_53"), DW_AT_const_value(0x35)
     504              $C$DW$91        .dwtag  DW_TAG_enumerator, DW_AT_name("GPIO_Number_54"), DW_AT_const_value(0x36)
     505              $C$DW$92        .dwtag  DW_TAG_enumerator, DW_AT_name("GPIO_Number_55"), DW_AT_const_value(0x37)
     506              $C$DW$93        .dwtag  DW_TAG_enumerator, DW_AT_name("GPIO_Number_56"), DW_AT_const_value(0x38)
     507              $C$DW$94        .dwtag  DW_TAG_enumerator, DW_AT_name("GPIO_Number_57"), DW_AT_const_value(0x39)
     508              $C$DW$95        .dwtag  DW_TAG_enumerator, DW_AT_name("GPIO_Number_58"), DW_AT_const_value(0x3a)
     509              $C$DW$96        .dwtag  DW_TAG_enumerator, DW_AT_name("GPIO_numGpios"), DW_AT_const_value(0x3b)
     510                      .dwendtag $C$DW$T$26
     511              
     512              $C$DW$T$27      .dwtag  DW_TAG_typedef, DW_AT_name("GPIO_Number_e")
     513                      .dwattr $C$DW$T$27, DW_AT_type(*$C$DW$T$26)
     514                      .dwattr $C$DW$T$27, DW_AT_language(DW_LANG_C)
     515              
     516              $C$DW$T$42      .dwtag  DW_TAG_enumeration_type
     517                      .dwattr $C$DW$T$42, DW_AT_byte_size(0x01)
     518              $C$DW$97        .dwtag  DW_TAG_enumerator, DW_AT_name("SPI_FifoStatus_Empty"), DW_AT_const_value(0x00)
     519              $C$DW$98        .dwtag  DW_TAG_enumerator, DW_AT_name("SPI_FifoStatus_1_Word"), DW_AT_const_value(0x100)
     520              $C$DW$99        .dwtag  DW_TAG_enumerator, DW_AT_name("SPI_FifoStatus_2_Words"), DW_AT_const_value(0x200)
     521              $C$DW$100       .dwtag  DW_TAG_enumerator, DW_AT_name("SPI_FifoStatus_3_Words"), DW_AT_const_value(0x300)
     522              $C$DW$101       .dwtag  DW_TAG_enumerator, DW_AT_name("SPI_FifoStatus_4_Words"), DW_AT_const_value(0x400)
     523                      .dwendtag $C$DW$T$42
     524              
     525              $C$DW$T$43      .dwtag  DW_TAG_typedef, DW_AT_name("SPI_FifoStatus_e")
     526                      .dwattr $C$DW$T$43, DW_AT_type(*$C$DW$T$42)
     527                      .dwattr $C$DW$T$43, DW_AT_language(DW_LANG_C)
     528              $C$DW$102       .dwtag  DW_TAG_TI_far_type
     529                      .dwattr $C$DW$102, DW_AT_type(*$C$DW$T$43)
     530              $C$DW$T$44      .dwtag  DW_TAG_volatile_type
     531                      .dwattr $C$DW$T$44, DW_AT_type(*$C$DW$102)
     532              
     533              $C$DW$T$48      .dwtag  DW_TAG_enumeration_type
     534                      .dwattr $C$DW$T$48, DW_AT_byte_size(0x01)
     535              $C$DW$103       .dwtag  DW_TAG_enumerator, DW_AT_name("DECODER_CycReg"), DW_AT_const_value(0x00)
     536              $C$DW$104       .dwtag  DW_TAG_enumerator, DW_AT_name("DECODER_PosReg"), DW_AT_const_value(0x0f)
     537                      .dwendtag $C$DW$T$48
     538              
     539              $C$DW$T$49      .dwtag  DW_TAG_typedef, DW_AT_name("DECODER_RegName_e")
     540                      .dwattr $C$DW$T$49, DW_AT_type(*$C$DW$T$48)
TMS320C2000 Assembler PC v6.2.5 Fri Sep 15 11:07:47 2017

Tools Copyright (c) 1996-2014 Texas Instruments Incorporated
C:\Users\wmj\AppData\Local\Temp\1342011                              PAGE   11

     541                      .dwattr $C$DW$T$49, DW_AT_language(DW_LANG_C)
     542              $C$DW$105       .dwtag  DW_TAG_TI_far_type
     543                      .dwattr $C$DW$105, DW_AT_type(*$C$DW$T$49)
     544              $C$DW$T$50      .dwtag  DW_TAG_const_type
     545                      .dwattr $C$DW$T$50, DW_AT_type(*$C$DW$105)
     546              
     547              $C$DW$T$21      .dwtag  DW_TAG_union_type
     548                      .dwattr $C$DW$T$21, DW_AT_byte_size(0x02)
     549              $C$DW$106       .dwtag  DW_TAG_member
     550                      .dwattr $C$DW$106, DW_AT_type(*$C$DW$T$19)
     551                      .dwattr $C$DW$106, DW_AT_name("decDataTmp")
     552                      .dwattr $C$DW$106, DW_AT_TI_symbol_name("_decDataTmp")
     553                      .dwattr $C$DW$106, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
     554                      .dwattr $C$DW$106, DW_AT_accessibility(DW_ACCESS_public)
     555              $C$DW$107       .dwtag  DW_TAG_member
     556                      .dwattr $C$DW$107, DW_AT_type(*$C$DW$T$20)
     557                      .dwattr $C$DW$107, DW_AT_name("decReg")
     558                      .dwattr $C$DW$107, DW_AT_TI_symbol_name("_decReg")
     559                      .dwattr $C$DW$107, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
     560                      .dwattr $C$DW$107, DW_AT_accessibility(DW_ACCESS_public)
     561                      .dwendtag $C$DW$T$21
     562              
     563              
     564              $C$DW$T$29      .dwtag  DW_TAG_structure_type
     565                      .dwattr $C$DW$T$29, DW_AT_name("_DECODER_Obj_")
     566                      .dwattr $C$DW$T$29, DW_AT_byte_size(0x06)
     567              $C$DW$108       .dwtag  DW_TAG_member
     568                      .dwattr $C$DW$108, DW_AT_type(*$C$DW$T$23)
     569                      .dwattr $C$DW$108, DW_AT_name("spiHandle")
     570                      .dwattr $C$DW$108, DW_AT_TI_symbol_name("_spiHandle")
     571                      .dwattr $C$DW$108, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
     572                      .dwattr $C$DW$108, DW_AT_accessibility(DW_ACCESS_public)
     573              $C$DW$109       .dwtag  DW_TAG_member
     574                      .dwattr $C$DW$109, DW_AT_type(*$C$DW$T$25)
     575                      .dwattr $C$DW$109, DW_AT_name("gpioHandle")
     576                      .dwattr $C$DW$109, DW_AT_TI_symbol_name("_gpioHandle")
     577                      .dwattr $C$DW$109, DW_AT_data_member_location[DW_OP_plus_uconst 0x2]
     578                      .dwattr $C$DW$109, DW_AT_accessibility(DW_ACCESS_public)
     579              $C$DW$110       .dwtag  DW_TAG_member
     580                      .dwattr $C$DW$110, DW_AT_type(*$C$DW$T$27)
     581                      .dwattr $C$DW$110, DW_AT_name("gpioNumber")
     582                      .dwattr $C$DW$110, DW_AT_TI_symbol_name("_gpioNumber")
     583                      .dwattr $C$DW$110, DW_AT_data_member_location[DW_OP_plus_uconst 0x4]
     584                      .dwattr $C$DW$110, DW_AT_accessibility(DW_ACCESS_public)
     585              $C$DW$111       .dwtag  DW_TAG_member
     586                      .dwattr $C$DW$111, DW_AT_type(*$C$DW$T$28)
     587                      .dwattr $C$DW$111, DW_AT_name("RxTimeOut")
     588                      .dwattr $C$DW$111, DW_AT_TI_symbol_name("_RxTimeOut")
     589                      .dwattr $C$DW$111, DW_AT_data_member_location[DW_OP_plus_uconst 0x5]
     590                      .dwattr $C$DW$111, DW_AT_accessibility(DW_ACCESS_public)
     591                      .dwendtag $C$DW$T$29
     592              
     593              $C$DW$T$51      .dwtag  DW_TAG_typedef, DW_AT_name("DECODER_Obj")
     594                      .dwattr $C$DW$T$51, DW_AT_type(*$C$DW$T$29)
     595                      .dwattr $C$DW$T$51, DW_AT_language(DW_LANG_C)
TMS320C2000 Assembler PC v6.2.5 Fri Sep 15 11:07:47 2017

Tools Copyright (c) 1996-2014 Texas Instruments Incorporated
C:\Users\wmj\AppData\Local\Temp\1342011                              PAGE   12

     596              $C$DW$T$52      .dwtag  DW_TAG_pointer_type
     597                      .dwattr $C$DW$T$52, DW_AT_type(*$C$DW$T$29)
     598                      .dwattr $C$DW$T$52, DW_AT_address_class(0x16)
     599              $C$DW$T$53      .dwtag  DW_TAG_typedef, DW_AT_name("DECODER_Handle")
     600                      .dwattr $C$DW$T$53, DW_AT_type(*$C$DW$T$52)
     601                      .dwattr $C$DW$T$53, DW_AT_language(DW_LANG_C)
     602              $C$DW$112       .dwtag  DW_TAG_TI_far_type
     603                      .dwattr $C$DW$112, DW_AT_type(*$C$DW$T$53)
     604              $C$DW$T$54      .dwtag  DW_TAG_const_type
     605                      .dwattr $C$DW$T$54, DW_AT_type(*$C$DW$112)
     606              
     607              $C$DW$T$31      .dwtag  DW_TAG_structure_type
     608                      .dwattr $C$DW$T$31, DW_AT_name("_DECODER_Vars_t_")
     609                      .dwattr $C$DW$T$31, DW_AT_byte_size(0x02)
     610              $C$DW$113       .dwtag  DW_TAG_member
     611                      .dwattr $C$DW$113, DW_AT_type(*$C$DW$T$30)
     612                      .dwattr $C$DW$113, DW_AT_name("Pos_Reg")
     613                      .dwattr $C$DW$113, DW_AT_TI_symbol_name("_Pos_Reg")
     614                      .dwattr $C$DW$113, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
     615                      .dwattr $C$DW$113, DW_AT_accessibility(DW_ACCESS_public)
     616              $C$DW$114       .dwtag  DW_TAG_member
     617                      .dwattr $C$DW$114, DW_AT_type(*$C$DW$T$30)
     618                      .dwattr $C$DW$114, DW_AT_name("Cyc_Reg")
     619                      .dwattr $C$DW$114, DW_AT_TI_symbol_name("_Cyc_Reg")
     620                      .dwattr $C$DW$114, DW_AT_data_member_location[DW_OP_plus_uconst 0x1]
     621                      .dwattr $C$DW$114, DW_AT_accessibility(DW_ACCESS_public)
     622                      .dwendtag $C$DW$T$31
     623              
     624              $C$DW$T$20      .dwtag  DW_TAG_typedef, DW_AT_name("DECODER_Vars_t")
     625                      .dwattr $C$DW$T$20, DW_AT_type(*$C$DW$T$31)
     626                      .dwattr $C$DW$T$20, DW_AT_language(DW_LANG_C)
     627              
     628              $C$DW$T$40      .dwtag  DW_TAG_structure_type
     629                      .dwattr $C$DW$T$40, DW_AT_name("_GPIO_Obj_")
     630                      .dwattr $C$DW$T$40, DW_AT_byte_size(0x6a)
     631              $C$DW$115       .dwtag  DW_TAG_member
     632                      .dwattr $C$DW$115, DW_AT_type(*$C$DW$T$32)
     633                      .dwattr $C$DW$115, DW_AT_name("GPACTRL")
     634                      .dwattr $C$DW$115, DW_AT_TI_symbol_name("_GPACTRL")
     635                      .dwattr $C$DW$115, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
     636                      .dwattr $C$DW$115, DW_AT_accessibility(DW_ACCESS_public)
     637              $C$DW$116       .dwtag  DW_TAG_member
     638                      .dwattr $C$DW$116, DW_AT_type(*$C$DW$T$32)
     639                      .dwattr $C$DW$116, DW_AT_name("GPAQSEL1")
     640                      .dwattr $C$DW$116, DW_AT_TI_symbol_name("_GPAQSEL1")
     641                      .dwattr $C$DW$116, DW_AT_data_member_location[DW_OP_plus_uconst 0x2]
     642                      .dwattr $C$DW$116, DW_AT_accessibility(DW_ACCESS_public)
     643              $C$DW$117       .dwtag  DW_TAG_member
     644                      .dwattr $C$DW$117, DW_AT_type(*$C$DW$T$32)
     645                      .dwattr $C$DW$117, DW_AT_name("GPAQSEL2")
     646                      .dwattr $C$DW$117, DW_AT_TI_symbol_name("_GPAQSEL2")
     647                      .dwattr $C$DW$117, DW_AT_data_member_location[DW_OP_plus_uconst 0x4]
     648                      .dwattr $C$DW$117, DW_AT_accessibility(DW_ACCESS_public)
     649              $C$DW$118       .dwtag  DW_TAG_member
     650                      .dwattr $C$DW$118, DW_AT_type(*$C$DW$T$32)
TMS320C2000 Assembler PC v6.2.5 Fri Sep 15 11:07:47 2017

Tools Copyright (c) 1996-2014 Texas Instruments Incorporated
C:\Users\wmj\AppData\Local\Temp\1342011                              PAGE   13

     651                      .dwattr $C$DW$118, DW_AT_name("GPAMUX1")
     652                      .dwattr $C$DW$118, DW_AT_TI_symbol_name("_GPAMUX1")
     653                      .dwattr $C$DW$118, DW_AT_data_member_location[DW_OP_plus_uconst 0x6]
     654                      .dwattr $C$DW$118, DW_AT_accessibility(DW_ACCESS_public)
     655              $C$DW$119       .dwtag  DW_TAG_member
     656                      .dwattr $C$DW$119, DW_AT_type(*$C$DW$T$32)
     657                      .dwattr $C$DW$119, DW_AT_name("GPAMUX2")
     658                      .dwattr $C$DW$119, DW_AT_TI_symbol_name("_GPAMUX2")
     659                      .dwattr $C$DW$119, DW_AT_data_member_location[DW_OP_plus_uconst 0x8]
     660                      .dwattr $C$DW$119, DW_AT_accessibility(DW_ACCESS_public)
     661              $C$DW$120       .dwtag  DW_TAG_member
     662                      .dwattr $C$DW$120, DW_AT_type(*$C$DW$T$32)
     663                      .dwattr $C$DW$120, DW_AT_name("GPADIR")
     664                      .dwattr $C$DW$120, DW_AT_TI_symbol_name("_GPADIR")
     665                      .dwattr $C$DW$120, DW_AT_data_member_location[DW_OP_plus_uconst 0xa]
     666                      .dwattr $C$DW$120, DW_AT_accessibility(DW_ACCESS_public)
     667              $C$DW$121       .dwtag  DW_TAG_member
     668                      .dwattr $C$DW$121, DW_AT_type(*$C$DW$T$32)
     669                      .dwattr $C$DW$121, DW_AT_name("GPAPUD")
     670                      .dwattr $C$DW$121, DW_AT_TI_symbol_name("_GPAPUD")
     671                      .dwattr $C$DW$121, DW_AT_data_member_location[DW_OP_plus_uconst 0xc]
     672                      .dwattr $C$DW$121, DW_AT_accessibility(DW_ACCESS_public)
     673              $C$DW$122       .dwtag  DW_TAG_member
     674                      .dwattr $C$DW$122, DW_AT_type(*$C$DW$T$34)
     675                      .dwattr $C$DW$122, DW_AT_name("rsvd_1")
     676                      .dwattr $C$DW$122, DW_AT_TI_symbol_name("_rsvd_1")
     677                      .dwattr $C$DW$122, DW_AT_data_member_location[DW_OP_plus_uconst 0xe]
     678                      .dwattr $C$DW$122, DW_AT_accessibility(DW_ACCESS_public)
     679              $C$DW$123       .dwtag  DW_TAG_member
     680                      .dwattr $C$DW$123, DW_AT_type(*$C$DW$T$32)
     681                      .dwattr $C$DW$123, DW_AT_name("GPBCTRL")
     682                      .dwattr $C$DW$123, DW_AT_TI_symbol_name("_GPBCTRL")
     683                      .dwattr $C$DW$123, DW_AT_data_member_location[DW_OP_plus_uconst 0x10]
     684                      .dwattr $C$DW$123, DW_AT_accessibility(DW_ACCESS_public)
     685              $C$DW$124       .dwtag  DW_TAG_member
     686                      .dwattr $C$DW$124, DW_AT_type(*$C$DW$T$32)
     687                      .dwattr $C$DW$124, DW_AT_name("GPBQSEL1")
     688                      .dwattr $C$DW$124, DW_AT_TI_symbol_name("_GPBQSEL1")
     689                      .dwattr $C$DW$124, DW_AT_data_member_location[DW_OP_plus_uconst 0x12]
     690                      .dwattr $C$DW$124, DW_AT_accessibility(DW_ACCESS_public)
     691              $C$DW$125       .dwtag  DW_TAG_member
     692                      .dwattr $C$DW$125, DW_AT_type(*$C$DW$T$32)
     693                      .dwattr $C$DW$125, DW_AT_name("GPBQSEL2")
     694                      .dwattr $C$DW$125, DW_AT_TI_symbol_name("_GPBQSEL2")
     695                      .dwattr $C$DW$125, DW_AT_data_member_location[DW_OP_plus_uconst 0x14]
     696                      .dwattr $C$DW$125, DW_AT_accessibility(DW_ACCESS_public)
     697              $C$DW$126       .dwtag  DW_TAG_member
     698                      .dwattr $C$DW$126, DW_AT_type(*$C$DW$T$32)
     699                      .dwattr $C$DW$126, DW_AT_name("GPBMUX1")
     700                      .dwattr $C$DW$126, DW_AT_TI_symbol_name("_GPBMUX1")
     701                      .dwattr $C$DW$126, DW_AT_data_member_location[DW_OP_plus_uconst 0x16]
     702                      .dwattr $C$DW$126, DW_AT_accessibility(DW_ACCESS_public)
     703              $C$DW$127       .dwtag  DW_TAG_member
     704                      .dwattr $C$DW$127, DW_AT_type(*$C$DW$T$32)
     705                      .dwattr $C$DW$127, DW_AT_name("GPBMUX2")
TMS320C2000 Assembler PC v6.2.5 Fri Sep 15 11:07:47 2017

Tools Copyright (c) 1996-2014 Texas Instruments Incorporated
C:\Users\wmj\AppData\Local\Temp\1342011                              PAGE   14

     706                      .dwattr $C$DW$127, DW_AT_TI_symbol_name("_GPBMUX2")
     707                      .dwattr $C$DW$127, DW_AT_data_member_location[DW_OP_plus_uconst 0x18]
     708                      .dwattr $C$DW$127, DW_AT_accessibility(DW_ACCESS_public)
     709              $C$DW$128       .dwtag  DW_TAG_member
     710                      .dwattr $C$DW$128, DW_AT_type(*$C$DW$T$32)
     711                      .dwattr $C$DW$128, DW_AT_name("GPBDIR")
     712                      .dwattr $C$DW$128, DW_AT_TI_symbol_name("_GPBDIR")
     713                      .dwattr $C$DW$128, DW_AT_data_member_location[DW_OP_plus_uconst 0x1a]
     714                      .dwattr $C$DW$128, DW_AT_accessibility(DW_ACCESS_public)
     715              $C$DW$129       .dwtag  DW_TAG_member
     716                      .dwattr $C$DW$129, DW_AT_type(*$C$DW$T$32)
     717                      .dwattr $C$DW$129, DW_AT_name("GPBPUD")
     718                      .dwattr $C$DW$129, DW_AT_TI_symbol_name("_GPBPUD")
     719                      .dwattr $C$DW$129, DW_AT_data_member_location[DW_OP_plus_uconst 0x1c]
     720                      .dwattr $C$DW$129, DW_AT_accessibility(DW_ACCESS_public)
     721              $C$DW$130       .dwtag  DW_TAG_member
     722                      .dwattr $C$DW$130, DW_AT_type(*$C$DW$T$35)
     723                      .dwattr $C$DW$130, DW_AT_name("rsvd_4")
     724                      .dwattr $C$DW$130, DW_AT_TI_symbol_name("_rsvd_4")
     725                      .dwattr $C$DW$130, DW_AT_data_member_location[DW_OP_plus_uconst 0x1e]
     726                      .dwattr $C$DW$130, DW_AT_accessibility(DW_ACCESS_public)
     727              $C$DW$131       .dwtag  DW_TAG_member
     728                      .dwattr $C$DW$131, DW_AT_type(*$C$DW$T$32)
     729                      .dwattr $C$DW$131, DW_AT_name("AIOMUX1")
     730                      .dwattr $C$DW$131, DW_AT_TI_symbol_name("_AIOMUX1")
     731                      .dwattr $C$DW$131, DW_AT_data_member_location[DW_OP_plus_uconst 0x36]
     732                      .dwattr $C$DW$131, DW_AT_accessibility(DW_ACCESS_public)
     733              $C$DW$132       .dwtag  DW_TAG_member
     734                      .dwattr $C$DW$132, DW_AT_type(*$C$DW$T$34)
     735                      .dwattr $C$DW$132, DW_AT_name("rsvd_5")
     736                      .dwattr $C$DW$132, DW_AT_TI_symbol_name("_rsvd_5")
     737                      .dwattr $C$DW$132, DW_AT_data_member_location[DW_OP_plus_uconst 0x38]
     738                      .dwattr $C$DW$132, DW_AT_accessibility(DW_ACCESS_public)
     739              $C$DW$133       .dwtag  DW_TAG_member
     740                      .dwattr $C$DW$133, DW_AT_type(*$C$DW$T$32)
     741                      .dwattr $C$DW$133, DW_AT_name("AIODIR")
     742                      .dwattr $C$DW$133, DW_AT_TI_symbol_name("_AIODIR")
     743                      .dwattr $C$DW$133, DW_AT_data_member_location[DW_OP_plus_uconst 0x3a]
     744                      .dwattr $C$DW$133, DW_AT_accessibility(DW_ACCESS_public)
     745              $C$DW$134       .dwtag  DW_TAG_member
     746                      .dwattr $C$DW$134, DW_AT_type(*$C$DW$T$36)
     747                      .dwattr $C$DW$134, DW_AT_name("rsvd_6")
     748                      .dwattr $C$DW$134, DW_AT_TI_symbol_name("_rsvd_6")
     749                      .dwattr $C$DW$134, DW_AT_data_member_location[DW_OP_plus_uconst 0x3c]
     750                      .dwattr $C$DW$134, DW_AT_accessibility(DW_ACCESS_public)
     751              $C$DW$135       .dwtag  DW_TAG_member
     752                      .dwattr $C$DW$135, DW_AT_type(*$C$DW$T$32)
     753                      .dwattr $C$DW$135, DW_AT_name("GPADAT")
     754                      .dwattr $C$DW$135, DW_AT_TI_symbol_name("_GPADAT")
     755                      .dwattr $C$DW$135, DW_AT_data_member_location[DW_OP_plus_uconst 0x40]
     756                      .dwattr $C$DW$135, DW_AT_accessibility(DW_ACCESS_public)
     757              $C$DW$136       .dwtag  DW_TAG_member
     758                      .dwattr $C$DW$136, DW_AT_type(*$C$DW$T$32)
     759                      .dwattr $C$DW$136, DW_AT_name("GPASET")
     760                      .dwattr $C$DW$136, DW_AT_TI_symbol_name("_GPASET")
TMS320C2000 Assembler PC v6.2.5 Fri Sep 15 11:07:47 2017

Tools Copyright (c) 1996-2014 Texas Instruments Incorporated
C:\Users\wmj\AppData\Local\Temp\1342011                              PAGE   15

     761                      .dwattr $C$DW$136, DW_AT_data_member_location[DW_OP_plus_uconst 0x42]
     762                      .dwattr $C$DW$136, DW_AT_accessibility(DW_ACCESS_public)
     763              $C$DW$137       .dwtag  DW_TAG_member
     764                      .dwattr $C$DW$137, DW_AT_type(*$C$DW$T$32)
     765                      .dwattr $C$DW$137, DW_AT_name("GPACLEAR")
     766                      .dwattr $C$DW$137, DW_AT_TI_symbol_name("_GPACLEAR")
     767                      .dwattr $C$DW$137, DW_AT_data_member_location[DW_OP_plus_uconst 0x44]
     768                      .dwattr $C$DW$137, DW_AT_accessibility(DW_ACCESS_public)
     769              $C$DW$138       .dwtag  DW_TAG_member
     770                      .dwattr $C$DW$138, DW_AT_type(*$C$DW$T$32)
     771                      .dwattr $C$DW$138, DW_AT_name("GPATOGGLE")
     772                      .dwattr $C$DW$138, DW_AT_TI_symbol_name("_GPATOGGLE")
     773                      .dwattr $C$DW$138, DW_AT_data_member_location[DW_OP_plus_uconst 0x46]
     774                      .dwattr $C$DW$138, DW_AT_accessibility(DW_ACCESS_public)
     775              $C$DW$139       .dwtag  DW_TAG_member
     776                      .dwattr $C$DW$139, DW_AT_type(*$C$DW$T$32)
     777                      .dwattr $C$DW$139, DW_AT_name("GPBDAT")
     778                      .dwattr $C$DW$139, DW_AT_TI_symbol_name("_GPBDAT")
     779                      .dwattr $C$DW$139, DW_AT_data_member_location[DW_OP_plus_uconst 0x48]
     780                      .dwattr $C$DW$139, DW_AT_accessibility(DW_ACCESS_public)
     781              $C$DW$140       .dwtag  DW_TAG_member
     782                      .dwattr $C$DW$140, DW_AT_type(*$C$DW$T$32)
     783                      .dwattr $C$DW$140, DW_AT_name("GPBSET")
     784                      .dwattr $C$DW$140, DW_AT_TI_symbol_name("_GPBSET")
     785                      .dwattr $C$DW$140, DW_AT_data_member_location[DW_OP_plus_uconst 0x4a]
     786                      .dwattr $C$DW$140, DW_AT_accessibility(DW_ACCESS_public)
     787              $C$DW$141       .dwtag  DW_TAG_member
     788                      .dwattr $C$DW$141, DW_AT_type(*$C$DW$T$32)
     789                      .dwattr $C$DW$141, DW_AT_name("GPBCLEAR")
     790                      .dwattr $C$DW$141, DW_AT_TI_symbol_name("_GPBCLEAR")
     791                      .dwattr $C$DW$141, DW_AT_data_member_location[DW_OP_plus_uconst 0x4c]
     792                      .dwattr $C$DW$141, DW_AT_accessibility(DW_ACCESS_public)
     793              $C$DW$142       .dwtag  DW_TAG_member
     794                      .dwattr $C$DW$142, DW_AT_type(*$C$DW$T$32)
     795                      .dwattr $C$DW$142, DW_AT_name("GPBTOGGLE")
     796                      .dwattr $C$DW$142, DW_AT_TI_symbol_name("_GPBTOGGLE")
     797                      .dwattr $C$DW$142, DW_AT_data_member_location[DW_OP_plus_uconst 0x4e]
     798                      .dwattr $C$DW$142, DW_AT_accessibility(DW_ACCESS_public)
     799              $C$DW$143       .dwtag  DW_TAG_member
     800                      .dwattr $C$DW$143, DW_AT_type(*$C$DW$T$37)
     801                      .dwattr $C$DW$143, DW_AT_name("rsvd_7")
     802                      .dwattr $C$DW$143, DW_AT_TI_symbol_name("_rsvd_7")
     803                      .dwattr $C$DW$143, DW_AT_data_member_location[DW_OP_plus_uconst 0x50]
     804                      .dwattr $C$DW$143, DW_AT_accessibility(DW_ACCESS_public)
     805              $C$DW$144       .dwtag  DW_TAG_member
     806                      .dwattr $C$DW$144, DW_AT_type(*$C$DW$T$32)
     807                      .dwattr $C$DW$144, DW_AT_name("AIODAT")
     808                      .dwattr $C$DW$144, DW_AT_TI_symbol_name("_AIODAT")
     809                      .dwattr $C$DW$144, DW_AT_data_member_location[DW_OP_plus_uconst 0x58]
     810                      .dwattr $C$DW$144, DW_AT_accessibility(DW_ACCESS_public)
     811              $C$DW$145       .dwtag  DW_TAG_member
     812                      .dwattr $C$DW$145, DW_AT_type(*$C$DW$T$32)
     813                      .dwattr $C$DW$145, DW_AT_name("AIOSET")
     814                      .dwattr $C$DW$145, DW_AT_TI_symbol_name("_AIOSET")
     815                      .dwattr $C$DW$145, DW_AT_data_member_location[DW_OP_plus_uconst 0x5a]
TMS320C2000 Assembler PC v6.2.5 Fri Sep 15 11:07:47 2017

Tools Copyright (c) 1996-2014 Texas Instruments Incorporated
C:\Users\wmj\AppData\Local\Temp\1342011                              PAGE   16

     816                      .dwattr $C$DW$145, DW_AT_accessibility(DW_ACCESS_public)
     817              $C$DW$146       .dwtag  DW_TAG_member
     818                      .dwattr $C$DW$146, DW_AT_type(*$C$DW$T$32)
     819                      .dwattr $C$DW$146, DW_AT_name("AIOCLEAR")
     820                      .dwattr $C$DW$146, DW_AT_TI_symbol_name("_AIOCLEAR")
     821                      .dwattr $C$DW$146, DW_AT_data_member_location[DW_OP_plus_uconst 0x5c]
     822                      .dwattr $C$DW$146, DW_AT_accessibility(DW_ACCESS_public)
     823              $C$DW$147       .dwtag  DW_TAG_member
     824                      .dwattr $C$DW$147, DW_AT_type(*$C$DW$T$32)
     825                      .dwattr $C$DW$147, DW_AT_name("AIOTOGGLE")
     826                      .dwattr $C$DW$147, DW_AT_TI_symbol_name("_AIOTOGGLE")
     827                      .dwattr $C$DW$147, DW_AT_data_member_location[DW_OP_plus_uconst 0x5e]
     828                      .dwattr $C$DW$147, DW_AT_accessibility(DW_ACCESS_public)
     829              $C$DW$148       .dwtag  DW_TAG_member
     830                      .dwattr $C$DW$148, DW_AT_type(*$C$DW$T$38)
     831                      .dwattr $C$DW$148, DW_AT_name("GPIOXINTnSEL")
     832                      .dwattr $C$DW$148, DW_AT_TI_symbol_name("_GPIOXINTnSEL")
     833                      .dwattr $C$DW$148, DW_AT_data_member_location[DW_OP_plus_uconst 0x60]
     834                      .dwattr $C$DW$148, DW_AT_accessibility(DW_ACCESS_public)
     835              $C$DW$149       .dwtag  DW_TAG_member
     836                      .dwattr $C$DW$149, DW_AT_type(*$C$DW$T$39)
     837                      .dwattr $C$DW$149, DW_AT_name("rsvd_8")
     838                      .dwattr $C$DW$149, DW_AT_TI_symbol_name("_rsvd_8")
     839                      .dwattr $C$DW$149, DW_AT_data_member_location[DW_OP_plus_uconst 0x63]
     840                      .dwattr $C$DW$149, DW_AT_accessibility(DW_ACCESS_public)
     841              $C$DW$150       .dwtag  DW_TAG_member
     842                      .dwattr $C$DW$150, DW_AT_type(*$C$DW$T$32)
     843                      .dwattr $C$DW$150, DW_AT_name("GPIOLPMSEL")
     844                      .dwattr $C$DW$150, DW_AT_TI_symbol_name("_GPIOLPMSEL")
     845                      .dwattr $C$DW$150, DW_AT_data_member_location[DW_OP_plus_uconst 0x68]
     846                      .dwattr $C$DW$150, DW_AT_accessibility(DW_ACCESS_public)
     847                      .dwendtag $C$DW$T$40
     848              
     849              $C$DW$T$24      .dwtag  DW_TAG_pointer_type
     850                      .dwattr $C$DW$T$24, DW_AT_type(*$C$DW$T$40)
     851                      .dwattr $C$DW$T$24, DW_AT_address_class(0x16)
     852              $C$DW$T$25      .dwtag  DW_TAG_typedef, DW_AT_name("GPIO_Handle")
     853                      .dwattr $C$DW$T$25, DW_AT_type(*$C$DW$T$24)
     854                      .dwattr $C$DW$T$25, DW_AT_language(DW_LANG_C)
     855              
     856              $C$DW$T$41      .dwtag  DW_TAG_structure_type
     857                      .dwattr $C$DW$T$41, DW_AT_name("_SPI_Obj_")
     858                      .dwattr $C$DW$T$41, DW_AT_byte_size(0x10)
     859              $C$DW$151       .dwtag  DW_TAG_member
     860                      .dwattr $C$DW$151, DW_AT_type(*$C$DW$T$33)
     861                      .dwattr $C$DW$151, DW_AT_name("SPICCR")
     862                      .dwattr $C$DW$151, DW_AT_TI_symbol_name("_SPICCR")
     863                      .dwattr $C$DW$151, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
     864                      .dwattr $C$DW$151, DW_AT_accessibility(DW_ACCESS_public)
     865              $C$DW$152       .dwtag  DW_TAG_member
     866                      .dwattr $C$DW$152, DW_AT_type(*$C$DW$T$33)
     867                      .dwattr $C$DW$152, DW_AT_name("SPICTL")
     868                      .dwattr $C$DW$152, DW_AT_TI_symbol_name("_SPICTL")
     869                      .dwattr $C$DW$152, DW_AT_data_member_location[DW_OP_plus_uconst 0x1]
     870                      .dwattr $C$DW$152, DW_AT_accessibility(DW_ACCESS_public)
TMS320C2000 Assembler PC v6.2.5 Fri Sep 15 11:07:47 2017

Tools Copyright (c) 1996-2014 Texas Instruments Incorporated
C:\Users\wmj\AppData\Local\Temp\1342011                              PAGE   17

     871              $C$DW$153       .dwtag  DW_TAG_member
     872                      .dwattr $C$DW$153, DW_AT_type(*$C$DW$T$33)
     873                      .dwattr $C$DW$153, DW_AT_name("SPIST")
     874                      .dwattr $C$DW$153, DW_AT_TI_symbol_name("_SPIST")
     875                      .dwattr $C$DW$153, DW_AT_data_member_location[DW_OP_plus_uconst 0x2]
     876                      .dwattr $C$DW$153, DW_AT_accessibility(DW_ACCESS_public)
     877              $C$DW$154       .dwtag  DW_TAG_member
     878                      .dwattr $C$DW$154, DW_AT_type(*$C$DW$T$33)
     879                      .dwattr $C$DW$154, DW_AT_name("rsvd_1")
     880                      .dwattr $C$DW$154, DW_AT_TI_symbol_name("_rsvd_1")
     881                      .dwattr $C$DW$154, DW_AT_data_member_location[DW_OP_plus_uconst 0x3]
     882                      .dwattr $C$DW$154, DW_AT_accessibility(DW_ACCESS_public)
     883              $C$DW$155       .dwtag  DW_TAG_member
     884                      .dwattr $C$DW$155, DW_AT_type(*$C$DW$T$33)
     885                      .dwattr $C$DW$155, DW_AT_name("SPIBRR")
     886                      .dwattr $C$DW$155, DW_AT_TI_symbol_name("_SPIBRR")
     887                      .dwattr $C$DW$155, DW_AT_data_member_location[DW_OP_plus_uconst 0x4]
     888                      .dwattr $C$DW$155, DW_AT_accessibility(DW_ACCESS_public)
     889              $C$DW$156       .dwtag  DW_TAG_member
     890                      .dwattr $C$DW$156, DW_AT_type(*$C$DW$T$33)
     891                      .dwattr $C$DW$156, DW_AT_name("rsvd_2")
     892                      .dwattr $C$DW$156, DW_AT_TI_symbol_name("_rsvd_2")
     893                      .dwattr $C$DW$156, DW_AT_data_member_location[DW_OP_plus_uconst 0x5]
     894                      .dwattr $C$DW$156, DW_AT_accessibility(DW_ACCESS_public)
     895              $C$DW$157       .dwtag  DW_TAG_member
     896                      .dwattr $C$DW$157, DW_AT_type(*$C$DW$T$33)
     897                      .dwattr $C$DW$157, DW_AT_name("SPIEMU")
     898                      .dwattr $C$DW$157, DW_AT_TI_symbol_name("_SPIEMU")
     899                      .dwattr $C$DW$157, DW_AT_data_member_location[DW_OP_plus_uconst 0x6]
     900                      .dwattr $C$DW$157, DW_AT_accessibility(DW_ACCESS_public)
     901              $C$DW$158       .dwtag  DW_TAG_member
     902                      .dwattr $C$DW$158, DW_AT_type(*$C$DW$T$33)
     903                      .dwattr $C$DW$158, DW_AT_name("SPIRXBUF")
     904                      .dwattr $C$DW$158, DW_AT_TI_symbol_name("_SPIRXBUF")
     905                      .dwattr $C$DW$158, DW_AT_data_member_location[DW_OP_plus_uconst 0x7]
     906                      .dwattr $C$DW$158, DW_AT_accessibility(DW_ACCESS_public)
     907              $C$DW$159       .dwtag  DW_TAG_member
     908                      .dwattr $C$DW$159, DW_AT_type(*$C$DW$T$33)
     909                      .dwattr $C$DW$159, DW_AT_name("SPITXBUF")
     910                      .dwattr $C$DW$159, DW_AT_TI_symbol_name("_SPITXBUF")
     911                      .dwattr $C$DW$159, DW_AT_data_member_location[DW_OP_plus_uconst 0x8]
     912                      .dwattr $C$DW$159, DW_AT_accessibility(DW_ACCESS_public)
     913              $C$DW$160       .dwtag  DW_TAG_member
     914                      .dwattr $C$DW$160, DW_AT_type(*$C$DW$T$33)
     915                      .dwattr $C$DW$160, DW_AT_name("SPIDAT")
     916                      .dwattr $C$DW$160, DW_AT_TI_symbol_name("_SPIDAT")
     917                      .dwattr $C$DW$160, DW_AT_data_member_location[DW_OP_plus_uconst 0x9]
     918                      .dwattr $C$DW$160, DW_AT_accessibility(DW_ACCESS_public)
     919              $C$DW$161       .dwtag  DW_TAG_member
     920                      .dwattr $C$DW$161, DW_AT_type(*$C$DW$T$33)
     921                      .dwattr $C$DW$161, DW_AT_name("SPIFFTX")
     922                      .dwattr $C$DW$161, DW_AT_TI_symbol_name("_SPIFFTX")
     923                      .dwattr $C$DW$161, DW_AT_data_member_location[DW_OP_plus_uconst 0xa]
     924                      .dwattr $C$DW$161, DW_AT_accessibility(DW_ACCESS_public)
     925              $C$DW$162       .dwtag  DW_TAG_member
TMS320C2000 Assembler PC v6.2.5 Fri Sep 15 11:07:47 2017

Tools Copyright (c) 1996-2014 Texas Instruments Incorporated
C:\Users\wmj\AppData\Local\Temp\1342011                              PAGE   18

     926                      .dwattr $C$DW$162, DW_AT_type(*$C$DW$T$33)
     927                      .dwattr $C$DW$162, DW_AT_name("SPIFFRX")
     928                      .dwattr $C$DW$162, DW_AT_TI_symbol_name("_SPIFFRX")
     929                      .dwattr $C$DW$162, DW_AT_data_member_location[DW_OP_plus_uconst 0xb]
     930                      .dwattr $C$DW$162, DW_AT_accessibility(DW_ACCESS_public)
     931              $C$DW$163       .dwtag  DW_TAG_member
     932                      .dwattr $C$DW$163, DW_AT_type(*$C$DW$T$33)
     933                      .dwattr $C$DW$163, DW_AT_name("SPIFFCT")
     934                      .dwattr $C$DW$163, DW_AT_TI_symbol_name("_SPIFFCT")
     935                      .dwattr $C$DW$163, DW_AT_data_member_location[DW_OP_plus_uconst 0xc]
     936                      .dwattr $C$DW$163, DW_AT_accessibility(DW_ACCESS_public)
     937              $C$DW$164       .dwtag  DW_TAG_member
     938                      .dwattr $C$DW$164, DW_AT_type(*$C$DW$T$34)
     939                      .dwattr $C$DW$164, DW_AT_name("rsvd_3")
     940                      .dwattr $C$DW$164, DW_AT_TI_symbol_name("_rsvd_3")
     941                      .dwattr $C$DW$164, DW_AT_data_member_location[DW_OP_plus_uconst 0xd]
     942                      .dwattr $C$DW$164, DW_AT_accessibility(DW_ACCESS_public)
     943              $C$DW$165       .dwtag  DW_TAG_member
     944                      .dwattr $C$DW$165, DW_AT_type(*$C$DW$T$33)
     945                      .dwattr $C$DW$165, DW_AT_name("SPIPRI")
     946                      .dwattr $C$DW$165, DW_AT_TI_symbol_name("_SPIPRI")
     947                      .dwattr $C$DW$165, DW_AT_data_member_location[DW_OP_plus_uconst 0xf]
     948                      .dwattr $C$DW$165, DW_AT_accessibility(DW_ACCESS_public)
     949                      .dwendtag $C$DW$T$41
     950              
     951              $C$DW$T$60      .dwtag  DW_TAG_typedef, DW_AT_name("SPI_Obj")
     952                      .dwattr $C$DW$T$60, DW_AT_type(*$C$DW$T$41)
     953                      .dwattr $C$DW$T$60, DW_AT_language(DW_LANG_C)
     954              $C$DW$T$22      .dwtag  DW_TAG_pointer_type
     955                      .dwattr $C$DW$T$22, DW_AT_type(*$C$DW$T$41)
     956                      .dwattr $C$DW$T$22, DW_AT_address_class(0x16)
     957              $C$DW$T$23      .dwtag  DW_TAG_typedef, DW_AT_name("SPI_Handle")
     958                      .dwattr $C$DW$T$23, DW_AT_type(*$C$DW$T$22)
     959                      .dwattr $C$DW$T$23, DW_AT_language(DW_LANG_C)
     960              $C$DW$166       .dwtag  DW_TAG_TI_far_type
     961                      .dwattr $C$DW$166, DW_AT_type(*$C$DW$T$23)
     962              $C$DW$T$61      .dwtag  DW_TAG_const_type
     963                      .dwattr $C$DW$T$61, DW_AT_type(*$C$DW$166)
     964              $C$DW$T$3       .dwtag  DW_TAG_pointer_type
     965                      .dwattr $C$DW$T$3, DW_AT_address_class(0x16)
     966              $C$DW$167       .dwtag  DW_TAG_TI_far_type
     967                      .dwattr $C$DW$167, DW_AT_type(*$C$DW$T$3)
     968              $C$DW$T$63      .dwtag  DW_TAG_const_type
     969                      .dwattr $C$DW$T$63, DW_AT_type(*$C$DW$167)
     970              $C$DW$T$4       .dwtag  DW_TAG_base_type
     971                      .dwattr $C$DW$T$4, DW_AT_encoding(DW_ATE_boolean)
     972                      .dwattr $C$DW$T$4, DW_AT_name("bool")
     973                      .dwattr $C$DW$T$4, DW_AT_byte_size(0x01)
     974              $C$DW$T$5       .dwtag  DW_TAG_base_type
     975                      .dwattr $C$DW$T$5, DW_AT_encoding(DW_ATE_signed_char)
     976                      .dwattr $C$DW$T$5, DW_AT_name("signed char")
     977                      .dwattr $C$DW$T$5, DW_AT_byte_size(0x01)
     978              $C$DW$T$6       .dwtag  DW_TAG_base_type
     979                      .dwattr $C$DW$T$6, DW_AT_encoding(DW_ATE_unsigned_char)
     980                      .dwattr $C$DW$T$6, DW_AT_name("unsigned char")
TMS320C2000 Assembler PC v6.2.5 Fri Sep 15 11:07:47 2017

Tools Copyright (c) 1996-2014 Texas Instruments Incorporated
C:\Users\wmj\AppData\Local\Temp\1342011                              PAGE   19

     981                      .dwattr $C$DW$T$6, DW_AT_byte_size(0x01)
     982              $C$DW$T$28      .dwtag  DW_TAG_typedef, DW_AT_name("_Bool")
     983                      .dwattr $C$DW$T$28, DW_AT_type(*$C$DW$T$6)
     984                      .dwattr $C$DW$T$28, DW_AT_language(DW_LANG_C)
     985              $C$DW$T$7       .dwtag  DW_TAG_base_type
     986                      .dwattr $C$DW$T$7, DW_AT_encoding(DW_ATE_signed_char)
     987                      .dwattr $C$DW$T$7, DW_AT_name("wchar_t")
     988                      .dwattr $C$DW$T$7, DW_AT_byte_size(0x01)
     989              $C$DW$T$8       .dwtag  DW_TAG_base_type
     990                      .dwattr $C$DW$T$8, DW_AT_encoding(DW_ATE_signed)
     991                      .dwattr $C$DW$T$8, DW_AT_name("short")
     992                      .dwattr $C$DW$T$8, DW_AT_byte_size(0x01)
     993              $C$DW$T$9       .dwtag  DW_TAG_base_type
     994                      .dwattr $C$DW$T$9, DW_AT_encoding(DW_ATE_unsigned)
     995                      .dwattr $C$DW$T$9, DW_AT_name("unsigned short")
     996                      .dwattr $C$DW$T$9, DW_AT_byte_size(0x01)
     997              $C$DW$T$30      .dwtag  DW_TAG_typedef, DW_AT_name("uint16_t")
     998                      .dwattr $C$DW$T$30, DW_AT_type(*$C$DW$T$9)
