TMS320C2000 Assembler PC v6.2.5 Fri Sep 15 11:07:51 2017

Tools Copyright (c) 1996-2014 Texas Instruments Incorporated
C:\Users\wmj\AppData\Local\Temp\0762011                              PAGE    1

       1              ;***************************************************************
       2              ;* TMS320C2000 C/C++ Codegen                         PC v6.2.5 *
       3              ;* Date/Time created: Fri Sep 15 11:07:50 2017                 *
       4              ;***************************************************************
       5                      .compiler_opts --float_support=softlib --hll_source=on --mem_model:code=flat --mem_model:data=large -
       6        0002  FP      .set    XAR2
       7              
       8              $C$DW$CU        .dwtag  DW_TAG_compile_unit
       9                      .dwattr $C$DW$CU, DW_AT_name("D:/BM1000/sw/drivers/drvic/modbus/mb.c")
      10                      .dwattr $C$DW$CU, DW_AT_producer("TMS320C2000 C/C++ Codegen PC v6.2.5 Copyright (c) 1996-2014 Texas I
      11                      .dwattr $C$DW$CU, DW_AT_TI_version(0x01)
      12                      .dwattr $C$DW$CU, DW_AT_comp_dir("D:\BM1000\sw\solutions\instaspin_foc\boards\hvkit_rev1p1\f28x\f2802
      13              
      14              $C$DW$1 .dwtag  DW_TAG_subprogram, DW_AT_name("SCI_putDataBlocking")
      15                      .dwattr $C$DW$1, DW_AT_TI_symbol_name("_SCI_putDataBlocking")

    2577              $C$DW$169       .dwtag  DW_TAG_enumerator, DW_AT_name("STATE_TX_IDLE"), DW_AT_const_value(0x00)
    2578              $C$DW$170       .dwtag  DW_TAG_enumerator, DW_AT_name("STATE_TX_XMIT"), DW_AT_const_value(0x01)
    2579                      .dwendtag $C$DW$T$44
    2580              
    2581              $C$DW$T$45      .dwtag  DW_TAG_typedef, DW_AT_name("eMBSndState")
    2582                      .dwattr $C$DW$T$45, DW_AT_type(*$C$DW$T$44)
    2583                      .dwattr $C$DW$T$45, DW_AT_language(DW_LANG_C)
    2584              
    2585              $C$DW$T$46      .dwtag  DW_TAG_enumeration_type
    2586                      .dwattr $C$DW$T$46, DW_AT_byte_size(0x01)
    2587              $C$DW$171       .dwtag  DW_TAG_enumerator, DW_AT_name("STATE_RX_INIT"), DW_AT_const_value(0x00)
    2588              $C$DW$172       .dwtag  DW_TAG_enumerator, DW_AT_name("STATE_RX_IDLE"), DW_AT_const_value(0x01)
    2589              $C$DW$173       .dwtag  DW_TAG_enumerator, DW_AT_name("STATE_RX_RCV"), DW_AT_const_value(0x02)
TMS320C2000 Assembler PC v6.2.5 Fri Sep 15 11:07:51 2017

Tools Copyright (c) 1996-2014 Texas Instruments Incorporated
C:\Users\wmj\AppData\Local\Temp\0762011                              PAGE   49

    2590              $C$DW$174       .dwtag  DW_TAG_enumerator, DW_AT_name("STATE_RX_ERROR"), DW_AT_const_value(0x03)
    2591                      .dwendtag $C$DW$T$46
    2592              
    2593              $C$DW$T$47      .dwtag  DW_TAG_typedef, DW_AT_name("eMBRcvState")
    2594                      .dwattr $C$DW$T$47, DW_AT_type(*$C$DW$T$46)
    2595                      .dwattr $C$DW$T$47, DW_AT_language(DW_LANG_C)
    2596              
    2597              $C$DW$T$49      .dwtag  DW_TAG_enumeration_type
    2598                      .dwattr $C$DW$T$49, DW_AT_byte_size(0x01)
    2599              $C$DW$175       .dwtag  DW_TAG_enumerator, DW_AT_name("EV_READY"), DW_AT_const_value(0x00)
    2600              $C$DW$176       .dwtag  DW_TAG_enumerator, DW_AT_name("EV_FRAME_RECEIVED"), DW_AT_const_value(0x01)
    2601              $C$DW$177       .dwtag  DW_TAG_enumerator, DW_AT_name("EV_EXECUTE"), DW_AT_const_value(0x02)
    2602              $C$DW$178       .dwtag  DW_TAG_enumerator, DW_AT_name("EV_FRAME_SENT"), DW_AT_const_value(0x03)
    2603                      .dwendtag $C$DW$T$49
    2604              
    2605              $C$DW$T$50      .dwtag  DW_TAG_typedef, DW_AT_name("eMBEventType")
    2606                      .dwattr $C$DW$T$50, DW_AT_type(*$C$DW$T$49)
    2607                      .dwattr $C$DW$T$50, DW_AT_language(DW_LANG_C)
    2608              $C$DW$T$63      .dwtag  DW_TAG_pointer_type
    2609                      .dwattr $C$DW$T$63, DW_AT_type(*$C$DW$T$50)
    2610                      .dwattr $C$DW$T$63, DW_AT_address_class(0x16)
    2611              $C$DW$179       .dwtag  DW_TAG_TI_far_type
    2612                      .dwattr $C$DW$179, DW_AT_type(*$C$DW$T$63)
    2613              $C$DW$T$64      .dwtag  DW_TAG_const_type
    2614                      .dwattr $C$DW$T$64, DW_AT_type(*$C$DW$179)
    2615              $C$DW$180       .dwtag  DW_TAG_TI_far_type
    2616                      .dwattr $C$DW$180, DW_AT_type(*$C$DW$T$50)
    2617              $C$DW$T$65      .dwtag  DW_TAG_const_type
    2618                      .dwattr $C$DW$T$65, DW_AT_type(*$C$DW$180)
    2619              
    2620              $C$DW$T$66      .dwtag  DW_TAG_enumeration_type
    2621                      .dwattr $C$DW$T$66, DW_AT_byte_size(0x01)
    2622              $C$DW$181       .dwtag  DW_TAG_enumerator, DW_AT_name("MB_EX_NONE"), DW_AT_const_value(0x00)
    2623              $C$DW$182       .dwtag  DW_TAG_enumerator, DW_AT_name("MB_EX_ILLEGAL_FUNCTION"), DW_AT_const_value(0x01)
    2624              $C$DW$183       .dwtag  DW_TAG_enumerator, DW_AT_name("MB_EX_ILLEGAL_DATA_ADDRESS"), DW_AT_const_value(0x02)
    2625              $C$DW$184       .dwtag  DW_TAG_enumerator, DW_AT_name("MB_EX_ILLEGAL_DATA_VALUE"), DW_AT_const_value(0x03)
    2626              $C$DW$185       .dwtag  DW_TAG_enumerator, DW_AT_name("MB_EX_SLAVE_DEVICE_FAILURE"), DW_AT_const_value(0x04)
    2627              $C$DW$186       .dwtag  DW_TAG_enumerator, DW_AT_name("MB_EX_ACKNOWLEDGE"), DW_AT_const_value(0x05)
    2628              $C$DW$187       .dwtag  DW_TAG_enumerator, DW_AT_name("MB_EX_SLAVE_BUSY"), DW_AT_const_value(0x06)
    2629              $C$DW$188       .dwtag  DW_TAG_enumerator, DW_AT_name("MB_EX_MEMORY_PARITY_ERROR"), DW_AT_const_value(0x08)
    2630              $C$DW$189       .dwtag  DW_TAG_enumerator, DW_AT_name("MB_EX_GATEWAY_PATH_FAILED"), DW_AT_const_value(0x0a)
    2631              $C$DW$190       .dwtag  DW_TAG_enumerator, DW_AT_name("MB_EX_GATEWAY_TGT_FAILED"), DW_AT_const_value(0x0b)
    2632                      .dwendtag $C$DW$T$66
    2633              
    2634              $C$DW$T$67      .dwtag  DW_TAG_typedef, DW_AT_name("eMBException")
    2635                      .dwattr $C$DW$T$67, DW_AT_type(*$C$DW$T$66)
    2636                      .dwattr $C$DW$T$67, DW_AT_language(DW_LANG_C)
    2637              
    2638              $C$DW$T$29      .dwtag  DW_TAG_structure_type
    2639                      .dwattr $C$DW$T$29, DW_AT_name("_GPIO_Obj_")
    2640                      .dwattr $C$DW$T$29, DW_AT_byte_size(0x6a)
    2641              $C$DW$191       .dwtag  DW_TAG_member
    2642                      .dwattr $C$DW$191, DW_AT_type(*$C$DW$T$20)
    2643                      .dwattr $C$DW$191, DW_AT_name("GPACTRL")
    2644                      .dwattr $C$DW$191, DW_AT_TI_symbol_name("_GPACTRL")
TMS320C2000 Assembler PC v6.2.5 Fri Sep 15 11:07:51 2017

Tools Copyright (c) 1996-2014 Texas Instruments Incorporated
C:\Users\wmj\AppData\Local\Temp\0762011                              PAGE   50

    2645                      .dwattr $C$DW$191, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    2646                      .dwattr $C$DW$191, DW_AT_accessibility(DW_ACCESS_public)
    2647              $C$DW$192       .dwtag  DW_TAG_member
    2648                      .dwattr $C$DW$192, DW_AT_type(*$C$DW$T$20)
    2649                      .dwattr $C$DW$192, DW_AT_name("GPAQSEL1")
    2650                      .dwattr $C$DW$192, DW_AT_TI_symbol_name("_GPAQSEL1")
    2651                      .dwattr $C$DW$192, DW_AT_data_member_location[DW_OP_plus_uconst 0x2]
    2652                      .dwattr $C$DW$192, DW_AT_accessibility(DW_ACCESS_public)
    2653              $C$DW$193       .dwtag  DW_TAG_member
    2654                      .dwattr $C$DW$193, DW_AT_type(*$C$DW$T$20)
    2655                      .dwattr $C$DW$193, DW_AT_name("GPAQSEL2")
    2656                      .dwattr $C$DW$193, DW_AT_TI_symbol_name("_GPAQSEL2")
    2657                      .dwattr $C$DW$193, DW_AT_data_member_location[DW_OP_plus_uconst 0x4]
    2658                      .dwattr $C$DW$193, DW_AT_accessibility(DW_ACCESS_public)
    2659              $C$DW$194       .dwtag  DW_TAG_member
    2660                      .dwattr $C$DW$194, DW_AT_type(*$C$DW$T$20)
    2661                      .dwattr $C$DW$194, DW_AT_name("GPAMUX1")
    2662                      .dwattr $C$DW$194, DW_AT_TI_symbol_name("_GPAMUX1")
    2663                      .dwattr $C$DW$194, DW_AT_data_member_location[DW_OP_plus_uconst 0x6]
    2664                      .dwattr $C$DW$194, DW_AT_accessibility(DW_ACCESS_public)
    2665              $C$DW$195       .dwtag  DW_TAG_member
    2666                      .dwattr $C$DW$195, DW_AT_type(*$C$DW$T$20)
    2667                      .dwattr $C$DW$195, DW_AT_name("GPAMUX2")
    2668                      .dwattr $C$DW$195, DW_AT_TI_symbol_name("_GPAMUX2")
    2669                      .dwattr $C$DW$195, DW_AT_data_member_location[DW_OP_plus_uconst 0x8]
    2670                      .dwattr $C$DW$195, DW_AT_accessibility(DW_ACCESS_public)
    2671              $C$DW$196       .dwtag  DW_TAG_member
    2672                      .dwattr $C$DW$196, DW_AT_type(*$C$DW$T$20)
    2673                      .dwattr $C$DW$196, DW_AT_name("GPADIR")
    2674                      .dwattr $C$DW$196, DW_AT_TI_symbol_name("_GPADIR")
    2675                      .dwattr $C$DW$196, DW_AT_data_member_location[DW_OP_plus_uconst 0xa]
    2676                      .dwattr $C$DW$196, DW_AT_accessibility(DW_ACCESS_public)
    2677              $C$DW$197       .dwtag  DW_TAG_member
    2678                      .dwattr $C$DW$197, DW_AT_type(*$C$DW$T$20)
    2679                      .dwattr $C$DW$197, DW_AT_name("GPAPUD")
    2680                      .dwattr $C$DW$197, DW_AT_TI_symbol_name("_GPAPUD")
    2681                      .dwattr $C$DW$197, DW_AT_data_member_location[DW_OP_plus_uconst 0xc]
    2682                      .dwattr $C$DW$197, DW_AT_accessibility(DW_ACCESS_public)
    2683              $C$DW$198       .dwtag  DW_TAG_member
    2684                      .dwattr $C$DW$198, DW_AT_type(*$C$DW$T$23)
    2685                      .dwattr $C$DW$198, DW_AT_name("rsvd_1")
    2686                      .dwattr $C$DW$198, DW_AT_TI_symbol_name("_rsvd_1")
    2687                      .dwattr $C$DW$198, DW_AT_data_member_location[DW_OP_plus_uconst 0xe]
    2688                      .dwattr $C$DW$198, DW_AT_accessibility(DW_ACCESS_public)
    2689              $C$DW$199       .dwtag  DW_TAG_member
    2690                      .dwattr $C$DW$199, DW_AT_type(*$C$DW$T$20)
    2691                      .dwattr $C$DW$199, DW_AT_name("GPBCTRL")
    2692                      .dwattr $C$DW$199, DW_AT_TI_symbol_name("_GPBCTRL")
    2693                      .dwattr $C$DW$199, DW_AT_data_member_location[DW_OP_plus_uconst 0x10]
    2694                      .dwattr $C$DW$199, DW_AT_accessibility(DW_ACCESS_public)
    2695              $C$DW$200       .dwtag  DW_TAG_member
    2696                      .dwattr $C$DW$200, DW_AT_type(*$C$DW$T$20)
    2697                      .dwattr $C$DW$200, DW_AT_name("GPBQSEL1")
    2698                      .dwattr $C$DW$200, DW_AT_TI_symbol_name("_GPBQSEL1")
    2699                      .dwattr $C$DW$200, DW_AT_data_member_location[DW_OP_plus_uconst 0x12]
TMS320C2000 Assembler PC v6.2.5 Fri Sep 15 11:07:51 2017

Tools Copyright (c) 1996-2014 Texas Instruments Incorporated
C:\Users\wmj\AppData\Local\Temp\0762011                              PAGE   51

    2700                      .dwattr $C$DW$200, DW_AT_accessibility(DW_ACCESS_public)
    2701              $C$DW$201       .dwtag  DW_TAG_member
    2702                      .dwattr $C$DW$201, DW_AT_type(*$C$DW$T$23)
    2703                      .dwattr $C$DW$201, DW_AT_name("rsvd_2")
    2704                      .dwattr $C$DW$201, DW_AT_TI_symbol_name("_rsvd_2")
    2705                      .dwattr $C$DW$201, DW_AT_data_member_location[DW_OP_plus_uconst 0x14]
    2706                      .dwattr $C$DW$201, DW_AT_accessibility(DW_ACCESS_public)
    2707              $C$DW$202       .dwtag  DW_TAG_member
    2708                      .dwattr $C$DW$202, DW_AT_type(*$C$DW$T$20)
    2709                      .dwattr $C$DW$202, DW_AT_name("GPBMUX1")
    2710                      .dwattr $C$DW$202, DW_AT_TI_symbol_name("_GPBMUX1")
    2711                      .dwattr $C$DW$202, DW_AT_data_member_location[DW_OP_plus_uconst 0x16]
    2712                      .dwattr $C$DW$202, DW_AT_accessibility(DW_ACCESS_public)
    2713              $C$DW$203       .dwtag  DW_TAG_member
    2714                      .dwattr $C$DW$203, DW_AT_type(*$C$DW$T$23)
    2715                      .dwattr $C$DW$203, DW_AT_name("rsvd_3")
    2716                      .dwattr $C$DW$203, DW_AT_TI_symbol_name("_rsvd_3")
    2717                      .dwattr $C$DW$203, DW_AT_data_member_location[DW_OP_plus_uconst 0x18]
    2718                      .dwattr $C$DW$203, DW_AT_accessibility(DW_ACCESS_public)
    2719              $C$DW$204       .dwtag  DW_TAG_member
    2720                      .dwattr $C$DW$204, DW_AT_type(*$C$DW$T$20)
    2721                      .dwattr $C$DW$204, DW_AT_name("GPBDIR")
    2722                      .dwattr $C$DW$204, DW_AT_TI_symbol_name("_GPBDIR")
    2723                      .dwattr $C$DW$204, DW_AT_data_member_location[DW_OP_plus_uconst 0x1a]
    2724                      .dwattr $C$DW$204, DW_AT_accessibility(DW_ACCESS_public)
    2725              $C$DW$205       .dwtag  DW_TAG_member
    2726                      .dwattr $C$DW$205, DW_AT_type(*$C$DW$T$20)
    2727                      .dwattr $C$DW$205, DW_AT_name("GPBPUD")
    2728                      .dwattr $C$DW$205, DW_AT_TI_symbol_name("_GPBPUD")
    2729                      .dwattr $C$DW$205, DW_AT_data_member_location[DW_OP_plus_uconst 0x1c]
    2730                      .dwattr $C$DW$205, DW_AT_accessibility(DW_ACCESS_public)
    2731              $C$DW$206       .dwtag  DW_TAG_member
    2732                      .dwattr $C$DW$206, DW_AT_type(*$C$DW$T$24)
    2733                      .dwattr $C$DW$206, DW_AT_name("rsvd_4")
    2734                      .dwattr $C$DW$206, DW_AT_TI_symbol_name("_rsvd_4")
    2735                      .dwattr $C$DW$206, DW_AT_data_member_location[DW_OP_plus_uconst 0x1e]
    2736                      .dwattr $C$DW$206, DW_AT_accessibility(DW_ACCESS_public)
    2737              $C$DW$207       .dwtag  DW_TAG_member
    2738                      .dwattr $C$DW$207, DW_AT_type(*$C$DW$T$20)
    2739                      .dwattr $C$DW$207, DW_AT_name("AIOMUX1")
    2740                      .dwattr $C$DW$207, DW_AT_TI_symbol_name("_AIOMUX1")
    2741                      .dwattr $C$DW$207, DW_AT_data_member_location[DW_OP_plus_uconst 0x36]
    2742                      .dwattr $C$DW$207, DW_AT_accessibility(DW_ACCESS_public)
    2743              $C$DW$208       .dwtag  DW_TAG_member
    2744                      .dwattr $C$DW$208, DW_AT_type(*$C$DW$T$23)
    2745                      .dwattr $C$DW$208, DW_AT_name("rsvd_5")
    2746                      .dwattr $C$DW$208, DW_AT_TI_symbol_name("_rsvd_5")
    2747                      .dwattr $C$DW$208, DW_AT_data_member_location[DW_OP_plus_uconst 0x38]
    2748                      .dwattr $C$DW$208, DW_AT_accessibility(DW_ACCESS_public)
    2749              $C$DW$209       .dwtag  DW_TAG_member
    2750                      .dwattr $C$DW$209, DW_AT_type(*$C$DW$T$20)
    2751                      .dwattr $C$DW$209, DW_AT_name("AIODIR")
    2752                      .dwattr $C$DW$209, DW_AT_TI_symbol_name("_AIODIR")
    2753                      .dwattr $C$DW$209, DW_AT_data_member_location[DW_OP_plus_uconst 0x3a]
    2754                      .dwattr $C$DW$209, DW_AT_accessibility(DW_ACCESS_public)
TMS320C2000 Assembler PC v6.2.5 Fri Sep 15 11:07:51 2017

Tools Copyright (c) 1996-2014 Texas Instruments Incorporated
C:\Users\wmj\AppData\Local\Temp\0762011                              PAGE   52

    2755              $C$DW$210       .dwtag  DW_TAG_member
    2756                      .dwattr $C$DW$210, DW_AT_type(*$C$DW$T$25)
    2757                      .dwattr $C$DW$210, DW_AT_name("rsvd_6")
    2758                      .dwattr $C$DW$210, DW_AT_TI_symbol_name("_rsvd_6")
    2759                      .dwattr $C$DW$210, DW_AT_data_member_location[DW_OP_plus_uconst 0x3c]
    2760                      .dwattr $C$DW$210, DW_AT_accessibility(DW_ACCESS_public)
    2761              $C$DW$211       .dwtag  DW_TAG_member
    2762                      .dwattr $C$DW$211, DW_AT_type(*$C$DW$T$20)
    2763                      .dwattr $C$DW$211, DW_AT_name("GPADAT")
    2764                      .dwattr $C$DW$211, DW_AT_TI_symbol_name("_GPADAT")
    2765                      .dwattr $C$DW$211, DW_AT_data_member_location[DW_OP_plus_uconst 0x40]
    2766                      .dwattr $C$DW$211, DW_AT_accessibility(DW_ACCESS_public)
    2767              $C$DW$212       .dwtag  DW_TAG_member
    2768                      .dwattr $C$DW$212, DW_AT_type(*$C$DW$T$20)
    2769                      .dwattr $C$DW$212, DW_AT_name("GPASET")
    2770                      .dwattr $C$DW$212, DW_AT_TI_symbol_name("_GPASET")
    2771                      .dwattr $C$DW$212, DW_AT_data_member_location[DW_OP_plus_uconst 0x42]
    2772                      .dwattr $C$DW$212, DW_AT_accessibility(DW_ACCESS_public)
    2773              $C$DW$213       .dwtag  DW_TAG_member
    2774                      .dwattr $C$DW$213, DW_AT_type(*$C$DW$T$20)
    2775                      .dwattr $C$DW$213, DW_AT_name("GPACLEAR")
    2776                      .dwattr $C$DW$213, DW_AT_TI_symbol_name("_GPACLEAR")
    2777                      .dwattr $C$DW$213, DW_AT_data_member_location[DW_OP_plus_uconst 0x44]
    2778                      .dwattr $C$DW$213, DW_AT_accessibility(DW_ACCESS_public)
    2779              $C$DW$214       .dwtag  DW_TAG_member
    2780                      .dwattr $C$DW$214, DW_AT_type(*$C$DW$T$20)
    2781                      .dwattr $C$DW$214, DW_AT_name("GPATOGGLE")
    2782                      .dwattr $C$DW$214, DW_AT_TI_symbol_name("_GPATOGGLE")
    2783                      .dwattr $C$DW$214, DW_AT_data_member_location[DW_OP_plus_uconst 0x46]
    2784                      .dwattr $C$DW$214, DW_AT_accessibility(DW_ACCESS_public)
    2785              $C$DW$215       .dwtag  DW_TAG_member
    2786                      .dwattr $C$DW$215, DW_AT_type(*$C$DW$T$20)
    2787                      .dwattr $C$DW$215, DW_AT_name("GPBDAT")
    2788                      .dwattr $C$DW$215, DW_AT_TI_symbol_name("_GPBDAT")
    2789                      .dwattr $C$DW$215, DW_AT_data_member_location[DW_OP_plus_uconst 0x48]
    2790                      .dwattr $C$DW$215, DW_AT_accessibility(DW_ACCESS_public)
    2791              $C$DW$216       .dwtag  DW_TAG_member
    2792                      .dwattr $C$DW$216, DW_AT_type(*$C$DW$T$20)
    2793                      .dwattr $C$DW$216, DW_AT_name("GPBSET")
    2794                      .dwattr $C$DW$216, DW_AT_TI_symbol_name("_GPBSET")
    2795                      .dwattr $C$DW$216, DW_AT_data_member_location[DW_OP_plus_uconst 0x4a]
    2796                      .dwattr $C$DW$216, DW_AT_accessibility(DW_ACCESS_public)
    2797              $C$DW$217       .dwtag  DW_TAG_member
    2798                      .dwattr $C$DW$217, DW_AT_type(*$C$DW$T$20)
    2799                      .dwattr $C$DW$217, DW_AT_name("GPBCLEAR")
    2800                      .dwattr $C$DW$217, DW_AT_TI_symbol_name("_GPBCLEAR")
    2801                      .dwattr $C$DW$217, DW_AT_data_member_location[DW_OP_plus_uconst 0x4c]
    2802                      .dwattr $C$DW$217, DW_AT_accessibility(DW_ACCESS_public)
    2803              $C$DW$218       .dwtag  DW_TAG_member
    2804                      .dwattr $C$DW$218, DW_AT_type(*$C$DW$T$20)
    2805                      .dwattr $C$DW$218, DW_AT_name("GPBTOGGLE")
    2806                      .dwattr $C$DW$218, DW_AT_TI_symbol_name("_GPBTOGGLE")
    2807                      .dwattr $C$DW$218, DW_AT_data_member_location[DW_OP_plus_uconst 0x4e]
    2808                      .dwattr $C$DW$218, DW_AT_accessibility(DW_ACCESS_public)
    2809              $C$DW$219       .dwtag  DW_TAG_member
TMS320C2000 Assembler PC v6.2.5 Fri Sep 15 11:07:51 2017

Tools Copyright (c) 1996-2014 Texas Instruments Incorporated
C:\Users\wmj\AppData\Local\Temp\0762011                              PAGE   53

    2810                      .dwattr $C$DW$219, DW_AT_type(*$C$DW$T$26)
    2811                      .dwattr $C$DW$219, DW_AT_name("rsvd_7")
    2812                      .dwattr $C$DW$219, DW_AT_TI_symbol_name("_rsvd_7")
    2813                      .dwattr $C$DW$219, DW_AT_data_member_location[DW_OP_plus_uconst 0x50]
    2814                      .dwattr $C$DW$219, DW_AT_accessibility(DW_ACCESS_public)
    2815              $C$DW$220       .dwtag  DW_TAG_member
    2816                      .dwattr $C$DW$220, DW_AT_type(*$C$DW$T$20)
    2817                      .dwattr $C$DW$220, DW_AT_name("AIODAT")
    2818                      .dwattr $C$DW$220, DW_AT_TI_symbol_name("_AIODAT")
    2819                      .dwattr $C$DW$220, DW_AT_data_member_location[DW_OP_plus_uconst 0x58]
    2820                      .dwattr $C$DW$220, DW_AT_accessibility(DW_ACCESS_public)
    2821              $C$DW$221       .dwtag  DW_TAG_member
    2822                      .dwattr $C$DW$221, DW_AT_type(*$C$DW$T$20)
    2823                      .dwattr $C$DW$221, DW_AT_name("AIOSET")
    2824                      .dwattr $C$DW$221, DW_AT_TI_symbol_name("_AIOSET")
    2825                      .dwattr $C$DW$221, DW_AT_data_member_location[DW_OP_plus_uconst 0x5a]
    2826                      .dwattr $C$DW$221, DW_AT_accessibility(DW_ACCESS_public)
    2827              $C$DW$222       .dwtag  DW_TAG_member
    2828                      .dwattr $C$DW$222, DW_AT_type(*$C$DW$T$20)
    2829                      .dwattr $C$DW$222, DW_AT_name("AIOCLEAR")
    2830                      .dwattr $C$DW$222, DW_AT_TI_symbol_name("_AIOCLEAR")
    2831                      .dwattr $C$DW$222, DW_AT_data_member_location[DW_OP_plus_uconst 0x5c]
    2832                      .dwattr $C$DW$222, DW_AT_accessibility(DW_ACCESS_public)
    2833              $C$DW$223       .dwtag  DW_TAG_member
    2834                      .dwattr $C$DW$223, DW_AT_type(*$C$DW$T$20)
    2835                      .dwattr $C$DW$223, DW_AT_name("AIOTOGGLE")
    2836                      .dwattr $C$DW$223, DW_AT_TI_symbol_name("_AIOTOGGLE")
    2837                      .dwattr $C$DW$223, DW_AT_data_member_location[DW_OP_plus_uconst 0x5e]
    2838                      .dwattr $C$DW$223, DW_AT_accessibility(DW_ACCESS_public)
    2839              $C$DW$224       .dwtag  DW_TAG_member
    2840                      .dwattr $C$DW$224, DW_AT_type(*$C$DW$T$27)
    2841                      .dwattr $C$DW$224, DW_AT_name("GPIOXINTnSEL")
    2842                      .dwattr $C$DW$224, DW_AT_TI_symbol_name("_GPIOXINTnSEL")
    2843                      .dwattr $C$DW$224, DW_AT_data_member_location[DW_OP_plus_uconst 0x60]
    2844                      .dwattr $C$DW$224, DW_AT_accessibility(DW_ACCESS_public)
    2845              $C$DW$225       .dwtag  DW_TAG_member
    2846                      .dwattr $C$DW$225, DW_AT_type(*$C$DW$T$28)
    2847                      .dwattr $C$DW$225, DW_AT_name("rsvd_8")
    2848                      .dwattr $C$DW$225, DW_AT_TI_symbol_name("_rsvd_8")
    2849                      .dwattr $C$DW$225, DW_AT_data_member_location[DW_OP_plus_uconst 0x63]
    2850                      .dwattr $C$DW$225, DW_AT_accessibility(DW_ACCESS_public)
    2851              $C$DW$226       .dwtag  DW_TAG_member
    2852                      .dwattr $C$DW$226, DW_AT_type(*$C$DW$T$20)
    2853                      .dwattr $C$DW$226, DW_AT_name("GPIOLPMSEL")
    2854                      .dwattr $C$DW$226, DW_AT_TI_symbol_name("_GPIOLPMSEL")
    2855                      .dwattr $C$DW$226, DW_AT_data_member_location[DW_OP_plus_uconst 0x68]
    2856                      .dwattr $C$DW$226, DW_AT_accessibility(DW_ACCESS_public)
    2857                      .dwendtag $C$DW$T$29
    2858              
    2859              $C$DW$T$30      .dwtag  DW_TAG_pointer_type
    2860                      .dwattr $C$DW$T$30, DW_AT_type(*$C$DW$T$29)
    2861                      .dwattr $C$DW$T$30, DW_AT_address_class(0x16)
    2862              $C$DW$T$31      .dwtag  DW_TAG_typedef, DW_AT_name("GPIO_Handle")
    2863                      .dwattr $C$DW$T$31, DW_AT_type(*$C$DW$T$30)
    2864                      .dwattr $C$DW$T$31, DW_AT_language(DW_LANG_C)
TMS320C2000 Assembler PC v6.2.5 Fri Sep 15 11:07:51 2017

Tools Copyright (c) 1996-2014 Texas Instruments Incorporated
C:\Users\wmj\AppData\Local\Temp\0762011                              PAGE   54

    2865              $C$DW$227       .dwtag  DW_TAG_TI_far_type
    2866                      .dwattr $C$DW$227, DW_AT_type(*$C$DW$T$31)
    2867              $C$DW$T$68      .dwtag  DW_TAG_const_type
    2868                      .dwattr $C$DW$T$68, DW_AT_type(*$C$DW$227)
    2869              
    2870              $C$DW$T$51      .dwtag  DW_TAG_structure_type
    2871                      .dwattr $C$DW$T$51, DW_AT_name("_MB_Obj_")
    2872                      .dwattr $C$DW$T$51, DW_AT_byte_size(0x1c)
    2873              $C$DW$228       .dwtag  DW_TAG_member
    2874                      .dwattr $C$DW$228, DW_AT_type(*$C$DW$T$31)
    2875                      .dwattr $C$DW$228, DW_AT_name("gpioHandle")
    2876                      .dwattr $C$DW$228, DW_AT_TI_symbol_name("_gpioHandle")
    2877                      .dwattr $C$DW$228, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    2878                      .dwattr $C$DW$228, DW_AT_accessibility(DW_ACCESS_public)
    2879              $C$DW$229       .dwtag  DW_TAG_member
    2880                      .dwattr $C$DW$229, DW_AT_type(*$C$DW$T$33)
    2881                      .dwattr $C$DW$229, DW_AT_name("timerHandle")
    2882                      .dwattr $C$DW$229, DW_AT_TI_symbol_name("_timerHandle")
    2883                      .dwattr $C$DW$229, DW_AT_data_member_location[DW_OP_plus_uconst 0x2]
    2884                      .dwattr $C$DW$229, DW_AT_accessibility(DW_ACCESS_public)
    2885              $C$DW$230       .dwtag  DW_TAG_member
    2886                      .dwattr $C$DW$230, DW_AT_type(*$C$DW$T$35)
    2887                      .dwattr $C$DW$230, DW_AT_name("sciHandle")
    2888                      .dwattr $C$DW$230, DW_AT_TI_symbol_name("_sciHandle")
    2889                      .dwattr $C$DW$230, DW_AT_data_member_location[DW_OP_plus_uconst 0x4]
    2890                      .dwattr $C$DW$230, DW_AT_accessibility(DW_ACCESS_public)
    2891              $C$DW$231       .dwtag  DW_TAG_member
    2892                      .dwattr $C$DW$231, DW_AT_type(*$C$DW$T$37)
    2893                      .dwattr $C$DW$231, DW_AT_name("RTU_Frame")
    2894                      .dwattr $C$DW$231, DW_AT_TI_symbol_name("_RTU_Frame")
    2895                      .dwattr $C$DW$231, DW_AT_data_member_location[DW_OP_plus_uconst 0x6]
    2896                      .dwattr $C$DW$231, DW_AT_accessibility(DW_ACCESS_public)
    2897              $C$DW$232       .dwtag  DW_TAG_member
    2898                      .dwattr $C$DW$232, DW_AT_type(*$C$DW$T$39)
    2899                      .dwattr $C$DW$232, DW_AT_name("RTUBuf")
    2900                      .dwattr $C$DW$232, DW_AT_TI_symbol_name("_RTUBuf")
    2901                      .dwattr $C$DW$232, DW_AT_data_member_location[DW_OP_plus_uconst 0x8]
    2902                      .dwattr $C$DW$232, DW_AT_accessibility(DW_ACCESS_public)
    2903              $C$DW$233       .dwtag  DW_TAG_member
    2904                      .dwattr $C$DW$233, DW_AT_type(*$C$DW$T$38)
    2905                      .dwattr $C$DW$233, DW_AT_name("RcvBufferPos")
    2906                      .dwattr $C$DW$233, DW_AT_TI_symbol_name("_RcvBufferPos")
    2907                      .dwattr $C$DW$233, DW_AT_data_member_location[DW_OP_plus_uconst 0x10]
    2908                      .dwattr $C$DW$233, DW_AT_accessibility(DW_ACCESS_public)
    2909              $C$DW$234       .dwtag  DW_TAG_member
    2910                      .dwattr $C$DW$234, DW_AT_type(*$C$DW$T$40)
    2911                      .dwattr $C$DW$234, DW_AT_name("SndBufferCur")
    2912                      .dwattr $C$DW$234, DW_AT_TI_symbol_name("_SndBufferCur")
    2913                      .dwattr $C$DW$234, DW_AT_data_member_location[DW_OP_plus_uconst 0x12]
    2914                      .dwattr $C$DW$234, DW_AT_accessibility(DW_ACCESS_public)
    2915              $C$DW$235       .dwtag  DW_TAG_member
    2916                      .dwattr $C$DW$235, DW_AT_type(*$C$DW$T$41)
    2917                      .dwattr $C$DW$235, DW_AT_name("SndBufferCount")
    2918                      .dwattr $C$DW$235, DW_AT_TI_symbol_name("_SndBufferCount")
    2919                      .dwattr $C$DW$235, DW_AT_data_member_location[DW_OP_plus_uconst 0x14]
TMS320C2000 Assembler PC v6.2.5 Fri Sep 15 11:07:51 2017

Tools Copyright (c) 1996-2014 Texas Instruments Incorporated
C:\Users\wmj\AppData\Local\Temp\0762011                              PAGE   55

    2920                      .dwattr $C$DW$235, DW_AT_accessibility(DW_ACCESS_public)
    2921              $C$DW$236       .dwtag  DW_TAG_member
    2922                      .dwattr $C$DW$236, DW_AT_type(*$C$DW$T$38)
    2923                      .dwattr $C$DW$236, DW_AT_name("SlaveAddress")
    2924                      .dwattr $C$DW$236, DW_AT_TI_symbol_name("_SlaveAddress")
    2925                      .dwattr $C$DW$236, DW_AT_data_member_location[DW_OP_plus_uconst 0x15]
    2926                      .dwattr $C$DW$236, DW_AT_accessibility(DW_ACCESS_public)
    2927              $C$DW$237       .dwtag  DW_TAG_member
    2928                      .dwattr $C$DW$237, DW_AT_type(*$C$DW$T$43)
    2929                      .dwattr $C$DW$237, DW_AT_name("eStatus")
    2930                      .dwattr $C$DW$237, DW_AT_TI_symbol_name("_eStatus")
    2931                      .dwattr $C$DW$237, DW_AT_data_member_location[DW_OP_plus_uconst 0x16]
    2932                      .dwattr $C$DW$237, DW_AT_accessibility(DW_ACCESS_public)
    2933              $C$DW$238       .dwtag  DW_TAG_member
    2934                      .dwattr $C$DW$238, DW_AT_type(*$C$DW$T$45)
    2935                      .dwattr $C$DW$238, DW_AT_name("eSndState")
    2936                      .dwattr $C$DW$238, DW_AT_TI_symbol_name("_eSndState")
    2937                      .dwattr $C$DW$238, DW_AT_data_member_location[DW_OP_plus_uconst 0x17]
    2938                      .dwattr $C$DW$238, DW_AT_accessibility(DW_ACCESS_public)
    2939              $C$DW$239       .dwtag  DW_TAG_member
    2940                      .dwattr $C$DW$239, DW_AT_type(*$C$DW$T$47)
    2941                      .dwattr $C$DW$239, DW_AT_name("eRcvState")
    2942                      .dwattr $C$DW$239, DW_AT_TI_symbol_name("_eRcvState")
    2943                      .dwattr $C$DW$239, DW_AT_data_member_location[DW_OP_plus_uconst 0x18]
    2944                      .dwattr $C$DW$239, DW_AT_accessibility(DW_ACCESS_public)
    2945              $C$DW$240       .dwtag  DW_TAG_member
    2946                      .dwattr $C$DW$240, DW_AT_type(*$C$DW$T$48)
    2947                      .dwattr $C$DW$240, DW_AT_name("xEventInQueue")
    2948                      .dwattr $C$DW$240, DW_AT_TI_symbol_name("_xEventInQueue")
    2949                      .dwattr $C$DW$240, DW_AT_data_member_location[DW_OP_plus_uconst 0x19]
    2950                      .dwattr $C$DW$240, DW_AT_accessibility(DW_ACCESS_public)
    2951              $C$DW$241       .dwtag  DW_TAG_member
    2952                      .dwattr $C$DW$241, DW_AT_type(*$C$DW$T$50)
    2953                      .dwattr $C$DW$241, DW_AT_name("eQueuedEvent")
    2954                      .dwattr $C$DW$241, DW_AT_TI_symbol_name("_eQueuedEvent")
    2955                      .dwattr $C$DW$241, DW_AT_data_member_location[DW_OP_plus_uconst 0x1a]
    2956                      .dwattr $C$DW$241, DW_AT_accessibility(DW_ACCESS_public)
    2957                      .dwendtag $C$DW$T$51
    2958              
    2959              $C$DW$T$70      .dwtag  DW_TAG_typedef, DW_AT_name("MB_Obj")
    2960                      .dwattr $C$DW$T$70, DW_AT_type(*$C$DW$T$51)
    2961                      .dwattr $C$DW$T$70, DW_AT_language(DW_LANG_C)
    2962              $C$DW$T$56      .dwtag  DW_TAG_pointer_type
    2963                      .dwattr $C$DW$T$56, DW_AT_type(*$C$DW$T$51)
    2964                      .dwattr $C$DW$T$56, DW_AT_address_class(0x16)
    2965              $C$DW$T$57      .dwtag  DW_TAG_typedef, DW_AT_name("MB_Handle")
    2966                      .dwattr $C$DW$T$57, DW_AT_type(*$C$DW$T$56)
    2967                      .dwattr $C$DW$T$57, DW_AT_language(DW_LANG_C)
    2968              $C$DW$242       .dwtag  DW_TAG_TI_far_type
    2969                      .dwattr $C$DW$242, DW_AT_type(*$C$DW$T$57)
    2970              $C$DW$T$71      .dwtag  DW_TAG_const_type
    2971                      .dwattr $C$DW$T$71, DW_AT_type(*$C$DW$242)
    2972              
    2973              $C$DW$T$53      .dwtag  DW_TAG_structure_type
    2974                      .dwattr $C$DW$T$53, DW_AT_name("_MB_RTU_t_")
TMS320C2000 Assembler PC v6.2.5 Fri Sep 15 11:07:51 2017

Tools Copyright (c) 1996-2014 Texas Instruments Incorporated
C:\Users\wmj\AppData\Local\Temp\0762011                              PAGE   56

    2975                      .dwattr $C$DW$T$53, DW_AT_byte_size(0x08)
    2976              $C$DW$243       .dwtag  DW_TAG_member
    2977                      .dwattr $C$DW$243, DW_AT_type(*$C$DW$T$38)
    2978                      .dwattr $C$DW$243, DW_AT_name("PDU_Address")
    2979                      .dwattr $C$DW$243, DW_AT_TI_symbol_name("_PDU_Address")
    2980                      .dwattr $C$DW$243, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    2981                      .dwattr $C$DW$243, DW_AT_accessibility(DW_ACCESS_public)
    2982              $C$DW$244       .dwtag  DW_TAG_member
    2983                      .dwattr $C$DW$244, DW_AT_type(*$C$DW$T$38)
    2984                      .dwattr $C$DW$244, DW_AT_name("PDU_FunctionCode")
    2985                      .dwattr $C$DW$244, DW_AT_TI_symbol_name("_PDU_FunctionCode")
    2986                      .dwattr $C$DW$244, DW_AT_data_member_location[DW_OP_plus_uconst 0x1]
    2987                      .dwattr $C$DW$244, DW_AT_accessibility(DW_ACCESS_public)
    2988              $C$DW$245       .dwtag  DW_TAG_member
    2989                      .dwattr $C$DW$245, DW_AT_type(*$C$DW$T$52)
    2990                      .dwattr $C$DW$245, DW_AT_name("PDU_RegAddress")
    2991                      .dwattr $C$DW$245, DW_AT_TI_symbol_name("_PDU_RegAddress")
    2992                      .dwattr $C$DW$245, DW_AT_data_member_location[DW_OP_plus_uconst 0x2]
    2993                      .dwattr $C$DW$245, DW_AT_accessibility(DW_ACCESS_public)
    2994              $C$DW$246       .dwtag  DW_TAG_member
    2995                      .dwattr $C$DW$246, DW_AT_type(*$C$DW$T$52)
    2996                      .dwattr $C$DW$246, DW_AT_name("PDU_Data")
    2997                      .dwattr $C$DW$246, DW_AT_TI_symbol_name("_PDU_Data")
    2998                      .dwattr $C$DW$246, DW_AT_data_member_location[DW_OP_plus_uconst 0x4]
    2999                      .dwattr $C$DW$246, DW_AT_accessibility(DW_ACCESS_public)
    3000              $C$DW$247       .dwtag  DW_TAG_member
    3001                      .dwattr $C$DW$247, DW_AT_type(*$C$DW$T$38)
    3002                      .dwattr $C$DW$247, DW_AT_name("PDU_CRC_LByte")
    3003                      .dwattr $C$DW$247, DW_AT_TI_symbol_name("_PDU_CRC_LByte")
    3004                      .dwattr $C$DW$247, DW_AT_data_member_location[DW_OP_plus_uconst 0x6]
    3005                      .dwattr $C$DW$247, DW_AT_accessibility(DW_ACCESS_public)
    3006              $C$DW$248       .dwtag  DW_TAG_member
    3007                      .dwattr $C$DW$248, DW_AT_type(*$C$DW$T$38)
    3008                      .dwattr $C$DW$248, DW_AT_name("PDU_CRC_HByte")
    3009                      .dwattr $C$DW$248, DW_AT_TI_symbol_name("_PDU_CRC_HByte")
    3010                      .dwattr $C$DW$248, DW_AT_data_member_location[DW_OP_plus_uconst 0x7]
    3011                      .dwattr $C$DW$248, DW_AT_accessibility(DW_ACCESS_public)
    3012                      .dwendtag $C$DW$T$53
    3013              
    3014              $C$DW$T$36      .dwtag  DW_TAG_pointer_type
    3015                      .dwattr $C$DW$T$36, DW_AT_type(*$C$DW$T$53)
    3016                      .dwattr $C$DW$T$36, DW_AT_address_class(0x16)
    3017              $C$DW$T$37      .dwtag  DW_TAG_typedef, DW_AT_name("RTU_Frame")
    3018                      .dwattr $C$DW$T$37, DW_AT_type(*$C$DW$T$36)
    3019                      .dwattr $C$DW$T$37, DW_AT_language(DW_LANG_C)
    3020              
    3021              $C$DW$T$54      .dwtag  DW_TAG_structure_type
    3022                      .dwattr $C$DW$T$54, DW_AT_name("_SCI_Obj_")
    3023                      .dwattr $C$DW$T$54, DW_AT_byte_size(0x10)
    3024              $C$DW$249       .dwtag  DW_TAG_member
    3025                      .dwattr $C$DW$249, DW_AT_type(*$C$DW$T$22)
    3026                      .dwattr $C$DW$249, DW_AT_name("SCICCR")
    3027                      .dwattr $C$DW$249, DW_AT_TI_symbol_name("_SCICCR")
    3028                      .dwattr $C$DW$249, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    3029                      .dwattr $C$DW$249, DW_AT_accessibility(DW_ACCESS_public)
TMS320C2000 Assembler PC v6.2.5 Fri Sep 15 11:07:51 2017

Tools Copyright (c) 1996-2014 Texas Instruments Incorporated
C:\Users\wmj\AppData\Local\Temp\0762011                              PAGE   57

    3030              $C$DW$250       .dwtag  DW_TAG_member
    3031                      .dwattr $C$DW$250, DW_AT_type(*$C$DW$T$22)
    3032                      .dwattr $C$DW$250, DW_AT_name("SCICTL1")
    3033                      .dwattr $C$DW$250, DW_AT_TI_symbol_name("_SCICTL1")
    3034                      .dwattr $C$DW$250, DW_AT_data_member_location[DW_OP_plus_uconst 0x1]
    3035                      .dwattr $C$DW$250, DW_AT_accessibility(DW_ACCESS_public)
    3036              $C$DW$251       .dwtag  DW_TAG_member
    3037                      .dwattr $C$DW$251, DW_AT_type(*$C$DW$T$22)
    3038                      .dwattr $C$DW$251, DW_AT_name("SCIHBAUD")
    3039                      .dwattr $C$DW$251, DW_AT_TI_symbol_name("_SCIHBAUD")
    3040                      .dwattr $C$DW$251, DW_AT_data_member_location[DW_OP_plus_uconst 0x2]
    3041                      .dwattr $C$DW$251, DW_AT_accessibility(DW_ACCESS_public)
    3042              $C$DW$252       .dwtag  DW_TAG_member
    3043                      .dwattr $C$DW$252, DW_AT_type(*$C$DW$T$22)
    3044                      .dwattr $C$DW$252, DW_AT_name("SCILBAUD")
    3045                      .dwattr $C$DW$252, DW_AT_TI_symbol_name("_SCILBAUD")
    3046                      .dwattr $C$DW$252, DW_AT_data_member_location[DW_OP_plus_uconst 0x3]
    3047                      .dwattr $C$DW$252, DW_AT_accessibility(DW_ACCESS_public)
    3048              $C$DW$253       .dwtag  DW_TAG_member
    3049                      .dwattr $C$DW$253, DW_AT_type(*$C$DW$T$22)
    3050                      .dwattr $C$DW$253, DW_AT_name("SCICTL2")
    3051                      .dwattr $C$DW$253, DW_AT_TI_symbol_name("_SCICTL2")
    3052                      .dwattr $C$DW$253, DW_AT_data_member_location[DW_OP_plus_uconst 0x4]
    3053                      .dwattr $C$DW$253, DW_AT_accessibility(DW_ACCESS_public)
    3054              $C$DW$254       .dwtag  DW_TAG_member
    3055                      .dwattr $C$DW$254, DW_AT_type(*$C$DW$T$22)
    3056                      .dwattr $C$DW$254, DW_AT_name("SCIRXST")
    3057                      .dwattr $C$DW$254, DW_AT_TI_symbol_name("_SCIRXST")
    3058                      .dwattr $C$DW$254, DW_AT_data_member_location[DW_OP_plus_uconst 0x5]
    3059                      .dwattr $C$DW$254, DW_AT_accessibility(DW_ACCESS_public)
    3060              $C$DW$255       .dwtag  DW_TAG_member
    3061                      .dwattr $C$DW$255, DW_AT_type(*$C$DW$T$22)
    3062                      .dwattr $C$DW$255, DW_AT_name("SCIRXEMU")
    3063                      .dwattr $C$DW$255, DW_AT_TI_symbol_name("_SCIRXEMU")
    3064                      .dwattr $C$DW$255, DW_AT_data_member_location[DW_OP_plus_uconst 0x6]
    3065                      .dwattr $C$DW$255, DW_AT_accessibility(DW_ACCESS_public)
    3066              $C$DW$256       .dwtag  DW_TAG_member
    3067                      .dwattr $C$DW$256, DW_AT_type(*$C$DW$T$22)
    3068                      .dwattr $C$DW$256, DW_AT_name("SCIRXBUF")
    3069                      .dwattr $C$DW$256, DW_AT_TI_symbol_name("_SCIRXBUF")
    3070                      .dwattr $C$DW$256, DW_AT_data_member_location[DW_OP_plus_uconst 0x7]
    3071                      .dwattr $C$DW$256, DW_AT_accessibility(DW_ACCESS_public)
    3072              $C$DW$257       .dwtag  DW_TAG_member
    3073                      .dwattr $C$DW$257, DW_AT_type(*$C$DW$T$22)
    3074                      .dwattr $C$DW$257, DW_AT_name("rsvd_1")
    3075                      .dwattr $C$DW$257, DW_AT_TI_symbol_name("_rsvd_1")
    3076                      .dwattr $C$DW$257, DW_AT_data_member_location[DW_OP_plus_uconst 0x8]
    3077                      .dwattr $C$DW$257, DW_AT_accessibility(DW_ACCESS_public)
    3078              $C$DW$258       .dwtag  DW_TAG_member
    3079                      .dwattr $C$DW$258, DW_AT_type(*$C$DW$T$22)
    3080                      .dwattr $C$DW$258, DW_AT_name("SCITXBUF")
    3081                      .dwattr $C$DW$258, DW_AT_TI_symbol_name("_SCITXBUF")
    3082                      .dwattr $C$DW$258, DW_AT_data_member_location[DW_OP_plus_uconst 0x9]
    3083                      .dwattr $C$DW$258, DW_AT_accessibility(DW_ACCESS_public)
    3084              $C$DW$259       .dwtag  DW_TAG_member
TMS320C2000 Assembler PC v6.2.5 Fri Sep 15 11:07:51 2017

Tools Copyright (c) 1996-2014 Texas Instruments Incorporated
C:\Users\wmj\AppData\Local\Temp\0762011                              PAGE   58

    3085                      .dwattr $C$DW$259, DW_AT_type(*$C$DW$T$22)
    3086                      .dwattr $C$DW$259, DW_AT_name("SCIFFTX")
    3087                      .dwattr $C$DW$259, DW_AT_TI_symbol_name("_SCIFFTX")
    3088                      .dwattr $C$DW$259, DW_AT_data_member_location[DW_OP_plus_uconst 0xa]
    3089                      .dwattr $C$DW$259, DW_AT_accessibility(DW_ACCESS_public)
    3090              $C$DW$260       .dwtag  DW_TAG_member
    3091                      .dwattr $C$DW$260, DW_AT_type(*$C$DW$T$22)
    3092                      .dwattr $C$DW$260, DW_AT_name("SCIFFRX")
    3093                      .dwattr $C$DW$260, DW_AT_TI_symbol_name("_SCIFFRX")
    3094                      .dwattr $C$DW$260, DW_AT_data_member_location[DW_OP_plus_uconst 0xb]
    3095                      .dwattr $C$DW$260, DW_AT_accessibility(DW_ACCESS_public)
    3096              $C$DW$261       .dwtag  DW_TAG_member
    3097                      .dwattr $C$DW$261, DW_AT_type(*$C$DW$T$22)
    3098                      .dwattr $C$DW$261, DW_AT_name("SCIFFCT")
    3099                      .dwattr $C$DW$261, DW_AT_TI_symbol_name("_SCIFFCT")
    3100                      .dwattr $C$DW$261, DW_AT_data_member_location[DW_OP_plus_uconst 0xc]
    3101                      .dwattr $C$DW$261, DW_AT_accessibility(DW_ACCESS_public)
    3102              $C$DW$262       .dwtag  DW_TAG_member
    3103                      .dwattr $C$DW$262, DW_AT_type(*$C$DW$T$23)
    3104                      .dwattr $C$DW$262, DW_AT_name("rsvd_2")
    3105                      .dwattr $C$DW$262, DW_AT_TI_symbol_name("_rsvd_2")
    3106                      .dwattr $C$DW$262, DW_AT_data_member_location[DW_OP_plus_uconst 0xd]
    3107                      .dwattr $C$DW$262, DW_AT_accessibility(DW_ACCESS_public)
    3108              $C$DW$263       .dwtag  DW_TAG_member
    3109                      .dwattr $C$DW$263, DW_AT_type(*$C$DW$T$22)
    3110                      .dwattr $C$DW$263, DW_AT_name("SCIPRI")
    3111                      .dwattr $C$DW$263, DW_AT_TI_symbol_name("_SCIPRI")
    3112                      .dwattr $C$DW$263, DW_AT_data_member_location[DW_OP_plus_uconst 0xf]
    3113                      .dwattr $C$DW$263, DW_AT_accessibility(DW_ACCESS_public)
    3114                      .dwendtag $C$DW$T$54
    3115              
    3116              $C$DW$T$34      .dwtag  DW_TAG_pointer_type
    3117                      .dwattr $C$DW$T$34, DW_AT_type(*$C$DW$T$54)
    3118                      .dwattr $C$DW$T$34, DW_AT_address_class(0x16)
    3119              $C$DW$T$35      .dwtag  DW_TAG_typedef, DW_AT_name("SCI_Handle")
    3120                      .dwattr $C$DW$T$35, DW_AT_type(*$C$DW$T$34)
    3121                      .dwattr $C$DW$T$35, DW_AT_language(DW_LANG_C)
    3122              $C$DW$264       .dwtag  DW_TAG_TI_far_type
    3123                      .dwattr $C$DW$264, DW_AT_type(*$C$DW$T$35)
    3124              $C$DW$T$77      .dwtag  DW_TAG_const_type
    3125                      .dwattr $C$DW$T$77, DW_AT_type(*$C$DW$264)
    3126              
    3127              $C$DW$T$55      .dwtag  DW_TAG_structure_type
    3128                      .dwattr $C$DW$T$55, DW_AT_name("_TIMER_Obj_")
    3129                      .dwattr $C$DW$T$55, DW_AT_byte_size(0x08)
    3130              $C$DW$265       .dwtag  DW_TAG_member
    3131                      .dwattr $C$DW$265, DW_AT_type(*$C$DW$T$20)
    3132                      .dwattr $C$DW$265, DW_AT_name("TIM")
    3133                      .dwattr $C$DW$265, DW_AT_TI_symbol_name("_TIM")
    3134                      .dwattr $C$DW$265, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    3135                      .dwattr $C$DW$265, DW_AT_accessibility(DW_ACCESS_public)
    3136              $C$DW$266       .dwtag  DW_TAG_member
    3137                      .dwattr $C$DW$266, DW_AT_type(*$C$DW$T$20)
    3138                      .dwattr $C$DW$266, DW_AT_name("PRD")
    3139                      .dwattr $C$DW$266, DW_AT_TI_symbol_name("_PRD")
TMS320C2000 Assembler PC v6.2.5 Fri Sep 15 11:07:51 2017

Tools Copyright (c) 1996-2014 Texas Instruments Incorporated
C:\Users\wmj\AppData\Local\Temp\0762011                              PAGE   59

    3140                      .dwattr $C$DW$266, DW_AT_data_member_location[DW_OP_plus_uconst 0x2]
    3141                      .dwattr $C$DW$266, DW_AT_accessibility(DW_ACCESS_public)
    3142              $C$DW$267       .dwtag  DW_TAG_member
    3143                      .dwattr $C$DW$267, DW_AT_type(*$C$DW$T$22)
    3144                      .dwattr $C$DW$267, DW_AT_name("TCR")
    3145                      .dwattr $C$DW$267, DW_AT_TI_symbol_name("_TCR")
    3146                      .dwattr $C$DW$267, DW_AT_data_member_location[DW_OP_plus_uconst 0x4]
    3147                      .dwattr $C$DW$267, DW_AT_accessibility(DW_ACCESS_public)
    3148              $C$DW$268       .dwtag  DW_TAG_member
    3149                      .dwattr $C$DW$268, DW_AT_type(*$C$DW$T$22)
    3150                      .dwattr $C$DW$268, DW_AT_name("resvd_1")
    3151                      .dwattr $C$DW$268, DW_AT_TI_symbol_name("_resvd_1")
    3152                      .dwattr $C$DW$268, DW_AT_data_member_location[DW_OP_plus_uconst 0x5]
    3153                      .dwattr $C$DW$268, DW_AT_accessibility(DW_ACCESS_public)
    3154              $C$DW$269       .dwtag  DW_TAG_member
    3155                      .dwattr $C$DW$269, DW_AT_type(*$C$DW$T$20)
    3156                      .dwattr $C$DW$269, DW_AT_name("TPR")
    3157                      .dwattr $C$DW$269, DW_AT_TI_symbol_name("_TPR")
    3158                      .dwattr $C$DW$269, DW_AT_data_member_location[DW_OP_plus_uconst 0x6]
    3159                      .dwattr $C$DW$269, DW_AT_accessibility(DW_ACCESS_public)
    3160                      .dwendtag $C$DW$T$55
    3161              
    3162              $C$DW$T$79      .dwtag  DW_TAG_typedef, DW_AT_name("TIMER_Obj")
    3163                      .dwattr $C$DW$T$79, DW_AT_type(*$C$DW$T$55)
    3164                      .dwattr $C$DW$T$79, DW_AT_language(DW_LANG_C)
    3165              $C$DW$T$32      .dwtag  DW_TAG_pointer_type
    3166                      .dwattr $C$DW$T$32, DW_AT_type(*$C$DW$T$55)
    3167                      .dwattr $C$DW$T$32, DW_AT_address_class(0x16)
    3168              $C$DW$T$33      .dwtag  DW_TAG_typedef, DW_AT_name("TIMER_Handle")
    3169                      .dwattr $C$DW$T$33, DW_AT_type(*$C$DW$T$32)
    3170                      .dwattr $C$DW$T$33, DW_AT_language(DW_LANG_C)
    3171              $C$DW$270       .dwtag  DW_TAG_TI_far_type
    3172                      .dwattr $C$DW$270, DW_AT_type(*$C$DW$T$33)
    3173              $C$DW$T$80      .dwtag  DW_TAG_const_type
    3174                      .dwattr $C$DW$T$80, DW_AT_type(*$C$DW$270)
    3175              $C$DW$T$3       .dwtag  DW_TAG_pointer_type
    3176                      .dwattr $C$DW$T$3, DW_AT_address_class(0x16)
    3177              $C$DW$271       .dwtag  DW_TAG_TI_far_type
    3178                      .dwattr $C$DW$271, DW_AT_type(*$C$DW$T$3)
    3179              $C$DW$T$82      .dwtag  DW_TAG_const_type
    3180                      .dwattr $C$DW$T$82, DW_AT_type(*$C$DW$271)
    3181              $C$DW$T$4       .dwtag  DW_TAG_base_type
    3182                      .dwattr $C$DW$T$4, DW_AT_encoding(DW_ATE_boolean)
    3183                      .dwattr $C$DW$T$4, DW_AT_name("bool")
    3184                      .dwattr $C$DW$T$4, DW_AT_byte_size(0x01)
    3185              $C$DW$T$5       .dwtag  DW_TAG_base_type
    3186                      .dwattr $C$DW$T$5, DW_AT_encoding(DW_ATE_signed_char)
    3187                      .dwattr $C$DW$T$5, DW_AT_name("signed char")
    3188                      .dwattr $C$DW$T$5, DW_AT_byte_size(0x01)
    3189              $C$DW$T$6       .dwtag  DW_TAG_base_type
    3190                      .dwattr $C$DW$T$6, DW_AT_encoding(DW_ATE_unsigned_char)
    3191                      .dwattr $C$DW$T$6, DW_AT_name("unsigned char")
    3192                      .dwattr $C$DW$T$6, DW_AT_byte_size(0x01)
    3193              $C$DW$T$38      .dwtag  DW_TAG_typedef, DW_AT_name("UCHAR")
    3194                      .dwattr $C$DW$T$38, DW_AT_type(*$C$DW$T$6)
TMS320C2000 Assembler PC v6.2.5 Fri Sep 15 11:07:51 2017

Tools Copyright (c) 1996-2014 Texas Instruments Incorporated
C:\Users\wmj\AppData\Local\Temp\0762011                              PAGE   60

    3195                      .dwattr $C$DW$T$38, DW_AT_language(DW_LANG_C)
    3196              
    3197              $C$DW$T$39      .dwtag  DW_TAG_array_type
    3198                      .dwattr $C$DW$T$39, DW_AT_type(*$C$DW$T$38)
    3199                      .dwattr $C$DW$T$39, DW_AT_language(DW_LANG_C)
    3200                      .dwattr $C$DW$T$39, DW_AT_byte_size(0x08)
    3201              $C$DW$272       .dwtag  DW_TAG_subrange_type
    3202                      .dwattr $C$DW$272, DW_AT_upper_bound(0x07)
    3203                      .dwendtag $C$DW$T$39
    3204              
    3205              $C$DW$T$40      .dwtag  DW_TAG_pointer_type
    3206                      .dwattr $C$DW$T$40, DW_AT_type(*$C$DW$T$38)
    3207                      .dwattr $C$DW$T$40, DW_AT_address_class(0x16)
    3208              
    3209              $C$DW$T$52      .dwtag  DW_TAG_array_type
    3210                      .dwattr $C$DW$T$52, DW_AT_type(*$C$DW$T$38)
    3211                      .dwattr $C$DW$T$52, DW_AT_language(DW_LANG_C)
