TMS320C2000 Assembler PC v6.2.5 Fri Sep 29 09:29:33 2017

Tools Copyright (c) 1996-2014 Texas Instruments Incorporated
C:\Users\wmj\AppData\Local\Temp\1142410                              PAGE    1

       1              ;***************************************************************
       2              ;* TMS320C2000 C/C++ Codegen                         PC v6.2.5 *
       3              ;* Date/Time created: Fri Sep 29 09:29:33 2017                 *
       4              ;***************************************************************
       5                      .compiler_opts --float_support=softlib --hll_source=on --mem_model:code=flat --mem_model:data=large -
       6        0002  FP      .set    XAR2
       7              
       8              $C$DW$CU        .dwtag  DW_TAG_compile_unit
       9                      .dwattr $C$DW$CU, DW_AT_name("D:/BM1000/sw/drivers/drvic/modbus/mb.c")
      10                      .dwattr $C$DW$CU, DW_AT_producer("TMS320C2000 C/C++ Codegen PC v6.2.5 Copyright (c) 1996-2014 Texas I
      11                      .dwattr $C$DW$CU, DW_AT_TI_version(0x01)
      12                      .dwattr $C$DW$CU, DW_AT_comp_dir("D:\BM1000\sw\solutions\instaspin_foc\boards\hvkit_rev1p1\f28x\f2802
      13              
      14              $C$DW$1 .dwtag  DW_TAG_subprogram, DW_AT_name("SCI_enableRx")
      15                      .dwattr $C$DW$1, DW_AT_TI_symbol_name("_SCI_enableRx")

    3072              $C$DW$385       .dwtag  DW_TAG_enumerator, DW_AT_name("USER_ErrorCode_IdRatedFraction_ratedFlux_Low"), DW_AT_
    3073              $C$DW$386       .dwtag  DW_TAG_enumerator, DW_AT_name("USER_ErrorCode_IdRated_delta_High"), DW_AT_const_value
    3074              $C$DW$387       .dwtag  DW_TAG_enumerator, DW_AT_name("USER_ErrorCode_IdRated_delta_Low"), DW_AT_const_value(
    3075              $C$DW$388       .dwtag  DW_TAG_enumerator, DW_AT_name("USER_ErrorCode_fluxEstFreq_Hz_High"), DW_AT_const_valu
    3076              $C$DW$389       .dwtag  DW_TAG_enumerator, DW_AT_name("USER_ErrorCode_fluxEstFreq_Hz_Low"), DW_AT_const_value
    3077              $C$DW$390       .dwtag  DW_TAG_enumerator, DW_AT_name("USER_ErrorCode_ctrlFreq_Hz_High"), DW_AT_const_value(0
    3078              $C$DW$391       .dwtag  DW_TAG_enumerator, DW_AT_name("USER_ErrorCode_ctrlFreq_Hz_Low"), DW_AT_const_value(0x
    3079              $C$DW$392       .dwtag  DW_TAG_enumerator, DW_AT_name("USER_ErrorCode_estFreq_Hz_High"), DW_AT_const_value(0x
    3080              $C$DW$393       .dwtag  DW_TAG_enumerator, DW_AT_name("USER_ErrorCode_estFreq_Hz_Low"), DW_AT_const_value(0x6
    3081              $C$DW$394       .dwtag  DW_TAG_enumerator, DW_AT_name("USER_ErrorCode_RoverL_estFreq_Hz_High"), DW_AT_const_v
    3082              $C$DW$395       .dwtag  DW_TAG_enumerator, DW_AT_name("USER_ErrorCode_RoverL_estFreq_Hz_Low"), DW_AT_const_va
TMS320C2000 Assembler PC v6.2.5 Fri Sep 29 09:29:33 2017

Tools Copyright (c) 1996-2014 Texas Instruments Incorporated
C:\Users\wmj\AppData\Local\Temp\1142410                              PAGE   58

    3083              $C$DW$396       .dwtag  DW_TAG_enumerator, DW_AT_name("USER_ErrorCode_trajFreq_Hz_High"), DW_AT_const_value(0
    3084              $C$DW$397       .dwtag  DW_TAG_enumerator, DW_AT_name("USER_ErrorCode_trajFreq_Hz_Low"), DW_AT_const_value(0x
    3085              $C$DW$398       .dwtag  DW_TAG_enumerator, DW_AT_name("USER_ErrorCode_ctrlPeriod_sec_High"), DW_AT_const_valu
    3086              $C$DW$399       .dwtag  DW_TAG_enumerator, DW_AT_name("USER_ErrorCode_ctrlPeriod_sec_Low"), DW_AT_const_value
    3087              $C$DW$400       .dwtag  DW_TAG_enumerator, DW_AT_name("USER_ErrorCode_maxNegativeIdCurrent_a_High"), DW_AT_co
    3088              $C$DW$401       .dwtag  DW_TAG_enumerator, DW_AT_name("USER_ErrorCode_maxNegativeIdCurrent_a_Low"), DW_AT_con
    3089              $C$DW$402       .dwtag  DW_TAG_enumerator, DW_AT_name("USER_numErrorCodes"), DW_AT_const_value(0x6a)
    3090                      .dwendtag $C$DW$T$172
    3091              
    3092              $C$DW$T$173     .dwtag  DW_TAG_typedef, DW_AT_name("USER_ErrorCode_e")
    3093                      .dwattr $C$DW$T$173, DW_AT_type(*$C$DW$T$172)
    3094                      .dwattr $C$DW$T$173, DW_AT_language(DW_LANG_C)
    3095              
    3096              $C$DW$T$229     .dwtag  DW_TAG_enumeration_type
    3097                      .dwattr $C$DW$T$229, DW_AT_byte_size(0x01)
    3098              $C$DW$403       .dwtag  DW_TAG_enumerator, DW_AT_name("MB_EX_NONE"), DW_AT_const_value(0x00)
    3099              $C$DW$404       .dwtag  DW_TAG_enumerator, DW_AT_name("MB_EX_ILLEGAL_FUNCTION"), DW_AT_const_value(0x01)
    3100              $C$DW$405       .dwtag  DW_TAG_enumerator, DW_AT_name("MB_EX_ILLEGAL_DATA_ADDRESS"), DW_AT_const_value(0x02)
    3101              $C$DW$406       .dwtag  DW_TAG_enumerator, DW_AT_name("MB_EX_ILLEGAL_DATA_VALUE"), DW_AT_const_value(0x03)
    3102              $C$DW$407       .dwtag  DW_TAG_enumerator, DW_AT_name("MB_EX_SLAVE_DEVICE_FAILURE"), DW_AT_const_value(0x04)
    3103              $C$DW$408       .dwtag  DW_TAG_enumerator, DW_AT_name("MB_EX_ACKNOWLEDGE"), DW_AT_const_value(0x05)
    3104              $C$DW$409       .dwtag  DW_TAG_enumerator, DW_AT_name("MB_EX_SLAVE_BUSY"), DW_AT_const_value(0x06)
    3105              $C$DW$410       .dwtag  DW_TAG_enumerator, DW_AT_name("MB_EX_MEMORY_PARITY_ERROR"), DW_AT_const_value(0x08)
    3106              $C$DW$411       .dwtag  DW_TAG_enumerator, DW_AT_name("MB_EX_GATEWAY_PATH_FAILED"), DW_AT_const_value(0x0a)
    3107              $C$DW$412       .dwtag  DW_TAG_enumerator, DW_AT_name("MB_EX_GATEWAY_TGT_FAILED"), DW_AT_const_value(0x0b)
    3108                      .dwendtag $C$DW$T$229
    3109              
    3110              $C$DW$T$230     .dwtag  DW_TAG_typedef, DW_AT_name("eMBException")
    3111                      .dwattr $C$DW$T$230, DW_AT_type(*$C$DW$T$229)
    3112                      .dwattr $C$DW$T$230, DW_AT_language(DW_LANG_C)
    3113              
    3114              $C$DW$T$19      .dwtag  DW_TAG_structure_type
    3115                      .dwattr $C$DW$T$19, DW_AT_name("I2C_Obj")
    3116                      .dwattr $C$DW$T$19, DW_AT_declaration
    3117                      .dwendtag $C$DW$T$19
    3118              
    3119              $C$DW$T$131     .dwtag  DW_TAG_pointer_type
    3120                      .dwattr $C$DW$T$131, DW_AT_type(*$C$DW$T$19)
    3121                      .dwattr $C$DW$T$131, DW_AT_address_class(0x16)
    3122              $C$DW$T$132     .dwtag  DW_TAG_typedef, DW_AT_name("I2C_Handle")
    3123                      .dwattr $C$DW$T$132, DW_AT_type(*$C$DW$T$131)
    3124                      .dwattr $C$DW$T$132, DW_AT_language(DW_LANG_C)
    3125              
    3126              $C$DW$T$31      .dwtag  DW_TAG_structure_type
    3127                      .dwattr $C$DW$T$31, DW_AT_name("_ADC_Obj_")
    3128                      .dwattr $C$DW$T$31, DW_AT_byte_size(0x6650)
    3129              $C$DW$413       .dwtag  DW_TAG_member
    3130                      .dwattr $C$DW$413, DW_AT_type(*$C$DW$T$25)
    3131                      .dwattr $C$DW$413, DW_AT_name("ADCRESULT")
    3132                      .dwattr $C$DW$413, DW_AT_TI_symbol_name("_ADCRESULT")
    3133                      .dwattr $C$DW$413, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    3134                      .dwattr $C$DW$413, DW_AT_accessibility(DW_ACCESS_public)
    3135              $C$DW$414       .dwtag  DW_TAG_member
    3136                      .dwattr $C$DW$414, DW_AT_type(*$C$DW$T$26)
    3137                      .dwattr $C$DW$414, DW_AT_name("resvd_1")
TMS320C2000 Assembler PC v6.2.5 Fri Sep 29 09:29:33 2017

Tools Copyright (c) 1996-2014 Texas Instruments Incorporated
C:\Users\wmj\AppData\Local\Temp\1142410                              PAGE   59

    3138                      .dwattr $C$DW$414, DW_AT_TI_symbol_name("_resvd_1")
    3139                      .dwattr $C$DW$414, DW_AT_data_member_location[DW_OP_plus_uconst 0x10]
    3140                      .dwattr $C$DW$414, DW_AT_accessibility(DW_ACCESS_public)
    3141              $C$DW$415       .dwtag  DW_TAG_member
    3142                      .dwattr $C$DW$415, DW_AT_type(*$C$DW$T$24)
    3143                      .dwattr $C$DW$415, DW_AT_name("ADCCTL1")
    3144                      .dwattr $C$DW$415, DW_AT_TI_symbol_name("_ADCCTL1")
    3145                      .dwattr $C$DW$415, DW_AT_data_member_location[DW_OP_plus_uconst 0x6600]
    3146                      .dwattr $C$DW$415, DW_AT_accessibility(DW_ACCESS_public)
    3147              $C$DW$416       .dwtag  DW_TAG_member
    3148                      .dwattr $C$DW$416, DW_AT_type(*$C$DW$T$24)
    3149                      .dwattr $C$DW$416, DW_AT_name("ADCCTL2")
    3150                      .dwattr $C$DW$416, DW_AT_TI_symbol_name("_ADCCTL2")
    3151                      .dwattr $C$DW$416, DW_AT_data_member_location[DW_OP_plus_uconst 0x6601]
    3152                      .dwattr $C$DW$416, DW_AT_accessibility(DW_ACCESS_public)
    3153              $C$DW$417       .dwtag  DW_TAG_member
    3154                      .dwattr $C$DW$417, DW_AT_type(*$C$DW$T$27)
    3155                      .dwattr $C$DW$417, DW_AT_name("rsvd_2")
    3156                      .dwattr $C$DW$417, DW_AT_TI_symbol_name("_rsvd_2")
    3157                      .dwattr $C$DW$417, DW_AT_data_member_location[DW_OP_plus_uconst 0x6602]
    3158                      .dwattr $C$DW$417, DW_AT_accessibility(DW_ACCESS_public)
    3159              $C$DW$418       .dwtag  DW_TAG_member
    3160                      .dwattr $C$DW$418, DW_AT_type(*$C$DW$T$24)
    3161                      .dwattr $C$DW$418, DW_AT_name("ADCINTFLG")
    3162                      .dwattr $C$DW$418, DW_AT_TI_symbol_name("_ADCINTFLG")
    3163                      .dwattr $C$DW$418, DW_AT_data_member_location[DW_OP_plus_uconst 0x6604]
    3164                      .dwattr $C$DW$418, DW_AT_accessibility(DW_ACCESS_public)
    3165              $C$DW$419       .dwtag  DW_TAG_member
    3166                      .dwattr $C$DW$419, DW_AT_type(*$C$DW$T$24)
    3167                      .dwattr $C$DW$419, DW_AT_name("ADCINTFLGCLR")
    3168                      .dwattr $C$DW$419, DW_AT_TI_symbol_name("_ADCINTFLGCLR")
    3169                      .dwattr $C$DW$419, DW_AT_data_member_location[DW_OP_plus_uconst 0x6605]
    3170                      .dwattr $C$DW$419, DW_AT_accessibility(DW_ACCESS_public)
    3171              $C$DW$420       .dwtag  DW_TAG_member
    3172                      .dwattr $C$DW$420, DW_AT_type(*$C$DW$T$24)
    3173                      .dwattr $C$DW$420, DW_AT_name("ADCINTOVF")
    3174                      .dwattr $C$DW$420, DW_AT_TI_symbol_name("_ADCINTOVF")
    3175                      .dwattr $C$DW$420, DW_AT_data_member_location[DW_OP_plus_uconst 0x6606]
    3176                      .dwattr $C$DW$420, DW_AT_accessibility(DW_ACCESS_public)
    3177              $C$DW$421       .dwtag  DW_TAG_member
    3178                      .dwattr $C$DW$421, DW_AT_type(*$C$DW$T$24)
    3179                      .dwattr $C$DW$421, DW_AT_name("ADCINTOVFCLR")
    3180                      .dwattr $C$DW$421, DW_AT_TI_symbol_name("_ADCINTOVFCLR")
    3181                      .dwattr $C$DW$421, DW_AT_data_member_location[DW_OP_plus_uconst 0x6607]
    3182                      .dwattr $C$DW$421, DW_AT_accessibility(DW_ACCESS_public)
    3183              $C$DW$422       .dwtag  DW_TAG_member
    3184                      .dwattr $C$DW$422, DW_AT_type(*$C$DW$T$28)
    3185                      .dwattr $C$DW$422, DW_AT_name("INTSELxNy")
    3186                      .dwattr $C$DW$422, DW_AT_TI_symbol_name("_INTSELxNy")
    3187                      .dwattr $C$DW$422, DW_AT_data_member_location[DW_OP_plus_uconst 0x6608]
    3188                      .dwattr $C$DW$422, DW_AT_accessibility(DW_ACCESS_public)
    3189              $C$DW$423       .dwtag  DW_TAG_member
    3190                      .dwattr $C$DW$423, DW_AT_type(*$C$DW$T$29)
    3191                      .dwattr $C$DW$423, DW_AT_name("rsvd_3")
    3192                      .dwattr $C$DW$423, DW_AT_TI_symbol_name("_rsvd_3")
TMS320C2000 Assembler PC v6.2.5 Fri Sep 29 09:29:33 2017

Tools Copyright (c) 1996-2014 Texas Instruments Incorporated
C:\Users\wmj\AppData\Local\Temp\1142410                              PAGE   60

    3193                      .dwattr $C$DW$423, DW_AT_data_member_location[DW_OP_plus_uconst 0x660d]
    3194                      .dwattr $C$DW$423, DW_AT_accessibility(DW_ACCESS_public)
    3195              $C$DW$424       .dwtag  DW_TAG_member
    3196                      .dwattr $C$DW$424, DW_AT_type(*$C$DW$T$24)
    3197                      .dwattr $C$DW$424, DW_AT_name("SOCPRICTRL")
    3198                      .dwattr $C$DW$424, DW_AT_TI_symbol_name("_SOCPRICTRL")
    3199                      .dwattr $C$DW$424, DW_AT_data_member_location[DW_OP_plus_uconst 0x6610]
    3200                      .dwattr $C$DW$424, DW_AT_accessibility(DW_ACCESS_public)
    3201              $C$DW$425       .dwtag  DW_TAG_member
    3202                      .dwattr $C$DW$425, DW_AT_type(*$C$DW$T$24)
    3203                      .dwattr $C$DW$425, DW_AT_name("rsvd_4")
    3204                      .dwattr $C$DW$425, DW_AT_TI_symbol_name("_rsvd_4")
    3205                      .dwattr $C$DW$425, DW_AT_data_member_location[DW_OP_plus_uconst 0x6611]
    3206                      .dwattr $C$DW$425, DW_AT_accessibility(DW_ACCESS_public)
    3207              $C$DW$426       .dwtag  DW_TAG_member
    3208                      .dwattr $C$DW$426, DW_AT_type(*$C$DW$T$24)
    3209                      .dwattr $C$DW$426, DW_AT_name("ADCSAMPLEMODE")
    3210                      .dwattr $C$DW$426, DW_AT_TI_symbol_name("_ADCSAMPLEMODE")
    3211                      .dwattr $C$DW$426, DW_AT_data_member_location[DW_OP_plus_uconst 0x6612]
    3212                      .dwattr $C$DW$426, DW_AT_accessibility(DW_ACCESS_public)
    3213              $C$DW$427       .dwtag  DW_TAG_member
    3214                      .dwattr $C$DW$427, DW_AT_type(*$C$DW$T$24)
    3215                      .dwattr $C$DW$427, DW_AT_name("rsvd_5")
    3216                      .dwattr $C$DW$427, DW_AT_TI_symbol_name("_rsvd_5")
    3217                      .dwattr $C$DW$427, DW_AT_data_member_location[DW_OP_plus_uconst 0x6613]
    3218                      .dwattr $C$DW$427, DW_AT_accessibility(DW_ACCESS_public)
    3219              $C$DW$428       .dwtag  DW_TAG_member
    3220                      .dwattr $C$DW$428, DW_AT_type(*$C$DW$T$24)
    3221                      .dwattr $C$DW$428, DW_AT_name("ADCINTSOCSEL1")
    3222                      .dwattr $C$DW$428, DW_AT_TI_symbol_name("_ADCINTSOCSEL1")
    3223                      .dwattr $C$DW$428, DW_AT_data_member_location[DW_OP_plus_uconst 0x6614]
    3224                      .dwattr $C$DW$428, DW_AT_accessibility(DW_ACCESS_public)
    3225              $C$DW$429       .dwtag  DW_TAG_member
    3226                      .dwattr $C$DW$429, DW_AT_type(*$C$DW$T$24)
    3227                      .dwattr $C$DW$429, DW_AT_name("ADCINTSOCSEL2")
    3228                      .dwattr $C$DW$429, DW_AT_TI_symbol_name("_ADCINTSOCSEL2")
    3229                      .dwattr $C$DW$429, DW_AT_data_member_location[DW_OP_plus_uconst 0x6615]
    3230                      .dwattr $C$DW$429, DW_AT_accessibility(DW_ACCESS_public)
    3231              $C$DW$430       .dwtag  DW_TAG_member
    3232                      .dwattr $C$DW$430, DW_AT_type(*$C$DW$T$27)
    3233                      .dwattr $C$DW$430, DW_AT_name("rsvd_6")
    3234                      .dwattr $C$DW$430, DW_AT_TI_symbol_name("_rsvd_6")
    3235                      .dwattr $C$DW$430, DW_AT_data_member_location[DW_OP_plus_uconst 0x6616]
    3236                      .dwattr $C$DW$430, DW_AT_accessibility(DW_ACCESS_public)
    3237              $C$DW$431       .dwtag  DW_TAG_member
    3238                      .dwattr $C$DW$431, DW_AT_type(*$C$DW$T$24)
    3239                      .dwattr $C$DW$431, DW_AT_name("ADCSOCFLG1")
    3240                      .dwattr $C$DW$431, DW_AT_TI_symbol_name("_ADCSOCFLG1")
    3241                      .dwattr $C$DW$431, DW_AT_data_member_location[DW_OP_plus_uconst 0x6618]
    3242                      .dwattr $C$DW$431, DW_AT_accessibility(DW_ACCESS_public)
    3243              $C$DW$432       .dwtag  DW_TAG_member
    3244                      .dwattr $C$DW$432, DW_AT_type(*$C$DW$T$24)
    3245                      .dwattr $C$DW$432, DW_AT_name("rsvd_7")
    3246                      .dwattr $C$DW$432, DW_AT_TI_symbol_name("_rsvd_7")
    3247                      .dwattr $C$DW$432, DW_AT_data_member_location[DW_OP_plus_uconst 0x6619]
TMS320C2000 Assembler PC v6.2.5 Fri Sep 29 09:29:33 2017

Tools Copyright (c) 1996-2014 Texas Instruments Incorporated
C:\Users\wmj\AppData\Local\Temp\1142410                              PAGE   61

    3248                      .dwattr $C$DW$432, DW_AT_accessibility(DW_ACCESS_public)
    3249              $C$DW$433       .dwtag  DW_TAG_member
    3250                      .dwattr $C$DW$433, DW_AT_type(*$C$DW$T$24)
    3251                      .dwattr $C$DW$433, DW_AT_name("ADCSOCFRC1")
    3252                      .dwattr $C$DW$433, DW_AT_TI_symbol_name("_ADCSOCFRC1")
    3253                      .dwattr $C$DW$433, DW_AT_data_member_location[DW_OP_plus_uconst 0x661a]
    3254                      .dwattr $C$DW$433, DW_AT_accessibility(DW_ACCESS_public)
    3255              $C$DW$434       .dwtag  DW_TAG_member
    3256                      .dwattr $C$DW$434, DW_AT_type(*$C$DW$T$24)
    3257                      .dwattr $C$DW$434, DW_AT_name("rsvd_8")
    3258                      .dwattr $C$DW$434, DW_AT_TI_symbol_name("_rsvd_8")
    3259                      .dwattr $C$DW$434, DW_AT_data_member_location[DW_OP_plus_uconst 0x661b]
    3260                      .dwattr $C$DW$434, DW_AT_accessibility(DW_ACCESS_public)
    3261              $C$DW$435       .dwtag  DW_TAG_member
    3262                      .dwattr $C$DW$435, DW_AT_type(*$C$DW$T$24)
    3263                      .dwattr $C$DW$435, DW_AT_name("ADCSOCOVF1")
    3264                      .dwattr $C$DW$435, DW_AT_TI_symbol_name("_ADCSOCOVF1")
    3265                      .dwattr $C$DW$435, DW_AT_data_member_location[DW_OP_plus_uconst 0x661c]
    3266                      .dwattr $C$DW$435, DW_AT_accessibility(DW_ACCESS_public)
    3267              $C$DW$436       .dwtag  DW_TAG_member
    3268                      .dwattr $C$DW$436, DW_AT_type(*$C$DW$T$24)
    3269                      .dwattr $C$DW$436, DW_AT_name("rsvd_9")
    3270                      .dwattr $C$DW$436, DW_AT_TI_symbol_name("_rsvd_9")
    3271                      .dwattr $C$DW$436, DW_AT_data_member_location[DW_OP_plus_uconst 0x661d]
    3272                      .dwattr $C$DW$436, DW_AT_accessibility(DW_ACCESS_public)
    3273              $C$DW$437       .dwtag  DW_TAG_member
    3274                      .dwattr $C$DW$437, DW_AT_type(*$C$DW$T$24)
    3275                      .dwattr $C$DW$437, DW_AT_name("ADCSOCOVFCLR1")
    3276                      .dwattr $C$DW$437, DW_AT_TI_symbol_name("_ADCSOCOVFCLR1")
    3277                      .dwattr $C$DW$437, DW_AT_data_member_location[DW_OP_plus_uconst 0x661e]
    3278                      .dwattr $C$DW$437, DW_AT_accessibility(DW_ACCESS_public)
    3279              $C$DW$438       .dwtag  DW_TAG_member
    3280                      .dwattr $C$DW$438, DW_AT_type(*$C$DW$T$24)
    3281                      .dwattr $C$DW$438, DW_AT_name("rsvd_10")
    3282                      .dwattr $C$DW$438, DW_AT_TI_symbol_name("_rsvd_10")
    3283                      .dwattr $C$DW$438, DW_AT_data_member_location[DW_OP_plus_uconst 0x661f]
    3284                      .dwattr $C$DW$438, DW_AT_accessibility(DW_ACCESS_public)
    3285              $C$DW$439       .dwtag  DW_TAG_member
    3286                      .dwattr $C$DW$439, DW_AT_type(*$C$DW$T$25)
    3287                      .dwattr $C$DW$439, DW_AT_name("ADCSOCxCTL")
    3288                      .dwattr $C$DW$439, DW_AT_TI_symbol_name("_ADCSOCxCTL")
    3289                      .dwattr $C$DW$439, DW_AT_data_member_location[DW_OP_plus_uconst 0x6620]
    3290                      .dwattr $C$DW$439, DW_AT_accessibility(DW_ACCESS_public)
    3291              $C$DW$440       .dwtag  DW_TAG_member
    3292                      .dwattr $C$DW$440, DW_AT_type(*$C$DW$T$25)
    3293                      .dwattr $C$DW$440, DW_AT_name("rsvd_11")
    3294                      .dwattr $C$DW$440, DW_AT_TI_symbol_name("_rsvd_11")
    3295                      .dwattr $C$DW$440, DW_AT_data_member_location[DW_OP_plus_uconst 0x6630]
    3296                      .dwattr $C$DW$440, DW_AT_accessibility(DW_ACCESS_public)
    3297              $C$DW$441       .dwtag  DW_TAG_member
    3298                      .dwattr $C$DW$441, DW_AT_type(*$C$DW$T$24)
    3299                      .dwattr $C$DW$441, DW_AT_name("ADCREFTRIM")
    3300                      .dwattr $C$DW$441, DW_AT_TI_symbol_name("_ADCREFTRIM")
    3301                      .dwattr $C$DW$441, DW_AT_data_member_location[DW_OP_plus_uconst 0x6640]
    3302                      .dwattr $C$DW$441, DW_AT_accessibility(DW_ACCESS_public)
TMS320C2000 Assembler PC v6.2.5 Fri Sep 29 09:29:33 2017

Tools Copyright (c) 1996-2014 Texas Instruments Incorporated
C:\Users\wmj\AppData\Local\Temp\1142410                              PAGE   62

    3303              $C$DW$442       .dwtag  DW_TAG_member
    3304                      .dwattr $C$DW$442, DW_AT_type(*$C$DW$T$24)
    3305                      .dwattr $C$DW$442, DW_AT_name("ADCOFFTRIM")
    3306                      .dwattr $C$DW$442, DW_AT_TI_symbol_name("_ADCOFFTRIM")
    3307                      .dwattr $C$DW$442, DW_AT_data_member_location[DW_OP_plus_uconst 0x6641]
    3308                      .dwattr $C$DW$442, DW_AT_accessibility(DW_ACCESS_public)
    3309              $C$DW$443       .dwtag  DW_TAG_member
    3310                      .dwattr $C$DW$443, DW_AT_type(*$C$DW$T$30)
    3311                      .dwattr $C$DW$443, DW_AT_name("resvd_12")
    3312                      .dwattr $C$DW$443, DW_AT_TI_symbol_name("_resvd_12")
    3313                      .dwattr $C$DW$443, DW_AT_data_member_location[DW_OP_plus_uconst 0x6642]
    3314                      .dwattr $C$DW$443, DW_AT_accessibility(DW_ACCESS_public)
    3315              $C$DW$444       .dwtag  DW_TAG_member
    3316                      .dwattr $C$DW$444, DW_AT_type(*$C$DW$T$24)
    3317                      .dwattr $C$DW$444, DW_AT_name("ADCREV")
    3318                      .dwattr $C$DW$444, DW_AT_TI_symbol_name("_ADCREV")
    3319                      .dwattr $C$DW$444, DW_AT_data_member_location[DW_OP_plus_uconst 0x664f]
    3320                      .dwattr $C$DW$444, DW_AT_accessibility(DW_ACCESS_public)
    3321                      .dwendtag $C$DW$T$31
    3322              
    3323              $C$DW$T$102     .dwtag  DW_TAG_pointer_type
    3324                      .dwattr $C$DW$T$102, DW_AT_type(*$C$DW$T$31)
    3325                      .dwattr $C$DW$T$102, DW_AT_address_class(0x16)
    3326              $C$DW$T$103     .dwtag  DW_TAG_typedef, DW_AT_name("ADC_Handle")
    3327                      .dwattr $C$DW$T$103, DW_AT_type(*$C$DW$T$102)
    3328                      .dwattr $C$DW$T$103, DW_AT_language(DW_LANG_C)
    3329              
    3330              $C$DW$T$35      .dwtag  DW_TAG_structure_type
    3331                      .dwattr $C$DW$T$35, DW_AT_name("_BRAKE_Obj_")
    3332                      .dwattr $C$DW$T$35, DW_AT_byte_size(0x08)
    3333              $C$DW$445       .dwtag  DW_TAG_member
    3334                      .dwattr $C$DW$445, DW_AT_type(*$C$DW$T$32)
    3335                      .dwattr $C$DW$445, DW_AT_name("angle_pu")
    3336                      .dwattr $C$DW$445, DW_AT_TI_symbol_name("_angle_pu")
    3337                      .dwattr $C$DW$445, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    3338                      .dwattr $C$DW$445, DW_AT_accessibility(DW_ACCESS_public)
    3339              $C$DW$446       .dwtag  DW_TAG_member
    3340                      .dwattr $C$DW$446, DW_AT_type(*$C$DW$T$33)
    3341                      .dwattr $C$DW$446, DW_AT_name("Idq_brake")
    3342                      .dwattr $C$DW$446, DW_AT_TI_symbol_name("_Idq_brake")
    3343                      .dwattr $C$DW$446, DW_AT_data_member_location[DW_OP_plus_uconst 0x2]
    3344                      .dwattr $C$DW$446, DW_AT_accessibility(DW_ACCESS_public)
    3345              $C$DW$447       .dwtag  DW_TAG_member
    3346                      .dwattr $C$DW$447, DW_AT_type(*$C$DW$T$34)
    3347                      .dwattr $C$DW$447, DW_AT_name("brake_enable")
    3348                      .dwattr $C$DW$447, DW_AT_TI_symbol_name("_brake_enable")
    3349                      .dwattr $C$DW$447, DW_AT_data_member_location[DW_OP_plus_uconst 0x6]
    3350                      .dwattr $C$DW$447, DW_AT_accessibility(DW_ACCESS_public)
    3351                      .dwendtag $C$DW$T$35
    3352              
    3353              $C$DW$T$74      .dwtag  DW_TAG_typedef, DW_AT_name("BRAKE_Obj")
    3354                      .dwattr $C$DW$T$74, DW_AT_type(*$C$DW$T$35)
    3355                      .dwattr $C$DW$T$74, DW_AT_language(DW_LANG_C)
    3356              $C$DW$T$72      .dwtag  DW_TAG_pointer_type
    3357                      .dwattr $C$DW$T$72, DW_AT_type(*$C$DW$T$35)
TMS320C2000 Assembler PC v6.2.5 Fri Sep 29 09:29:33 2017

Tools Copyright (c) 1996-2014 Texas Instruments Incorporated
C:\Users\wmj\AppData\Local\Temp\1142410                              PAGE   63

    3358                      .dwattr $C$DW$T$72, DW_AT_address_class(0x16)
    3359              $C$DW$T$73      .dwtag  DW_TAG_typedef, DW_AT_name("BRAKE_Handle")
    3360                      .dwattr $C$DW$T$73, DW_AT_type(*$C$DW$T$72)
    3361                      .dwattr $C$DW$T$73, DW_AT_language(DW_LANG_C)
    3362              
    3363              $C$DW$T$37      .dwtag  DW_TAG_structure_type
    3364                      .dwattr $C$DW$T$37, DW_AT_name("_CLARKE_Obj_")
    3365                      .dwattr $C$DW$T$37, DW_AT_byte_size(0x06)
    3366              $C$DW$448       .dwtag  DW_TAG_member
    3367                      .dwattr $C$DW$448, DW_AT_type(*$C$DW$T$32)
    3368                      .dwattr $C$DW$448, DW_AT_name("alpha_sf")
    3369                      .dwattr $C$DW$448, DW_AT_TI_symbol_name("_alpha_sf")
    3370                      .dwattr $C$DW$448, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    3371                      .dwattr $C$DW$448, DW_AT_accessibility(DW_ACCESS_public)
    3372              $C$DW$449       .dwtag  DW_TAG_member
    3373                      .dwattr $C$DW$449, DW_AT_type(*$C$DW$T$32)
    3374                      .dwattr $C$DW$449, DW_AT_name("beta_sf")
    3375                      .dwattr $C$DW$449, DW_AT_TI_symbol_name("_beta_sf")
    3376                      .dwattr $C$DW$449, DW_AT_data_member_location[DW_OP_plus_uconst 0x2]
    3377                      .dwattr $C$DW$449, DW_AT_accessibility(DW_ACCESS_public)
    3378              $C$DW$450       .dwtag  DW_TAG_member
    3379                      .dwattr $C$DW$450, DW_AT_type(*$C$DW$T$36)
    3380                      .dwattr $C$DW$450, DW_AT_name("numSensors")
    3381                      .dwattr $C$DW$450, DW_AT_TI_symbol_name("_numSensors")
    3382                      .dwattr $C$DW$450, DW_AT_data_member_location[DW_OP_plus_uconst 0x4]
    3383                      .dwattr $C$DW$450, DW_AT_accessibility(DW_ACCESS_public)
    3384                      .dwendtag $C$DW$T$37
    3385              
    3386              $C$DW$T$48      .dwtag  DW_TAG_typedef, DW_AT_name("CLARKE_Obj")
    3387                      .dwattr $C$DW$T$48, DW_AT_type(*$C$DW$T$37)
    3388                      .dwattr $C$DW$T$48, DW_AT_language(DW_LANG_C)
    3389              $C$DW$T$46      .dwtag  DW_TAG_pointer_type
    3390                      .dwattr $C$DW$T$46, DW_AT_type(*$C$DW$T$37)
    3391                      .dwattr $C$DW$T$46, DW_AT_address_class(0x16)
    3392              $C$DW$T$47      .dwtag  DW_TAG_typedef, DW_AT_name("CLARKE_Handle")
    3393                      .dwattr $C$DW$T$47, DW_AT_type(*$C$DW$T$46)
    3394                      .dwattr $C$DW$T$47, DW_AT_language(DW_LANG_C)
    3395              
    3396              $C$DW$T$39      .dwtag  DW_TAG_structure_type
    3397                      .dwattr $C$DW$T$39, DW_AT_name("_CLK_Obj_")
    3398                      .dwattr $C$DW$T$39, DW_AT_byte_size(0x11)
    3399              $C$DW$451       .dwtag  DW_TAG_member
    3400                      .dwattr $C$DW$451, DW_AT_type(*$C$DW$T$24)
    3401                      .dwattr $C$DW$451, DW_AT_name("XCLK")
    3402                      .dwattr $C$DW$451, DW_AT_TI_symbol_name("_XCLK")
    3403                      .dwattr $C$DW$451, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    3404                      .dwattr $C$DW$451, DW_AT_accessibility(DW_ACCESS_public)
    3405              $C$DW$452       .dwtag  DW_TAG_member
    3406                      .dwattr $C$DW$452, DW_AT_type(*$C$DW$T$24)
    3407                      .dwattr $C$DW$452, DW_AT_name("rsvd_1")
    3408                      .dwattr $C$DW$452, DW_AT_TI_symbol_name("_rsvd_1")
    3409                      .dwattr $C$DW$452, DW_AT_data_member_location[DW_OP_plus_uconst 0x1]
    3410                      .dwattr $C$DW$452, DW_AT_accessibility(DW_ACCESS_public)
    3411              $C$DW$453       .dwtag  DW_TAG_member
    3412                      .dwattr $C$DW$453, DW_AT_type(*$C$DW$T$24)
TMS320C2000 Assembler PC v6.2.5 Fri Sep 29 09:29:33 2017

Tools Copyright (c) 1996-2014 Texas Instruments Incorporated
C:\Users\wmj\AppData\Local\Temp\1142410                              PAGE   64

    3413                      .dwattr $C$DW$453, DW_AT_name("CLKCTL")
    3414                      .dwattr $C$DW$453, DW_AT_TI_symbol_name("_CLKCTL")
    3415                      .dwattr $C$DW$453, DW_AT_data_member_location[DW_OP_plus_uconst 0x2]
    3416                      .dwattr $C$DW$453, DW_AT_accessibility(DW_ACCESS_public)
    3417              $C$DW$454       .dwtag  DW_TAG_member
    3418                      .dwattr $C$DW$454, DW_AT_type(*$C$DW$T$38)
    3419                      .dwattr $C$DW$454, DW_AT_name("rsvd_2")
    3420                      .dwattr $C$DW$454, DW_AT_TI_symbol_name("_rsvd_2")
    3421                      .dwattr $C$DW$454, DW_AT_data_member_location[DW_OP_plus_uconst 0x3]
    3422                      .dwattr $C$DW$454, DW_AT_accessibility(DW_ACCESS_public)
    3423              $C$DW$455       .dwtag  DW_TAG_member
    3424                      .dwattr $C$DW$455, DW_AT_type(*$C$DW$T$24)
    3425                      .dwattr $C$DW$455, DW_AT_name("LOSPCP")
    3426                      .dwattr $C$DW$455, DW_AT_TI_symbol_name("_LOSPCP")
    3427                      .dwattr $C$DW$455, DW_AT_data_member_location[DW_OP_plus_uconst 0xb]
    3428                      .dwattr $C$DW$455, DW_AT_accessibility(DW_ACCESS_public)
    3429              $C$DW$456       .dwtag  DW_TAG_member
    3430                      .dwattr $C$DW$456, DW_AT_type(*$C$DW$T$24)
    3431                      .dwattr $C$DW$456, DW_AT_name("PCLKCR0")
    3432                      .dwattr $C$DW$456, DW_AT_TI_symbol_name("_PCLKCR0")
    3433                      .dwattr $C$DW$456, DW_AT_data_member_location[DW_OP_plus_uconst 0xc]
    3434                      .dwattr $C$DW$456, DW_AT_accessibility(DW_ACCESS_public)
    3435              $C$DW$457       .dwtag  DW_TAG_member
    3436                      .dwattr $C$DW$457, DW_AT_type(*$C$DW$T$24)
    3437                      .dwattr $C$DW$457, DW_AT_name("PCLKCR1")
    3438                      .dwattr $C$DW$457, DW_AT_TI_symbol_name("_PCLKCR1")
    3439                      .dwattr $C$DW$457, DW_AT_data_member_location[DW_OP_plus_uconst 0xd]
    3440                      .dwattr $C$DW$457, DW_AT_accessibility(DW_ACCESS_public)
    3441              $C$DW$458       .dwtag  DW_TAG_member
    3442                      .dwattr $C$DW$458, DW_AT_type(*$C$DW$T$27)
    3443                      .dwattr $C$DW$458, DW_AT_name("rsvd_3")
    3444                      .dwattr $C$DW$458, DW_AT_TI_symbol_name("_rsvd_3")
    3445                      .dwattr $C$DW$458, DW_AT_data_member_location[DW_OP_plus_uconst 0xe]
    3446                      .dwattr $C$DW$458, DW_AT_accessibility(DW_ACCESS_public)
    3447              $C$DW$459       .dwtag  DW_TAG_member
    3448                      .dwattr $C$DW$459, DW_AT_type(*$C$DW$T$24)
    3449                      .dwattr $C$DW$459, DW_AT_name("PCLKCR3")
    3450                      .dwattr $C$DW$459, DW_AT_TI_symbol_name("_PCLKCR3")
    3451                      .dwattr $C$DW$459, DW_AT_data_member_location[DW_OP_plus_uconst 0x10]
    3452                      .dwattr $C$DW$459, DW_AT_accessibility(DW_ACCESS_public)
    3453                      .dwendtag $C$DW$T$39
    3454              
    3455              $C$DW$T$104     .dwtag  DW_TAG_pointer_type
    3456                      .dwattr $C$DW$T$104, DW_AT_type(*$C$DW$T$39)
    3457                      .dwattr $C$DW$T$104, DW_AT_address_class(0x16)
    3458              $C$DW$T$105     .dwtag  DW_TAG_typedef, DW_AT_name("CLK_Handle")
    3459                      .dwattr $C$DW$T$105, DW_AT_type(*$C$DW$T$104)
    3460                      .dwattr $C$DW$T$105, DW_AT_language(DW_LANG_C)
    3461              
    3462              $C$DW$T$40      .dwtag  DW_TAG_structure_type
    3463                      .dwattr $C$DW$T$40, DW_AT_name("_CPU_Obj_")
    3464                      .dwattr $C$DW$T$40, DW_AT_byte_size(0x01)
    3465              $C$DW$460       .dwtag  DW_TAG_member
    3466                      .dwattr $C$DW$460, DW_AT_type(*$C$DW$T$36)
    3467                      .dwattr $C$DW$460, DW_AT_name("tmp")
TMS320C2000 Assembler PC v6.2.5 Fri Sep 29 09:29:33 2017

Tools Copyright (c) 1996-2014 Texas Instruments Incorporated
C:\Users\wmj\AppData\Local\Temp\1142410                              PAGE   65

    3468                      .dwattr $C$DW$460, DW_AT_TI_symbol_name("_tmp")
    3469                      .dwattr $C$DW$460, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    3470                      .dwattr $C$DW$460, DW_AT_accessibility(DW_ACCESS_public)
    3471                      .dwendtag $C$DW$T$40
    3472              
    3473              $C$DW$T$106     .dwtag  DW_TAG_pointer_type
    3474                      .dwattr $C$DW$T$106, DW_AT_type(*$C$DW$T$40)
    3475                      .dwattr $C$DW$T$106, DW_AT_address_class(0x16)
    3476              $C$DW$T$107     .dwtag  DW_TAG_typedef, DW_AT_name("CPU_Handle")
    3477                      .dwattr $C$DW$T$107, DW_AT_type(*$C$DW$T$106)
    3478                      .dwattr $C$DW$T$107, DW_AT_language(DW_LANG_C)
    3479              
    3480              $C$DW$T$75      .dwtag  DW_TAG_structure_type
    3481                      .dwattr $C$DW$T$75, DW_AT_name("_CTRL_Obj_")
    3482                      .dwattr $C$DW$T$75, DW_AT_byte_size(0x112)
    3483              $C$DW$461       .dwtag  DW_TAG_member
    3484                      .dwattr $C$DW$461, DW_AT_type(*$C$DW$T$41)
    3485                      .dwattr $C$DW$461, DW_AT_name("version")
    3486                      .dwattr $C$DW$461, DW_AT_TI_symbol_name("_version")
    3487                      .dwattr $C$DW$461, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    3488                      .dwattr $C$DW$461, DW_AT_accessibility(DW_ACCESS_public)
    3489              $C$DW$462       .dwtag  DW_TAG_member
    3490                      .dwattr $C$DW$462, DW_AT_type(*$C$DW$T$43)
    3491                      .dwattr $C$DW$462, DW_AT_name("state")
    3492                      .dwattr $C$DW$462, DW_AT_TI_symbol_name("_state")
    3493                      .dwattr $C$DW$462, DW_AT_data_member_location[DW_OP_plus_uconst 0x4]
    3494                      .dwattr $C$DW$462, DW_AT_accessibility(DW_ACCESS_public)
    3495              $C$DW$463       .dwtag  DW_TAG_member
    3496                      .dwattr $C$DW$463, DW_AT_type(*$C$DW$T$43)
    3497                      .dwattr $C$DW$463, DW_AT_name("prevState")
    3498                      .dwattr $C$DW$463, DW_AT_TI_symbol_name("_prevState")
    3499                      .dwattr $C$DW$463, DW_AT_data_member_location[DW_OP_plus_uconst 0x5]
    3500                      .dwattr $C$DW$463, DW_AT_accessibility(DW_ACCESS_public)
    3501              $C$DW$464       .dwtag  DW_TAG_member
    3502                      .dwattr $C$DW$464, DW_AT_type(*$C$DW$T$45)
    3503                      .dwattr $C$DW$464, DW_AT_name("errorCode")
    3504                      .dwattr $C$DW$464, DW_AT_TI_symbol_name("_errorCode")
    3505                      .dwattr $C$DW$464, DW_AT_data_member_location[DW_OP_plus_uconst 0x6]
    3506                      .dwattr $C$DW$464, DW_AT_accessibility(DW_ACCESS_public)
    3507              $C$DW$465       .dwtag  DW_TAG_member
    3508                      .dwattr $C$DW$465, DW_AT_type(*$C$DW$T$47)
    3509                      .dwattr $C$DW$465, DW_AT_name("clarkeHandle_I")
    3510                      .dwattr $C$DW$465, DW_AT_TI_symbol_name("_clarkeHandle_I")
    3511                      .dwattr $C$DW$465, DW_AT_data_member_location[DW_OP_plus_uconst 0x8]
    3512                      .dwattr $C$DW$465, DW_AT_accessibility(DW_ACCESS_public)
    3513              $C$DW$466       .dwtag  DW_TAG_member
    3514                      .dwattr $C$DW$466, DW_AT_type(*$C$DW$T$48)
    3515                      .dwattr $C$DW$466, DW_AT_name("clarke_I")
    3516                      .dwattr $C$DW$466, DW_AT_TI_symbol_name("_clarke_I")
    3517                      .dwattr $C$DW$466, DW_AT_data_member_location[DW_OP_plus_uconst 0xa]
    3518                      .dwattr $C$DW$466, DW_AT_accessibility(DW_ACCESS_public)
    3519              $C$DW$467       .dwtag  DW_TAG_member
    3520                      .dwattr $C$DW$467, DW_AT_type(*$C$DW$T$47)
    3521                      .dwattr $C$DW$467, DW_AT_name("clarkeHandle_V")
    3522                      .dwattr $C$DW$467, DW_AT_TI_symbol_name("_clarkeHandle_V")
TMS320C2000 Assembler PC v6.2.5 Fri Sep 29 09:29:33 2017

Tools Copyright (c) 1996-2014 Texas Instruments Incorporated
C:\Users\wmj\AppData\Local\Temp\1142410                              PAGE   66

    3523                      .dwattr $C$DW$467, DW_AT_data_member_location[DW_OP_plus_uconst 0x10]
    3524                      .dwattr $C$DW$467, DW_AT_accessibility(DW_ACCESS_public)
    3525              $C$DW$468       .dwtag  DW_TAG_member
    3526                      .dwattr $C$DW$468, DW_AT_type(*$C$DW$T$48)
    3527                      .dwattr $C$DW$468, DW_AT_name("clarke_V")
    3528                      .dwattr $C$DW$468, DW_AT_TI_symbol_name("_clarke_V")
    3529                      .dwattr $C$DW$468, DW_AT_data_member_location[DW_OP_plus_uconst 0x12]
    3530                      .dwattr $C$DW$468, DW_AT_accessibility(DW_ACCESS_public)
    3531              $C$DW$469       .dwtag  DW_TAG_member
    3532                      .dwattr $C$DW$469, DW_AT_type(*$C$DW$T$50)
    3533                      .dwattr $C$DW$469, DW_AT_name("estHandle")
    3534                      .dwattr $C$DW$469, DW_AT_TI_symbol_name("_estHandle")
    3535                      .dwattr $C$DW$469, DW_AT_data_member_location[DW_OP_plus_uconst 0x18]
    3536                      .dwattr $C$DW$469, DW_AT_accessibility(DW_ACCESS_public)
    3537              $C$DW$470       .dwtag  DW_TAG_member
    3538                      .dwattr $C$DW$470, DW_AT_type(*$C$DW$T$52)
    3539                      .dwattr $C$DW$470, DW_AT_name("parkHandle")
    3540                      .dwattr $C$DW$470, DW_AT_TI_symbol_name("_parkHandle")
    3541                      .dwattr $C$DW$470, DW_AT_data_member_location[DW_OP_plus_uconst 0x1a]
    3542                      .dwattr $C$DW$470, DW_AT_accessibility(DW_ACCESS_public)
    3543              $C$DW$471       .dwtag  DW_TAG_member
    3544                      .dwattr $C$DW$471, DW_AT_type(*$C$DW$T$53)
    3545                      .dwattr $C$DW$471, DW_AT_name("park")
    3546                      .dwattr $C$DW$471, DW_AT_TI_symbol_name("_park")
    3547                      .dwattr $C$DW$471, DW_AT_data_member_location[DW_OP_plus_uconst 0x1c]
    3548                      .dwattr $C$DW$471, DW_AT_accessibility(DW_ACCESS_public)
    3549              $C$DW$472       .dwtag  DW_TAG_member
    3550                      .dwattr $C$DW$472, DW_AT_type(*$C$DW$T$55)
    3551                      .dwattr $C$DW$472, DW_AT_name("pidHandle_Id")
    3552                      .dwattr $C$DW$472, DW_AT_TI_symbol_name("_pidHandle_Id")
    3553                      .dwattr $C$DW$472, DW_AT_data_member_location[DW_OP_plus_uconst 0x20]
    3554                      .dwattr $C$DW$472, DW_AT_accessibility(DW_ACCESS_public)
    3555              $C$DW$473       .dwtag  DW_TAG_member
    3556                      .dwattr $C$DW$473, DW_AT_type(*$C$DW$T$56)
    3557                      .dwattr $C$DW$473, DW_AT_name("pid_Id")
    3558                      .dwattr $C$DW$473, DW_AT_TI_symbol_name("_pid_Id")
    3559                      .dwattr $C$DW$473, DW_AT_data_member_location[DW_OP_plus_uconst 0x22]
    3560                      .dwattr $C$DW$473, DW_AT_accessibility(DW_ACCESS_public)
    3561              $C$DW$474       .dwtag  DW_TAG_member
    3562                      .dwattr $C$DW$474, DW_AT_type(*$C$DW$T$55)
    3563                      .dwattr $C$DW$474, DW_AT_name("pidHandle_Iq")
    3564                      .dwattr $C$DW$474, DW_AT_TI_symbol_name("_pidHandle_Iq")
    3565                      .dwattr $C$DW$474, DW_AT_data_member_location[DW_OP_plus_uconst 0x32]
    3566                      .dwattr $C$DW$474, DW_AT_accessibility(DW_ACCESS_public)
    3567              $C$DW$475       .dwtag  DW_TAG_member
    3568                      .dwattr $C$DW$475, DW_AT_type(*$C$DW$T$56)
    3569                      .dwattr $C$DW$475, DW_AT_name("pid_Iq")
    3570                      .dwattr $C$DW$475, DW_AT_TI_symbol_name("_pid_Iq")
    3571                      .dwattr $C$DW$475, DW_AT_data_member_location[DW_OP_plus_uconst 0x34]
    3572                      .dwattr $C$DW$475, DW_AT_accessibility(DW_ACCESS_public)
    3573              $C$DW$476       .dwtag  DW_TAG_member
    3574                      .dwattr $C$DW$476, DW_AT_type(*$C$DW$T$55)
    3575                      .dwattr $C$DW$476, DW_AT_name("pidHandle_spd")
    3576                      .dwattr $C$DW$476, DW_AT_TI_symbol_name("_pidHandle_spd")
    3577                      .dwattr $C$DW$476, DW_AT_data_member_location[DW_OP_plus_uconst 0x44]
TMS320C2000 Assembler PC v6.2.5 Fri Sep 29 09:29:33 2017

Tools Copyright (c) 1996-2014 Texas Instruments Incorporated
C:\Users\wmj\AppData\Local\Temp\1142410                              PAGE   67

    3578                      .dwattr $C$DW$476, DW_AT_accessibility(DW_ACCESS_public)
    3579              $C$DW$477       .dwtag  DW_TAG_member
    3580                      .dwattr $C$DW$477, DW_AT_type(*$C$DW$T$56)
    3581                      .dwattr $C$DW$477, DW_AT_name("pid_spd")
    3582                      .dwattr $C$DW$477, DW_AT_TI_symbol_name("_pid_spd")
    3583                      .dwattr $C$DW$477, DW_AT_data_member_location[DW_OP_plus_uconst 0x46]
    3584                      .dwattr $C$DW$477, DW_AT_accessibility(DW_ACCESS_public)
    3585              $C$DW$478       .dwtag  DW_TAG_member
    3586                      .dwattr $C$DW$478, DW_AT_type(*$C$DW$T$58)
    3587                      .dwattr $C$DW$478, DW_AT_name("iparkHandle")
    3588                      .dwattr $C$DW$478, DW_AT_TI_symbol_name("_iparkHandle")
    3589                      .dwattr $C$DW$478, DW_AT_data_member_location[DW_OP_plus_uconst 0x56]
    3590                      .dwattr $C$DW$478, DW_AT_accessibility(DW_ACCESS_public)
    3591              $C$DW$479       .dwtag  DW_TAG_member
    3592                      .dwattr $C$DW$479, DW_AT_type(*$C$DW$T$59)
    3593                      .dwattr $C$DW$479, DW_AT_name("ipark")
    3594                      .dwattr $C$DW$479, DW_AT_TI_symbol_name("_ipark")
    3595                      .dwattr $C$DW$479, DW_AT_data_member_location[DW_OP_plus_uconst 0x58]
    3596                      .dwattr $C$DW$479, DW_AT_accessibility(DW_ACCESS_public)
    3597              $C$DW$480       .dwtag  DW_TAG_member
    3598                      .dwattr $C$DW$480, DW_AT_type(*$C$DW$T$61)
    3599                      .dwattr $C$DW$480, DW_AT_name("svgenHandle")
    3600                      .dwattr $C$DW$480, DW_AT_TI_symbol_name("_svgenHandle")
    3601                      .dwattr $C$DW$480, DW_AT_data_member_location[DW_OP_plus_uconst 0x5c]
    3602                      .dwattr $C$DW$480, DW_AT_accessibility(DW_ACCESS_public)
    3603              $C$DW$481       .dwtag  DW_TAG_member
    3604                      .dwattr $C$DW$481, DW_AT_type(*$C$DW$T$62)
    3605                      .dwattr $C$DW$481, DW_AT_name("svgen")
    3606                      .dwattr $C$DW$481, DW_AT_TI_symbol_name("_svgen")
    3607                      .dwattr $C$DW$481, DW_AT_data_member_location[DW_OP_plus_uconst 0x5e]
    3608                      .dwattr $C$DW$481, DW_AT_accessibility(DW_ACCESS_public)
    3609              $C$DW$482       .dwtag  DW_TAG_member
    3610                      .dwattr $C$DW$482, DW_AT_type(*$C$DW$T$64)
    3611                      .dwattr $C$DW$482, DW_AT_name("trajHandle_Id")
    3612                      .dwattr $C$DW$482, DW_AT_TI_symbol_name("_trajHandle_Id")
    3613                      .dwattr $C$DW$482, DW_AT_data_member_location[DW_OP_plus_uconst 0x60]
    3614                      .dwattr $C$DW$482, DW_AT_accessibility(DW_ACCESS_public)
    3615              $C$DW$483       .dwtag  DW_TAG_member
    3616                      .dwattr $C$DW$483, DW_AT_type(*$C$DW$T$65)
    3617                      .dwattr $C$DW$483, DW_AT_name("traj_Id")
    3618                      .dwattr $C$DW$483, DW_AT_TI_symbol_name("_traj_Id")
    3619                      .dwattr $C$DW$483, DW_AT_data_member_location[DW_OP_plus_uconst 0x62]
    3620                      .dwattr $C$DW$483, DW_AT_accessibility(DW_ACCESS_public)
    3621              $C$DW$484       .dwtag  DW_TAG_member
    3622                      .dwattr $C$DW$484, DW_AT_type(*$C$DW$T$64)
    3623                      .dwattr $C$DW$484, DW_AT_name("trajHandle_spd")
    3624                      .dwattr $C$DW$484, DW_AT_TI_symbol_name("_trajHandle_spd")
    3625                      .dwattr $C$DW$484, DW_AT_data_member_location[DW_OP_plus_uconst 0x6c]
    3626                      .dwattr $C$DW$484, DW_AT_accessibility(DW_ACCESS_public)
    3627              $C$DW$485       .dwtag  DW_TAG_member
    3628                      .dwattr $C$DW$485, DW_AT_type(*$C$DW$T$65)
    3629                      .dwattr $C$DW$485, DW_AT_name("traj_spd")
    3630                      .dwattr $C$DW$485, DW_AT_TI_symbol_name("_traj_spd")
    3631                      .dwattr $C$DW$485, DW_AT_data_member_location[DW_OP_plus_uconst 0x6e]
    3632                      .dwattr $C$DW$485, DW_AT_accessibility(DW_ACCESS_public)
TMS320C2000 Assembler PC v6.2.5 Fri Sep 29 09:29:33 2017

Tools Copyright (c) 1996-2014 Texas Instruments Incorporated
C:\Users\wmj\AppData\Local\Temp\1142410                              PAGE   68

    3633              $C$DW$486       .dwtag  DW_TAG_member
    3634                      .dwattr $C$DW$486, DW_AT_type(*$C$DW$T$64)
    3635                      .dwattr $C$DW$486, DW_AT_name("trajHandle_spdMax")
    3636                      .dwattr $C$DW$486, DW_AT_TI_symbol_name("_trajHandle_spdMax")
    3637                      .dwattr $C$DW$486, DW_AT_data_member_location[DW_OP_plus_uconst 0x78]
    3638                      .dwattr $C$DW$486, DW_AT_accessibility(DW_ACCESS_public)
    3639              $C$DW$487       .dwtag  DW_TAG_member
    3640                      .dwattr $C$DW$487, DW_AT_type(*$C$DW$T$65)
    3641                      .dwattr $C$DW$487, DW_AT_name("traj_spdMax")
    3642                      .dwattr $C$DW$487, DW_AT_TI_symbol_name("_traj_spdMax")
    3643                      .dwattr $C$DW$487, DW_AT_data_member_location[DW_OP_plus_uconst 0x7a]
    3644                      .dwattr $C$DW$487, DW_AT_accessibility(DW_ACCESS_public)
    3645              $C$DW$488       .dwtag  DW_TAG_member
    3646                      .dwattr $C$DW$488, DW_AT_type(*$C$DW$T$66)
    3647                      .dwattr $C$DW$488, DW_AT_name("motorParams")
    3648                      .dwattr $C$DW$488, DW_AT_TI_symbol_name("_motorParams")
    3649                      .dwattr $C$DW$488, DW_AT_data_member_location[DW_OP_plus_uconst 0x84]
    3650                      .dwattr $C$DW$488, DW_AT_accessibility(DW_ACCESS_public)
    3651              $C$DW$489       .dwtag  DW_TAG_member
    3652                      .dwattr $C$DW$489, DW_AT_type(*$C$DW$T$69)
    3653                      .dwattr $C$DW$489, DW_AT_name("waitTimes")
    3654                      .dwattr $C$DW$489, DW_AT_TI_symbol_name("_waitTimes")
    3655                      .dwattr $C$DW$489, DW_AT_data_member_location[DW_OP_plus_uconst 0x92]
    3656                      .dwattr $C$DW$489, DW_AT_accessibility(DW_ACCESS_public)
    3657              $C$DW$490       .dwtag  DW_TAG_member
    3658                      .dwattr $C$DW$490, DW_AT_type(*$C$DW$T$68)
    3659                      .dwattr $C$DW$490, DW_AT_name("counter_state")
    3660                      .dwattr $C$DW$490, DW_AT_TI_symbol_name("_counter_state")
    3661                      .dwattr $C$DW$490, DW_AT_data_member_location[DW_OP_plus_uconst 0x9a]
    3662                      .dwattr $C$DW$490, DW_AT_accessibility(DW_ACCESS_public)
    3663              $C$DW$491       .dwtag  DW_TAG_member
    3664                      .dwattr $C$DW$491, DW_AT_type(*$C$DW$T$70)
    3665                      .dwattr $C$DW$491, DW_AT_name("numIsrTicksPerCtrlTick")
    3666                      .dwattr $C$DW$491, DW_AT_TI_symbol_name("_numIsrTicksPerCtrlTick")
    3667                      .dwattr $C$DW$491, DW_AT_data_member_location[DW_OP_plus_uconst 0x9c]
    3668                      .dwattr $C$DW$491, DW_AT_accessibility(DW_ACCESS_public)
    3669              $C$DW$492       .dwtag  DW_TAG_member
    3670                      .dwattr $C$DW$492, DW_AT_type(*$C$DW$T$70)
    3671                      .dwattr $C$DW$492, DW_AT_name("numCtrlTicksPerCurrentTick")
    3672                      .dwattr $C$DW$492, DW_AT_TI_symbol_name("_numCtrlTicksPerCurrentTick")
    3673                      .dwattr $C$DW$492, DW_AT_data_member_location[DW_OP_plus_uconst 0x9d]
    3674                      .dwattr $C$DW$492, DW_AT_accessibility(DW_ACCESS_public)
    3675              $C$DW$493       .dwtag  DW_TAG_member
    3676                      .dwattr $C$DW$493, DW_AT_type(*$C$DW$T$70)
    3677                      .dwattr $C$DW$493, DW_AT_name("numCtrlTicksPerSpeedTick")
    3678                      .dwattr $C$DW$493, DW_AT_TI_symbol_name("_numCtrlTicksPerSpeedTick")
    3679                      .dwattr $C$DW$493, DW_AT_data_member_location[DW_OP_plus_uconst 0x9e]
    3680                      .dwattr $C$DW$493, DW_AT_accessibility(DW_ACCESS_public)
    3681              $C$DW$494       .dwtag  DW_TAG_member
    3682                      .dwattr $C$DW$494, DW_AT_type(*$C$DW$T$70)
    3683                      .dwattr $C$DW$494, DW_AT_name("numCtrlTicksPerTrajTick")
    3684                      .dwattr $C$DW$494, DW_AT_TI_symbol_name("_numCtrlTicksPerTrajTick")
    3685                      .dwattr $C$DW$494, DW_AT_data_member_location[DW_OP_plus_uconst 0x9f]
    3686                      .dwattr $C$DW$494, DW_AT_accessibility(DW_ACCESS_public)
    3687              $C$DW$495       .dwtag  DW_TAG_member
TMS320C2000 Assembler PC v6.2.5 Fri Sep 29 09:29:33 2017

Tools Copyright (c) 1996-2014 Texas Instruments Incorporated
C:\Users\wmj\AppData\Local\Temp\1142410                              PAGE   69

    3688                      .dwattr $C$DW$495, DW_AT_type(*$C$DW$T$68)
    3689                      .dwattr $C$DW$495, DW_AT_name("ctrlFreq_Hz")
    3690                      .dwattr $C$DW$495, DW_AT_TI_symbol_name("_ctrlFreq_Hz")
    3691                      .dwattr $C$DW$495, DW_AT_data_member_location[DW_OP_plus_uconst 0xa0]
    3692                      .dwattr $C$DW$495, DW_AT_accessibility(DW_ACCESS_public)
    3693              $C$DW$496       .dwtag  DW_TAG_member
    3694                      .dwattr $C$DW$496, DW_AT_type(*$C$DW$T$68)
    3695                      .dwattr $C$DW$496, DW_AT_name("trajFreq_Hz")
    3696                      .dwattr $C$DW$496, DW_AT_TI_symbol_name("_trajFreq_Hz")
    3697                      .dwattr $C$DW$496, DW_AT_data_member_location[DW_OP_plus_uconst 0xa2]
    3698                      .dwattr $C$DW$496, DW_AT_accessibility(DW_ACCESS_public)
    3699              $C$DW$497       .dwtag  DW_TAG_member
    3700                      .dwattr $C$DW$497, DW_AT_type(*$C$DW$T$32)
    3701                      .dwattr $C$DW$497, DW_AT_name("trajPeriod_sec")
    3702                      .dwattr $C$DW$497, DW_AT_TI_symbol_name("_trajPeriod_sec")
    3703                      .dwattr $C$DW$497, DW_AT_data_member_location[DW_OP_plus_uconst 0xa4]
    3704                      .dwattr $C$DW$497, DW_AT_accessibility(DW_ACCESS_public)
    3705              $C$DW$498       .dwtag  DW_TAG_member
    3706                      .dwattr $C$DW$498, DW_AT_type(*$C$DW$T$71)
    3707                      .dwattr $C$DW$498, DW_AT_name("ctrlPeriod_sec")
    3708                      .dwattr $C$DW$498, DW_AT_TI_symbol_name("_ctrlPeriod_sec")
    3709                      .dwattr $C$DW$498, DW_AT_data_member_location[DW_OP_plus_uconst 0xa6]
    3710                      .dwattr $C$DW$498, DW_AT_accessibility(DW_ACCESS_public)
    3711              $C$DW$499       .dwtag  DW_TAG_member
    3712                      .dwattr $C$DW$499, DW_AT_type(*$C$DW$T$32)
    3713                      .dwattr $C$DW$499, DW_AT_name("maxVsMag_pu")
    3714                      .dwattr $C$DW$499, DW_AT_TI_symbol_name("_maxVsMag_pu")
    3715                      .dwattr $C$DW$499, DW_AT_data_member_location[DW_OP_plus_uconst 0xa8]
    3716                      .dwattr $C$DW$499, DW_AT_accessibility(DW_ACCESS_public)
    3717              $C$DW$500       .dwtag  DW_TAG_member
    3718                      .dwattr $C$DW$500, DW_AT_type(*$C$DW$T$33)
    3719                      .dwattr $C$DW$500, DW_AT_name("Iab_in")
    3720                      .dwattr $C$DW$500, DW_AT_TI_symbol_name("_Iab_in")
    3721                      .dwattr $C$DW$500, DW_AT_data_member_location[DW_OP_plus_uconst 0xaa]
    3722                      .dwattr $C$DW$500, DW_AT_accessibility(DW_ACCESS_public)
    3723              $C$DW$501       .dwtag  DW_TAG_member
    3724                      .dwattr $C$DW$501, DW_AT_type(*$C$DW$T$33)
    3725                      .dwattr $C$DW$501, DW_AT_name("Iab_filt")
    3726                      .dwattr $C$DW$501, DW_AT_TI_symbol_name("_Iab_filt")
    3727                      .dwattr $C$DW$501, DW_AT_data_member_location[DW_OP_plus_uconst 0xae]
    3728                      .dwattr $C$DW$501, DW_AT_accessibility(DW_ACCESS_public)
    3729              $C$DW$502       .dwtag  DW_TAG_member
    3730                      .dwattr $C$DW$502, DW_AT_type(*$C$DW$T$33)
    3731                      .dwattr $C$DW$502, DW_AT_name("Idq_in")
    3732                      .dwattr $C$DW$502, DW_AT_TI_symbol_name("_Idq_in")
    3733                      .dwattr $C$DW$502, DW_AT_data_member_location[DW_OP_plus_uconst 0xb2]
    3734                      .dwattr $C$DW$502, DW_AT_accessibility(DW_ACCESS_public)
    3735              $C$DW$503       .dwtag  DW_TAG_member
    3736                      .dwattr $C$DW$503, DW_AT_type(*$C$DW$T$33)
    3737                      .dwattr $C$DW$503, DW_AT_name("Vab_in")
    3738                      .dwattr $C$DW$503, DW_AT_TI_symbol_name("_Vab_in")
    3739                      .dwattr $C$DW$503, DW_AT_data_member_location[DW_OP_plus_uconst 0xb6]
    3740                      .dwattr $C$DW$503, DW_AT_accessibility(DW_ACCESS_public)
    3741              $C$DW$504       .dwtag  DW_TAG_member
    3742                      .dwattr $C$DW$504, DW_AT_type(*$C$DW$T$32)
TMS320C2000 Assembler PC v6.2.5 Fri Sep 29 09:29:33 2017

Tools Copyright (c) 1996-2014 Texas Instruments Incorporated
C:\Users\wmj\AppData\Local\Temp\1142410                              PAGE   70

    3743                      .dwattr $C$DW$504, DW_AT_name("spd_out")
    3744                      .dwattr $C$DW$504, DW_AT_TI_symbol_name("_spd_out")
    3745                      .dwattr $C$DW$504, DW_AT_data_member_location[DW_OP_plus_uconst 0xba]
    3746                      .dwattr $C$DW$504, DW_AT_accessibility(DW_ACCESS_public)
    3747              $C$DW$505       .dwtag  DW_TAG_member
    3748                      .dwattr $C$DW$505, DW_AT_type(*$C$DW$T$33)
    3749                      .dwattr $C$DW$505, DW_AT_name("Vab_out")
    3750                      .dwattr $C$DW$505, DW_AT_TI_symbol_name("_Vab_out")
    3751                      .dwattr $C$DW$505, DW_AT_data_member_location[DW_OP_plus_uconst 0xbc]
    3752                      .dwattr $C$DW$505, DW_AT_accessibility(DW_ACCESS_public)
    3753              $C$DW$506       .dwtag  DW_TAG_member
    3754                      .dwattr $C$DW$506, DW_AT_type(*$C$DW$T$33)
    3755                      .dwattr $C$DW$506, DW_AT_name("Vdq_out")
    3756                      .dwattr $C$DW$506, DW_AT_TI_symbol_name("_Vdq_out")
    3757                      .dwattr $C$DW$506, DW_AT_data_member_location[DW_OP_plus_uconst 0xc0]
    3758                      .dwattr $C$DW$506, DW_AT_accessibility(DW_ACCESS_public)
    3759              $C$DW$507       .dwtag  DW_TAG_member
    3760                      .dwattr $C$DW$507, DW_AT_type(*$C$DW$T$71)
    3761                      .dwattr $C$DW$507, DW_AT_name("Rhf")
    3762                      .dwattr $C$DW$507, DW_AT_TI_symbol_name("_Rhf")
    3763                      .dwattr $C$DW$507, DW_AT_data_member_location[DW_OP_plus_uconst 0xc4]
    3764                      .dwattr $C$DW$507, DW_AT_accessibility(DW_ACCESS_public)
    3765              $C$DW$508       .dwtag  DW_TAG_member
    3766                      .dwattr $C$DW$508, DW_AT_type(*$C$DW$T$71)
    3767                      .dwattr $C$DW$508, DW_AT_name("Lhf")
    3768                      .dwattr $C$DW$508, DW_AT_TI_symbol_name("_Lhf")
    3769                      .dwattr $C$DW$508, DW_AT_data_member_location[DW_OP_plus_uconst 0xc6]
    3770                      .dwattr $C$DW$508, DW_AT_accessibility(DW_ACCESS_public)
    3771              $C$DW$509       .dwtag  DW_TAG_member
    3772                      .dwattr $C$DW$509, DW_AT_type(*$C$DW$T$71)
    3773                      .dwattr $C$DW$509, DW_AT_name("RoverL")
    3774                      .dwattr $C$DW$509, DW_AT_TI_symbol_name("_RoverL")
    3775                      .dwattr $C$DW$509, DW_AT_data_member_location[DW_OP_plus_uconst 0xc8]
    3776                      .dwattr $C$DW$509, DW_AT_accessibility(DW_ACCESS_public)
    3777              $C$DW$510       .dwtag  DW_TAG_member
    3778                      .dwattr $C$DW$510, DW_AT_type(*$C$DW$T$32)
    3779                      .dwattr $C$DW$510, DW_AT_name("Kp_Id")
    3780                      .dwattr $C$DW$510, DW_AT_TI_symbol_name("_Kp_Id")
    3781                      .dwattr $C$DW$510, DW_AT_data_member_location[DW_OP_plus_uconst 0xca]
    3782                      .dwattr $C$DW$510, DW_AT_accessibility(DW_ACCESS_public)
    3783              $C$DW$511       .dwtag  DW_TAG_member
    3784                      .dwattr $C$DW$511, DW_AT_type(*$C$DW$T$32)
    3785                      .dwattr $C$DW$511, DW_AT_name("Kp_Iq")
    3786                      .dwattr $C$DW$511, DW_AT_TI_symbol_name("_Kp_Iq")
    3787                      .dwattr $C$DW$511, DW_AT_data_member_location[DW_OP_plus_uconst 0xcc]
    3788                      .dwattr $C$DW$511, DW_AT_accessibility(DW_ACCESS_public)
    3789              $C$DW$512       .dwtag  DW_TAG_member
    3790                      .dwattr $C$DW$512, DW_AT_type(*$C$DW$T$32)
    3791                      .dwattr $C$DW$512, DW_AT_name("Kp_spd")
    3792                      .dwattr $C$DW$512, DW_AT_TI_symbol_name("_Kp_spd")
    3793                      .dwattr $C$DW$512, DW_AT_data_member_location[DW_OP_plus_uconst 0xce]
    3794                      .dwattr $C$DW$512, DW_AT_accessibility(DW_ACCESS_public)
    3795              $C$DW$513       .dwtag  DW_TAG_member
    3796                      .dwattr $C$DW$513, DW_AT_type(*$C$DW$T$32)
    3797                      .dwattr $C$DW$513, DW_AT_name("Ki_Id")
TMS320C2000 Assembler PC v6.2.5 Fri Sep 29 09:29:33 2017

Tools Copyright (c) 1996-2014 Texas Instruments Incorporated
C:\Users\wmj\AppData\Local\Temp\1142410                              PAGE   71

    3798                      .dwattr $C$DW$513, DW_AT_TI_symbol_name("_Ki_Id")
    3799                      .dwattr $C$DW$513, DW_AT_data_member_location[DW_OP_plus_uconst 0xd0]
    3800                      .dwattr $C$DW$513, DW_AT_accessibility(DW_ACCESS_public)
    3801              $C$DW$514       .dwtag  DW_TAG_member
    3802                      .dwattr $C$DW$514, DW_AT_type(*$C$DW$T$32)
    3803                      .dwattr $C$DW$514, DW_AT_name("Ki_Iq")
    3804                      .dwattr $C$DW$514, DW_AT_TI_symbol_name("_Ki_Iq")
    3805                      .dwattr $C$DW$514, DW_AT_data_member_location[DW_OP_plus_uconst 0xd2]
    3806                      .dwattr $C$DW$514, DW_AT_accessibility(DW_ACCESS_public)
    3807              $C$DW$515       .dwtag  DW_TAG_member
    3808                      .dwattr $C$DW$515, DW_AT_type(*$C$DW$T$32)
    3809                      .dwattr $C$DW$515, DW_AT_name("Ki_spd")
    3810                      .dwattr $C$DW$515, DW_AT_TI_symbol_name("_Ki_spd")
    3811                      .dwattr $C$DW$515, DW_AT_data_member_location[DW_OP_plus_uconst 0xd4]
    3812                      .dwattr $C$DW$515, DW_AT_accessibility(DW_ACCESS_public)
    3813              $C$DW$516       .dwtag  DW_TAG_member
    3814                      .dwattr $C$DW$516, DW_AT_type(*$C$DW$T$32)
    3815                      .dwattr $C$DW$516, DW_AT_name("Kd_Id")
    3816                      .dwattr $C$DW$516, DW_AT_TI_symbol_name("_Kd_Id")
    3817                      .dwattr $C$DW$516, DW_AT_data_member_location[DW_OP_plus_uconst 0xd6]
    3818                      .dwattr $C$DW$516, DW_AT_accessibility(DW_ACCESS_public)
    3819              $C$DW$517       .dwtag  DW_TAG_member
    3820                      .dwattr $C$DW$517, DW_AT_type(*$C$DW$T$32)
    3821                      .dwattr $C$DW$517, DW_AT_name("Kd_Iq")
    3822                      .dwattr $C$DW$517, DW_AT_TI_symbol_name("_Kd_Iq")
    3823                      .dwattr $C$DW$517, DW_AT_data_member_location[DW_OP_plus_uconst 0xd8]
    3824                      .dwattr $C$DW$517, DW_AT_accessibility(DW_ACCESS_public)
    3825              $C$DW$518       .dwtag  DW_TAG_member
    3826                      .dwattr $C$DW$518, DW_AT_type(*$C$DW$T$32)
    3827                      .dwattr $C$DW$518, DW_AT_name("Kd_spd")
    3828                      .dwattr $C$DW$518, DW_AT_TI_symbol_name("_Kd_spd")
    3829                      .dwattr $C$DW$518, DW_AT_data_member_location[DW_OP_plus_uconst 0xda]
    3830                      .dwattr $C$DW$518, DW_AT_accessibility(DW_ACCESS_public)
    3831              $C$DW$519       .dwtag  DW_TAG_member
    3832                      .dwattr $C$DW$519, DW_AT_type(*$C$DW$T$32)
    3833                      .dwattr $C$DW$519, DW_AT_name("Ui_Id")
    3834                      .dwattr $C$DW$519, DW_AT_TI_symbol_name("_Ui_Id")
    3835                      .dwattr $C$DW$519, DW_AT_data_member_location[DW_OP_plus_uconst 0xdc]
    3836                      .dwattr $C$DW$519, DW_AT_accessibility(DW_ACCESS_public)
    3837              $C$DW$520       .dwtag  DW_TAG_member
    3838                      .dwattr $C$DW$520, DW_AT_type(*$C$DW$T$32)
    3839                      .dwattr $C$DW$520, DW_AT_name("Ui_Iq")
    3840                      .dwattr $C$DW$520, DW_AT_TI_symbol_name("_Ui_Iq")
    3841                      .dwattr $C$DW$520, DW_AT_data_member_location[DW_OP_plus_uconst 0xde]
    3842                      .dwattr $C$DW$520, DW_AT_accessibility(DW_ACCESS_public)
    3843              $C$DW$521       .dwtag  DW_TAG_member
    3844                      .dwattr $C$DW$521, DW_AT_type(*$C$DW$T$32)
    3845                      .dwattr $C$DW$521, DW_AT_name("Ui_spd")
    3846                      .dwattr $C$DW$521, DW_AT_TI_symbol_name("_Ui_spd")
    3847                      .dwattr $C$DW$521, DW_AT_data_member_location[DW_OP_plus_uconst 0xe0]
    3848                      .dwattr $C$DW$521, DW_AT_accessibility(DW_ACCESS_public)
    3849              $C$DW$522       .dwtag  DW_TAG_member
    3850                      .dwattr $C$DW$522, DW_AT_type(*$C$DW$T$33)
    3851                      .dwattr $C$DW$522, DW_AT_name("Idq_ref")
    3852                      .dwattr $C$DW$522, DW_AT_TI_symbol_name("_Idq_ref")
TMS320C2000 Assembler PC v6.2.5 Fri Sep 29 09:29:33 2017

Tools Copyright (c) 1996-2014 Texas Instruments Incorporated
C:\Users\wmj\AppData\Local\Temp\1142410                              PAGE   72

    3853                      .dwattr $C$DW$522, DW_AT_data_member_location[DW_OP_plus_uconst 0xe2]
    3854                      .dwattr $C$DW$522, DW_AT_accessibility(DW_ACCESS_public)
    3855              $C$DW$523       .dwtag  DW_TAG_member
    3856                      .dwattr $C$DW$523, DW_AT_type(*$C$DW$T$32)
    3857                      .dwattr $C$DW$523, DW_AT_name("IdRated")
    3858                      .dwattr $C$DW$523, DW_AT_TI_symbol_name("_IdRated")
    3859                      .dwattr $C$DW$523, DW_AT_data_member_location[DW_OP_plus_uconst 0xe6]
    3860                      .dwattr $C$DW$523, DW_AT_accessibility(DW_ACCESS_public)
    3861              $C$DW$524       .dwtag  DW_TAG_member
    3862                      .dwattr $C$DW$524, DW_AT_type(*$C$DW$T$32)
    3863                      .dwattr $C$DW$524, DW_AT_name("spd_ref")
    3864                      .dwattr $C$DW$524, DW_AT_TI_symbol_name("_spd_ref")
    3865                      .dwattr $C$DW$524, DW_AT_data_member_location[DW_OP_plus_uconst 0xe8]
    3866                      .dwattr $C$DW$524, DW_AT_accessibility(DW_ACCESS_public)
    3867              $C$DW$525       .dwtag  DW_TAG_member
    3868                      .dwattr $C$DW$525, DW_AT_type(*$C$DW$T$32)
    3869                      .dwattr $C$DW$525, DW_AT_name("spd_max")
    3870                      .dwattr $C$DW$525, DW_AT_TI_symbol_name("_spd_max")
    3871                      .dwattr $C$DW$525, DW_AT_data_member_location[DW_OP_plus_uconst 0xea]
    3872                      .dwattr $C$DW$525, DW_AT_accessibility(DW_ACCESS_public)
    3873              $C$DW$526       .dwtag  DW_TAG_member
    3874                      .dwattr $C$DW$526, DW_AT_type(*$C$DW$T$70)
    3875                      .dwattr $C$DW$526, DW_AT_name("counter_current")
    3876                      .dwattr $C$DW$526, DW_AT_TI_symbol_name("_counter_current")
    3877                      .dwattr $C$DW$526, DW_AT_data_member_location[DW_OP_plus_uconst 0xec]
    3878                      .dwattr $C$DW$526, DW_AT_accessibility(DW_ACCESS_public)
    3879              $C$DW$527       .dwtag  DW_TAG_member
    3880                      .dwattr $C$DW$527, DW_AT_type(*$C$DW$T$70)
    3881                      .dwattr $C$DW$527, DW_AT_name("counter_isr")
    3882                      .dwattr $C$DW$527, DW_AT_TI_symbol_name("_counter_isr")
    3883                      .dwattr $C$DW$527, DW_AT_data_member_location[DW_OP_plus_uconst 0xed]
    3884                      .dwattr $C$DW$527, DW_AT_accessibility(DW_ACCESS_public)
    3885              $C$DW$528       .dwtag  DW_TAG_member
    3886                      .dwattr $C$DW$528, DW_AT_type(*$C$DW$T$70)
    3887                      .dwattr $C$DW$528, DW_AT_name("counter_speed")
    3888                      .dwattr $C$DW$528, DW_AT_TI_symbol_name("_counter_speed")
    3889                      .dwattr $C$DW$528, DW_AT_data_member_location[DW_OP_plus_uconst 0xee]
    3890                      .dwattr $C$DW$528, DW_AT_accessibility(DW_ACCESS_public)
    3891              $C$DW$529       .dwtag  DW_TAG_member
    3892                      .dwattr $C$DW$529, DW_AT_type(*$C$DW$T$70)
    3893                      .dwattr $C$DW$529, DW_AT_name("counter_traj")
    3894                      .dwattr $C$DW$529, DW_AT_TI_symbol_name("_counter_traj")
    3895                      .dwattr $C$DW$529, DW_AT_data_member_location[DW_OP_plus_uconst 0xef]
    3896                      .dwattr $C$DW$529, DW_AT_accessibility(DW_ACCESS_public)
    3897              $C$DW$530       .dwtag  DW_TAG_member
    3898                      .dwattr $C$DW$530, DW_AT_type(*$C$DW$T$34)
    3899                      .dwattr $C$DW$530, DW_AT_name("flag_enableCtrl")
    3900                      .dwattr $C$DW$530, DW_AT_TI_symbol_name("_flag_enableCtrl")
    3901                      .dwattr $C$DW$530, DW_AT_data_member_location[DW_OP_plus_uconst 0xf0]
    3902                      .dwattr $C$DW$530, DW_AT_accessibility(DW_ACCESS_public)
    3903              $C$DW$531       .dwtag  DW_TAG_member
    3904                      .dwattr $C$DW$531, DW_AT_type(*$C$DW$T$34)
    3905                      .dwattr $C$DW$531, DW_AT_name("flag_enableDcBusComp")
    3906                      .dwattr $C$DW$531, DW_AT_TI_symbol_name("_flag_enableDcBusComp")
    3907                      .dwattr $C$DW$531, DW_AT_data_member_location[DW_OP_plus_uconst 0xf1]
TMS320C2000 Assembler PC v6.2.5 Fri Sep 29 09:29:33 2017

Tools Copyright (c) 1996-2014 Texas Instruments Incorporated
C:\Users\wmj\AppData\Local\Temp\1142410                              PAGE   73

    3908                      .dwattr $C$DW$531, DW_AT_accessibility(DW_ACCESS_public)
    3909              $C$DW$532       .dwtag  DW_TAG_member
    3910                      .dwattr $C$DW$532, DW_AT_type(*$C$DW$T$34)
    3911                      .dwattr $C$DW$532, DW_AT_name("flag_enablePowerWarp")
    3912                      .dwattr $C$DW$532, DW_AT_TI_symbol_name("_flag_enablePowerWarp")
    3913                      .dwattr $C$DW$532, DW_AT_data_member_location[DW_OP_plus_uconst 0xf2]
    3914                      .dwattr $C$DW$532, DW_AT_accessibility(DW_ACCESS_public)
    3915              $C$DW$533       .dwtag  DW_TAG_member
    3916                      .dwattr $C$DW$533, DW_AT_type(*$C$DW$T$34)
    3917                      .dwattr $C$DW$533, DW_AT_name("flag_enableOffset")
    3918                      .dwattr $C$DW$533, DW_AT_TI_symbol_name("_flag_enableOffset")
    3919                      .dwattr $C$DW$533, DW_AT_data_member_location[DW_OP_plus_uconst 0xf3]
    3920                      .dwattr $C$DW$533, DW_AT_accessibility(DW_ACCESS_public)
    3921              $C$DW$534       .dwtag  DW_TAG_member
    3922                      .dwattr $C$DW$534, DW_AT_type(*$C$DW$T$34)
    3923                      .dwattr $C$DW$534, DW_AT_name("flag_enableSpeedCtrl")
    3924                      .dwattr $C$DW$534, DW_AT_TI_symbol_name("_flag_enableSpeedCtrl")
    3925                      .dwattr $C$DW$534, DW_AT_data_member_location[DW_OP_plus_uconst 0xf4]
    3926                      .dwattr $C$DW$534, DW_AT_accessibility(DW_ACCESS_public)
    3927              $C$DW$535       .dwtag  DW_TAG_member
    3928                      .dwattr $C$DW$535, DW_AT_type(*$C$DW$T$34)
    3929                      .dwattr $C$DW$535, DW_AT_name("flag_enableUserMotorParams")
    3930                      .dwattr $C$DW$535, DW_AT_TI_symbol_name("_flag_enableUserMotorParams")
    3931                      .dwattr $C$DW$535, DW_AT_data_member_location[DW_OP_plus_uconst 0xf5]
    3932                      .dwattr $C$DW$535, DW_AT_accessibility(DW_ACCESS_public)
    3933              $C$DW$536       .dwtag  DW_TAG_member
    3934                      .dwattr $C$DW$536, DW_AT_type(*$C$DW$T$33)
    3935                      .dwattr $C$DW$536, DW_AT_name("Idq_offset_pu")
    3936                      .dwattr $C$DW$536, DW_AT_TI_symbol_name("_Idq_offset_pu")
    3937                      .dwattr $C$DW$536, DW_AT_data_member_location[DW_OP_plus_uconst 0xf6]
    3938                      .dwattr $C$DW$536, DW_AT_accessibility(DW_ACCESS_public)
    3939              $C$DW$537       .dwtag  DW_TAG_member
    3940                      .dwattr $C$DW$537, DW_AT_type(*$C$DW$T$33)
    3941                      .dwattr $C$DW$537, DW_AT_name("Vdq_offset_pu")
    3942                      .dwattr $C$DW$537, DW_AT_TI_symbol_name("_Vdq_offset_pu")
    3943                      .dwattr $C$DW$537, DW_AT_data_member_location[DW_OP_plus_uconst 0xfa]
    3944                      .dwattr $C$DW$537, DW_AT_accessibility(DW_ACCESS_public)
    3945              $C$DW$538       .dwtag  DW_TAG_member
    3946                      .dwattr $C$DW$538, DW_AT_type(*$C$DW$T$32)
    3947                      .dwattr $C$DW$538, DW_AT_name("angle_pu")
    3948                      .dwattr $C$DW$538, DW_AT_TI_symbol_name("_angle_pu")
    3949                      .dwattr $C$DW$538, DW_AT_data_member_location[DW_OP_plus_uconst 0xfe]
    3950                      .dwattr $C$DW$538, DW_AT_accessibility(DW_ACCESS_public)
    3951              $C$DW$539       .dwtag  DW_TAG_member
    3952                      .dwattr $C$DW$539, DW_AT_type(*$C$DW$T$32)
    3953                      .dwattr $C$DW$539, DW_AT_name("speed_ref_pu")
    3954                      .dwattr $C$DW$539, DW_AT_TI_symbol_name("_speed_ref_pu")
    3955                      .dwattr $C$DW$539, DW_AT_data_member_location[DW_OP_plus_uconst 0x100]
    3956                      .dwattr $C$DW$539, DW_AT_accessibility(DW_ACCESS_public)
    3957              $C$DW$540       .dwtag  DW_TAG_member
    3958                      .dwattr $C$DW$540, DW_AT_type(*$C$DW$T$32)
    3959                      .dwattr $C$DW$540, DW_AT_name("speed_fb_pu")
    3960                      .dwattr $C$DW$540, DW_AT_TI_symbol_name("_speed_fb_pu")
    3961                      .dwattr $C$DW$540, DW_AT_data_member_location[DW_OP_plus_uconst 0x102]
    3962                      .dwattr $C$DW$540, DW_AT_accessibility(DW_ACCESS_public)
TMS320C2000 Assembler PC v6.2.5 Fri Sep 29 09:29:33 2017

Tools Copyright (c) 1996-2014 Texas Instruments Incorporated
C:\Users\wmj\AppData\Local\Temp\1142410                              PAGE   74

    3963              $C$DW$541       .dwtag  DW_TAG_member
    3964                      .dwattr $C$DW$541, DW_AT_type(*$C$DW$T$32)
    3965                      .dwattr $C$DW$541, DW_AT_name("speed_outMax_pu")
    3966                      .dwattr $C$DW$541, DW_AT_TI_symbol_name("_speed_outMax_pu")
    3967                      .dwattr $C$DW$541, DW_AT_data_member_location[DW_OP_plus_uconst 0x104]
    3968                      .dwattr $C$DW$541, DW_AT_accessibility(DW_ACCESS_public)
    3969              $C$DW$542       .dwtag  DW_TAG_member
    3970                      .dwattr $C$DW$542, DW_AT_type(*$C$DW$T$34)
    3971                      .dwattr $C$DW$542, DW_AT_name("flag_enableCurrentCtrl")
    3972                      .dwattr $C$DW$542, DW_AT_TI_symbol_name("_flag_enableCurrentCtrl")
    3973                      .dwattr $C$DW$542, DW_AT_data_member_location[DW_OP_plus_uconst 0x106]
    3974                      .dwattr $C$DW$542, DW_AT_accessibility(DW_ACCESS_public)
    3975              $C$DW$543       .dwtag  DW_TAG_member
    3976                      .dwattr $C$DW$543, DW_AT_type(*$C$DW$T$73)
    3977                      .dwattr $C$DW$543, DW_AT_name("brakeHandle")
    3978                      .dwattr $C$DW$543, DW_AT_TI_symbol_name("_brakeHandle")
    3979                      .dwattr $C$DW$543, DW_AT_data_member_location[DW_OP_plus_uconst 0x108]
    3980                      .dwattr $C$DW$543, DW_AT_accessibility(DW_ACCESS_public)
    3981              $C$DW$544       .dwtag  DW_TAG_member
    3982                      .dwattr $C$DW$544, DW_AT_type(*$C$DW$T$74)
    3983                      .dwattr $C$DW$544, DW_AT_name("brake")
    3984                      .dwattr $C$DW$544, DW_AT_TI_symbol_name("_brake")
    3985                      .dwattr $C$DW$544, DW_AT_data_member_location[DW_OP_plus_uconst 0x10a]
    3986                      .dwattr $C$DW$544, DW_AT_accessibility(DW_ACCESS_public)
    3987                      .dwendtag $C$DW$T$75
    3988              
    3989              $C$DW$T$199     .dwtag  DW_TAG_pointer_type
    3990                      .dwattr $C$DW$T$199, DW_AT_type(*$C$DW$T$75)
    3991                      .dwattr $C$DW$T$199, DW_AT_address_class(0x16)
    3992              $C$DW$T$200     .dwtag  DW_TAG_typedef, DW_AT_name("CTRL_Handle")
    3993                      .dwattr $C$DW$T$200, DW_AT_type(*$C$DW$T$199)
    3994                      .dwattr $C$DW$T$200, DW_AT_language(DW_LANG_C)
    3995              
    3996              $C$DW$T$78      .dwtag  DW_TAG_structure_type
    3997                      .dwattr $C$DW$T$78, DW_AT_name("_CTRL_Version_")
    3998                      .dwattr $C$DW$T$78, DW_AT_byte_size(0x04)
    3999              $C$DW$545       .dwtag  DW_TAG_member
    4000                      .dwattr $C$DW$545, DW_AT_type(*$C$DW$T$23)
    4001                      .dwattr $C$DW$545, DW_AT_name("rsvd")
    4002                      .dwattr $C$DW$545, DW_AT_TI_symbol_name("_rsvd")
    4003                      .dwattr $C$DW$545, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    4004                      .dwattr $C$DW$545, DW_AT_accessibility(DW_ACCESS_public)
    4005              $C$DW$546       .dwtag  DW_TAG_member
    4006                      .dwattr $C$DW$546, DW_AT_type(*$C$DW$T$77)
    4007                      .dwattr $C$DW$546, DW_AT_name("targetProc")
    4008                      .dwattr $C$DW$546, DW_AT_TI_symbol_name("_targetProc")
    4009                      .dwattr $C$DW$546, DW_AT_data_member_location[DW_OP_plus_uconst 0x1]
    4010                      .dwattr $C$DW$546, DW_AT_accessibility(DW_ACCESS_public)
    4011              $C$DW$547       .dwtag  DW_TAG_member
    4012                      .dwattr $C$DW$547, DW_AT_type(*$C$DW$T$23)
    4013                      .dwattr $C$DW$547, DW_AT_name("major")
    4014                      .dwattr $C$DW$547, DW_AT_TI_symbol_name("_major")
    4015                      .dwattr $C$DW$547, DW_AT_data_member_location[DW_OP_plus_uconst 0x2]
    4016                      .dwattr $C$DW$547, DW_AT_accessibility(DW_ACCESS_public)
    4017              $C$DW$548       .dwtag  DW_TAG_member
TMS320C2000 Assembler PC v6.2.5 Fri Sep 29 09:29:33 2017

Tools Copyright (c) 1996-2014 Texas Instruments Incorporated
C:\Users\wmj\AppData\Local\Temp\1142410                              PAGE   75

    4018                      .dwattr $C$DW$548, DW_AT_type(*$C$DW$T$23)
    4019                      .dwattr $C$DW$548, DW_AT_name("minor")
    4020                      .dwattr $C$DW$548, DW_AT_TI_symbol_name("_minor")
    4021                      .dwattr $C$DW$548, DW_AT_data_member_location[DW_OP_plus_uconst 0x3]
    4022                      .dwattr $C$DW$548, DW_AT_accessibility(DW_ACCESS_public)
    4023                      .dwendtag $C$DW$T$78
    4024              
    4025              $C$DW$T$41      .dwtag  DW_TAG_typedef, DW_AT_name("CTRL_Version")
    4026                      .dwattr $C$DW$T$41, DW_AT_type(*$C$DW$T$78)
    4027                      .dwattr $C$DW$T$41, DW_AT_language(DW_LANG_C)
    4028              
    4029              $C$DW$T$20      .dwtag  DW_TAG_structure_type
    4030                      .dwattr $C$DW$T$20, DW_AT_name("_EST_Obj_")
    4031                      .dwattr $C$DW$T$20, DW_AT_declaration
    4032                      .dwendtag $C$DW$T$20
    4033              
    4034              $C$DW$T$49      .dwtag  DW_TAG_pointer_type
    4035                      .dwattr $C$DW$T$49, DW_AT_type(*$C$DW$T$20)
    4036                      .dwattr $C$DW$T$49, DW_AT_address_class(0x16)
    4037              $C$DW$T$50      .dwtag  DW_TAG_typedef, DW_AT_name("EST_Handle")
    4038                      .dwattr $C$DW$T$50, DW_AT_type(*$C$DW$T$49)
    4039                      .dwattr $C$DW$T$50, DW_AT_language(DW_LANG_C)
    4040              
    4041              $C$DW$T$79      .dwtag  DW_TAG_structure_type
    4042                      .dwattr $C$DW$T$79, DW_AT_name("_FILTER_FO_")
    4043                      .dwattr $C$DW$T$79, DW_AT_byte_size(0x0a)
    4044              $C$DW$549       .dwtag  DW_TAG_member
    4045                      .dwattr $C$DW$549, DW_AT_type(*$C$DW$T$32)
    4046                      .dwattr $C$DW$549, DW_AT_name("a1")
    4047                      .dwattr $C$DW$549, DW_AT_TI_symbol_name("_a1")
    4048                      .dwattr $C$DW$549, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    4049                      .dwattr $C$DW$549, DW_AT_accessibility(DW_ACCESS_public)
    4050              $C$DW$550       .dwtag  DW_TAG_member
    4051                      .dwattr $C$DW$550, DW_AT_type(*$C$DW$T$32)
    4052                      .dwattr $C$DW$550, DW_AT_name("b0")
    4053                      .dwattr $C$DW$550, DW_AT_TI_symbol_name("_b0")
    4054                      .dwattr $C$DW$550, DW_AT_data_member_location[DW_OP_plus_uconst 0x2]
    4055                      .dwattr $C$DW$550, DW_AT_accessibility(DW_ACCESS_public)
    4056              $C$DW$551       .dwtag  DW_TAG_member
    4057                      .dwattr $C$DW$551, DW_AT_type(*$C$DW$T$32)
    4058                      .dwattr $C$DW$551, DW_AT_name("b1")
    4059                      .dwattr $C$DW$551, DW_AT_TI_symbol_name("_b1")
    4060                      .dwattr $C$DW$551, DW_AT_data_member_location[DW_OP_plus_uconst 0x4]
    4061                      .dwattr $C$DW$551, DW_AT_accessibility(DW_ACCESS_public)
    4062              $C$DW$552       .dwtag  DW_TAG_member
    4063                      .dwattr $C$DW$552, DW_AT_type(*$C$DW$T$32)
    4064                      .dwattr $C$DW$552, DW_AT_name("x1")
    4065                      .dwattr $C$DW$552, DW_AT_TI_symbol_name("_x1")
    4066                      .dwattr $C$DW$552, DW_AT_data_member_location[DW_OP_plus_uconst 0x6]
    4067                      .dwattr $C$DW$552, DW_AT_accessibility(DW_ACCESS_public)
    4068              $C$DW$553       .dwtag  DW_TAG_member
    4069                      .dwattr $C$DW$553, DW_AT_type(*$C$DW$T$32)
    4070                      .dwattr $C$DW$553, DW_AT_name("y1")
    4071                      .dwattr $C$DW$553, DW_AT_TI_symbol_name("_y1")
    4072                      .dwattr $C$DW$553, DW_AT_data_member_location[DW_OP_plus_uconst 0x8]
TMS320C2000 Assembler PC v6.2.5 Fri Sep 29 09:29:33 2017

Tools Copyright (c) 1996-2014 Texas Instruments Incorporated
C:\Users\wmj\AppData\Local\Temp\1142410                              PAGE   76

    4073                      .dwattr $C$DW$553, DW_AT_accessibility(DW_ACCESS_public)
    4074                      .dwendtag $C$DW$T$79
    4075              
    4076              $C$DW$T$175     .dwtag  DW_TAG_typedef, DW_AT_name("FILTER_FO_Obj")
    4077                      .dwattr $C$DW$T$175, DW_AT_type(*$C$DW$T$79)
    4078                      .dwattr $C$DW$T$175, DW_AT_language(DW_LANG_C)
    4079              
    4080              $C$DW$T$21      .dwtag  DW_TAG_structure_type
    4081                      .dwattr $C$DW$T$21, DW_AT_name("_FILTER_FO_Obj_")
    4082                      .dwattr $C$DW$T$21, DW_AT_declaration
    4083                      .dwendtag $C$DW$T$21
    4084              
    4085              $C$DW$T$176     .dwtag  DW_TAG_pointer_type
    4086                      .dwattr $C$DW$T$176, DW_AT_type(*$C$DW$T$21)
    4087                      .dwattr $C$DW$T$176, DW_AT_address_class(0x16)
    4088              $C$DW$T$177     .dwtag  DW_TAG_typedef, DW_AT_name("FILTER_FO_Handle")
    4089                      .dwattr $C$DW$T$177, DW_AT_type(*$C$DW$T$176)
    4090                      .dwattr $C$DW$T$177, DW_AT_language(DW_LANG_C)
    4091              
    4092              $C$DW$T$80      .dwtag  DW_TAG_structure_type
    4093                      .dwattr $C$DW$T$80, DW_AT_name("_FLASH_Obj_")
    4094                      .dwattr $C$DW$T$80, DW_AT_byte_size(0x08)
    4095              $C$DW$554       .dwtag  DW_TAG_member
    4096                      .dwattr $C$DW$554, DW_AT_type(*$C$DW$T$24)
    4097                      .dwattr $C$DW$554, DW_AT_name("FOPT")
    4098                      .dwattr $C$DW$554, DW_AT_TI_symbol_name("_FOPT")
    4099                      .dwattr $C$DW$554, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    4100                      .dwattr $C$DW$554, DW_AT_accessibility(DW_ACCESS_public)
    4101              $C$DW$555       .dwtag  DW_TAG_member
    4102                      .dwattr $C$DW$555, DW_AT_type(*$C$DW$T$24)
    4103                      .dwattr $C$DW$555, DW_AT_name("rsvd_1")
    4104                      .dwattr $C$DW$555, DW_AT_TI_symbol_name("_rsvd_1")
    4105                      .dwattr $C$DW$555, DW_AT_data_member_location[DW_OP_plus_uconst 0x1]
    4106                      .dwattr $C$DW$555, DW_AT_accessibility(DW_ACCESS_public)
    4107              $C$DW$556       .dwtag  DW_TAG_member
    4108                      .dwattr $C$DW$556, DW_AT_type(*$C$DW$T$24)
    4109                      .dwattr $C$DW$556, DW_AT_name("FPWR")
    4110                      .dwattr $C$DW$556, DW_AT_TI_symbol_name("_FPWR")
    4111                      .dwattr $C$DW$556, DW_AT_data_member_location[DW_OP_plus_uconst 0x2]
    4112                      .dwattr $C$DW$556, DW_AT_accessibility(DW_ACCESS_public)
    4113              $C$DW$557       .dwtag  DW_TAG_member
    4114                      .dwattr $C$DW$557, DW_AT_type(*$C$DW$T$24)
    4115                      .dwattr $C$DW$557, DW_AT_name("FSTATUS")
    4116                      .dwattr $C$DW$557, DW_AT_TI_symbol_name("_FSTATUS")
    4117                      .dwattr $C$DW$557, DW_AT_data_member_location[DW_OP_plus_uconst 0x3]
    4118                      .dwattr $C$DW$557, DW_AT_accessibility(DW_ACCESS_public)
    4119              $C$DW$558       .dwtag  DW_TAG_member
    4120                      .dwattr $C$DW$558, DW_AT_type(*$C$DW$T$24)
    4121                      .dwattr $C$DW$558, DW_AT_name("FSTDBYWAIT")
    4122                      .dwattr $C$DW$558, DW_AT_TI_symbol_name("_FSTDBYWAIT")
    4123                      .dwattr $C$DW$558, DW_AT_data_member_location[DW_OP_plus_uconst 0x4]
    4124                      .dwattr $C$DW$558, DW_AT_accessibility(DW_ACCESS_public)
    4125              $C$DW$559       .dwtag  DW_TAG_member
    4126                      .dwattr $C$DW$559, DW_AT_type(*$C$DW$T$24)
    4127                      .dwattr $C$DW$559, DW_AT_name("FACTIVEWAIT")
TMS320C2000 Assembler PC v6.2.5 Fri Sep 29 09:29:33 2017

Tools Copyright (c) 1996-2014 Texas Instruments Incorporated
C:\Users\wmj\AppData\Local\Temp\1142410                              PAGE   77

    4128                      .dwattr $C$DW$559, DW_AT_TI_symbol_name("_FACTIVEWAIT")
    4129                      .dwattr $C$DW$559, DW_AT_data_member_location[DW_OP_plus_uconst 0x5]
    4130                      .dwattr $C$DW$559, DW_AT_accessibility(DW_ACCESS_public)
    4131              $C$DW$560       .dwtag  DW_TAG_member
    4132                      .dwattr $C$DW$560, DW_AT_type(*$C$DW$T$24)
    4133                      .dwattr $C$DW$560, DW_AT_name("FBANKWAIT")
    4134                      .dwattr $C$DW$560, DW_AT_TI_symbol_name("_FBANKWAIT")
    4135                      .dwattr $C$DW$560, DW_AT_data_member_location[DW_OP_plus_uconst 0x6]
    4136                      .dwattr $C$DW$560, DW_AT_accessibility(DW_ACCESS_public)
    4137              $C$DW$561       .dwtag  DW_TAG_member
    4138                      .dwattr $C$DW$561, DW_AT_type(*$C$DW$T$24)
    4139                      .dwattr $C$DW$561, DW_AT_name("FOTPWAIT")
    4140                      .dwattr $C$DW$561, DW_AT_TI_symbol_name("_FOTPWAIT")
    4141                      .dwattr $C$DW$561, DW_AT_data_member_location[DW_OP_plus_uconst 0x7]
    4142                      .dwattr $C$DW$561, DW_AT_accessibility(DW_ACCESS_public)
    4143                      .dwendtag $C$DW$T$80
    4144              
    4145              $C$DW$T$108     .dwtag  DW_TAG_pointer_type
    4146                      .dwattr $C$DW$T$108, DW_AT_type(*$C$DW$T$80)
    4147                      .dwattr $C$DW$T$108, DW_AT_address_class(0x16)
    4148              $C$DW$T$109     .dwtag  DW_TAG_typedef, DW_AT_name("FLASH_Handle")
    4149                      .dwattr $C$DW$T$109, DW_AT_type(*$C$DW$T$108)
    4150                      .dwattr $C$DW$T$109, DW_AT_language(DW_LANG_C)
    4151              
    4152              $C$DW$T$94      .dwtag  DW_TAG_structure_type
    4153                      .dwattr $C$DW$T$94, DW_AT_name("_FSM_Obj_")
    4154                      .dwattr $C$DW$T$94, DW_AT_byte_size(0x1a)
    4155              $C$DW$562       .dwtag  DW_TAG_member
    4156                      .dwattr $C$DW$562, DW_AT_type(*$C$DW$T$82)
    4157                      .dwattr $C$DW$562, DW_AT_name("MotorHandle")
    4158                      .dwattr $C$DW$562, DW_AT_TI_symbol_name("_MotorHandle")
    4159                      .dwattr $C$DW$562, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    4160                      .dwattr $C$DW$562, DW_AT_accessibility(DW_ACCESS_public)
    4161              $C$DW$563       .dwtag  DW_TAG_member
    4162                      .dwattr $C$DW$563, DW_AT_type(*$C$DW$T$84)
    4163                      .dwattr $C$DW$563, DW_AT_name("pca955xHandle")
    4164                      .dwattr $C$DW$563, DW_AT_TI_symbol_name("_pca955xHandle")
    4165                      .dwattr $C$DW$563, DW_AT_data_member_location[DW_OP_plus_uconst 0x2]
    4166                      .dwattr $C$DW$563, DW_AT_accessibility(DW_ACCESS_public)
    4167              $C$DW$564       .dwtag  DW_TAG_member
    4168                      .dwattr $C$DW$564, DW_AT_type(*$C$DW$T$85)
    4169                      .dwattr $C$DW$564, DW_AT_name("pca9555")
    4170                      .dwattr $C$DW$564, DW_AT_TI_symbol_name("_pca9555")
    4171                      .dwattr $C$DW$564, DW_AT_data_member_location[DW_OP_plus_uconst 0x4]
    4172                      .dwattr $C$DW$564, DW_AT_accessibility(DW_ACCESS_public)
    4173              $C$DW$565       .dwtag  DW_TAG_member
    4174                      .dwattr $C$DW$565, DW_AT_type(*$C$DW$T$87)
    4175                      .dwattr $C$DW$565, DW_AT_name("FSM_State")
    4176                      .dwattr $C$DW$565, DW_AT_TI_symbol_name("_FSM_State")
    4177                      .dwattr $C$DW$565, DW_AT_data_member_location[DW_OP_plus_uconst 0xa]
    4178                      .dwattr $C$DW$565, DW_AT_accessibility(DW_ACCESS_public)
    4179              $C$DW$566       .dwtag  DW_TAG_member
    4180                      .dwattr $C$DW$566, DW_AT_type(*$C$DW$T$89)
    4181                      .dwattr $C$DW$566, DW_AT_name("FSM_Trans")
    4182                      .dwattr $C$DW$566, DW_AT_TI_symbol_name("_FSM_Trans")
TMS320C2000 Assembler PC v6.2.5 Fri Sep 29 09:29:33 2017

Tools Copyright (c) 1996-2014 Texas Instruments Incorporated
C:\Users\wmj\AppData\Local\Temp\1142410                              PAGE   78

    4183                      .dwattr $C$DW$566, DW_AT_data_member_location[DW_OP_plus_uconst 0xb]
    4184                      .dwattr $C$DW$566, DW_AT_accessibility(DW_ACCESS_public)
    4185              $C$DW$567       .dwtag  DW_TAG_member
    4186                      .dwattr $C$DW$567, DW_AT_type(*$C$DW$T$91)
    4187                      .dwattr $C$DW$567, DW_AT_name("FSM_Event")
    4188                      .dwattr $C$DW$567, DW_AT_TI_symbol_name("_FSM_Event")
    4189                      .dwattr $C$DW$567, DW_AT_data_member_location[DW_OP_plus_uconst 0xc]
    4190                      .dwattr $C$DW$567, DW_AT_accessibility(DW_ACCESS_public)
    4191              $C$DW$568       .dwtag  DW_TAG_member
    4192                      .dwattr $C$DW$568, DW_AT_type(*$C$DW$T$93)
    4193                      .dwattr $C$DW$568, DW_AT_name("FSM_StMode")
    4194                      .dwattr $C$DW$568, DW_AT_TI_symbol_name("_FSM_StMode")
    4195                      .dwattr $C$DW$568, DW_AT_data_member_location[DW_OP_plus_uconst 0xd]
    4196                      .dwattr $C$DW$568, DW_AT_accessibility(DW_ACCESS_public)
    4197              $C$DW$569       .dwtag  DW_TAG_member
    4198                      .dwattr $C$DW$569, DW_AT_type(*$C$DW$T$34)
    4199                      .dwattr $C$DW$569, DW_AT_name("Accele_Polar")
    4200                      .dwattr $C$DW$569, DW_AT_TI_symbol_name("_Accele_Polar")
    4201                      .dwattr $C$DW$569, DW_AT_data_member_location[DW_OP_plus_uconst 0xe]
    4202                      .dwattr $C$DW$569, DW_AT_accessibility(DW_ACCESS_public)
    4203              $C$DW$570       .dwtag  DW_TAG_member
    4204                      .dwattr $C$DW$570, DW_AT_type(*$C$DW$T$32)
    4205                      .dwattr $C$DW$570, DW_AT_name("Sensor0_Value")
    4206                      .dwattr $C$DW$570, DW_AT_TI_symbol_name("_Sensor0_Value")
    4207                      .dwattr $C$DW$570, DW_AT_data_member_location[DW_OP_plus_uconst 0x10]
    4208                      .dwattr $C$DW$570, DW_AT_accessibility(DW_ACCESS_public)
    4209              $C$DW$571       .dwtag  DW_TAG_member
    4210                      .dwattr $C$DW$571, DW_AT_type(*$C$DW$T$32)
    4211                      .dwattr $C$DW$571, DW_AT_name("Sensor1_Value")
    4212                      .dwattr $C$DW$571, DW_AT_TI_symbol_name("_Sensor1_Value")
    4213                      .dwattr $C$DW$571, DW_AT_data_member_location[DW_OP_plus_uconst 0x12]
    4214                      .dwattr $C$DW$571, DW_AT_accessibility(DW_ACCESS_public)
    4215              $C$DW$572       .dwtag  DW_TAG_member
    4216                      .dwattr $C$DW$572, DW_AT_type(*$C$DW$T$23)
    4217                      .dwattr $C$DW$572, DW_AT_name("Motor_runTime")
    4218                      .dwattr $C$DW$572, DW_AT_TI_symbol_name("_Motor_runTime")
    4219                      .dwattr $C$DW$572, DW_AT_data_member_location[DW_OP_plus_uconst 0x14]
    4220                      .dwattr $C$DW$572, DW_AT_accessibility(DW_ACCESS_public)
    4221              $C$DW$573       .dwtag  DW_TAG_member
    4222                      .dwattr $C$DW$573, DW_AT_type(*$C$DW$T$34)
    4223                      .dwattr $C$DW$573, DW_AT_name("Flag_485Start")
    4224                      .dwattr $C$DW$573, DW_AT_TI_symbol_name("_Flag_485Start")
    4225                      .dwattr $C$DW$573, DW_AT_data_member_location[DW_OP_plus_uconst 0x15]
    4226                      .dwattr $C$DW$573, DW_AT_accessibility(DW_ACCESS_public)
    4227              $C$DW$574       .dwtag  DW_TAG_member
    4228                      .dwattr $C$DW$574, DW_AT_type(*$C$DW$T$34)
    4229                      .dwattr $C$DW$574, DW_AT_name("Flag_485Stop")
    4230                      .dwattr $C$DW$574, DW_AT_TI_symbol_name("_Flag_485Stop")
    4231                      .dwattr $C$DW$574, DW_AT_data_member_location[DW_OP_plus_uconst 0x16]
    4232                      .dwattr $C$DW$574, DW_AT_accessibility(DW_ACCESS_public)
    4233              $C$DW$575       .dwtag  DW_TAG_member
    4234                      .dwattr $C$DW$575, DW_AT_type(*$C$DW$T$34)
    4235                      .dwattr $C$DW$575, DW_AT_name("runTime_Enable")
    4236                      .dwattr $C$DW$575, DW_AT_TI_symbol_name("_runTime_Enable")
    4237                      .dwattr $C$DW$575, DW_AT_data_member_location[DW_OP_plus_uconst 0x17]
TMS320C2000 Assembler PC v6.2.5 Fri Sep 29 09:29:33 2017

Tools Copyright (c) 1996-2014 Texas Instruments Incorporated
C:\Users\wmj\AppData\Local\Temp\1142410                              PAGE   79

    4238                      .dwattr $C$DW$575, DW_AT_accessibility(DW_ACCESS_public)
    4239              $C$DW$576       .dwtag  DW_TAG_member
    4240                      .dwattr $C$DW$576, DW_AT_type(*$C$DW$T$34)
    4241                      .dwattr $C$DW$576, DW_AT_name("Ext_Int_Flag")
    4242                      .dwattr $C$DW$576, DW_AT_TI_symbol_name("_Ext_Int_Flag")
    4243                      .dwattr $C$DW$576, DW_AT_data_member_location[DW_OP_plus_uconst 0x18]
    4244                      .dwattr $C$DW$576, DW_AT_accessibility(DW_ACCESS_public)
    4245              $C$DW$577       .dwtag  DW_TAG_member
    4246                      .dwattr $C$DW$577, DW_AT_type(*$C$DW$T$34)
    4247                      .dwattr $C$DW$577, DW_AT_name("FSM_Enable")
    4248                      .dwattr $C$DW$577, DW_AT_TI_symbol_name("_FSM_Enable")
    4249                      .dwattr $C$DW$577, DW_AT_data_member_location[DW_OP_plus_uconst 0x19]
    4250                      .dwattr $C$DW$577, DW_AT_accessibility(DW_ACCESS_public)
    4251                      .dwendtag $C$DW$T$94
