TMS320C2000 Assembler PC v6.2.5 Sat Sep 16 15:51:24 2017

Tools Copyright (c) 1996-2014 Texas Instruments Incorporated
C:\Users\wmj\AppData\Local\Temp\1274411                              PAGE    1

       1              ;***************************************************************
       2              ;* TMS320C2000 C/C++ Codegen                         PC v6.2.5 *
       3              ;* Date/Time created: Sat Sep 16 15:51:24 2017                 *
       4              ;***************************************************************
       5                      .compiler_opts --float_support=softlib --hll_source=on --mem_model:code=flat --mem_model:data=large -
       6        0002  FP      .set    XAR2
       7              
       8              $C$DW$CU        .dwtag  DW_TAG_compile_unit
       9                      .dwattr $C$DW$CU, DW_AT_name("D:/BM1000/sw/drivers/drvic/process_ctrl.c")
      10                      .dwattr $C$DW$CU, DW_AT_producer("TMS320C2000 C/C++ Codegen PC v6.2.5 Copyright (c) 1996-2014 Texas I
      11                      .dwattr $C$DW$CU, DW_AT_TI_version(0x01)
      12                      .dwattr $C$DW$CU, DW_AT_comp_dir("D:\BM1000\sw\solutions\instaspin_foc\boards\hvkit_rev1p1\f28x\f2802
      13              
      14              $C$DW$1 .dwtag  DW_TAG_subprogram, DW_AT_name("LDC161x_Kalman_init")
      15                      .dwattr $C$DW$1, DW_AT_TI_symbol_name("_LDC161x_Kalman_init")

     781              $C$DW$157       .dwtag  DW_TAG_enumerator, DW_AT_name("PROCTRL_State_EditReturn"), DW_AT_const_value(0x03)
     782              $C$DW$158       .dwtag  DW_TAG_enumerator, DW_AT_name("PROCTRL_State_NormalLow"), DW_AT_const_value(0x04)
     783              $C$DW$159       .dwtag  DW_TAG_enumerator, DW_AT_name("PROCTRL_State_NormHiSped"), DW_AT_const_value(0x05)
     784              $C$DW$160       .dwtag  DW_TAG_enumerator, DW_AT_name("PROCTRL_State_NormDecle"), DW_AT_const_value(0x06)
     785              $C$DW$161       .dwtag  DW_TAG_enumerator, DW_AT_name("PROCTRL_State_NormDecle1"), DW_AT_const_value(0x07)
     786              $C$DW$162       .dwtag  DW_TAG_enumerator, DW_AT_name("PROCTRL_State_NormSlow"), DW_AT_const_value(0x08)
     787              $C$DW$163       .dwtag  DW_TAG_enumerator, DW_AT_name("PROCTRL_State_NormAccele"), DW_AT_const_value(0x09)
     788              $C$DW$164       .dwtag  DW_TAG_enumerator, DW_AT_name("PROCTRL_State_NormSate"), DW_AT_const_value(0x0a)
     789              $C$DW$165       .dwtag  DW_TAG_enumerator, DW_AT_name("PROCTRL_State_NormReturn"), DW_AT_const_value(0x0b)
     790              $C$DW$166       .dwtag  DW_TAG_enumerator, DW_AT_name("PROCTRL_State_NormSlow2"), DW_AT_const_value(0x0c)
     791              $C$DW$167       .dwtag  DW_TAG_enumerator, DW_AT_name("PROCTRL_State_NormStop"), DW_AT_const_value(0x0d)
     792              $C$DW$168       .dwtag  DW_TAG_enumerator, DW_AT_name("PROCTRL_State_NormRegulate"), DW_AT_const_value(0x0e)
     793              $C$DW$169       .dwtag  DW_TAG_enumerator, DW_AT_name("PROCTRL_State_ReturnStop"), DW_AT_const_value(0x0f)
     794                      .dwendtag $C$DW$T$170
     795              
     796              $C$DW$T$171     .dwtag  DW_TAG_typedef, DW_AT_name("PROCTRL_State_e")
     797                      .dwattr $C$DW$T$171, DW_AT_type(*$C$DW$T$170)
     798                      .dwattr $C$DW$T$171, DW_AT_language(DW_LANG_C)
TMS320C2000 Assembler PC v6.2.5 Sat Sep 16 15:51:24 2017

Tools Copyright (c) 1996-2014 Texas Instruments Incorporated
C:\Users\wmj\AppData\Local\Temp\1274411                              PAGE   16

     799              
     800              $C$DW$T$183     .dwtag  DW_TAG_enumeration_type
     801                      .dwattr $C$DW$T$183, DW_AT_byte_size(0x01)
     802              $C$DW$170       .dwtag  DW_TAG_enumerator, DW_AT_name("LDC161x_ChNum_CH0"), DW_AT_const_value(0x00)
     803              $C$DW$171       .dwtag  DW_TAG_enumerator, DW_AT_name("LDC161x_ChNum_CH1"), DW_AT_const_value(0x01)
     804              $C$DW$172       .dwtag  DW_TAG_enumerator, DW_AT_name("LDC161x_ChNum_CH2"), DW_AT_const_value(0x02)
     805              $C$DW$173       .dwtag  DW_TAG_enumerator, DW_AT_name("LDC161x_ChNum_CH3"), DW_AT_const_value(0x03)
     806                      .dwendtag $C$DW$T$183
     807              
     808              $C$DW$T$184     .dwtag  DW_TAG_typedef, DW_AT_name("LDC161x_ChNum_e")
     809                      .dwattr $C$DW$T$184, DW_AT_type(*$C$DW$T$183)
     810                      .dwattr $C$DW$T$184, DW_AT_language(DW_LANG_C)
     811              
     812              $C$DW$T$185     .dwtag  DW_TAG_enumeration_type
     813                      .dwattr $C$DW$T$185, DW_AT_byte_size(0x01)
     814              $C$DW$174       .dwtag  DW_TAG_enumerator, DW_AT_name("PCA955x_PortNum_Port0"), DW_AT_const_value(0x00)
     815              $C$DW$175       .dwtag  DW_TAG_enumerator, DW_AT_name("PCA955x_PortNum_Port1"), DW_AT_const_value(0x01)
     816                      .dwendtag $C$DW$T$185
     817              
     818              $C$DW$T$186     .dwtag  DW_TAG_typedef, DW_AT_name("PCA955x_PortNum_e")
     819                      .dwattr $C$DW$T$186, DW_AT_type(*$C$DW$T$185)
     820                      .dwattr $C$DW$T$186, DW_AT_language(DW_LANG_C)
     821              
     822              $C$DW$T$19      .dwtag  DW_TAG_structure_type
     823                      .dwattr $C$DW$T$19, DW_AT_name("I2C_Obj")
     824                      .dwattr $C$DW$T$19, DW_AT_declaration
     825                      .dwendtag $C$DW$T$19
     826              
     827              $C$DW$T$83      .dwtag  DW_TAG_pointer_type
     828                      .dwattr $C$DW$T$83, DW_AT_type(*$C$DW$T$19)
     829                      .dwattr $C$DW$T$83, DW_AT_address_class(0x16)
     830              $C$DW$T$84      .dwtag  DW_TAG_typedef, DW_AT_name("I2C_Handle")
     831                      .dwattr $C$DW$T$84, DW_AT_type(*$C$DW$T$83)
     832                      .dwattr $C$DW$T$84, DW_AT_language(DW_LANG_C)
     833              
     834              $C$DW$T$20      .dwtag  DW_TAG_structure_type
     835                      .dwattr $C$DW$T$20, DW_AT_name("LDC161x_REG_Obj")
     836                      .dwattr $C$DW$T$20, DW_AT_declaration
     837                      .dwendtag $C$DW$T$20
     838              
     839              $C$DW$T$100     .dwtag  DW_TAG_pointer_type
     840                      .dwattr $C$DW$T$100, DW_AT_type(*$C$DW$T$20)
     841                      .dwattr $C$DW$T$100, DW_AT_address_class(0x16)
     842              $C$DW$T$101     .dwtag  DW_TAG_typedef, DW_AT_name("LDC_Handle")
     843                      .dwattr $C$DW$T$101, DW_AT_type(*$C$DW$T$100)
     844                      .dwattr $C$DW$T$101, DW_AT_language(DW_LANG_C)
     845              
     846              $C$DW$T$31      .dwtag  DW_TAG_structure_type
     847                      .dwattr $C$DW$T$31, DW_AT_name("_ADC_Obj_")
     848                      .dwattr $C$DW$T$31, DW_AT_byte_size(0x6650)
     849              $C$DW$176       .dwtag  DW_TAG_member
     850                      .dwattr $C$DW$176, DW_AT_type(*$C$DW$T$25)
     851                      .dwattr $C$DW$176, DW_AT_name("ADCRESULT")
     852                      .dwattr $C$DW$176, DW_AT_TI_symbol_name("_ADCRESULT")
     853                      .dwattr $C$DW$176, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
TMS320C2000 Assembler PC v6.2.5 Sat Sep 16 15:51:24 2017

Tools Copyright (c) 1996-2014 Texas Instruments Incorporated
C:\Users\wmj\AppData\Local\Temp\1274411                              PAGE   17

     854                      .dwattr $C$DW$176, DW_AT_accessibility(DW_ACCESS_public)
     855              $C$DW$177       .dwtag  DW_TAG_member
     856                      .dwattr $C$DW$177, DW_AT_type(*$C$DW$T$26)
     857                      .dwattr $C$DW$177, DW_AT_name("resvd_1")
     858                      .dwattr $C$DW$177, DW_AT_TI_symbol_name("_resvd_1")
     859                      .dwattr $C$DW$177, DW_AT_data_member_location[DW_OP_plus_uconst 0x10]
     860                      .dwattr $C$DW$177, DW_AT_accessibility(DW_ACCESS_public)
     861              $C$DW$178       .dwtag  DW_TAG_member
     862                      .dwattr $C$DW$178, DW_AT_type(*$C$DW$T$24)
     863                      .dwattr $C$DW$178, DW_AT_name("ADCCTL1")
     864                      .dwattr $C$DW$178, DW_AT_TI_symbol_name("_ADCCTL1")
     865                      .dwattr $C$DW$178, DW_AT_data_member_location[DW_OP_plus_uconst 0x6600]
     866                      .dwattr $C$DW$178, DW_AT_accessibility(DW_ACCESS_public)
     867              $C$DW$179       .dwtag  DW_TAG_member
     868                      .dwattr $C$DW$179, DW_AT_type(*$C$DW$T$24)
     869                      .dwattr $C$DW$179, DW_AT_name("ADCCTL2")
     870                      .dwattr $C$DW$179, DW_AT_TI_symbol_name("_ADCCTL2")
     871                      .dwattr $C$DW$179, DW_AT_data_member_location[DW_OP_plus_uconst 0x6601]
     872                      .dwattr $C$DW$179, DW_AT_accessibility(DW_ACCESS_public)
     873              $C$DW$180       .dwtag  DW_TAG_member
     874                      .dwattr $C$DW$180, DW_AT_type(*$C$DW$T$27)
     875                      .dwattr $C$DW$180, DW_AT_name("rsvd_2")
     876                      .dwattr $C$DW$180, DW_AT_TI_symbol_name("_rsvd_2")
     877                      .dwattr $C$DW$180, DW_AT_data_member_location[DW_OP_plus_uconst 0x6602]
     878                      .dwattr $C$DW$180, DW_AT_accessibility(DW_ACCESS_public)
     879              $C$DW$181       .dwtag  DW_TAG_member
     880                      .dwattr $C$DW$181, DW_AT_type(*$C$DW$T$24)
     881                      .dwattr $C$DW$181, DW_AT_name("ADCINTFLG")
     882                      .dwattr $C$DW$181, DW_AT_TI_symbol_name("_ADCINTFLG")
     883                      .dwattr $C$DW$181, DW_AT_data_member_location[DW_OP_plus_uconst 0x6604]
     884                      .dwattr $C$DW$181, DW_AT_accessibility(DW_ACCESS_public)
     885              $C$DW$182       .dwtag  DW_TAG_member
     886                      .dwattr $C$DW$182, DW_AT_type(*$C$DW$T$24)
     887                      .dwattr $C$DW$182, DW_AT_name("ADCINTFLGCLR")
     888                      .dwattr $C$DW$182, DW_AT_TI_symbol_name("_ADCINTFLGCLR")
     889                      .dwattr $C$DW$182, DW_AT_data_member_location[DW_OP_plus_uconst 0x6605]
     890                      .dwattr $C$DW$182, DW_AT_accessibility(DW_ACCESS_public)
     891              $C$DW$183       .dwtag  DW_TAG_member
     892                      .dwattr $C$DW$183, DW_AT_type(*$C$DW$T$24)
     893                      .dwattr $C$DW$183, DW_AT_name("ADCINTOVF")
     894                      .dwattr $C$DW$183, DW_AT_TI_symbol_name("_ADCINTOVF")
     895                      .dwattr $C$DW$183, DW_AT_data_member_location[DW_OP_plus_uconst 0x6606]
     896                      .dwattr $C$DW$183, DW_AT_accessibility(DW_ACCESS_public)
     897              $C$DW$184       .dwtag  DW_TAG_member
     898                      .dwattr $C$DW$184, DW_AT_type(*$C$DW$T$24)
     899                      .dwattr $C$DW$184, DW_AT_name("ADCINTOVFCLR")
     900                      .dwattr $C$DW$184, DW_AT_TI_symbol_name("_ADCINTOVFCLR")
     901                      .dwattr $C$DW$184, DW_AT_data_member_location[DW_OP_plus_uconst 0x6607]
     902                      .dwattr $C$DW$184, DW_AT_accessibility(DW_ACCESS_public)
     903              $C$DW$185       .dwtag  DW_TAG_member
     904                      .dwattr $C$DW$185, DW_AT_type(*$C$DW$T$28)
     905                      .dwattr $C$DW$185, DW_AT_name("INTSELxNy")
     906                      .dwattr $C$DW$185, DW_AT_TI_symbol_name("_INTSELxNy")
     907                      .dwattr $C$DW$185, DW_AT_data_member_location[DW_OP_plus_uconst 0x6608]
     908                      .dwattr $C$DW$185, DW_AT_accessibility(DW_ACCESS_public)
TMS320C2000 Assembler PC v6.2.5 Sat Sep 16 15:51:24 2017

Tools Copyright (c) 1996-2014 Texas Instruments Incorporated
C:\Users\wmj\AppData\Local\Temp\1274411                              PAGE   18

     909              $C$DW$186       .dwtag  DW_TAG_member
     910                      .dwattr $C$DW$186, DW_AT_type(*$C$DW$T$29)
     911                      .dwattr $C$DW$186, DW_AT_name("rsvd_3")
     912                      .dwattr $C$DW$186, DW_AT_TI_symbol_name("_rsvd_3")
     913                      .dwattr $C$DW$186, DW_AT_data_member_location[DW_OP_plus_uconst 0x660d]
     914                      .dwattr $C$DW$186, DW_AT_accessibility(DW_ACCESS_public)
     915              $C$DW$187       .dwtag  DW_TAG_member
     916                      .dwattr $C$DW$187, DW_AT_type(*$C$DW$T$24)
     917                      .dwattr $C$DW$187, DW_AT_name("SOCPRICTRL")
     918                      .dwattr $C$DW$187, DW_AT_TI_symbol_name("_SOCPRICTRL")
     919                      .dwattr $C$DW$187, DW_AT_data_member_location[DW_OP_plus_uconst 0x6610]
     920                      .dwattr $C$DW$187, DW_AT_accessibility(DW_ACCESS_public)
     921              $C$DW$188       .dwtag  DW_TAG_member
     922                      .dwattr $C$DW$188, DW_AT_type(*$C$DW$T$24)
     923                      .dwattr $C$DW$188, DW_AT_name("rsvd_4")
     924                      .dwattr $C$DW$188, DW_AT_TI_symbol_name("_rsvd_4")
     925                      .dwattr $C$DW$188, DW_AT_data_member_location[DW_OP_plus_uconst 0x6611]
     926                      .dwattr $C$DW$188, DW_AT_accessibility(DW_ACCESS_public)
     927              $C$DW$189       .dwtag  DW_TAG_member
     928                      .dwattr $C$DW$189, DW_AT_type(*$C$DW$T$24)
     929                      .dwattr $C$DW$189, DW_AT_name("ADCSAMPLEMODE")
     930                      .dwattr $C$DW$189, DW_AT_TI_symbol_name("_ADCSAMPLEMODE")
     931                      .dwattr $C$DW$189, DW_AT_data_member_location[DW_OP_plus_uconst 0x6612]
     932                      .dwattr $C$DW$189, DW_AT_accessibility(DW_ACCESS_public)
     933              $C$DW$190       .dwtag  DW_TAG_member
     934                      .dwattr $C$DW$190, DW_AT_type(*$C$DW$T$24)
     935                      .dwattr $C$DW$190, DW_AT_name("rsvd_5")
     936                      .dwattr $C$DW$190, DW_AT_TI_symbol_name("_rsvd_5")
     937                      .dwattr $C$DW$190, DW_AT_data_member_location[DW_OP_plus_uconst 0x6613]
     938                      .dwattr $C$DW$190, DW_AT_accessibility(DW_ACCESS_public)
     939              $C$DW$191       .dwtag  DW_TAG_member
     940                      .dwattr $C$DW$191, DW_AT_type(*$C$DW$T$24)
     941                      .dwattr $C$DW$191, DW_AT_name("ADCINTSOCSEL1")
     942                      .dwattr $C$DW$191, DW_AT_TI_symbol_name("_ADCINTSOCSEL1")
     943                      .dwattr $C$DW$191, DW_AT_data_member_location[DW_OP_plus_uconst 0x6614]
     944                      .dwattr $C$DW$191, DW_AT_accessibility(DW_ACCESS_public)
     945              $C$DW$192       .dwtag  DW_TAG_member
     946                      .dwattr $C$DW$192, DW_AT_type(*$C$DW$T$24)
     947                      .dwattr $C$DW$192, DW_AT_name("ADCINTSOCSEL2")
     948                      .dwattr $C$DW$192, DW_AT_TI_symbol_name("_ADCINTSOCSEL2")
     949                      .dwattr $C$DW$192, DW_AT_data_member_location[DW_OP_plus_uconst 0x6615]
     950                      .dwattr $C$DW$192, DW_AT_accessibility(DW_ACCESS_public)
     951              $C$DW$193       .dwtag  DW_TAG_member
     952                      .dwattr $C$DW$193, DW_AT_type(*$C$DW$T$27)
     953                      .dwattr $C$DW$193, DW_AT_name("rsvd_6")
     954                      .dwattr $C$DW$193, DW_AT_TI_symbol_name("_rsvd_6")
     955                      .dwattr $C$DW$193, DW_AT_data_member_location[DW_OP_plus_uconst 0x6616]
     956                      .dwattr $C$DW$193, DW_AT_accessibility(DW_ACCESS_public)
     957              $C$DW$194       .dwtag  DW_TAG_member
     958                      .dwattr $C$DW$194, DW_AT_type(*$C$DW$T$24)
     959                      .dwattr $C$DW$194, DW_AT_name("ADCSOCFLG1")
     960                      .dwattr $C$DW$194, DW_AT_TI_symbol_name("_ADCSOCFLG1")
     961                      .dwattr $C$DW$194, DW_AT_data_member_location[DW_OP_plus_uconst 0x6618]
     962                      .dwattr $C$DW$194, DW_AT_accessibility(DW_ACCESS_public)
     963              $C$DW$195       .dwtag  DW_TAG_member
TMS320C2000 Assembler PC v6.2.5 Sat Sep 16 15:51:24 2017

Tools Copyright (c) 1996-2014 Texas Instruments Incorporated
C:\Users\wmj\AppData\Local\Temp\1274411                              PAGE   19

     964                      .dwattr $C$DW$195, DW_AT_type(*$C$DW$T$24)
     965                      .dwattr $C$DW$195, DW_AT_name("rsvd_7")
     966                      .dwattr $C$DW$195, DW_AT_TI_symbol_name("_rsvd_7")
     967                      .dwattr $C$DW$195, DW_AT_data_member_location[DW_OP_plus_uconst 0x6619]
     968                      .dwattr $C$DW$195, DW_AT_accessibility(DW_ACCESS_public)
     969              $C$DW$196       .dwtag  DW_TAG_member
     970                      .dwattr $C$DW$196, DW_AT_type(*$C$DW$T$24)
     971                      .dwattr $C$DW$196, DW_AT_name("ADCSOCFRC1")
     972                      .dwattr $C$DW$196, DW_AT_TI_symbol_name("_ADCSOCFRC1")
     973                      .dwattr $C$DW$196, DW_AT_data_member_location[DW_OP_plus_uconst 0x661a]
     974                      .dwattr $C$DW$196, DW_AT_accessibility(DW_ACCESS_public)
     975              $C$DW$197       .dwtag  DW_TAG_member
     976                      .dwattr $C$DW$197, DW_AT_type(*$C$DW$T$24)
     977                      .dwattr $C$DW$197, DW_AT_name("rsvd_8")
     978                      .dwattr $C$DW$197, DW_AT_TI_symbol_name("_rsvd_8")
     979                      .dwattr $C$DW$197, DW_AT_data_member_location[DW_OP_plus_uconst 0x661b]
     980                      .dwattr $C$DW$197, DW_AT_accessibility(DW_ACCESS_public)
     981              $C$DW$198       .dwtag  DW_TAG_member
     982                      .dwattr $C$DW$198, DW_AT_type(*$C$DW$T$24)
     983                      .dwattr $C$DW$198, DW_AT_name("ADCSOCOVF1")
     984                      .dwattr $C$DW$198, DW_AT_TI_symbol_name("_ADCSOCOVF1")
     985                      .dwattr $C$DW$198, DW_AT_data_member_location[DW_OP_plus_uconst 0x661c]
     986                      .dwattr $C$DW$198, DW_AT_accessibility(DW_ACCESS_public)
     987              $C$DW$199       .dwtag  DW_TAG_member
     988                      .dwattr $C$DW$199, DW_AT_type(*$C$DW$T$24)
     989                      .dwattr $C$DW$199, DW_AT_name("rsvd_9")
     990                      .dwattr $C$DW$199, DW_AT_TI_symbol_name("_rsvd_9")
     991                      .dwattr $C$DW$199, DW_AT_data_member_location[DW_OP_plus_uconst 0x661d]
     992                      .dwattr $C$DW$199, DW_AT_accessibility(DW_ACCESS_public)
     993              $C$DW$200       .dwtag  DW_TAG_member
     994                      .dwattr $C$DW$200, DW_AT_type(*$C$DW$T$24)
     995                      .dwattr $C$DW$200, DW_AT_name("ADCSOCOVFCLR1")
     996                      .dwattr $C$DW$200, DW_AT_TI_symbol_name("_ADCSOCOVFCLR1")
     997                      .dwattr $C$DW$200, DW_AT_data_member_location[DW_OP_plus_uconst 0x661e]
     998                      .dwattr $C$DW$200, DW_AT_accessibility(DW_ACCESS_public)
     999              $C$DW$201       .dwtag  DW_TAG_member
    1000                      .dwattr $C$DW$201, DW_AT_type(*$C$DW$T$24)
    1001                      .dwattr $C$DW$201, DW_AT_name("rsvd_10")
    1002                      .dwattr $C$DW$201, DW_AT_TI_symbol_name("_rsvd_10")
    1003                      .dwattr $C$DW$201, DW_AT_data_member_location[DW_OP_plus_uconst 0x661f]
    1004                      .dwattr $C$DW$201, DW_AT_accessibility(DW_ACCESS_public)
    1005              $C$DW$202       .dwtag  DW_TAG_member
    1006                      .dwattr $C$DW$202, DW_AT_type(*$C$DW$T$25)
    1007                      .dwattr $C$DW$202, DW_AT_name("ADCSOCxCTL")
    1008                      .dwattr $C$DW$202, DW_AT_TI_symbol_name("_ADCSOCxCTL")
    1009                      .dwattr $C$DW$202, DW_AT_data_member_location[DW_OP_plus_uconst 0x6620]
    1010                      .dwattr $C$DW$202, DW_AT_accessibility(DW_ACCESS_public)
    1011              $C$DW$203       .dwtag  DW_TAG_member
    1012                      .dwattr $C$DW$203, DW_AT_type(*$C$DW$T$25)
    1013                      .dwattr $C$DW$203, DW_AT_name("rsvd_11")
    1014                      .dwattr $C$DW$203, DW_AT_TI_symbol_name("_rsvd_11")
    1015                      .dwattr $C$DW$203, DW_AT_data_member_location[DW_OP_plus_uconst 0x6630]
    1016                      .dwattr $C$DW$203, DW_AT_accessibility(DW_ACCESS_public)
    1017              $C$DW$204       .dwtag  DW_TAG_member
    1018                      .dwattr $C$DW$204, DW_AT_type(*$C$DW$T$24)
TMS320C2000 Assembler PC v6.2.5 Sat Sep 16 15:51:24 2017

Tools Copyright (c) 1996-2014 Texas Instruments Incorporated
C:\Users\wmj\AppData\Local\Temp\1274411                              PAGE   20

    1019                      .dwattr $C$DW$204, DW_AT_name("ADCREFTRIM")
    1020                      .dwattr $C$DW$204, DW_AT_TI_symbol_name("_ADCREFTRIM")
    1021                      .dwattr $C$DW$204, DW_AT_data_member_location[DW_OP_plus_uconst 0x6640]
    1022                      .dwattr $C$DW$204, DW_AT_accessibility(DW_ACCESS_public)
    1023              $C$DW$205       .dwtag  DW_TAG_member
    1024                      .dwattr $C$DW$205, DW_AT_type(*$C$DW$T$24)
    1025                      .dwattr $C$DW$205, DW_AT_name("ADCOFFTRIM")
    1026                      .dwattr $C$DW$205, DW_AT_TI_symbol_name("_ADCOFFTRIM")
    1027                      .dwattr $C$DW$205, DW_AT_data_member_location[DW_OP_plus_uconst 0x6641]
    1028                      .dwattr $C$DW$205, DW_AT_accessibility(DW_ACCESS_public)
    1029              $C$DW$206       .dwtag  DW_TAG_member
    1030                      .dwattr $C$DW$206, DW_AT_type(*$C$DW$T$30)
    1031                      .dwattr $C$DW$206, DW_AT_name("resvd_12")
    1032                      .dwattr $C$DW$206, DW_AT_TI_symbol_name("_resvd_12")
    1033                      .dwattr $C$DW$206, DW_AT_data_member_location[DW_OP_plus_uconst 0x6642]
    1034                      .dwattr $C$DW$206, DW_AT_accessibility(DW_ACCESS_public)
    1035              $C$DW$207       .dwtag  DW_TAG_member
    1036                      .dwattr $C$DW$207, DW_AT_type(*$C$DW$T$24)
    1037                      .dwattr $C$DW$207, DW_AT_name("ADCREV")
    1038                      .dwattr $C$DW$207, DW_AT_TI_symbol_name("_ADCREV")
    1039                      .dwattr $C$DW$207, DW_AT_data_member_location[DW_OP_plus_uconst 0x664f]
    1040                      .dwattr $C$DW$207, DW_AT_accessibility(DW_ACCESS_public)
    1041                      .dwendtag $C$DW$T$31
    1042              
    1043              $C$DW$T$56      .dwtag  DW_TAG_pointer_type
    1044                      .dwattr $C$DW$T$56, DW_AT_type(*$C$DW$T$31)
    1045                      .dwattr $C$DW$T$56, DW_AT_address_class(0x16)
    1046              $C$DW$T$57      .dwtag  DW_TAG_typedef, DW_AT_name("ADC_Handle")
    1047                      .dwattr $C$DW$T$57, DW_AT_type(*$C$DW$T$56)
    1048                      .dwattr $C$DW$T$57, DW_AT_language(DW_LANG_C)
    1049              
    1050              $C$DW$T$32      .dwtag  DW_TAG_structure_type
    1051                      .dwattr $C$DW$T$32, DW_AT_name("_CLK_DIV_t_")
    1052                      .dwattr $C$DW$T$32, DW_AT_byte_size(0x02)
    1053              $C$DW$208       .dwtag  DW_TAG_member
    1054                      .dwattr $C$DW$208, DW_AT_type(*$C$DW$T$23)
    1055                      .dwattr $C$DW$208, DW_AT_name("FREF_DIVIDER")
    1056                      .dwattr $C$DW$208, DW_AT_TI_symbol_name("_FREF_DIVIDER")
    1057                      .dwattr $C$DW$208, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    1058                      .dwattr $C$DW$208, DW_AT_accessibility(DW_ACCESS_public)
    1059              $C$DW$209       .dwtag  DW_TAG_member
    1060                      .dwattr $C$DW$209, DW_AT_type(*$C$DW$T$23)
    1061                      .dwattr $C$DW$209, DW_AT_name("FIN_DIVIDER")
    1062                      .dwattr $C$DW$209, DW_AT_TI_symbol_name("_FIN_DIVIDER")
    1063                      .dwattr $C$DW$209, DW_AT_data_member_location[DW_OP_plus_uconst 0x1]
    1064                      .dwattr $C$DW$209, DW_AT_accessibility(DW_ACCESS_public)
    1065                      .dwendtag $C$DW$T$32
    1066              
    1067              $C$DW$T$94      .dwtag  DW_TAG_typedef, DW_AT_name("CLK_DIV_t_")
    1068                      .dwattr $C$DW$T$94, DW_AT_type(*$C$DW$T$32)
    1069                      .dwattr $C$DW$T$94, DW_AT_language(DW_LANG_C)
    1070              
    1071              $C$DW$T$34      .dwtag  DW_TAG_structure_type
    1072                      .dwattr $C$DW$T$34, DW_AT_name("_CLK_Obj_")
    1073                      .dwattr $C$DW$T$34, DW_AT_byte_size(0x11)
TMS320C2000 Assembler PC v6.2.5 Sat Sep 16 15:51:24 2017

Tools Copyright (c) 1996-2014 Texas Instruments Incorporated
C:\Users\wmj\AppData\Local\Temp\1274411                              PAGE   21

    1074              $C$DW$210       .dwtag  DW_TAG_member
    1075                      .dwattr $C$DW$210, DW_AT_type(*$C$DW$T$24)
    1076                      .dwattr $C$DW$210, DW_AT_name("XCLK")
    1077                      .dwattr $C$DW$210, DW_AT_TI_symbol_name("_XCLK")
    1078                      .dwattr $C$DW$210, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    1079                      .dwattr $C$DW$210, DW_AT_accessibility(DW_ACCESS_public)
    1080              $C$DW$211       .dwtag  DW_TAG_member
    1081                      .dwattr $C$DW$211, DW_AT_type(*$C$DW$T$24)
    1082                      .dwattr $C$DW$211, DW_AT_name("rsvd_1")
    1083                      .dwattr $C$DW$211, DW_AT_TI_symbol_name("_rsvd_1")
    1084                      .dwattr $C$DW$211, DW_AT_data_member_location[DW_OP_plus_uconst 0x1]
    1085                      .dwattr $C$DW$211, DW_AT_accessibility(DW_ACCESS_public)
    1086              $C$DW$212       .dwtag  DW_TAG_member
    1087                      .dwattr $C$DW$212, DW_AT_type(*$C$DW$T$24)
    1088                      .dwattr $C$DW$212, DW_AT_name("CLKCTL")
    1089                      .dwattr $C$DW$212, DW_AT_TI_symbol_name("_CLKCTL")
    1090                      .dwattr $C$DW$212, DW_AT_data_member_location[DW_OP_plus_uconst 0x2]
    1091                      .dwattr $C$DW$212, DW_AT_accessibility(DW_ACCESS_public)
    1092              $C$DW$213       .dwtag  DW_TAG_member
    1093                      .dwattr $C$DW$213, DW_AT_type(*$C$DW$T$33)
    1094                      .dwattr $C$DW$213, DW_AT_name("rsvd_2")
    1095                      .dwattr $C$DW$213, DW_AT_TI_symbol_name("_rsvd_2")
    1096                      .dwattr $C$DW$213, DW_AT_data_member_location[DW_OP_plus_uconst 0x3]
    1097                      .dwattr $C$DW$213, DW_AT_accessibility(DW_ACCESS_public)
    1098              $C$DW$214       .dwtag  DW_TAG_member
    1099                      .dwattr $C$DW$214, DW_AT_type(*$C$DW$T$24)
    1100                      .dwattr $C$DW$214, DW_AT_name("LOSPCP")
    1101                      .dwattr $C$DW$214, DW_AT_TI_symbol_name("_LOSPCP")
    1102                      .dwattr $C$DW$214, DW_AT_data_member_location[DW_OP_plus_uconst 0xb]
    1103                      .dwattr $C$DW$214, DW_AT_accessibility(DW_ACCESS_public)
    1104              $C$DW$215       .dwtag  DW_TAG_member
    1105                      .dwattr $C$DW$215, DW_AT_type(*$C$DW$T$24)
    1106                      .dwattr $C$DW$215, DW_AT_name("PCLKCR0")
    1107                      .dwattr $C$DW$215, DW_AT_TI_symbol_name("_PCLKCR0")
    1108                      .dwattr $C$DW$215, DW_AT_data_member_location[DW_OP_plus_uconst 0xc]
    1109                      .dwattr $C$DW$215, DW_AT_accessibility(DW_ACCESS_public)
    1110              $C$DW$216       .dwtag  DW_TAG_member
    1111                      .dwattr $C$DW$216, DW_AT_type(*$C$DW$T$24)
    1112                      .dwattr $C$DW$216, DW_AT_name("PCLKCR1")
    1113                      .dwattr $C$DW$216, DW_AT_TI_symbol_name("_PCLKCR1")
    1114                      .dwattr $C$DW$216, DW_AT_data_member_location[DW_OP_plus_uconst 0xd]
    1115                      .dwattr $C$DW$216, DW_AT_accessibility(DW_ACCESS_public)
    1116              $C$DW$217       .dwtag  DW_TAG_member
    1117                      .dwattr $C$DW$217, DW_AT_type(*$C$DW$T$27)
    1118                      .dwattr $C$DW$217, DW_AT_name("rsvd_3")
    1119                      .dwattr $C$DW$217, DW_AT_TI_symbol_name("_rsvd_3")
    1120                      .dwattr $C$DW$217, DW_AT_data_member_location[DW_OP_plus_uconst 0xe]
    1121                      .dwattr $C$DW$217, DW_AT_accessibility(DW_ACCESS_public)
    1122              $C$DW$218       .dwtag  DW_TAG_member
    1123                      .dwattr $C$DW$218, DW_AT_type(*$C$DW$T$24)
    1124                      .dwattr $C$DW$218, DW_AT_name("PCLKCR3")
    1125                      .dwattr $C$DW$218, DW_AT_TI_symbol_name("_PCLKCR3")
    1126                      .dwattr $C$DW$218, DW_AT_data_member_location[DW_OP_plus_uconst 0x10]
    1127                      .dwattr $C$DW$218, DW_AT_accessibility(DW_ACCESS_public)
    1128                      .dwendtag $C$DW$T$34
TMS320C2000 Assembler PC v6.2.5 Sat Sep 16 15:51:24 2017

Tools Copyright (c) 1996-2014 Texas Instruments Incorporated
C:\Users\wmj\AppData\Local\Temp\1274411                              PAGE   22

    1129              
    1130              $C$DW$T$58      .dwtag  DW_TAG_pointer_type
    1131                      .dwattr $C$DW$T$58, DW_AT_type(*$C$DW$T$34)
    1132                      .dwattr $C$DW$T$58, DW_AT_address_class(0x16)
    1133              $C$DW$T$59      .dwtag  DW_TAG_typedef, DW_AT_name("CLK_Handle")
    1134                      .dwattr $C$DW$T$59, DW_AT_type(*$C$DW$T$58)
    1135                      .dwattr $C$DW$T$59, DW_AT_language(DW_LANG_C)
    1136              
    1137              $C$DW$T$36      .dwtag  DW_TAG_structure_type
    1138                      .dwattr $C$DW$T$36, DW_AT_name("_CPU_Obj_")
    1139                      .dwattr $C$DW$T$36, DW_AT_byte_size(0x01)
    1140              $C$DW$219       .dwtag  DW_TAG_member
    1141                      .dwattr $C$DW$219, DW_AT_type(*$C$DW$T$35)
    1142                      .dwattr $C$DW$219, DW_AT_name("tmp")
    1143                      .dwattr $C$DW$219, DW_AT_TI_symbol_name("_tmp")
    1144                      .dwattr $C$DW$219, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    1145                      .dwattr $C$DW$219, DW_AT_accessibility(DW_ACCESS_public)
    1146                      .dwendtag $C$DW$T$36
    1147              
    1148              $C$DW$T$60      .dwtag  DW_TAG_pointer_type
    1149                      .dwattr $C$DW$T$60, DW_AT_type(*$C$DW$T$36)
    1150                      .dwattr $C$DW$T$60, DW_AT_address_class(0x16)
    1151              $C$DW$T$61      .dwtag  DW_TAG_typedef, DW_AT_name("CPU_Handle")
    1152                      .dwattr $C$DW$T$61, DW_AT_type(*$C$DW$T$60)
    1153                      .dwattr $C$DW$T$61, DW_AT_language(DW_LANG_C)
    1154              
    1155              $C$DW$T$44      .dwtag  DW_TAG_structure_type
    1156                      .dwattr $C$DW$T$44, DW_AT_name("_DECODER_Obj_")
    1157                      .dwattr $C$DW$T$44, DW_AT_byte_size(0x06)
    1158              $C$DW$220       .dwtag  DW_TAG_member
    1159                      .dwattr $C$DW$220, DW_AT_type(*$C$DW$T$38)
    1160                      .dwattr $C$DW$220, DW_AT_name("spiHandle")
    1161                      .dwattr $C$DW$220, DW_AT_TI_symbol_name("_spiHandle")
    1162                      .dwattr $C$DW$220, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    1163                      .dwattr $C$DW$220, DW_AT_accessibility(DW_ACCESS_public)
    1164              $C$DW$221       .dwtag  DW_TAG_member
    1165                      .dwattr $C$DW$221, DW_AT_type(*$C$DW$T$40)
    1166                      .dwattr $C$DW$221, DW_AT_name("gpioHandle")
    1167                      .dwattr $C$DW$221, DW_AT_TI_symbol_name("_gpioHandle")
    1168                      .dwattr $C$DW$221, DW_AT_data_member_location[DW_OP_plus_uconst 0x2]
    1169                      .dwattr $C$DW$221, DW_AT_accessibility(DW_ACCESS_public)
    1170              $C$DW$222       .dwtag  DW_TAG_member
    1171                      .dwattr $C$DW$222, DW_AT_type(*$C$DW$T$42)
    1172                      .dwattr $C$DW$222, DW_AT_name("gpioNumber")
    1173                      .dwattr $C$DW$222, DW_AT_TI_symbol_name("_gpioNumber")
    1174                      .dwattr $C$DW$222, DW_AT_data_member_location[DW_OP_plus_uconst 0x4]
    1175                      .dwattr $C$DW$222, DW_AT_accessibility(DW_ACCESS_public)
    1176              $C$DW$223       .dwtag  DW_TAG_member
    1177                      .dwattr $C$DW$223, DW_AT_type(*$C$DW$T$43)
    1178                      .dwattr $C$DW$223, DW_AT_name("RxTimeOut")
    1179                      .dwattr $C$DW$223, DW_AT_TI_symbol_name("_RxTimeOut")
    1180                      .dwattr $C$DW$223, DW_AT_data_member_location[DW_OP_plus_uconst 0x5]
    1181                      .dwattr $C$DW$223, DW_AT_accessibility(DW_ACCESS_public)
    1182                      .dwendtag $C$DW$T$44
    1183              
TMS320C2000 Assembler PC v6.2.5 Sat Sep 16 15:51:24 2017

Tools Copyright (c) 1996-2014 Texas Instruments Incorporated
C:\Users\wmj\AppData\Local\Temp\1274411                              PAGE   23

    1184              $C$DW$T$169     .dwtag  DW_TAG_typedef, DW_AT_name("DECODER_Obj")
    1185                      .dwattr $C$DW$T$169, DW_AT_type(*$C$DW$T$44)
    1186                      .dwattr $C$DW$T$169, DW_AT_language(DW_LANG_C)
    1187              $C$DW$T$167     .dwtag  DW_TAG_pointer_type
    1188                      .dwattr $C$DW$T$167, DW_AT_type(*$C$DW$T$44)
    1189                      .dwattr $C$DW$T$167, DW_AT_address_class(0x16)
    1190              $C$DW$T$168     .dwtag  DW_TAG_typedef, DW_AT_name("DECODER_Handle")
    1191                      .dwattr $C$DW$T$168, DW_AT_type(*$C$DW$T$167)
    1192                      .dwattr $C$DW$T$168, DW_AT_language(DW_LANG_C)
    1193              
    1194              $C$DW$T$45      .dwtag  DW_TAG_structure_type
    1195                      .dwattr $C$DW$T$45, DW_AT_name("_DRIVE_CURRENT_t_")
    1196                      .dwattr $C$DW$T$45, DW_AT_byte_size(0x02)
    1197              $C$DW$224       .dwtag  DW_TAG_member
    1198                      .dwattr $C$DW$224, DW_AT_type(*$C$DW$T$23)
    1199                      .dwattr $C$DW$224, DW_AT_name("IDRIVE")
    1200                      .dwattr $C$DW$224, DW_AT_TI_symbol_name("_IDRIVE")
    1201                      .dwattr $C$DW$224, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    1202                      .dwattr $C$DW$224, DW_AT_accessibility(DW_ACCESS_public)
    1203              $C$DW$225       .dwtag  DW_TAG_member
    1204                      .dwattr $C$DW$225, DW_AT_type(*$C$DW$T$23)
    1205                      .dwattr $C$DW$225, DW_AT_name("INIT_IDRIVE")
    1206                      .dwattr $C$DW$225, DW_AT_TI_symbol_name("_INIT_IDRIVE")
    1207                      .dwattr $C$DW$225, DW_AT_data_member_location[DW_OP_plus_uconst 0x1]
    1208                      .dwattr $C$DW$225, DW_AT_accessibility(DW_ACCESS_public)
    1209                      .dwendtag $C$DW$T$45
    1210              
    1211              $C$DW$T$114     .dwtag  DW_TAG_typedef, DW_AT_name("DRIVE_CURRENT_t_")
    1212                      .dwattr $C$DW$T$114, DW_AT_type(*$C$DW$T$45)
    1213                      .dwattr $C$DW$T$114, DW_AT_language(DW_LANG_C)
    1214              
    1215              $C$DW$T$47      .dwtag  DW_TAG_structure_type
    1216                      .dwattr $C$DW$T$47, DW_AT_name("_FILTER_FO_")
    1217                      .dwattr $C$DW$T$47, DW_AT_byte_size(0x0a)
    1218              $C$DW$226       .dwtag  DW_TAG_member
    1219                      .dwattr $C$DW$226, DW_AT_type(*$C$DW$T$46)
    1220                      .dwattr $C$DW$226, DW_AT_name("a1")
    1221                      .dwattr $C$DW$226, DW_AT_TI_symbol_name("_a1")
    1222                      .dwattr $C$DW$226, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    1223                      .dwattr $C$DW$226, DW_AT_accessibility(DW_ACCESS_public)
    1224              $C$DW$227       .dwtag  DW_TAG_member
    1225                      .dwattr $C$DW$227, DW_AT_type(*$C$DW$T$46)
    1226                      .dwattr $C$DW$227, DW_AT_name("b0")
    1227                      .dwattr $C$DW$227, DW_AT_TI_symbol_name("_b0")
    1228                      .dwattr $C$DW$227, DW_AT_data_member_location[DW_OP_plus_uconst 0x2]
    1229                      .dwattr $C$DW$227, DW_AT_accessibility(DW_ACCESS_public)
    1230              $C$DW$228       .dwtag  DW_TAG_member
    1231                      .dwattr $C$DW$228, DW_AT_type(*$C$DW$T$46)
    1232                      .dwattr $C$DW$228, DW_AT_name("b1")
    1233                      .dwattr $C$DW$228, DW_AT_TI_symbol_name("_b1")
    1234                      .dwattr $C$DW$228, DW_AT_data_member_location[DW_OP_plus_uconst 0x4]
    1235                      .dwattr $C$DW$228, DW_AT_accessibility(DW_ACCESS_public)
    1236              $C$DW$229       .dwtag  DW_TAG_member
    1237                      .dwattr $C$DW$229, DW_AT_type(*$C$DW$T$46)
    1238                      .dwattr $C$DW$229, DW_AT_name("x1")
TMS320C2000 Assembler PC v6.2.5 Sat Sep 16 15:51:24 2017

Tools Copyright (c) 1996-2014 Texas Instruments Incorporated
C:\Users\wmj\AppData\Local\Temp\1274411                              PAGE   24

    1239                      .dwattr $C$DW$229, DW_AT_TI_symbol_name("_x1")
    1240                      .dwattr $C$DW$229, DW_AT_data_member_location[DW_OP_plus_uconst 0x6]
    1241                      .dwattr $C$DW$229, DW_AT_accessibility(DW_ACCESS_public)
    1242              $C$DW$230       .dwtag  DW_TAG_member
    1243                      .dwattr $C$DW$230, DW_AT_type(*$C$DW$T$46)
    1244                      .dwattr $C$DW$230, DW_AT_name("y1")
    1245                      .dwattr $C$DW$230, DW_AT_TI_symbol_name("_y1")
    1246                      .dwattr $C$DW$230, DW_AT_data_member_location[DW_OP_plus_uconst 0x8]
    1247                      .dwattr $C$DW$230, DW_AT_accessibility(DW_ACCESS_public)
    1248                      .dwendtag $C$DW$T$47
    1249              
    1250              $C$DW$T$130     .dwtag  DW_TAG_typedef, DW_AT_name("FILTER_FO_Obj")
    1251                      .dwattr $C$DW$T$130, DW_AT_type(*$C$DW$T$47)
    1252                      .dwattr $C$DW$T$130, DW_AT_language(DW_LANG_C)
    1253              
    1254              $C$DW$T$21      .dwtag  DW_TAG_structure_type
    1255                      .dwattr $C$DW$T$21, DW_AT_name("_FILTER_FO_Obj_")
    1256                      .dwattr $C$DW$T$21, DW_AT_declaration
    1257                      .dwendtag $C$DW$T$21
    1258              
    1259              $C$DW$T$131     .dwtag  DW_TAG_pointer_type
    1260                      .dwattr $C$DW$T$131, DW_AT_type(*$C$DW$T$21)
    1261                      .dwattr $C$DW$T$131, DW_AT_address_class(0x16)
    1262              $C$DW$T$132     .dwtag  DW_TAG_typedef, DW_AT_name("FILTER_FO_Handle")
    1263                      .dwattr $C$DW$T$132, DW_AT_type(*$C$DW$T$131)
    1264                      .dwattr $C$DW$T$132, DW_AT_language(DW_LANG_C)
    1265              
    1266              $C$DW$T$48      .dwtag  DW_TAG_structure_type
    1267                      .dwattr $C$DW$T$48, DW_AT_name("_FLASH_Obj_")
    1268                      .dwattr $C$DW$T$48, DW_AT_byte_size(0x08)
    1269              $C$DW$231       .dwtag  DW_TAG_member
    1270                      .dwattr $C$DW$231, DW_AT_type(*$C$DW$T$24)
    1271                      .dwattr $C$DW$231, DW_AT_name("FOPT")
    1272                      .dwattr $C$DW$231, DW_AT_TI_symbol_name("_FOPT")
    1273                      .dwattr $C$DW$231, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    1274                      .dwattr $C$DW$231, DW_AT_accessibility(DW_ACCESS_public)
    1275              $C$DW$232       .dwtag  DW_TAG_member
    1276                      .dwattr $C$DW$232, DW_AT_type(*$C$DW$T$24)
    1277                      .dwattr $C$DW$232, DW_AT_name("rsvd_1")
    1278                      .dwattr $C$DW$232, DW_AT_TI_symbol_name("_rsvd_1")
    1279                      .dwattr $C$DW$232, DW_AT_data_member_location[DW_OP_plus_uconst 0x1]
    1280                      .dwattr $C$DW$232, DW_AT_accessibility(DW_ACCESS_public)
    1281              $C$DW$233       .dwtag  DW_TAG_member
    1282                      .dwattr $C$DW$233, DW_AT_type(*$C$DW$T$24)
    1283                      .dwattr $C$DW$233, DW_AT_name("FPWR")
    1284                      .dwattr $C$DW$233, DW_AT_TI_symbol_name("_FPWR")
    1285                      .dwattr $C$DW$233, DW_AT_data_member_location[DW_OP_plus_uconst 0x2]
    1286                      .dwattr $C$DW$233, DW_AT_accessibility(DW_ACCESS_public)
    1287              $C$DW$234       .dwtag  DW_TAG_member
    1288                      .dwattr $C$DW$234, DW_AT_type(*$C$DW$T$24)
    1289                      .dwattr $C$DW$234, DW_AT_name("FSTATUS")
    1290                      .dwattr $C$DW$234, DW_AT_TI_symbol_name("_FSTATUS")
    1291                      .dwattr $C$DW$234, DW_AT_data_member_location[DW_OP_plus_uconst 0x3]
    1292                      .dwattr $C$DW$234, DW_AT_accessibility(DW_ACCESS_public)
    1293              $C$DW$235       .dwtag  DW_TAG_member
TMS320C2000 Assembler PC v6.2.5 Sat Sep 16 15:51:24 2017

Tools Copyright (c) 1996-2014 Texas Instruments Incorporated
C:\Users\wmj\AppData\Local\Temp\1274411                              PAGE   25

    1294                      .dwattr $C$DW$235, DW_AT_type(*$C$DW$T$24)
    1295                      .dwattr $C$DW$235, DW_AT_name("FSTDBYWAIT")
    1296                      .dwattr $C$DW$235, DW_AT_TI_symbol_name("_FSTDBYWAIT")
    1297                      .dwattr $C$DW$235, DW_AT_data_member_location[DW_OP_plus_uconst 0x4]
    1298                      .dwattr $C$DW$235, DW_AT_accessibility(DW_ACCESS_public)
    1299              $C$DW$236       .dwtag  DW_TAG_member
    1300                      .dwattr $C$DW$236, DW_AT_type(*$C$DW$T$24)
    1301                      .dwattr $C$DW$236, DW_AT_name("FACTIVEWAIT")
    1302                      .dwattr $C$DW$236, DW_AT_TI_symbol_name("_FACTIVEWAIT")
    1303                      .dwattr $C$DW$236, DW_AT_data_member_location[DW_OP_plus_uconst 0x5]
    1304                      .dwattr $C$DW$236, DW_AT_accessibility(DW_ACCESS_public)
    1305              $C$DW$237       .dwtag  DW_TAG_member
    1306                      .dwattr $C$DW$237, DW_AT_type(*$C$DW$T$24)
    1307                      .dwattr $C$DW$237, DW_AT_name("FBANKWAIT")
    1308                      .dwattr $C$DW$237, DW_AT_TI_symbol_name("_FBANKWAIT")
    1309                      .dwattr $C$DW$237, DW_AT_data_member_location[DW_OP_plus_uconst 0x6]
    1310                      .dwattr $C$DW$237, DW_AT_accessibility(DW_ACCESS_public)
    1311              $C$DW$238       .dwtag  DW_TAG_member
    1312                      .dwattr $C$DW$238, DW_AT_type(*$C$DW$T$24)
    1313                      .dwattr $C$DW$238, DW_AT_name("FOTPWAIT")
    1314                      .dwattr $C$DW$238, DW_AT_TI_symbol_name("_FOTPWAIT")
    1315                      .dwattr $C$DW$238, DW_AT_data_member_location[DW_OP_plus_uconst 0x7]
    1316                      .dwattr $C$DW$238, DW_AT_accessibility(DW_ACCESS_public)
    1317                      .dwendtag $C$DW$T$48
    1318              
    1319              $C$DW$T$62      .dwtag  DW_TAG_pointer_type
    1320                      .dwattr $C$DW$T$62, DW_AT_type(*$C$DW$T$48)
    1321                      .dwattr $C$DW$T$62, DW_AT_address_class(0x16)
    1322              $C$DW$T$63      .dwtag  DW_TAG_typedef, DW_AT_name("FLASH_Handle")
    1323                      .dwattr $C$DW$T$63, DW_AT_type(*$C$DW$T$62)
    1324                      .dwattr $C$DW$T$63, DW_AT_language(DW_LANG_C)
    1325              
    1326              $C$DW$T$53      .dwtag  DW_TAG_structure_type
    1327                      .dwattr $C$DW$T$53, DW_AT_name("_GPIO_Obj_")
    1328                      .dwattr $C$DW$T$53, DW_AT_byte_size(0x6a)
    1329              $C$DW$239       .dwtag  DW_TAG_member
    1330                      .dwattr $C$DW$239, DW_AT_type(*$C$DW$T$50)
    1331                      .dwattr $C$DW$239, DW_AT_name("GPACTRL")
    1332                      .dwattr $C$DW$239, DW_AT_TI_symbol_name("_GPACTRL")
    1333                      .dwattr $C$DW$239, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    1334                      .dwattr $C$DW$239, DW_AT_accessibility(DW_ACCESS_public)
    1335              $C$DW$240       .dwtag  DW_TAG_member
    1336                      .dwattr $C$DW$240, DW_AT_type(*$C$DW$T$50)
    1337                      .dwattr $C$DW$240, DW_AT_name("GPAQSEL1")
    1338                      .dwattr $C$DW$240, DW_AT_TI_symbol_name("_GPAQSEL1")
    1339                      .dwattr $C$DW$240, DW_AT_data_member_location[DW_OP_plus_uconst 0x2]
    1340                      .dwattr $C$DW$240, DW_AT_accessibility(DW_ACCESS_public)
    1341              $C$DW$241       .dwtag  DW_TAG_member
    1342                      .dwattr $C$DW$241, DW_AT_type(*$C$DW$T$50)
    1343                      .dwattr $C$DW$241, DW_AT_name("GPAQSEL2")
    1344                      .dwattr $C$DW$241, DW_AT_TI_symbol_name("_GPAQSEL2")
    1345                      .dwattr $C$DW$241, DW_AT_data_member_location[DW_OP_plus_uconst 0x4]
    1346                      .dwattr $C$DW$241, DW_AT_accessibility(DW_ACCESS_public)
    1347              $C$DW$242       .dwtag  DW_TAG_member
    1348                      .dwattr $C$DW$242, DW_AT_type(*$C$DW$T$50)
TMS320C2000 Assembler PC v6.2.5 Sat Sep 16 15:51:24 2017

Tools Copyright (c) 1996-2014 Texas Instruments Incorporated
C:\Users\wmj\AppData\Local\Temp\1274411                              PAGE   26

    1349                      .dwattr $C$DW$242, DW_AT_name("GPAMUX1")
    1350                      .dwattr $C$DW$242, DW_AT_TI_symbol_name("_GPAMUX1")
    1351                      .dwattr $C$DW$242, DW_AT_data_member_location[DW_OP_plus_uconst 0x6]
    1352                      .dwattr $C$DW$242, DW_AT_accessibility(DW_ACCESS_public)
    1353              $C$DW$243       .dwtag  DW_TAG_member
    1354                      .dwattr $C$DW$243, DW_AT_type(*$C$DW$T$50)
    1355                      .dwattr $C$DW$243, DW_AT_name("GPAMUX2")
    1356                      .dwattr $C$DW$243, DW_AT_TI_symbol_name("_GPAMUX2")
    1357                      .dwattr $C$DW$243, DW_AT_data_member_location[DW_OP_plus_uconst 0x8]
    1358                      .dwattr $C$DW$243, DW_AT_accessibility(DW_ACCESS_public)
    1359              $C$DW$244       .dwtag  DW_TAG_member
    1360                      .dwattr $C$DW$244, DW_AT_type(*$C$DW$T$50)
    1361                      .dwattr $C$DW$244, DW_AT_name("GPADIR")
    1362                      .dwattr $C$DW$244, DW_AT_TI_symbol_name("_GPADIR")
    1363                      .dwattr $C$DW$244, DW_AT_data_member_location[DW_OP_plus_uconst 0xa]
    1364                      .dwattr $C$DW$244, DW_AT_accessibility(DW_ACCESS_public)
    1365              $C$DW$245       .dwtag  DW_TAG_member
    1366                      .dwattr $C$DW$245, DW_AT_type(*$C$DW$T$50)
    1367                      .dwattr $C$DW$245, DW_AT_name("GPAPUD")
    1368                      .dwattr $C$DW$245, DW_AT_TI_symbol_name("_GPAPUD")
    1369                      .dwattr $C$DW$245, DW_AT_data_member_location[DW_OP_plus_uconst 0xc]
    1370                      .dwattr $C$DW$245, DW_AT_accessibility(DW_ACCESS_public)
    1371              $C$DW$246       .dwtag  DW_TAG_member
    1372                      .dwattr $C$DW$246, DW_AT_type(*$C$DW$T$27)
    1373                      .dwattr $C$DW$246, DW_AT_name("rsvd_1")
    1374                      .dwattr $C$DW$246, DW_AT_TI_symbol_name("_rsvd_1")
    1375                      .dwattr $C$DW$246, DW_AT_data_member_location[DW_OP_plus_uconst 0xe]
    1376                      .dwattr $C$DW$246, DW_AT_accessibility(DW_ACCESS_public)
    1377              $C$DW$247       .dwtag  DW_TAG_member
    1378                      .dwattr $C$DW$247, DW_AT_type(*$C$DW$T$50)
    1379                      .dwattr $C$DW$247, DW_AT_name("GPBCTRL")
    1380                      .dwattr $C$DW$247, DW_AT_TI_symbol_name("_GPBCTRL")
    1381                      .dwattr $C$DW$247, DW_AT_data_member_location[DW_OP_plus_uconst 0x10]
    1382                      .dwattr $C$DW$247, DW_AT_accessibility(DW_ACCESS_public)
    1383              $C$DW$248       .dwtag  DW_TAG_member
    1384                      .dwattr $C$DW$248, DW_AT_type(*$C$DW$T$50)
    1385                      .dwattr $C$DW$248, DW_AT_name("GPBQSEL1")
    1386                      .dwattr $C$DW$248, DW_AT_TI_symbol_name("_GPBQSEL1")
    1387                      .dwattr $C$DW$248, DW_AT_data_member_location[DW_OP_plus_uconst 0x12]
    1388                      .dwattr $C$DW$248, DW_AT_accessibility(DW_ACCESS_public)
    1389              $C$DW$249       .dwtag  DW_TAG_member
    1390                      .dwattr $C$DW$249, DW_AT_type(*$C$DW$T$27)
    1391                      .dwattr $C$DW$249, DW_AT_name("rsvd_2")
    1392                      .dwattr $C$DW$249, DW_AT_TI_symbol_name("_rsvd_2")
    1393                      .dwattr $C$DW$249, DW_AT_data_member_location[DW_OP_plus_uconst 0x14]
    1394                      .dwattr $C$DW$249, DW_AT_accessibility(DW_ACCESS_public)
    1395              $C$DW$250       .dwtag  DW_TAG_member
    1396                      .dwattr $C$DW$250, DW_AT_type(*$C$DW$T$50)
    1397                      .dwattr $C$DW$250, DW_AT_name("GPBMUX1")
    1398                      .dwattr $C$DW$250, DW_AT_TI_symbol_name("_GPBMUX1")
    1399                      .dwattr $C$DW$250, DW_AT_data_member_location[DW_OP_plus_uconst 0x16]
    1400                      .dwattr $C$DW$250, DW_AT_accessibility(DW_ACCESS_public)
    1401              $C$DW$251       .dwtag  DW_TAG_member
    1402                      .dwattr $C$DW$251, DW_AT_type(*$C$DW$T$27)
    1403                      .dwattr $C$DW$251, DW_AT_name("rsvd_3")
TMS320C2000 Assembler PC v6.2.5 Sat Sep 16 15:51:24 2017

Tools Copyright (c) 1996-2014 Texas Instruments Incorporated
C:\Users\wmj\AppData\Local\Temp\1274411                              PAGE   27

    1404                      .dwattr $C$DW$251, DW_AT_TI_symbol_name("_rsvd_3")
    1405                      .dwattr $C$DW$251, DW_AT_data_member_location[DW_OP_plus_uconst 0x18]
    1406                      .dwattr $C$DW$251, DW_AT_accessibility(DW_ACCESS_public)
    1407              $C$DW$252       .dwtag  DW_TAG_member
    1408                      .dwattr $C$DW$252, DW_AT_type(*$C$DW$T$50)
    1409                      .dwattr $C$DW$252, DW_AT_name("GPBDIR")
    1410                      .dwattr $C$DW$252, DW_AT_TI_symbol_name("_GPBDIR")
    1411                      .dwattr $C$DW$252, DW_AT_data_member_location[DW_OP_plus_uconst 0x1a]
    1412                      .dwattr $C$DW$252, DW_AT_accessibility(DW_ACCESS_public)
    1413              $C$DW$253       .dwtag  DW_TAG_member
    1414                      .dwattr $C$DW$253, DW_AT_type(*$C$DW$T$50)
    1415                      .dwattr $C$DW$253, DW_AT_name("GPBPUD")
    1416                      .dwattr $C$DW$253, DW_AT_TI_symbol_name("_GPBPUD")
    1417                      .dwattr $C$DW$253, DW_AT_data_member_location[DW_OP_plus_uconst 0x1c]
    1418                      .dwattr $C$DW$253, DW_AT_accessibility(DW_ACCESS_public)
    1419              $C$DW$254       .dwtag  DW_TAG_member
    1420                      .dwattr $C$DW$254, DW_AT_type(*$C$DW$T$51)
    1421                      .dwattr $C$DW$254, DW_AT_name("rsvd_4")
    1422                      .dwattr $C$DW$254, DW_AT_TI_symbol_name("_rsvd_4")
    1423                      .dwattr $C$DW$254, DW_AT_data_member_location[DW_OP_plus_uconst 0x1e]
    1424                      .dwattr $C$DW$254, DW_AT_accessibility(DW_ACCESS_public)
    1425              $C$DW$255       .dwtag  DW_TAG_member
    1426                      .dwattr $C$DW$255, DW_AT_type(*$C$DW$T$50)
    1427                      .dwattr $C$DW$255, DW_AT_name("AIOMUX1")
    1428                      .dwattr $C$DW$255, DW_AT_TI_symbol_name("_AIOMUX1")
    1429                      .dwattr $C$DW$255, DW_AT_data_member_location[DW_OP_plus_uconst 0x36]
    1430                      .dwattr $C$DW$255, DW_AT_accessibility(DW_ACCESS_public)
    1431              $C$DW$256       .dwtag  DW_TAG_member
    1432                      .dwattr $C$DW$256, DW_AT_type(*$C$DW$T$27)
    1433                      .dwattr $C$DW$256, DW_AT_name("rsvd_5")
    1434                      .dwattr $C$DW$256, DW_AT_TI_symbol_name("_rsvd_5")
    1435                      .dwattr $C$DW$256, DW_AT_data_member_location[DW_OP_plus_uconst 0x38]
    1436                      .dwattr $C$DW$256, DW_AT_accessibility(DW_ACCESS_public)
    1437              $C$DW$257       .dwtag  DW_TAG_member
    1438                      .dwattr $C$DW$257, DW_AT_type(*$C$DW$T$50)
    1439                      .dwattr $C$DW$257, DW_AT_name("AIODIR")
    1440                      .dwattr $C$DW$257, DW_AT_TI_symbol_name("_AIODIR")
    1441                      .dwattr $C$DW$257, DW_AT_data_member_location[DW_OP_plus_uconst 0x3a]
    1442                      .dwattr $C$DW$257, DW_AT_accessibility(DW_ACCESS_public)
    1443              $C$DW$258       .dwtag  DW_TAG_member
    1444                      .dwattr $C$DW$258, DW_AT_type(*$C$DW$T$52)
    1445                      .dwattr $C$DW$258, DW_AT_name("rsvd_6")
    1446                      .dwattr $C$DW$258, DW_AT_TI_symbol_name("_rsvd_6")
    1447                      .dwattr $C$DW$258, DW_AT_data_member_location[DW_OP_plus_uconst 0x3c]
    1448                      .dwattr $C$DW$258, DW_AT_accessibility(DW_ACCESS_public)
    1449              $C$DW$259       .dwtag  DW_TAG_member
    1450                      .dwattr $C$DW$259, DW_AT_type(*$C$DW$T$50)
    1451                      .dwattr $C$DW$259, DW_AT_name("GPADAT")
    1452                      .dwattr $C$DW$259, DW_AT_TI_symbol_name("_GPADAT")
    1453                      .dwattr $C$DW$259, DW_AT_data_member_location[DW_OP_plus_uconst 0x40]
    1454                      .dwattr $C$DW$259, DW_AT_accessibility(DW_ACCESS_public)
    1455              $C$DW$260       .dwtag  DW_TAG_member
    1456                      .dwattr $C$DW$260, DW_AT_type(*$C$DW$T$50)
    1457                      .dwattr $C$DW$260, DW_AT_name("GPASET")
    1458                      .dwattr $C$DW$260, DW_AT_TI_symbol_name("_GPASET")
TMS320C2000 Assembler PC v6.2.5 Sat Sep 16 15:51:24 2017

Tools Copyright (c) 1996-2014 Texas Instruments Incorporated
C:\Users\wmj\AppData\Local\Temp\1274411                              PAGE   28

    1459                      .dwattr $C$DW$260, DW_AT_data_member_location[DW_OP_plus_uconst 0x42]
    1460                      .dwattr $C$DW$260, DW_AT_accessibility(DW_ACCESS_public)
    1461              $C$DW$261       .dwtag  DW_TAG_member
    1462                      .dwattr $C$DW$261, DW_AT_type(*$C$DW$T$50)
    1463                      .dwattr $C$DW$261, DW_AT_name("GPACLEAR")
    1464                      .dwattr $C$DW$261, DW_AT_TI_symbol_name("_GPACLEAR")
    1465                      .dwattr $C$DW$261, DW_AT_data_member_location[DW_OP_plus_uconst 0x44]
    1466                      .dwattr $C$DW$261, DW_AT_accessibility(DW_ACCESS_public)
    1467              $C$DW$262       .dwtag  DW_TAG_member
    1468                      .dwattr $C$DW$262, DW_AT_type(*$C$DW$T$50)
    1469                      .dwattr $C$DW$262, DW_AT_name("GPATOGGLE")
    1470                      .dwattr $C$DW$262, DW_AT_TI_symbol_name("_GPATOGGLE")
    1471                      .dwattr $C$DW$262, DW_AT_data_member_location[DW_OP_plus_uconst 0x46]
    1472                      .dwattr $C$DW$262, DW_AT_accessibility(DW_ACCESS_public)
    1473              $C$DW$263       .dwtag  DW_TAG_member
    1474                      .dwattr $C$DW$263, DW_AT_type(*$C$DW$T$50)
    1475                      .dwattr $C$DW$263, DW_AT_name("GPBDAT")
    1476                      .dwattr $C$DW$263, DW_AT_TI_symbol_name("_GPBDAT")
    1477                      .dwattr $C$DW$263, DW_AT_data_member_location[DW_OP_plus_uconst 0x48]
    1478                      .dwattr $C$DW$263, DW_AT_accessibility(DW_ACCESS_public)
    1479              $C$DW$264       .dwtag  DW_TAG_member
    1480                      .dwattr $C$DW$264, DW_AT_type(*$C$DW$T$50)
    1481                      .dwattr $C$DW$264, DW_AT_name("GPBSET")
    1482                      .dwattr $C$DW$264, DW_AT_TI_symbol_name("_GPBSET")
    1483                      .dwattr $C$DW$264, DW_AT_data_member_location[DW_OP_plus_uconst 0x4a]
    1484                      .dwattr $C$DW$264, DW_AT_accessibility(DW_ACCESS_public)
    1485              $C$DW$265       .dwtag  DW_TAG_member
    1486                      .dwattr $C$DW$265, DW_AT_type(*$C$DW$T$50)
    1487                      .dwattr $C$DW$265, DW_AT_name("GPBCLEAR")
    1488                      .dwattr $C$DW$265, DW_AT_TI_symbol_name("_GPBCLEAR")
    1489                      .dwattr $C$DW$265, DW_AT_data_member_location[DW_OP_plus_uconst 0x4c]
    1490                      .dwattr $C$DW$265, DW_AT_accessibility(DW_ACCESS_public)
    1491              $C$DW$266       .dwtag  DW_TAG_member
    1492                      .dwattr $C$DW$266, DW_AT_type(*$C$DW$T$50)
    1493                      .dwattr $C$DW$266, DW_AT_name("GPBTOGGLE")
    1494                      .dwattr $C$DW$266, DW_AT_TI_symbol_name("_GPBTOGGLE")
    1495                      .dwattr $C$DW$266, DW_AT_data_member_location[DW_OP_plus_uconst 0x4e]
    1496                      .dwattr $C$DW$266, DW_AT_accessibility(DW_ACCESS_public)
    1497              $C$DW$267       .dwtag  DW_TAG_member
    1498                      .dwattr $C$DW$267, DW_AT_type(*$C$DW$T$33)
    1499                      .dwattr $C$DW$267, DW_AT_name("rsvd_7")
    1500                      .dwattr $C$DW$267, DW_AT_TI_symbol_name("_rsvd_7")
    1501                      .dwattr $C$DW$267, DW_AT_data_member_location[DW_OP_plus_uconst 0x50]
    1502                      .dwattr $C$DW$267, DW_AT_accessibility(DW_ACCESS_public)
    1503              $C$DW$268       .dwtag  DW_TAG_member
    1504                      .dwattr $C$DW$268, DW_AT_type(*$C$DW$T$50)
    1505                      .dwattr $C$DW$268, DW_AT_name("AIODAT")
    1506                      .dwattr $C$DW$268, DW_AT_TI_symbol_name("_AIODAT")
    1507                      .dwattr $C$DW$268, DW_AT_data_member_location[DW_OP_plus_uconst 0x58]
    1508                      .dwattr $C$DW$268, DW_AT_accessibility(DW_ACCESS_public)
    1509              $C$DW$269       .dwtag  DW_TAG_member
    1510                      .dwattr $C$DW$269, DW_AT_type(*$C$DW$T$50)
    1511                      .dwattr $C$DW$269, DW_AT_name("AIOSET")
    1512                      .dwattr $C$DW$269, DW_AT_TI_symbol_name("_AIOSET")
    1513                      .dwattr $C$DW$269, DW_AT_data_member_location[DW_OP_plus_uconst 0x5a]
TMS320C2000 Assembler PC v6.2.5 Sat Sep 16 15:51:24 2017

Tools Copyright (c) 1996-2014 Texas Instruments Incorporated
C:\Users\wmj\AppData\Local\Temp\1274411                              PAGE   29

    1514                      .dwattr $C$DW$269, DW_AT_accessibility(DW_ACCESS_public)
    1515              $C$DW$270       .dwtag  DW_TAG_member
    1516                      .dwattr $C$DW$270, DW_AT_type(*$C$DW$T$50)
    1517                      .dwattr $C$DW$270, DW_AT_name("AIOCLEAR")
    1518                      .dwattr $C$DW$270, DW_AT_TI_symbol_name("_AIOCLEAR")
    1519                      .dwattr $C$DW$270, DW_AT_data_member_location[DW_OP_plus_uconst 0x5c]
    1520                      .dwattr $C$DW$270, DW_AT_accessibility(DW_ACCESS_public)
    1521              $C$DW$271       .dwtag  DW_TAG_member
    1522                      .dwattr $C$DW$271, DW_AT_type(*$C$DW$T$50)
    1523                      .dwattr $C$DW$271, DW_AT_name("AIOTOGGLE")
    1524                      .dwattr $C$DW$271, DW_AT_TI_symbol_name("_AIOTOGGLE")
    1525                      .dwattr $C$DW$271, DW_AT_data_member_location[DW_OP_plus_uconst 0x5e]
    1526                      .dwattr $C$DW$271, DW_AT_accessibility(DW_ACCESS_public)
    1527              $C$DW$272       .dwtag  DW_TAG_member
    1528                      .dwattr $C$DW$272, DW_AT_type(*$C$DW$T$29)
    1529                      .dwattr $C$DW$272, DW_AT_name("GPIOXINTnSEL")
    1530                      .dwattr $C$DW$272, DW_AT_TI_symbol_name("_GPIOXINTnSEL")
    1531                      .dwattr $C$DW$272, DW_AT_data_member_location[DW_OP_plus_uconst 0x60]
    1532                      .dwattr $C$DW$272, DW_AT_accessibility(DW_ACCESS_public)
    1533              $C$DW$273       .dwtag  DW_TAG_member
    1534                      .dwattr $C$DW$273, DW_AT_type(*$C$DW$T$28)
    1535                      .dwattr $C$DW$273, DW_AT_name("rsvd_8")
    1536                      .dwattr $C$DW$273, DW_AT_TI_symbol_name("_rsvd_8")
    1537                      .dwattr $C$DW$273, DW_AT_data_member_location[DW_OP_plus_uconst 0x63]
    1538                      .dwattr $C$DW$273, DW_AT_accessibility(DW_ACCESS_public)
    1539              $C$DW$274       .dwtag  DW_TAG_member
    1540                      .dwattr $C$DW$274, DW_AT_type(*$C$DW$T$50)
    1541                      .dwattr $C$DW$274, DW_AT_name("GPIOLPMSEL")
    1542                      .dwattr $C$DW$274, DW_AT_TI_symbol_name("_GPIOLPMSEL")
    1543                      .dwattr $C$DW$274, DW_AT_data_member_location[DW_OP_plus_uconst 0x68]
    1544                      .dwattr $C$DW$274, DW_AT_accessibility(DW_ACCESS_public)
    1545                      .dwendtag $C$DW$T$53
    1546              
    1547              $C$DW$T$39      .dwtag  DW_TAG_pointer_type
    1548                      .dwattr $C$DW$T$39, DW_AT_type(*$C$DW$T$53)
    1549                      .dwattr $C$DW$T$39, DW_AT_address_class(0x16)
    1550              $C$DW$T$40      .dwtag  DW_TAG_typedef, DW_AT_name("GPIO_Handle")
    1551                      .dwattr $C$DW$T$40, DW_AT_type(*$C$DW$T$39)
    1552                      .dwattr $C$DW$T$40, DW_AT_language(DW_LANG_C)
    1553              
    1554              $C$DW$T$55      .dwtag  DW_TAG_structure_type
    1555                      .dwattr $C$DW$T$55, DW_AT_name("_HAL_AdcData_t_")
    1556                      .dwattr $C$DW$T$55, DW_AT_byte_size(0x16)
    1557              $C$DW$275       .dwtag  DW_TAG_member
    1558                      .dwattr $C$DW$275, DW_AT_type(*$C$DW$T$54)
    1559                      .dwattr $C$DW$275, DW_AT_name("I")
    1560                      .dwattr $C$DW$275, DW_AT_TI_symbol_name("_I")
    1561                      .dwattr $C$DW$275, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    1562                      .dwattr $C$DW$275, DW_AT_accessibility(DW_ACCESS_public)
    1563              $C$DW$276       .dwtag  DW_TAG_member
    1564                      .dwattr $C$DW$276, DW_AT_type(*$C$DW$T$54)
    1565                      .dwattr $C$DW$276, DW_AT_name("V")
    1566                      .dwattr $C$DW$276, DW_AT_TI_symbol_name("_V")
    1567                      .dwattr $C$DW$276, DW_AT_data_member_location[DW_OP_plus_uconst 0x6]
    1568                      .dwattr $C$DW$276, DW_AT_accessibility(DW_ACCESS_public)
TMS320C2000 Assembler PC v6.2.5 Sat Sep 16 15:51:24 2017

Tools Copyright (c) 1996-2014 Texas Instruments Incorporated
C:\Users\wmj\AppData\Local\Temp\1274411                              PAGE   30

    1569              $C$DW$277       .dwtag  DW_TAG_member
    1570                      .dwattr $C$DW$277, DW_AT_type(*$C$DW$T$46)
    1571                      .dwattr $C$DW$277, DW_AT_name("dcBus")
    1572                      .dwattr $C$DW$277, DW_AT_TI_symbol_name("_dcBus")
    1573                      .dwattr $C$DW$277, DW_AT_data_member_location[DW_OP_plus_uconst 0xc]
    1574                      .dwattr $C$DW$277, DW_AT_accessibility(DW_ACCESS_public)
    1575              $C$DW$278       .dwtag  DW_TAG_member
    1576                      .dwattr $C$DW$278, DW_AT_type(*$C$DW$T$46)
    1577                      .dwattr $C$DW$278, DW_AT_name("analogSensor1")
    1578                      .dwattr $C$DW$278, DW_AT_TI_symbol_name("_analogSensor1")
    1579                      .dwattr $C$DW$278, DW_AT_data_member_location[DW_OP_plus_uconst 0xe]
    1580                      .dwattr $C$DW$278, DW_AT_accessibility(DW_ACCESS_public)
    1581              $C$DW$279       .dwtag  DW_TAG_member
    1582                      .dwattr $C$DW$279, DW_AT_type(*$C$DW$T$46)
    1583                      .dwattr $C$DW$279, DW_AT_name("analogSensor2")
    1584                      .dwattr $C$DW$279, DW_AT_TI_symbol_name("_analogSensor2")
    1585                      .dwattr $C$DW$279, DW_AT_data_member_location[DW_OP_plus_uconst 0x10]
    1586                      .dwattr $C$DW$279, DW_AT_accessibility(DW_ACCESS_public)
    1587              $C$DW$280       .dwtag  DW_TAG_member
    1588                      .dwattr $C$DW$280, DW_AT_type(*$C$DW$T$46)
    1589                      .dwattr $C$DW$280, DW_AT_name("igbtNTC")
    1590                      .dwattr $C$DW$280, DW_AT_TI_symbol_name("_igbtNTC")
    1591                      .dwattr $C$DW$280, DW_AT_data_member_location[DW_OP_plus_uconst 0x12]
    1592                      .dwattr $C$DW$280, DW_AT_accessibility(DW_ACCESS_public)
    1593              $C$DW$281       .dwtag  DW_TAG_member
    1594                      .dwattr $C$DW$281, DW_AT_type(*$C$DW$T$46)
    1595                      .dwattr $C$DW$281, DW_AT_name("boardAddr")
    1596                      .dwattr $C$DW$281, DW_AT_TI_symbol_name("_boardAddr")
    1597                      .dwattr $C$DW$281, DW_AT_data_member_location[DW_OP_plus_uconst 0x14]
    1598                      .dwattr $C$DW$281, DW_AT_accessibility(DW_ACCESS_public)
    1599                      .dwendtag $C$DW$T$55
    1600              
    1601              $C$DW$T$89      .dwtag  DW_TAG_typedef, DW_AT_name("HAL_AdcData_t")
    1602                      .dwattr $C$DW$T$89, DW_AT_type(*$C$DW$T$55)
    1603                      .dwattr $C$DW$T$89, DW_AT_language(DW_LANG_C)
    1604              
    1605              $C$DW$T$92      .dwtag  DW_TAG_structure_type
    1606                      .dwattr $C$DW$T$92, DW_AT_name("_HAL_Obj_")
    1607                      .dwattr $C$DW$T$92, DW_AT_byte_size(0xb6)
    1608              $C$DW$282       .dwtag  DW_TAG_member
    1609                      .dwattr $C$DW$282, DW_AT_type(*$C$DW$T$57)
    1610                      .dwattr $C$DW$282, DW_AT_name("adcHandle")
    1611                      .dwattr $C$DW$282, DW_AT_TI_symbol_name("_adcHandle")
    1612                      .dwattr $C$DW$282, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    1613                      .dwattr $C$DW$282, DW_AT_accessibility(DW_ACCESS_public)
    1614              $C$DW$283       .dwtag  DW_TAG_member
    1615                      .dwattr $C$DW$283, DW_AT_type(*$C$DW$T$59)
    1616                      .dwattr $C$DW$283, DW_AT_name("clkHandle")
    1617                      .dwattr $C$DW$283, DW_AT_TI_symbol_name("_clkHandle")
    1618                      .dwattr $C$DW$283, DW_AT_data_member_location[DW_OP_plus_uconst 0x2]
    1619                      .dwattr $C$DW$283, DW_AT_accessibility(DW_ACCESS_public)
    1620              $C$DW$284       .dwtag  DW_TAG_member
    1621                      .dwattr $C$DW$284, DW_AT_type(*$C$DW$T$61)
    1622                      .dwattr $C$DW$284, DW_AT_name("cpuHandle")
    1623                      .dwattr $C$DW$284, DW_AT_TI_symbol_name("_cpuHandle")
TMS320C2000 Assembler PC v6.2.5 Sat Sep 16 15:51:24 2017

Tools Copyright (c) 1996-2014 Texas Instruments Incorporated
C:\Users\wmj\AppData\Local\Temp\1274411                              PAGE   31

    1624                      .dwattr $C$DW$284, DW_AT_data_member_location[DW_OP_plus_uconst 0x4]
    1625                      .dwattr $C$DW$284, DW_AT_accessibility(DW_ACCESS_public)
    1626              $C$DW$285       .dwtag  DW_TAG_member
    1627                      .dwattr $C$DW$285, DW_AT_type(*$C$DW$T$63)
    1628                      .dwattr $C$DW$285, DW_AT_name("flashHandle")
    1629                      .dwattr $C$DW$285, DW_AT_TI_symbol_name("_flashHandle")
    1630                      .dwattr $C$DW$285, DW_AT_data_member_location[DW_OP_plus_uconst 0x6]
    1631                      .dwattr $C$DW$285, DW_AT_accessibility(DW_ACCESS_public)
    1632              $C$DW$286       .dwtag  DW_TAG_member
    1633                      .dwattr $C$DW$286, DW_AT_type(*$C$DW$T$40)
    1634                      .dwattr $C$DW$286, DW_AT_name("gpioHandle")
    1635                      .dwattr $C$DW$286, DW_AT_TI_symbol_name("_gpioHandle")
    1636                      .dwattr $C$DW$286, DW_AT_data_member_location[DW_OP_plus_uconst 0x8]
    1637                      .dwattr $C$DW$286, DW_AT_accessibility(DW_ACCESS_public)
    1638              $C$DW$287       .dwtag  DW_TAG_member
    1639                      .dwattr $C$DW$287, DW_AT_type(*$C$DW$T$66)
    1640                      .dwattr $C$DW$287, DW_AT_name("offsetHandle_I")
    1641                      .dwattr $C$DW$287, DW_AT_TI_symbol_name("_offsetHandle_I")
    1642                      .dwattr $C$DW$287, DW_AT_data_member_location[DW_OP_plus_uconst 0xa]
    1643                      .dwattr $C$DW$287, DW_AT_accessibility(DW_ACCESS_public)
    1644              $C$DW$288       .dwtag  DW_TAG_member
    1645                      .dwattr $C$DW$288, DW_AT_type(*$C$DW$T$68)
    1646                      .dwattr $C$DW$288, DW_AT_name("offset_I")
    1647                      .dwattr $C$DW$288, DW_AT_TI_symbol_name("_offset_I")
    1648                      .dwattr $C$DW$288, DW_AT_data_member_location[DW_OP_plus_uconst 0x10]
    1649                      .dwattr $C$DW$288, DW_AT_accessibility(DW_ACCESS_public)
    1650              $C$DW$289       .dwtag  DW_TAG_member
    1651                      .dwattr $C$DW$289, DW_AT_type(*$C$DW$T$66)
    1652                      .dwattr $C$DW$289, DW_AT_name("offsetHandle_V")
    1653                      .dwattr $C$DW$289, DW_AT_TI_symbol_name("_offsetHandle_V")
    1654                      .dwattr $C$DW$289, DW_AT_data_member_location[DW_OP_plus_uconst 0x40]
    1655                      .dwattr $C$DW$289, DW_AT_accessibility(DW_ACCESS_public)
    1656              $C$DW$290       .dwtag  DW_TAG_member
    1657                      .dwattr $C$DW$290, DW_AT_type(*$C$DW$T$68)
    1658                      .dwattr $C$DW$290, DW_AT_name("offset_V")
    1659                      .dwattr $C$DW$290, DW_AT_TI_symbol_name("_offset_V")
    1660                      .dwattr $C$DW$290, DW_AT_data_member_location[DW_OP_plus_uconst 0x46]
    1661                      .dwattr $C$DW$290, DW_AT_accessibility(DW_ACCESS_public)
    1662              $C$DW$291       .dwtag  DW_TAG_member
    1663                      .dwattr $C$DW$291, DW_AT_type(*$C$DW$T$70)
    1664                      .dwattr $C$DW$291, DW_AT_name("oscHandle")
    1665                      .dwattr $C$DW$291, DW_AT_TI_symbol_name("_oscHandle")
    1666                      .dwattr $C$DW$291, DW_AT_data_member_location[DW_OP_plus_uconst 0x76]
    1667                      .dwattr $C$DW$291, DW_AT_accessibility(DW_ACCESS_public)
    1668              $C$DW$292       .dwtag  DW_TAG_member
    1669                      .dwattr $C$DW$292, DW_AT_type(*$C$DW$T$72)
    1670                      .dwattr $C$DW$292, DW_AT_name("pieHandle")
    1671                      .dwattr $C$DW$292, DW_AT_TI_symbol_name("_pieHandle")
    1672                      .dwattr $C$DW$292, DW_AT_data_member_location[DW_OP_plus_uconst 0x78]
    1673                      .dwattr $C$DW$292, DW_AT_accessibility(DW_ACCESS_public)
    1674              $C$DW$293       .dwtag  DW_TAG_member
    1675                      .dwattr $C$DW$293, DW_AT_type(*$C$DW$T$74)
    1676                      .dwattr $C$DW$293, DW_AT_name("pllHandle")
    1677                      .dwattr $C$DW$293, DW_AT_TI_symbol_name("_pllHandle")
    1678                      .dwattr $C$DW$293, DW_AT_data_member_location[DW_OP_plus_uconst 0x7a]
TMS320C2000 Assembler PC v6.2.5 Sat Sep 16 15:51:24 2017

Tools Copyright (c) 1996-2014 Texas Instruments Incorporated
C:\Users\wmj\AppData\Local\Temp\1274411                              PAGE   32

    1679                      .dwattr $C$DW$293, DW_AT_accessibility(DW_ACCESS_public)
    1680              $C$DW$294       .dwtag  DW_TAG_member
    1681                      .dwattr $C$DW$294, DW_AT_type(*$C$DW$T$77)
    1682                      .dwattr $C$DW$294, DW_AT_name("pwmHandle")
    1683                      .dwattr $C$DW$294, DW_AT_TI_symbol_name("_pwmHandle")
    1684                      .dwattr $C$DW$294, DW_AT_data_member_location[DW_OP_plus_uconst 0x7c]
    1685                      .dwattr $C$DW$294, DW_AT_accessibility(DW_ACCESS_public)
    1686              $C$DW$295       .dwtag  DW_TAG_member
    1687                      .dwattr $C$DW$295, DW_AT_type(*$C$DW$T$77)
    1688                      .dwattr $C$DW$295, DW_AT_name("pwmDacHandle")
    1689                      .dwattr $C$DW$295, DW_AT_TI_symbol_name("_pwmDacHandle")
    1690                      .dwattr $C$DW$295, DW_AT_data_member_location[DW_OP_plus_uconst 0x82]
    1691                      .dwattr $C$DW$295, DW_AT_accessibility(DW_ACCESS_public)
    1692              $C$DW$296       .dwtag  DW_TAG_member
    1693                      .dwattr $C$DW$296, DW_AT_type(*$C$DW$T$79)
    1694                      .dwattr $C$DW$296, DW_AT_name("pwrHandle")
    1695                      .dwattr $C$DW$296, DW_AT_TI_symbol_name("_pwrHandle")
    1696                      .dwattr $C$DW$296, DW_AT_data_member_location[DW_OP_plus_uconst 0x88]
    1697                      .dwattr $C$DW$296, DW_AT_accessibility(DW_ACCESS_public)
    1698              $C$DW$297       .dwtag  DW_TAG_member
    1699                      .dwattr $C$DW$297, DW_AT_type(*$C$DW$T$82)
    1700                      .dwattr $C$DW$297, DW_AT_name("timerHandle")
    1701                      .dwattr $C$DW$297, DW_AT_TI_symbol_name("_timerHandle")
    1702                      .dwattr $C$DW$297, DW_AT_data_member_location[DW_OP_plus_uconst 0x8a]
    1703                      .dwattr $C$DW$297, DW_AT_accessibility(DW_ACCESS_public)
    1704              $C$DW$298       .dwtag  DW_TAG_member
    1705                      .dwattr $C$DW$298, DW_AT_type(*$C$DW$T$84)
    1706                      .dwattr $C$DW$298, DW_AT_name("i2cHandle")
    1707                      .dwattr $C$DW$298, DW_AT_TI_symbol_name("_i2cHandle")
    1708                      .dwattr $C$DW$298, DW_AT_data_member_location[DW_OP_plus_uconst 0x90]
    1709                      .dwattr $C$DW$298, DW_AT_accessibility(DW_ACCESS_public)
    1710              $C$DW$299       .dwtag  DW_TAG_member
    1711                      .dwattr $C$DW$299, DW_AT_type(*$C$DW$T$38)
    1712                      .dwattr $C$DW$299, DW_AT_name("spiAHandle")
    1713                      .dwattr $C$DW$299, DW_AT_TI_symbol_name("_spiAHandle")
    1714                      .dwattr $C$DW$299, DW_AT_data_member_location[DW_OP_plus_uconst 0x92]
    1715                      .dwattr $C$DW$299, DW_AT_accessibility(DW_ACCESS_public)
    1716              $C$DW$300       .dwtag  DW_TAG_member
    1717                      .dwattr $C$DW$300, DW_AT_type(*$C$DW$T$86)
    1718                      .dwattr $C$DW$300, DW_AT_name("wdogHandle")
    1719                      .dwattr $C$DW$300, DW_AT_TI_symbol_name("_wdogHandle")
    1720                      .dwattr $C$DW$300, DW_AT_data_member_location[DW_OP_plus_uconst 0x94]
    1721                      .dwattr $C$DW$300, DW_AT_accessibility(DW_ACCESS_public)
    1722              $C$DW$301       .dwtag  DW_TAG_member
    1723                      .dwattr $C$DW$301, DW_AT_type(*$C$DW$T$88)
    1724                      .dwattr $C$DW$301, DW_AT_name("sciHandle")
    1725                      .dwattr $C$DW$301, DW_AT_TI_symbol_name("_sciHandle")
    1726                      .dwattr $C$DW$301, DW_AT_data_member_location[DW_OP_plus_uconst 0x96]
    1727                      .dwattr $C$DW$301, DW_AT_accessibility(DW_ACCESS_public)
    1728              $C$DW$302       .dwtag  DW_TAG_member
    1729                      .dwattr $C$DW$302, DW_AT_type(*$C$DW$T$89)
    1730                      .dwattr $C$DW$302, DW_AT_name("adcBias")
    1731                      .dwattr $C$DW$302, DW_AT_TI_symbol_name("_adcBias")
    1732                      .dwattr $C$DW$302, DW_AT_data_member_location[DW_OP_plus_uconst 0x98]
    1733                      .dwattr $C$DW$302, DW_AT_accessibility(DW_ACCESS_public)
TMS320C2000 Assembler PC v6.2.5 Sat Sep 16 15:51:24 2017

Tools Copyright (c) 1996-2014 Texas Instruments Incorporated
C:\Users\wmj\AppData\Local\Temp\1274411                              PAGE   33

    1734              $C$DW$303       .dwtag  DW_TAG_member
    1735                      .dwattr $C$DW$303, DW_AT_type(*$C$DW$T$46)
    1736                      .dwattr $C$DW$303, DW_AT_name("current_sf")
    1737                      .dwattr $C$DW$303, DW_AT_TI_symbol_name("_current_sf")
    1738                      .dwattr $C$DW$303, DW_AT_data_member_location[DW_OP_plus_uconst 0xae]
    1739                      .dwattr $C$DW$303, DW_AT_accessibility(DW_ACCESS_public)
    1740              $C$DW$304       .dwtag  DW_TAG_member
    1741                      .dwattr $C$DW$304, DW_AT_type(*$C$DW$T$46)
    1742                      .dwattr $C$DW$304, DW_AT_name("voltage_sf")
    1743                      .dwattr $C$DW$304, DW_AT_TI_symbol_name("_voltage_sf")
    1744                      .dwattr $C$DW$304, DW_AT_data_member_location[DW_OP_plus_uconst 0xb0]
    1745                      .dwattr $C$DW$304, DW_AT_accessibility(DW_ACCESS_public)
    1746              $C$DW$305       .dwtag  DW_TAG_member
    1747                      .dwattr $C$DW$305, DW_AT_type(*$C$DW$T$35)
    1748                      .dwattr $C$DW$305, DW_AT_name("numCurrentSensors")
    1749                      .dwattr $C$DW$305, DW_AT_TI_symbol_name("_numCurrentSensors")
    1750                      .dwattr $C$DW$305, DW_AT_data_member_location[DW_OP_plus_uconst 0xb2]
    1751                      .dwattr $C$DW$305, DW_AT_accessibility(DW_ACCESS_public)
    1752              $C$DW$306       .dwtag  DW_TAG_member
    1753                      .dwattr $C$DW$306, DW_AT_type(*$C$DW$T$35)
    1754                      .dwattr $C$DW$306, DW_AT_name("numVoltageSensors")
    1755                      .dwattr $C$DW$306, DW_AT_TI_symbol_name("_numVoltageSensors")
    1756                      .dwattr $C$DW$306, DW_AT_data_member_location[DW_OP_plus_uconst 0xb3]
    1757                      .dwattr $C$DW$306, DW_AT_accessibility(DW_ACCESS_public)
    1758              $C$DW$307       .dwtag  DW_TAG_member
    1759                      .dwattr $C$DW$307, DW_AT_type(*$C$DW$T$91)
    1760                      .dwattr $C$DW$307, DW_AT_name("boardAddress")
    1761                      .dwattr $C$DW$307, DW_AT_TI_symbol_name("_boardAddress")
    1762                      .dwattr $C$DW$307, DW_AT_data_member_location[DW_OP_plus_uconst 0xb4]
    1763                      .dwattr $C$DW$307, DW_AT_accessibility(DW_ACCESS_public)
    1764                      .dwendtag $C$DW$T$92
    1765              
    1766              $C$DW$T$156     .dwtag  DW_TAG_pointer_type
    1767                      .dwattr $C$DW$T$156, DW_AT_type(*$C$DW$T$92)
    1768                      .dwattr $C$DW$T$156, DW_AT_address_class(0x16)
    1769              $C$DW$T$157     .dwtag  DW_TAG_typedef, DW_AT_name("HAL_Handle")
    1770                      .dwattr $C$DW$T$157, DW_AT_type(*$C$DW$T$156)
    1771                      .dwattr $C$DW$T$157, DW_AT_language(DW_LANG_C)
    1772              $C$DW$308       .dwtag  DW_TAG_TI_far_type
    1773                      .dwattr $C$DW$308, DW_AT_type(*$C$DW$T$157)
    1774              $C$DW$T$187     .dwtag  DW_TAG_const_type
    1775                      .dwattr $C$DW$T$187, DW_AT_type(*$C$DW$308)
    1776              
    1777              $C$DW$T$93      .dwtag  DW_TAG_structure_type
    1778                      .dwattr $C$DW$T$93, DW_AT_name("_LDC1612_CONFIG_t_")
    1779                      .dwattr $C$DW$T$93, DW_AT_byte_size(0x09)
    1780              $C$DW$309       .dwtag  DW_TAG_member
    1781                      .dwattr $C$DW$309, DW_AT_type(*$C$DW$T$43)
    1782                      .dwattr $C$DW$309, DW_AT_name("ACTIVE_CHAN_0")
    1783                      .dwattr $C$DW$309, DW_AT_TI_symbol_name("_ACTIVE_CHAN_0")
    1784                      .dwattr $C$DW$309, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    1785                      .dwattr $C$DW$309, DW_AT_accessibility(DW_ACCESS_public)
    1786              $C$DW$310       .dwtag  DW_TAG_member
    1787                      .dwattr $C$DW$310, DW_AT_type(*$C$DW$T$43)
    1788                      .dwattr $C$DW$310, DW_AT_name("ACTIVE_CHAN_1")
TMS320C2000 Assembler PC v6.2.5 Sat Sep 16 15:51:24 2017

Tools Copyright (c) 1996-2014 Texas Instruments Incorporated
C:\Users\wmj\AppData\Local\Temp\1274411                              PAGE   34

    1789                      .dwattr $C$DW$310, DW_AT_TI_symbol_name("_ACTIVE_CHAN_1")
    1790                      .dwattr $C$DW$310, DW_AT_data_member_location[DW_OP_plus_uconst 0x1]
    1791                      .dwattr $C$DW$310, DW_AT_accessibility(DW_ACCESS_public)
    1792              $C$DW$311       .dwtag  DW_TAG_member
    1793                      .dwattr $C$DW$311, DW_AT_type(*$C$DW$T$43)
    1794                      .dwattr $C$DW$311, DW_AT_name("SLEEP_MODE_EN")
    1795                      .dwattr $C$DW$311, DW_AT_TI_symbol_name("_SLEEP_MODE_EN")
    1796                      .dwattr $C$DW$311, DW_AT_data_member_location[DW_OP_plus_uconst 0x2]
    1797                      .dwattr $C$DW$311, DW_AT_accessibility(DW_ACCESS_public)
    1798              $C$DW$312       .dwtag  DW_TAG_member
    1799                      .dwattr $C$DW$312, DW_AT_type(*$C$DW$T$43)
    1800                      .dwattr $C$DW$312, DW_AT_name("RP_OVERRIDE_EN")
    1801                      .dwattr $C$DW$312, DW_AT_TI_symbol_name("_RP_OVERRIDE_EN")
    1802                      .dwattr $C$DW$312, DW_AT_data_member_location[DW_OP_plus_uconst 0x3]
    1803                      .dwattr $C$DW$312, DW_AT_accessibility(DW_ACCESS_public)
    1804              $C$DW$313       .dwtag  DW_TAG_member
    1805                      .dwattr $C$DW$313, DW_AT_type(*$C$DW$T$43)
    1806                      .dwattr $C$DW$313, DW_AT_name("SENSOR_ACTV_SEL")
    1807                      .dwattr $C$DW$313, DW_AT_TI_symbol_name("_SENSOR_ACTV_SEL")
    1808                      .dwattr $C$DW$313, DW_AT_data_member_location[DW_OP_plus_uconst 0x4]
    1809                      .dwattr $C$DW$313, DW_AT_accessibility(DW_ACCESS_public)
    1810              $C$DW$314       .dwtag  DW_TAG_member
    1811                      .dwattr $C$DW$314, DW_AT_type(*$C$DW$T$43)
    1812                      .dwattr $C$DW$314, DW_AT_name("AUTO_AMP_DIS")
    1813                      .dwattr $C$DW$314, DW_AT_TI_symbol_name("_AUTO_AMP_DIS")
    1814                      .dwattr $C$DW$314, DW_AT_data_member_location[DW_OP_plus_uconst 0x5]
    1815                      .dwattr $C$DW$314, DW_AT_accessibility(DW_ACCESS_public)
    1816              $C$DW$315       .dwtag  DW_TAG_member
    1817                      .dwattr $C$DW$315, DW_AT_type(*$C$DW$T$43)
    1818                      .dwattr $C$DW$315, DW_AT_name("REF_CLK_SRC")
    1819                      .dwattr $C$DW$315, DW_AT_TI_symbol_name("_REF_CLK_SRC")
    1820                      .dwattr $C$DW$315, DW_AT_data_member_location[DW_OP_plus_uconst 0x6]
    1821                      .dwattr $C$DW$315, DW_AT_accessibility(DW_ACCESS_public)
    1822              $C$DW$316       .dwtag  DW_TAG_member
    1823                      .dwattr $C$DW$316, DW_AT_type(*$C$DW$T$43)
    1824                      .dwattr $C$DW$316, DW_AT_name("INTB_DIS")
    1825                      .dwattr $C$DW$316, DW_AT_TI_symbol_name("_INTB_DIS")
    1826                      .dwattr $C$DW$316, DW_AT_data_member_location[DW_OP_plus_uconst 0x7]
    1827                      .dwattr $C$DW$316, DW_AT_accessibility(DW_ACCESS_public)
    1828              $C$DW$317       .dwtag  DW_TAG_member
    1829                      .dwattr $C$DW$317, DW_AT_type(*$C$DW$T$43)
    1830                      .dwattr $C$DW$317, DW_AT_name("HIGH_CURRENT_DRV")
    1831                      .dwattr $C$DW$317, DW_AT_TI_symbol_name("_HIGH_CURRENT_DRV")
    1832                      .dwattr $C$DW$317, DW_AT_data_member_location[DW_OP_plus_uconst 0x8]
    1833                      .dwattr $C$DW$317, DW_AT_accessibility(DW_ACCESS_public)
    1834                      .dwendtag $C$DW$T$93
    1835              
    1836              $C$DW$T$112     .dwtag  DW_TAG_typedef, DW_AT_name("LDC1612_CONFIG_t_")
    1837                      .dwattr $C$DW$T$112, DW_AT_type(*$C$DW$T$93)
    1838                      .dwattr $C$DW$T$112, DW_AT_language(DW_LANG_C)
    1839              
    1840              $C$DW$T$95      .dwtag  DW_TAG_structure_type
    1841                      .dwattr $C$DW$T$95, DW_AT_name("_LDC161x_CLK_DIVS_t_")
    1842                      .dwattr $C$DW$T$95, DW_AT_byte_size(0x02)
    1843              $C$DW$318       .dwtag  DW_TAG_member
TMS320C2000 Assembler PC v6.2.5 Sat Sep 16 15:51:24 2017

Tools Copyright (c) 1996-2014 Texas Instruments Incorporated
C:\Users\wmj\AppData\Local\Temp\1274411                              PAGE   35

    1844                      .dwattr $C$DW$318, DW_AT_type(*$C$DW$T$94)
    1845                      .dwattr $C$DW$318, DW_AT_name("CLK_DIVS_CH0")
    1846                      .dwattr $C$DW$318, DW_AT_TI_symbol_name("_CLK_DIVS_CH0")
    1847                      .dwattr $C$DW$318, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    1848                      .dwattr $C$DW$318, DW_AT_accessibility(DW_ACCESS_public)
    1849                      .dwendtag $C$DW$T$95
    1850              
    1851              $C$DW$T$109     .dwtag  DW_TAG_typedef, DW_AT_name("LDC161x_CLK_DIVS_t_")
    1852                      .dwattr $C$DW$T$109, DW_AT_type(*$C$DW$T$95)
    1853                      .dwattr $C$DW$T$109, DW_AT_language(DW_LANG_C)
    1854              
    1855              $C$DW$T$96      .dwtag  DW_TAG_structure_type
    1856                      .dwattr $C$DW$T$96, DW_AT_name("_LDC161x_ERROR_CONFIG_t_")
    1857                      .dwattr $C$DW$T$96, DW_AT_byte_size(0x0c)
    1858              $C$DW$319       .dwtag  DW_TAG_member
    1859                      .dwattr $C$DW$319, DW_AT_type(*$C$DW$T$43)
    1860                      .dwattr $C$DW$319, DW_AT_name("UR_ERR2OUT")
    1861                      .dwattr $C$DW$319, DW_AT_TI_symbol_name("_UR_ERR2OUT")
    1862                      .dwattr $C$DW$319, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    1863                      .dwattr $C$DW$319, DW_AT_accessibility(DW_ACCESS_public)
    1864              $C$DW$320       .dwtag  DW_TAG_member
    1865                      .dwattr $C$DW$320, DW_AT_type(*$C$DW$T$43)
    1866                      .dwattr $C$DW$320, DW_AT_name("OR_ERR2OUT")
    1867                      .dwattr $C$DW$320, DW_AT_TI_symbol_name("_OR_ERR2OUT")
    1868                      .dwattr $C$DW$320, DW_AT_data_member_location[DW_OP_plus_uconst 0x1]
    1869                      .dwattr $C$DW$320, DW_AT_accessibility(DW_ACCESS_public)
    1870              $C$DW$321       .dwtag  DW_TAG_member
    1871                      .dwattr $C$DW$321, DW_AT_type(*$C$DW$T$43)
    1872                      .dwattr $C$DW$321, DW_AT_name("WD_ERR2OUT")
    1873                      .dwattr $C$DW$321, DW_AT_TI_symbol_name("_WD_ERR2OUT")
    1874                      .dwattr $C$DW$321, DW_AT_data_member_location[DW_OP_plus_uconst 0x2]
    1875                      .dwattr $C$DW$321, DW_AT_accessibility(DW_ACCESS_public)
    1876              $C$DW$322       .dwtag  DW_TAG_member
    1877                      .dwattr $C$DW$322, DW_AT_type(*$C$DW$T$43)
    1878                      .dwattr $C$DW$322, DW_AT_name("AH_ERR2OUT")
    1879                      .dwattr $C$DW$322, DW_AT_TI_symbol_name("_AH_ERR2OUT")
    1880                      .dwattr $C$DW$322, DW_AT_data_member_location[DW_OP_plus_uconst 0x3]
    1881                      .dwattr $C$DW$322, DW_AT_accessibility(DW_ACCESS_public)
    1882              $C$DW$323       .dwtag  DW_TAG_member
    1883                      .dwattr $C$DW$323, DW_AT_type(*$C$DW$T$43)
    1884                      .dwattr $C$DW$323, DW_AT_name("AL_ERR2OUT")
    1885                      .dwattr $C$DW$323, DW_AT_TI_symbol_name("_AL_ERR2OUT")
    1886                      .dwattr $C$DW$323, DW_AT_data_member_location[DW_OP_plus_uconst 0x4]
    1887                      .dwattr $C$DW$323, DW_AT_accessibility(DW_ACCESS_public)
    1888              $C$DW$324       .dwtag  DW_TAG_member
    1889                      .dwattr $C$DW$324, DW_AT_type(*$C$DW$T$43)
    1890                      .dwattr $C$DW$324, DW_AT_name("UR_ERR2INT")
    1891                      .dwattr $C$DW$324, DW_AT_TI_symbol_name("_UR_ERR2INT")
    1892                      .dwattr $C$DW$324, DW_AT_data_member_location[DW_OP_plus_uconst 0x5]
    1893                      .dwattr $C$DW$324, DW_AT_accessibility(DW_ACCESS_public)
    1894              $C$DW$325       .dwtag  DW_TAG_member
    1895                      .dwattr $C$DW$325, DW_AT_type(*$C$DW$T$43)
    1896                      .dwattr $C$DW$325, DW_AT_name("OR_ERR2INT")
    1897                      .dwattr $C$DW$325, DW_AT_TI_symbol_name("_OR_ERR2INT")
    1898                      .dwattr $C$DW$325, DW_AT_data_member_location[DW_OP_plus_uconst 0x6]
TMS320C2000 Assembler PC v6.2.5 Sat Sep 16 15:51:24 2017

Tools Copyright (c) 1996-2014 Texas Instruments Incorporated
C:\Users\wmj\AppData\Local\Temp\1274411                              PAGE   36

    1899                      .dwattr $C$DW$325, DW_AT_accessibility(DW_ACCESS_public)
    1900              $C$DW$326       .dwtag  DW_TAG_member
    1901                      .dwattr $C$DW$326, DW_AT_type(*$C$DW$T$43)
    1902                      .dwattr $C$DW$326, DW_AT_name("WD_ERR2INT")
    1903                      .dwattr $C$DW$326, DW_AT_TI_symbol_name("_WD_ERR2INT")
    1904                      .dwattr $C$DW$326, DW_AT_data_member_location[DW_OP_plus_uconst 0x7]
    1905                      .dwattr $C$DW$326, DW_AT_accessibility(DW_ACCESS_public)
    1906              $C$DW$327       .dwtag  DW_TAG_member
    1907                      .dwattr $C$DW$327, DW_AT_type(*$C$DW$T$43)
    1908                      .dwattr $C$DW$327, DW_AT_name("AH_ERR2INT")
    1909                      .dwattr $C$DW$327, DW_AT_TI_symbol_name("_AH_ERR2INT")
    1910                      .dwattr $C$DW$327, DW_AT_data_member_location[DW_OP_plus_uconst 0x8]
    1911                      .dwattr $C$DW$327, DW_AT_accessibility(DW_ACCESS_public)
    1912              $C$DW$328       .dwtag  DW_TAG_member
    1913                      .dwattr $C$DW$328, DW_AT_type(*$C$DW$T$43)
    1914                      .dwattr $C$DW$328, DW_AT_name("AL_ERR2INT")
    1915                      .dwattr $C$DW$328, DW_AT_TI_symbol_name("_AL_ERR2INT")
    1916                      .dwattr $C$DW$328, DW_AT_data_member_location[DW_OP_plus_uconst 0x9]
    1917                      .dwattr $C$DW$328, DW_AT_accessibility(DW_ACCESS_public)
    1918              $C$DW$329       .dwtag  DW_TAG_member
    1919                      .dwattr $C$DW$329, DW_AT_type(*$C$DW$T$43)
    1920                      .dwattr $C$DW$329, DW_AT_name("ZC_ERR2INT")
    1921                      .dwattr $C$DW$329, DW_AT_TI_symbol_name("_ZC_ERR2INT")
    1922                      .dwattr $C$DW$329, DW_AT_data_member_location[DW_OP_plus_uconst 0xa]
    1923                      .dwattr $C$DW$329, DW_AT_accessibility(DW_ACCESS_public)
    1924              $C$DW$330       .dwtag  DW_TAG_member
    1925                      .dwattr $C$DW$330, DW_AT_type(*$C$DW$T$43)
    1926                      .dwattr $C$DW$330, DW_AT_name("DRDY_2INT")
    1927                      .dwattr $C$DW$330, DW_AT_TI_symbol_name("_DRDY_2INT")
    1928                      .dwattr $C$DW$330, DW_AT_data_member_location[DW_OP_plus_uconst 0xb]
    1929                      .dwattr $C$DW$330, DW_AT_accessibility(DW_ACCESS_public)
    1930                      .dwendtag $C$DW$T$96
    1931              
    1932              $C$DW$T$111     .dwtag  DW_TAG_typedef, DW_AT_name("LDC161x_ERROR_CONFIG_t_")
    1933                      .dwattr $C$DW$T$111, DW_AT_type(*$C$DW$T$96)
    1934                      .dwattr $C$DW$T$111, DW_AT_language(DW_LANG_C)
    1935              
    1936              $C$DW$T$97      .dwtag  DW_TAG_structure_type
    1937                      .dwattr $C$DW$T$97, DW_AT_name("_LDC161x_Kalman_t_")
    1938                      .dwattr $C$DW$T$97, DW_AT_byte_size(0x0a)
    1939              $C$DW$331       .dwtag  DW_TAG_member
    1940                      .dwattr $C$DW$331, DW_AT_type(*$C$DW$T$49)
    1941                      .dwattr $C$DW$331, DW_AT_name("x_Last")
    1942                      .dwattr $C$DW$331, DW_AT_TI_symbol_name("_x_Last")
    1943                      .dwattr $C$DW$331, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    1944                      .dwattr $C$DW$331, DW_AT_accessibility(DW_ACCESS_public)
    1945              $C$DW$332       .dwtag  DW_TAG_member
    1946                      .dwattr $C$DW$332, DW_AT_type(*$C$DW$T$49)
    1947                      .dwattr $C$DW$332, DW_AT_name("p_Last")
    1948                      .dwattr $C$DW$332, DW_AT_TI_symbol_name("_p_Last")
    1949                      .dwattr $C$DW$332, DW_AT_data_member_location[DW_OP_plus_uconst 0x2]
    1950                      .dwattr $C$DW$332, DW_AT_accessibility(DW_ACCESS_public)
    1951              $C$DW$333       .dwtag  DW_TAG_member
    1952                      .dwattr $C$DW$333, DW_AT_type(*$C$DW$T$49)
    1953                      .dwattr $C$DW$333, DW_AT_name("data_Last")
TMS320C2000 Assembler PC v6.2.5 Sat Sep 16 15:51:24 2017

Tools Copyright (c) 1996-2014 Texas Instruments Incorporated
C:\Users\wmj\AppData\Local\Temp\1274411                              PAGE   37

    1954                      .dwattr $C$DW$333, DW_AT_TI_symbol_name("_data_Last")
    1955                      .dwattr $C$DW$333, DW_AT_data_member_location[DW_OP_plus_uconst 0x4]
    1956                      .dwattr $C$DW$333, DW_AT_accessibility(DW_ACCESS_public)
    1957              $C$DW$334       .dwtag  DW_TAG_member
    1958                      .dwattr $C$DW$334, DW_AT_type(*$C$DW$T$49)
    1959                      .dwattr $C$DW$334, DW_AT_name("Ldc_Kalman_R")
    1960                      .dwattr $C$DW$334, DW_AT_TI_symbol_name("_Ldc_Kalman_R")
    1961                      .dwattr $C$DW$334, DW_AT_data_member_location[DW_OP_plus_uconst 0x6]
    1962                      .dwattr $C$DW$334, DW_AT_accessibility(DW_ACCESS_public)
    1963              $C$DW$335       .dwtag  DW_TAG_member
    1964                      .dwattr $C$DW$335, DW_AT_type(*$C$DW$T$49)
    1965                      .dwattr $C$DW$335, DW_AT_name("Ldc_Kalman_Q")
    1966                      .dwattr $C$DW$335, DW_AT_TI_symbol_name("_Ldc_Kalman_Q")
    1967                      .dwattr $C$DW$335, DW_AT_data_member_location[DW_OP_plus_uconst 0x8]
    1968                      .dwattr $C$DW$335, DW_AT_accessibility(DW_ACCESS_public)
    1969                      .dwendtag $C$DW$T$97
    1970              
    1971              $C$DW$T$115     .dwtag  DW_TAG_typedef, DW_AT_name("LDC161x_Kalman_t_")
    1972                      .dwattr $C$DW$T$115, DW_AT_type(*$C$DW$T$97)
    1973                      .dwattr $C$DW$T$115, DW_AT_language(DW_LANG_C)
    1974              
    1975              $C$DW$T$98      .dwtag  DW_TAG_structure_type
    1976                      .dwattr $C$DW$T$98, DW_AT_name("_LDC161x_MUX_CONFIG_t_")
    1977                      .dwattr $C$DW$T$98, DW_AT_byte_size(0x06)
    1978              $C$DW$336       .dwtag  DW_TAG_member
    1979                      .dwattr $C$DW$336, DW_AT_type(*$C$DW$T$43)
    1980                      .dwattr $C$DW$336, DW_AT_name("AUTOSCAN_EN")
    1981                      .dwattr $C$DW$336, DW_AT_TI_symbol_name("_AUTOSCAN_EN")
    1982                      .dwattr $C$DW$336, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    1983                      .dwattr $C$DW$336, DW_AT_accessibility(DW_ACCESS_public)
