TMS320C2000 Assembler PC v6.2.5 Sun Oct 08 22:38:21 2017

Tools Copyright (c) 1996-2014 Texas Instruments Incorporated
C:\Users\wmj\AppData\Local\Temp\0856412                              PAGE    1

       1              ;***************************************************************
       2              ;* TMS320C2000 C/C++ Codegen                         PC v6.2.5 *
       3              ;* Date/Time created: Sun Oct 08 22:38:20 2017                 *
       4              ;***************************************************************
       5                      .compiler_opts --float_support=softlib --hll_source=on --mem_model:code=flat --mem_model:data=large -
       6        0002  FP      .set    XAR2
       7              
       8              $C$DW$CU        .dwtag  DW_TAG_compile_unit
       9                      .dwattr $C$DW$CU, DW_AT_name("D:/BM1000/sw/drivers/drvic/process_ctrl.c")
      10                      .dwattr $C$DW$CU, DW_AT_producer("TMS320C2000 C/C++ Codegen PC v6.2.5 Copyright (c) 1996-2014 Texas I
      11                      .dwattr $C$DW$CU, DW_AT_TI_version(0x01)
      12                      .dwattr $C$DW$CU, DW_AT_comp_dir("D:\BM1000\sw\solutions\instaspin_foc\boards\hvkit_rev1p1\f28x\f2802
      13              ;**************************************************************
      14              ;* CINIT RECORDS                                              *

    5892              $C$DW$665       .dwtag  DW_TAG_enumerator, DW_AT_name("USER_ErrorCode_ctrlFreq_Hz_Low"), DW_AT_const_value(0x
    5893              $C$DW$666       .dwtag  DW_TAG_enumerator, DW_AT_name("USER_ErrorCode_estFreq_Hz_High"), DW_AT_const_value(0x
    5894              $C$DW$667       .dwtag  DW_TAG_enumerator, DW_AT_name("USER_ErrorCode_estFreq_Hz_Low"), DW_AT_const_value(0x6
    5895              $C$DW$668       .dwtag  DW_TAG_enumerator, DW_AT_name("USER_ErrorCode_RoverL_estFreq_Hz_High"), DW_AT_const_v
    5896              $C$DW$669       .dwtag  DW_TAG_enumerator, DW_AT_name("USER_ErrorCode_RoverL_estFreq_Hz_Low"), DW_AT_const_va
    5897              $C$DW$670       .dwtag  DW_TAG_enumerator, DW_AT_name("USER_ErrorCode_trajFreq_Hz_High"), DW_AT_const_value(0
    5898              $C$DW$671       .dwtag  DW_TAG_enumerator, DW_AT_name("USER_ErrorCode_trajFreq_Hz_Low"), DW_AT_const_value(0x
    5899              $C$DW$672       .dwtag  DW_TAG_enumerator, DW_AT_name("USER_ErrorCode_ctrlPeriod_sec_High"), DW_AT_const_valu
    5900              $C$DW$673       .dwtag  DW_TAG_enumerator, DW_AT_name("USER_ErrorCode_ctrlPeriod_sec_Low"), DW_AT_const_value
    5901              $C$DW$674       .dwtag  DW_TAG_enumerator, DW_AT_name("USER_ErrorCode_maxNegativeIdCurrent_a_High"), DW_AT_co
TMS320C2000 Assembler PC v6.2.5 Sun Oct 08 22:38:21 2017

Tools Copyright (c) 1996-2014 Texas Instruments Incorporated
C:\Users\wmj\AppData\Local\Temp\0856412                              PAGE  114

    5902              $C$DW$675       .dwtag  DW_TAG_enumerator, DW_AT_name("USER_ErrorCode_maxNegativeIdCurrent_a_Low"), DW_AT_con
    5903              $C$DW$676       .dwtag  DW_TAG_enumerator, DW_AT_name("USER_numErrorCodes"), DW_AT_const_value(0x6a)
    5904                      .dwendtag $C$DW$T$154
    5905              
    5906              $C$DW$T$155     .dwtag  DW_TAG_typedef, DW_AT_name("USER_ErrorCode_e")
    5907                      .dwattr $C$DW$T$155, DW_AT_type(*$C$DW$T$154)
    5908                      .dwattr $C$DW$T$155, DW_AT_language(DW_LANG_C)
    5909              
    5910              $C$DW$T$209     .dwtag  DW_TAG_enumeration_type
    5911                      .dwattr $C$DW$T$209, DW_AT_byte_size(0x01)
    5912              $C$DW$677       .dwtag  DW_TAG_enumerator, DW_AT_name("PCA955x_PortNum_Port0"), DW_AT_const_value(0x00)
    5913              $C$DW$678       .dwtag  DW_TAG_enumerator, DW_AT_name("PCA955x_PortNum_Port1"), DW_AT_const_value(0x01)
    5914                      .dwendtag $C$DW$T$209
    5915              
    5916              $C$DW$T$210     .dwtag  DW_TAG_typedef, DW_AT_name("PCA955x_PortNum_e")
    5917                      .dwattr $C$DW$T$210, DW_AT_type(*$C$DW$T$209)
    5918                      .dwattr $C$DW$T$210, DW_AT_language(DW_LANG_C)
    5919              
    5920              $C$DW$T$211     .dwtag  DW_TAG_enumeration_type
    5921                      .dwattr $C$DW$T$211, DW_AT_byte_size(0x01)
    5922              $C$DW$679       .dwtag  DW_TAG_enumerator, DW_AT_name("CTRL_Type_PID_spd"), DW_AT_const_value(0x00)
    5923              $C$DW$680       .dwtag  DW_TAG_enumerator, DW_AT_name("CTRL_Type_PID_Id"), DW_AT_const_value(0x01)
    5924              $C$DW$681       .dwtag  DW_TAG_enumerator, DW_AT_name("CTRL_Type_PID_Iq"), DW_AT_const_value(0x02)
    5925                      .dwendtag $C$DW$T$211
    5926              
    5927              $C$DW$T$212     .dwtag  DW_TAG_typedef, DW_AT_name("CTRL_Type_e")
    5928                      .dwattr $C$DW$T$212, DW_AT_type(*$C$DW$T$211)
    5929                      .dwattr $C$DW$T$212, DW_AT_language(DW_LANG_C)
    5930              
    5931              $C$DW$T$214     .dwtag  DW_TAG_enumeration_type
    5932                      .dwattr $C$DW$T$214, DW_AT_byte_size(0x01)
    5933              $C$DW$682       .dwtag  DW_TAG_enumerator, DW_AT_name("HAL_SensorType_Current"), DW_AT_const_value(0x00)
    5934              $C$DW$683       .dwtag  DW_TAG_enumerator, DW_AT_name("HAL_SensorType_Voltage"), DW_AT_const_value(0x01)
    5935                      .dwendtag $C$DW$T$214
    5936              
    5937              $C$DW$T$215     .dwtag  DW_TAG_typedef, DW_AT_name("HAL_SensorType_e")
    5938                      .dwattr $C$DW$T$215, DW_AT_type(*$C$DW$T$214)
    5939                      .dwattr $C$DW$T$215, DW_AT_language(DW_LANG_C)
    5940              
    5941              $C$DW$T$19      .dwtag  DW_TAG_structure_type
    5942                      .dwattr $C$DW$T$19, DW_AT_name("I2C_Obj")
    5943                      .dwattr $C$DW$T$19, DW_AT_declaration
    5944                      .dwendtag $C$DW$T$19
    5945              
    5946              $C$DW$T$131     .dwtag  DW_TAG_pointer_type
    5947                      .dwattr $C$DW$T$131, DW_AT_type(*$C$DW$T$19)
    5948                      .dwattr $C$DW$T$131, DW_AT_address_class(0x16)
    5949              $C$DW$T$132     .dwtag  DW_TAG_typedef, DW_AT_name("I2C_Handle")
    5950                      .dwattr $C$DW$T$132, DW_AT_type(*$C$DW$T$131)
    5951                      .dwattr $C$DW$T$132, DW_AT_language(DW_LANG_C)
    5952              
    5953              $C$DW$T$31      .dwtag  DW_TAG_structure_type
    5954                      .dwattr $C$DW$T$31, DW_AT_name("_ADC_Obj_")
    5955                      .dwattr $C$DW$T$31, DW_AT_byte_size(0x6650)
    5956              $C$DW$684       .dwtag  DW_TAG_member
TMS320C2000 Assembler PC v6.2.5 Sun Oct 08 22:38:21 2017

Tools Copyright (c) 1996-2014 Texas Instruments Incorporated
C:\Users\wmj\AppData\Local\Temp\0856412                              PAGE  115

    5957                      .dwattr $C$DW$684, DW_AT_type(*$C$DW$T$25)
    5958                      .dwattr $C$DW$684, DW_AT_name("ADCRESULT")
    5959                      .dwattr $C$DW$684, DW_AT_TI_symbol_name("_ADCRESULT")
    5960                      .dwattr $C$DW$684, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    5961                      .dwattr $C$DW$684, DW_AT_accessibility(DW_ACCESS_public)
    5962              $C$DW$685       .dwtag  DW_TAG_member
    5963                      .dwattr $C$DW$685, DW_AT_type(*$C$DW$T$26)
    5964                      .dwattr $C$DW$685, DW_AT_name("resvd_1")
    5965                      .dwattr $C$DW$685, DW_AT_TI_symbol_name("_resvd_1")
    5966                      .dwattr $C$DW$685, DW_AT_data_member_location[DW_OP_plus_uconst 0x10]
    5967                      .dwattr $C$DW$685, DW_AT_accessibility(DW_ACCESS_public)
    5968              $C$DW$686       .dwtag  DW_TAG_member
    5969                      .dwattr $C$DW$686, DW_AT_type(*$C$DW$T$24)
    5970                      .dwattr $C$DW$686, DW_AT_name("ADCCTL1")
    5971                      .dwattr $C$DW$686, DW_AT_TI_symbol_name("_ADCCTL1")
    5972                      .dwattr $C$DW$686, DW_AT_data_member_location[DW_OP_plus_uconst 0x6600]
    5973                      .dwattr $C$DW$686, DW_AT_accessibility(DW_ACCESS_public)
    5974              $C$DW$687       .dwtag  DW_TAG_member
    5975                      .dwattr $C$DW$687, DW_AT_type(*$C$DW$T$24)
    5976                      .dwattr $C$DW$687, DW_AT_name("ADCCTL2")
    5977                      .dwattr $C$DW$687, DW_AT_TI_symbol_name("_ADCCTL2")
    5978                      .dwattr $C$DW$687, DW_AT_data_member_location[DW_OP_plus_uconst 0x6601]
    5979                      .dwattr $C$DW$687, DW_AT_accessibility(DW_ACCESS_public)
    5980              $C$DW$688       .dwtag  DW_TAG_member
    5981                      .dwattr $C$DW$688, DW_AT_type(*$C$DW$T$27)
    5982                      .dwattr $C$DW$688, DW_AT_name("rsvd_2")
    5983                      .dwattr $C$DW$688, DW_AT_TI_symbol_name("_rsvd_2")
    5984                      .dwattr $C$DW$688, DW_AT_data_member_location[DW_OP_plus_uconst 0x6602]
    5985                      .dwattr $C$DW$688, DW_AT_accessibility(DW_ACCESS_public)
    5986              $C$DW$689       .dwtag  DW_TAG_member
    5987                      .dwattr $C$DW$689, DW_AT_type(*$C$DW$T$24)
    5988                      .dwattr $C$DW$689, DW_AT_name("ADCINTFLG")
    5989                      .dwattr $C$DW$689, DW_AT_TI_symbol_name("_ADCINTFLG")
    5990                      .dwattr $C$DW$689, DW_AT_data_member_location[DW_OP_plus_uconst 0x6604]
    5991                      .dwattr $C$DW$689, DW_AT_accessibility(DW_ACCESS_public)
    5992              $C$DW$690       .dwtag  DW_TAG_member
    5993                      .dwattr $C$DW$690, DW_AT_type(*$C$DW$T$24)
    5994                      .dwattr $C$DW$690, DW_AT_name("ADCINTFLGCLR")
    5995                      .dwattr $C$DW$690, DW_AT_TI_symbol_name("_ADCINTFLGCLR")
    5996                      .dwattr $C$DW$690, DW_AT_data_member_location[DW_OP_plus_uconst 0x6605]
    5997                      .dwattr $C$DW$690, DW_AT_accessibility(DW_ACCESS_public)
    5998              $C$DW$691       .dwtag  DW_TAG_member
    5999                      .dwattr $C$DW$691, DW_AT_type(*$C$DW$T$24)
    6000                      .dwattr $C$DW$691, DW_AT_name("ADCINTOVF")
    6001                      .dwattr $C$DW$691, DW_AT_TI_symbol_name("_ADCINTOVF")
    6002                      .dwattr $C$DW$691, DW_AT_data_member_location[DW_OP_plus_uconst 0x6606]
    6003                      .dwattr $C$DW$691, DW_AT_accessibility(DW_ACCESS_public)
    6004              $C$DW$692       .dwtag  DW_TAG_member
    6005                      .dwattr $C$DW$692, DW_AT_type(*$C$DW$T$24)
    6006                      .dwattr $C$DW$692, DW_AT_name("ADCINTOVFCLR")
    6007                      .dwattr $C$DW$692, DW_AT_TI_symbol_name("_ADCINTOVFCLR")
    6008                      .dwattr $C$DW$692, DW_AT_data_member_location[DW_OP_plus_uconst 0x6607]
    6009                      .dwattr $C$DW$692, DW_AT_accessibility(DW_ACCESS_public)
    6010              $C$DW$693       .dwtag  DW_TAG_member
    6011                      .dwattr $C$DW$693, DW_AT_type(*$C$DW$T$28)
TMS320C2000 Assembler PC v6.2.5 Sun Oct 08 22:38:21 2017

Tools Copyright (c) 1996-2014 Texas Instruments Incorporated
C:\Users\wmj\AppData\Local\Temp\0856412                              PAGE  116

    6012                      .dwattr $C$DW$693, DW_AT_name("INTSELxNy")
    6013                      .dwattr $C$DW$693, DW_AT_TI_symbol_name("_INTSELxNy")
    6014                      .dwattr $C$DW$693, DW_AT_data_member_location[DW_OP_plus_uconst 0x6608]
    6015                      .dwattr $C$DW$693, DW_AT_accessibility(DW_ACCESS_public)
    6016              $C$DW$694       .dwtag  DW_TAG_member
    6017                      .dwattr $C$DW$694, DW_AT_type(*$C$DW$T$29)
    6018                      .dwattr $C$DW$694, DW_AT_name("rsvd_3")
    6019                      .dwattr $C$DW$694, DW_AT_TI_symbol_name("_rsvd_3")
    6020                      .dwattr $C$DW$694, DW_AT_data_member_location[DW_OP_plus_uconst 0x660d]
    6021                      .dwattr $C$DW$694, DW_AT_accessibility(DW_ACCESS_public)
    6022              $C$DW$695       .dwtag  DW_TAG_member
    6023                      .dwattr $C$DW$695, DW_AT_type(*$C$DW$T$24)
    6024                      .dwattr $C$DW$695, DW_AT_name("SOCPRICTRL")
    6025                      .dwattr $C$DW$695, DW_AT_TI_symbol_name("_SOCPRICTRL")
    6026                      .dwattr $C$DW$695, DW_AT_data_member_location[DW_OP_plus_uconst 0x6610]
    6027                      .dwattr $C$DW$695, DW_AT_accessibility(DW_ACCESS_public)
    6028              $C$DW$696       .dwtag  DW_TAG_member
    6029                      .dwattr $C$DW$696, DW_AT_type(*$C$DW$T$24)
    6030                      .dwattr $C$DW$696, DW_AT_name("rsvd_4")
    6031                      .dwattr $C$DW$696, DW_AT_TI_symbol_name("_rsvd_4")
    6032                      .dwattr $C$DW$696, DW_AT_data_member_location[DW_OP_plus_uconst 0x6611]
    6033                      .dwattr $C$DW$696, DW_AT_accessibility(DW_ACCESS_public)
    6034              $C$DW$697       .dwtag  DW_TAG_member
    6035                      .dwattr $C$DW$697, DW_AT_type(*$C$DW$T$24)
    6036                      .dwattr $C$DW$697, DW_AT_name("ADCSAMPLEMODE")
    6037                      .dwattr $C$DW$697, DW_AT_TI_symbol_name("_ADCSAMPLEMODE")
    6038                      .dwattr $C$DW$697, DW_AT_data_member_location[DW_OP_plus_uconst 0x6612]
    6039                      .dwattr $C$DW$697, DW_AT_accessibility(DW_ACCESS_public)
    6040              $C$DW$698       .dwtag  DW_TAG_member
    6041                      .dwattr $C$DW$698, DW_AT_type(*$C$DW$T$24)
    6042                      .dwattr $C$DW$698, DW_AT_name("rsvd_5")
    6043                      .dwattr $C$DW$698, DW_AT_TI_symbol_name("_rsvd_5")
    6044                      .dwattr $C$DW$698, DW_AT_data_member_location[DW_OP_plus_uconst 0x6613]
    6045                      .dwattr $C$DW$698, DW_AT_accessibility(DW_ACCESS_public)
    6046              $C$DW$699       .dwtag  DW_TAG_member
    6047                      .dwattr $C$DW$699, DW_AT_type(*$C$DW$T$24)
    6048                      .dwattr $C$DW$699, DW_AT_name("ADCINTSOCSEL1")
    6049                      .dwattr $C$DW$699, DW_AT_TI_symbol_name("_ADCINTSOCSEL1")
    6050                      .dwattr $C$DW$699, DW_AT_data_member_location[DW_OP_plus_uconst 0x6614]
    6051                      .dwattr $C$DW$699, DW_AT_accessibility(DW_ACCESS_public)
    6052              $C$DW$700       .dwtag  DW_TAG_member
    6053                      .dwattr $C$DW$700, DW_AT_type(*$C$DW$T$24)
    6054                      .dwattr $C$DW$700, DW_AT_name("ADCINTSOCSEL2")
    6055                      .dwattr $C$DW$700, DW_AT_TI_symbol_name("_ADCINTSOCSEL2")
    6056                      .dwattr $C$DW$700, DW_AT_data_member_location[DW_OP_plus_uconst 0x6615]
    6057                      .dwattr $C$DW$700, DW_AT_accessibility(DW_ACCESS_public)
    6058              $C$DW$701       .dwtag  DW_TAG_member
    6059                      .dwattr $C$DW$701, DW_AT_type(*$C$DW$T$27)
    6060                      .dwattr $C$DW$701, DW_AT_name("rsvd_6")
    6061                      .dwattr $C$DW$701, DW_AT_TI_symbol_name("_rsvd_6")
    6062                      .dwattr $C$DW$701, DW_AT_data_member_location[DW_OP_plus_uconst 0x6616]
    6063                      .dwattr $C$DW$701, DW_AT_accessibility(DW_ACCESS_public)
    6064              $C$DW$702       .dwtag  DW_TAG_member
    6065                      .dwattr $C$DW$702, DW_AT_type(*$C$DW$T$24)
    6066                      .dwattr $C$DW$702, DW_AT_name("ADCSOCFLG1")
TMS320C2000 Assembler PC v6.2.5 Sun Oct 08 22:38:21 2017

Tools Copyright (c) 1996-2014 Texas Instruments Incorporated
C:\Users\wmj\AppData\Local\Temp\0856412                              PAGE  117

    6067                      .dwattr $C$DW$702, DW_AT_TI_symbol_name("_ADCSOCFLG1")
    6068                      .dwattr $C$DW$702, DW_AT_data_member_location[DW_OP_plus_uconst 0x6618]
    6069                      .dwattr $C$DW$702, DW_AT_accessibility(DW_ACCESS_public)
    6070              $C$DW$703       .dwtag  DW_TAG_member
    6071                      .dwattr $C$DW$703, DW_AT_type(*$C$DW$T$24)
    6072                      .dwattr $C$DW$703, DW_AT_name("rsvd_7")
    6073                      .dwattr $C$DW$703, DW_AT_TI_symbol_name("_rsvd_7")
    6074                      .dwattr $C$DW$703, DW_AT_data_member_location[DW_OP_plus_uconst 0x6619]
    6075                      .dwattr $C$DW$703, DW_AT_accessibility(DW_ACCESS_public)
    6076              $C$DW$704       .dwtag  DW_TAG_member
    6077                      .dwattr $C$DW$704, DW_AT_type(*$C$DW$T$24)
    6078                      .dwattr $C$DW$704, DW_AT_name("ADCSOCFRC1")
    6079                      .dwattr $C$DW$704, DW_AT_TI_symbol_name("_ADCSOCFRC1")
    6080                      .dwattr $C$DW$704, DW_AT_data_member_location[DW_OP_plus_uconst 0x661a]
    6081                      .dwattr $C$DW$704, DW_AT_accessibility(DW_ACCESS_public)
    6082              $C$DW$705       .dwtag  DW_TAG_member
    6083                      .dwattr $C$DW$705, DW_AT_type(*$C$DW$T$24)
    6084                      .dwattr $C$DW$705, DW_AT_name("rsvd_8")
    6085                      .dwattr $C$DW$705, DW_AT_TI_symbol_name("_rsvd_8")
    6086                      .dwattr $C$DW$705, DW_AT_data_member_location[DW_OP_plus_uconst 0x661b]
    6087                      .dwattr $C$DW$705, DW_AT_accessibility(DW_ACCESS_public)
    6088              $C$DW$706       .dwtag  DW_TAG_member
    6089                      .dwattr $C$DW$706, DW_AT_type(*$C$DW$T$24)
    6090                      .dwattr $C$DW$706, DW_AT_name("ADCSOCOVF1")
    6091                      .dwattr $C$DW$706, DW_AT_TI_symbol_name("_ADCSOCOVF1")
    6092                      .dwattr $C$DW$706, DW_AT_data_member_location[DW_OP_plus_uconst 0x661c]
    6093                      .dwattr $C$DW$706, DW_AT_accessibility(DW_ACCESS_public)
    6094              $C$DW$707       .dwtag  DW_TAG_member
    6095                      .dwattr $C$DW$707, DW_AT_type(*$C$DW$T$24)
    6096                      .dwattr $C$DW$707, DW_AT_name("rsvd_9")
    6097                      .dwattr $C$DW$707, DW_AT_TI_symbol_name("_rsvd_9")
    6098                      .dwattr $C$DW$707, DW_AT_data_member_location[DW_OP_plus_uconst 0x661d]
    6099                      .dwattr $C$DW$707, DW_AT_accessibility(DW_ACCESS_public)
    6100              $C$DW$708       .dwtag  DW_TAG_member
    6101                      .dwattr $C$DW$708, DW_AT_type(*$C$DW$T$24)
    6102                      .dwattr $C$DW$708, DW_AT_name("ADCSOCOVFCLR1")
    6103                      .dwattr $C$DW$708, DW_AT_TI_symbol_name("_ADCSOCOVFCLR1")
    6104                      .dwattr $C$DW$708, DW_AT_data_member_location[DW_OP_plus_uconst 0x661e]
    6105                      .dwattr $C$DW$708, DW_AT_accessibility(DW_ACCESS_public)
    6106              $C$DW$709       .dwtag  DW_TAG_member
    6107                      .dwattr $C$DW$709, DW_AT_type(*$C$DW$T$24)
    6108                      .dwattr $C$DW$709, DW_AT_name("rsvd_10")
    6109                      .dwattr $C$DW$709, DW_AT_TI_symbol_name("_rsvd_10")
    6110                      .dwattr $C$DW$709, DW_AT_data_member_location[DW_OP_plus_uconst 0x661f]
    6111                      .dwattr $C$DW$709, DW_AT_accessibility(DW_ACCESS_public)
    6112              $C$DW$710       .dwtag  DW_TAG_member
    6113                      .dwattr $C$DW$710, DW_AT_type(*$C$DW$T$25)
    6114                      .dwattr $C$DW$710, DW_AT_name("ADCSOCxCTL")
    6115                      .dwattr $C$DW$710, DW_AT_TI_symbol_name("_ADCSOCxCTL")
    6116                      .dwattr $C$DW$710, DW_AT_data_member_location[DW_OP_plus_uconst 0x6620]
    6117                      .dwattr $C$DW$710, DW_AT_accessibility(DW_ACCESS_public)
    6118              $C$DW$711       .dwtag  DW_TAG_member
    6119                      .dwattr $C$DW$711, DW_AT_type(*$C$DW$T$25)
    6120                      .dwattr $C$DW$711, DW_AT_name("rsvd_11")
    6121                      .dwattr $C$DW$711, DW_AT_TI_symbol_name("_rsvd_11")
TMS320C2000 Assembler PC v6.2.5 Sun Oct 08 22:38:21 2017

Tools Copyright (c) 1996-2014 Texas Instruments Incorporated
C:\Users\wmj\AppData\Local\Temp\0856412                              PAGE  118

    6122                      .dwattr $C$DW$711, DW_AT_data_member_location[DW_OP_plus_uconst 0x6630]
    6123                      .dwattr $C$DW$711, DW_AT_accessibility(DW_ACCESS_public)
    6124              $C$DW$712       .dwtag  DW_TAG_member
    6125                      .dwattr $C$DW$712, DW_AT_type(*$C$DW$T$24)
    6126                      .dwattr $C$DW$712, DW_AT_name("ADCREFTRIM")
    6127                      .dwattr $C$DW$712, DW_AT_TI_symbol_name("_ADCREFTRIM")
    6128                      .dwattr $C$DW$712, DW_AT_data_member_location[DW_OP_plus_uconst 0x6640]
    6129                      .dwattr $C$DW$712, DW_AT_accessibility(DW_ACCESS_public)
    6130              $C$DW$713       .dwtag  DW_TAG_member
    6131                      .dwattr $C$DW$713, DW_AT_type(*$C$DW$T$24)
    6132                      .dwattr $C$DW$713, DW_AT_name("ADCOFFTRIM")
    6133                      .dwattr $C$DW$713, DW_AT_TI_symbol_name("_ADCOFFTRIM")
    6134                      .dwattr $C$DW$713, DW_AT_data_member_location[DW_OP_plus_uconst 0x6641]
    6135                      .dwattr $C$DW$713, DW_AT_accessibility(DW_ACCESS_public)
    6136              $C$DW$714       .dwtag  DW_TAG_member
    6137                      .dwattr $C$DW$714, DW_AT_type(*$C$DW$T$30)
    6138                      .dwattr $C$DW$714, DW_AT_name("resvd_12")
    6139                      .dwattr $C$DW$714, DW_AT_TI_symbol_name("_resvd_12")
    6140                      .dwattr $C$DW$714, DW_AT_data_member_location[DW_OP_plus_uconst 0x6642]
    6141                      .dwattr $C$DW$714, DW_AT_accessibility(DW_ACCESS_public)
    6142              $C$DW$715       .dwtag  DW_TAG_member
    6143                      .dwattr $C$DW$715, DW_AT_type(*$C$DW$T$24)
    6144                      .dwattr $C$DW$715, DW_AT_name("ADCREV")
    6145                      .dwattr $C$DW$715, DW_AT_TI_symbol_name("_ADCREV")
    6146                      .dwattr $C$DW$715, DW_AT_data_member_location[DW_OP_plus_uconst 0x664f]
    6147                      .dwattr $C$DW$715, DW_AT_accessibility(DW_ACCESS_public)
    6148                      .dwendtag $C$DW$T$31
    6149              
    6150              $C$DW$T$102     .dwtag  DW_TAG_pointer_type
    6151                      .dwattr $C$DW$T$102, DW_AT_type(*$C$DW$T$31)
    6152                      .dwattr $C$DW$T$102, DW_AT_address_class(0x16)
    6153              $C$DW$T$103     .dwtag  DW_TAG_typedef, DW_AT_name("ADC_Handle")
    6154                      .dwattr $C$DW$T$103, DW_AT_type(*$C$DW$T$102)
    6155                      .dwattr $C$DW$T$103, DW_AT_language(DW_LANG_C)
    6156              
    6157              $C$DW$T$35      .dwtag  DW_TAG_structure_type
    6158                      .dwattr $C$DW$T$35, DW_AT_name("_BRAKE_Obj_")
    6159                      .dwattr $C$DW$T$35, DW_AT_byte_size(0x08)
    6160              $C$DW$716       .dwtag  DW_TAG_member
    6161                      .dwattr $C$DW$716, DW_AT_type(*$C$DW$T$32)
    6162                      .dwattr $C$DW$716, DW_AT_name("angle_pu")
    6163                      .dwattr $C$DW$716, DW_AT_TI_symbol_name("_angle_pu")
    6164                      .dwattr $C$DW$716, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    6165                      .dwattr $C$DW$716, DW_AT_accessibility(DW_ACCESS_public)
    6166              $C$DW$717       .dwtag  DW_TAG_member
    6167                      .dwattr $C$DW$717, DW_AT_type(*$C$DW$T$33)
    6168                      .dwattr $C$DW$717, DW_AT_name("Idq_brake")
    6169                      .dwattr $C$DW$717, DW_AT_TI_symbol_name("_Idq_brake")
    6170                      .dwattr $C$DW$717, DW_AT_data_member_location[DW_OP_plus_uconst 0x2]
    6171                      .dwattr $C$DW$717, DW_AT_accessibility(DW_ACCESS_public)
    6172              $C$DW$718       .dwtag  DW_TAG_member
    6173                      .dwattr $C$DW$718, DW_AT_type(*$C$DW$T$34)
    6174                      .dwattr $C$DW$718, DW_AT_name("brake_enable")
    6175                      .dwattr $C$DW$718, DW_AT_TI_symbol_name("_brake_enable")
    6176                      .dwattr $C$DW$718, DW_AT_data_member_location[DW_OP_plus_uconst 0x6]
TMS320C2000 Assembler PC v6.2.5 Sun Oct 08 22:38:21 2017

Tools Copyright (c) 1996-2014 Texas Instruments Incorporated
C:\Users\wmj\AppData\Local\Temp\0856412                              PAGE  119

    6177                      .dwattr $C$DW$718, DW_AT_accessibility(DW_ACCESS_public)
    6178                      .dwendtag $C$DW$T$35
    6179              
    6180              $C$DW$T$74      .dwtag  DW_TAG_typedef, DW_AT_name("BRAKE_Obj")
    6181                      .dwattr $C$DW$T$74, DW_AT_type(*$C$DW$T$35)
    6182                      .dwattr $C$DW$T$74, DW_AT_language(DW_LANG_C)
    6183              $C$DW$T$72      .dwtag  DW_TAG_pointer_type
    6184                      .dwattr $C$DW$T$72, DW_AT_type(*$C$DW$T$35)
    6185                      .dwattr $C$DW$T$72, DW_AT_address_class(0x16)
    6186              $C$DW$T$73      .dwtag  DW_TAG_typedef, DW_AT_name("BRAKE_Handle")
    6187                      .dwattr $C$DW$T$73, DW_AT_type(*$C$DW$T$72)
    6188                      .dwattr $C$DW$T$73, DW_AT_language(DW_LANG_C)
    6189              
    6190              $C$DW$T$37      .dwtag  DW_TAG_structure_type
    6191                      .dwattr $C$DW$T$37, DW_AT_name("_CLARKE_Obj_")
    6192                      .dwattr $C$DW$T$37, DW_AT_byte_size(0x06)
    6193              $C$DW$719       .dwtag  DW_TAG_member
    6194                      .dwattr $C$DW$719, DW_AT_type(*$C$DW$T$32)
    6195                      .dwattr $C$DW$719, DW_AT_name("alpha_sf")
    6196                      .dwattr $C$DW$719, DW_AT_TI_symbol_name("_alpha_sf")
    6197                      .dwattr $C$DW$719, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    6198                      .dwattr $C$DW$719, DW_AT_accessibility(DW_ACCESS_public)
    6199              $C$DW$720       .dwtag  DW_TAG_member
    6200                      .dwattr $C$DW$720, DW_AT_type(*$C$DW$T$32)
    6201                      .dwattr $C$DW$720, DW_AT_name("beta_sf")
    6202                      .dwattr $C$DW$720, DW_AT_TI_symbol_name("_beta_sf")
    6203                      .dwattr $C$DW$720, DW_AT_data_member_location[DW_OP_plus_uconst 0x2]
    6204                      .dwattr $C$DW$720, DW_AT_accessibility(DW_ACCESS_public)
    6205              $C$DW$721       .dwtag  DW_TAG_member
    6206                      .dwattr $C$DW$721, DW_AT_type(*$C$DW$T$36)
    6207                      .dwattr $C$DW$721, DW_AT_name("numSensors")
    6208                      .dwattr $C$DW$721, DW_AT_TI_symbol_name("_numSensors")
    6209                      .dwattr $C$DW$721, DW_AT_data_member_location[DW_OP_plus_uconst 0x4]
    6210                      .dwattr $C$DW$721, DW_AT_accessibility(DW_ACCESS_public)
    6211                      .dwendtag $C$DW$T$37
    6212              
    6213              $C$DW$T$48      .dwtag  DW_TAG_typedef, DW_AT_name("CLARKE_Obj")
    6214                      .dwattr $C$DW$T$48, DW_AT_type(*$C$DW$T$37)
    6215                      .dwattr $C$DW$T$48, DW_AT_language(DW_LANG_C)
    6216              $C$DW$T$46      .dwtag  DW_TAG_pointer_type
    6217                      .dwattr $C$DW$T$46, DW_AT_type(*$C$DW$T$37)
    6218                      .dwattr $C$DW$T$46, DW_AT_address_class(0x16)
    6219              $C$DW$T$47      .dwtag  DW_TAG_typedef, DW_AT_name("CLARKE_Handle")
    6220                      .dwattr $C$DW$T$47, DW_AT_type(*$C$DW$T$46)
    6221                      .dwattr $C$DW$T$47, DW_AT_language(DW_LANG_C)
    6222              
    6223              $C$DW$T$39      .dwtag  DW_TAG_structure_type
    6224                      .dwattr $C$DW$T$39, DW_AT_name("_CLK_Obj_")
    6225                      .dwattr $C$DW$T$39, DW_AT_byte_size(0x11)
    6226              $C$DW$722       .dwtag  DW_TAG_member
    6227                      .dwattr $C$DW$722, DW_AT_type(*$C$DW$T$24)
    6228                      .dwattr $C$DW$722, DW_AT_name("XCLK")
    6229                      .dwattr $C$DW$722, DW_AT_TI_symbol_name("_XCLK")
    6230                      .dwattr $C$DW$722, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    6231                      .dwattr $C$DW$722, DW_AT_accessibility(DW_ACCESS_public)
TMS320C2000 Assembler PC v6.2.5 Sun Oct 08 22:38:21 2017

Tools Copyright (c) 1996-2014 Texas Instruments Incorporated
C:\Users\wmj\AppData\Local\Temp\0856412                              PAGE  120

    6232              $C$DW$723       .dwtag  DW_TAG_member
    6233                      .dwattr $C$DW$723, DW_AT_type(*$C$DW$T$24)
    6234                      .dwattr $C$DW$723, DW_AT_name("rsvd_1")
    6235                      .dwattr $C$DW$723, DW_AT_TI_symbol_name("_rsvd_1")
    6236                      .dwattr $C$DW$723, DW_AT_data_member_location[DW_OP_plus_uconst 0x1]
    6237                      .dwattr $C$DW$723, DW_AT_accessibility(DW_ACCESS_public)
    6238              $C$DW$724       .dwtag  DW_TAG_member
    6239                      .dwattr $C$DW$724, DW_AT_type(*$C$DW$T$24)
    6240                      .dwattr $C$DW$724, DW_AT_name("CLKCTL")
    6241                      .dwattr $C$DW$724, DW_AT_TI_symbol_name("_CLKCTL")
    6242                      .dwattr $C$DW$724, DW_AT_data_member_location[DW_OP_plus_uconst 0x2]
    6243                      .dwattr $C$DW$724, DW_AT_accessibility(DW_ACCESS_public)
    6244              $C$DW$725       .dwtag  DW_TAG_member
    6245                      .dwattr $C$DW$725, DW_AT_type(*$C$DW$T$38)
    6246                      .dwattr $C$DW$725, DW_AT_name("rsvd_2")
    6247                      .dwattr $C$DW$725, DW_AT_TI_symbol_name("_rsvd_2")
    6248                      .dwattr $C$DW$725, DW_AT_data_member_location[DW_OP_plus_uconst 0x3]
    6249                      .dwattr $C$DW$725, DW_AT_accessibility(DW_ACCESS_public)
    6250              $C$DW$726       .dwtag  DW_TAG_member
    6251                      .dwattr $C$DW$726, DW_AT_type(*$C$DW$T$24)
    6252                      .dwattr $C$DW$726, DW_AT_name("LOSPCP")
    6253                      .dwattr $C$DW$726, DW_AT_TI_symbol_name("_LOSPCP")
    6254                      .dwattr $C$DW$726, DW_AT_data_member_location[DW_OP_plus_uconst 0xb]
    6255                      .dwattr $C$DW$726, DW_AT_accessibility(DW_ACCESS_public)
    6256              $C$DW$727       .dwtag  DW_TAG_member
    6257                      .dwattr $C$DW$727, DW_AT_type(*$C$DW$T$24)
    6258                      .dwattr $C$DW$727, DW_AT_name("PCLKCR0")
    6259                      .dwattr $C$DW$727, DW_AT_TI_symbol_name("_PCLKCR0")
    6260                      .dwattr $C$DW$727, DW_AT_data_member_location[DW_OP_plus_uconst 0xc]
    6261                      .dwattr $C$DW$727, DW_AT_accessibility(DW_ACCESS_public)
    6262              $C$DW$728       .dwtag  DW_TAG_member
    6263                      .dwattr $C$DW$728, DW_AT_type(*$C$DW$T$24)
    6264                      .dwattr $C$DW$728, DW_AT_name("PCLKCR1")
    6265                      .dwattr $C$DW$728, DW_AT_TI_symbol_name("_PCLKCR1")
    6266                      .dwattr $C$DW$728, DW_AT_data_member_location[DW_OP_plus_uconst 0xd]
    6267                      .dwattr $C$DW$728, DW_AT_accessibility(DW_ACCESS_public)
    6268              $C$DW$729       .dwtag  DW_TAG_member
    6269                      .dwattr $C$DW$729, DW_AT_type(*$C$DW$T$27)
    6270                      .dwattr $C$DW$729, DW_AT_name("rsvd_3")
    6271                      .dwattr $C$DW$729, DW_AT_TI_symbol_name("_rsvd_3")
    6272                      .dwattr $C$DW$729, DW_AT_data_member_location[DW_OP_plus_uconst 0xe]
    6273                      .dwattr $C$DW$729, DW_AT_accessibility(DW_ACCESS_public)
    6274              $C$DW$730       .dwtag  DW_TAG_member
    6275                      .dwattr $C$DW$730, DW_AT_type(*$C$DW$T$24)
    6276                      .dwattr $C$DW$730, DW_AT_name("PCLKCR3")
    6277                      .dwattr $C$DW$730, DW_AT_TI_symbol_name("_PCLKCR3")
    6278                      .dwattr $C$DW$730, DW_AT_data_member_location[DW_OP_plus_uconst 0x10]
    6279                      .dwattr $C$DW$730, DW_AT_accessibility(DW_ACCESS_public)
    6280                      .dwendtag $C$DW$T$39
    6281              
    6282              $C$DW$T$104     .dwtag  DW_TAG_pointer_type
    6283                      .dwattr $C$DW$T$104, DW_AT_type(*$C$DW$T$39)
    6284                      .dwattr $C$DW$T$104, DW_AT_address_class(0x16)
    6285              $C$DW$T$105     .dwtag  DW_TAG_typedef, DW_AT_name("CLK_Handle")
    6286                      .dwattr $C$DW$T$105, DW_AT_type(*$C$DW$T$104)
TMS320C2000 Assembler PC v6.2.5 Sun Oct 08 22:38:21 2017

Tools Copyright (c) 1996-2014 Texas Instruments Incorporated
C:\Users\wmj\AppData\Local\Temp\0856412                              PAGE  121

    6287                      .dwattr $C$DW$T$105, DW_AT_language(DW_LANG_C)
    6288              
    6289              $C$DW$T$40      .dwtag  DW_TAG_structure_type
    6290                      .dwattr $C$DW$T$40, DW_AT_name("_CPU_Obj_")
    6291                      .dwattr $C$DW$T$40, DW_AT_byte_size(0x01)
    6292              $C$DW$731       .dwtag  DW_TAG_member
    6293                      .dwattr $C$DW$731, DW_AT_type(*$C$DW$T$36)
    6294                      .dwattr $C$DW$731, DW_AT_name("tmp")
    6295                      .dwattr $C$DW$731, DW_AT_TI_symbol_name("_tmp")
    6296                      .dwattr $C$DW$731, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    6297                      .dwattr $C$DW$731, DW_AT_accessibility(DW_ACCESS_public)
    6298                      .dwendtag $C$DW$T$40
    6299              
    6300              $C$DW$T$106     .dwtag  DW_TAG_pointer_type
    6301                      .dwattr $C$DW$T$106, DW_AT_type(*$C$DW$T$40)
    6302                      .dwattr $C$DW$T$106, DW_AT_address_class(0x16)
    6303              $C$DW$T$107     .dwtag  DW_TAG_typedef, DW_AT_name("CPU_Handle")
    6304                      .dwattr $C$DW$T$107, DW_AT_type(*$C$DW$T$106)
    6305                      .dwattr $C$DW$T$107, DW_AT_language(DW_LANG_C)
    6306              
    6307              $C$DW$T$75      .dwtag  DW_TAG_structure_type
    6308                      .dwattr $C$DW$T$75, DW_AT_name("_CTRL_Obj_")
    6309                      .dwattr $C$DW$T$75, DW_AT_byte_size(0x112)
    6310              $C$DW$732       .dwtag  DW_TAG_member
    6311                      .dwattr $C$DW$732, DW_AT_type(*$C$DW$T$41)
    6312                      .dwattr $C$DW$732, DW_AT_name("version")
    6313                      .dwattr $C$DW$732, DW_AT_TI_symbol_name("_version")
    6314                      .dwattr $C$DW$732, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    6315                      .dwattr $C$DW$732, DW_AT_accessibility(DW_ACCESS_public)
    6316              $C$DW$733       .dwtag  DW_TAG_member
    6317                      .dwattr $C$DW$733, DW_AT_type(*$C$DW$T$43)
    6318                      .dwattr $C$DW$733, DW_AT_name("state")
    6319                      .dwattr $C$DW$733, DW_AT_TI_symbol_name("_state")
    6320                      .dwattr $C$DW$733, DW_AT_data_member_location[DW_OP_plus_uconst 0x4]
    6321                      .dwattr $C$DW$733, DW_AT_accessibility(DW_ACCESS_public)
    6322              $C$DW$734       .dwtag  DW_TAG_member
    6323                      .dwattr $C$DW$734, DW_AT_type(*$C$DW$T$43)
    6324                      .dwattr $C$DW$734, DW_AT_name("prevState")
    6325                      .dwattr $C$DW$734, DW_AT_TI_symbol_name("_prevState")
    6326                      .dwattr $C$DW$734, DW_AT_data_member_location[DW_OP_plus_uconst 0x5]
    6327                      .dwattr $C$DW$734, DW_AT_accessibility(DW_ACCESS_public)
    6328              $C$DW$735       .dwtag  DW_TAG_member
    6329                      .dwattr $C$DW$735, DW_AT_type(*$C$DW$T$45)
    6330                      .dwattr $C$DW$735, DW_AT_name("errorCode")
    6331                      .dwattr $C$DW$735, DW_AT_TI_symbol_name("_errorCode")
    6332                      .dwattr $C$DW$735, DW_AT_data_member_location[DW_OP_plus_uconst 0x6]
    6333                      .dwattr $C$DW$735, DW_AT_accessibility(DW_ACCESS_public)
    6334              $C$DW$736       .dwtag  DW_TAG_member
    6335                      .dwattr $C$DW$736, DW_AT_type(*$C$DW$T$47)
    6336                      .dwattr $C$DW$736, DW_AT_name("clarkeHandle_I")
    6337                      .dwattr $C$DW$736, DW_AT_TI_symbol_name("_clarkeHandle_I")
    6338                      .dwattr $C$DW$736, DW_AT_data_member_location[DW_OP_plus_uconst 0x8]
    6339                      .dwattr $C$DW$736, DW_AT_accessibility(DW_ACCESS_public)
    6340              $C$DW$737       .dwtag  DW_TAG_member
    6341                      .dwattr $C$DW$737, DW_AT_type(*$C$DW$T$48)
TMS320C2000 Assembler PC v6.2.5 Sun Oct 08 22:38:21 2017

Tools Copyright (c) 1996-2014 Texas Instruments Incorporated
C:\Users\wmj\AppData\Local\Temp\0856412                              PAGE  122

    6342                      .dwattr $C$DW$737, DW_AT_name("clarke_I")
    6343                      .dwattr $C$DW$737, DW_AT_TI_symbol_name("_clarke_I")
    6344                      .dwattr $C$DW$737, DW_AT_data_member_location[DW_OP_plus_uconst 0xa]
    6345                      .dwattr $C$DW$737, DW_AT_accessibility(DW_ACCESS_public)
    6346              $C$DW$738       .dwtag  DW_TAG_member
    6347                      .dwattr $C$DW$738, DW_AT_type(*$C$DW$T$47)
    6348                      .dwattr $C$DW$738, DW_AT_name("clarkeHandle_V")
    6349                      .dwattr $C$DW$738, DW_AT_TI_symbol_name("_clarkeHandle_V")
    6350                      .dwattr $C$DW$738, DW_AT_data_member_location[DW_OP_plus_uconst 0x10]
    6351                      .dwattr $C$DW$738, DW_AT_accessibility(DW_ACCESS_public)
    6352              $C$DW$739       .dwtag  DW_TAG_member
    6353                      .dwattr $C$DW$739, DW_AT_type(*$C$DW$T$48)
    6354                      .dwattr $C$DW$739, DW_AT_name("clarke_V")
    6355                      .dwattr $C$DW$739, DW_AT_TI_symbol_name("_clarke_V")
    6356                      .dwattr $C$DW$739, DW_AT_data_member_location[DW_OP_plus_uconst 0x12]
    6357                      .dwattr $C$DW$739, DW_AT_accessibility(DW_ACCESS_public)
    6358              $C$DW$740       .dwtag  DW_TAG_member
    6359                      .dwattr $C$DW$740, DW_AT_type(*$C$DW$T$50)
    6360                      .dwattr $C$DW$740, DW_AT_name("estHandle")
    6361                      .dwattr $C$DW$740, DW_AT_TI_symbol_name("_estHandle")
    6362                      .dwattr $C$DW$740, DW_AT_data_member_location[DW_OP_plus_uconst 0x18]
    6363                      .dwattr $C$DW$740, DW_AT_accessibility(DW_ACCESS_public)
    6364              $C$DW$741       .dwtag  DW_TAG_member
    6365                      .dwattr $C$DW$741, DW_AT_type(*$C$DW$T$52)
    6366                      .dwattr $C$DW$741, DW_AT_name("parkHandle")
    6367                      .dwattr $C$DW$741, DW_AT_TI_symbol_name("_parkHandle")
    6368                      .dwattr $C$DW$741, DW_AT_data_member_location[DW_OP_plus_uconst 0x1a]
    6369                      .dwattr $C$DW$741, DW_AT_accessibility(DW_ACCESS_public)
    6370              $C$DW$742       .dwtag  DW_TAG_member
    6371                      .dwattr $C$DW$742, DW_AT_type(*$C$DW$T$53)
    6372                      .dwattr $C$DW$742, DW_AT_name("park")
    6373                      .dwattr $C$DW$742, DW_AT_TI_symbol_name("_park")
    6374                      .dwattr $C$DW$742, DW_AT_data_member_location[DW_OP_plus_uconst 0x1c]
    6375                      .dwattr $C$DW$742, DW_AT_accessibility(DW_ACCESS_public)
    6376              $C$DW$743       .dwtag  DW_TAG_member
    6377                      .dwattr $C$DW$743, DW_AT_type(*$C$DW$T$55)
    6378                      .dwattr $C$DW$743, DW_AT_name("pidHandle_Id")
    6379                      .dwattr $C$DW$743, DW_AT_TI_symbol_name("_pidHandle_Id")
    6380                      .dwattr $C$DW$743, DW_AT_data_member_location[DW_OP_plus_uconst 0x20]
    6381                      .dwattr $C$DW$743, DW_AT_accessibility(DW_ACCESS_public)
    6382              $C$DW$744       .dwtag  DW_TAG_member
    6383                      .dwattr $C$DW$744, DW_AT_type(*$C$DW$T$56)
    6384                      .dwattr $C$DW$744, DW_AT_name("pid_Id")
    6385                      .dwattr $C$DW$744, DW_AT_TI_symbol_name("_pid_Id")
    6386                      .dwattr $C$DW$744, DW_AT_data_member_location[DW_OP_plus_uconst 0x22]
    6387                      .dwattr $C$DW$744, DW_AT_accessibility(DW_ACCESS_public)
    6388              $C$DW$745       .dwtag  DW_TAG_member
    6389                      .dwattr $C$DW$745, DW_AT_type(*$C$DW$T$55)
    6390                      .dwattr $C$DW$745, DW_AT_name("pidHandle_Iq")
    6391                      .dwattr $C$DW$745, DW_AT_TI_symbol_name("_pidHandle_Iq")
    6392                      .dwattr $C$DW$745, DW_AT_data_member_location[DW_OP_plus_uconst 0x32]
    6393                      .dwattr $C$DW$745, DW_AT_accessibility(DW_ACCESS_public)
    6394              $C$DW$746       .dwtag  DW_TAG_member
    6395                      .dwattr $C$DW$746, DW_AT_type(*$C$DW$T$56)
    6396                      .dwattr $C$DW$746, DW_AT_name("pid_Iq")
TMS320C2000 Assembler PC v6.2.5 Sun Oct 08 22:38:21 2017

Tools Copyright (c) 1996-2014 Texas Instruments Incorporated
C:\Users\wmj\AppData\Local\Temp\0856412                              PAGE  123

    6397                      .dwattr $C$DW$746, DW_AT_TI_symbol_name("_pid_Iq")
    6398                      .dwattr $C$DW$746, DW_AT_data_member_location[DW_OP_plus_uconst 0x34]
    6399                      .dwattr $C$DW$746, DW_AT_accessibility(DW_ACCESS_public)
    6400              $C$DW$747       .dwtag  DW_TAG_member
    6401                      .dwattr $C$DW$747, DW_AT_type(*$C$DW$T$55)
    6402                      .dwattr $C$DW$747, DW_AT_name("pidHandle_spd")
    6403                      .dwattr $C$DW$747, DW_AT_TI_symbol_name("_pidHandle_spd")
    6404                      .dwattr $C$DW$747, DW_AT_data_member_location[DW_OP_plus_uconst 0x44]
    6405                      .dwattr $C$DW$747, DW_AT_accessibility(DW_ACCESS_public)
    6406              $C$DW$748       .dwtag  DW_TAG_member
    6407                      .dwattr $C$DW$748, DW_AT_type(*$C$DW$T$56)
    6408                      .dwattr $C$DW$748, DW_AT_name("pid_spd")
    6409                      .dwattr $C$DW$748, DW_AT_TI_symbol_name("_pid_spd")
    6410                      .dwattr $C$DW$748, DW_AT_data_member_location[DW_OP_plus_uconst 0x46]
    6411                      .dwattr $C$DW$748, DW_AT_accessibility(DW_ACCESS_public)
    6412              $C$DW$749       .dwtag  DW_TAG_member
    6413                      .dwattr $C$DW$749, DW_AT_type(*$C$DW$T$58)
    6414                      .dwattr $C$DW$749, DW_AT_name("iparkHandle")
    6415                      .dwattr $C$DW$749, DW_AT_TI_symbol_name("_iparkHandle")
    6416                      .dwattr $C$DW$749, DW_AT_data_member_location[DW_OP_plus_uconst 0x56]
    6417                      .dwattr $C$DW$749, DW_AT_accessibility(DW_ACCESS_public)
    6418              $C$DW$750       .dwtag  DW_TAG_member
    6419                      .dwattr $C$DW$750, DW_AT_type(*$C$DW$T$59)
    6420                      .dwattr $C$DW$750, DW_AT_name("ipark")
    6421                      .dwattr $C$DW$750, DW_AT_TI_symbol_name("_ipark")
    6422                      .dwattr $C$DW$750, DW_AT_data_member_location[DW_OP_plus_uconst 0x58]
    6423                      .dwattr $C$DW$750, DW_AT_accessibility(DW_ACCESS_public)
    6424              $C$DW$751       .dwtag  DW_TAG_member
    6425                      .dwattr $C$DW$751, DW_AT_type(*$C$DW$T$61)
    6426                      .dwattr $C$DW$751, DW_AT_name("svgenHandle")
    6427                      .dwattr $C$DW$751, DW_AT_TI_symbol_name("_svgenHandle")
    6428                      .dwattr $C$DW$751, DW_AT_data_member_location[DW_OP_plus_uconst 0x5c]
    6429                      .dwattr $C$DW$751, DW_AT_accessibility(DW_ACCESS_public)
    6430              $C$DW$752       .dwtag  DW_TAG_member
    6431                      .dwattr $C$DW$752, DW_AT_type(*$C$DW$T$62)
    6432                      .dwattr $C$DW$752, DW_AT_name("svgen")
    6433                      .dwattr $C$DW$752, DW_AT_TI_symbol_name("_svgen")
    6434                      .dwattr $C$DW$752, DW_AT_data_member_location[DW_OP_plus_uconst 0x5e]
    6435                      .dwattr $C$DW$752, DW_AT_accessibility(DW_ACCESS_public)
    6436              $C$DW$753       .dwtag  DW_TAG_member
    6437                      .dwattr $C$DW$753, DW_AT_type(*$C$DW$T$64)
    6438                      .dwattr $C$DW$753, DW_AT_name("trajHandle_Id")
    6439                      .dwattr $C$DW$753, DW_AT_TI_symbol_name("_trajHandle_Id")
    6440                      .dwattr $C$DW$753, DW_AT_data_member_location[DW_OP_plus_uconst 0x60]
    6441                      .dwattr $C$DW$753, DW_AT_accessibility(DW_ACCESS_public)
    6442              $C$DW$754       .dwtag  DW_TAG_member
    6443                      .dwattr $C$DW$754, DW_AT_type(*$C$DW$T$65)
    6444                      .dwattr $C$DW$754, DW_AT_name("traj_Id")
    6445                      .dwattr $C$DW$754, DW_AT_TI_symbol_name("_traj_Id")
    6446                      .dwattr $C$DW$754, DW_AT_data_member_location[DW_OP_plus_uconst 0x62]
    6447                      .dwattr $C$DW$754, DW_AT_accessibility(DW_ACCESS_public)
    6448              $C$DW$755       .dwtag  DW_TAG_member
    6449                      .dwattr $C$DW$755, DW_AT_type(*$C$DW$T$64)
    6450                      .dwattr $C$DW$755, DW_AT_name("trajHandle_spd")
    6451                      .dwattr $C$DW$755, DW_AT_TI_symbol_name("_trajHandle_spd")
TMS320C2000 Assembler PC v6.2.5 Sun Oct 08 22:38:21 2017

Tools Copyright (c) 1996-2014 Texas Instruments Incorporated
C:\Users\wmj\AppData\Local\Temp\0856412                              PAGE  124

    6452                      .dwattr $C$DW$755, DW_AT_data_member_location[DW_OP_plus_uconst 0x6c]
    6453                      .dwattr $C$DW$755, DW_AT_accessibility(DW_ACCESS_public)
    6454              $C$DW$756       .dwtag  DW_TAG_member
    6455                      .dwattr $C$DW$756, DW_AT_type(*$C$DW$T$65)
    6456                      .dwattr $C$DW$756, DW_AT_name("traj_spd")
    6457                      .dwattr $C$DW$756, DW_AT_TI_symbol_name("_traj_spd")
    6458                      .dwattr $C$DW$756, DW_AT_data_member_location[DW_OP_plus_uconst 0x6e]
    6459                      .dwattr $C$DW$756, DW_AT_accessibility(DW_ACCESS_public)
    6460              $C$DW$757       .dwtag  DW_TAG_member
    6461                      .dwattr $C$DW$757, DW_AT_type(*$C$DW$T$64)
    6462                      .dwattr $C$DW$757, DW_AT_name("trajHandle_spdMax")
    6463                      .dwattr $C$DW$757, DW_AT_TI_symbol_name("_trajHandle_spdMax")
    6464                      .dwattr $C$DW$757, DW_AT_data_member_location[DW_OP_plus_uconst 0x78]
    6465                      .dwattr $C$DW$757, DW_AT_accessibility(DW_ACCESS_public)
    6466              $C$DW$758       .dwtag  DW_TAG_member
    6467                      .dwattr $C$DW$758, DW_AT_type(*$C$DW$T$65)
    6468                      .dwattr $C$DW$758, DW_AT_name("traj_spdMax")
    6469                      .dwattr $C$DW$758, DW_AT_TI_symbol_name("_traj_spdMax")
    6470                      .dwattr $C$DW$758, DW_AT_data_member_location[DW_OP_plus_uconst 0x7a]
    6471                      .dwattr $C$DW$758, DW_AT_accessibility(DW_ACCESS_public)
    6472              $C$DW$759       .dwtag  DW_TAG_member
    6473                      .dwattr $C$DW$759, DW_AT_type(*$C$DW$T$66)
    6474                      .dwattr $C$DW$759, DW_AT_name("motorParams")
    6475                      .dwattr $C$DW$759, DW_AT_TI_symbol_name("_motorParams")
    6476                      .dwattr $C$DW$759, DW_AT_data_member_location[DW_OP_plus_uconst 0x84]
    6477                      .dwattr $C$DW$759, DW_AT_accessibility(DW_ACCESS_public)
    6478              $C$DW$760       .dwtag  DW_TAG_member
    6479                      .dwattr $C$DW$760, DW_AT_type(*$C$DW$T$69)
    6480                      .dwattr $C$DW$760, DW_AT_name("waitTimes")
    6481                      .dwattr $C$DW$760, DW_AT_TI_symbol_name("_waitTimes")
    6482                      .dwattr $C$DW$760, DW_AT_data_member_location[DW_OP_plus_uconst 0x92]
    6483                      .dwattr $C$DW$760, DW_AT_accessibility(DW_ACCESS_public)
    6484              $C$DW$761       .dwtag  DW_TAG_member
    6485                      .dwattr $C$DW$761, DW_AT_type(*$C$DW$T$68)
    6486                      .dwattr $C$DW$761, DW_AT_name("counter_state")
    6487                      .dwattr $C$DW$761, DW_AT_TI_symbol_name("_counter_state")
    6488                      .dwattr $C$DW$761, DW_AT_data_member_location[DW_OP_plus_uconst 0x9a]
    6489                      .dwattr $C$DW$761, DW_AT_accessibility(DW_ACCESS_public)
    6490              $C$DW$762       .dwtag  DW_TAG_member
    6491                      .dwattr $C$DW$762, DW_AT_type(*$C$DW$T$70)
    6492                      .dwattr $C$DW$762, DW_AT_name("numIsrTicksPerCtrlTick")
    6493                      .dwattr $C$DW$762, DW_AT_TI_symbol_name("_numIsrTicksPerCtrlTick")
    6494                      .dwattr $C$DW$762, DW_AT_data_member_location[DW_OP_plus_uconst 0x9c]
    6495                      .dwattr $C$DW$762, DW_AT_accessibility(DW_ACCESS_public)
    6496              $C$DW$763       .dwtag  DW_TAG_member
    6497                      .dwattr $C$DW$763, DW_AT_type(*$C$DW$T$70)
    6498                      .dwattr $C$DW$763, DW_AT_name("numCtrlTicksPerCurrentTick")
    6499                      .dwattr $C$DW$763, DW_AT_TI_symbol_name("_numCtrlTicksPerCurrentTick")
    6500                      .dwattr $C$DW$763, DW_AT_data_member_location[DW_OP_plus_uconst 0x9d]
    6501                      .dwattr $C$DW$763, DW_AT_accessibility(DW_ACCESS_public)
    6502              $C$DW$764       .dwtag  DW_TAG_member
    6503                      .dwattr $C$DW$764, DW_AT_type(*$C$DW$T$70)
    6504                      .dwattr $C$DW$764, DW_AT_name("numCtrlTicksPerSpeedTick")
    6505                      .dwattr $C$DW$764, DW_AT_TI_symbol_name("_numCtrlTicksPerSpeedTick")
    6506                      .dwattr $C$DW$764, DW_AT_data_member_location[DW_OP_plus_uconst 0x9e]
TMS320C2000 Assembler PC v6.2.5 Sun Oct 08 22:38:21 2017

Tools Copyright (c) 1996-2014 Texas Instruments Incorporated
C:\Users\wmj\AppData\Local\Temp\0856412                              PAGE  125

    6507                      .dwattr $C$DW$764, DW_AT_accessibility(DW_ACCESS_public)
    6508              $C$DW$765       .dwtag  DW_TAG_member
    6509                      .dwattr $C$DW$765, DW_AT_type(*$C$DW$T$70)
    6510                      .dwattr $C$DW$765, DW_AT_name("numCtrlTicksPerTrajTick")
    6511                      .dwattr $C$DW$765, DW_AT_TI_symbol_name("_numCtrlTicksPerTrajTick")
    6512                      .dwattr $C$DW$765, DW_AT_data_member_location[DW_OP_plus_uconst 0x9f]
    6513                      .dwattr $C$DW$765, DW_AT_accessibility(DW_ACCESS_public)
    6514              $C$DW$766       .dwtag  DW_TAG_member
    6515                      .dwattr $C$DW$766, DW_AT_type(*$C$DW$T$68)
    6516                      .dwattr $C$DW$766, DW_AT_name("ctrlFreq_Hz")
    6517                      .dwattr $C$DW$766, DW_AT_TI_symbol_name("_ctrlFreq_Hz")
    6518                      .dwattr $C$DW$766, DW_AT_data_member_location[DW_OP_plus_uconst 0xa0]
    6519                      .dwattr $C$DW$766, DW_AT_accessibility(DW_ACCESS_public)
    6520              $C$DW$767       .dwtag  DW_TAG_member
    6521                      .dwattr $C$DW$767, DW_AT_type(*$C$DW$T$68)
    6522                      .dwattr $C$DW$767, DW_AT_name("trajFreq_Hz")
    6523                      .dwattr $C$DW$767, DW_AT_TI_symbol_name("_trajFreq_Hz")
    6524                      .dwattr $C$DW$767, DW_AT_data_member_location[DW_OP_plus_uconst 0xa2]
    6525                      .dwattr $C$DW$767, DW_AT_accessibility(DW_ACCESS_public)
    6526              $C$DW$768       .dwtag  DW_TAG_member
    6527                      .dwattr $C$DW$768, DW_AT_type(*$C$DW$T$32)
    6528                      .dwattr $C$DW$768, DW_AT_name("trajPeriod_sec")
    6529                      .dwattr $C$DW$768, DW_AT_TI_symbol_name("_trajPeriod_sec")
    6530                      .dwattr $C$DW$768, DW_AT_data_member_location[DW_OP_plus_uconst 0xa4]
    6531                      .dwattr $C$DW$768, DW_AT_accessibility(DW_ACCESS_public)
    6532              $C$DW$769       .dwtag  DW_TAG_member
    6533                      .dwattr $C$DW$769, DW_AT_type(*$C$DW$T$71)
    6534                      .dwattr $C$DW$769, DW_AT_name("ctrlPeriod_sec")
    6535                      .dwattr $C$DW$769, DW_AT_TI_symbol_name("_ctrlPeriod_sec")
    6536                      .dwattr $C$DW$769, DW_AT_data_member_location[DW_OP_plus_uconst 0xa6]
    6537                      .dwattr $C$DW$769, DW_AT_accessibility(DW_ACCESS_public)
    6538              $C$DW$770       .dwtag  DW_TAG_member
    6539                      .dwattr $C$DW$770, DW_AT_type(*$C$DW$T$32)
    6540                      .dwattr $C$DW$770, DW_AT_name("maxVsMag_pu")
    6541                      .dwattr $C$DW$770, DW_AT_TI_symbol_name("_maxVsMag_pu")
    6542                      .dwattr $C$DW$770, DW_AT_data_member_location[DW_OP_plus_uconst 0xa8]
    6543                      .dwattr $C$DW$770, DW_AT_accessibility(DW_ACCESS_public)
    6544              $C$DW$771       .dwtag  DW_TAG_member
    6545                      .dwattr $C$DW$771, DW_AT_type(*$C$DW$T$33)
    6546                      .dwattr $C$DW$771, DW_AT_name("Iab_in")
    6547                      .dwattr $C$DW$771, DW_AT_TI_symbol_name("_Iab_in")
    6548                      .dwattr $C$DW$771, DW_AT_data_member_location[DW_OP_plus_uconst 0xaa]
    6549                      .dwattr $C$DW$771, DW_AT_accessibility(DW_ACCESS_public)
    6550              $C$DW$772       .dwtag  DW_TAG_member
    6551                      .dwattr $C$DW$772, DW_AT_type(*$C$DW$T$33)
    6552                      .dwattr $C$DW$772, DW_AT_name("Iab_filt")
    6553                      .dwattr $C$DW$772, DW_AT_TI_symbol_name("_Iab_filt")
    6554                      .dwattr $C$DW$772, DW_AT_data_member_location[DW_OP_plus_uconst 0xae]
    6555                      .dwattr $C$DW$772, DW_AT_accessibility(DW_ACCESS_public)
    6556              $C$DW$773       .dwtag  DW_TAG_member
    6557                      .dwattr $C$DW$773, DW_AT_type(*$C$DW$T$33)
    6558                      .dwattr $C$DW$773, DW_AT_name("Idq_in")
    6559                      .dwattr $C$DW$773, DW_AT_TI_symbol_name("_Idq_in")
    6560                      .dwattr $C$DW$773, DW_AT_data_member_location[DW_OP_plus_uconst 0xb2]
    6561                      .dwattr $C$DW$773, DW_AT_accessibility(DW_ACCESS_public)
TMS320C2000 Assembler PC v6.2.5 Sun Oct 08 22:38:21 2017

Tools Copyright (c) 1996-2014 Texas Instruments Incorporated
C:\Users\wmj\AppData\Local\Temp\0856412                              PAGE  126

    6562              $C$DW$774       .dwtag  DW_TAG_member
    6563                      .dwattr $C$DW$774, DW_AT_type(*$C$DW$T$33)
    6564                      .dwattr $C$DW$774, DW_AT_name("Vab_in")
    6565                      .dwattr $C$DW$774, DW_AT_TI_symbol_name("_Vab_in")
    6566                      .dwattr $C$DW$774, DW_AT_data_member_location[DW_OP_plus_uconst 0xb6]
    6567                      .dwattr $C$DW$774, DW_AT_accessibility(DW_ACCESS_public)
    6568              $C$DW$775       .dwtag  DW_TAG_member
    6569                      .dwattr $C$DW$775, DW_AT_type(*$C$DW$T$32)
    6570                      .dwattr $C$DW$775, DW_AT_name("spd_out")
    6571                      .dwattr $C$DW$775, DW_AT_TI_symbol_name("_spd_out")
    6572                      .dwattr $C$DW$775, DW_AT_data_member_location[DW_OP_plus_uconst 0xba]
    6573                      .dwattr $C$DW$775, DW_AT_accessibility(DW_ACCESS_public)
    6574              $C$DW$776       .dwtag  DW_TAG_member
    6575                      .dwattr $C$DW$776, DW_AT_type(*$C$DW$T$33)
    6576                      .dwattr $C$DW$776, DW_AT_name("Vab_out")
    6577                      .dwattr $C$DW$776, DW_AT_TI_symbol_name("_Vab_out")
    6578                      .dwattr $C$DW$776, DW_AT_data_member_location[DW_OP_plus_uconst 0xbc]
    6579                      .dwattr $C$DW$776, DW_AT_accessibility(DW_ACCESS_public)
    6580              $C$DW$777       .dwtag  DW_TAG_member
    6581                      .dwattr $C$DW$777, DW_AT_type(*$C$DW$T$33)
    6582                      .dwattr $C$DW$777, DW_AT_name("Vdq_out")
    6583                      .dwattr $C$DW$777, DW_AT_TI_symbol_name("_Vdq_out")
    6584                      .dwattr $C$DW$777, DW_AT_data_member_location[DW_OP_plus_uconst 0xc0]
    6585                      .dwattr $C$DW$777, DW_AT_accessibility(DW_ACCESS_public)
    6586              $C$DW$778       .dwtag  DW_TAG_member
    6587                      .dwattr $C$DW$778, DW_AT_type(*$C$DW$T$71)
    6588                      .dwattr $C$DW$778, DW_AT_name("Rhf")
    6589                      .dwattr $C$DW$778, DW_AT_TI_symbol_name("_Rhf")
    6590                      .dwattr $C$DW$778, DW_AT_data_member_location[DW_OP_plus_uconst 0xc4]
    6591                      .dwattr $C$DW$778, DW_AT_accessibility(DW_ACCESS_public)
    6592              $C$DW$779       .dwtag  DW_TAG_member
    6593                      .dwattr $C$DW$779, DW_AT_type(*$C$DW$T$71)
    6594                      .dwattr $C$DW$779, DW_AT_name("Lhf")
    6595                      .dwattr $C$DW$779, DW_AT_TI_symbol_name("_Lhf")
    6596                      .dwattr $C$DW$779, DW_AT_data_member_location[DW_OP_plus_uconst 0xc6]
    6597                      .dwattr $C$DW$779, DW_AT_accessibility(DW_ACCESS_public)
    6598              $C$DW$780       .dwtag  DW_TAG_member
    6599                      .dwattr $C$DW$780, DW_AT_type(*$C$DW$T$71)
    6600                      .dwattr $C$DW$780, DW_AT_name("RoverL")
    6601                      .dwattr $C$DW$780, DW_AT_TI_symbol_name("_RoverL")
    6602                      .dwattr $C$DW$780, DW_AT_data_member_location[DW_OP_plus_uconst 0xc8]
    6603                      .dwattr $C$DW$780, DW_AT_accessibility(DW_ACCESS_public)
    6604              $C$DW$781       .dwtag  DW_TAG_member
    6605                      .dwattr $C$DW$781, DW_AT_type(*$C$DW$T$32)
    6606                      .dwattr $C$DW$781, DW_AT_name("Kp_Id")
    6607                      .dwattr $C$DW$781, DW_AT_TI_symbol_name("_Kp_Id")
    6608                      .dwattr $C$DW$781, DW_AT_data_member_location[DW_OP_plus_uconst 0xca]
    6609                      .dwattr $C$DW$781, DW_AT_accessibility(DW_ACCESS_public)
    6610              $C$DW$782       .dwtag  DW_TAG_member
    6611                      .dwattr $C$DW$782, DW_AT_type(*$C$DW$T$32)
    6612                      .dwattr $C$DW$782, DW_AT_name("Kp_Iq")
    6613                      .dwattr $C$DW$782, DW_AT_TI_symbol_name("_Kp_Iq")
    6614                      .dwattr $C$DW$782, DW_AT_data_member_location[DW_OP_plus_uconst 0xcc]
    6615                      .dwattr $C$DW$782, DW_AT_accessibility(DW_ACCESS_public)
    6616              $C$DW$783       .dwtag  DW_TAG_member
TMS320C2000 Assembler PC v6.2.5 Sun Oct 08 22:38:21 2017

Tools Copyright (c) 1996-2014 Texas Instruments Incorporated
C:\Users\wmj\AppData\Local\Temp\0856412                              PAGE  127

    6617                      .dwattr $C$DW$783, DW_AT_type(*$C$DW$T$32)
    6618                      .dwattr $C$DW$783, DW_AT_name("Kp_spd")
    6619                      .dwattr $C$DW$783, DW_AT_TI_symbol_name("_Kp_spd")
    6620                      .dwattr $C$DW$783, DW_AT_data_member_location[DW_OP_plus_uconst 0xce]
    6621                      .dwattr $C$DW$783, DW_AT_accessibility(DW_ACCESS_public)
    6622              $C$DW$784       .dwtag  DW_TAG_member
    6623                      .dwattr $C$DW$784, DW_AT_type(*$C$DW$T$32)
    6624                      .dwattr $C$DW$784, DW_AT_name("Ki_Id")
    6625                      .dwattr $C$DW$784, DW_AT_TI_symbol_name("_Ki_Id")
    6626                      .dwattr $C$DW$784, DW_AT_data_member_location[DW_OP_plus_uconst 0xd0]
    6627                      .dwattr $C$DW$784, DW_AT_accessibility(DW_ACCESS_public)
    6628              $C$DW$785       .dwtag  DW_TAG_member
    6629                      .dwattr $C$DW$785, DW_AT_type(*$C$DW$T$32)
    6630                      .dwattr $C$DW$785, DW_AT_name("Ki_Iq")
    6631                      .dwattr $C$DW$785, DW_AT_TI_symbol_name("_Ki_Iq")
    6632                      .dwattr $C$DW$785, DW_AT_data_member_location[DW_OP_plus_uconst 0xd2]
    6633                      .dwattr $C$DW$785, DW_AT_accessibility(DW_ACCESS_public)
    6634              $C$DW$786       .dwtag  DW_TAG_member
    6635                      .dwattr $C$DW$786, DW_AT_type(*$C$DW$T$32)
    6636                      .dwattr $C$DW$786, DW_AT_name("Ki_spd")
    6637                      .dwattr $C$DW$786, DW_AT_TI_symbol_name("_Ki_spd")
    6638                      .dwattr $C$DW$786, DW_AT_data_member_location[DW_OP_plus_uconst 0xd4]
    6639                      .dwattr $C$DW$786, DW_AT_accessibility(DW_ACCESS_public)
    6640              $C$DW$787       .dwtag  DW_TAG_member
    6641                      .dwattr $C$DW$787, DW_AT_type(*$C$DW$T$32)
    6642                      .dwattr $C$DW$787, DW_AT_name("Kd_Id")
    6643                      .dwattr $C$DW$787, DW_AT_TI_symbol_name("_Kd_Id")
    6644                      .dwattr $C$DW$787, DW_AT_data_member_location[DW_OP_plus_uconst 0xd6]
    6645                      .dwattr $C$DW$787, DW_AT_accessibility(DW_ACCESS_public)
    6646              $C$DW$788       .dwtag  DW_TAG_member
    6647                      .dwattr $C$DW$788, DW_AT_type(*$C$DW$T$32)
    6648                      .dwattr $C$DW$788, DW_AT_name("Kd_Iq")
    6649                      .dwattr $C$DW$788, DW_AT_TI_symbol_name("_Kd_Iq")
    6650                      .dwattr $C$DW$788, DW_AT_data_member_location[DW_OP_plus_uconst 0xd8]
    6651                      .dwattr $C$DW$788, DW_AT_accessibility(DW_ACCESS_public)
    6652              $C$DW$789       .dwtag  DW_TAG_member
    6653                      .dwattr $C$DW$789, DW_AT_type(*$C$DW$T$32)
    6654                      .dwattr $C$DW$789, DW_AT_name("Kd_spd")
    6655                      .dwattr $C$DW$789, DW_AT_TI_symbol_name("_Kd_spd")
    6656                      .dwattr $C$DW$789, DW_AT_data_member_location[DW_OP_plus_uconst 0xda]
    6657                      .dwattr $C$DW$789, DW_AT_accessibility(DW_ACCESS_public)
    6658              $C$DW$790       .dwtag  DW_TAG_member
    6659                      .dwattr $C$DW$790, DW_AT_type(*$C$DW$T$32)
    6660                      .dwattr $C$DW$790, DW_AT_name("Ui_Id")
    6661                      .dwattr $C$DW$790, DW_AT_TI_symbol_name("_Ui_Id")
    6662                      .dwattr $C$DW$790, DW_AT_data_member_location[DW_OP_plus_uconst 0xdc]
    6663                      .dwattr $C$DW$790, DW_AT_accessibility(DW_ACCESS_public)
    6664              $C$DW$791       .dwtag  DW_TAG_member
    6665                      .dwattr $C$DW$791, DW_AT_type(*$C$DW$T$32)
    6666                      .dwattr $C$DW$791, DW_AT_name("Ui_Iq")
    6667                      .dwattr $C$DW$791, DW_AT_TI_symbol_name("_Ui_Iq")
    6668                      .dwattr $C$DW$791, DW_AT_data_member_location[DW_OP_plus_uconst 0xde]
    6669                      .dwattr $C$DW$791, DW_AT_accessibility(DW_ACCESS_public)
    6670              $C$DW$792       .dwtag  DW_TAG_member
    6671                      .dwattr $C$DW$792, DW_AT_type(*$C$DW$T$32)
TMS320C2000 Assembler PC v6.2.5 Sun Oct 08 22:38:21 2017

Tools Copyright (c) 1996-2014 Texas Instruments Incorporated
C:\Users\wmj\AppData\Local\Temp\0856412                              PAGE  128

    6672                      .dwattr $C$DW$792, DW_AT_name("Ui_spd")
    6673                      .dwattr $C$DW$792, DW_AT_TI_symbol_name("_Ui_spd")
    6674                      .dwattr $C$DW$792, DW_AT_data_member_location[DW_OP_plus_uconst 0xe0]
    6675                      .dwattr $C$DW$792, DW_AT_accessibility(DW_ACCESS_public)
    6676              $C$DW$793       .dwtag  DW_TAG_member
    6677                      .dwattr $C$DW$793, DW_AT_type(*$C$DW$T$33)
    6678                      .dwattr $C$DW$793, DW_AT_name("Idq_ref")
    6679                      .dwattr $C$DW$793, DW_AT_TI_symbol_name("_Idq_ref")
    6680                      .dwattr $C$DW$793, DW_AT_data_member_location[DW_OP_plus_uconst 0xe2]
    6681                      .dwattr $C$DW$793, DW_AT_accessibility(DW_ACCESS_public)
    6682              $C$DW$794       .dwtag  DW_TAG_member
    6683                      .dwattr $C$DW$794, DW_AT_type(*$C$DW$T$32)
    6684                      .dwattr $C$DW$794, DW_AT_name("IdRated")
    6685                      .dwattr $C$DW$794, DW_AT_TI_symbol_name("_IdRated")
    6686                      .dwattr $C$DW$794, DW_AT_data_member_location[DW_OP_plus_uconst 0xe6]
    6687                      .dwattr $C$DW$794, DW_AT_accessibility(DW_ACCESS_public)
    6688              $C$DW$795       .dwtag  DW_TAG_member
    6689                      .dwattr $C$DW$795, DW_AT_type(*$C$DW$T$32)
    6690                      .dwattr $C$DW$795, DW_AT_name("spd_ref")
    6691                      .dwattr $C$DW$795, DW_AT_TI_symbol_name("_spd_ref")
    6692                      .dwattr $C$DW$795, DW_AT_data_member_location[DW_OP_plus_uconst 0xe8]
    6693                      .dwattr $C$DW$795, DW_AT_accessibility(DW_ACCESS_public)
    6694              $C$DW$796       .dwtag  DW_TAG_member
    6695                      .dwattr $C$DW$796, DW_AT_type(*$C$DW$T$32)
    6696                      .dwattr $C$DW$796, DW_AT_name("spd_max")
    6697                      .dwattr $C$DW$796, DW_AT_TI_symbol_name("_spd_max")
    6698                      .dwattr $C$DW$796, DW_AT_data_member_location[DW_OP_plus_uconst 0xea]
    6699                      .dwattr $C$DW$796, DW_AT_accessibility(DW_ACCESS_public)
    6700              $C$DW$797       .dwtag  DW_TAG_member
    6701                      .dwattr $C$DW$797, DW_AT_type(*$C$DW$T$70)
    6702                      .dwattr $C$DW$797, DW_AT_name("counter_current")
    6703                      .dwattr $C$DW$797, DW_AT_TI_symbol_name("_counter_current")
    6704                      .dwattr $C$DW$797, DW_AT_data_member_location[DW_OP_plus_uconst 0xec]
    6705                      .dwattr $C$DW$797, DW_AT_accessibility(DW_ACCESS_public)
    6706              $C$DW$798       .dwtag  DW_TAG_member
    6707                      .dwattr $C$DW$798, DW_AT_type(*$C$DW$T$70)
    6708                      .dwattr $C$DW$798, DW_AT_name("counter_isr")
    6709                      .dwattr $C$DW$798, DW_AT_TI_symbol_name("_counter_isr")
    6710                      .dwattr $C$DW$798, DW_AT_data_member_location[DW_OP_plus_uconst 0xed]
    6711                      .dwattr $C$DW$798, DW_AT_accessibility(DW_ACCESS_public)
    6712              $C$DW$799       .dwtag  DW_TAG_member
    6713                      .dwattr $C$DW$799, DW_AT_type(*$C$DW$T$70)
    6714                      .dwattr $C$DW$799, DW_AT_name("counter_speed")
    6715                      .dwattr $C$DW$799, DW_AT_TI_symbol_name("_counter_speed")
    6716                      .dwattr $C$DW$799, DW_AT_data_member_location[DW_OP_plus_uconst 0xee]
    6717                      .dwattr $C$DW$799, DW_AT_accessibility(DW_ACCESS_public)
    6718              $C$DW$800       .dwtag  DW_TAG_member
    6719                      .dwattr $C$DW$800, DW_AT_type(*$C$DW$T$70)
    6720                      .dwattr $C$DW$800, DW_AT_name("counter_traj")
    6721                      .dwattr $C$DW$800, DW_AT_TI_symbol_name("_counter_traj")
    6722                      .dwattr $C$DW$800, DW_AT_data_member_location[DW_OP_plus_uconst 0xef]
    6723                      .dwattr $C$DW$800, DW_AT_accessibility(DW_ACCESS_public)
    6724              $C$DW$801       .dwtag  DW_TAG_member
    6725                      .dwattr $C$DW$801, DW_AT_type(*$C$DW$T$34)
    6726                      .dwattr $C$DW$801, DW_AT_name("flag_enableCtrl")
TMS320C2000 Assembler PC v6.2.5 Sun Oct 08 22:38:21 2017

Tools Copyright (c) 1996-2014 Texas Instruments Incorporated
C:\Users\wmj\AppData\Local\Temp\0856412                              PAGE  129

    6727                      .dwattr $C$DW$801, DW_AT_TI_symbol_name("_flag_enableCtrl")
    6728                      .dwattr $C$DW$801, DW_AT_data_member_location[DW_OP_plus_uconst 0xf0]
    6729                      .dwattr $C$DW$801, DW_AT_accessibility(DW_ACCESS_public)
    6730              $C$DW$802       .dwtag  DW_TAG_member
    6731                      .dwattr $C$DW$802, DW_AT_type(*$C$DW$T$34)
    6732                      .dwattr $C$DW$802, DW_AT_name("flag_enableDcBusComp")
    6733                      .dwattr $C$DW$802, DW_AT_TI_symbol_name("_flag_enableDcBusComp")
    6734                      .dwattr $C$DW$802, DW_AT_data_member_location[DW_OP_plus_uconst 0xf1]
    6735                      .dwattr $C$DW$802, DW_AT_accessibility(DW_ACCESS_public)
    6736              $C$DW$803       .dwtag  DW_TAG_member
    6737                      .dwattr $C$DW$803, DW_AT_type(*$C$DW$T$34)
    6738                      .dwattr $C$DW$803, DW_AT_name("flag_enablePowerWarp")
    6739                      .dwattr $C$DW$803, DW_AT_TI_symbol_name("_flag_enablePowerWarp")
    6740                      .dwattr $C$DW$803, DW_AT_data_member_location[DW_OP_plus_uconst 0xf2]
    6741                      .dwattr $C$DW$803, DW_AT_accessibility(DW_ACCESS_public)
    6742              $C$DW$804       .dwtag  DW_TAG_member
    6743                      .dwattr $C$DW$804, DW_AT_type(*$C$DW$T$34)
    6744                      .dwattr $C$DW$804, DW_AT_name("flag_enableOffset")
    6745                      .dwattr $C$DW$804, DW_AT_TI_symbol_name("_flag_enableOffset")
    6746                      .dwattr $C$DW$804, DW_AT_data_member_location[DW_OP_plus_uconst 0xf3]
    6747                      .dwattr $C$DW$804, DW_AT_accessibility(DW_ACCESS_public)
    6748              $C$DW$805       .dwtag  DW_TAG_member
    6749                      .dwattr $C$DW$805, DW_AT_type(*$C$DW$T$34)
    6750                      .dwattr $C$DW$805, DW_AT_name("flag_enableSpeedCtrl")
    6751                      .dwattr $C$DW$805, DW_AT_TI_symbol_name("_flag_enableSpeedCtrl")
    6752                      .dwattr $C$DW$805, DW_AT_data_member_location[DW_OP_plus_uconst 0xf4]
    6753                      .dwattr $C$DW$805, DW_AT_accessibility(DW_ACCESS_public)
    6754              $C$DW$806       .dwtag  DW_TAG_member
    6755                      .dwattr $C$DW$806, DW_AT_type(*$C$DW$T$34)
    6756                      .dwattr $C$DW$806, DW_AT_name("flag_enableUserMotorParams")
    6757                      .dwattr $C$DW$806, DW_AT_TI_symbol_name("_flag_enableUserMotorParams")
    6758                      .dwattr $C$DW$806, DW_AT_data_member_location[DW_OP_plus_uconst 0xf5]
    6759                      .dwattr $C$DW$806, DW_AT_accessibility(DW_ACCESS_public)
    6760              $C$DW$807       .dwtag  DW_TAG_member
    6761                      .dwattr $C$DW$807, DW_AT_type(*$C$DW$T$33)
    6762                      .dwattr $C$DW$807, DW_AT_name("Idq_offset_pu")
    6763                      .dwattr $C$DW$807, DW_AT_TI_symbol_name("_Idq_offset_pu")
    6764                      .dwattr $C$DW$807, DW_AT_data_member_location[DW_OP_plus_uconst 0xf6]
    6765                      .dwattr $C$DW$807, DW_AT_accessibility(DW_ACCESS_public)
    6766              $C$DW$808       .dwtag  DW_TAG_member
    6767                      .dwattr $C$DW$808, DW_AT_type(*$C$DW$T$33)
    6768                      .dwattr $C$DW$808, DW_AT_name("Vdq_offset_pu")
    6769                      .dwattr $C$DW$808, DW_AT_TI_symbol_name("_Vdq_offset_pu")
    6770                      .dwattr $C$DW$808, DW_AT_data_member_location[DW_OP_plus_uconst 0xfa]
    6771                      .dwattr $C$DW$808, DW_AT_accessibility(DW_ACCESS_public)
    6772              $C$DW$809       .dwtag  DW_TAG_member
    6773                      .dwattr $C$DW$809, DW_AT_type(*$C$DW$T$32)
    6774                      .dwattr $C$DW$809, DW_AT_name("angle_pu")
    6775                      .dwattr $C$DW$809, DW_AT_TI_symbol_name("_angle_pu")
    6776                      .dwattr $C$DW$809, DW_AT_data_member_location[DW_OP_plus_uconst 0xfe]
    6777                      .dwattr $C$DW$809, DW_AT_accessibility(DW_ACCESS_public)
    6778              $C$DW$810       .dwtag  DW_TAG_member
    6779                      .dwattr $C$DW$810, DW_AT_type(*$C$DW$T$32)
    6780                      .dwattr $C$DW$810, DW_AT_name("speed_ref_pu")
    6781                      .dwattr $C$DW$810, DW_AT_TI_symbol_name("_speed_ref_pu")
TMS320C2000 Assembler PC v6.2.5 Sun Oct 08 22:38:21 2017

Tools Copyright (c) 1996-2014 Texas Instruments Incorporated
C:\Users\wmj\AppData\Local\Temp\0856412                              PAGE  130

    6782                      .dwattr $C$DW$810, DW_AT_data_member_location[DW_OP_plus_uconst 0x100]
    6783                      .dwattr $C$DW$810, DW_AT_accessibility(DW_ACCESS_public)
    6784              $C$DW$811       .dwtag  DW_TAG_member
    6785                      .dwattr $C$DW$811, DW_AT_type(*$C$DW$T$32)
    6786                      .dwattr $C$DW$811, DW_AT_name("speed_fb_pu")
    6787                      .dwattr $C$DW$811, DW_AT_TI_symbol_name("_speed_fb_pu")
    6788                      .dwattr $C$DW$811, DW_AT_data_member_location[DW_OP_plus_uconst 0x102]
    6789                      .dwattr $C$DW$811, DW_AT_accessibility(DW_ACCESS_public)
    6790              $C$DW$812       .dwtag  DW_TAG_member
    6791                      .dwattr $C$DW$812, DW_AT_type(*$C$DW$T$32)
    6792                      .dwattr $C$DW$812, DW_AT_name("speed_outMax_pu")
    6793                      .dwattr $C$DW$812, DW_AT_TI_symbol_name("_speed_outMax_pu")
    6794                      .dwattr $C$DW$812, DW_AT_data_member_location[DW_OP_plus_uconst 0x104]
    6795                      .dwattr $C$DW$812, DW_AT_accessibility(DW_ACCESS_public)
    6796              $C$DW$813       .dwtag  DW_TAG_member
    6797                      .dwattr $C$DW$813, DW_AT_type(*$C$DW$T$34)
    6798                      .dwattr $C$DW$813, DW_AT_name("flag_enableCurrentCtrl")
    6799                      .dwattr $C$DW$813, DW_AT_TI_symbol_name("_flag_enableCurrentCtrl")
    6800                      .dwattr $C$DW$813, DW_AT_data_member_location[DW_OP_plus_uconst 0x106]
    6801                      .dwattr $C$DW$813, DW_AT_accessibility(DW_ACCESS_public)
    6802              $C$DW$814       .dwtag  DW_TAG_member
    6803                      .dwattr $C$DW$814, DW_AT_type(*$C$DW$T$73)
    6804                      .dwattr $C$DW$814, DW_AT_name("brakeHandle")
    6805                      .dwattr $C$DW$814, DW_AT_TI_symbol_name("_brakeHandle")
    6806                      .dwattr $C$DW$814, DW_AT_data_member_location[DW_OP_plus_uconst 0x108]
    6807                      .dwattr $C$DW$814, DW_AT_accessibility(DW_ACCESS_public)
    6808              $C$DW$815       .dwtag  DW_TAG_member
    6809                      .dwattr $C$DW$815, DW_AT_type(*$C$DW$T$74)
    6810                      .dwattr $C$DW$815, DW_AT_name("brake")
    6811                      .dwattr $C$DW$815, DW_AT_TI_symbol_name("_brake")
    6812                      .dwattr $C$DW$815, DW_AT_data_member_location[DW_OP_plus_uconst 0x10a]
    6813                      .dwattr $C$DW$815, DW_AT_accessibility(DW_ACCESS_public)
    6814                      .dwendtag $C$DW$T$75
    6815              
    6816              $C$DW$T$217     .dwtag  DW_TAG_typedef, DW_AT_name("CTRL_Obj")
    6817                      .dwattr $C$DW$T$217, DW_AT_type(*$C$DW$T$75)
    6818                      .dwattr $C$DW$T$217, DW_AT_language(DW_LANG_C)
    6819              $C$DW$T$181     .dwtag  DW_TAG_pointer_type
    6820                      .dwattr $C$DW$T$181, DW_AT_type(*$C$DW$T$75)
    6821                      .dwattr $C$DW$T$181, DW_AT_address_class(0x16)
    6822              $C$DW$T$182     .dwtag  DW_TAG_typedef, DW_AT_name("CTRL_Handle")
    6823                      .dwattr $C$DW$T$182, DW_AT_type(*$C$DW$T$181)
    6824                      .dwattr $C$DW$T$182, DW_AT_language(DW_LANG_C)
    6825              $C$DW$816       .dwtag  DW_TAG_TI_far_type
    6826                      .dwattr $C$DW$816, DW_AT_type(*$C$DW$T$182)
    6827              $C$DW$T$218     .dwtag  DW_TAG_const_type
    6828                      .dwattr $C$DW$T$218, DW_AT_type(*$C$DW$816)
    6829              
    6830              $C$DW$T$78      .dwtag  DW_TAG_structure_type
    6831                      .dwattr $C$DW$T$78, DW_AT_name("_CTRL_Version_")
    6832                      .dwattr $C$DW$T$78, DW_AT_byte_size(0x04)
    6833              $C$DW$817       .dwtag  DW_TAG_member
    6834                      .dwattr $C$DW$817, DW_AT_type(*$C$DW$T$23)
    6835                      .dwattr $C$DW$817, DW_AT_name("rsvd")
    6836                      .dwattr $C$DW$817, DW_AT_TI_symbol_name("_rsvd")
TMS320C2000 Assembler PC v6.2.5 Sun Oct 08 22:38:21 2017

Tools Copyright (c) 1996-2014 Texas Instruments Incorporated
C:\Users\wmj\AppData\Local\Temp\0856412                              PAGE  131

    6837                      .dwattr $C$DW$817, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    6838                      .dwattr $C$DW$817, DW_AT_accessibility(DW_ACCESS_public)
    6839              $C$DW$818       .dwtag  DW_TAG_member
    6840                      .dwattr $C$DW$818, DW_AT_type(*$C$DW$T$77)
    6841                      .dwattr $C$DW$818, DW_AT_name("targetProc")
    6842                      .dwattr $C$DW$818, DW_AT_TI_symbol_name("_targetProc")
    6843                      .dwattr $C$DW$818, DW_AT_data_member_location[DW_OP_plus_uconst 0x1]
    6844                      .dwattr $C$DW$818, DW_AT_accessibility(DW_ACCESS_public)
    6845              $C$DW$819       .dwtag  DW_TAG_member
    6846                      .dwattr $C$DW$819, DW_AT_type(*$C$DW$T$23)
    6847                      .dwattr $C$DW$819, DW_AT_name("major")
    6848                      .dwattr $C$DW$819, DW_AT_TI_symbol_name("_major")
    6849                      .dwattr $C$DW$819, DW_AT_data_member_location[DW_OP_plus_uconst 0x2]
    6850                      .dwattr $C$DW$819, DW_AT_accessibility(DW_ACCESS_public)
    6851              $C$DW$820       .dwtag  DW_TAG_member
    6852                      .dwattr $C$DW$820, DW_AT_type(*$C$DW$T$23)
    6853                      .dwattr $C$DW$820, DW_AT_name("minor")
    6854                      .dwattr $C$DW$820, DW_AT_TI_symbol_name("_minor")
    6855                      .dwattr $C$DW$820, DW_AT_data_member_location[DW_OP_plus_uconst 0x3]
    6856                      .dwattr $C$DW$820, DW_AT_accessibility(DW_ACCESS_public)
    6857                      .dwendtag $C$DW$T$78
    6858              
    6859              $C$DW$T$41      .dwtag  DW_TAG_typedef, DW_AT_name("CTRL_Version")
    6860                      .dwattr $C$DW$T$41, DW_AT_type(*$C$DW$T$78)
    6861                      .dwattr $C$DW$T$41, DW_AT_language(DW_LANG_C)
    6862              
    6863              $C$DW$T$20      .dwtag  DW_TAG_structure_type
    6864                      .dwattr $C$DW$T$20, DW_AT_name("_EST_Obj_")
    6865                      .dwattr $C$DW$T$20, DW_AT_declaration
    6866                      .dwendtag $C$DW$T$20
    6867              
    6868              $C$DW$T$49      .dwtag  DW_TAG_pointer_type
    6869                      .dwattr $C$DW$T$49, DW_AT_type(*$C$DW$T$20)
    6870                      .dwattr $C$DW$T$49, DW_AT_address_class(0x16)
    6871              $C$DW$T$50      .dwtag  DW_TAG_typedef, DW_AT_name("EST_Handle")
    6872                      .dwattr $C$DW$T$50, DW_AT_type(*$C$DW$T$49)
    6873                      .dwattr $C$DW$T$50, DW_AT_language(DW_LANG_C)
    6874              
    6875              $C$DW$T$79      .dwtag  DW_TAG_structure_type
    6876                      .dwattr $C$DW$T$79, DW_AT_name("_FILTER_FO_")
    6877                      .dwattr $C$DW$T$79, DW_AT_byte_size(0x0a)
    6878              $C$DW$821       .dwtag  DW_TAG_member
    6879                      .dwattr $C$DW$821, DW_AT_type(*$C$DW$T$32)
    6880                      .dwattr $C$DW$821, DW_AT_name("a1")
    6881                      .dwattr $C$DW$821, DW_AT_TI_symbol_name("_a1")
    6882                      .dwattr $C$DW$821, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    6883                      .dwattr $C$DW$821, DW_AT_accessibility(DW_ACCESS_public)
    6884              $C$DW$822       .dwtag  DW_TAG_member
    6885                      .dwattr $C$DW$822, DW_AT_type(*$C$DW$T$32)
    6886                      .dwattr $C$DW$822, DW_AT_name("b0")
    6887                      .dwattr $C$DW$822, DW_AT_TI_symbol_name("_b0")
    6888                      .dwattr $C$DW$822, DW_AT_data_member_location[DW_OP_plus_uconst 0x2]
    6889                      .dwattr $C$DW$822, DW_AT_accessibility(DW_ACCESS_public)
    6890              $C$DW$823       .dwtag  DW_TAG_member
    6891                      .dwattr $C$DW$823, DW_AT_type(*$C$DW$T$32)
TMS320C2000 Assembler PC v6.2.5 Sun Oct 08 22:38:21 2017

Tools Copyright (c) 1996-2014 Texas Instruments Incorporated
C:\Users\wmj\AppData\Local\Temp\0856412                              PAGE  132

    6892                      .dwattr $C$DW$823, DW_AT_name("b1")
    6893                      .dwattr $C$DW$823, DW_AT_TI_symbol_name("_b1")
    6894                      .dwattr $C$DW$823, DW_AT_data_member_location[DW_OP_plus_uconst 0x4]
    6895                      .dwattr $C$DW$823, DW_AT_accessibility(DW_ACCESS_public)
    6896              $C$DW$824       .dwtag  DW_TAG_member
    6897                      .dwattr $C$DW$824, DW_AT_type(*$C$DW$T$32)
    6898                      .dwattr $C$DW$824, DW_AT_name("x1")
    6899                      .dwattr $C$DW$824, DW_AT_TI_symbol_name("_x1")
    6900                      .dwattr $C$DW$824, DW_AT_data_member_location[DW_OP_plus_uconst 0x6]
    6901                      .dwattr $C$DW$824, DW_AT_accessibility(DW_ACCESS_public)
    6902              $C$DW$825       .dwtag  DW_TAG_member
    6903                      .dwattr $C$DW$825, DW_AT_type(*$C$DW$T$32)
    6904                      .dwattr $C$DW$825, DW_AT_name("y1")
    6905                      .dwattr $C$DW$825, DW_AT_TI_symbol_name("_y1")
    6906                      .dwattr $C$DW$825, DW_AT_data_member_location[DW_OP_plus_uconst 0x8]
    6907                      .dwattr $C$DW$825, DW_AT_accessibility(DW_ACCESS_public)
    6908                      .dwendtag $C$DW$T$79
    6909              
    6910              $C$DW$T$157     .dwtag  DW_TAG_typedef, DW_AT_name("FILTER_FO_Obj")
    6911                      .dwattr $C$DW$T$157, DW_AT_type(*$C$DW$T$79)
    6912                      .dwattr $C$DW$T$157, DW_AT_language(DW_LANG_C)
    6913              
    6914              $C$DW$T$21      .dwtag  DW_TAG_structure_type
    6915                      .dwattr $C$DW$T$21, DW_AT_name("_FILTER_FO_Obj_")
    6916                      .dwattr $C$DW$T$21, DW_AT_declaration
    6917                      .dwendtag $C$DW$T$21
    6918              
    6919              $C$DW$T$158     .dwtag  DW_TAG_pointer_type
    6920                      .dwattr $C$DW$T$158, DW_AT_type(*$C$DW$T$21)
    6921                      .dwattr $C$DW$T$158, DW_AT_address_class(0x16)
    6922              $C$DW$T$159     .dwtag  DW_TAG_typedef, DW_AT_name("FILTER_FO_Handle")
    6923                      .dwattr $C$DW$T$159, DW_AT_type(*$C$DW$T$158)
    6924                      .dwattr $C$DW$T$159, DW_AT_language(DW_LANG_C)
    6925              
    6926              $C$DW$T$80      .dwtag  DW_TAG_structure_type
    6927                      .dwattr $C$DW$T$80, DW_AT_name("_FLASH_Obj_")
    6928                      .dwattr $C$DW$T$80, DW_AT_byte_size(0x08)
    6929              $C$DW$826       .dwtag  DW_TAG_member
    6930                      .dwattr $C$DW$826, DW_AT_type(*$C$DW$T$24)
    6931                      .dwattr $C$DW$826, DW_AT_name("FOPT")
    6932                      .dwattr $C$DW$826, DW_AT_TI_symbol_name("_FOPT")
    6933                      .dwattr $C$DW$826, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    6934                      .dwattr $C$DW$826, DW_AT_accessibility(DW_ACCESS_public)
    6935              $C$DW$827       .dwtag  DW_TAG_member
    6936                      .dwattr $C$DW$827, DW_AT_type(*$C$DW$T$24)
    6937                      .dwattr $C$DW$827, DW_AT_name("rsvd_1")
    6938                      .dwattr $C$DW$827, DW_AT_TI_symbol_name("_rsvd_1")
    6939                      .dwattr $C$DW$827, DW_AT_data_member_location[DW_OP_plus_uconst 0x1]
    6940                      .dwattr $C$DW$827, DW_AT_accessibility(DW_ACCESS_public)
    6941              $C$DW$828       .dwtag  DW_TAG_member
    6942                      .dwattr $C$DW$828, DW_AT_type(*$C$DW$T$24)
    6943                      .dwattr $C$DW$828, DW_AT_name("FPWR")
    6944                      .dwattr $C$DW$828, DW_AT_TI_symbol_name("_FPWR")
    6945                      .dwattr $C$DW$828, DW_AT_data_member_location[DW_OP_plus_uconst 0x2]
    6946                      .dwattr $C$DW$828, DW_AT_accessibility(DW_ACCESS_public)
TMS320C2000 Assembler PC v6.2.5 Sun Oct 08 22:38:21 2017

Tools Copyright (c) 1996-2014 Texas Instruments Incorporated
C:\Users\wmj\AppData\Local\Temp\0856412                              PAGE  133

    6947              $C$DW$829       .dwtag  DW_TAG_member
    6948                      .dwattr $C$DW$829, DW_AT_type(*$C$DW$T$24)
    6949                      .dwattr $C$DW$829, DW_AT_name("FSTATUS")
    6950                      .dwattr $C$DW$829, DW_AT_TI_symbol_name("_FSTATUS")
    6951                      .dwattr $C$DW$829, DW_AT_data_member_location[DW_OP_plus_uconst 0x3]
    6952                      .dwattr $C$DW$829, DW_AT_accessibility(DW_ACCESS_public)
    6953              $C$DW$830       .dwtag  DW_TAG_member
    6954                      .dwattr $C$DW$830, DW_AT_type(*$C$DW$T$24)
    6955                      .dwattr $C$DW$830, DW_AT_name("FSTDBYWAIT")
    6956                      .dwattr $C$DW$830, DW_AT_TI_symbol_name("_FSTDBYWAIT")
    6957                      .dwattr $C$DW$830, DW_AT_data_member_location[DW_OP_plus_uconst 0x4]
    6958                      .dwattr $C$DW$830, DW_AT_accessibility(DW_ACCESS_public)
    6959              $C$DW$831       .dwtag  DW_TAG_member
    6960                      .dwattr $C$DW$831, DW_AT_type(*$C$DW$T$24)
    6961                      .dwattr $C$DW$831, DW_AT_name("FACTIVEWAIT")
    6962                      .dwattr $C$DW$831, DW_AT_TI_symbol_name("_FACTIVEWAIT")
    6963                      .dwattr $C$DW$831, DW_AT_data_member_location[DW_OP_plus_uconst 0x5]
    6964                      .dwattr $C$DW$831, DW_AT_accessibility(DW_ACCESS_public)
    6965              $C$DW$832       .dwtag  DW_TAG_member
    6966                      .dwattr $C$DW$832, DW_AT_type(*$C$DW$T$24)
    6967                      .dwattr $C$DW$832, DW_AT_name("FBANKWAIT")
    6968                      .dwattr $C$DW$832, DW_AT_TI_symbol_name("_FBANKWAIT")
    6969                      .dwattr $C$DW$832, DW_AT_data_member_location[DW_OP_plus_uconst 0x6]
    6970                      .dwattr $C$DW$832, DW_AT_accessibility(DW_ACCESS_public)
    6971              $C$DW$833       .dwtag  DW_TAG_member
    6972                      .dwattr $C$DW$833, DW_AT_type(*$C$DW$T$24)
    6973                      .dwattr $C$DW$833, DW_AT_name("FOTPWAIT")
    6974                      .dwattr $C$DW$833, DW_AT_TI_symbol_name("_FOTPWAIT")
    6975                      .dwattr $C$DW$833, DW_AT_data_member_location[DW_OP_plus_uconst 0x7]
    6976                      .dwattr $C$DW$833, DW_AT_accessibility(DW_ACCESS_public)
    6977                      .dwendtag $C$DW$T$80
    6978              
    6979              $C$DW$T$108     .dwtag  DW_TAG_pointer_type
    6980                      .dwattr $C$DW$T$108, DW_AT_type(*$C$DW$T$80)
    6981                      .dwattr $C$DW$T$108, DW_AT_address_class(0x16)
    6982              $C$DW$T$109     .dwtag  DW_TAG_typedef, DW_AT_name("FLASH_Handle")
    6983                      .dwattr $C$DW$T$109, DW_AT_type(*$C$DW$T$108)
    6984                      .dwattr $C$DW$T$109, DW_AT_language(DW_LANG_C)
    6985              
    6986              $C$DW$T$94      .dwtag  DW_TAG_structure_type
    6987                      .dwattr $C$DW$T$94, DW_AT_name("_FSM_Obj_")
    6988                      .dwattr $C$DW$T$94, DW_AT_byte_size(0x1a)
    6989              $C$DW$834       .dwtag  DW_TAG_member
    6990                      .dwattr $C$DW$834, DW_AT_type(*$C$DW$T$82)
    6991                      .dwattr $C$DW$834, DW_AT_name("MotorHandle")
    6992                      .dwattr $C$DW$834, DW_AT_TI_symbol_name("_MotorHandle")
    6993                      .dwattr $C$DW$834, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    6994                      .dwattr $C$DW$834, DW_AT_accessibility(DW_ACCESS_public)
    6995              $C$DW$835       .dwtag  DW_TAG_member
    6996                      .dwattr $C$DW$835, DW_AT_type(*$C$DW$T$84)
    6997                      .dwattr $C$DW$835, DW_AT_name("pca955xHandle")
    6998                      .dwattr $C$DW$835, DW_AT_TI_symbol_name("_pca955xHandle")
    6999                      .dwattr $C$DW$835, DW_AT_data_member_location[DW_OP_plus_uconst 0x2]
    7000                      .dwattr $C$DW$835, DW_AT_accessibility(DW_ACCESS_public)
    7001              $C$DW$836       .dwtag  DW_TAG_member
TMS320C2000 Assembler PC v6.2.5 Sun Oct 08 22:38:21 2017

Tools Copyright (c) 1996-2014 Texas Instruments Incorporated
C:\Users\wmj\AppData\Local\Temp\0856412                              PAGE  134

    7002                      .dwattr $C$DW$836, DW_AT_type(*$C$DW$T$85)
    7003                      .dwattr $C$DW$836, DW_AT_name("pca9555")
    7004                      .dwattr $C$DW$836, DW_AT_TI_symbol_name("_pca9555")
    7005                      .dwattr $C$DW$836, DW_AT_data_member_location[DW_OP_plus_uconst 0x4]
    7006                      .dwattr $C$DW$836, DW_AT_accessibility(DW_ACCESS_public)
    7007              $C$DW$837       .dwtag  DW_TAG_member
    7008                      .dwattr $C$DW$837, DW_AT_type(*$C$DW$T$87)
    7009                      .dwattr $C$DW$837, DW_AT_name("FSM_State")
    7010                      .dwattr $C$DW$837, DW_AT_TI_symbol_name("_FSM_State")
    7011                      .dwattr $C$DW$837, DW_AT_data_member_location[DW_OP_plus_uconst 0xa]
    7012                      .dwattr $C$DW$837, DW_AT_accessibility(DW_ACCESS_public)
    7013              $C$DW$838       .dwtag  DW_TAG_member
    7014                      .dwattr $C$DW$838, DW_AT_type(*$C$DW$T$89)
    7015                      .dwattr $C$DW$838, DW_AT_name("FSM_Trans")
    7016                      .dwattr $C$DW$838, DW_AT_TI_symbol_name("_FSM_Trans")
    7017                      .dwattr $C$DW$838, DW_AT_data_member_location[DW_OP_plus_uconst 0xb]
    7018                      .dwattr $C$DW$838, DW_AT_accessibility(DW_ACCESS_public)
    7019              $C$DW$839       .dwtag  DW_TAG_member
    7020                      .dwattr $C$DW$839, DW_AT_type(*$C$DW$T$91)
    7021                      .dwattr $C$DW$839, DW_AT_name("FSM_Event")
    7022                      .dwattr $C$DW$839, DW_AT_TI_symbol_name("_FSM_Event")
    7023                      .dwattr $C$DW$839, DW_AT_data_member_location[DW_OP_plus_uconst 0xc]
    7024                      .dwattr $C$DW$839, DW_AT_accessibility(DW_ACCESS_public)
    7025              $C$DW$840       .dwtag  DW_TAG_member
    7026                      .dwattr $C$DW$840, DW_AT_type(*$C$DW$T$93)
    7027                      .dwattr $C$DW$840, DW_AT_name("FSM_StMode")
    7028                      .dwattr $C$DW$840, DW_AT_TI_symbol_name("_FSM_StMode")
    7029                      .dwattr $C$DW$840, DW_AT_data_member_location[DW_OP_plus_uconst 0xd]
    7030                      .dwattr $C$DW$840, DW_AT_accessibility(DW_ACCESS_public)
    7031              $C$DW$841       .dwtag  DW_TAG_member
    7032                      .dwattr $C$DW$841, DW_AT_type(*$C$DW$T$34)
    7033                      .dwattr $C$DW$841, DW_AT_name("Accele_Polar")
    7034                      .dwattr $C$DW$841, DW_AT_TI_symbol_name("_Accele_Polar")
    7035                      .dwattr $C$DW$841, DW_AT_data_member_location[DW_OP_plus_uconst 0xe]
    7036                      .dwattr $C$DW$841, DW_AT_accessibility(DW_ACCESS_public)
    7037              $C$DW$842       .dwtag  DW_TAG_member
    7038                      .dwattr $C$DW$842, DW_AT_type(*$C$DW$T$32)
    7039                      .dwattr $C$DW$842, DW_AT_name("Sensor0_Value")
    7040                      .dwattr $C$DW$842, DW_AT_TI_symbol_name("_Sensor0_Value")
    7041                      .dwattr $C$DW$842, DW_AT_data_member_location[DW_OP_plus_uconst 0x10]
    7042                      .dwattr $C$DW$842, DW_AT_accessibility(DW_ACCESS_public)
    7043              $C$DW$843       .dwtag  DW_TAG_member
    7044                      .dwattr $C$DW$843, DW_AT_type(*$C$DW$T$32)
    7045                      .dwattr $C$DW$843, DW_AT_name("Sensor1_Value")
    7046                      .dwattr $C$DW$843, DW_AT_TI_symbol_name("_Sensor1_Value")
    7047                      .dwattr $C$DW$843, DW_AT_data_member_location[DW_OP_plus_uconst 0x12]
    7048                      .dwattr $C$DW$843, DW_AT_accessibility(DW_ACCESS_public)
    7049              $C$DW$844       .dwtag  DW_TAG_member
    7050                      .dwattr $C$DW$844, DW_AT_type(*$C$DW$T$23)
    7051                      .dwattr $C$DW$844, DW_AT_name("Motor_runTime")
    7052                      .dwattr $C$DW$844, DW_AT_TI_symbol_name("_Motor_runTime")
    7053                      .dwattr $C$DW$844, DW_AT_data_member_location[DW_OP_plus_uconst 0x14]
    7054                      .dwattr $C$DW$844, DW_AT_accessibility(DW_ACCESS_public)
    7055              $C$DW$845       .dwtag  DW_TAG_member
    7056                      .dwattr $C$DW$845, DW_AT_type(*$C$DW$T$34)
TMS320C2000 Assembler PC v6.2.5 Sun Oct 08 22:38:21 2017

Tools Copyright (c) 1996-2014 Texas Instruments Incorporated
C:\Users\wmj\AppData\Local\Temp\0856412                              PAGE  135

    7057                      .dwattr $C$DW$845, DW_AT_name("Flag_485StartMotor")
    7058                      .dwattr $C$DW$845, DW_AT_TI_symbol_name("_Flag_485StartMotor")
    7059                      .dwattr $C$DW$845, DW_AT_data_member_location[DW_OP_plus_uconst 0x15]
    7060                      .dwattr $C$DW$845, DW_AT_accessibility(DW_ACCESS_public)
    7061              $C$DW$846       .dwtag  DW_TAG_member
    7062                      .dwattr $C$DW$846, DW_AT_type(*$C$DW$T$34)
    7063                      .dwattr $C$DW$846, DW_AT_name("runTime_Enable")
    7064                      .dwattr $C$DW$846, DW_AT_TI_symbol_name("_runTime_Enable")
    7065                      .dwattr $C$DW$846, DW_AT_data_member_location[DW_OP_plus_uconst 0x16]
    7066                      .dwattr $C$DW$846, DW_AT_accessibility(DW_ACCESS_public)
    7067              $C$DW$847       .dwtag  DW_TAG_member
    7068                      .dwattr $C$DW$847, DW_AT_type(*$C$DW$T$34)
    7069                      .dwattr $C$DW$847, DW_AT_name("Ext_Int_Flag")
    7070                      .dwattr $C$DW$847, DW_AT_TI_symbol_name("_Ext_Int_Flag")
    7071                      .dwattr $C$DW$847, DW_AT_data_member_location[DW_OP_plus_uconst 0x17]
    7072                      .dwattr $C$DW$847, DW_AT_accessibility(DW_ACCESS_public)
    7073              $C$DW$848       .dwtag  DW_TAG_member
    7074                      .dwattr $C$DW$848, DW_AT_type(*$C$DW$T$34)
    7075                      .dwattr $C$DW$848, DW_AT_name("FSM_Enable")
    7076                      .dwattr $C$DW$848, DW_AT_TI_symbol_name("_FSM_Enable")
    7077                      .dwattr $C$DW$848, DW_AT_data_member_location[DW_OP_plus_uconst 0x18]
    7078                      .dwattr $C$DW$848, DW_AT_accessibility(DW_ACCESS_public)
    7079                      .dwendtag $C$DW$T$94
    7080              
    7081              $C$DW$T$187     .dwtag  DW_TAG_typedef, DW_AT_name("FSM_Obj")
    7082                      .dwattr $C$DW$T$187, DW_AT_type(*$C$DW$T$94)
