TMS320C2000 Assembler PC v6.2.5 Sat Sep 16 15:51:25 2017

Tools Copyright (c) 1996-2014 Texas Instruments Incorporated
C:\Users\wmj\AppData\Local\Temp\1710810                              PAGE    1

       1              ;***************************************************************
       2              ;* TMS320C2000 C/C++ Codegen                         PC v6.2.5 *
       3              ;* Date/Time created: Sat Sep 16 15:51:24 2017                 *
       4              ;***************************************************************
       5                      .compiler_opts --float_support=softlib --hll_source=on --mem_model:code=flat --mem_model:data=large -
       6        0002  FP      .set    XAR2
       7              
       8              $C$DW$CU        .dwtag  DW_TAG_compile_unit
       9                      .dwattr $C$DW$CU, DW_AT_name("D:/BM1000/sw/solutions/instaspin_foc/src/proj_lab05b.c")
      10                      .dwattr $C$DW$CU, DW_AT_producer("TMS320C2000 C/C++ Codegen PC v6.2.5 Copyright (c) 1996-2014 Texas I
      11                      .dwattr $C$DW$CU, DW_AT_TI_version(0x01)
      12                      .dwattr $C$DW$CU, DW_AT_comp_dir("D:\BM1000\sw\solutions\instaspin_foc\boards\hvkit_rev1p1\f28x\f2802
      13              ;**************************************************************
      14              ;* CINIT RECORDS                                              *

    3906                      .dwattr $C$DW$T$279, DW_AT_byte_size(0x01)
    3907              $C$DW$594       .dwtag  DW_TAG_enumerator, DW_AT_name("PIE_GroupNumber_1"), DW_AT_const_value(0x00)
    3908              $C$DW$595       .dwtag  DW_TAG_enumerator, DW_AT_name("PIE_GroupNumber_2"), DW_AT_const_value(0x01)
    3909              $C$DW$596       .dwtag  DW_TAG_enumerator, DW_AT_name("PIE_GroupNumber_3"), DW_AT_const_value(0x02)
    3910              $C$DW$597       .dwtag  DW_TAG_enumerator, DW_AT_name("PIE_GroupNumber_4"), DW_AT_const_value(0x03)
    3911              $C$DW$598       .dwtag  DW_TAG_enumerator, DW_AT_name("PIE_GroupNumber_5"), DW_AT_const_value(0x04)
    3912              $C$DW$599       .dwtag  DW_TAG_enumerator, DW_AT_name("PIE_GroupNumber_6"), DW_AT_const_value(0x05)
    3913              $C$DW$600       .dwtag  DW_TAG_enumerator, DW_AT_name("PIE_GroupNumber_7"), DW_AT_const_value(0x06)
    3914              $C$DW$601       .dwtag  DW_TAG_enumerator, DW_AT_name("PIE_GroupNumber_8"), DW_AT_const_value(0x07)
    3915              $C$DW$602       .dwtag  DW_TAG_enumerator, DW_AT_name("PIE_GroupNumber_9"), DW_AT_const_value(0x08)
    3916              $C$DW$603       .dwtag  DW_TAG_enumerator, DW_AT_name("PIE_GroupNumber_10"), DW_AT_const_value(0x09)
    3917              $C$DW$604       .dwtag  DW_TAG_enumerator, DW_AT_name("PIE_GroupNumber_11"), DW_AT_const_value(0x0a)
    3918              $C$DW$605       .dwtag  DW_TAG_enumerator, DW_AT_name("PIE_GroupNumber_12"), DW_AT_const_value(0x0b)
    3919                      .dwendtag $C$DW$T$279
TMS320C2000 Assembler PC v6.2.5 Sat Sep 16 15:51:25 2017

Tools Copyright (c) 1996-2014 Texas Instruments Incorporated
C:\Users\wmj\AppData\Local\Temp\1710810                              PAGE   78

    3920              
    3921              $C$DW$T$280     .dwtag  DW_TAG_typedef, DW_AT_name("PIE_GroupNumber_e")
    3922                      .dwattr $C$DW$T$280, DW_AT_type(*$C$DW$T$279)
    3923                      .dwattr $C$DW$T$280, DW_AT_language(DW_LANG_C)
    3924              
    3925              $C$DW$T$282     .dwtag  DW_TAG_enumeration_type
    3926                      .dwattr $C$DW$T$282, DW_AT_byte_size(0x01)
    3927              $C$DW$606       .dwtag  DW_TAG_enumerator, DW_AT_name("CTRL_Type_PID_spd"), DW_AT_const_value(0x00)
    3928              $C$DW$607       .dwtag  DW_TAG_enumerator, DW_AT_name("CTRL_Type_PID_Id"), DW_AT_const_value(0x01)
    3929              $C$DW$608       .dwtag  DW_TAG_enumerator, DW_AT_name("CTRL_Type_PID_Iq"), DW_AT_const_value(0x02)
    3930                      .dwendtag $C$DW$T$282
    3931              
    3932              $C$DW$T$283     .dwtag  DW_TAG_typedef, DW_AT_name("CTRL_Type_e")
    3933                      .dwattr $C$DW$T$283, DW_AT_type(*$C$DW$T$282)
    3934                      .dwattr $C$DW$T$283, DW_AT_language(DW_LANG_C)
    3935              
    3936              $C$DW$T$285     .dwtag  DW_TAG_enumeration_type
    3937                      .dwattr $C$DW$T$285, DW_AT_byte_size(0x01)
    3938              $C$DW$609       .dwtag  DW_TAG_enumerator, DW_AT_name("HAL_SensorType_Current"), DW_AT_const_value(0x00)
    3939              $C$DW$610       .dwtag  DW_TAG_enumerator, DW_AT_name("HAL_SensorType_Voltage"), DW_AT_const_value(0x01)
    3940                      .dwendtag $C$DW$T$285
    3941              
    3942              $C$DW$T$286     .dwtag  DW_TAG_typedef, DW_AT_name("HAL_SensorType_e")
    3943                      .dwattr $C$DW$T$286, DW_AT_type(*$C$DW$T$285)
    3944                      .dwattr $C$DW$T$286, DW_AT_language(DW_LANG_C)
    3945              
    3946              $C$DW$T$19      .dwtag  DW_TAG_structure_type
    3947                      .dwattr $C$DW$T$19, DW_AT_name("I2C_Obj")
    3948                      .dwattr $C$DW$T$19, DW_AT_declaration
    3949                      .dwendtag $C$DW$T$19
    3950              
    3951              $C$DW$T$120     .dwtag  DW_TAG_pointer_type
    3952                      .dwattr $C$DW$T$120, DW_AT_type(*$C$DW$T$19)
    3953                      .dwattr $C$DW$T$120, DW_AT_address_class(0x16)
    3954              $C$DW$T$121     .dwtag  DW_TAG_typedef, DW_AT_name("I2C_Handle")
    3955                      .dwattr $C$DW$T$121, DW_AT_type(*$C$DW$T$120)
    3956                      .dwattr $C$DW$T$121, DW_AT_language(DW_LANG_C)
    3957              
    3958              $C$DW$T$20      .dwtag  DW_TAG_structure_type
    3959                      .dwattr $C$DW$T$20, DW_AT_name("LDC161x_REG_Obj")
    3960                      .dwattr $C$DW$T$20, DW_AT_declaration
    3961                      .dwendtag $C$DW$T$20
    3962              
    3963              $C$DW$T$139     .dwtag  DW_TAG_pointer_type
    3964                      .dwattr $C$DW$T$139, DW_AT_type(*$C$DW$T$20)
    3965                      .dwattr $C$DW$T$139, DW_AT_address_class(0x16)
    3966              $C$DW$T$140     .dwtag  DW_TAG_typedef, DW_AT_name("LDC_Handle")
    3967                      .dwattr $C$DW$T$140, DW_AT_type(*$C$DW$T$139)
    3968                      .dwattr $C$DW$T$140, DW_AT_language(DW_LANG_C)
    3969              
    3970              $C$DW$T$32      .dwtag  DW_TAG_structure_type
    3971                      .dwattr $C$DW$T$32, DW_AT_name("_ADC_Obj_")
    3972                      .dwattr $C$DW$T$32, DW_AT_byte_size(0x6650)
    3973              $C$DW$611       .dwtag  DW_TAG_member
    3974                      .dwattr $C$DW$611, DW_AT_type(*$C$DW$T$26)
TMS320C2000 Assembler PC v6.2.5 Sat Sep 16 15:51:25 2017

Tools Copyright (c) 1996-2014 Texas Instruments Incorporated
C:\Users\wmj\AppData\Local\Temp\1710810                              PAGE   79

    3975                      .dwattr $C$DW$611, DW_AT_name("ADCRESULT")
    3976                      .dwattr $C$DW$611, DW_AT_TI_symbol_name("_ADCRESULT")
    3977                      .dwattr $C$DW$611, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    3978                      .dwattr $C$DW$611, DW_AT_accessibility(DW_ACCESS_public)
    3979              $C$DW$612       .dwtag  DW_TAG_member
    3980                      .dwattr $C$DW$612, DW_AT_type(*$C$DW$T$27)
    3981                      .dwattr $C$DW$612, DW_AT_name("resvd_1")
    3982                      .dwattr $C$DW$612, DW_AT_TI_symbol_name("_resvd_1")
    3983                      .dwattr $C$DW$612, DW_AT_data_member_location[DW_OP_plus_uconst 0x10]
    3984                      .dwattr $C$DW$612, DW_AT_accessibility(DW_ACCESS_public)
    3985              $C$DW$613       .dwtag  DW_TAG_member
    3986                      .dwattr $C$DW$613, DW_AT_type(*$C$DW$T$25)
    3987                      .dwattr $C$DW$613, DW_AT_name("ADCCTL1")
    3988                      .dwattr $C$DW$613, DW_AT_TI_symbol_name("_ADCCTL1")
    3989                      .dwattr $C$DW$613, DW_AT_data_member_location[DW_OP_plus_uconst 0x6600]
    3990                      .dwattr $C$DW$613, DW_AT_accessibility(DW_ACCESS_public)
    3991              $C$DW$614       .dwtag  DW_TAG_member
    3992                      .dwattr $C$DW$614, DW_AT_type(*$C$DW$T$25)
    3993                      .dwattr $C$DW$614, DW_AT_name("ADCCTL2")
    3994                      .dwattr $C$DW$614, DW_AT_TI_symbol_name("_ADCCTL2")
    3995                      .dwattr $C$DW$614, DW_AT_data_member_location[DW_OP_plus_uconst 0x6601]
    3996                      .dwattr $C$DW$614, DW_AT_accessibility(DW_ACCESS_public)
    3997              $C$DW$615       .dwtag  DW_TAG_member
    3998                      .dwattr $C$DW$615, DW_AT_type(*$C$DW$T$28)
    3999                      .dwattr $C$DW$615, DW_AT_name("rsvd_2")
    4000                      .dwattr $C$DW$615, DW_AT_TI_symbol_name("_rsvd_2")
    4001                      .dwattr $C$DW$615, DW_AT_data_member_location[DW_OP_plus_uconst 0x6602]
    4002                      .dwattr $C$DW$615, DW_AT_accessibility(DW_ACCESS_public)
    4003              $C$DW$616       .dwtag  DW_TAG_member
    4004                      .dwattr $C$DW$616, DW_AT_type(*$C$DW$T$25)
    4005                      .dwattr $C$DW$616, DW_AT_name("ADCINTFLG")
    4006                      .dwattr $C$DW$616, DW_AT_TI_symbol_name("_ADCINTFLG")
    4007                      .dwattr $C$DW$616, DW_AT_data_member_location[DW_OP_plus_uconst 0x6604]
    4008                      .dwattr $C$DW$616, DW_AT_accessibility(DW_ACCESS_public)
    4009              $C$DW$617       .dwtag  DW_TAG_member
    4010                      .dwattr $C$DW$617, DW_AT_type(*$C$DW$T$25)
    4011                      .dwattr $C$DW$617, DW_AT_name("ADCINTFLGCLR")
    4012                      .dwattr $C$DW$617, DW_AT_TI_symbol_name("_ADCINTFLGCLR")
    4013                      .dwattr $C$DW$617, DW_AT_data_member_location[DW_OP_plus_uconst 0x6605]
    4014                      .dwattr $C$DW$617, DW_AT_accessibility(DW_ACCESS_public)
    4015              $C$DW$618       .dwtag  DW_TAG_member
    4016                      .dwattr $C$DW$618, DW_AT_type(*$C$DW$T$25)
    4017                      .dwattr $C$DW$618, DW_AT_name("ADCINTOVF")
    4018                      .dwattr $C$DW$618, DW_AT_TI_symbol_name("_ADCINTOVF")
    4019                      .dwattr $C$DW$618, DW_AT_data_member_location[DW_OP_plus_uconst 0x6606]
    4020                      .dwattr $C$DW$618, DW_AT_accessibility(DW_ACCESS_public)
    4021              $C$DW$619       .dwtag  DW_TAG_member
    4022                      .dwattr $C$DW$619, DW_AT_type(*$C$DW$T$25)
    4023                      .dwattr $C$DW$619, DW_AT_name("ADCINTOVFCLR")
    4024                      .dwattr $C$DW$619, DW_AT_TI_symbol_name("_ADCINTOVFCLR")
    4025                      .dwattr $C$DW$619, DW_AT_data_member_location[DW_OP_plus_uconst 0x6607]
    4026                      .dwattr $C$DW$619, DW_AT_accessibility(DW_ACCESS_public)
    4027              $C$DW$620       .dwtag  DW_TAG_member
    4028                      .dwattr $C$DW$620, DW_AT_type(*$C$DW$T$29)
    4029                      .dwattr $C$DW$620, DW_AT_name("INTSELxNy")
TMS320C2000 Assembler PC v6.2.5 Sat Sep 16 15:51:25 2017

Tools Copyright (c) 1996-2014 Texas Instruments Incorporated
C:\Users\wmj\AppData\Local\Temp\1710810                              PAGE   80

    4030                      .dwattr $C$DW$620, DW_AT_TI_symbol_name("_INTSELxNy")
    4031                      .dwattr $C$DW$620, DW_AT_data_member_location[DW_OP_plus_uconst 0x6608]
    4032                      .dwattr $C$DW$620, DW_AT_accessibility(DW_ACCESS_public)
    4033              $C$DW$621       .dwtag  DW_TAG_member
    4034                      .dwattr $C$DW$621, DW_AT_type(*$C$DW$T$30)
    4035                      .dwattr $C$DW$621, DW_AT_name("rsvd_3")
    4036                      .dwattr $C$DW$621, DW_AT_TI_symbol_name("_rsvd_3")
    4037                      .dwattr $C$DW$621, DW_AT_data_member_location[DW_OP_plus_uconst 0x660d]
    4038                      .dwattr $C$DW$621, DW_AT_accessibility(DW_ACCESS_public)
    4039              $C$DW$622       .dwtag  DW_TAG_member
    4040                      .dwattr $C$DW$622, DW_AT_type(*$C$DW$T$25)
    4041                      .dwattr $C$DW$622, DW_AT_name("SOCPRICTRL")
    4042                      .dwattr $C$DW$622, DW_AT_TI_symbol_name("_SOCPRICTRL")
    4043                      .dwattr $C$DW$622, DW_AT_data_member_location[DW_OP_plus_uconst 0x6610]
    4044                      .dwattr $C$DW$622, DW_AT_accessibility(DW_ACCESS_public)
    4045              $C$DW$623       .dwtag  DW_TAG_member
    4046                      .dwattr $C$DW$623, DW_AT_type(*$C$DW$T$25)
    4047                      .dwattr $C$DW$623, DW_AT_name("rsvd_4")
    4048                      .dwattr $C$DW$623, DW_AT_TI_symbol_name("_rsvd_4")
    4049                      .dwattr $C$DW$623, DW_AT_data_member_location[DW_OP_plus_uconst 0x6611]
    4050                      .dwattr $C$DW$623, DW_AT_accessibility(DW_ACCESS_public)
    4051              $C$DW$624       .dwtag  DW_TAG_member
    4052                      .dwattr $C$DW$624, DW_AT_type(*$C$DW$T$25)
    4053                      .dwattr $C$DW$624, DW_AT_name("ADCSAMPLEMODE")
    4054                      .dwattr $C$DW$624, DW_AT_TI_symbol_name("_ADCSAMPLEMODE")
    4055                      .dwattr $C$DW$624, DW_AT_data_member_location[DW_OP_plus_uconst 0x6612]
    4056                      .dwattr $C$DW$624, DW_AT_accessibility(DW_ACCESS_public)
    4057              $C$DW$625       .dwtag  DW_TAG_member
    4058                      .dwattr $C$DW$625, DW_AT_type(*$C$DW$T$25)
    4059                      .dwattr $C$DW$625, DW_AT_name("rsvd_5")
    4060                      .dwattr $C$DW$625, DW_AT_TI_symbol_name("_rsvd_5")
    4061                      .dwattr $C$DW$625, DW_AT_data_member_location[DW_OP_plus_uconst 0x6613]
    4062                      .dwattr $C$DW$625, DW_AT_accessibility(DW_ACCESS_public)
    4063              $C$DW$626       .dwtag  DW_TAG_member
    4064                      .dwattr $C$DW$626, DW_AT_type(*$C$DW$T$25)
    4065                      .dwattr $C$DW$626, DW_AT_name("ADCINTSOCSEL1")
    4066                      .dwattr $C$DW$626, DW_AT_TI_symbol_name("_ADCINTSOCSEL1")
    4067                      .dwattr $C$DW$626, DW_AT_data_member_location[DW_OP_plus_uconst 0x6614]
    4068                      .dwattr $C$DW$626, DW_AT_accessibility(DW_ACCESS_public)
    4069              $C$DW$627       .dwtag  DW_TAG_member
    4070                      .dwattr $C$DW$627, DW_AT_type(*$C$DW$T$25)
    4071                      .dwattr $C$DW$627, DW_AT_name("ADCINTSOCSEL2")
    4072                      .dwattr $C$DW$627, DW_AT_TI_symbol_name("_ADCINTSOCSEL2")
    4073                      .dwattr $C$DW$627, DW_AT_data_member_location[DW_OP_plus_uconst 0x6615]
    4074                      .dwattr $C$DW$627, DW_AT_accessibility(DW_ACCESS_public)
    4075              $C$DW$628       .dwtag  DW_TAG_member
    4076                      .dwattr $C$DW$628, DW_AT_type(*$C$DW$T$28)
    4077                      .dwattr $C$DW$628, DW_AT_name("rsvd_6")
    4078                      .dwattr $C$DW$628, DW_AT_TI_symbol_name("_rsvd_6")
    4079                      .dwattr $C$DW$628, DW_AT_data_member_location[DW_OP_plus_uconst 0x6616]
    4080                      .dwattr $C$DW$628, DW_AT_accessibility(DW_ACCESS_public)
    4081              $C$DW$629       .dwtag  DW_TAG_member
    4082                      .dwattr $C$DW$629, DW_AT_type(*$C$DW$T$25)
    4083                      .dwattr $C$DW$629, DW_AT_name("ADCSOCFLG1")
    4084                      .dwattr $C$DW$629, DW_AT_TI_symbol_name("_ADCSOCFLG1")
TMS320C2000 Assembler PC v6.2.5 Sat Sep 16 15:51:25 2017

Tools Copyright (c) 1996-2014 Texas Instruments Incorporated
C:\Users\wmj\AppData\Local\Temp\1710810                              PAGE   81

    4085                      .dwattr $C$DW$629, DW_AT_data_member_location[DW_OP_plus_uconst 0x6618]
    4086                      .dwattr $C$DW$629, DW_AT_accessibility(DW_ACCESS_public)
    4087              $C$DW$630       .dwtag  DW_TAG_member
    4088                      .dwattr $C$DW$630, DW_AT_type(*$C$DW$T$25)
    4089                      .dwattr $C$DW$630, DW_AT_name("rsvd_7")
    4090                      .dwattr $C$DW$630, DW_AT_TI_symbol_name("_rsvd_7")
    4091                      .dwattr $C$DW$630, DW_AT_data_member_location[DW_OP_plus_uconst 0x6619]
    4092                      .dwattr $C$DW$630, DW_AT_accessibility(DW_ACCESS_public)
    4093              $C$DW$631       .dwtag  DW_TAG_member
    4094                      .dwattr $C$DW$631, DW_AT_type(*$C$DW$T$25)
    4095                      .dwattr $C$DW$631, DW_AT_name("ADCSOCFRC1")
    4096                      .dwattr $C$DW$631, DW_AT_TI_symbol_name("_ADCSOCFRC1")
    4097                      .dwattr $C$DW$631, DW_AT_data_member_location[DW_OP_plus_uconst 0x661a]
    4098                      .dwattr $C$DW$631, DW_AT_accessibility(DW_ACCESS_public)
    4099              $C$DW$632       .dwtag  DW_TAG_member
    4100                      .dwattr $C$DW$632, DW_AT_type(*$C$DW$T$25)
    4101                      .dwattr $C$DW$632, DW_AT_name("rsvd_8")
    4102                      .dwattr $C$DW$632, DW_AT_TI_symbol_name("_rsvd_8")
    4103                      .dwattr $C$DW$632, DW_AT_data_member_location[DW_OP_plus_uconst 0x661b]
    4104                      .dwattr $C$DW$632, DW_AT_accessibility(DW_ACCESS_public)
    4105              $C$DW$633       .dwtag  DW_TAG_member
    4106                      .dwattr $C$DW$633, DW_AT_type(*$C$DW$T$25)
    4107                      .dwattr $C$DW$633, DW_AT_name("ADCSOCOVF1")
    4108                      .dwattr $C$DW$633, DW_AT_TI_symbol_name("_ADCSOCOVF1")
    4109                      .dwattr $C$DW$633, DW_AT_data_member_location[DW_OP_plus_uconst 0x661c]
    4110                      .dwattr $C$DW$633, DW_AT_accessibility(DW_ACCESS_public)
    4111              $C$DW$634       .dwtag  DW_TAG_member
    4112                      .dwattr $C$DW$634, DW_AT_type(*$C$DW$T$25)
    4113                      .dwattr $C$DW$634, DW_AT_name("rsvd_9")
    4114                      .dwattr $C$DW$634, DW_AT_TI_symbol_name("_rsvd_9")
    4115                      .dwattr $C$DW$634, DW_AT_data_member_location[DW_OP_plus_uconst 0x661d]
    4116                      .dwattr $C$DW$634, DW_AT_accessibility(DW_ACCESS_public)
    4117              $C$DW$635       .dwtag  DW_TAG_member
    4118                      .dwattr $C$DW$635, DW_AT_type(*$C$DW$T$25)
    4119                      .dwattr $C$DW$635, DW_AT_name("ADCSOCOVFCLR1")
    4120                      .dwattr $C$DW$635, DW_AT_TI_symbol_name("_ADCSOCOVFCLR1")
    4121                      .dwattr $C$DW$635, DW_AT_data_member_location[DW_OP_plus_uconst 0x661e]
    4122                      .dwattr $C$DW$635, DW_AT_accessibility(DW_ACCESS_public)
    4123              $C$DW$636       .dwtag  DW_TAG_member
    4124                      .dwattr $C$DW$636, DW_AT_type(*$C$DW$T$25)
    4125                      .dwattr $C$DW$636, DW_AT_name("rsvd_10")
    4126                      .dwattr $C$DW$636, DW_AT_TI_symbol_name("_rsvd_10")
    4127                      .dwattr $C$DW$636, DW_AT_data_member_location[DW_OP_plus_uconst 0x661f]
    4128                      .dwattr $C$DW$636, DW_AT_accessibility(DW_ACCESS_public)
    4129              $C$DW$637       .dwtag  DW_TAG_member
    4130                      .dwattr $C$DW$637, DW_AT_type(*$C$DW$T$26)
    4131                      .dwattr $C$DW$637, DW_AT_name("ADCSOCxCTL")
    4132                      .dwattr $C$DW$637, DW_AT_TI_symbol_name("_ADCSOCxCTL")
    4133                      .dwattr $C$DW$637, DW_AT_data_member_location[DW_OP_plus_uconst 0x6620]
    4134                      .dwattr $C$DW$637, DW_AT_accessibility(DW_ACCESS_public)
    4135              $C$DW$638       .dwtag  DW_TAG_member
    4136                      .dwattr $C$DW$638, DW_AT_type(*$C$DW$T$26)
    4137                      .dwattr $C$DW$638, DW_AT_name("rsvd_11")
    4138                      .dwattr $C$DW$638, DW_AT_TI_symbol_name("_rsvd_11")
    4139                      .dwattr $C$DW$638, DW_AT_data_member_location[DW_OP_plus_uconst 0x6630]
TMS320C2000 Assembler PC v6.2.5 Sat Sep 16 15:51:25 2017

Tools Copyright (c) 1996-2014 Texas Instruments Incorporated
C:\Users\wmj\AppData\Local\Temp\1710810                              PAGE   82

    4140                      .dwattr $C$DW$638, DW_AT_accessibility(DW_ACCESS_public)
    4141              $C$DW$639       .dwtag  DW_TAG_member
    4142                      .dwattr $C$DW$639, DW_AT_type(*$C$DW$T$25)
    4143                      .dwattr $C$DW$639, DW_AT_name("ADCREFTRIM")
    4144                      .dwattr $C$DW$639, DW_AT_TI_symbol_name("_ADCREFTRIM")
    4145                      .dwattr $C$DW$639, DW_AT_data_member_location[DW_OP_plus_uconst 0x6640]
    4146                      .dwattr $C$DW$639, DW_AT_accessibility(DW_ACCESS_public)
    4147              $C$DW$640       .dwtag  DW_TAG_member
    4148                      .dwattr $C$DW$640, DW_AT_type(*$C$DW$T$25)
    4149                      .dwattr $C$DW$640, DW_AT_name("ADCOFFTRIM")
    4150                      .dwattr $C$DW$640, DW_AT_TI_symbol_name("_ADCOFFTRIM")
    4151                      .dwattr $C$DW$640, DW_AT_data_member_location[DW_OP_plus_uconst 0x6641]
    4152                      .dwattr $C$DW$640, DW_AT_accessibility(DW_ACCESS_public)
    4153              $C$DW$641       .dwtag  DW_TAG_member
    4154                      .dwattr $C$DW$641, DW_AT_type(*$C$DW$T$31)
    4155                      .dwattr $C$DW$641, DW_AT_name("resvd_12")
    4156                      .dwattr $C$DW$641, DW_AT_TI_symbol_name("_resvd_12")
    4157                      .dwattr $C$DW$641, DW_AT_data_member_location[DW_OP_plus_uconst 0x6642]
    4158                      .dwattr $C$DW$641, DW_AT_accessibility(DW_ACCESS_public)
    4159              $C$DW$642       .dwtag  DW_TAG_member
    4160                      .dwattr $C$DW$642, DW_AT_type(*$C$DW$T$25)
    4161                      .dwattr $C$DW$642, DW_AT_name("ADCREV")
    4162                      .dwattr $C$DW$642, DW_AT_TI_symbol_name("_ADCREV")
    4163                      .dwattr $C$DW$642, DW_AT_data_member_location[DW_OP_plus_uconst 0x664f]
    4164                      .dwattr $C$DW$642, DW_AT_accessibility(DW_ACCESS_public)
    4165                      .dwendtag $C$DW$T$32
    4166              
    4167              $C$DW$T$288     .dwtag  DW_TAG_typedef, DW_AT_name("ADC_Obj")
    4168                      .dwattr $C$DW$T$288, DW_AT_type(*$C$DW$T$32)
    4169                      .dwattr $C$DW$T$288, DW_AT_language(DW_LANG_C)
    4170              $C$DW$T$93      .dwtag  DW_TAG_pointer_type
    4171                      .dwattr $C$DW$T$93, DW_AT_type(*$C$DW$T$32)
    4172                      .dwattr $C$DW$T$93, DW_AT_address_class(0x16)
    4173              $C$DW$T$94      .dwtag  DW_TAG_typedef, DW_AT_name("ADC_Handle")
    4174                      .dwattr $C$DW$T$94, DW_AT_type(*$C$DW$T$93)
    4175                      .dwattr $C$DW$T$94, DW_AT_language(DW_LANG_C)
    4176              
    4177              $C$DW$T$35      .dwtag  DW_TAG_structure_type
    4178                      .dwattr $C$DW$T$35, DW_AT_name("_CLARKE_Obj_")
    4179                      .dwattr $C$DW$T$35, DW_AT_byte_size(0x06)
    4180              $C$DW$643       .dwtag  DW_TAG_member
    4181                      .dwattr $C$DW$643, DW_AT_type(*$C$DW$T$33)
    4182                      .dwattr $C$DW$643, DW_AT_name("alpha_sf")
    4183                      .dwattr $C$DW$643, DW_AT_TI_symbol_name("_alpha_sf")
    4184                      .dwattr $C$DW$643, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    4185                      .dwattr $C$DW$643, DW_AT_accessibility(DW_ACCESS_public)
    4186              $C$DW$644       .dwtag  DW_TAG_member
    4187                      .dwattr $C$DW$644, DW_AT_type(*$C$DW$T$33)
    4188                      .dwattr $C$DW$644, DW_AT_name("beta_sf")
    4189                      .dwattr $C$DW$644, DW_AT_TI_symbol_name("_beta_sf")
    4190                      .dwattr $C$DW$644, DW_AT_data_member_location[DW_OP_plus_uconst 0x2]
    4191                      .dwattr $C$DW$644, DW_AT_accessibility(DW_ACCESS_public)
    4192              $C$DW$645       .dwtag  DW_TAG_member
    4193                      .dwattr $C$DW$645, DW_AT_type(*$C$DW$T$34)
    4194                      .dwattr $C$DW$645, DW_AT_name("numSensors")
TMS320C2000 Assembler PC v6.2.5 Sat Sep 16 15:51:25 2017

Tools Copyright (c) 1996-2014 Texas Instruments Incorporated
C:\Users\wmj\AppData\Local\Temp\1710810                              PAGE   83

    4195                      .dwattr $C$DW$645, DW_AT_TI_symbol_name("_numSensors")
    4196                      .dwattr $C$DW$645, DW_AT_data_member_location[DW_OP_plus_uconst 0x4]
    4197                      .dwattr $C$DW$645, DW_AT_accessibility(DW_ACCESS_public)
    4198                      .dwendtag $C$DW$T$35
    4199              
    4200              $C$DW$T$47      .dwtag  DW_TAG_typedef, DW_AT_name("CLARKE_Obj")
    4201                      .dwattr $C$DW$T$47, DW_AT_type(*$C$DW$T$35)
    4202                      .dwattr $C$DW$T$47, DW_AT_language(DW_LANG_C)
    4203              $C$DW$T$45      .dwtag  DW_TAG_pointer_type
    4204                      .dwattr $C$DW$T$45, DW_AT_type(*$C$DW$T$35)
    4205                      .dwattr $C$DW$T$45, DW_AT_address_class(0x16)
    4206              $C$DW$T$46      .dwtag  DW_TAG_typedef, DW_AT_name("CLARKE_Handle")
    4207                      .dwattr $C$DW$T$46, DW_AT_type(*$C$DW$T$45)
    4208                      .dwattr $C$DW$T$46, DW_AT_language(DW_LANG_C)
    4209              
    4210              $C$DW$T$36      .dwtag  DW_TAG_structure_type
    4211                      .dwattr $C$DW$T$36, DW_AT_name("_CLK_DIV_t_")
    4212                      .dwattr $C$DW$T$36, DW_AT_byte_size(0x02)
    4213              $C$DW$646       .dwtag  DW_TAG_member
    4214                      .dwattr $C$DW$646, DW_AT_type(*$C$DW$T$24)
    4215                      .dwattr $C$DW$646, DW_AT_name("FREF_DIVIDER")
    4216                      .dwattr $C$DW$646, DW_AT_TI_symbol_name("_FREF_DIVIDER")
    4217                      .dwattr $C$DW$646, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    4218                      .dwattr $C$DW$646, DW_AT_accessibility(DW_ACCESS_public)
    4219              $C$DW$647       .dwtag  DW_TAG_member
    4220                      .dwattr $C$DW$647, DW_AT_type(*$C$DW$T$24)
    4221                      .dwattr $C$DW$647, DW_AT_name("FIN_DIVIDER")
    4222                      .dwattr $C$DW$647, DW_AT_TI_symbol_name("_FIN_DIVIDER")
    4223                      .dwattr $C$DW$647, DW_AT_data_member_location[DW_OP_plus_uconst 0x1]
    4224                      .dwattr $C$DW$647, DW_AT_accessibility(DW_ACCESS_public)
    4225                      .dwendtag $C$DW$T$36
    4226              
    4227              $C$DW$T$133     .dwtag  DW_TAG_typedef, DW_AT_name("CLK_DIV_t_")
    4228                      .dwattr $C$DW$T$133, DW_AT_type(*$C$DW$T$36)
    4229                      .dwattr $C$DW$T$133, DW_AT_language(DW_LANG_C)
    4230              
    4231              $C$DW$T$38      .dwtag  DW_TAG_structure_type
    4232                      .dwattr $C$DW$T$38, DW_AT_name("_CLK_Obj_")
    4233                      .dwattr $C$DW$T$38, DW_AT_byte_size(0x11)
    4234              $C$DW$648       .dwtag  DW_TAG_member
    4235                      .dwattr $C$DW$648, DW_AT_type(*$C$DW$T$25)
    4236                      .dwattr $C$DW$648, DW_AT_name("XCLK")
    4237                      .dwattr $C$DW$648, DW_AT_TI_symbol_name("_XCLK")
    4238                      .dwattr $C$DW$648, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    4239                      .dwattr $C$DW$648, DW_AT_accessibility(DW_ACCESS_public)
    4240              $C$DW$649       .dwtag  DW_TAG_member
    4241                      .dwattr $C$DW$649, DW_AT_type(*$C$DW$T$25)
    4242                      .dwattr $C$DW$649, DW_AT_name("rsvd_1")
    4243                      .dwattr $C$DW$649, DW_AT_TI_symbol_name("_rsvd_1")
    4244                      .dwattr $C$DW$649, DW_AT_data_member_location[DW_OP_plus_uconst 0x1]
    4245                      .dwattr $C$DW$649, DW_AT_accessibility(DW_ACCESS_public)
    4246              $C$DW$650       .dwtag  DW_TAG_member
    4247                      .dwattr $C$DW$650, DW_AT_type(*$C$DW$T$25)
    4248                      .dwattr $C$DW$650, DW_AT_name("CLKCTL")
    4249                      .dwattr $C$DW$650, DW_AT_TI_symbol_name("_CLKCTL")
TMS320C2000 Assembler PC v6.2.5 Sat Sep 16 15:51:25 2017

Tools Copyright (c) 1996-2014 Texas Instruments Incorporated
C:\Users\wmj\AppData\Local\Temp\1710810                              PAGE   84

    4250                      .dwattr $C$DW$650, DW_AT_data_member_location[DW_OP_plus_uconst 0x2]
    4251                      .dwattr $C$DW$650, DW_AT_accessibility(DW_ACCESS_public)
    4252              $C$DW$651       .dwtag  DW_TAG_member
    4253                      .dwattr $C$DW$651, DW_AT_type(*$C$DW$T$37)
    4254                      .dwattr $C$DW$651, DW_AT_name("rsvd_2")
    4255                      .dwattr $C$DW$651, DW_AT_TI_symbol_name("_rsvd_2")
    4256                      .dwattr $C$DW$651, DW_AT_data_member_location[DW_OP_plus_uconst 0x3]
    4257                      .dwattr $C$DW$651, DW_AT_accessibility(DW_ACCESS_public)
    4258              $C$DW$652       .dwtag  DW_TAG_member
    4259                      .dwattr $C$DW$652, DW_AT_type(*$C$DW$T$25)
    4260                      .dwattr $C$DW$652, DW_AT_name("LOSPCP")
    4261                      .dwattr $C$DW$652, DW_AT_TI_symbol_name("_LOSPCP")
    4262                      .dwattr $C$DW$652, DW_AT_data_member_location[DW_OP_plus_uconst 0xb]
    4263                      .dwattr $C$DW$652, DW_AT_accessibility(DW_ACCESS_public)
    4264              $C$DW$653       .dwtag  DW_TAG_member
    4265                      .dwattr $C$DW$653, DW_AT_type(*$C$DW$T$25)
    4266                      .dwattr $C$DW$653, DW_AT_name("PCLKCR0")
    4267                      .dwattr $C$DW$653, DW_AT_TI_symbol_name("_PCLKCR0")
    4268                      .dwattr $C$DW$653, DW_AT_data_member_location[DW_OP_plus_uconst 0xc]
    4269                      .dwattr $C$DW$653, DW_AT_accessibility(DW_ACCESS_public)
    4270              $C$DW$654       .dwtag  DW_TAG_member
    4271                      .dwattr $C$DW$654, DW_AT_type(*$C$DW$T$25)
    4272                      .dwattr $C$DW$654, DW_AT_name("PCLKCR1")
    4273                      .dwattr $C$DW$654, DW_AT_TI_symbol_name("_PCLKCR1")
    4274                      .dwattr $C$DW$654, DW_AT_data_member_location[DW_OP_plus_uconst 0xd]
    4275                      .dwattr $C$DW$654, DW_AT_accessibility(DW_ACCESS_public)
    4276              $C$DW$655       .dwtag  DW_TAG_member
    4277                      .dwattr $C$DW$655, DW_AT_type(*$C$DW$T$28)
    4278                      .dwattr $C$DW$655, DW_AT_name("rsvd_3")
    4279                      .dwattr $C$DW$655, DW_AT_TI_symbol_name("_rsvd_3")
    4280                      .dwattr $C$DW$655, DW_AT_data_member_location[DW_OP_plus_uconst 0xe]
    4281                      .dwattr $C$DW$655, DW_AT_accessibility(DW_ACCESS_public)
    4282              $C$DW$656       .dwtag  DW_TAG_member
    4283                      .dwattr $C$DW$656, DW_AT_type(*$C$DW$T$25)
    4284                      .dwattr $C$DW$656, DW_AT_name("PCLKCR3")
    4285                      .dwattr $C$DW$656, DW_AT_TI_symbol_name("_PCLKCR3")
    4286                      .dwattr $C$DW$656, DW_AT_data_member_location[DW_OP_plus_uconst 0x10]
    4287                      .dwattr $C$DW$656, DW_AT_accessibility(DW_ACCESS_public)
    4288                      .dwendtag $C$DW$T$38
    4289              
    4290              $C$DW$T$95      .dwtag  DW_TAG_pointer_type
    4291                      .dwattr $C$DW$T$95, DW_AT_type(*$C$DW$T$38)
    4292                      .dwattr $C$DW$T$95, DW_AT_address_class(0x16)
    4293              $C$DW$T$96      .dwtag  DW_TAG_typedef, DW_AT_name("CLK_Handle")
    4294                      .dwattr $C$DW$T$96, DW_AT_type(*$C$DW$T$95)
    4295                      .dwattr $C$DW$T$96, DW_AT_language(DW_LANG_C)
    4296              
    4297              $C$DW$T$39      .dwtag  DW_TAG_structure_type
    4298                      .dwattr $C$DW$T$39, DW_AT_name("_CPU_Obj_")
    4299                      .dwattr $C$DW$T$39, DW_AT_byte_size(0x01)
    4300              $C$DW$657       .dwtag  DW_TAG_member
    4301                      .dwattr $C$DW$657, DW_AT_type(*$C$DW$T$34)
    4302                      .dwattr $C$DW$657, DW_AT_name("tmp")
    4303                      .dwattr $C$DW$657, DW_AT_TI_symbol_name("_tmp")
    4304                      .dwattr $C$DW$657, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
TMS320C2000 Assembler PC v6.2.5 Sat Sep 16 15:51:25 2017

Tools Copyright (c) 1996-2014 Texas Instruments Incorporated
C:\Users\wmj\AppData\Local\Temp\1710810                              PAGE   85

    4305                      .dwattr $C$DW$657, DW_AT_accessibility(DW_ACCESS_public)
    4306                      .dwendtag $C$DW$T$39
    4307              
    4308              $C$DW$T$97      .dwtag  DW_TAG_pointer_type
    4309                      .dwattr $C$DW$T$97, DW_AT_type(*$C$DW$T$39)
    4310                      .dwattr $C$DW$T$97, DW_AT_address_class(0x16)
    4311              $C$DW$T$98      .dwtag  DW_TAG_typedef, DW_AT_name("CPU_Handle")
    4312                      .dwattr $C$DW$T$98, DW_AT_type(*$C$DW$T$97)
    4313                      .dwattr $C$DW$T$98, DW_AT_language(DW_LANG_C)
    4314              
    4315              $C$DW$T$73      .dwtag  DW_TAG_structure_type
    4316                      .dwattr $C$DW$T$73, DW_AT_name("_CTRL_Obj_")
    4317                      .dwattr $C$DW$T$73, DW_AT_byte_size(0x108)
    4318              $C$DW$658       .dwtag  DW_TAG_member
    4319                      .dwattr $C$DW$658, DW_AT_type(*$C$DW$T$40)
    4320                      .dwattr $C$DW$658, DW_AT_name("version")
    4321                      .dwattr $C$DW$658, DW_AT_TI_symbol_name("_version")
    4322                      .dwattr $C$DW$658, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    4323                      .dwattr $C$DW$658, DW_AT_accessibility(DW_ACCESS_public)
    4324              $C$DW$659       .dwtag  DW_TAG_member
    4325                      .dwattr $C$DW$659, DW_AT_type(*$C$DW$T$42)
    4326                      .dwattr $C$DW$659, DW_AT_name("state")
    4327                      .dwattr $C$DW$659, DW_AT_TI_symbol_name("_state")
    4328                      .dwattr $C$DW$659, DW_AT_data_member_location[DW_OP_plus_uconst 0x4]
    4329                      .dwattr $C$DW$659, DW_AT_accessibility(DW_ACCESS_public)
    4330              $C$DW$660       .dwtag  DW_TAG_member
    4331                      .dwattr $C$DW$660, DW_AT_type(*$C$DW$T$42)
    4332                      .dwattr $C$DW$660, DW_AT_name("prevState")
    4333                      .dwattr $C$DW$660, DW_AT_TI_symbol_name("_prevState")
    4334                      .dwattr $C$DW$660, DW_AT_data_member_location[DW_OP_plus_uconst 0x5]
    4335                      .dwattr $C$DW$660, DW_AT_accessibility(DW_ACCESS_public)
    4336              $C$DW$661       .dwtag  DW_TAG_member
    4337                      .dwattr $C$DW$661, DW_AT_type(*$C$DW$T$44)
    4338                      .dwattr $C$DW$661, DW_AT_name("errorCode")
    4339                      .dwattr $C$DW$661, DW_AT_TI_symbol_name("_errorCode")
    4340                      .dwattr $C$DW$661, DW_AT_data_member_location[DW_OP_plus_uconst 0x6]
    4341                      .dwattr $C$DW$661, DW_AT_accessibility(DW_ACCESS_public)
    4342              $C$DW$662       .dwtag  DW_TAG_member
    4343                      .dwattr $C$DW$662, DW_AT_type(*$C$DW$T$46)
    4344                      .dwattr $C$DW$662, DW_AT_name("clarkeHandle_I")
    4345                      .dwattr $C$DW$662, DW_AT_TI_symbol_name("_clarkeHandle_I")
    4346                      .dwattr $C$DW$662, DW_AT_data_member_location[DW_OP_plus_uconst 0x8]
    4347                      .dwattr $C$DW$662, DW_AT_accessibility(DW_ACCESS_public)
    4348              $C$DW$663       .dwtag  DW_TAG_member
    4349                      .dwattr $C$DW$663, DW_AT_type(*$C$DW$T$47)
    4350                      .dwattr $C$DW$663, DW_AT_name("clarke_I")
    4351                      .dwattr $C$DW$663, DW_AT_TI_symbol_name("_clarke_I")
    4352                      .dwattr $C$DW$663, DW_AT_data_member_location[DW_OP_plus_uconst 0xa]
    4353                      .dwattr $C$DW$663, DW_AT_accessibility(DW_ACCESS_public)
    4354              $C$DW$664       .dwtag  DW_TAG_member
    4355                      .dwattr $C$DW$664, DW_AT_type(*$C$DW$T$46)
    4356                      .dwattr $C$DW$664, DW_AT_name("clarkeHandle_V")
    4357                      .dwattr $C$DW$664, DW_AT_TI_symbol_name("_clarkeHandle_V")
    4358                      .dwattr $C$DW$664, DW_AT_data_member_location[DW_OP_plus_uconst 0x10]
    4359                      .dwattr $C$DW$664, DW_AT_accessibility(DW_ACCESS_public)
TMS320C2000 Assembler PC v6.2.5 Sat Sep 16 15:51:25 2017

Tools Copyright (c) 1996-2014 Texas Instruments Incorporated
C:\Users\wmj\AppData\Local\Temp\1710810                              PAGE   86

    4360              $C$DW$665       .dwtag  DW_TAG_member
    4361                      .dwattr $C$DW$665, DW_AT_type(*$C$DW$T$47)
    4362                      .dwattr $C$DW$665, DW_AT_name("clarke_V")
    4363                      .dwattr $C$DW$665, DW_AT_TI_symbol_name("_clarke_V")
    4364                      .dwattr $C$DW$665, DW_AT_data_member_location[DW_OP_plus_uconst 0x12]
    4365                      .dwattr $C$DW$665, DW_AT_accessibility(DW_ACCESS_public)
    4366              $C$DW$666       .dwtag  DW_TAG_member
    4367                      .dwattr $C$DW$666, DW_AT_type(*$C$DW$T$49)
    4368                      .dwattr $C$DW$666, DW_AT_name("estHandle")
    4369                      .dwattr $C$DW$666, DW_AT_TI_symbol_name("_estHandle")
    4370                      .dwattr $C$DW$666, DW_AT_data_member_location[DW_OP_plus_uconst 0x18]
    4371                      .dwattr $C$DW$666, DW_AT_accessibility(DW_ACCESS_public)
    4372              $C$DW$667       .dwtag  DW_TAG_member
    4373                      .dwattr $C$DW$667, DW_AT_type(*$C$DW$T$51)
    4374                      .dwattr $C$DW$667, DW_AT_name("parkHandle")
    4375                      .dwattr $C$DW$667, DW_AT_TI_symbol_name("_parkHandle")
    4376                      .dwattr $C$DW$667, DW_AT_data_member_location[DW_OP_plus_uconst 0x1a]
    4377                      .dwattr $C$DW$667, DW_AT_accessibility(DW_ACCESS_public)
    4378              $C$DW$668       .dwtag  DW_TAG_member
    4379                      .dwattr $C$DW$668, DW_AT_type(*$C$DW$T$52)
    4380                      .dwattr $C$DW$668, DW_AT_name("park")
    4381                      .dwattr $C$DW$668, DW_AT_TI_symbol_name("_park")
    4382                      .dwattr $C$DW$668, DW_AT_data_member_location[DW_OP_plus_uconst 0x1c]
    4383                      .dwattr $C$DW$668, DW_AT_accessibility(DW_ACCESS_public)
    4384              $C$DW$669       .dwtag  DW_TAG_member
    4385                      .dwattr $C$DW$669, DW_AT_type(*$C$DW$T$54)
    4386                      .dwattr $C$DW$669, DW_AT_name("pidHandle_Id")
    4387                      .dwattr $C$DW$669, DW_AT_TI_symbol_name("_pidHandle_Id")
    4388                      .dwattr $C$DW$669, DW_AT_data_member_location[DW_OP_plus_uconst 0x20]
    4389                      .dwattr $C$DW$669, DW_AT_accessibility(DW_ACCESS_public)
    4390              $C$DW$670       .dwtag  DW_TAG_member
    4391                      .dwattr $C$DW$670, DW_AT_type(*$C$DW$T$55)
    4392                      .dwattr $C$DW$670, DW_AT_name("pid_Id")
    4393                      .dwattr $C$DW$670, DW_AT_TI_symbol_name("_pid_Id")
    4394                      .dwattr $C$DW$670, DW_AT_data_member_location[DW_OP_plus_uconst 0x22]
    4395                      .dwattr $C$DW$670, DW_AT_accessibility(DW_ACCESS_public)
    4396              $C$DW$671       .dwtag  DW_TAG_member
    4397                      .dwattr $C$DW$671, DW_AT_type(*$C$DW$T$54)
    4398                      .dwattr $C$DW$671, DW_AT_name("pidHandle_Iq")
    4399                      .dwattr $C$DW$671, DW_AT_TI_symbol_name("_pidHandle_Iq")
    4400                      .dwattr $C$DW$671, DW_AT_data_member_location[DW_OP_plus_uconst 0x32]
    4401                      .dwattr $C$DW$671, DW_AT_accessibility(DW_ACCESS_public)
    4402              $C$DW$672       .dwtag  DW_TAG_member
    4403                      .dwattr $C$DW$672, DW_AT_type(*$C$DW$T$55)
    4404                      .dwattr $C$DW$672, DW_AT_name("pid_Iq")
    4405                      .dwattr $C$DW$672, DW_AT_TI_symbol_name("_pid_Iq")
    4406                      .dwattr $C$DW$672, DW_AT_data_member_location[DW_OP_plus_uconst 0x34]
    4407                      .dwattr $C$DW$672, DW_AT_accessibility(DW_ACCESS_public)
    4408              $C$DW$673       .dwtag  DW_TAG_member
    4409                      .dwattr $C$DW$673, DW_AT_type(*$C$DW$T$54)
    4410                      .dwattr $C$DW$673, DW_AT_name("pidHandle_spd")
    4411                      .dwattr $C$DW$673, DW_AT_TI_symbol_name("_pidHandle_spd")
    4412                      .dwattr $C$DW$673, DW_AT_data_member_location[DW_OP_plus_uconst 0x44]
    4413                      .dwattr $C$DW$673, DW_AT_accessibility(DW_ACCESS_public)
    4414              $C$DW$674       .dwtag  DW_TAG_member
TMS320C2000 Assembler PC v6.2.5 Sat Sep 16 15:51:25 2017

Tools Copyright (c) 1996-2014 Texas Instruments Incorporated
C:\Users\wmj\AppData\Local\Temp\1710810                              PAGE   87

    4415                      .dwattr $C$DW$674, DW_AT_type(*$C$DW$T$55)
    4416                      .dwattr $C$DW$674, DW_AT_name("pid_spd")
    4417                      .dwattr $C$DW$674, DW_AT_TI_symbol_name("_pid_spd")
    4418                      .dwattr $C$DW$674, DW_AT_data_member_location[DW_OP_plus_uconst 0x46]
    4419                      .dwattr $C$DW$674, DW_AT_accessibility(DW_ACCESS_public)
    4420              $C$DW$675       .dwtag  DW_TAG_member
    4421                      .dwattr $C$DW$675, DW_AT_type(*$C$DW$T$57)
    4422                      .dwattr $C$DW$675, DW_AT_name("iparkHandle")
    4423                      .dwattr $C$DW$675, DW_AT_TI_symbol_name("_iparkHandle")
    4424                      .dwattr $C$DW$675, DW_AT_data_member_location[DW_OP_plus_uconst 0x56]
    4425                      .dwattr $C$DW$675, DW_AT_accessibility(DW_ACCESS_public)
    4426              $C$DW$676       .dwtag  DW_TAG_member
    4427                      .dwattr $C$DW$676, DW_AT_type(*$C$DW$T$58)
    4428                      .dwattr $C$DW$676, DW_AT_name("ipark")
    4429                      .dwattr $C$DW$676, DW_AT_TI_symbol_name("_ipark")
    4430                      .dwattr $C$DW$676, DW_AT_data_member_location[DW_OP_plus_uconst 0x58]
    4431                      .dwattr $C$DW$676, DW_AT_accessibility(DW_ACCESS_public)
    4432              $C$DW$677       .dwtag  DW_TAG_member
    4433                      .dwattr $C$DW$677, DW_AT_type(*$C$DW$T$60)
    4434                      .dwattr $C$DW$677, DW_AT_name("svgenHandle")
    4435                      .dwattr $C$DW$677, DW_AT_TI_symbol_name("_svgenHandle")
    4436                      .dwattr $C$DW$677, DW_AT_data_member_location[DW_OP_plus_uconst 0x5c]
    4437                      .dwattr $C$DW$677, DW_AT_accessibility(DW_ACCESS_public)
    4438              $C$DW$678       .dwtag  DW_TAG_member
    4439                      .dwattr $C$DW$678, DW_AT_type(*$C$DW$T$61)
    4440                      .dwattr $C$DW$678, DW_AT_name("svgen")
    4441                      .dwattr $C$DW$678, DW_AT_TI_symbol_name("_svgen")
    4442                      .dwattr $C$DW$678, DW_AT_data_member_location[DW_OP_plus_uconst 0x5e]
    4443                      .dwattr $C$DW$678, DW_AT_accessibility(DW_ACCESS_public)
    4444              $C$DW$679       .dwtag  DW_TAG_member
    4445                      .dwattr $C$DW$679, DW_AT_type(*$C$DW$T$63)
    4446                      .dwattr $C$DW$679, DW_AT_name("trajHandle_Id")
    4447                      .dwattr $C$DW$679, DW_AT_TI_symbol_name("_trajHandle_Id")
    4448                      .dwattr $C$DW$679, DW_AT_data_member_location[DW_OP_plus_uconst 0x60]
    4449                      .dwattr $C$DW$679, DW_AT_accessibility(DW_ACCESS_public)
    4450              $C$DW$680       .dwtag  DW_TAG_member
    4451                      .dwattr $C$DW$680, DW_AT_type(*$C$DW$T$64)
    4452                      .dwattr $C$DW$680, DW_AT_name("traj_Id")
    4453                      .dwattr $C$DW$680, DW_AT_TI_symbol_name("_traj_Id")
    4454                      .dwattr $C$DW$680, DW_AT_data_member_location[DW_OP_plus_uconst 0x62]
    4455                      .dwattr $C$DW$680, DW_AT_accessibility(DW_ACCESS_public)
    4456              $C$DW$681       .dwtag  DW_TAG_member
    4457                      .dwattr $C$DW$681, DW_AT_type(*$C$DW$T$63)
    4458                      .dwattr $C$DW$681, DW_AT_name("trajHandle_spd")
    4459                      .dwattr $C$DW$681, DW_AT_TI_symbol_name("_trajHandle_spd")
    4460                      .dwattr $C$DW$681, DW_AT_data_member_location[DW_OP_plus_uconst 0x6c]
    4461                      .dwattr $C$DW$681, DW_AT_accessibility(DW_ACCESS_public)
    4462              $C$DW$682       .dwtag  DW_TAG_member
    4463                      .dwattr $C$DW$682, DW_AT_type(*$C$DW$T$64)
    4464                      .dwattr $C$DW$682, DW_AT_name("traj_spd")
    4465                      .dwattr $C$DW$682, DW_AT_TI_symbol_name("_traj_spd")
    4466                      .dwattr $C$DW$682, DW_AT_data_member_location[DW_OP_plus_uconst 0x6e]
    4467                      .dwattr $C$DW$682, DW_AT_accessibility(DW_ACCESS_public)
    4468              $C$DW$683       .dwtag  DW_TAG_member
    4469                      .dwattr $C$DW$683, DW_AT_type(*$C$DW$T$63)
TMS320C2000 Assembler PC v6.2.5 Sat Sep 16 15:51:25 2017

Tools Copyright (c) 1996-2014 Texas Instruments Incorporated
C:\Users\wmj\AppData\Local\Temp\1710810                              PAGE   88

    4470                      .dwattr $C$DW$683, DW_AT_name("trajHandle_spdMax")
    4471                      .dwattr $C$DW$683, DW_AT_TI_symbol_name("_trajHandle_spdMax")
    4472                      .dwattr $C$DW$683, DW_AT_data_member_location[DW_OP_plus_uconst 0x78]
    4473                      .dwattr $C$DW$683, DW_AT_accessibility(DW_ACCESS_public)
    4474              $C$DW$684       .dwtag  DW_TAG_member
    4475                      .dwattr $C$DW$684, DW_AT_type(*$C$DW$T$64)
    4476                      .dwattr $C$DW$684, DW_AT_name("traj_spdMax")
    4477                      .dwattr $C$DW$684, DW_AT_TI_symbol_name("_traj_spdMax")
    4478                      .dwattr $C$DW$684, DW_AT_data_member_location[DW_OP_plus_uconst 0x7a]
    4479                      .dwattr $C$DW$684, DW_AT_accessibility(DW_ACCESS_public)
    4480              $C$DW$685       .dwtag  DW_TAG_member
    4481                      .dwattr $C$DW$685, DW_AT_type(*$C$DW$T$65)
    4482                      .dwattr $C$DW$685, DW_AT_name("motorParams")
    4483                      .dwattr $C$DW$685, DW_AT_TI_symbol_name("_motorParams")
    4484                      .dwattr $C$DW$685, DW_AT_data_member_location[DW_OP_plus_uconst 0x84]
    4485                      .dwattr $C$DW$685, DW_AT_accessibility(DW_ACCESS_public)
    4486              $C$DW$686       .dwtag  DW_TAG_member
    4487                      .dwattr $C$DW$686, DW_AT_type(*$C$DW$T$68)
    4488                      .dwattr $C$DW$686, DW_AT_name("waitTimes")
    4489                      .dwattr $C$DW$686, DW_AT_TI_symbol_name("_waitTimes")
    4490                      .dwattr $C$DW$686, DW_AT_data_member_location[DW_OP_plus_uconst 0x92]
    4491                      .dwattr $C$DW$686, DW_AT_accessibility(DW_ACCESS_public)
    4492              $C$DW$687       .dwtag  DW_TAG_member
    4493                      .dwattr $C$DW$687, DW_AT_type(*$C$DW$T$67)
    4494                      .dwattr $C$DW$687, DW_AT_name("counter_state")
    4495                      .dwattr $C$DW$687, DW_AT_TI_symbol_name("_counter_state")
    4496                      .dwattr $C$DW$687, DW_AT_data_member_location[DW_OP_plus_uconst 0x9a]
    4497                      .dwattr $C$DW$687, DW_AT_accessibility(DW_ACCESS_public)
    4498              $C$DW$688       .dwtag  DW_TAG_member
    4499                      .dwattr $C$DW$688, DW_AT_type(*$C$DW$T$69)
    4500                      .dwattr $C$DW$688, DW_AT_name("numIsrTicksPerCtrlTick")
    4501                      .dwattr $C$DW$688, DW_AT_TI_symbol_name("_numIsrTicksPerCtrlTick")
    4502                      .dwattr $C$DW$688, DW_AT_data_member_location[DW_OP_plus_uconst 0x9c]
    4503                      .dwattr $C$DW$688, DW_AT_accessibility(DW_ACCESS_public)
    4504              $C$DW$689       .dwtag  DW_TAG_member
    4505                      .dwattr $C$DW$689, DW_AT_type(*$C$DW$T$69)
    4506                      .dwattr $C$DW$689, DW_AT_name("numCtrlTicksPerCurrentTick")
    4507                      .dwattr $C$DW$689, DW_AT_TI_symbol_name("_numCtrlTicksPerCurrentTick")
    4508                      .dwattr $C$DW$689, DW_AT_data_member_location[DW_OP_plus_uconst 0x9d]
    4509                      .dwattr $C$DW$689, DW_AT_accessibility(DW_ACCESS_public)
    4510              $C$DW$690       .dwtag  DW_TAG_member
    4511                      .dwattr $C$DW$690, DW_AT_type(*$C$DW$T$69)
    4512                      .dwattr $C$DW$690, DW_AT_name("numCtrlTicksPerSpeedTick")
    4513                      .dwattr $C$DW$690, DW_AT_TI_symbol_name("_numCtrlTicksPerSpeedTick")
    4514                      .dwattr $C$DW$690, DW_AT_data_member_location[DW_OP_plus_uconst 0x9e]
    4515                      .dwattr $C$DW$690, DW_AT_accessibility(DW_ACCESS_public)
    4516              $C$DW$691       .dwtag  DW_TAG_member
    4517                      .dwattr $C$DW$691, DW_AT_type(*$C$DW$T$69)
    4518                      .dwattr $C$DW$691, DW_AT_name("numCtrlTicksPerTrajTick")
    4519                      .dwattr $C$DW$691, DW_AT_TI_symbol_name("_numCtrlTicksPerTrajTick")
    4520                      .dwattr $C$DW$691, DW_AT_data_member_location[DW_OP_plus_uconst 0x9f]
    4521                      .dwattr $C$DW$691, DW_AT_accessibility(DW_ACCESS_public)
    4522              $C$DW$692       .dwtag  DW_TAG_member
    4523                      .dwattr $C$DW$692, DW_AT_type(*$C$DW$T$67)
    4524                      .dwattr $C$DW$692, DW_AT_name("ctrlFreq_Hz")
TMS320C2000 Assembler PC v6.2.5 Sat Sep 16 15:51:25 2017

Tools Copyright (c) 1996-2014 Texas Instruments Incorporated
C:\Users\wmj\AppData\Local\Temp\1710810                              PAGE   89

    4525                      .dwattr $C$DW$692, DW_AT_TI_symbol_name("_ctrlFreq_Hz")
    4526                      .dwattr $C$DW$692, DW_AT_data_member_location[DW_OP_plus_uconst 0xa0]
    4527                      .dwattr $C$DW$692, DW_AT_accessibility(DW_ACCESS_public)
    4528              $C$DW$693       .dwtag  DW_TAG_member
    4529                      .dwattr $C$DW$693, DW_AT_type(*$C$DW$T$67)
    4530                      .dwattr $C$DW$693, DW_AT_name("trajFreq_Hz")
    4531                      .dwattr $C$DW$693, DW_AT_TI_symbol_name("_trajFreq_Hz")
    4532                      .dwattr $C$DW$693, DW_AT_data_member_location[DW_OP_plus_uconst 0xa2]
    4533                      .dwattr $C$DW$693, DW_AT_accessibility(DW_ACCESS_public)
    4534              $C$DW$694       .dwtag  DW_TAG_member
    4535                      .dwattr $C$DW$694, DW_AT_type(*$C$DW$T$33)
    4536                      .dwattr $C$DW$694, DW_AT_name("trajPeriod_sec")
    4537                      .dwattr $C$DW$694, DW_AT_TI_symbol_name("_trajPeriod_sec")
    4538                      .dwattr $C$DW$694, DW_AT_data_member_location[DW_OP_plus_uconst 0xa4]
    4539                      .dwattr $C$DW$694, DW_AT_accessibility(DW_ACCESS_public)
    4540              $C$DW$695       .dwtag  DW_TAG_member
    4541                      .dwattr $C$DW$695, DW_AT_type(*$C$DW$T$70)
    4542                      .dwattr $C$DW$695, DW_AT_name("ctrlPeriod_sec")
    4543                      .dwattr $C$DW$695, DW_AT_TI_symbol_name("_ctrlPeriod_sec")
    4544                      .dwattr $C$DW$695, DW_AT_data_member_location[DW_OP_plus_uconst 0xa6]
    4545                      .dwattr $C$DW$695, DW_AT_accessibility(DW_ACCESS_public)
    4546              $C$DW$696       .dwtag  DW_TAG_member
    4547                      .dwattr $C$DW$696, DW_AT_type(*$C$DW$T$33)
    4548                      .dwattr $C$DW$696, DW_AT_name("maxVsMag_pu")
    4549                      .dwattr $C$DW$696, DW_AT_TI_symbol_name("_maxVsMag_pu")
    4550                      .dwattr $C$DW$696, DW_AT_data_member_location[DW_OP_plus_uconst 0xa8]
    4551                      .dwattr $C$DW$696, DW_AT_accessibility(DW_ACCESS_public)
    4552              $C$DW$697       .dwtag  DW_TAG_member
    4553                      .dwattr $C$DW$697, DW_AT_type(*$C$DW$T$71)
    4554                      .dwattr $C$DW$697, DW_AT_name("Iab_in")
    4555                      .dwattr $C$DW$697, DW_AT_TI_symbol_name("_Iab_in")
    4556                      .dwattr $C$DW$697, DW_AT_data_member_location[DW_OP_plus_uconst 0xaa]
    4557                      .dwattr $C$DW$697, DW_AT_accessibility(DW_ACCESS_public)
    4558              $C$DW$698       .dwtag  DW_TAG_member
    4559                      .dwattr $C$DW$698, DW_AT_type(*$C$DW$T$71)
    4560                      .dwattr $C$DW$698, DW_AT_name("Iab_filt")
    4561                      .dwattr $C$DW$698, DW_AT_TI_symbol_name("_Iab_filt")
    4562                      .dwattr $C$DW$698, DW_AT_data_member_location[DW_OP_plus_uconst 0xae]
    4563                      .dwattr $C$DW$698, DW_AT_accessibility(DW_ACCESS_public)
    4564              $C$DW$699       .dwtag  DW_TAG_member
    4565                      .dwattr $C$DW$699, DW_AT_type(*$C$DW$T$71)
    4566                      .dwattr $C$DW$699, DW_AT_name("Idq_in")
    4567                      .dwattr $C$DW$699, DW_AT_TI_symbol_name("_Idq_in")
    4568                      .dwattr $C$DW$699, DW_AT_data_member_location[DW_OP_plus_uconst 0xb2]
    4569                      .dwattr $C$DW$699, DW_AT_accessibility(DW_ACCESS_public)
    4570              $C$DW$700       .dwtag  DW_TAG_member
    4571                      .dwattr $C$DW$700, DW_AT_type(*$C$DW$T$71)
    4572                      .dwattr $C$DW$700, DW_AT_name("Vab_in")
    4573                      .dwattr $C$DW$700, DW_AT_TI_symbol_name("_Vab_in")
    4574                      .dwattr $C$DW$700, DW_AT_data_member_location[DW_OP_plus_uconst 0xb6]
    4575                      .dwattr $C$DW$700, DW_AT_accessibility(DW_ACCESS_public)
    4576              $C$DW$701       .dwtag  DW_TAG_member
    4577                      .dwattr $C$DW$701, DW_AT_type(*$C$DW$T$33)
    4578                      .dwattr $C$DW$701, DW_AT_name("spd_out")
    4579                      .dwattr $C$DW$701, DW_AT_TI_symbol_name("_spd_out")
TMS320C2000 Assembler PC v6.2.5 Sat Sep 16 15:51:25 2017

Tools Copyright (c) 1996-2014 Texas Instruments Incorporated
C:\Users\wmj\AppData\Local\Temp\1710810                              PAGE   90

    4580                      .dwattr $C$DW$701, DW_AT_data_member_location[DW_OP_plus_uconst 0xba]
    4581                      .dwattr $C$DW$701, DW_AT_accessibility(DW_ACCESS_public)
    4582              $C$DW$702       .dwtag  DW_TAG_member
    4583                      .dwattr $C$DW$702, DW_AT_type(*$C$DW$T$71)
    4584                      .dwattr $C$DW$702, DW_AT_name("Vab_out")
    4585                      .dwattr $C$DW$702, DW_AT_TI_symbol_name("_Vab_out")
    4586                      .dwattr $C$DW$702, DW_AT_data_member_location[DW_OP_plus_uconst 0xbc]
    4587                      .dwattr $C$DW$702, DW_AT_accessibility(DW_ACCESS_public)
    4588              $C$DW$703       .dwtag  DW_TAG_member
    4589                      .dwattr $C$DW$703, DW_AT_type(*$C$DW$T$71)
    4590                      .dwattr $C$DW$703, DW_AT_name("Vdq_out")
    4591                      .dwattr $C$DW$703, DW_AT_TI_symbol_name("_Vdq_out")
    4592                      .dwattr $C$DW$703, DW_AT_data_member_location[DW_OP_plus_uconst 0xc0]
    4593                      .dwattr $C$DW$703, DW_AT_accessibility(DW_ACCESS_public)
    4594              $C$DW$704       .dwtag  DW_TAG_member
    4595                      .dwattr $C$DW$704, DW_AT_type(*$C$DW$T$70)
    4596                      .dwattr $C$DW$704, DW_AT_name("Rhf")
    4597                      .dwattr $C$DW$704, DW_AT_TI_symbol_name("_Rhf")
    4598                      .dwattr $C$DW$704, DW_AT_data_member_location[DW_OP_plus_uconst 0xc4]
    4599                      .dwattr $C$DW$704, DW_AT_accessibility(DW_ACCESS_public)
    4600              $C$DW$705       .dwtag  DW_TAG_member
    4601                      .dwattr $C$DW$705, DW_AT_type(*$C$DW$T$70)
    4602                      .dwattr $C$DW$705, DW_AT_name("Lhf")
    4603                      .dwattr $C$DW$705, DW_AT_TI_symbol_name("_Lhf")
    4604                      .dwattr $C$DW$705, DW_AT_data_member_location[DW_OP_plus_uconst 0xc6]
    4605                      .dwattr $C$DW$705, DW_AT_accessibility(DW_ACCESS_public)
    4606              $C$DW$706       .dwtag  DW_TAG_member
    4607                      .dwattr $C$DW$706, DW_AT_type(*$C$DW$T$70)
    4608                      .dwattr $C$DW$706, DW_AT_name("RoverL")
    4609                      .dwattr $C$DW$706, DW_AT_TI_symbol_name("_RoverL")
    4610                      .dwattr $C$DW$706, DW_AT_data_member_location[DW_OP_plus_uconst 0xc8]
    4611                      .dwattr $C$DW$706, DW_AT_accessibility(DW_ACCESS_public)
    4612              $C$DW$707       .dwtag  DW_TAG_member
    4613                      .dwattr $C$DW$707, DW_AT_type(*$C$DW$T$33)
    4614                      .dwattr $C$DW$707, DW_AT_name("Kp_Id")
    4615                      .dwattr $C$DW$707, DW_AT_TI_symbol_name("_Kp_Id")
    4616                      .dwattr $C$DW$707, DW_AT_data_member_location[DW_OP_plus_uconst 0xca]
    4617                      .dwattr $C$DW$707, DW_AT_accessibility(DW_ACCESS_public)
    4618              $C$DW$708       .dwtag  DW_TAG_member
    4619                      .dwattr $C$DW$708, DW_AT_type(*$C$DW$T$33)
    4620                      .dwattr $C$DW$708, DW_AT_name("Kp_Iq")
    4621                      .dwattr $C$DW$708, DW_AT_TI_symbol_name("_Kp_Iq")
    4622                      .dwattr $C$DW$708, DW_AT_data_member_location[DW_OP_plus_uconst 0xcc]
    4623                      .dwattr $C$DW$708, DW_AT_accessibility(DW_ACCESS_public)
    4624              $C$DW$709       .dwtag  DW_TAG_member
    4625                      .dwattr $C$DW$709, DW_AT_type(*$C$DW$T$33)
    4626                      .dwattr $C$DW$709, DW_AT_name("Kp_spd")
    4627                      .dwattr $C$DW$709, DW_AT_TI_symbol_name("_Kp_spd")
    4628                      .dwattr $C$DW$709, DW_AT_data_member_location[DW_OP_plus_uconst 0xce]
    4629                      .dwattr $C$DW$709, DW_AT_accessibility(DW_ACCESS_public)
    4630              $C$DW$710       .dwtag  DW_TAG_member
    4631                      .dwattr $C$DW$710, DW_AT_type(*$C$DW$T$33)
    4632                      .dwattr $C$DW$710, DW_AT_name("Ki_Id")
    4633                      .dwattr $C$DW$710, DW_AT_TI_symbol_name("_Ki_Id")
    4634                      .dwattr $C$DW$710, DW_AT_data_member_location[DW_OP_plus_uconst 0xd0]
TMS320C2000 Assembler PC v6.2.5 Sat Sep 16 15:51:25 2017

Tools Copyright (c) 1996-2014 Texas Instruments Incorporated
C:\Users\wmj\AppData\Local\Temp\1710810                              PAGE   91

    4635                      .dwattr $C$DW$710, DW_AT_accessibility(DW_ACCESS_public)
    4636              $C$DW$711       .dwtag  DW_TAG_member
    4637                      .dwattr $C$DW$711, DW_AT_type(*$C$DW$T$33)
    4638                      .dwattr $C$DW$711, DW_AT_name("Ki_Iq")
    4639                      .dwattr $C$DW$711, DW_AT_TI_symbol_name("_Ki_Iq")
    4640                      .dwattr $C$DW$711, DW_AT_data_member_location[DW_OP_plus_uconst 0xd2]
    4641                      .dwattr $C$DW$711, DW_AT_accessibility(DW_ACCESS_public)
    4642              $C$DW$712       .dwtag  DW_TAG_member
    4643                      .dwattr $C$DW$712, DW_AT_type(*$C$DW$T$33)
    4644                      .dwattr $C$DW$712, DW_AT_name("Ki_spd")
    4645                      .dwattr $C$DW$712, DW_AT_TI_symbol_name("_Ki_spd")
    4646                      .dwattr $C$DW$712, DW_AT_data_member_location[DW_OP_plus_uconst 0xd4]
    4647                      .dwattr $C$DW$712, DW_AT_accessibility(DW_ACCESS_public)
    4648              $C$DW$713       .dwtag  DW_TAG_member
    4649                      .dwattr $C$DW$713, DW_AT_type(*$C$DW$T$33)
    4650                      .dwattr $C$DW$713, DW_AT_name("Kd_Id")
    4651                      .dwattr $C$DW$713, DW_AT_TI_symbol_name("_Kd_Id")
    4652                      .dwattr $C$DW$713, DW_AT_data_member_location[DW_OP_plus_uconst 0xd6]
    4653                      .dwattr $C$DW$713, DW_AT_accessibility(DW_ACCESS_public)
    4654              $C$DW$714       .dwtag  DW_TAG_member
    4655                      .dwattr $C$DW$714, DW_AT_type(*$C$DW$T$33)
    4656                      .dwattr $C$DW$714, DW_AT_name("Kd_Iq")
    4657                      .dwattr $C$DW$714, DW_AT_TI_symbol_name("_Kd_Iq")
    4658                      .dwattr $C$DW$714, DW_AT_data_member_location[DW_OP_plus_uconst 0xd8]
    4659                      .dwattr $C$DW$714, DW_AT_accessibility(DW_ACCESS_public)
    4660              $C$DW$715       .dwtag  DW_TAG_member
    4661                      .dwattr $C$DW$715, DW_AT_type(*$C$DW$T$33)
    4662                      .dwattr $C$DW$715, DW_AT_name("Kd_spd")
    4663                      .dwattr $C$DW$715, DW_AT_TI_symbol_name("_Kd_spd")
    4664                      .dwattr $C$DW$715, DW_AT_data_member_location[DW_OP_plus_uconst 0xda]
    4665                      .dwattr $C$DW$715, DW_AT_accessibility(DW_ACCESS_public)
    4666              $C$DW$716       .dwtag  DW_TAG_member
    4667                      .dwattr $C$DW$716, DW_AT_type(*$C$DW$T$33)
    4668                      .dwattr $C$DW$716, DW_AT_name("Ui_Id")
    4669                      .dwattr $C$DW$716, DW_AT_TI_symbol_name("_Ui_Id")
    4670                      .dwattr $C$DW$716, DW_AT_data_member_location[DW_OP_plus_uconst 0xdc]
    4671                      .dwattr $C$DW$716, DW_AT_accessibility(DW_ACCESS_public)
    4672              $C$DW$717       .dwtag  DW_TAG_member
    4673                      .dwattr $C$DW$717, DW_AT_type(*$C$DW$T$33)
    4674                      .dwattr $C$DW$717, DW_AT_name("Ui_Iq")
    4675                      .dwattr $C$DW$717, DW_AT_TI_symbol_name("_Ui_Iq")
    4676                      .dwattr $C$DW$717, DW_AT_data_member_location[DW_OP_plus_uconst 0xde]
    4677                      .dwattr $C$DW$717, DW_AT_accessibility(DW_ACCESS_public)
    4678              $C$DW$718       .dwtag  DW_TAG_member
    4679                      .dwattr $C$DW$718, DW_AT_type(*$C$DW$T$33)
    4680                      .dwattr $C$DW$718, DW_AT_name("Ui_spd")
    4681                      .dwattr $C$DW$718, DW_AT_TI_symbol_name("_Ui_spd")
    4682                      .dwattr $C$DW$718, DW_AT_data_member_location[DW_OP_plus_uconst 0xe0]
    4683                      .dwattr $C$DW$718, DW_AT_accessibility(DW_ACCESS_public)
    4684              $C$DW$719       .dwtag  DW_TAG_member
    4685                      .dwattr $C$DW$719, DW_AT_type(*$C$DW$T$71)
    4686                      .dwattr $C$DW$719, DW_AT_name("Idq_ref")
    4687                      .dwattr $C$DW$719, DW_AT_TI_symbol_name("_Idq_ref")
    4688                      .dwattr $C$DW$719, DW_AT_data_member_location[DW_OP_plus_uconst 0xe2]
    4689                      .dwattr $C$DW$719, DW_AT_accessibility(DW_ACCESS_public)
TMS320C2000 Assembler PC v6.2.5 Sat Sep 16 15:51:25 2017

Tools Copyright (c) 1996-2014 Texas Instruments Incorporated
C:\Users\wmj\AppData\Local\Temp\1710810                              PAGE   92

    4690              $C$DW$720       .dwtag  DW_TAG_member
    4691                      .dwattr $C$DW$720, DW_AT_type(*$C$DW$T$33)
    4692                      .dwattr $C$DW$720, DW_AT_name("IdRated")
    4693                      .dwattr $C$DW$720, DW_AT_TI_symbol_name("_IdRated")
    4694                      .dwattr $C$DW$720, DW_AT_data_member_location[DW_OP_plus_uconst 0xe6]
    4695                      .dwattr $C$DW$720, DW_AT_accessibility(DW_ACCESS_public)
    4696              $C$DW$721       .dwtag  DW_TAG_member
    4697                      .dwattr $C$DW$721, DW_AT_type(*$C$DW$T$33)
    4698                      .dwattr $C$DW$721, DW_AT_name("spd_ref")
    4699                      .dwattr $C$DW$721, DW_AT_TI_symbol_name("_spd_ref")
    4700                      .dwattr $C$DW$721, DW_AT_data_member_location[DW_OP_plus_uconst 0xe8]
    4701                      .dwattr $C$DW$721, DW_AT_accessibility(DW_ACCESS_public)
    4702              $C$DW$722       .dwtag  DW_TAG_member
    4703                      .dwattr $C$DW$722, DW_AT_type(*$C$DW$T$33)
    4704                      .dwattr $C$DW$722, DW_AT_name("spd_max")
    4705                      .dwattr $C$DW$722, DW_AT_TI_symbol_name("_spd_max")
    4706                      .dwattr $C$DW$722, DW_AT_data_member_location[DW_OP_plus_uconst 0xea]
    4707                      .dwattr $C$DW$722, DW_AT_accessibility(DW_ACCESS_public)
    4708              $C$DW$723       .dwtag  DW_TAG_member
    4709                      .dwattr $C$DW$723, DW_AT_type(*$C$DW$T$69)
    4710                      .dwattr $C$DW$723, DW_AT_name("counter_current")
    4711                      .dwattr $C$DW$723, DW_AT_TI_symbol_name("_counter_current")
    4712                      .dwattr $C$DW$723, DW_AT_data_member_location[DW_OP_plus_uconst 0xec]
    4713                      .dwattr $C$DW$723, DW_AT_accessibility(DW_ACCESS_public)
    4714              $C$DW$724       .dwtag  DW_TAG_member
    4715                      .dwattr $C$DW$724, DW_AT_type(*$C$DW$T$69)
    4716                      .dwattr $C$DW$724, DW_AT_name("counter_isr")
    4717                      .dwattr $C$DW$724, DW_AT_TI_symbol_name("_counter_isr")
    4718                      .dwattr $C$DW$724, DW_AT_data_member_location[DW_OP_plus_uconst 0xed]
    4719                      .dwattr $C$DW$724, DW_AT_accessibility(DW_ACCESS_public)
    4720              $C$DW$725       .dwtag  DW_TAG_member
    4721                      .dwattr $C$DW$725, DW_AT_type(*$C$DW$T$69)
    4722                      .dwattr $C$DW$725, DW_AT_name("counter_speed")
    4723                      .dwattr $C$DW$725, DW_AT_TI_symbol_name("_counter_speed")
    4724                      .dwattr $C$DW$725, DW_AT_data_member_location[DW_OP_plus_uconst 0xee]
    4725                      .dwattr $C$DW$725, DW_AT_accessibility(DW_ACCESS_public)
    4726              $C$DW$726       .dwtag  DW_TAG_member
    4727                      .dwattr $C$DW$726, DW_AT_type(*$C$DW$T$69)
    4728                      .dwattr $C$DW$726, DW_AT_name("counter_traj")
    4729                      .dwattr $C$DW$726, DW_AT_TI_symbol_name("_counter_traj")
    4730                      .dwattr $C$DW$726, DW_AT_data_member_location[DW_OP_plus_uconst 0xef]
    4731                      .dwattr $C$DW$726, DW_AT_accessibility(DW_ACCESS_public)
    4732              $C$DW$727       .dwtag  DW_TAG_member
    4733                      .dwattr $C$DW$727, DW_AT_type(*$C$DW$T$72)
    4734                      .dwattr $C$DW$727, DW_AT_name("flag_enableCtrl")
    4735                      .dwattr $C$DW$727, DW_AT_TI_symbol_name("_flag_enableCtrl")
    4736                      .dwattr $C$DW$727, DW_AT_data_member_location[DW_OP_plus_uconst 0xf0]
    4737                      .dwattr $C$DW$727, DW_AT_accessibility(DW_ACCESS_public)
    4738              $C$DW$728       .dwtag  DW_TAG_member
    4739                      .dwattr $C$DW$728, DW_AT_type(*$C$DW$T$72)
    4740                      .dwattr $C$DW$728, DW_AT_name("flag_enableDcBusComp")
    4741                      .dwattr $C$DW$728, DW_AT_TI_symbol_name("_flag_enableDcBusComp")
    4742                      .dwattr $C$DW$728, DW_AT_data_member_location[DW_OP_plus_uconst 0xf1]
    4743                      .dwattr $C$DW$728, DW_AT_accessibility(DW_ACCESS_public)
    4744              $C$DW$729       .dwtag  DW_TAG_member
TMS320C2000 Assembler PC v6.2.5 Sat Sep 16 15:51:25 2017

Tools Copyright (c) 1996-2014 Texas Instruments Incorporated
C:\Users\wmj\AppData\Local\Temp\1710810                              PAGE   93

    4745                      .dwattr $C$DW$729, DW_AT_type(*$C$DW$T$72)
    4746                      .dwattr $C$DW$729, DW_AT_name("flag_enablePowerWarp")
    4747                      .dwattr $C$DW$729, DW_AT_TI_symbol_name("_flag_enablePowerWarp")
    4748                      .dwattr $C$DW$729, DW_AT_data_member_location[DW_OP_plus_uconst 0xf2]
    4749                      .dwattr $C$DW$729, DW_AT_accessibility(DW_ACCESS_public)
    4750              $C$DW$730       .dwtag  DW_TAG_member
    4751                      .dwattr $C$DW$730, DW_AT_type(*$C$DW$T$72)
    4752                      .dwattr $C$DW$730, DW_AT_name("flag_enableOffset")
    4753                      .dwattr $C$DW$730, DW_AT_TI_symbol_name("_flag_enableOffset")
    4754                      .dwattr $C$DW$730, DW_AT_data_member_location[DW_OP_plus_uconst 0xf3]
    4755                      .dwattr $C$DW$730, DW_AT_accessibility(DW_ACCESS_public)
    4756              $C$DW$731       .dwtag  DW_TAG_member
    4757                      .dwattr $C$DW$731, DW_AT_type(*$C$DW$T$72)
    4758                      .dwattr $C$DW$731, DW_AT_name("flag_enableSpeedCtrl")
    4759                      .dwattr $C$DW$731, DW_AT_TI_symbol_name("_flag_enableSpeedCtrl")
    4760                      .dwattr $C$DW$731, DW_AT_data_member_location[DW_OP_plus_uconst 0xf4]
    4761                      .dwattr $C$DW$731, DW_AT_accessibility(DW_ACCESS_public)
    4762              $C$DW$732       .dwtag  DW_TAG_member
    4763                      .dwattr $C$DW$732, DW_AT_type(*$C$DW$T$72)
    4764                      .dwattr $C$DW$732, DW_AT_name("flag_enableUserMotorParams")
    4765                      .dwattr $C$DW$732, DW_AT_TI_symbol_name("_flag_enableUserMotorParams")
    4766                      .dwattr $C$DW$732, DW_AT_data_member_location[DW_OP_plus_uconst 0xf5]
    4767                      .dwattr $C$DW$732, DW_AT_accessibility(DW_ACCESS_public)
    4768              $C$DW$733       .dwtag  DW_TAG_member
    4769                      .dwattr $C$DW$733, DW_AT_type(*$C$DW$T$71)
    4770                      .dwattr $C$DW$733, DW_AT_name("Idq_offset_pu")
    4771                      .dwattr $C$DW$733, DW_AT_TI_symbol_name("_Idq_offset_pu")
    4772                      .dwattr $C$DW$733, DW_AT_data_member_location[DW_OP_plus_uconst 0xf6]
    4773                      .dwattr $C$DW$733, DW_AT_accessibility(DW_ACCESS_public)
    4774              $C$DW$734       .dwtag  DW_TAG_member
    4775                      .dwattr $C$DW$734, DW_AT_type(*$C$DW$T$71)
    4776                      .dwattr $C$DW$734, DW_AT_name("Vdq_offset_pu")
    4777                      .dwattr $C$DW$734, DW_AT_TI_symbol_name("_Vdq_offset_pu")
    4778                      .dwattr $C$DW$734, DW_AT_data_member_location[DW_OP_plus_uconst 0xfa]
    4779                      .dwattr $C$DW$734, DW_AT_accessibility(DW_ACCESS_public)
    4780              $C$DW$735       .dwtag  DW_TAG_member
    4781                      .dwattr $C$DW$735, DW_AT_type(*$C$DW$T$33)
    4782                      .dwattr $C$DW$735, DW_AT_name("angle_pu")
    4783                      .dwattr $C$DW$735, DW_AT_TI_symbol_name("_angle_pu")
    4784                      .dwattr $C$DW$735, DW_AT_data_member_location[DW_OP_plus_uconst 0xfe]
    4785                      .dwattr $C$DW$735, DW_AT_accessibility(DW_ACCESS_public)
    4786              $C$DW$736       .dwtag  DW_TAG_member
    4787                      .dwattr $C$DW$736, DW_AT_type(*$C$DW$T$33)
    4788                      .dwattr $C$DW$736, DW_AT_name("speed_ref_pu")
    4789                      .dwattr $C$DW$736, DW_AT_TI_symbol_name("_speed_ref_pu")
    4790                      .dwattr $C$DW$736, DW_AT_data_member_location[DW_OP_plus_uconst 0x100]
    4791                      .dwattr $C$DW$736, DW_AT_accessibility(DW_ACCESS_public)
    4792              $C$DW$737       .dwtag  DW_TAG_member
    4793                      .dwattr $C$DW$737, DW_AT_type(*$C$DW$T$33)
    4794                      .dwattr $C$DW$737, DW_AT_name("speed_fb_pu")
    4795                      .dwattr $C$DW$737, DW_AT_TI_symbol_name("_speed_fb_pu")
    4796                      .dwattr $C$DW$737, DW_AT_data_member_location[DW_OP_plus_uconst 0x102]
    4797                      .dwattr $C$DW$737, DW_AT_accessibility(DW_ACCESS_public)
    4798              $C$DW$738       .dwtag  DW_TAG_member
    4799                      .dwattr $C$DW$738, DW_AT_type(*$C$DW$T$33)
TMS320C2000 Assembler PC v6.2.5 Sat Sep 16 15:51:25 2017

Tools Copyright (c) 1996-2014 Texas Instruments Incorporated
C:\Users\wmj\AppData\Local\Temp\1710810                              PAGE   94

    4800                      .dwattr $C$DW$738, DW_AT_name("speed_outMax_pu")
    4801                      .dwattr $C$DW$738, DW_AT_TI_symbol_name("_speed_outMax_pu")
    4802                      .dwattr $C$DW$738, DW_AT_data_member_location[DW_OP_plus_uconst 0x104]
    4803                      .dwattr $C$DW$738, DW_AT_accessibility(DW_ACCESS_public)
    4804              $C$DW$739       .dwtag  DW_TAG_member
    4805                      .dwattr $C$DW$739, DW_AT_type(*$C$DW$T$72)
    4806                      .dwattr $C$DW$739, DW_AT_name("flag_enableCurrentCtrl")
    4807                      .dwattr $C$DW$739, DW_AT_TI_symbol_name("_flag_enableCurrentCtrl")
    4808                      .dwattr $C$DW$739, DW_AT_data_member_location[DW_OP_plus_uconst 0x106]
    4809                      .dwattr $C$DW$739, DW_AT_accessibility(DW_ACCESS_public)
    4810                      .dwendtag $C$DW$T$73
    4811              
    4812              $C$DW$T$289     .dwtag  DW_TAG_typedef, DW_AT_name("CTRL_Obj")
    4813                      .dwattr $C$DW$T$289, DW_AT_type(*$C$DW$T$73)
    4814                      .dwattr $C$DW$T$289, DW_AT_language(DW_LANG_C)
    4815              $C$DW$T$290     .dwtag  DW_TAG_pointer_type
    4816                      .dwattr $C$DW$T$290, DW_AT_type(*$C$DW$T$289)
    4817                      .dwattr $C$DW$T$290, DW_AT_address_class(0x16)
    4818              $C$DW$T$257     .dwtag  DW_TAG_pointer_type
    4819                      .dwattr $C$DW$T$257, DW_AT_type(*$C$DW$T$73)
    4820                      .dwattr $C$DW$T$257, DW_AT_address_class(0x16)
    4821              $C$DW$T$258     .dwtag  DW_TAG_typedef, DW_AT_name("CTRL_Handle")
    4822                      .dwattr $C$DW$T$258, DW_AT_type(*$C$DW$T$257)
    4823                      .dwattr $C$DW$T$258, DW_AT_language(DW_LANG_C)
    4824              $C$DW$740       .dwtag  DW_TAG_TI_far_type
    4825                      .dwattr $C$DW$740, DW_AT_type(*$C$DW$T$258)
    4826              $C$DW$T$291     .dwtag  DW_TAG_const_type
    4827                      .dwattr $C$DW$T$291, DW_AT_type(*$C$DW$740)
    4828              
    4829              $C$DW$T$76      .dwtag  DW_TAG_structure_type
    4830                      .dwattr $C$DW$T$76, DW_AT_name("_CTRL_Version_")
    4831                      .dwattr $C$DW$T$76, DW_AT_byte_size(0x04)
    4832              $C$DW$741       .dwtag  DW_TAG_member
    4833                      .dwattr $C$DW$741, DW_AT_type(*$C$DW$T$24)
    4834                      .dwattr $C$DW$741, DW_AT_name("rsvd")
    4835                      .dwattr $C$DW$741, DW_AT_TI_symbol_name("_rsvd")
    4836                      .dwattr $C$DW$741, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    4837                      .dwattr $C$DW$741, DW_AT_accessibility(DW_ACCESS_public)
    4838              $C$DW$742       .dwtag  DW_TAG_member
    4839                      .dwattr $C$DW$742, DW_AT_type(*$C$DW$T$75)
    4840                      .dwattr $C$DW$742, DW_AT_name("targetProc")
    4841                      .dwattr $C$DW$742, DW_AT_TI_symbol_name("_targetProc")
    4842                      .dwattr $C$DW$742, DW_AT_data_member_location[DW_OP_plus_uconst 0x1]
    4843                      .dwattr $C$DW$742, DW_AT_accessibility(DW_ACCESS_public)
    4844              $C$DW$743       .dwtag  DW_TAG_member
    4845                      .dwattr $C$DW$743, DW_AT_type(*$C$DW$T$24)
    4846                      .dwattr $C$DW$743, DW_AT_name("major")
    4847                      .dwattr $C$DW$743, DW_AT_TI_symbol_name("_major")
    4848                      .dwattr $C$DW$743, DW_AT_data_member_location[DW_OP_plus_uconst 0x2]
    4849                      .dwattr $C$DW$743, DW_AT_accessibility(DW_ACCESS_public)
    4850              $C$DW$744       .dwtag  DW_TAG_member
    4851                      .dwattr $C$DW$744, DW_AT_type(*$C$DW$T$24)
    4852                      .dwattr $C$DW$744, DW_AT_name("minor")
    4853                      .dwattr $C$DW$744, DW_AT_TI_symbol_name("_minor")
    4854                      .dwattr $C$DW$744, DW_AT_data_member_location[DW_OP_plus_uconst 0x3]
TMS320C2000 Assembler PC v6.2.5 Sat Sep 16 15:51:25 2017

Tools Copyright (c) 1996-2014 Texas Instruments Incorporated
C:\Users\wmj\AppData\Local\Temp\1710810                              PAGE   95

    4855                      .dwattr $C$DW$744, DW_AT_accessibility(DW_ACCESS_public)
    4856                      .dwendtag $C$DW$T$76
    4857              
    4858              $C$DW$T$40      .dwtag  DW_TAG_typedef, DW_AT_name("CTRL_Version")
    4859                      .dwattr $C$DW$T$40, DW_AT_type(*$C$DW$T$76)
    4860                      .dwattr $C$DW$T$40, DW_AT_language(DW_LANG_C)
    4861              $C$DW$T$299     .dwtag  DW_TAG_pointer_type
    4862                      .dwattr $C$DW$T$299, DW_AT_type(*$C$DW$T$40)
    4863                      .dwattr $C$DW$T$299, DW_AT_address_class(0x16)
    4864              
    4865              $C$DW$T$83      .dwtag  DW_TAG_structure_type
    4866                      .dwattr $C$DW$T$83, DW_AT_name("_DECODER_Obj_")
    4867                      .dwattr $C$DW$T$83, DW_AT_byte_size(0x06)
    4868              $C$DW$745       .dwtag  DW_TAG_member
    4869                      .dwattr $C$DW$745, DW_AT_type(*$C$DW$T$78)
    4870                      .dwattr $C$DW$745, DW_AT_name("spiHandle")
    4871                      .dwattr $C$DW$745, DW_AT_TI_symbol_name("_spiHandle")
    4872                      .dwattr $C$DW$745, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    4873                      .dwattr $C$DW$745, DW_AT_accessibility(DW_ACCESS_public)
    4874              $C$DW$746       .dwtag  DW_TAG_member
    4875                      .dwattr $C$DW$746, DW_AT_type(*$C$DW$T$80)
    4876                      .dwattr $C$DW$746, DW_AT_name("gpioHandle")
    4877                      .dwattr $C$DW$746, DW_AT_TI_symbol_name("_gpioHandle")
    4878                      .dwattr $C$DW$746, DW_AT_data_member_location[DW_OP_plus_uconst 0x2]
    4879                      .dwattr $C$DW$746, DW_AT_accessibility(DW_ACCESS_public)
    4880              $C$DW$747       .dwtag  DW_TAG_member
    4881                      .dwattr $C$DW$747, DW_AT_type(*$C$DW$T$82)
    4882                      .dwattr $C$DW$747, DW_AT_name("gpioNumber")
    4883                      .dwattr $C$DW$747, DW_AT_TI_symbol_name("_gpioNumber")
    4884                      .dwattr $C$DW$747, DW_AT_data_member_location[DW_OP_plus_uconst 0x4]
    4885                      .dwattr $C$DW$747, DW_AT_accessibility(DW_ACCESS_public)
    4886              $C$DW$748       .dwtag  DW_TAG_member
    4887                      .dwattr $C$DW$748, DW_AT_type(*$C$DW$T$72)
    4888                      .dwattr $C$DW$748, DW_AT_name("RxTimeOut")
    4889                      .dwattr $C$DW$748, DW_AT_TI_symbol_name("_RxTimeOut")
    4890                      .dwattr $C$DW$748, DW_AT_data_member_location[DW_OP_plus_uconst 0x5]
    4891                      .dwattr $C$DW$748, DW_AT_accessibility(DW_ACCESS_public)
    4892                      .dwendtag $C$DW$T$83
    4893              
    4894              $C$DW$T$237     .dwtag  DW_TAG_typedef, DW_AT_name("DECODER_Obj")
    4895                      .dwattr $C$DW$T$237, DW_AT_type(*$C$DW$T$83)
    4896                      .dwattr $C$DW$T$237, DW_AT_language(DW_LANG_C)
    4897              $C$DW$T$235     .dwtag  DW_TAG_pointer_type
    4898                      .dwattr $C$DW$T$235, DW_AT_type(*$C$DW$T$83)
    4899                      .dwattr $C$DW$T$235, DW_AT_address_class(0x16)
    4900              $C$DW$T$236     .dwtag  DW_TAG_typedef, DW_AT_name("DECODER_Handle")
    4901                      .dwattr $C$DW$T$236, DW_AT_type(*$C$DW$T$235)
    4902                      .dwattr $C$DW$T$236, DW_AT_language(DW_LANG_C)
    4903              
    4904              $C$DW$T$84      .dwtag  DW_TAG_structure_type
    4905                      .dwattr $C$DW$T$84, DW_AT_name("_DRIVE_CURRENT_t_")
    4906                      .dwattr $C$DW$T$84, DW_AT_byte_size(0x02)
    4907              $C$DW$749       .dwtag  DW_TAG_member
    4908                      .dwattr $C$DW$749, DW_AT_type(*$C$DW$T$24)
    4909                      .dwattr $C$DW$749, DW_AT_name("IDRIVE")
TMS320C2000 Assembler PC v6.2.5 Sat Sep 16 15:51:25 2017

Tools Copyright (c) 1996-2014 Texas Instruments Incorporated
C:\Users\wmj\AppData\Local\Temp\1710810                              PAGE   96

    4910                      .dwattr $C$DW$749, DW_AT_TI_symbol_name("_IDRIVE")
    4911                      .dwattr $C$DW$749, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    4912                      .dwattr $C$DW$749, DW_AT_accessibility(DW_ACCESS_public)
    4913              $C$DW$750       .dwtag  DW_TAG_member
    4914                      .dwattr $C$DW$750, DW_AT_type(*$C$DW$T$24)
    4915                      .dwattr $C$DW$750, DW_AT_name("INIT_IDRIVE")
    4916                      .dwattr $C$DW$750, DW_AT_TI_symbol_name("_INIT_IDRIVE")
    4917                      .dwattr $C$DW$750, DW_AT_data_member_location[DW_OP_plus_uconst 0x1]
    4918                      .dwattr $C$DW$750, DW_AT_accessibility(DW_ACCESS_public)
    4919                      .dwendtag $C$DW$T$84
    4920              
    4921              $C$DW$T$153     .dwtag  DW_TAG_typedef, DW_AT_name("DRIVE_CURRENT_t_")
    4922                      .dwattr $C$DW$T$153, DW_AT_type(*$C$DW$T$84)
    4923                      .dwattr $C$DW$T$153, DW_AT_language(DW_LANG_C)
    4924              
    4925              $C$DW$T$21      .dwtag  DW_TAG_structure_type
    4926                      .dwattr $C$DW$T$21, DW_AT_name("_EST_Obj_")
    4927                      .dwattr $C$DW$T$21, DW_AT_declaration
    4928                      .dwendtag $C$DW$T$21
    4929              
    4930              $C$DW$T$48      .dwtag  DW_TAG_pointer_type
    4931                      .dwattr $C$DW$T$48, DW_AT_type(*$C$DW$T$21)
    4932                      .dwattr $C$DW$T$48, DW_AT_address_class(0x16)
    4933              $C$DW$T$49      .dwtag  DW_TAG_typedef, DW_AT_name("EST_Handle")
    4934                      .dwattr $C$DW$T$49, DW_AT_type(*$C$DW$T$48)
    4935                      .dwattr $C$DW$T$49, DW_AT_language(DW_LANG_C)
    4936              
    4937              $C$DW$T$85      .dwtag  DW_TAG_structure_type
    4938                      .dwattr $C$DW$T$85, DW_AT_name("_FILTER_FO_")
    4939                      .dwattr $C$DW$T$85, DW_AT_byte_size(0x0a)
    4940              $C$DW$751       .dwtag  DW_TAG_member
    4941                      .dwattr $C$DW$751, DW_AT_type(*$C$DW$T$33)
    4942                      .dwattr $C$DW$751, DW_AT_name("a1")
    4943                      .dwattr $C$DW$751, DW_AT_TI_symbol_name("_a1")
    4944                      .dwattr $C$DW$751, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    4945                      .dwattr $C$DW$751, DW_AT_accessibility(DW_ACCESS_public)
    4946              $C$DW$752       .dwtag  DW_TAG_member
    4947                      .dwattr $C$DW$752, DW_AT_type(*$C$DW$T$33)
    4948                      .dwattr $C$DW$752, DW_AT_name("b0")
    4949                      .dwattr $C$DW$752, DW_AT_TI_symbol_name("_b0")
    4950                      .dwattr $C$DW$752, DW_AT_data_member_location[DW_OP_plus_uconst 0x2]
    4951                      .dwattr $C$DW$752, DW_AT_accessibility(DW_ACCESS_public)
    4952              $C$DW$753       .dwtag  DW_TAG_member
    4953                      .dwattr $C$DW$753, DW_AT_type(*$C$DW$T$33)
    4954                      .dwattr $C$DW$753, DW_AT_name("b1")
    4955                      .dwattr $C$DW$753, DW_AT_TI_symbol_name("_b1")
    4956                      .dwattr $C$DW$753, DW_AT_data_member_location[DW_OP_plus_uconst 0x4]
    4957                      .dwattr $C$DW$753, DW_AT_accessibility(DW_ACCESS_public)
    4958              $C$DW$754       .dwtag  DW_TAG_member
    4959                      .dwattr $C$DW$754, DW_AT_type(*$C$DW$T$33)
    4960                      .dwattr $C$DW$754, DW_AT_name("x1")
    4961                      .dwattr $C$DW$754, DW_AT_TI_symbol_name("_x1")
    4962                      .dwattr $C$DW$754, DW_AT_data_member_location[DW_OP_plus_uconst 0x6]
    4963                      .dwattr $C$DW$754, DW_AT_accessibility(DW_ACCESS_public)
    4964              $C$DW$755       .dwtag  DW_TAG_member
TMS320C2000 Assembler PC v6.2.5 Sat Sep 16 15:51:25 2017

Tools Copyright (c) 1996-2014 Texas Instruments Incorporated
C:\Users\wmj\AppData\Local\Temp\1710810                              PAGE   97

    4965                      .dwattr $C$DW$755, DW_AT_type(*$C$DW$T$33)
    4966                      .dwattr $C$DW$755, DW_AT_name("y1")
    4967                      .dwattr $C$DW$755, DW_AT_TI_symbol_name("_y1")
    4968                      .dwattr $C$DW$755, DW_AT_data_member_location[DW_OP_plus_uconst 0x8]
    4969                      .dwattr $C$DW$755, DW_AT_accessibility(DW_ACCESS_public)
    4970                      .dwendtag $C$DW$T$85
    4971              
    4972              $C$DW$T$196     .dwtag  DW_TAG_typedef, DW_AT_name("FILTER_FO_Obj")
    4973                      .dwattr $C$DW$T$196, DW_AT_type(*$C$DW$T$85)
    4974                      .dwattr $C$DW$T$196, DW_AT_language(DW_LANG_C)
    4975              
    4976              $C$DW$T$22      .dwtag  DW_TAG_structure_type
    4977                      .dwattr $C$DW$T$22, DW_AT_name("_FILTER_FO_Obj_")
    4978                      .dwattr $C$DW$T$22, DW_AT_declaration
    4979                      .dwendtag $C$DW$T$22
    4980              
    4981              $C$DW$T$197     .dwtag  DW_TAG_pointer_type
    4982                      .dwattr $C$DW$T$197, DW_AT_type(*$C$DW$T$22)
    4983                      .dwattr $C$DW$T$197, DW_AT_address_class(0x16)
    4984              $C$DW$T$198     .dwtag  DW_TAG_typedef, DW_AT_name("FILTER_FO_Handle")
    4985                      .dwattr $C$DW$T$198, DW_AT_type(*$C$DW$T$197)
    4986                      .dwattr $C$DW$T$198, DW_AT_language(DW_LANG_C)
    4987              
    4988              $C$DW$T$86      .dwtag  DW_TAG_structure_type
    4989                      .dwattr $C$DW$T$86, DW_AT_name("_FLASH_Obj_")
    4990                      .dwattr $C$DW$T$86, DW_AT_byte_size(0x08)
    4991              $C$DW$756       .dwtag  DW_TAG_member
    4992                      .dwattr $C$DW$756, DW_AT_type(*$C$DW$T$25)
    4993                      .dwattr $C$DW$756, DW_AT_name("FOPT")
    4994                      .dwattr $C$DW$756, DW_AT_TI_symbol_name("_FOPT")
    4995                      .dwattr $C$DW$756, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    4996                      .dwattr $C$DW$756, DW_AT_accessibility(DW_ACCESS_public)
    4997              $C$DW$757       .dwtag  DW_TAG_member
    4998                      .dwattr $C$DW$757, DW_AT_type(*$C$DW$T$25)
    4999                      .dwattr $C$DW$757, DW_AT_name("rsvd_1")
    5000                      .dwattr $C$DW$757, DW_AT_TI_symbol_name("_rsvd_1")
    5001                      .dwattr $C$DW$757, DW_AT_data_member_location[DW_OP_plus_uconst 0x1]
    5002                      .dwattr $C$DW$757, DW_AT_accessibility(DW_ACCESS_public)
    5003              $C$DW$758       .dwtag  DW_TAG_member
    5004                      .dwattr $C$DW$758, DW_AT_type(*$C$DW$T$25)
    5005                      .dwattr $C$DW$758, DW_AT_name("FPWR")
    5006                      .dwattr $C$DW$758, DW_AT_TI_symbol_name("_FPWR")
    5007                      .dwattr $C$DW$758, DW_AT_data_member_location[DW_OP_plus_uconst 0x2]
    5008                      .dwattr $C$DW$758, DW_AT_accessibility(DW_ACCESS_public)
    5009              $C$DW$759       .dwtag  DW_TAG_member
    5010                      .dwattr $C$DW$759, DW_AT_type(*$C$DW$T$25)
    5011                      .dwattr $C$DW$759, DW_AT_name("FSTATUS")
    5012                      .dwattr $C$DW$759, DW_AT_TI_symbol_name("_FSTATUS")
    5013                      .dwattr $C$DW$759, DW_AT_data_member_location[DW_OP_plus_uconst 0x3]
    5014                      .dwattr $C$DW$759, DW_AT_accessibility(DW_ACCESS_public)
    5015              $C$DW$760       .dwtag  DW_TAG_member
    5016                      .dwattr $C$DW$760, DW_AT_type(*$C$DW$T$25)
    5017                      .dwattr $C$DW$760, DW_AT_name("FSTDBYWAIT")
    5018                      .dwattr $C$DW$760, DW_AT_TI_symbol_name("_FSTDBYWAIT")
    5019                      .dwattr $C$DW$760, DW_AT_data_member_location[DW_OP_plus_uconst 0x4]
TMS320C2000 Assembler PC v6.2.5 Sat Sep 16 15:51:25 2017

Tools Copyright (c) 1996-2014 Texas Instruments Incorporated
C:\Users\wmj\AppData\Local\Temp\1710810                              PAGE   98

    5020                      .dwattr $C$DW$760, DW_AT_accessibility(DW_ACCESS_public)
    5021              $C$DW$761       .dwtag  DW_TAG_member
    5022                      .dwattr $C$DW$761, DW_AT_type(*$C$DW$T$25)
    5023                      .dwattr $C$DW$761, DW_AT_name("FACTIVEWAIT")
    5024                      .dwattr $C$DW$761, DW_AT_TI_symbol_name("_FACTIVEWAIT")
    5025                      .dwattr $C$DW$761, DW_AT_data_member_location[DW_OP_plus_uconst 0x5]
    5026                      .dwattr $C$DW$761, DW_AT_accessibility(DW_ACCESS_public)
    5027              $C$DW$762       .dwtag  DW_TAG_member
    5028                      .dwattr $C$DW$762, DW_AT_type(*$C$DW$T$25)
    5029                      .dwattr $C$DW$762, DW_AT_name("FBANKWAIT")
    5030                      .dwattr $C$DW$762, DW_AT_TI_symbol_name("_FBANKWAIT")
    5031                      .dwattr $C$DW$762, DW_AT_data_member_location[DW_OP_plus_uconst 0x6]
    5032                      .dwattr $C$DW$762, DW_AT_accessibility(DW_ACCESS_public)
    5033              $C$DW$763       .dwtag  DW_TAG_member
    5034                      .dwattr $C$DW$763, DW_AT_type(*$C$DW$T$25)
    5035                      .dwattr $C$DW$763, DW_AT_name("FOTPWAIT")
    5036                      .dwattr $C$DW$763, DW_AT_TI_symbol_name("_FOTPWAIT")
    5037                      .dwattr $C$DW$763, DW_AT_data_member_location[DW_OP_plus_uconst 0x7]
    5038                      .dwattr $C$DW$763, DW_AT_accessibility(DW_ACCESS_public)
    5039                      .dwendtag $C$DW$T$86
    5040              
    5041              $C$DW$T$99      .dwtag  DW_TAG_pointer_type
    5042                      .dwattr $C$DW$T$99, DW_AT_type(*$C$DW$T$86)
    5043                      .dwattr $C$DW$T$99, DW_AT_address_class(0x16)
    5044              $C$DW$T$100     .dwtag  DW_TAG_typedef, DW_AT_name("FLASH_Handle")
    5045                      .dwattr $C$DW$T$100, DW_AT_type(*$C$DW$T$99)
    5046                      .dwattr $C$DW$T$100, DW_AT_language(DW_LANG_C)
    5047              
    5048              $C$DW$T$90      .dwtag  DW_TAG_structure_type
    5049                      .dwattr $C$DW$T$90, DW_AT_name("_GPIO_Obj_")
    5050                      .dwattr $C$DW$T$90, DW_AT_byte_size(0x6a)
    5051              $C$DW$764       .dwtag  DW_TAG_member
    5052                      .dwattr $C$DW$764, DW_AT_type(*$C$DW$T$87)
    5053                      .dwattr $C$DW$764, DW_AT_name("GPACTRL")
    5054                      .dwattr $C$DW$764, DW_AT_TI_symbol_name("_GPACTRL")
    5055                      .dwattr $C$DW$764, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    5056                      .dwattr $C$DW$764, DW_AT_accessibility(DW_ACCESS_public)
    5057              $C$DW$765       .dwtag  DW_TAG_member
    5058                      .dwattr $C$DW$765, DW_AT_type(*$C$DW$T$87)
    5059                      .dwattr $C$DW$765, DW_AT_name("GPAQSEL1")
    5060                      .dwattr $C$DW$765, DW_AT_TI_symbol_name("_GPAQSEL1")
    5061                      .dwattr $C$DW$765, DW_AT_data_member_location[DW_OP_plus_uconst 0x2]
    5062                      .dwattr $C$DW$765, DW_AT_accessibility(DW_ACCESS_public)
    5063              $C$DW$766       .dwtag  DW_TAG_member
    5064                      .dwattr $C$DW$766, DW_AT_type(*$C$DW$T$87)
    5065                      .dwattr $C$DW$766, DW_AT_name("GPAQSEL2")
    5066                      .dwattr $C$DW$766, DW_AT_TI_symbol_name("_GPAQSEL2")
    5067                      .dwattr $C$DW$766, DW_AT_data_member_location[DW_OP_plus_uconst 0x4]
    5068                      .dwattr $C$DW$766, DW_AT_accessibility(DW_ACCESS_public)
    5069              $C$DW$767       .dwtag  DW_TAG_member
    5070                      .dwattr $C$DW$767, DW_AT_type(*$C$DW$T$87)
    5071                      .dwattr $C$DW$767, DW_AT_name("GPAMUX1")
    5072                      .dwattr $C$DW$767, DW_AT_TI_symbol_name("_GPAMUX1")
    5073                      .dwattr $C$DW$767, DW_AT_data_member_location[DW_OP_plus_uconst 0x6]
    5074                      .dwattr $C$DW$767, DW_AT_accessibility(DW_ACCESS_public)
TMS320C2000 Assembler PC v6.2.5 Sat Sep 16 15:51:25 2017

Tools Copyright (c) 1996-2014 Texas Instruments Incorporated
C:\Users\wmj\AppData\Local\Temp\1710810                              PAGE   99

    5075              $C$DW$768       .dwtag  DW_TAG_member
    5076                      .dwattr $C$DW$768, DW_AT_type(*$C$DW$T$87)
    5077                      .dwattr $C$DW$768, DW_AT_name("GPAMUX2")
    5078                      .dwattr $C$DW$768, DW_AT_TI_symbol_name("_GPAMUX2")
    5079                      .dwattr $C$DW$768, DW_AT_data_member_location[DW_OP_plus_uconst 0x8]
    5080                      .dwattr $C$DW$768, DW_AT_accessibility(DW_ACCESS_public)
    5081              $C$DW$769       .dwtag  DW_TAG_member
    5082                      .dwattr $C$DW$769, DW_AT_type(*$C$DW$T$87)
    5083                      .dwattr $C$DW$769, DW_AT_name("GPADIR")
    5084                      .dwattr $C$DW$769, DW_AT_TI_symbol_name("_GPADIR")
    5085                      .dwattr $C$DW$769, DW_AT_data_member_location[DW_OP_plus_uconst 0xa]
    5086                      .dwattr $C$DW$769, DW_AT_accessibility(DW_ACCESS_public)
    5087              $C$DW$770       .dwtag  DW_TAG_member
    5088                      .dwattr $C$DW$770, DW_AT_type(*$C$DW$T$87)
    5089                      .dwattr $C$DW$770, DW_AT_name("GPAPUD")
    5090                      .dwattr $C$DW$770, DW_AT_TI_symbol_name("_GPAPUD")
    5091                      .dwattr $C$DW$770, DW_AT_data_member_location[DW_OP_plus_uconst 0xc]
    5092                      .dwattr $C$DW$770, DW_AT_accessibility(DW_ACCESS_public)
    5093              $C$DW$771       .dwtag  DW_TAG_member
    5094                      .dwattr $C$DW$771, DW_AT_type(*$C$DW$T$28)
    5095                      .dwattr $C$DW$771, DW_AT_name("rsvd_1")
    5096                      .dwattr $C$DW$771, DW_AT_TI_symbol_name("_rsvd_1")
    5097                      .dwattr $C$DW$771, DW_AT_data_member_location[DW_OP_plus_uconst 0xe]
    5098                      .dwattr $C$DW$771, DW_AT_accessibility(DW_ACCESS_public)
    5099              $C$DW$772       .dwtag  DW_TAG_member
    5100                      .dwattr $C$DW$772, DW_AT_type(*$C$DW$T$87)
    5101                      .dwattr $C$DW$772, DW_AT_name("GPBCTRL")
    5102                      .dwattr $C$DW$772, DW_AT_TI_symbol_name("_GPBCTRL")
    5103                      .dwattr $C$DW$772, DW_AT_data_member_location[DW_OP_plus_uconst 0x10]
