TMS320C2000 Assembler PC v6.2.5 Tue Sep 26 10:29:40 2017

Tools Copyright (c) 1996-2014 Texas Instruments Incorporated
C:\Users\wmj\AppData\Local\Temp\1168813                              PAGE    1

       1              ;***************************************************************
       2              ;* TMS320C2000 C/C++ Codegen                         PC v6.2.5 *
       3              ;* Date/Time created: Tue Sep 26 10:29:39 2017                 *
       4              ;***************************************************************
       5                      .compiler_opts --float_support=softlib --hll_source=on --mem_model:code=flat --mem_model:data=large -
       6        0002  FP      .set    XAR2
       7              
       8              $C$DW$CU        .dwtag  DW_TAG_compile_unit
       9                      .dwattr $C$DW$CU, DW_AT_name("D:/BM1000/sw/solutions/instaspin_foc/src/proj_lab05b.c")
      10                      .dwattr $C$DW$CU, DW_AT_producer("TMS320C2000 C/C++ Codegen PC v6.2.5 Copyright (c) 1996-2014 Texas I
      11                      .dwattr $C$DW$CU, DW_AT_TI_version(0x01)
      12                      .dwattr $C$DW$CU, DW_AT_comp_dir("D:\BM1000\sw\solutions\instaspin_foc\boards\hvkit_rev1p1\f28x\f2802
      13              ;**************************************************************
      14              ;* CINIT RECORDS                                              *

    3922              $C$DW$580       .dwtag  DW_TAG_enumerator, DW_AT_name("ADC_ResultNumber_11"), DW_AT_const_value(0x0b)
    3923              $C$DW$581       .dwtag  DW_TAG_enumerator, DW_AT_name("ADC_ResultNumber_12"), DW_AT_const_value(0x0c)
    3924              $C$DW$582       .dwtag  DW_TAG_enumerator, DW_AT_name("ADC_ResultNumber_13"), DW_AT_const_value(0x0d)
    3925              $C$DW$583       .dwtag  DW_TAG_enumerator, DW_AT_name("ADC_ResultNumber_14"), DW_AT_const_value(0x0e)
    3926              $C$DW$584       .dwtag  DW_TAG_enumerator, DW_AT_name("ADC_ResultNumber_15"), DW_AT_const_value(0x0f)
    3927                      .dwendtag $C$DW$T$232
    3928              
    3929              $C$DW$T$233     .dwtag  DW_TAG_typedef, DW_AT_name("ADC_ResultNumber_e")
    3930                      .dwattr $C$DW$T$233, DW_AT_type(*$C$DW$T$232)
    3931                      .dwattr $C$DW$T$233, DW_AT_language(DW_LANG_C)
    3932              
    3933              $C$DW$T$235     .dwtag  DW_TAG_enumeration_type
    3934                      .dwattr $C$DW$T$235, DW_AT_byte_size(0x01)
    3935              $C$DW$585       .dwtag  DW_TAG_enumerator, DW_AT_name("PIE_GroupNumber_1"), DW_AT_const_value(0x00)
    3936              $C$DW$586       .dwtag  DW_TAG_enumerator, DW_AT_name("PIE_GroupNumber_2"), DW_AT_const_value(0x01)
    3937              $C$DW$587       .dwtag  DW_TAG_enumerator, DW_AT_name("PIE_GroupNumber_3"), DW_AT_const_value(0x02)
    3938              $C$DW$588       .dwtag  DW_TAG_enumerator, DW_AT_name("PIE_GroupNumber_4"), DW_AT_const_value(0x03)
    3939              $C$DW$589       .dwtag  DW_TAG_enumerator, DW_AT_name("PIE_GroupNumber_5"), DW_AT_const_value(0x04)
    3940              $C$DW$590       .dwtag  DW_TAG_enumerator, DW_AT_name("PIE_GroupNumber_6"), DW_AT_const_value(0x05)
    3941              $C$DW$591       .dwtag  DW_TAG_enumerator, DW_AT_name("PIE_GroupNumber_7"), DW_AT_const_value(0x06)
    3942              $C$DW$592       .dwtag  DW_TAG_enumerator, DW_AT_name("PIE_GroupNumber_8"), DW_AT_const_value(0x07)
    3943              $C$DW$593       .dwtag  DW_TAG_enumerator, DW_AT_name("PIE_GroupNumber_9"), DW_AT_const_value(0x08)
    3944              $C$DW$594       .dwtag  DW_TAG_enumerator, DW_AT_name("PIE_GroupNumber_10"), DW_AT_const_value(0x09)
    3945              $C$DW$595       .dwtag  DW_TAG_enumerator, DW_AT_name("PIE_GroupNumber_11"), DW_AT_const_value(0x0a)
    3946              $C$DW$596       .dwtag  DW_TAG_enumerator, DW_AT_name("PIE_GroupNumber_12"), DW_AT_const_value(0x0b)
    3947                      .dwendtag $C$DW$T$235
    3948              
    3949              $C$DW$T$236     .dwtag  DW_TAG_typedef, DW_AT_name("PIE_GroupNumber_e")
    3950                      .dwattr $C$DW$T$236, DW_AT_type(*$C$DW$T$235)
    3951                      .dwattr $C$DW$T$236, DW_AT_language(DW_LANG_C)
    3952              
    3953              $C$DW$T$238     .dwtag  DW_TAG_enumeration_type
    3954                      .dwattr $C$DW$T$238, DW_AT_byte_size(0x01)
    3955              $C$DW$597       .dwtag  DW_TAG_enumerator, DW_AT_name("CTRL_Type_PID_spd"), DW_AT_const_value(0x00)
    3956              $C$DW$598       .dwtag  DW_TAG_enumerator, DW_AT_name("CTRL_Type_PID_Id"), DW_AT_const_value(0x01)
    3957              $C$DW$599       .dwtag  DW_TAG_enumerator, DW_AT_name("CTRL_Type_PID_Iq"), DW_AT_const_value(0x02)
    3958                      .dwendtag $C$DW$T$238
    3959              
    3960              $C$DW$T$239     .dwtag  DW_TAG_typedef, DW_AT_name("CTRL_Type_e")
    3961                      .dwattr $C$DW$T$239, DW_AT_type(*$C$DW$T$238)
    3962                      .dwattr $C$DW$T$239, DW_AT_language(DW_LANG_C)
    3963              
    3964              $C$DW$T$241     .dwtag  DW_TAG_enumeration_type
    3965                      .dwattr $C$DW$T$241, DW_AT_byte_size(0x01)
    3966              $C$DW$600       .dwtag  DW_TAG_enumerator, DW_AT_name("HAL_SensorType_Current"), DW_AT_const_value(0x00)
    3967              $C$DW$601       .dwtag  DW_TAG_enumerator, DW_AT_name("HAL_SensorType_Voltage"), DW_AT_const_value(0x01)
    3968                      .dwendtag $C$DW$T$241
TMS320C2000 Assembler PC v6.2.5 Tue Sep 26 10:29:40 2017

Tools Copyright (c) 1996-2014 Texas Instruments Incorporated
C:\Users\wmj\AppData\Local\Temp\1168813                              PAGE   79

    3969              
    3970              $C$DW$T$242     .dwtag  DW_TAG_typedef, DW_AT_name("HAL_SensorType_e")
    3971                      .dwattr $C$DW$T$242, DW_AT_type(*$C$DW$T$241)
    3972                      .dwattr $C$DW$T$242, DW_AT_language(DW_LANG_C)
    3973              
    3974              $C$DW$T$19      .dwtag  DW_TAG_structure_type
    3975                      .dwattr $C$DW$T$19, DW_AT_name("I2C_Obj")
    3976                      .dwattr $C$DW$T$19, DW_AT_declaration
    3977                      .dwendtag $C$DW$T$19
    3978              
    3979              $C$DW$T$117     .dwtag  DW_TAG_pointer_type
    3980                      .dwattr $C$DW$T$117, DW_AT_type(*$C$DW$T$19)
    3981                      .dwattr $C$DW$T$117, DW_AT_address_class(0x16)
    3982              $C$DW$T$118     .dwtag  DW_TAG_typedef, DW_AT_name("I2C_Handle")
    3983                      .dwattr $C$DW$T$118, DW_AT_type(*$C$DW$T$117)
    3984                      .dwattr $C$DW$T$118, DW_AT_language(DW_LANG_C)
    3985              
    3986              $C$DW$T$31      .dwtag  DW_TAG_structure_type
    3987                      .dwattr $C$DW$T$31, DW_AT_name("_ADC_Obj_")
    3988                      .dwattr $C$DW$T$31, DW_AT_byte_size(0x6650)
    3989              $C$DW$602       .dwtag  DW_TAG_member
    3990                      .dwattr $C$DW$602, DW_AT_type(*$C$DW$T$25)
    3991                      .dwattr $C$DW$602, DW_AT_name("ADCRESULT")
    3992                      .dwattr $C$DW$602, DW_AT_TI_symbol_name("_ADCRESULT")
    3993                      .dwattr $C$DW$602, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    3994                      .dwattr $C$DW$602, DW_AT_accessibility(DW_ACCESS_public)
    3995              $C$DW$603       .dwtag  DW_TAG_member
    3996                      .dwattr $C$DW$603, DW_AT_type(*$C$DW$T$26)
    3997                      .dwattr $C$DW$603, DW_AT_name("resvd_1")
    3998                      .dwattr $C$DW$603, DW_AT_TI_symbol_name("_resvd_1")
    3999                      .dwattr $C$DW$603, DW_AT_data_member_location[DW_OP_plus_uconst 0x10]
    4000                      .dwattr $C$DW$603, DW_AT_accessibility(DW_ACCESS_public)
    4001              $C$DW$604       .dwtag  DW_TAG_member
    4002                      .dwattr $C$DW$604, DW_AT_type(*$C$DW$T$24)
    4003                      .dwattr $C$DW$604, DW_AT_name("ADCCTL1")
    4004                      .dwattr $C$DW$604, DW_AT_TI_symbol_name("_ADCCTL1")
    4005                      .dwattr $C$DW$604, DW_AT_data_member_location[DW_OP_plus_uconst 0x6600]
    4006                      .dwattr $C$DW$604, DW_AT_accessibility(DW_ACCESS_public)
    4007              $C$DW$605       .dwtag  DW_TAG_member
    4008                      .dwattr $C$DW$605, DW_AT_type(*$C$DW$T$24)
    4009                      .dwattr $C$DW$605, DW_AT_name("ADCCTL2")
    4010                      .dwattr $C$DW$605, DW_AT_TI_symbol_name("_ADCCTL2")
    4011                      .dwattr $C$DW$605, DW_AT_data_member_location[DW_OP_plus_uconst 0x6601]
    4012                      .dwattr $C$DW$605, DW_AT_accessibility(DW_ACCESS_public)
    4013              $C$DW$606       .dwtag  DW_TAG_member
    4014                      .dwattr $C$DW$606, DW_AT_type(*$C$DW$T$27)
    4015                      .dwattr $C$DW$606, DW_AT_name("rsvd_2")
    4016                      .dwattr $C$DW$606, DW_AT_TI_symbol_name("_rsvd_2")
    4017                      .dwattr $C$DW$606, DW_AT_data_member_location[DW_OP_plus_uconst 0x6602]
    4018                      .dwattr $C$DW$606, DW_AT_accessibility(DW_ACCESS_public)
    4019              $C$DW$607       .dwtag  DW_TAG_member
    4020                      .dwattr $C$DW$607, DW_AT_type(*$C$DW$T$24)
    4021                      .dwattr $C$DW$607, DW_AT_name("ADCINTFLG")
    4022                      .dwattr $C$DW$607, DW_AT_TI_symbol_name("_ADCINTFLG")
    4023                      .dwattr $C$DW$607, DW_AT_data_member_location[DW_OP_plus_uconst 0x6604]
TMS320C2000 Assembler PC v6.2.5 Tue Sep 26 10:29:40 2017

Tools Copyright (c) 1996-2014 Texas Instruments Incorporated
C:\Users\wmj\AppData\Local\Temp\1168813                              PAGE   80

    4024                      .dwattr $C$DW$607, DW_AT_accessibility(DW_ACCESS_public)
    4025              $C$DW$608       .dwtag  DW_TAG_member
    4026                      .dwattr $C$DW$608, DW_AT_type(*$C$DW$T$24)
    4027                      .dwattr $C$DW$608, DW_AT_name("ADCINTFLGCLR")
    4028                      .dwattr $C$DW$608, DW_AT_TI_symbol_name("_ADCINTFLGCLR")
    4029                      .dwattr $C$DW$608, DW_AT_data_member_location[DW_OP_plus_uconst 0x6605]
    4030                      .dwattr $C$DW$608, DW_AT_accessibility(DW_ACCESS_public)
    4031              $C$DW$609       .dwtag  DW_TAG_member
    4032                      .dwattr $C$DW$609, DW_AT_type(*$C$DW$T$24)
    4033                      .dwattr $C$DW$609, DW_AT_name("ADCINTOVF")
    4034                      .dwattr $C$DW$609, DW_AT_TI_symbol_name("_ADCINTOVF")
    4035                      .dwattr $C$DW$609, DW_AT_data_member_location[DW_OP_plus_uconst 0x6606]
    4036                      .dwattr $C$DW$609, DW_AT_accessibility(DW_ACCESS_public)
    4037              $C$DW$610       .dwtag  DW_TAG_member
    4038                      .dwattr $C$DW$610, DW_AT_type(*$C$DW$T$24)
    4039                      .dwattr $C$DW$610, DW_AT_name("ADCINTOVFCLR")
    4040                      .dwattr $C$DW$610, DW_AT_TI_symbol_name("_ADCINTOVFCLR")
    4041                      .dwattr $C$DW$610, DW_AT_data_member_location[DW_OP_plus_uconst 0x6607]
    4042                      .dwattr $C$DW$610, DW_AT_accessibility(DW_ACCESS_public)
    4043              $C$DW$611       .dwtag  DW_TAG_member
    4044                      .dwattr $C$DW$611, DW_AT_type(*$C$DW$T$28)
    4045                      .dwattr $C$DW$611, DW_AT_name("INTSELxNy")
    4046                      .dwattr $C$DW$611, DW_AT_TI_symbol_name("_INTSELxNy")
    4047                      .dwattr $C$DW$611, DW_AT_data_member_location[DW_OP_plus_uconst 0x6608]
    4048                      .dwattr $C$DW$611, DW_AT_accessibility(DW_ACCESS_public)
    4049              $C$DW$612       .dwtag  DW_TAG_member
    4050                      .dwattr $C$DW$612, DW_AT_type(*$C$DW$T$29)
    4051                      .dwattr $C$DW$612, DW_AT_name("rsvd_3")
    4052                      .dwattr $C$DW$612, DW_AT_TI_symbol_name("_rsvd_3")
    4053                      .dwattr $C$DW$612, DW_AT_data_member_location[DW_OP_plus_uconst 0x660d]
    4054                      .dwattr $C$DW$612, DW_AT_accessibility(DW_ACCESS_public)
    4055              $C$DW$613       .dwtag  DW_TAG_member
    4056                      .dwattr $C$DW$613, DW_AT_type(*$C$DW$T$24)
    4057                      .dwattr $C$DW$613, DW_AT_name("SOCPRICTRL")
    4058                      .dwattr $C$DW$613, DW_AT_TI_symbol_name("_SOCPRICTRL")
    4059                      .dwattr $C$DW$613, DW_AT_data_member_location[DW_OP_plus_uconst 0x6610]
    4060                      .dwattr $C$DW$613, DW_AT_accessibility(DW_ACCESS_public)
    4061              $C$DW$614       .dwtag  DW_TAG_member
    4062                      .dwattr $C$DW$614, DW_AT_type(*$C$DW$T$24)
    4063                      .dwattr $C$DW$614, DW_AT_name("rsvd_4")
    4064                      .dwattr $C$DW$614, DW_AT_TI_symbol_name("_rsvd_4")
    4065                      .dwattr $C$DW$614, DW_AT_data_member_location[DW_OP_plus_uconst 0x6611]
    4066                      .dwattr $C$DW$614, DW_AT_accessibility(DW_ACCESS_public)
    4067              $C$DW$615       .dwtag  DW_TAG_member
    4068                      .dwattr $C$DW$615, DW_AT_type(*$C$DW$T$24)
    4069                      .dwattr $C$DW$615, DW_AT_name("ADCSAMPLEMODE")
    4070                      .dwattr $C$DW$615, DW_AT_TI_symbol_name("_ADCSAMPLEMODE")
    4071                      .dwattr $C$DW$615, DW_AT_data_member_location[DW_OP_plus_uconst 0x6612]
    4072                      .dwattr $C$DW$615, DW_AT_accessibility(DW_ACCESS_public)
    4073              $C$DW$616       .dwtag  DW_TAG_member
    4074                      .dwattr $C$DW$616, DW_AT_type(*$C$DW$T$24)
    4075                      .dwattr $C$DW$616, DW_AT_name("rsvd_5")
    4076                      .dwattr $C$DW$616, DW_AT_TI_symbol_name("_rsvd_5")
    4077                      .dwattr $C$DW$616, DW_AT_data_member_location[DW_OP_plus_uconst 0x6613]
    4078                      .dwattr $C$DW$616, DW_AT_accessibility(DW_ACCESS_public)
TMS320C2000 Assembler PC v6.2.5 Tue Sep 26 10:29:40 2017

Tools Copyright (c) 1996-2014 Texas Instruments Incorporated
C:\Users\wmj\AppData\Local\Temp\1168813                              PAGE   81

    4079              $C$DW$617       .dwtag  DW_TAG_member
    4080                      .dwattr $C$DW$617, DW_AT_type(*$C$DW$T$24)
    4081                      .dwattr $C$DW$617, DW_AT_name("ADCINTSOCSEL1")
    4082                      .dwattr $C$DW$617, DW_AT_TI_symbol_name("_ADCINTSOCSEL1")
    4083                      .dwattr $C$DW$617, DW_AT_data_member_location[DW_OP_plus_uconst 0x6614]
    4084                      .dwattr $C$DW$617, DW_AT_accessibility(DW_ACCESS_public)
    4085              $C$DW$618       .dwtag  DW_TAG_member
    4086                      .dwattr $C$DW$618, DW_AT_type(*$C$DW$T$24)
    4087                      .dwattr $C$DW$618, DW_AT_name("ADCINTSOCSEL2")
    4088                      .dwattr $C$DW$618, DW_AT_TI_symbol_name("_ADCINTSOCSEL2")
    4089                      .dwattr $C$DW$618, DW_AT_data_member_location[DW_OP_plus_uconst 0x6615]
    4090                      .dwattr $C$DW$618, DW_AT_accessibility(DW_ACCESS_public)
    4091              $C$DW$619       .dwtag  DW_TAG_member
    4092                      .dwattr $C$DW$619, DW_AT_type(*$C$DW$T$27)
    4093                      .dwattr $C$DW$619, DW_AT_name("rsvd_6")
    4094                      .dwattr $C$DW$619, DW_AT_TI_symbol_name("_rsvd_6")
    4095                      .dwattr $C$DW$619, DW_AT_data_member_location[DW_OP_plus_uconst 0x6616]
    4096                      .dwattr $C$DW$619, DW_AT_accessibility(DW_ACCESS_public)
    4097              $C$DW$620       .dwtag  DW_TAG_member
    4098                      .dwattr $C$DW$620, DW_AT_type(*$C$DW$T$24)
    4099                      .dwattr $C$DW$620, DW_AT_name("ADCSOCFLG1")
    4100                      .dwattr $C$DW$620, DW_AT_TI_symbol_name("_ADCSOCFLG1")
    4101                      .dwattr $C$DW$620, DW_AT_data_member_location[DW_OP_plus_uconst 0x6618]
    4102                      .dwattr $C$DW$620, DW_AT_accessibility(DW_ACCESS_public)
    4103              $C$DW$621       .dwtag  DW_TAG_member
    4104                      .dwattr $C$DW$621, DW_AT_type(*$C$DW$T$24)
    4105                      .dwattr $C$DW$621, DW_AT_name("rsvd_7")
    4106                      .dwattr $C$DW$621, DW_AT_TI_symbol_name("_rsvd_7")
    4107                      .dwattr $C$DW$621, DW_AT_data_member_location[DW_OP_plus_uconst 0x6619]
    4108                      .dwattr $C$DW$621, DW_AT_accessibility(DW_ACCESS_public)
    4109              $C$DW$622       .dwtag  DW_TAG_member
    4110                      .dwattr $C$DW$622, DW_AT_type(*$C$DW$T$24)
    4111                      .dwattr $C$DW$622, DW_AT_name("ADCSOCFRC1")
    4112                      .dwattr $C$DW$622, DW_AT_TI_symbol_name("_ADCSOCFRC1")
    4113                      .dwattr $C$DW$622, DW_AT_data_member_location[DW_OP_plus_uconst 0x661a]
    4114                      .dwattr $C$DW$622, DW_AT_accessibility(DW_ACCESS_public)
    4115              $C$DW$623       .dwtag  DW_TAG_member
    4116                      .dwattr $C$DW$623, DW_AT_type(*$C$DW$T$24)
    4117                      .dwattr $C$DW$623, DW_AT_name("rsvd_8")
    4118                      .dwattr $C$DW$623, DW_AT_TI_symbol_name("_rsvd_8")
    4119                      .dwattr $C$DW$623, DW_AT_data_member_location[DW_OP_plus_uconst 0x661b]
    4120                      .dwattr $C$DW$623, DW_AT_accessibility(DW_ACCESS_public)
    4121              $C$DW$624       .dwtag  DW_TAG_member
    4122                      .dwattr $C$DW$624, DW_AT_type(*$C$DW$T$24)
    4123                      .dwattr $C$DW$624, DW_AT_name("ADCSOCOVF1")
    4124                      .dwattr $C$DW$624, DW_AT_TI_symbol_name("_ADCSOCOVF1")
    4125                      .dwattr $C$DW$624, DW_AT_data_member_location[DW_OP_plus_uconst 0x661c]
    4126                      .dwattr $C$DW$624, DW_AT_accessibility(DW_ACCESS_public)
    4127              $C$DW$625       .dwtag  DW_TAG_member
    4128                      .dwattr $C$DW$625, DW_AT_type(*$C$DW$T$24)
    4129                      .dwattr $C$DW$625, DW_AT_name("rsvd_9")
    4130                      .dwattr $C$DW$625, DW_AT_TI_symbol_name("_rsvd_9")
    4131                      .dwattr $C$DW$625, DW_AT_data_member_location[DW_OP_plus_uconst 0x661d]
    4132                      .dwattr $C$DW$625, DW_AT_accessibility(DW_ACCESS_public)
    4133              $C$DW$626       .dwtag  DW_TAG_member
TMS320C2000 Assembler PC v6.2.5 Tue Sep 26 10:29:40 2017

Tools Copyright (c) 1996-2014 Texas Instruments Incorporated
C:\Users\wmj\AppData\Local\Temp\1168813                              PAGE   82

    4134                      .dwattr $C$DW$626, DW_AT_type(*$C$DW$T$24)
    4135                      .dwattr $C$DW$626, DW_AT_name("ADCSOCOVFCLR1")
    4136                      .dwattr $C$DW$626, DW_AT_TI_symbol_name("_ADCSOCOVFCLR1")
    4137                      .dwattr $C$DW$626, DW_AT_data_member_location[DW_OP_plus_uconst 0x661e]
    4138                      .dwattr $C$DW$626, DW_AT_accessibility(DW_ACCESS_public)
    4139              $C$DW$627       .dwtag  DW_TAG_member
    4140                      .dwattr $C$DW$627, DW_AT_type(*$C$DW$T$24)
    4141                      .dwattr $C$DW$627, DW_AT_name("rsvd_10")
    4142                      .dwattr $C$DW$627, DW_AT_TI_symbol_name("_rsvd_10")
    4143                      .dwattr $C$DW$627, DW_AT_data_member_location[DW_OP_plus_uconst 0x661f]
    4144                      .dwattr $C$DW$627, DW_AT_accessibility(DW_ACCESS_public)
    4145              $C$DW$628       .dwtag  DW_TAG_member
    4146                      .dwattr $C$DW$628, DW_AT_type(*$C$DW$T$25)
    4147                      .dwattr $C$DW$628, DW_AT_name("ADCSOCxCTL")
    4148                      .dwattr $C$DW$628, DW_AT_TI_symbol_name("_ADCSOCxCTL")
    4149                      .dwattr $C$DW$628, DW_AT_data_member_location[DW_OP_plus_uconst 0x6620]
    4150                      .dwattr $C$DW$628, DW_AT_accessibility(DW_ACCESS_public)
    4151              $C$DW$629       .dwtag  DW_TAG_member
    4152                      .dwattr $C$DW$629, DW_AT_type(*$C$DW$T$25)
    4153                      .dwattr $C$DW$629, DW_AT_name("rsvd_11")
    4154                      .dwattr $C$DW$629, DW_AT_TI_symbol_name("_rsvd_11")
    4155                      .dwattr $C$DW$629, DW_AT_data_member_location[DW_OP_plus_uconst 0x6630]
    4156                      .dwattr $C$DW$629, DW_AT_accessibility(DW_ACCESS_public)
    4157              $C$DW$630       .dwtag  DW_TAG_member
    4158                      .dwattr $C$DW$630, DW_AT_type(*$C$DW$T$24)
    4159                      .dwattr $C$DW$630, DW_AT_name("ADCREFTRIM")
    4160                      .dwattr $C$DW$630, DW_AT_TI_symbol_name("_ADCREFTRIM")
    4161                      .dwattr $C$DW$630, DW_AT_data_member_location[DW_OP_plus_uconst 0x6640]
    4162                      .dwattr $C$DW$630, DW_AT_accessibility(DW_ACCESS_public)
    4163              $C$DW$631       .dwtag  DW_TAG_member
    4164                      .dwattr $C$DW$631, DW_AT_type(*$C$DW$T$24)
    4165                      .dwattr $C$DW$631, DW_AT_name("ADCOFFTRIM")
    4166                      .dwattr $C$DW$631, DW_AT_TI_symbol_name("_ADCOFFTRIM")
    4167                      .dwattr $C$DW$631, DW_AT_data_member_location[DW_OP_plus_uconst 0x6641]
    4168                      .dwattr $C$DW$631, DW_AT_accessibility(DW_ACCESS_public)
    4169              $C$DW$632       .dwtag  DW_TAG_member
    4170                      .dwattr $C$DW$632, DW_AT_type(*$C$DW$T$30)
    4171                      .dwattr $C$DW$632, DW_AT_name("resvd_12")
    4172                      .dwattr $C$DW$632, DW_AT_TI_symbol_name("_resvd_12")
    4173                      .dwattr $C$DW$632, DW_AT_data_member_location[DW_OP_plus_uconst 0x6642]
    4174                      .dwattr $C$DW$632, DW_AT_accessibility(DW_ACCESS_public)
    4175              $C$DW$633       .dwtag  DW_TAG_member
    4176                      .dwattr $C$DW$633, DW_AT_type(*$C$DW$T$24)
    4177                      .dwattr $C$DW$633, DW_AT_name("ADCREV")
    4178                      .dwattr $C$DW$633, DW_AT_TI_symbol_name("_ADCREV")
    4179                      .dwattr $C$DW$633, DW_AT_data_member_location[DW_OP_plus_uconst 0x664f]
    4180                      .dwattr $C$DW$633, DW_AT_accessibility(DW_ACCESS_public)
    4181                      .dwendtag $C$DW$T$31
    4182              
    4183              $C$DW$T$244     .dwtag  DW_TAG_typedef, DW_AT_name("ADC_Obj")
    4184                      .dwattr $C$DW$T$244, DW_AT_type(*$C$DW$T$31)
    4185                      .dwattr $C$DW$T$244, DW_AT_language(DW_LANG_C)
    4186              $C$DW$T$88      .dwtag  DW_TAG_pointer_type
    4187                      .dwattr $C$DW$T$88, DW_AT_type(*$C$DW$T$31)
    4188                      .dwattr $C$DW$T$88, DW_AT_address_class(0x16)
TMS320C2000 Assembler PC v6.2.5 Tue Sep 26 10:29:40 2017

Tools Copyright (c) 1996-2014 Texas Instruments Incorporated
C:\Users\wmj\AppData\Local\Temp\1168813                              PAGE   83

    4189              $C$DW$T$89      .dwtag  DW_TAG_typedef, DW_AT_name("ADC_Handle")
    4190                      .dwattr $C$DW$T$89, DW_AT_type(*$C$DW$T$88)
    4191                      .dwattr $C$DW$T$89, DW_AT_language(DW_LANG_C)
    4192              
    4193              $C$DW$T$35      .dwtag  DW_TAG_structure_type
    4194                      .dwattr $C$DW$T$35, DW_AT_name("_BRAKE_Obj_")
    4195                      .dwattr $C$DW$T$35, DW_AT_byte_size(0x08)
    4196              $C$DW$634       .dwtag  DW_TAG_member
    4197                      .dwattr $C$DW$634, DW_AT_type(*$C$DW$T$32)
    4198                      .dwattr $C$DW$634, DW_AT_name("angle_pu")
    4199                      .dwattr $C$DW$634, DW_AT_TI_symbol_name("_angle_pu")
    4200                      .dwattr $C$DW$634, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    4201                      .dwattr $C$DW$634, DW_AT_accessibility(DW_ACCESS_public)
    4202              $C$DW$635       .dwtag  DW_TAG_member
    4203                      .dwattr $C$DW$635, DW_AT_type(*$C$DW$T$33)
    4204                      .dwattr $C$DW$635, DW_AT_name("Idq_brake")
    4205                      .dwattr $C$DW$635, DW_AT_TI_symbol_name("_Idq_brake")
    4206                      .dwattr $C$DW$635, DW_AT_data_member_location[DW_OP_plus_uconst 0x2]
    4207                      .dwattr $C$DW$635, DW_AT_accessibility(DW_ACCESS_public)
    4208              $C$DW$636       .dwtag  DW_TAG_member
    4209                      .dwattr $C$DW$636, DW_AT_type(*$C$DW$T$34)
    4210                      .dwattr $C$DW$636, DW_AT_name("brake_enable")
    4211                      .dwattr $C$DW$636, DW_AT_TI_symbol_name("_brake_enable")
    4212                      .dwattr $C$DW$636, DW_AT_data_member_location[DW_OP_plus_uconst 0x6]
    4213                      .dwattr $C$DW$636, DW_AT_accessibility(DW_ACCESS_public)
    4214                      .dwendtag $C$DW$T$35
    4215              
    4216              $C$DW$T$74      .dwtag  DW_TAG_typedef, DW_AT_name("BRAKE_Obj")
    4217                      .dwattr $C$DW$T$74, DW_AT_type(*$C$DW$T$35)
    4218                      .dwattr $C$DW$T$74, DW_AT_language(DW_LANG_C)
    4219              $C$DW$T$72      .dwtag  DW_TAG_pointer_type
    4220                      .dwattr $C$DW$T$72, DW_AT_type(*$C$DW$T$35)
    4221                      .dwattr $C$DW$T$72, DW_AT_address_class(0x16)
    4222              $C$DW$T$73      .dwtag  DW_TAG_typedef, DW_AT_name("BRAKE_Handle")
    4223                      .dwattr $C$DW$T$73, DW_AT_type(*$C$DW$T$72)
    4224                      .dwattr $C$DW$T$73, DW_AT_language(DW_LANG_C)
    4225              
    4226              $C$DW$T$37      .dwtag  DW_TAG_structure_type
    4227                      .dwattr $C$DW$T$37, DW_AT_name("_CLARKE_Obj_")
    4228                      .dwattr $C$DW$T$37, DW_AT_byte_size(0x06)
    4229              $C$DW$637       .dwtag  DW_TAG_member
    4230                      .dwattr $C$DW$637, DW_AT_type(*$C$DW$T$32)
    4231                      .dwattr $C$DW$637, DW_AT_name("alpha_sf")
    4232                      .dwattr $C$DW$637, DW_AT_TI_symbol_name("_alpha_sf")
    4233                      .dwattr $C$DW$637, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    4234                      .dwattr $C$DW$637, DW_AT_accessibility(DW_ACCESS_public)
    4235              $C$DW$638       .dwtag  DW_TAG_member
    4236                      .dwattr $C$DW$638, DW_AT_type(*$C$DW$T$32)
    4237                      .dwattr $C$DW$638, DW_AT_name("beta_sf")
    4238                      .dwattr $C$DW$638, DW_AT_TI_symbol_name("_beta_sf")
    4239                      .dwattr $C$DW$638, DW_AT_data_member_location[DW_OP_plus_uconst 0x2]
    4240                      .dwattr $C$DW$638, DW_AT_accessibility(DW_ACCESS_public)
    4241              $C$DW$639       .dwtag  DW_TAG_member
    4242                      .dwattr $C$DW$639, DW_AT_type(*$C$DW$T$36)
    4243                      .dwattr $C$DW$639, DW_AT_name("numSensors")
TMS320C2000 Assembler PC v6.2.5 Tue Sep 26 10:29:40 2017

Tools Copyright (c) 1996-2014 Texas Instruments Incorporated
C:\Users\wmj\AppData\Local\Temp\1168813                              PAGE   84

    4244                      .dwattr $C$DW$639, DW_AT_TI_symbol_name("_numSensors")
    4245                      .dwattr $C$DW$639, DW_AT_data_member_location[DW_OP_plus_uconst 0x4]
    4246                      .dwattr $C$DW$639, DW_AT_accessibility(DW_ACCESS_public)
    4247                      .dwendtag $C$DW$T$37
    4248              
    4249              $C$DW$T$48      .dwtag  DW_TAG_typedef, DW_AT_name("CLARKE_Obj")
    4250                      .dwattr $C$DW$T$48, DW_AT_type(*$C$DW$T$37)
    4251                      .dwattr $C$DW$T$48, DW_AT_language(DW_LANG_C)
    4252              $C$DW$T$46      .dwtag  DW_TAG_pointer_type
    4253                      .dwattr $C$DW$T$46, DW_AT_type(*$C$DW$T$37)
    4254                      .dwattr $C$DW$T$46, DW_AT_address_class(0x16)
    4255              $C$DW$T$47      .dwtag  DW_TAG_typedef, DW_AT_name("CLARKE_Handle")
    4256                      .dwattr $C$DW$T$47, DW_AT_type(*$C$DW$T$46)
    4257                      .dwattr $C$DW$T$47, DW_AT_language(DW_LANG_C)
    4258              
    4259              $C$DW$T$39      .dwtag  DW_TAG_structure_type
    4260                      .dwattr $C$DW$T$39, DW_AT_name("_CLK_Obj_")
    4261                      .dwattr $C$DW$T$39, DW_AT_byte_size(0x11)
    4262              $C$DW$640       .dwtag  DW_TAG_member
    4263                      .dwattr $C$DW$640, DW_AT_type(*$C$DW$T$24)
    4264                      .dwattr $C$DW$640, DW_AT_name("XCLK")
    4265                      .dwattr $C$DW$640, DW_AT_TI_symbol_name("_XCLK")
    4266                      .dwattr $C$DW$640, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    4267                      .dwattr $C$DW$640, DW_AT_accessibility(DW_ACCESS_public)
    4268              $C$DW$641       .dwtag  DW_TAG_member
    4269                      .dwattr $C$DW$641, DW_AT_type(*$C$DW$T$24)
    4270                      .dwattr $C$DW$641, DW_AT_name("rsvd_1")
    4271                      .dwattr $C$DW$641, DW_AT_TI_symbol_name("_rsvd_1")
    4272                      .dwattr $C$DW$641, DW_AT_data_member_location[DW_OP_plus_uconst 0x1]
    4273                      .dwattr $C$DW$641, DW_AT_accessibility(DW_ACCESS_public)
    4274              $C$DW$642       .dwtag  DW_TAG_member
    4275                      .dwattr $C$DW$642, DW_AT_type(*$C$DW$T$24)
    4276                      .dwattr $C$DW$642, DW_AT_name("CLKCTL")
    4277                      .dwattr $C$DW$642, DW_AT_TI_symbol_name("_CLKCTL")
    4278                      .dwattr $C$DW$642, DW_AT_data_member_location[DW_OP_plus_uconst 0x2]
    4279                      .dwattr $C$DW$642, DW_AT_accessibility(DW_ACCESS_public)
    4280              $C$DW$643       .dwtag  DW_TAG_member
    4281                      .dwattr $C$DW$643, DW_AT_type(*$C$DW$T$38)
    4282                      .dwattr $C$DW$643, DW_AT_name("rsvd_2")
    4283                      .dwattr $C$DW$643, DW_AT_TI_symbol_name("_rsvd_2")
    4284                      .dwattr $C$DW$643, DW_AT_data_member_location[DW_OP_plus_uconst 0x3]
    4285                      .dwattr $C$DW$643, DW_AT_accessibility(DW_ACCESS_public)
    4286              $C$DW$644       .dwtag  DW_TAG_member
    4287                      .dwattr $C$DW$644, DW_AT_type(*$C$DW$T$24)
    4288                      .dwattr $C$DW$644, DW_AT_name("LOSPCP")
    4289                      .dwattr $C$DW$644, DW_AT_TI_symbol_name("_LOSPCP")
    4290                      .dwattr $C$DW$644, DW_AT_data_member_location[DW_OP_plus_uconst 0xb]
    4291                      .dwattr $C$DW$644, DW_AT_accessibility(DW_ACCESS_public)
    4292              $C$DW$645       .dwtag  DW_TAG_member
    4293                      .dwattr $C$DW$645, DW_AT_type(*$C$DW$T$24)
    4294                      .dwattr $C$DW$645, DW_AT_name("PCLKCR0")
    4295                      .dwattr $C$DW$645, DW_AT_TI_symbol_name("_PCLKCR0")
    4296                      .dwattr $C$DW$645, DW_AT_data_member_location[DW_OP_plus_uconst 0xc]
    4297                      .dwattr $C$DW$645, DW_AT_accessibility(DW_ACCESS_public)
    4298              $C$DW$646       .dwtag  DW_TAG_member
TMS320C2000 Assembler PC v6.2.5 Tue Sep 26 10:29:40 2017

Tools Copyright (c) 1996-2014 Texas Instruments Incorporated
C:\Users\wmj\AppData\Local\Temp\1168813                              PAGE   85

    4299                      .dwattr $C$DW$646, DW_AT_type(*$C$DW$T$24)
    4300                      .dwattr $C$DW$646, DW_AT_name("PCLKCR1")
    4301                      .dwattr $C$DW$646, DW_AT_TI_symbol_name("_PCLKCR1")
    4302                      .dwattr $C$DW$646, DW_AT_data_member_location[DW_OP_plus_uconst 0xd]
    4303                      .dwattr $C$DW$646, DW_AT_accessibility(DW_ACCESS_public)
    4304              $C$DW$647       .dwtag  DW_TAG_member
    4305                      .dwattr $C$DW$647, DW_AT_type(*$C$DW$T$27)
    4306                      .dwattr $C$DW$647, DW_AT_name("rsvd_3")
    4307                      .dwattr $C$DW$647, DW_AT_TI_symbol_name("_rsvd_3")
    4308                      .dwattr $C$DW$647, DW_AT_data_member_location[DW_OP_plus_uconst 0xe]
    4309                      .dwattr $C$DW$647, DW_AT_accessibility(DW_ACCESS_public)
    4310              $C$DW$648       .dwtag  DW_TAG_member
    4311                      .dwattr $C$DW$648, DW_AT_type(*$C$DW$T$24)
    4312                      .dwattr $C$DW$648, DW_AT_name("PCLKCR3")
    4313                      .dwattr $C$DW$648, DW_AT_TI_symbol_name("_PCLKCR3")
    4314                      .dwattr $C$DW$648, DW_AT_data_member_location[DW_OP_plus_uconst 0x10]
    4315                      .dwattr $C$DW$648, DW_AT_accessibility(DW_ACCESS_public)
    4316                      .dwendtag $C$DW$T$39
    4317              
    4318              $C$DW$T$90      .dwtag  DW_TAG_pointer_type
    4319                      .dwattr $C$DW$T$90, DW_AT_type(*$C$DW$T$39)
    4320                      .dwattr $C$DW$T$90, DW_AT_address_class(0x16)
    4321              $C$DW$T$91      .dwtag  DW_TAG_typedef, DW_AT_name("CLK_Handle")
    4322                      .dwattr $C$DW$T$91, DW_AT_type(*$C$DW$T$90)
    4323                      .dwattr $C$DW$T$91, DW_AT_language(DW_LANG_C)
    4324              
    4325              $C$DW$T$40      .dwtag  DW_TAG_structure_type
    4326                      .dwattr $C$DW$T$40, DW_AT_name("_CPU_Obj_")
    4327                      .dwattr $C$DW$T$40, DW_AT_byte_size(0x01)
    4328              $C$DW$649       .dwtag  DW_TAG_member
    4329                      .dwattr $C$DW$649, DW_AT_type(*$C$DW$T$36)
    4330                      .dwattr $C$DW$649, DW_AT_name("tmp")
    4331                      .dwattr $C$DW$649, DW_AT_TI_symbol_name("_tmp")
    4332                      .dwattr $C$DW$649, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    4333                      .dwattr $C$DW$649, DW_AT_accessibility(DW_ACCESS_public)
    4334                      .dwendtag $C$DW$T$40
    4335              
    4336              $C$DW$T$92      .dwtag  DW_TAG_pointer_type
    4337                      .dwattr $C$DW$T$92, DW_AT_type(*$C$DW$T$40)
    4338                      .dwattr $C$DW$T$92, DW_AT_address_class(0x16)
    4339              $C$DW$T$93      .dwtag  DW_TAG_typedef, DW_AT_name("CPU_Handle")
    4340                      .dwattr $C$DW$T$93, DW_AT_type(*$C$DW$T$92)
    4341                      .dwattr $C$DW$T$93, DW_AT_language(DW_LANG_C)
    4342              
    4343              $C$DW$T$75      .dwtag  DW_TAG_structure_type
    4344                      .dwattr $C$DW$T$75, DW_AT_name("_CTRL_Obj_")
    4345                      .dwattr $C$DW$T$75, DW_AT_byte_size(0x112)
    4346              $C$DW$650       .dwtag  DW_TAG_member
    4347                      .dwattr $C$DW$650, DW_AT_type(*$C$DW$T$41)
    4348                      .dwattr $C$DW$650, DW_AT_name("version")
    4349                      .dwattr $C$DW$650, DW_AT_TI_symbol_name("_version")
    4350                      .dwattr $C$DW$650, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    4351                      .dwattr $C$DW$650, DW_AT_accessibility(DW_ACCESS_public)
    4352              $C$DW$651       .dwtag  DW_TAG_member
    4353                      .dwattr $C$DW$651, DW_AT_type(*$C$DW$T$43)
TMS320C2000 Assembler PC v6.2.5 Tue Sep 26 10:29:40 2017

Tools Copyright (c) 1996-2014 Texas Instruments Incorporated
C:\Users\wmj\AppData\Local\Temp\1168813                              PAGE   86

    4354                      .dwattr $C$DW$651, DW_AT_name("state")
    4355                      .dwattr $C$DW$651, DW_AT_TI_symbol_name("_state")
    4356                      .dwattr $C$DW$651, DW_AT_data_member_location[DW_OP_plus_uconst 0x4]
    4357                      .dwattr $C$DW$651, DW_AT_accessibility(DW_ACCESS_public)
    4358              $C$DW$652       .dwtag  DW_TAG_member
    4359                      .dwattr $C$DW$652, DW_AT_type(*$C$DW$T$43)
    4360                      .dwattr $C$DW$652, DW_AT_name("prevState")
    4361                      .dwattr $C$DW$652, DW_AT_TI_symbol_name("_prevState")
    4362                      .dwattr $C$DW$652, DW_AT_data_member_location[DW_OP_plus_uconst 0x5]
    4363                      .dwattr $C$DW$652, DW_AT_accessibility(DW_ACCESS_public)
    4364              $C$DW$653       .dwtag  DW_TAG_member
    4365                      .dwattr $C$DW$653, DW_AT_type(*$C$DW$T$45)
    4366                      .dwattr $C$DW$653, DW_AT_name("errorCode")
    4367                      .dwattr $C$DW$653, DW_AT_TI_symbol_name("_errorCode")
    4368                      .dwattr $C$DW$653, DW_AT_data_member_location[DW_OP_plus_uconst 0x6]
    4369                      .dwattr $C$DW$653, DW_AT_accessibility(DW_ACCESS_public)
    4370              $C$DW$654       .dwtag  DW_TAG_member
    4371                      .dwattr $C$DW$654, DW_AT_type(*$C$DW$T$47)
    4372                      .dwattr $C$DW$654, DW_AT_name("clarkeHandle_I")
    4373                      .dwattr $C$DW$654, DW_AT_TI_symbol_name("_clarkeHandle_I")
    4374                      .dwattr $C$DW$654, DW_AT_data_member_location[DW_OP_plus_uconst 0x8]
    4375                      .dwattr $C$DW$654, DW_AT_accessibility(DW_ACCESS_public)
    4376              $C$DW$655       .dwtag  DW_TAG_member
    4377                      .dwattr $C$DW$655, DW_AT_type(*$C$DW$T$48)
    4378                      .dwattr $C$DW$655, DW_AT_name("clarke_I")
    4379                      .dwattr $C$DW$655, DW_AT_TI_symbol_name("_clarke_I")
    4380                      .dwattr $C$DW$655, DW_AT_data_member_location[DW_OP_plus_uconst 0xa]
    4381                      .dwattr $C$DW$655, DW_AT_accessibility(DW_ACCESS_public)
    4382              $C$DW$656       .dwtag  DW_TAG_member
    4383                      .dwattr $C$DW$656, DW_AT_type(*$C$DW$T$47)
    4384                      .dwattr $C$DW$656, DW_AT_name("clarkeHandle_V")
    4385                      .dwattr $C$DW$656, DW_AT_TI_symbol_name("_clarkeHandle_V")
    4386                      .dwattr $C$DW$656, DW_AT_data_member_location[DW_OP_plus_uconst 0x10]
    4387                      .dwattr $C$DW$656, DW_AT_accessibility(DW_ACCESS_public)
    4388              $C$DW$657       .dwtag  DW_TAG_member
    4389                      .dwattr $C$DW$657, DW_AT_type(*$C$DW$T$48)
    4390                      .dwattr $C$DW$657, DW_AT_name("clarke_V")
    4391                      .dwattr $C$DW$657, DW_AT_TI_symbol_name("_clarke_V")
    4392                      .dwattr $C$DW$657, DW_AT_data_member_location[DW_OP_plus_uconst 0x12]
    4393                      .dwattr $C$DW$657, DW_AT_accessibility(DW_ACCESS_public)
    4394              $C$DW$658       .dwtag  DW_TAG_member
    4395                      .dwattr $C$DW$658, DW_AT_type(*$C$DW$T$50)
    4396                      .dwattr $C$DW$658, DW_AT_name("estHandle")
    4397                      .dwattr $C$DW$658, DW_AT_TI_symbol_name("_estHandle")
    4398                      .dwattr $C$DW$658, DW_AT_data_member_location[DW_OP_plus_uconst 0x18]
    4399                      .dwattr $C$DW$658, DW_AT_accessibility(DW_ACCESS_public)
    4400              $C$DW$659       .dwtag  DW_TAG_member
    4401                      .dwattr $C$DW$659, DW_AT_type(*$C$DW$T$52)
    4402                      .dwattr $C$DW$659, DW_AT_name("parkHandle")
    4403                      .dwattr $C$DW$659, DW_AT_TI_symbol_name("_parkHandle")
    4404                      .dwattr $C$DW$659, DW_AT_data_member_location[DW_OP_plus_uconst 0x1a]
    4405                      .dwattr $C$DW$659, DW_AT_accessibility(DW_ACCESS_public)
    4406              $C$DW$660       .dwtag  DW_TAG_member
    4407                      .dwattr $C$DW$660, DW_AT_type(*$C$DW$T$53)
    4408                      .dwattr $C$DW$660, DW_AT_name("park")
TMS320C2000 Assembler PC v6.2.5 Tue Sep 26 10:29:40 2017

Tools Copyright (c) 1996-2014 Texas Instruments Incorporated
C:\Users\wmj\AppData\Local\Temp\1168813                              PAGE   87

    4409                      .dwattr $C$DW$660, DW_AT_TI_symbol_name("_park")
    4410                      .dwattr $C$DW$660, DW_AT_data_member_location[DW_OP_plus_uconst 0x1c]
    4411                      .dwattr $C$DW$660, DW_AT_accessibility(DW_ACCESS_public)
    4412              $C$DW$661       .dwtag  DW_TAG_member
    4413                      .dwattr $C$DW$661, DW_AT_type(*$C$DW$T$55)
    4414                      .dwattr $C$DW$661, DW_AT_name("pidHandle_Id")
    4415                      .dwattr $C$DW$661, DW_AT_TI_symbol_name("_pidHandle_Id")
    4416                      .dwattr $C$DW$661, DW_AT_data_member_location[DW_OP_plus_uconst 0x20]
    4417                      .dwattr $C$DW$661, DW_AT_accessibility(DW_ACCESS_public)
    4418              $C$DW$662       .dwtag  DW_TAG_member
    4419                      .dwattr $C$DW$662, DW_AT_type(*$C$DW$T$56)
    4420                      .dwattr $C$DW$662, DW_AT_name("pid_Id")
    4421                      .dwattr $C$DW$662, DW_AT_TI_symbol_name("_pid_Id")
    4422                      .dwattr $C$DW$662, DW_AT_data_member_location[DW_OP_plus_uconst 0x22]
    4423                      .dwattr $C$DW$662, DW_AT_accessibility(DW_ACCESS_public)
    4424              $C$DW$663       .dwtag  DW_TAG_member
    4425                      .dwattr $C$DW$663, DW_AT_type(*$C$DW$T$55)
    4426                      .dwattr $C$DW$663, DW_AT_name("pidHandle_Iq")
    4427                      .dwattr $C$DW$663, DW_AT_TI_symbol_name("_pidHandle_Iq")
    4428                      .dwattr $C$DW$663, DW_AT_data_member_location[DW_OP_plus_uconst 0x32]
    4429                      .dwattr $C$DW$663, DW_AT_accessibility(DW_ACCESS_public)
    4430              $C$DW$664       .dwtag  DW_TAG_member
    4431                      .dwattr $C$DW$664, DW_AT_type(*$C$DW$T$56)
    4432                      .dwattr $C$DW$664, DW_AT_name("pid_Iq")
    4433                      .dwattr $C$DW$664, DW_AT_TI_symbol_name("_pid_Iq")
    4434                      .dwattr $C$DW$664, DW_AT_data_member_location[DW_OP_plus_uconst 0x34]
    4435                      .dwattr $C$DW$664, DW_AT_accessibility(DW_ACCESS_public)
    4436              $C$DW$665       .dwtag  DW_TAG_member
    4437                      .dwattr $C$DW$665, DW_AT_type(*$C$DW$T$55)
    4438                      .dwattr $C$DW$665, DW_AT_name("pidHandle_spd")
    4439                      .dwattr $C$DW$665, DW_AT_TI_symbol_name("_pidHandle_spd")
    4440                      .dwattr $C$DW$665, DW_AT_data_member_location[DW_OP_plus_uconst 0x44]
    4441                      .dwattr $C$DW$665, DW_AT_accessibility(DW_ACCESS_public)
    4442              $C$DW$666       .dwtag  DW_TAG_member
    4443                      .dwattr $C$DW$666, DW_AT_type(*$C$DW$T$56)
    4444                      .dwattr $C$DW$666, DW_AT_name("pid_spd")
    4445                      .dwattr $C$DW$666, DW_AT_TI_symbol_name("_pid_spd")
    4446                      .dwattr $C$DW$666, DW_AT_data_member_location[DW_OP_plus_uconst 0x46]
    4447                      .dwattr $C$DW$666, DW_AT_accessibility(DW_ACCESS_public)
    4448              $C$DW$667       .dwtag  DW_TAG_member
    4449                      .dwattr $C$DW$667, DW_AT_type(*$C$DW$T$58)
    4450                      .dwattr $C$DW$667, DW_AT_name("iparkHandle")
    4451                      .dwattr $C$DW$667, DW_AT_TI_symbol_name("_iparkHandle")
    4452                      .dwattr $C$DW$667, DW_AT_data_member_location[DW_OP_plus_uconst 0x56]
    4453                      .dwattr $C$DW$667, DW_AT_accessibility(DW_ACCESS_public)
    4454              $C$DW$668       .dwtag  DW_TAG_member
    4455                      .dwattr $C$DW$668, DW_AT_type(*$C$DW$T$59)
    4456                      .dwattr $C$DW$668, DW_AT_name("ipark")
    4457                      .dwattr $C$DW$668, DW_AT_TI_symbol_name("_ipark")
    4458                      .dwattr $C$DW$668, DW_AT_data_member_location[DW_OP_plus_uconst 0x58]
    4459                      .dwattr $C$DW$668, DW_AT_accessibility(DW_ACCESS_public)
    4460              $C$DW$669       .dwtag  DW_TAG_member
    4461                      .dwattr $C$DW$669, DW_AT_type(*$C$DW$T$61)
    4462                      .dwattr $C$DW$669, DW_AT_name("svgenHandle")
    4463                      .dwattr $C$DW$669, DW_AT_TI_symbol_name("_svgenHandle")
TMS320C2000 Assembler PC v6.2.5 Tue Sep 26 10:29:40 2017

Tools Copyright (c) 1996-2014 Texas Instruments Incorporated
C:\Users\wmj\AppData\Local\Temp\1168813                              PAGE   88

    4464                      .dwattr $C$DW$669, DW_AT_data_member_location[DW_OP_plus_uconst 0x5c]
    4465                      .dwattr $C$DW$669, DW_AT_accessibility(DW_ACCESS_public)
    4466              $C$DW$670       .dwtag  DW_TAG_member
    4467                      .dwattr $C$DW$670, DW_AT_type(*$C$DW$T$62)
    4468                      .dwattr $C$DW$670, DW_AT_name("svgen")
    4469                      .dwattr $C$DW$670, DW_AT_TI_symbol_name("_svgen")
    4470                      .dwattr $C$DW$670, DW_AT_data_member_location[DW_OP_plus_uconst 0x5e]
    4471                      .dwattr $C$DW$670, DW_AT_accessibility(DW_ACCESS_public)
    4472              $C$DW$671       .dwtag  DW_TAG_member
    4473                      .dwattr $C$DW$671, DW_AT_type(*$C$DW$T$64)
    4474                      .dwattr $C$DW$671, DW_AT_name("trajHandle_Id")
    4475                      .dwattr $C$DW$671, DW_AT_TI_symbol_name("_trajHandle_Id")
    4476                      .dwattr $C$DW$671, DW_AT_data_member_location[DW_OP_plus_uconst 0x60]
    4477                      .dwattr $C$DW$671, DW_AT_accessibility(DW_ACCESS_public)
    4478              $C$DW$672       .dwtag  DW_TAG_member
    4479                      .dwattr $C$DW$672, DW_AT_type(*$C$DW$T$65)
    4480                      .dwattr $C$DW$672, DW_AT_name("traj_Id")
    4481                      .dwattr $C$DW$672, DW_AT_TI_symbol_name("_traj_Id")
    4482                      .dwattr $C$DW$672, DW_AT_data_member_location[DW_OP_plus_uconst 0x62]
    4483                      .dwattr $C$DW$672, DW_AT_accessibility(DW_ACCESS_public)
    4484              $C$DW$673       .dwtag  DW_TAG_member
    4485                      .dwattr $C$DW$673, DW_AT_type(*$C$DW$T$64)
    4486                      .dwattr $C$DW$673, DW_AT_name("trajHandle_spd")
    4487                      .dwattr $C$DW$673, DW_AT_TI_symbol_name("_trajHandle_spd")
    4488                      .dwattr $C$DW$673, DW_AT_data_member_location[DW_OP_plus_uconst 0x6c]
    4489                      .dwattr $C$DW$673, DW_AT_accessibility(DW_ACCESS_public)
    4490              $C$DW$674       .dwtag  DW_TAG_member
    4491                      .dwattr $C$DW$674, DW_AT_type(*$C$DW$T$65)
    4492                      .dwattr $C$DW$674, DW_AT_name("traj_spd")
    4493                      .dwattr $C$DW$674, DW_AT_TI_symbol_name("_traj_spd")
    4494                      .dwattr $C$DW$674, DW_AT_data_member_location[DW_OP_plus_uconst 0x6e]
    4495                      .dwattr $C$DW$674, DW_AT_accessibility(DW_ACCESS_public)
    4496              $C$DW$675       .dwtag  DW_TAG_member
    4497                      .dwattr $C$DW$675, DW_AT_type(*$C$DW$T$64)
    4498                      .dwattr $C$DW$675, DW_AT_name("trajHandle_spdMax")
    4499                      .dwattr $C$DW$675, DW_AT_TI_symbol_name("_trajHandle_spdMax")
    4500                      .dwattr $C$DW$675, DW_AT_data_member_location[DW_OP_plus_uconst 0x78]
    4501                      .dwattr $C$DW$675, DW_AT_accessibility(DW_ACCESS_public)
    4502              $C$DW$676       .dwtag  DW_TAG_member
    4503                      .dwattr $C$DW$676, DW_AT_type(*$C$DW$T$65)
    4504                      .dwattr $C$DW$676, DW_AT_name("traj_spdMax")
    4505                      .dwattr $C$DW$676, DW_AT_TI_symbol_name("_traj_spdMax")
    4506                      .dwattr $C$DW$676, DW_AT_data_member_location[DW_OP_plus_uconst 0x7a]
    4507                      .dwattr $C$DW$676, DW_AT_accessibility(DW_ACCESS_public)
    4508              $C$DW$677       .dwtag  DW_TAG_member
    4509                      .dwattr $C$DW$677, DW_AT_type(*$C$DW$T$66)
    4510                      .dwattr $C$DW$677, DW_AT_name("motorParams")
    4511                      .dwattr $C$DW$677, DW_AT_TI_symbol_name("_motorParams")
    4512                      .dwattr $C$DW$677, DW_AT_data_member_location[DW_OP_plus_uconst 0x84]
    4513                      .dwattr $C$DW$677, DW_AT_accessibility(DW_ACCESS_public)
    4514              $C$DW$678       .dwtag  DW_TAG_member
    4515                      .dwattr $C$DW$678, DW_AT_type(*$C$DW$T$69)
    4516                      .dwattr $C$DW$678, DW_AT_name("waitTimes")
    4517                      .dwattr $C$DW$678, DW_AT_TI_symbol_name("_waitTimes")
    4518                      .dwattr $C$DW$678, DW_AT_data_member_location[DW_OP_plus_uconst 0x92]
TMS320C2000 Assembler PC v6.2.5 Tue Sep 26 10:29:40 2017

Tools Copyright (c) 1996-2014 Texas Instruments Incorporated
C:\Users\wmj\AppData\Local\Temp\1168813                              PAGE   89

    4519                      .dwattr $C$DW$678, DW_AT_accessibility(DW_ACCESS_public)
    4520              $C$DW$679       .dwtag  DW_TAG_member
    4521                      .dwattr $C$DW$679, DW_AT_type(*$C$DW$T$68)
    4522                      .dwattr $C$DW$679, DW_AT_name("counter_state")
    4523                      .dwattr $C$DW$679, DW_AT_TI_symbol_name("_counter_state")
    4524                      .dwattr $C$DW$679, DW_AT_data_member_location[DW_OP_plus_uconst 0x9a]
    4525                      .dwattr $C$DW$679, DW_AT_accessibility(DW_ACCESS_public)
    4526              $C$DW$680       .dwtag  DW_TAG_member
    4527                      .dwattr $C$DW$680, DW_AT_type(*$C$DW$T$70)
    4528                      .dwattr $C$DW$680, DW_AT_name("numIsrTicksPerCtrlTick")
    4529                      .dwattr $C$DW$680, DW_AT_TI_symbol_name("_numIsrTicksPerCtrlTick")
    4530                      .dwattr $C$DW$680, DW_AT_data_member_location[DW_OP_plus_uconst 0x9c]
    4531                      .dwattr $C$DW$680, DW_AT_accessibility(DW_ACCESS_public)
    4532              $C$DW$681       .dwtag  DW_TAG_member
    4533                      .dwattr $C$DW$681, DW_AT_type(*$C$DW$T$70)
    4534                      .dwattr $C$DW$681, DW_AT_name("numCtrlTicksPerCurrentTick")
    4535                      .dwattr $C$DW$681, DW_AT_TI_symbol_name("_numCtrlTicksPerCurrentTick")
    4536                      .dwattr $C$DW$681, DW_AT_data_member_location[DW_OP_plus_uconst 0x9d]
    4537                      .dwattr $C$DW$681, DW_AT_accessibility(DW_ACCESS_public)
    4538              $C$DW$682       .dwtag  DW_TAG_member
    4539                      .dwattr $C$DW$682, DW_AT_type(*$C$DW$T$70)
    4540                      .dwattr $C$DW$682, DW_AT_name("numCtrlTicksPerSpeedTick")
    4541                      .dwattr $C$DW$682, DW_AT_TI_symbol_name("_numCtrlTicksPerSpeedTick")
    4542                      .dwattr $C$DW$682, DW_AT_data_member_location[DW_OP_plus_uconst 0x9e]
    4543                      .dwattr $C$DW$682, DW_AT_accessibility(DW_ACCESS_public)
    4544              $C$DW$683       .dwtag  DW_TAG_member
    4545                      .dwattr $C$DW$683, DW_AT_type(*$C$DW$T$70)
    4546                      .dwattr $C$DW$683, DW_AT_name("numCtrlTicksPerTrajTick")
    4547                      .dwattr $C$DW$683, DW_AT_TI_symbol_name("_numCtrlTicksPerTrajTick")
    4548                      .dwattr $C$DW$683, DW_AT_data_member_location[DW_OP_plus_uconst 0x9f]
    4549                      .dwattr $C$DW$683, DW_AT_accessibility(DW_ACCESS_public)
    4550              $C$DW$684       .dwtag  DW_TAG_member
    4551                      .dwattr $C$DW$684, DW_AT_type(*$C$DW$T$68)
    4552                      .dwattr $C$DW$684, DW_AT_name("ctrlFreq_Hz")
    4553                      .dwattr $C$DW$684, DW_AT_TI_symbol_name("_ctrlFreq_Hz")
    4554                      .dwattr $C$DW$684, DW_AT_data_member_location[DW_OP_plus_uconst 0xa0]
    4555                      .dwattr $C$DW$684, DW_AT_accessibility(DW_ACCESS_public)
    4556              $C$DW$685       .dwtag  DW_TAG_member
    4557                      .dwattr $C$DW$685, DW_AT_type(*$C$DW$T$68)
    4558                      .dwattr $C$DW$685, DW_AT_name("trajFreq_Hz")
    4559                      .dwattr $C$DW$685, DW_AT_TI_symbol_name("_trajFreq_Hz")
    4560                      .dwattr $C$DW$685, DW_AT_data_member_location[DW_OP_plus_uconst 0xa2]
    4561                      .dwattr $C$DW$685, DW_AT_accessibility(DW_ACCESS_public)
    4562              $C$DW$686       .dwtag  DW_TAG_member
    4563                      .dwattr $C$DW$686, DW_AT_type(*$C$DW$T$32)
    4564                      .dwattr $C$DW$686, DW_AT_name("trajPeriod_sec")
    4565                      .dwattr $C$DW$686, DW_AT_TI_symbol_name("_trajPeriod_sec")
    4566                      .dwattr $C$DW$686, DW_AT_data_member_location[DW_OP_plus_uconst 0xa4]
    4567                      .dwattr $C$DW$686, DW_AT_accessibility(DW_ACCESS_public)
    4568              $C$DW$687       .dwtag  DW_TAG_member
    4569                      .dwattr $C$DW$687, DW_AT_type(*$C$DW$T$71)
    4570                      .dwattr $C$DW$687, DW_AT_name("ctrlPeriod_sec")
    4571                      .dwattr $C$DW$687, DW_AT_TI_symbol_name("_ctrlPeriod_sec")
    4572                      .dwattr $C$DW$687, DW_AT_data_member_location[DW_OP_plus_uconst 0xa6]
    4573                      .dwattr $C$DW$687, DW_AT_accessibility(DW_ACCESS_public)
TMS320C2000 Assembler PC v6.2.5 Tue Sep 26 10:29:40 2017

Tools Copyright (c) 1996-2014 Texas Instruments Incorporated
C:\Users\wmj\AppData\Local\Temp\1168813                              PAGE   90

    4574              $C$DW$688       .dwtag  DW_TAG_member
    4575                      .dwattr $C$DW$688, DW_AT_type(*$C$DW$T$32)
    4576                      .dwattr $C$DW$688, DW_AT_name("maxVsMag_pu")
    4577                      .dwattr $C$DW$688, DW_AT_TI_symbol_name("_maxVsMag_pu")
    4578                      .dwattr $C$DW$688, DW_AT_data_member_location[DW_OP_plus_uconst 0xa8]
    4579                      .dwattr $C$DW$688, DW_AT_accessibility(DW_ACCESS_public)
    4580              $C$DW$689       .dwtag  DW_TAG_member
    4581                      .dwattr $C$DW$689, DW_AT_type(*$C$DW$T$33)
    4582                      .dwattr $C$DW$689, DW_AT_name("Iab_in")
    4583                      .dwattr $C$DW$689, DW_AT_TI_symbol_name("_Iab_in")
    4584                      .dwattr $C$DW$689, DW_AT_data_member_location[DW_OP_plus_uconst 0xaa]
    4585                      .dwattr $C$DW$689, DW_AT_accessibility(DW_ACCESS_public)
    4586              $C$DW$690       .dwtag  DW_TAG_member
    4587                      .dwattr $C$DW$690, DW_AT_type(*$C$DW$T$33)
    4588                      .dwattr $C$DW$690, DW_AT_name("Iab_filt")
    4589                      .dwattr $C$DW$690, DW_AT_TI_symbol_name("_Iab_filt")
    4590                      .dwattr $C$DW$690, DW_AT_data_member_location[DW_OP_plus_uconst 0xae]
    4591                      .dwattr $C$DW$690, DW_AT_accessibility(DW_ACCESS_public)
    4592              $C$DW$691       .dwtag  DW_TAG_member
    4593                      .dwattr $C$DW$691, DW_AT_type(*$C$DW$T$33)
    4594                      .dwattr $C$DW$691, DW_AT_name("Idq_in")
    4595                      .dwattr $C$DW$691, DW_AT_TI_symbol_name("_Idq_in")
    4596                      .dwattr $C$DW$691, DW_AT_data_member_location[DW_OP_plus_uconst 0xb2]
    4597                      .dwattr $C$DW$691, DW_AT_accessibility(DW_ACCESS_public)
    4598              $C$DW$692       .dwtag  DW_TAG_member
    4599                      .dwattr $C$DW$692, DW_AT_type(*$C$DW$T$33)
    4600                      .dwattr $C$DW$692, DW_AT_name("Vab_in")
    4601                      .dwattr $C$DW$692, DW_AT_TI_symbol_name("_Vab_in")
    4602                      .dwattr $C$DW$692, DW_AT_data_member_location[DW_OP_plus_uconst 0xb6]
    4603                      .dwattr $C$DW$692, DW_AT_accessibility(DW_ACCESS_public)
    4604              $C$DW$693       .dwtag  DW_TAG_member
    4605                      .dwattr $C$DW$693, DW_AT_type(*$C$DW$T$32)
    4606                      .dwattr $C$DW$693, DW_AT_name("spd_out")
    4607                      .dwattr $C$DW$693, DW_AT_TI_symbol_name("_spd_out")
    4608                      .dwattr $C$DW$693, DW_AT_data_member_location[DW_OP_plus_uconst 0xba]
    4609                      .dwattr $C$DW$693, DW_AT_accessibility(DW_ACCESS_public)
    4610              $C$DW$694       .dwtag  DW_TAG_member
    4611                      .dwattr $C$DW$694, DW_AT_type(*$C$DW$T$33)
    4612                      .dwattr $C$DW$694, DW_AT_name("Vab_out")
    4613                      .dwattr $C$DW$694, DW_AT_TI_symbol_name("_Vab_out")
    4614                      .dwattr $C$DW$694, DW_AT_data_member_location[DW_OP_plus_uconst 0xbc]
    4615                      .dwattr $C$DW$694, DW_AT_accessibility(DW_ACCESS_public)
    4616              $C$DW$695       .dwtag  DW_TAG_member
    4617                      .dwattr $C$DW$695, DW_AT_type(*$C$DW$T$33)
    4618                      .dwattr $C$DW$695, DW_AT_name("Vdq_out")
    4619                      .dwattr $C$DW$695, DW_AT_TI_symbol_name("_Vdq_out")
    4620                      .dwattr $C$DW$695, DW_AT_data_member_location[DW_OP_plus_uconst 0xc0]
    4621                      .dwattr $C$DW$695, DW_AT_accessibility(DW_ACCESS_public)
    4622              $C$DW$696       .dwtag  DW_TAG_member
    4623                      .dwattr $C$DW$696, DW_AT_type(*$C$DW$T$71)
    4624                      .dwattr $C$DW$696, DW_AT_name("Rhf")
    4625                      .dwattr $C$DW$696, DW_AT_TI_symbol_name("_Rhf")
    4626                      .dwattr $C$DW$696, DW_AT_data_member_location[DW_OP_plus_uconst 0xc4]
    4627                      .dwattr $C$DW$696, DW_AT_accessibility(DW_ACCESS_public)
    4628              $C$DW$697       .dwtag  DW_TAG_member
TMS320C2000 Assembler PC v6.2.5 Tue Sep 26 10:29:40 2017

Tools Copyright (c) 1996-2014 Texas Instruments Incorporated
C:\Users\wmj\AppData\Local\Temp\1168813                              PAGE   91

    4629                      .dwattr $C$DW$697, DW_AT_type(*$C$DW$T$71)
    4630                      .dwattr $C$DW$697, DW_AT_name("Lhf")
    4631                      .dwattr $C$DW$697, DW_AT_TI_symbol_name("_Lhf")
    4632                      .dwattr $C$DW$697, DW_AT_data_member_location[DW_OP_plus_uconst 0xc6]
    4633                      .dwattr $C$DW$697, DW_AT_accessibility(DW_ACCESS_public)
    4634              $C$DW$698       .dwtag  DW_TAG_member
    4635                      .dwattr $C$DW$698, DW_AT_type(*$C$DW$T$71)
    4636                      .dwattr $C$DW$698, DW_AT_name("RoverL")
    4637                      .dwattr $C$DW$698, DW_AT_TI_symbol_name("_RoverL")
    4638                      .dwattr $C$DW$698, DW_AT_data_member_location[DW_OP_plus_uconst 0xc8]
    4639                      .dwattr $C$DW$698, DW_AT_accessibility(DW_ACCESS_public)
    4640              $C$DW$699       .dwtag  DW_TAG_member
    4641                      .dwattr $C$DW$699, DW_AT_type(*$C$DW$T$32)
    4642                      .dwattr $C$DW$699, DW_AT_name("Kp_Id")
    4643                      .dwattr $C$DW$699, DW_AT_TI_symbol_name("_Kp_Id")
    4644                      .dwattr $C$DW$699, DW_AT_data_member_location[DW_OP_plus_uconst 0xca]
    4645                      .dwattr $C$DW$699, DW_AT_accessibility(DW_ACCESS_public)
    4646              $C$DW$700       .dwtag  DW_TAG_member
    4647                      .dwattr $C$DW$700, DW_AT_type(*$C$DW$T$32)
    4648                      .dwattr $C$DW$700, DW_AT_name("Kp_Iq")
    4649                      .dwattr $C$DW$700, DW_AT_TI_symbol_name("_Kp_Iq")
    4650                      .dwattr $C$DW$700, DW_AT_data_member_location[DW_OP_plus_uconst 0xcc]
    4651                      .dwattr $C$DW$700, DW_AT_accessibility(DW_ACCESS_public)
    4652              $C$DW$701       .dwtag  DW_TAG_member
    4653                      .dwattr $C$DW$701, DW_AT_type(*$C$DW$T$32)
    4654                      .dwattr $C$DW$701, DW_AT_name("Kp_spd")
    4655                      .dwattr $C$DW$701, DW_AT_TI_symbol_name("_Kp_spd")
    4656                      .dwattr $C$DW$701, DW_AT_data_member_location[DW_OP_plus_uconst 0xce]
    4657                      .dwattr $C$DW$701, DW_AT_accessibility(DW_ACCESS_public)
    4658              $C$DW$702       .dwtag  DW_TAG_member
    4659                      .dwattr $C$DW$702, DW_AT_type(*$C$DW$T$32)
    4660                      .dwattr $C$DW$702, DW_AT_name("Ki_Id")
    4661                      .dwattr $C$DW$702, DW_AT_TI_symbol_name("_Ki_Id")
    4662                      .dwattr $C$DW$702, DW_AT_data_member_location[DW_OP_plus_uconst 0xd0]
    4663                      .dwattr $C$DW$702, DW_AT_accessibility(DW_ACCESS_public)
    4664              $C$DW$703       .dwtag  DW_TAG_member
    4665                      .dwattr $C$DW$703, DW_AT_type(*$C$DW$T$32)
    4666                      .dwattr $C$DW$703, DW_AT_name("Ki_Iq")
    4667                      .dwattr $C$DW$703, DW_AT_TI_symbol_name("_Ki_Iq")
    4668                      .dwattr $C$DW$703, DW_AT_data_member_location[DW_OP_plus_uconst 0xd2]
    4669                      .dwattr $C$DW$703, DW_AT_accessibility(DW_ACCESS_public)
    4670              $C$DW$704       .dwtag  DW_TAG_member
    4671                      .dwattr $C$DW$704, DW_AT_type(*$C$DW$T$32)
    4672                      .dwattr $C$DW$704, DW_AT_name("Ki_spd")
    4673                      .dwattr $C$DW$704, DW_AT_TI_symbol_name("_Ki_spd")
    4674                      .dwattr $C$DW$704, DW_AT_data_member_location[DW_OP_plus_uconst 0xd4]
    4675                      .dwattr $C$DW$704, DW_AT_accessibility(DW_ACCESS_public)
    4676              $C$DW$705       .dwtag  DW_TAG_member
    4677                      .dwattr $C$DW$705, DW_AT_type(*$C$DW$T$32)
    4678                      .dwattr $C$DW$705, DW_AT_name("Kd_Id")
    4679                      .dwattr $C$DW$705, DW_AT_TI_symbol_name("_Kd_Id")
    4680                      .dwattr $C$DW$705, DW_AT_data_member_location[DW_OP_plus_uconst 0xd6]
    4681                      .dwattr $C$DW$705, DW_AT_accessibility(DW_ACCESS_public)
    4682              $C$DW$706       .dwtag  DW_TAG_member
    4683                      .dwattr $C$DW$706, DW_AT_type(*$C$DW$T$32)
TMS320C2000 Assembler PC v6.2.5 Tue Sep 26 10:29:40 2017

Tools Copyright (c) 1996-2014 Texas Instruments Incorporated
C:\Users\wmj\AppData\Local\Temp\1168813                              PAGE   92

    4684                      .dwattr $C$DW$706, DW_AT_name("Kd_Iq")
    4685                      .dwattr $C$DW$706, DW_AT_TI_symbol_name("_Kd_Iq")
    4686                      .dwattr $C$DW$706, DW_AT_data_member_location[DW_OP_plus_uconst 0xd8]
    4687                      .dwattr $C$DW$706, DW_AT_accessibility(DW_ACCESS_public)
    4688              $C$DW$707       .dwtag  DW_TAG_member
    4689                      .dwattr $C$DW$707, DW_AT_type(*$C$DW$T$32)
    4690                      .dwattr $C$DW$707, DW_AT_name("Kd_spd")
    4691                      .dwattr $C$DW$707, DW_AT_TI_symbol_name("_Kd_spd")
    4692                      .dwattr $C$DW$707, DW_AT_data_member_location[DW_OP_plus_uconst 0xda]
    4693                      .dwattr $C$DW$707, DW_AT_accessibility(DW_ACCESS_public)
    4694              $C$DW$708       .dwtag  DW_TAG_member
    4695                      .dwattr $C$DW$708, DW_AT_type(*$C$DW$T$32)
    4696                      .dwattr $C$DW$708, DW_AT_name("Ui_Id")
    4697                      .dwattr $C$DW$708, DW_AT_TI_symbol_name("_Ui_Id")
    4698                      .dwattr $C$DW$708, DW_AT_data_member_location[DW_OP_plus_uconst 0xdc]
    4699                      .dwattr $C$DW$708, DW_AT_accessibility(DW_ACCESS_public)
    4700              $C$DW$709       .dwtag  DW_TAG_member
    4701                      .dwattr $C$DW$709, DW_AT_type(*$C$DW$T$32)
    4702                      .dwattr $C$DW$709, DW_AT_name("Ui_Iq")
    4703                      .dwattr $C$DW$709, DW_AT_TI_symbol_name("_Ui_Iq")
    4704                      .dwattr $C$DW$709, DW_AT_data_member_location[DW_OP_plus_uconst 0xde]
    4705                      .dwattr $C$DW$709, DW_AT_accessibility(DW_ACCESS_public)
    4706              $C$DW$710       .dwtag  DW_TAG_member
    4707                      .dwattr $C$DW$710, DW_AT_type(*$C$DW$T$32)
    4708                      .dwattr $C$DW$710, DW_AT_name("Ui_spd")
    4709                      .dwattr $C$DW$710, DW_AT_TI_symbol_name("_Ui_spd")
    4710                      .dwattr $C$DW$710, DW_AT_data_member_location[DW_OP_plus_uconst 0xe0]
    4711                      .dwattr $C$DW$710, DW_AT_accessibility(DW_ACCESS_public)
    4712              $C$DW$711       .dwtag  DW_TAG_member
    4713                      .dwattr $C$DW$711, DW_AT_type(*$C$DW$T$33)
    4714                      .dwattr $C$DW$711, DW_AT_name("Idq_ref")
    4715                      .dwattr $C$DW$711, DW_AT_TI_symbol_name("_Idq_ref")
    4716                      .dwattr $C$DW$711, DW_AT_data_member_location[DW_OP_plus_uconst 0xe2]
    4717                      .dwattr $C$DW$711, DW_AT_accessibility(DW_ACCESS_public)
    4718              $C$DW$712       .dwtag  DW_TAG_member
    4719                      .dwattr $C$DW$712, DW_AT_type(*$C$DW$T$32)
    4720                      .dwattr $C$DW$712, DW_AT_name("IdRated")
    4721                      .dwattr $C$DW$712, DW_AT_TI_symbol_name("_IdRated")
    4722                      .dwattr $C$DW$712, DW_AT_data_member_location[DW_OP_plus_uconst 0xe6]
    4723                      .dwattr $C$DW$712, DW_AT_accessibility(DW_ACCESS_public)
    4724              $C$DW$713       .dwtag  DW_TAG_member
    4725                      .dwattr $C$DW$713, DW_AT_type(*$C$DW$T$32)
    4726                      .dwattr $C$DW$713, DW_AT_name("spd_ref")
    4727                      .dwattr $C$DW$713, DW_AT_TI_symbol_name("_spd_ref")
    4728                      .dwattr $C$DW$713, DW_AT_data_member_location[DW_OP_plus_uconst 0xe8]
    4729                      .dwattr $C$DW$713, DW_AT_accessibility(DW_ACCESS_public)
    4730              $C$DW$714       .dwtag  DW_TAG_member
    4731                      .dwattr $C$DW$714, DW_AT_type(*$C$DW$T$32)
    4732                      .dwattr $C$DW$714, DW_AT_name("spd_max")
    4733                      .dwattr $C$DW$714, DW_AT_TI_symbol_name("_spd_max")
    4734                      .dwattr $C$DW$714, DW_AT_data_member_location[DW_OP_plus_uconst 0xea]
    4735                      .dwattr $C$DW$714, DW_AT_accessibility(DW_ACCESS_public)
    4736              $C$DW$715       .dwtag  DW_TAG_member
    4737                      .dwattr $C$DW$715, DW_AT_type(*$C$DW$T$70)
    4738                      .dwattr $C$DW$715, DW_AT_name("counter_current")
TMS320C2000 Assembler PC v6.2.5 Tue Sep 26 10:29:40 2017

Tools Copyright (c) 1996-2014 Texas Instruments Incorporated
C:\Users\wmj\AppData\Local\Temp\1168813                              PAGE   93

    4739                      .dwattr $C$DW$715, DW_AT_TI_symbol_name("_counter_current")
    4740                      .dwattr $C$DW$715, DW_AT_data_member_location[DW_OP_plus_uconst 0xec]
    4741                      .dwattr $C$DW$715, DW_AT_accessibility(DW_ACCESS_public)
    4742              $C$DW$716       .dwtag  DW_TAG_member
    4743                      .dwattr $C$DW$716, DW_AT_type(*$C$DW$T$70)
    4744                      .dwattr $C$DW$716, DW_AT_name("counter_isr")
    4745                      .dwattr $C$DW$716, DW_AT_TI_symbol_name("_counter_isr")
    4746                      .dwattr $C$DW$716, DW_AT_data_member_location[DW_OP_plus_uconst 0xed]
    4747                      .dwattr $C$DW$716, DW_AT_accessibility(DW_ACCESS_public)
    4748              $C$DW$717       .dwtag  DW_TAG_member
    4749                      .dwattr $C$DW$717, DW_AT_type(*$C$DW$T$70)
    4750                      .dwattr $C$DW$717, DW_AT_name("counter_speed")
    4751                      .dwattr $C$DW$717, DW_AT_TI_symbol_name("_counter_speed")
    4752                      .dwattr $C$DW$717, DW_AT_data_member_location[DW_OP_plus_uconst 0xee]
    4753                      .dwattr $C$DW$717, DW_AT_accessibility(DW_ACCESS_public)
    4754              $C$DW$718       .dwtag  DW_TAG_member
    4755                      .dwattr $C$DW$718, DW_AT_type(*$C$DW$T$70)
    4756                      .dwattr $C$DW$718, DW_AT_name("counter_traj")
    4757                      .dwattr $C$DW$718, DW_AT_TI_symbol_name("_counter_traj")
    4758                      .dwattr $C$DW$718, DW_AT_data_member_location[DW_OP_plus_uconst 0xef]
    4759                      .dwattr $C$DW$718, DW_AT_accessibility(DW_ACCESS_public)
    4760              $C$DW$719       .dwtag  DW_TAG_member
    4761                      .dwattr $C$DW$719, DW_AT_type(*$C$DW$T$34)
    4762                      .dwattr $C$DW$719, DW_AT_name("flag_enableCtrl")
    4763                      .dwattr $C$DW$719, DW_AT_TI_symbol_name("_flag_enableCtrl")
    4764                      .dwattr $C$DW$719, DW_AT_data_member_location[DW_OP_plus_uconst 0xf0]
    4765                      .dwattr $C$DW$719, DW_AT_accessibility(DW_ACCESS_public)
    4766              $C$DW$720       .dwtag  DW_TAG_member
    4767                      .dwattr $C$DW$720, DW_AT_type(*$C$DW$T$34)
    4768                      .dwattr $C$DW$720, DW_AT_name("flag_enableDcBusComp")
    4769                      .dwattr $C$DW$720, DW_AT_TI_symbol_name("_flag_enableDcBusComp")
    4770                      .dwattr $C$DW$720, DW_AT_data_member_location[DW_OP_plus_uconst 0xf1]
    4771                      .dwattr $C$DW$720, DW_AT_accessibility(DW_ACCESS_public)
    4772              $C$DW$721       .dwtag  DW_TAG_member
    4773                      .dwattr $C$DW$721, DW_AT_type(*$C$DW$T$34)
    4774                      .dwattr $C$DW$721, DW_AT_name("flag_enablePowerWarp")
    4775                      .dwattr $C$DW$721, DW_AT_TI_symbol_name("_flag_enablePowerWarp")
    4776                      .dwattr $C$DW$721, DW_AT_data_member_location[DW_OP_plus_uconst 0xf2]
    4777                      .dwattr $C$DW$721, DW_AT_accessibility(DW_ACCESS_public)
    4778              $C$DW$722       .dwtag  DW_TAG_member
    4779                      .dwattr $C$DW$722, DW_AT_type(*$C$DW$T$34)
    4780                      .dwattr $C$DW$722, DW_AT_name("flag_enableOffset")
    4781                      .dwattr $C$DW$722, DW_AT_TI_symbol_name("_flag_enableOffset")
    4782                      .dwattr $C$DW$722, DW_AT_data_member_location[DW_OP_plus_uconst 0xf3]
    4783                      .dwattr $C$DW$722, DW_AT_accessibility(DW_ACCESS_public)
    4784              $C$DW$723       .dwtag  DW_TAG_member
    4785                      .dwattr $C$DW$723, DW_AT_type(*$C$DW$T$34)
    4786                      .dwattr $C$DW$723, DW_AT_name("flag_enableSpeedCtrl")
    4787                      .dwattr $C$DW$723, DW_AT_TI_symbol_name("_flag_enableSpeedCtrl")
    4788                      .dwattr $C$DW$723, DW_AT_data_member_location[DW_OP_plus_uconst 0xf4]
    4789                      .dwattr $C$DW$723, DW_AT_accessibility(DW_ACCESS_public)
    4790              $C$DW$724       .dwtag  DW_TAG_member
    4791                      .dwattr $C$DW$724, DW_AT_type(*$C$DW$T$34)
    4792                      .dwattr $C$DW$724, DW_AT_name("flag_enableUserMotorParams")
    4793                      .dwattr $C$DW$724, DW_AT_TI_symbol_name("_flag_enableUserMotorParams")
TMS320C2000 Assembler PC v6.2.5 Tue Sep 26 10:29:40 2017

Tools Copyright (c) 1996-2014 Texas Instruments Incorporated
C:\Users\wmj\AppData\Local\Temp\1168813                              PAGE   94

    4794                      .dwattr $C$DW$724, DW_AT_data_member_location[DW_OP_plus_uconst 0xf5]
    4795                      .dwattr $C$DW$724, DW_AT_accessibility(DW_ACCESS_public)
    4796              $C$DW$725       .dwtag  DW_TAG_member
    4797                      .dwattr $C$DW$725, DW_AT_type(*$C$DW$T$33)
    4798                      .dwattr $C$DW$725, DW_AT_name("Idq_offset_pu")
    4799                      .dwattr $C$DW$725, DW_AT_TI_symbol_name("_Idq_offset_pu")
    4800                      .dwattr $C$DW$725, DW_AT_data_member_location[DW_OP_plus_uconst 0xf6]
    4801                      .dwattr $C$DW$725, DW_AT_accessibility(DW_ACCESS_public)
    4802              $C$DW$726       .dwtag  DW_TAG_member
    4803                      .dwattr $C$DW$726, DW_AT_type(*$C$DW$T$33)
    4804                      .dwattr $C$DW$726, DW_AT_name("Vdq_offset_pu")
    4805                      .dwattr $C$DW$726, DW_AT_TI_symbol_name("_Vdq_offset_pu")
    4806                      .dwattr $C$DW$726, DW_AT_data_member_location[DW_OP_plus_uconst 0xfa]
    4807                      .dwattr $C$DW$726, DW_AT_accessibility(DW_ACCESS_public)
    4808              $C$DW$727       .dwtag  DW_TAG_member
    4809                      .dwattr $C$DW$727, DW_AT_type(*$C$DW$T$32)
    4810                      .dwattr $C$DW$727, DW_AT_name("angle_pu")
    4811                      .dwattr $C$DW$727, DW_AT_TI_symbol_name("_angle_pu")
    4812                      .dwattr $C$DW$727, DW_AT_data_member_location[DW_OP_plus_uconst 0xfe]
    4813                      .dwattr $C$DW$727, DW_AT_accessibility(DW_ACCESS_public)
    4814              $C$DW$728       .dwtag  DW_TAG_member
    4815                      .dwattr $C$DW$728, DW_AT_type(*$C$DW$T$32)
    4816                      .dwattr $C$DW$728, DW_AT_name("speed_ref_pu")
    4817                      .dwattr $C$DW$728, DW_AT_TI_symbol_name("_speed_ref_pu")
    4818                      .dwattr $C$DW$728, DW_AT_data_member_location[DW_OP_plus_uconst 0x100]
    4819                      .dwattr $C$DW$728, DW_AT_accessibility(DW_ACCESS_public)
    4820              $C$DW$729       .dwtag  DW_TAG_member
    4821                      .dwattr $C$DW$729, DW_AT_type(*$C$DW$T$32)
    4822                      .dwattr $C$DW$729, DW_AT_name("speed_fb_pu")
    4823                      .dwattr $C$DW$729, DW_AT_TI_symbol_name("_speed_fb_pu")
    4824                      .dwattr $C$DW$729, DW_AT_data_member_location[DW_OP_plus_uconst 0x102]
    4825                      .dwattr $C$DW$729, DW_AT_accessibility(DW_ACCESS_public)
    4826              $C$DW$730       .dwtag  DW_TAG_member
    4827                      .dwattr $C$DW$730, DW_AT_type(*$C$DW$T$32)
    4828                      .dwattr $C$DW$730, DW_AT_name("speed_outMax_pu")
    4829                      .dwattr $C$DW$730, DW_AT_TI_symbol_name("_speed_outMax_pu")
    4830                      .dwattr $C$DW$730, DW_AT_data_member_location[DW_OP_plus_uconst 0x104]
    4831                      .dwattr $C$DW$730, DW_AT_accessibility(DW_ACCESS_public)
    4832              $C$DW$731       .dwtag  DW_TAG_member
    4833                      .dwattr $C$DW$731, DW_AT_type(*$C$DW$T$34)
    4834                      .dwattr $C$DW$731, DW_AT_name("flag_enableCurrentCtrl")
    4835                      .dwattr $C$DW$731, DW_AT_TI_symbol_name("_flag_enableCurrentCtrl")
    4836                      .dwattr $C$DW$731, DW_AT_data_member_location[DW_OP_plus_uconst 0x106]
    4837                      .dwattr $C$DW$731, DW_AT_accessibility(DW_ACCESS_public)
    4838              $C$DW$732       .dwtag  DW_TAG_member
    4839                      .dwattr $C$DW$732, DW_AT_type(*$C$DW$T$73)
    4840                      .dwattr $C$DW$732, DW_AT_name("brakeHandle")
    4841                      .dwattr $C$DW$732, DW_AT_TI_symbol_name("_brakeHandle")
    4842                      .dwattr $C$DW$732, DW_AT_data_member_location[DW_OP_plus_uconst 0x108]
    4843                      .dwattr $C$DW$732, DW_AT_accessibility(DW_ACCESS_public)
    4844              $C$DW$733       .dwtag  DW_TAG_member
    4845                      .dwattr $C$DW$733, DW_AT_type(*$C$DW$T$74)
    4846                      .dwattr $C$DW$733, DW_AT_name("brake")
    4847                      .dwattr $C$DW$733, DW_AT_TI_symbol_name("_brake")
    4848                      .dwattr $C$DW$733, DW_AT_data_member_location[DW_OP_plus_uconst 0x10a]
TMS320C2000 Assembler PC v6.2.5 Tue Sep 26 10:29:40 2017

Tools Copyright (c) 1996-2014 Texas Instruments Incorporated
C:\Users\wmj\AppData\Local\Temp\1168813                              PAGE   95

    4849                      .dwattr $C$DW$733, DW_AT_accessibility(DW_ACCESS_public)
    4850                      .dwendtag $C$DW$T$75
    4851              
    4852              $C$DW$T$245     .dwtag  DW_TAG_typedef, DW_AT_name("CTRL_Obj")
    4853                      .dwattr $C$DW$T$245, DW_AT_type(*$C$DW$T$75)
    4854                      .dwattr $C$DW$T$245, DW_AT_language(DW_LANG_C)
    4855              $C$DW$T$246     .dwtag  DW_TAG_pointer_type
    4856                      .dwattr $C$DW$T$246, DW_AT_type(*$C$DW$T$245)
    4857                      .dwattr $C$DW$T$246, DW_AT_address_class(0x16)
    4858              $C$DW$T$185     .dwtag  DW_TAG_pointer_type
    4859                      .dwattr $C$DW$T$185, DW_AT_type(*$C$DW$T$75)
    4860                      .dwattr $C$DW$T$185, DW_AT_address_class(0x16)
    4861              $C$DW$T$186     .dwtag  DW_TAG_typedef, DW_AT_name("CTRL_Handle")
    4862                      .dwattr $C$DW$T$186, DW_AT_type(*$C$DW$T$185)
    4863                      .dwattr $C$DW$T$186, DW_AT_language(DW_LANG_C)
    4864              $C$DW$734       .dwtag  DW_TAG_TI_far_type
    4865                      .dwattr $C$DW$734, DW_AT_type(*$C$DW$T$186)
    4866              $C$DW$T$247     .dwtag  DW_TAG_const_type
    4867                      .dwattr $C$DW$T$247, DW_AT_type(*$C$DW$734)
    4868              
    4869              $C$DW$T$78      .dwtag  DW_TAG_structure_type
    4870                      .dwattr $C$DW$T$78, DW_AT_name("_CTRL_Version_")
    4871                      .dwattr $C$DW$T$78, DW_AT_byte_size(0x04)
    4872              $C$DW$735       .dwtag  DW_TAG_member
    4873                      .dwattr $C$DW$735, DW_AT_type(*$C$DW$T$23)
    4874                      .dwattr $C$DW$735, DW_AT_name("rsvd")
    4875                      .dwattr $C$DW$735, DW_AT_TI_symbol_name("_rsvd")
    4876                      .dwattr $C$DW$735, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    4877                      .dwattr $C$DW$735, DW_AT_accessibility(DW_ACCESS_public)
    4878              $C$DW$736       .dwtag  DW_TAG_member
    4879                      .dwattr $C$DW$736, DW_AT_type(*$C$DW$T$77)
    4880                      .dwattr $C$DW$736, DW_AT_name("targetProc")
    4881                      .dwattr $C$DW$736, DW_AT_TI_symbol_name("_targetProc")
    4882                      .dwattr $C$DW$736, DW_AT_data_member_location[DW_OP_plus_uconst 0x1]
    4883                      .dwattr $C$DW$736, DW_AT_accessibility(DW_ACCESS_public)
    4884              $C$DW$737       .dwtag  DW_TAG_member
    4885                      .dwattr $C$DW$737, DW_AT_type(*$C$DW$T$23)
    4886                      .dwattr $C$DW$737, DW_AT_name("major")
    4887                      .dwattr $C$DW$737, DW_AT_TI_symbol_name("_major")
    4888                      .dwattr $C$DW$737, DW_AT_data_member_location[DW_OP_plus_uconst 0x2]
    4889                      .dwattr $C$DW$737, DW_AT_accessibility(DW_ACCESS_public)
    4890              $C$DW$738       .dwtag  DW_TAG_member
    4891                      .dwattr $C$DW$738, DW_AT_type(*$C$DW$T$23)
    4892                      .dwattr $C$DW$738, DW_AT_name("minor")
    4893                      .dwattr $C$DW$738, DW_AT_TI_symbol_name("_minor")
    4894                      .dwattr $C$DW$738, DW_AT_data_member_location[DW_OP_plus_uconst 0x3]
    4895                      .dwattr $C$DW$738, DW_AT_accessibility(DW_ACCESS_public)
    4896                      .dwendtag $C$DW$T$78
    4897              
    4898              $C$DW$T$41      .dwtag  DW_TAG_typedef, DW_AT_name("CTRL_Version")
    4899                      .dwattr $C$DW$T$41, DW_AT_type(*$C$DW$T$78)
    4900                      .dwattr $C$DW$T$41, DW_AT_language(DW_LANG_C)
    4901              $C$DW$T$255     .dwtag  DW_TAG_pointer_type
    4902                      .dwattr $C$DW$T$255, DW_AT_type(*$C$DW$T$41)
    4903                      .dwattr $C$DW$T$255, DW_AT_address_class(0x16)
TMS320C2000 Assembler PC v6.2.5 Tue Sep 26 10:29:40 2017

Tools Copyright (c) 1996-2014 Texas Instruments Incorporated
C:\Users\wmj\AppData\Local\Temp\1168813                              PAGE   96

    4904              
    4905              $C$DW$T$20      .dwtag  DW_TAG_structure_type
    4906                      .dwattr $C$DW$T$20, DW_AT_name("_EST_Obj_")
    4907                      .dwattr $C$DW$T$20, DW_AT_declaration
    4908                      .dwendtag $C$DW$T$20
    4909              
    4910              $C$DW$T$49      .dwtag  DW_TAG_pointer_type
    4911                      .dwattr $C$DW$T$49, DW_AT_type(*$C$DW$T$20)
    4912                      .dwattr $C$DW$T$49, DW_AT_address_class(0x16)
    4913              $C$DW$T$50      .dwtag  DW_TAG_typedef, DW_AT_name("EST_Handle")
    4914                      .dwattr $C$DW$T$50, DW_AT_type(*$C$DW$T$49)
    4915                      .dwattr $C$DW$T$50, DW_AT_language(DW_LANG_C)
    4916              
    4917              $C$DW$T$79      .dwtag  DW_TAG_structure_type
    4918                      .dwattr $C$DW$T$79, DW_AT_name("_FILTER_FO_")
    4919                      .dwattr $C$DW$T$79, DW_AT_byte_size(0x0a)
    4920              $C$DW$739       .dwtag  DW_TAG_member
    4921                      .dwattr $C$DW$739, DW_AT_type(*$C$DW$T$32)
    4922                      .dwattr $C$DW$739, DW_AT_name("a1")
    4923                      .dwattr $C$DW$739, DW_AT_TI_symbol_name("_a1")
    4924                      .dwattr $C$DW$739, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    4925                      .dwattr $C$DW$739, DW_AT_accessibility(DW_ACCESS_public)
    4926              $C$DW$740       .dwtag  DW_TAG_member
    4927                      .dwattr $C$DW$740, DW_AT_type(*$C$DW$T$32)
    4928                      .dwattr $C$DW$740, DW_AT_name("b0")
    4929                      .dwattr $C$DW$740, DW_AT_TI_symbol_name("_b0")
    4930                      .dwattr $C$DW$740, DW_AT_data_member_location[DW_OP_plus_uconst 0x2]
    4931                      .dwattr $C$DW$740, DW_AT_accessibility(DW_ACCESS_public)
    4932              $C$DW$741       .dwtag  DW_TAG_member
    4933                      .dwattr $C$DW$741, DW_AT_type(*$C$DW$T$32)
    4934                      .dwattr $C$DW$741, DW_AT_name("b1")
    4935                      .dwattr $C$DW$741, DW_AT_TI_symbol_name("_b1")
    4936                      .dwattr $C$DW$741, DW_AT_data_member_location[DW_OP_plus_uconst 0x4]
    4937                      .dwattr $C$DW$741, DW_AT_accessibility(DW_ACCESS_public)
    4938              $C$DW$742       .dwtag  DW_TAG_member
    4939                      .dwattr $C$DW$742, DW_AT_type(*$C$DW$T$32)
    4940                      .dwattr $C$DW$742, DW_AT_name("x1")
    4941                      .dwattr $C$DW$742, DW_AT_TI_symbol_name("_x1")
    4942                      .dwattr $C$DW$742, DW_AT_data_member_location[DW_OP_plus_uconst 0x6]
    4943                      .dwattr $C$DW$742, DW_AT_accessibility(DW_ACCESS_public)
    4944              $C$DW$743       .dwtag  DW_TAG_member
    4945                      .dwattr $C$DW$743, DW_AT_type(*$C$DW$T$32)
    4946                      .dwattr $C$DW$743, DW_AT_name("y1")
    4947                      .dwattr $C$DW$743, DW_AT_TI_symbol_name("_y1")
    4948                      .dwattr $C$DW$743, DW_AT_data_member_location[DW_OP_plus_uconst 0x8]
    4949                      .dwattr $C$DW$743, DW_AT_accessibility(DW_ACCESS_public)
    4950                      .dwendtag $C$DW$T$79
    4951              
    4952              $C$DW$T$160     .dwtag  DW_TAG_typedef, DW_AT_name("FILTER_FO_Obj")
    4953                      .dwattr $C$DW$T$160, DW_AT_type(*$C$DW$T$79)
    4954                      .dwattr $C$DW$T$160, DW_AT_language(DW_LANG_C)
    4955              
    4956              $C$DW$T$21      .dwtag  DW_TAG_structure_type
    4957                      .dwattr $C$DW$T$21, DW_AT_name("_FILTER_FO_Obj_")
    4958                      .dwattr $C$DW$T$21, DW_AT_declaration
TMS320C2000 Assembler PC v6.2.5 Tue Sep 26 10:29:40 2017

Tools Copyright (c) 1996-2014 Texas Instruments Incorporated
C:\Users\wmj\AppData\Local\Temp\1168813                              PAGE   97

    4959                      .dwendtag $C$DW$T$21
    4960              
    4961              $C$DW$T$161     .dwtag  DW_TAG_pointer_type
    4962                      .dwattr $C$DW$T$161, DW_AT_type(*$C$DW$T$21)
    4963                      .dwattr $C$DW$T$161, DW_AT_address_class(0x16)
    4964              $C$DW$T$162     .dwtag  DW_TAG_typedef, DW_AT_name("FILTER_FO_Handle")
    4965                      .dwattr $C$DW$T$162, DW_AT_type(*$C$DW$T$161)
    4966                      .dwattr $C$DW$T$162, DW_AT_language(DW_LANG_C)
    4967              
    4968              $C$DW$T$80      .dwtag  DW_TAG_structure_type
    4969                      .dwattr $C$DW$T$80, DW_AT_name("_FLASH_Obj_")
    4970                      .dwattr $C$DW$T$80, DW_AT_byte_size(0x08)
    4971              $C$DW$744       .dwtag  DW_TAG_member
    4972                      .dwattr $C$DW$744, DW_AT_type(*$C$DW$T$24)
    4973                      .dwattr $C$DW$744, DW_AT_name("FOPT")
    4974                      .dwattr $C$DW$744, DW_AT_TI_symbol_name("_FOPT")
    4975                      .dwattr $C$DW$744, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    4976                      .dwattr $C$DW$744, DW_AT_accessibility(DW_ACCESS_public)
    4977              $C$DW$745       .dwtag  DW_TAG_member
    4978                      .dwattr $C$DW$745, DW_AT_type(*$C$DW$T$24)
    4979                      .dwattr $C$DW$745, DW_AT_name("rsvd_1")
    4980                      .dwattr $C$DW$745, DW_AT_TI_symbol_name("_rsvd_1")
    4981                      .dwattr $C$DW$745, DW_AT_data_member_location[DW_OP_plus_uconst 0x1]
    4982                      .dwattr $C$DW$745, DW_AT_accessibility(DW_ACCESS_public)
    4983              $C$DW$746       .dwtag  DW_TAG_member
    4984                      .dwattr $C$DW$746, DW_AT_type(*$C$DW$T$24)
    4985                      .dwattr $C$DW$746, DW_AT_name("FPWR")
    4986                      .dwattr $C$DW$746, DW_AT_TI_symbol_name("_FPWR")
    4987                      .dwattr $C$DW$746, DW_AT_data_member_location[DW_OP_plus_uconst 0x2]
    4988                      .dwattr $C$DW$746, DW_AT_accessibility(DW_ACCESS_public)
    4989              $C$DW$747       .dwtag  DW_TAG_member
    4990                      .dwattr $C$DW$747, DW_AT_type(*$C$DW$T$24)
    4991                      .dwattr $C$DW$747, DW_AT_name("FSTATUS")
    4992                      .dwattr $C$DW$747, DW_AT_TI_symbol_name("_FSTATUS")
    4993                      .dwattr $C$DW$747, DW_AT_data_member_location[DW_OP_plus_uconst 0x3]
    4994                      .dwattr $C$DW$747, DW_AT_accessibility(DW_ACCESS_public)
    4995              $C$DW$748       .dwtag  DW_TAG_member
    4996                      .dwattr $C$DW$748, DW_AT_type(*$C$DW$T$24)
    4997                      .dwattr $C$DW$748, DW_AT_name("FSTDBYWAIT")
    4998                      .dwattr $C$DW$748, DW_AT_TI_symbol_name("_FSTDBYWAIT")
    4999                      .dwattr $C$DW$748, DW_AT_data_member_location[DW_OP_plus_uconst 0x4]
    5000                      .dwattr $C$DW$748, DW_AT_accessibility(DW_ACCESS_public)
    5001              $C$DW$749       .dwtag  DW_TAG_member
    5002                      .dwattr $C$DW$749, DW_AT_type(*$C$DW$T$24)
    5003                      .dwattr $C$DW$749, DW_AT_name("FACTIVEWAIT")
    5004                      .dwattr $C$DW$749, DW_AT_TI_symbol_name("_FACTIVEWAIT")
    5005                      .dwattr $C$DW$749, DW_AT_data_member_location[DW_OP_plus_uconst 0x5]
    5006                      .dwattr $C$DW$749, DW_AT_accessibility(DW_ACCESS_public)
    5007              $C$DW$750       .dwtag  DW_TAG_member
    5008                      .dwattr $C$DW$750, DW_AT_type(*$C$DW$T$24)
    5009                      .dwattr $C$DW$750, DW_AT_name("FBANKWAIT")
    5010                      .dwattr $C$DW$750, DW_AT_TI_symbol_name("_FBANKWAIT")
    5011                      .dwattr $C$DW$750, DW_AT_data_member_location[DW_OP_plus_uconst 0x6]
    5012                      .dwattr $C$DW$750, DW_AT_accessibility(DW_ACCESS_public)
    5013              $C$DW$751       .dwtag  DW_TAG_member
TMS320C2000 Assembler PC v6.2.5 Tue Sep 26 10:29:40 2017

Tools Copyright (c) 1996-2014 Texas Instruments Incorporated
C:\Users\wmj\AppData\Local\Temp\1168813                              PAGE   98

    5014                      .dwattr $C$DW$751, DW_AT_type(*$C$DW$T$24)
    5015                      .dwattr $C$DW$751, DW_AT_name("FOTPWAIT")
    5016                      .dwattr $C$DW$751, DW_AT_TI_symbol_name("_FOTPWAIT")
    5017                      .dwattr $C$DW$751, DW_AT_data_member_location[DW_OP_plus_uconst 0x7]
    5018                      .dwattr $C$DW$751, DW_AT_accessibility(DW_ACCESS_public)
    5019                      .dwendtag $C$DW$T$80
    5020              
    5021              $C$DW$T$94      .dwtag  DW_TAG_pointer_type
    5022                      .dwattr $C$DW$T$94, DW_AT_type(*$C$DW$T$80)
    5023                      .dwattr $C$DW$T$94, DW_AT_address_class(0x16)
    5024              $C$DW$T$95      .dwtag  DW_TAG_typedef, DW_AT_name("FLASH_Handle")
    5025                      .dwattr $C$DW$T$95, DW_AT_type(*$C$DW$T$94)
    5026                      .dwattr $C$DW$T$95, DW_AT_language(DW_LANG_C)
    5027              
    5028              $C$DW$T$81      .dwtag  DW_TAG_structure_type
    5029                      .dwattr $C$DW$T$81, DW_AT_name("_FS_Obj_")
    5030                      .dwattr $C$DW$T$81, DW_AT_byte_size(0x12)
    5031              $C$DW$752       .dwtag  DW_TAG_member
    5032                      .dwattr $C$DW$752, DW_AT_type(*$C$DW$T$32)
    5033                      .dwattr $C$DW$752, DW_AT_name("speed_ref_pu")
    5034                      .dwattr $C$DW$752, DW_AT_TI_symbol_name("_speed_ref_pu")
    5035                      .dwattr $C$DW$752, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    5036                      .dwattr $C$DW$752, DW_AT_accessibility(DW_ACCESS_public)
    5037              $C$DW$753       .dwtag  DW_TAG_member
    5038                      .dwattr $C$DW$753, DW_AT_type(*$C$DW$T$32)
    5039                      .dwattr $C$DW$753, DW_AT_name("speed_set_pu")
    5040                      .dwattr $C$DW$753, DW_AT_TI_symbol_name("_speed_set_pu")
    5041                      .dwattr $C$DW$753, DW_AT_data_member_location[DW_OP_plus_uconst 0x2]
    5042                      .dwattr $C$DW$753, DW_AT_accessibility(DW_ACCESS_public)
    5043              $C$DW$754       .dwtag  DW_TAG_member
    5044                      .dwattr $C$DW$754, DW_AT_type(*$C$DW$T$32)
    5045                      .dwattr $C$DW$754, DW_AT_name("speed_est_pu")
    5046                      .dwattr $C$DW$754, DW_AT_TI_symbol_name("_speed_est_pu")
    5047                      .dwattr $C$DW$754, DW_AT_data_member_location[DW_OP_plus_uconst 0x4]
    5048                      .dwattr $C$DW$754, DW_AT_accessibility(DW_ACCESS_public)
    5049              $C$DW$755       .dwtag  DW_TAG_member
    5050                      .dwattr $C$DW$755, DW_AT_type(*$C$DW$T$32)
    5051                      .dwattr $C$DW$755, DW_AT_name("speed_est_avg")
    5052                      .dwattr $C$DW$755, DW_AT_TI_symbol_name("_speed_est_avg")
    5053                      .dwattr $C$DW$755, DW_AT_data_member_location[DW_OP_plus_uconst 0x6]
    5054                      .dwattr $C$DW$755, DW_AT_accessibility(DW_ACCESS_public)
    5055              $C$DW$756       .dwtag  DW_TAG_member
    5056                      .dwattr $C$DW$756, DW_AT_type(*$C$DW$T$32)
    5057                      .dwattr $C$DW$756, DW_AT_name("speed_fs_min")
    5058                      .dwattr $C$DW$756, DW_AT_TI_symbol_name("_speed_fs_min")
    5059                      .dwattr $C$DW$756, DW_AT_data_member_location[DW_OP_plus_uconst 0x8]
    5060                      .dwattr $C$DW$756, DW_AT_accessibility(DW_ACCESS_public)
    5061              $C$DW$757       .dwtag  DW_TAG_member
    5062                      .dwattr $C$DW$757, DW_AT_type(*$C$DW$T$32)
    5063                      .dwattr $C$DW$757, DW_AT_name("run_direction")
    5064                      .dwattr $C$DW$757, DW_AT_TI_symbol_name("_run_direction")
    5065                      .dwattr $C$DW$757, DW_AT_data_member_location[DW_OP_plus_uconst 0xa]
    5066                      .dwattr $C$DW$757, DW_AT_accessibility(DW_ACCESS_public)
    5067              $C$DW$758       .dwtag  DW_TAG_member
    5068                      .dwattr $C$DW$758, DW_AT_type(*$C$DW$T$67)
TMS320C2000 Assembler PC v6.2.5 Tue Sep 26 10:29:40 2017

Tools Copyright (c) 1996-2014 Texas Instruments Incorporated
C:\Users\wmj\AppData\Local\Temp\1168813                              PAGE   99

    5069                      .dwattr $C$DW$758, DW_AT_name("cnt_checktime")
    5070                      .dwattr $C$DW$758, DW_AT_TI_symbol_name("_cnt_checktime")
    5071                      .dwattr $C$DW$758, DW_AT_data_member_location[DW_OP_plus_uconst 0xc]
    5072                      .dwattr $C$DW$758, DW_AT_accessibility(DW_ACCESS_public)
    5073              $C$DW$759       .dwtag  DW_TAG_member
    5074                      .dwattr $C$DW$759, DW_AT_type(*$C$DW$T$67)
    5075                      .dwattr $C$DW$759, DW_AT_name("max_checktime")
    5076                      .dwattr $C$DW$759, DW_AT_TI_symbol_name("_max_checktime")
    5077                      .dwattr $C$DW$759, DW_AT_data_member_location[DW_OP_plus_uconst 0xe]
    5078                      .dwattr $C$DW$759, DW_AT_accessibility(DW_ACCESS_public)
    5079              $C$DW$760       .dwtag  DW_TAG_member
    5080                      .dwattr $C$DW$760, DW_AT_type(*$C$DW$T$34)
    5081                      .dwattr $C$DW$760, DW_AT_name("flag_enableSpeedCtrl")
    5082                      .dwattr $C$DW$760, DW_AT_TI_symbol_name("_flag_enableSpeedCtrl")
    5083                      .dwattr $C$DW$760, DW_AT_data_member_location[DW_OP_plus_uconst 0x10]
    5084                      .dwattr $C$DW$760, DW_AT_accessibility(DW_ACCESS_public)
    5085              $C$DW$761       .dwtag  DW_TAG_member
    5086                      .dwattr $C$DW$761, DW_AT_type(*$C$DW$T$34)
    5087                      .dwattr $C$DW$761, DW_AT_name("flag_enableFs")
    5088                      .dwattr $C$DW$761, DW_AT_TI_symbol_name("_flag_enableFs")
    5089                      .dwattr $C$DW$761, DW_AT_data_member_location[DW_OP_plus_uconst 0x11]
    5090                      .dwattr $C$DW$761, DW_AT_accessibility(DW_ACCESS_public)
    5091                      .dwendtag $C$DW$T$81
    5092              
    5093              $C$DW$T$187     .dwtag  DW_TAG_typedef, DW_AT_name("FS_Obj")
    5094                      .dwattr $C$DW$T$187, DW_AT_type(*$C$DW$T$81)
    5095                      .dwattr $C$DW$T$187, DW_AT_language(DW_LANG_C)
    5096              $C$DW$T$188     .dwtag  DW_TAG_pointer_type
    5097                      .dwattr $C$DW$T$188, DW_AT_type(*$C$DW$T$81)
    5098                      .dwattr $C$DW$T$188, DW_AT_address_class(0x16)
    5099              $C$DW$T$189     .dwtag  DW_TAG_typedef, DW_AT_name("FS_Handle")
    5100                      .dwattr $C$DW$T$189, DW_AT_type(*$C$DW$T$188)
    5101                      .dwattr $C$DW$T$189, DW_AT_language(DW_LANG_C)
    5102              
    5103              $C$DW$T$85      .dwtag  DW_TAG_structure_type
    5104                      .dwattr $C$DW$T$85, DW_AT_name("_GPIO_Obj_")
    5105                      .dwattr $C$DW$T$85, DW_AT_byte_size(0x6a)
    5106              $C$DW$762       .dwtag  DW_TAG_member
    5107                      .dwattr $C$DW$762, DW_AT_type(*$C$DW$T$82)
    5108                      .dwattr $C$DW$762, DW_AT_name("GPACTRL")
    5109                      .dwattr $C$DW$762, DW_AT_TI_symbol_name("_GPACTRL")
    5110                      .dwattr $C$DW$762, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    5111                      .dwattr $C$DW$762, DW_AT_accessibility(DW_ACCESS_public)
    5112              $C$DW$763       .dwtag  DW_TAG_member
    5113                      .dwattr $C$DW$763, DW_AT_type(*$C$DW$T$82)
    5114                      .dwattr $C$DW$763, DW_AT_name("GPAQSEL1")
    5115                      .dwattr $C$DW$763, DW_AT_TI_symbol_name("_GPAQSEL1")
    5116                      .dwattr $C$DW$763, DW_AT_data_member_location[DW_OP_plus_uconst 0x2]
