TMS320C2000 Assembler PC v6.2.5 Mon Sep 11 16:23:19 2017

Tools Copyright (c) 1996-2014 Texas Instruments Incorporated
C:\Users\wmj\AppData\Local\Temp\1011613                              PAGE    1

       1              ;***************************************************************
       2              ;* TMS320C2000 C/C++ Codegen                         PC v6.2.5 *
       3              ;* Date/Time created: Mon Sep 11 16:23:18 2017                 *
       4              ;***************************************************************
       5                      .compiler_opts --float_support=softlib --hll_source=on --mem_model:code=flat --mem_model:data=large -
       6        0002  FP      .set    XAR2
       7              
       8              $C$DW$CU        .dwtag  DW_TAG_compile_unit
       9                      .dwattr $C$DW$CU, DW_AT_name("D:/BM1000Code/sw/solutions/instaspin_foc/src/proj_lab05b.c")
      10                      .dwattr $C$DW$CU, DW_AT_producer("TMS320C2000 C/C++ Codegen PC v6.2.5 Copyright (c) 1996-2014 Texas I
      11                      .dwattr $C$DW$CU, DW_AT_TI_version(0x01)
      12                      .dwattr $C$DW$CU, DW_AT_comp_dir("D:\BM1000Code\sw\solutions\instaspin_foc\boards\hvkit_rev1p1\f28x\f
      13              ;**************************************************************
      14              ;* CINIT RECORDS                                              *

    3670                      .dwattr $C$DW$T$275, DW_AT_type(*$C$DW$T$274)
    3671                      .dwattr $C$DW$T$275, DW_AT_language(DW_LANG_C)
    3672              
    3673              $C$DW$T$277     .dwtag  DW_TAG_enumeration_type
    3674                      .dwattr $C$DW$T$277, DW_AT_byte_size(0x01)
    3675              $C$DW$558       .dwtag  DW_TAG_enumerator, DW_AT_name("PIE_GroupNumber_1"), DW_AT_const_value(0x00)
    3676              $C$DW$559       .dwtag  DW_TAG_enumerator, DW_AT_name("PIE_GroupNumber_2"), DW_AT_const_value(0x01)
    3677              $C$DW$560       .dwtag  DW_TAG_enumerator, DW_AT_name("PIE_GroupNumber_3"), DW_AT_const_value(0x02)
    3678              $C$DW$561       .dwtag  DW_TAG_enumerator, DW_AT_name("PIE_GroupNumber_4"), DW_AT_const_value(0x03)
    3679              $C$DW$562       .dwtag  DW_TAG_enumerator, DW_AT_name("PIE_GroupNumber_5"), DW_AT_const_value(0x04)
    3680              $C$DW$563       .dwtag  DW_TAG_enumerator, DW_AT_name("PIE_GroupNumber_6"), DW_AT_const_value(0x05)
    3681              $C$DW$564       .dwtag  DW_TAG_enumerator, DW_AT_name("PIE_GroupNumber_7"), DW_AT_const_value(0x06)
    3682              $C$DW$565       .dwtag  DW_TAG_enumerator, DW_AT_name("PIE_GroupNumber_8"), DW_AT_const_value(0x07)
    3683              $C$DW$566       .dwtag  DW_TAG_enumerator, DW_AT_name("PIE_GroupNumber_9"), DW_AT_const_value(0x08)
    3684              $C$DW$567       .dwtag  DW_TAG_enumerator, DW_AT_name("PIE_GroupNumber_10"), DW_AT_const_value(0x09)
    3685              $C$DW$568       .dwtag  DW_TAG_enumerator, DW_AT_name("PIE_GroupNumber_11"), DW_AT_const_value(0x0a)
    3686              $C$DW$569       .dwtag  DW_TAG_enumerator, DW_AT_name("PIE_GroupNumber_12"), DW_AT_const_value(0x0b)
    3687                      .dwendtag $C$DW$T$277
    3688              
    3689              $C$DW$T$278     .dwtag  DW_TAG_typedef, DW_AT_name("PIE_GroupNumber_e")
    3690                      .dwattr $C$DW$T$278, DW_AT_type(*$C$DW$T$277)
    3691                      .dwattr $C$DW$T$278, DW_AT_language(DW_LANG_C)
    3692              
    3693              $C$DW$T$280     .dwtag  DW_TAG_enumeration_type
    3694                      .dwattr $C$DW$T$280, DW_AT_byte_size(0x01)
    3695              $C$DW$570       .dwtag  DW_TAG_enumerator, DW_AT_name("CTRL_Type_PID_spd"), DW_AT_const_value(0x00)
    3696              $C$DW$571       .dwtag  DW_TAG_enumerator, DW_AT_name("CTRL_Type_PID_Id"), DW_AT_const_value(0x01)
    3697              $C$DW$572       .dwtag  DW_TAG_enumerator, DW_AT_name("CTRL_Type_PID_Iq"), DW_AT_const_value(0x02)
    3698                      .dwendtag $C$DW$T$280
    3699              
    3700              $C$DW$T$281     .dwtag  DW_TAG_typedef, DW_AT_name("CTRL_Type_e")
    3701                      .dwattr $C$DW$T$281, DW_AT_type(*$C$DW$T$280)
    3702                      .dwattr $C$DW$T$281, DW_AT_language(DW_LANG_C)
    3703              
    3704              $C$DW$T$283     .dwtag  DW_TAG_enumeration_type
    3705                      .dwattr $C$DW$T$283, DW_AT_byte_size(0x01)
    3706              $C$DW$573       .dwtag  DW_TAG_enumerator, DW_AT_name("HAL_SensorType_Current"), DW_AT_const_value(0x00)
    3707              $C$DW$574       .dwtag  DW_TAG_enumerator, DW_AT_name("HAL_SensorType_Voltage"), DW_AT_const_value(0x01)
    3708                      .dwendtag $C$DW$T$283
    3709              
    3710              $C$DW$T$284     .dwtag  DW_TAG_typedef, DW_AT_name("HAL_SensorType_e")
    3711                      .dwattr $C$DW$T$284, DW_AT_type(*$C$DW$T$283)
    3712                      .dwattr $C$DW$T$284, DW_AT_language(DW_LANG_C)
    3713              
    3714              $C$DW$T$19      .dwtag  DW_TAG_structure_type
    3715                      .dwattr $C$DW$T$19, DW_AT_name("I2C_Obj")
    3716                      .dwattr $C$DW$T$19, DW_AT_declaration
    3717                      .dwendtag $C$DW$T$19
    3718              
    3719              $C$DW$T$120     .dwtag  DW_TAG_pointer_type
    3720                      .dwattr $C$DW$T$120, DW_AT_type(*$C$DW$T$19)
    3721                      .dwattr $C$DW$T$120, DW_AT_address_class(0x16)
    3722              $C$DW$T$121     .dwtag  DW_TAG_typedef, DW_AT_name("I2C_Handle")
    3723                      .dwattr $C$DW$T$121, DW_AT_type(*$C$DW$T$120)
TMS320C2000 Assembler PC v6.2.5 Mon Sep 11 16:23:19 2017

Tools Copyright (c) 1996-2014 Texas Instruments Incorporated
C:\Users\wmj\AppData\Local\Temp\1011613                              PAGE   74

    3724                      .dwattr $C$DW$T$121, DW_AT_language(DW_LANG_C)
    3725              
    3726              $C$DW$T$20      .dwtag  DW_TAG_structure_type
    3727                      .dwattr $C$DW$T$20, DW_AT_name("LDC161x_REG_Obj")
    3728                      .dwattr $C$DW$T$20, DW_AT_declaration
    3729                      .dwendtag $C$DW$T$20
    3730              
    3731              $C$DW$T$137     .dwtag  DW_TAG_pointer_type
    3732                      .dwattr $C$DW$T$137, DW_AT_type(*$C$DW$T$20)
    3733                      .dwattr $C$DW$T$137, DW_AT_address_class(0x16)
    3734              $C$DW$T$138     .dwtag  DW_TAG_typedef, DW_AT_name("LDC_Handle")
    3735                      .dwattr $C$DW$T$138, DW_AT_type(*$C$DW$T$137)
    3736                      .dwattr $C$DW$T$138, DW_AT_language(DW_LANG_C)
    3737              
    3738              $C$DW$T$32      .dwtag  DW_TAG_structure_type
    3739                      .dwattr $C$DW$T$32, DW_AT_name("_ADC_Obj_")
    3740                      .dwattr $C$DW$T$32, DW_AT_byte_size(0x6650)
    3741              $C$DW$575       .dwtag  DW_TAG_member
    3742                      .dwattr $C$DW$575, DW_AT_type(*$C$DW$T$26)
    3743                      .dwattr $C$DW$575, DW_AT_name("ADCRESULT")
    3744                      .dwattr $C$DW$575, DW_AT_TI_symbol_name("_ADCRESULT")
    3745                      .dwattr $C$DW$575, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    3746                      .dwattr $C$DW$575, DW_AT_accessibility(DW_ACCESS_public)
    3747              $C$DW$576       .dwtag  DW_TAG_member
    3748                      .dwattr $C$DW$576, DW_AT_type(*$C$DW$T$27)
    3749                      .dwattr $C$DW$576, DW_AT_name("resvd_1")
    3750                      .dwattr $C$DW$576, DW_AT_TI_symbol_name("_resvd_1")
    3751                      .dwattr $C$DW$576, DW_AT_data_member_location[DW_OP_plus_uconst 0x10]
    3752                      .dwattr $C$DW$576, DW_AT_accessibility(DW_ACCESS_public)
    3753              $C$DW$577       .dwtag  DW_TAG_member
    3754                      .dwattr $C$DW$577, DW_AT_type(*$C$DW$T$25)
    3755                      .dwattr $C$DW$577, DW_AT_name("ADCCTL1")
    3756                      .dwattr $C$DW$577, DW_AT_TI_symbol_name("_ADCCTL1")
    3757                      .dwattr $C$DW$577, DW_AT_data_member_location[DW_OP_plus_uconst 0x6600]
    3758                      .dwattr $C$DW$577, DW_AT_accessibility(DW_ACCESS_public)
    3759              $C$DW$578       .dwtag  DW_TAG_member
    3760                      .dwattr $C$DW$578, DW_AT_type(*$C$DW$T$25)
    3761                      .dwattr $C$DW$578, DW_AT_name("ADCCTL2")
    3762                      .dwattr $C$DW$578, DW_AT_TI_symbol_name("_ADCCTL2")
    3763                      .dwattr $C$DW$578, DW_AT_data_member_location[DW_OP_plus_uconst 0x6601]
    3764                      .dwattr $C$DW$578, DW_AT_accessibility(DW_ACCESS_public)
    3765              $C$DW$579       .dwtag  DW_TAG_member
    3766                      .dwattr $C$DW$579, DW_AT_type(*$C$DW$T$28)
    3767                      .dwattr $C$DW$579, DW_AT_name("rsvd_2")
    3768                      .dwattr $C$DW$579, DW_AT_TI_symbol_name("_rsvd_2")
    3769                      .dwattr $C$DW$579, DW_AT_data_member_location[DW_OP_plus_uconst 0x6602]
    3770                      .dwattr $C$DW$579, DW_AT_accessibility(DW_ACCESS_public)
    3771              $C$DW$580       .dwtag  DW_TAG_member
    3772                      .dwattr $C$DW$580, DW_AT_type(*$C$DW$T$25)
    3773                      .dwattr $C$DW$580, DW_AT_name("ADCINTFLG")
    3774                      .dwattr $C$DW$580, DW_AT_TI_symbol_name("_ADCINTFLG")
    3775                      .dwattr $C$DW$580, DW_AT_data_member_location[DW_OP_plus_uconst 0x6604]
    3776                      .dwattr $C$DW$580, DW_AT_accessibility(DW_ACCESS_public)
    3777              $C$DW$581       .dwtag  DW_TAG_member
    3778                      .dwattr $C$DW$581, DW_AT_type(*$C$DW$T$25)
TMS320C2000 Assembler PC v6.2.5 Mon Sep 11 16:23:19 2017

Tools Copyright (c) 1996-2014 Texas Instruments Incorporated
C:\Users\wmj\AppData\Local\Temp\1011613                              PAGE   75

    3779                      .dwattr $C$DW$581, DW_AT_name("ADCINTFLGCLR")
    3780                      .dwattr $C$DW$581, DW_AT_TI_symbol_name("_ADCINTFLGCLR")
    3781                      .dwattr $C$DW$581, DW_AT_data_member_location[DW_OP_plus_uconst 0x6605]
    3782                      .dwattr $C$DW$581, DW_AT_accessibility(DW_ACCESS_public)
    3783              $C$DW$582       .dwtag  DW_TAG_member
    3784                      .dwattr $C$DW$582, DW_AT_type(*$C$DW$T$25)
    3785                      .dwattr $C$DW$582, DW_AT_name("ADCINTOVF")
    3786                      .dwattr $C$DW$582, DW_AT_TI_symbol_name("_ADCINTOVF")
    3787                      .dwattr $C$DW$582, DW_AT_data_member_location[DW_OP_plus_uconst 0x6606]
    3788                      .dwattr $C$DW$582, DW_AT_accessibility(DW_ACCESS_public)
    3789              $C$DW$583       .dwtag  DW_TAG_member
    3790                      .dwattr $C$DW$583, DW_AT_type(*$C$DW$T$25)
    3791                      .dwattr $C$DW$583, DW_AT_name("ADCINTOVFCLR")
    3792                      .dwattr $C$DW$583, DW_AT_TI_symbol_name("_ADCINTOVFCLR")
    3793                      .dwattr $C$DW$583, DW_AT_data_member_location[DW_OP_plus_uconst 0x6607]
    3794                      .dwattr $C$DW$583, DW_AT_accessibility(DW_ACCESS_public)
    3795              $C$DW$584       .dwtag  DW_TAG_member
    3796                      .dwattr $C$DW$584, DW_AT_type(*$C$DW$T$29)
    3797                      .dwattr $C$DW$584, DW_AT_name("INTSELxNy")
    3798                      .dwattr $C$DW$584, DW_AT_TI_symbol_name("_INTSELxNy")
    3799                      .dwattr $C$DW$584, DW_AT_data_member_location[DW_OP_plus_uconst 0x6608]
    3800                      .dwattr $C$DW$584, DW_AT_accessibility(DW_ACCESS_public)
    3801              $C$DW$585       .dwtag  DW_TAG_member
    3802                      .dwattr $C$DW$585, DW_AT_type(*$C$DW$T$30)
    3803                      .dwattr $C$DW$585, DW_AT_name("rsvd_3")
    3804                      .dwattr $C$DW$585, DW_AT_TI_symbol_name("_rsvd_3")
    3805                      .dwattr $C$DW$585, DW_AT_data_member_location[DW_OP_plus_uconst 0x660d]
    3806                      .dwattr $C$DW$585, DW_AT_accessibility(DW_ACCESS_public)
    3807              $C$DW$586       .dwtag  DW_TAG_member
    3808                      .dwattr $C$DW$586, DW_AT_type(*$C$DW$T$25)
    3809                      .dwattr $C$DW$586, DW_AT_name("SOCPRICTRL")
    3810                      .dwattr $C$DW$586, DW_AT_TI_symbol_name("_SOCPRICTRL")
    3811                      .dwattr $C$DW$586, DW_AT_data_member_location[DW_OP_plus_uconst 0x6610]
    3812                      .dwattr $C$DW$586, DW_AT_accessibility(DW_ACCESS_public)
    3813              $C$DW$587       .dwtag  DW_TAG_member
    3814                      .dwattr $C$DW$587, DW_AT_type(*$C$DW$T$25)
    3815                      .dwattr $C$DW$587, DW_AT_name("rsvd_4")
    3816                      .dwattr $C$DW$587, DW_AT_TI_symbol_name("_rsvd_4")
    3817                      .dwattr $C$DW$587, DW_AT_data_member_location[DW_OP_plus_uconst 0x6611]
    3818                      .dwattr $C$DW$587, DW_AT_accessibility(DW_ACCESS_public)
    3819              $C$DW$588       .dwtag  DW_TAG_member
    3820                      .dwattr $C$DW$588, DW_AT_type(*$C$DW$T$25)
    3821                      .dwattr $C$DW$588, DW_AT_name("ADCSAMPLEMODE")
    3822                      .dwattr $C$DW$588, DW_AT_TI_symbol_name("_ADCSAMPLEMODE")
    3823                      .dwattr $C$DW$588, DW_AT_data_member_location[DW_OP_plus_uconst 0x6612]
    3824                      .dwattr $C$DW$588, DW_AT_accessibility(DW_ACCESS_public)
    3825              $C$DW$589       .dwtag  DW_TAG_member
    3826                      .dwattr $C$DW$589, DW_AT_type(*$C$DW$T$25)
    3827                      .dwattr $C$DW$589, DW_AT_name("rsvd_5")
    3828                      .dwattr $C$DW$589, DW_AT_TI_symbol_name("_rsvd_5")
    3829                      .dwattr $C$DW$589, DW_AT_data_member_location[DW_OP_plus_uconst 0x6613]
    3830                      .dwattr $C$DW$589, DW_AT_accessibility(DW_ACCESS_public)
    3831              $C$DW$590       .dwtag  DW_TAG_member
    3832                      .dwattr $C$DW$590, DW_AT_type(*$C$DW$T$25)
    3833                      .dwattr $C$DW$590, DW_AT_name("ADCINTSOCSEL1")
TMS320C2000 Assembler PC v6.2.5 Mon Sep 11 16:23:19 2017

Tools Copyright (c) 1996-2014 Texas Instruments Incorporated
C:\Users\wmj\AppData\Local\Temp\1011613                              PAGE   76

    3834                      .dwattr $C$DW$590, DW_AT_TI_symbol_name("_ADCINTSOCSEL1")
    3835                      .dwattr $C$DW$590, DW_AT_data_member_location[DW_OP_plus_uconst 0x6614]
    3836                      .dwattr $C$DW$590, DW_AT_accessibility(DW_ACCESS_public)
    3837              $C$DW$591       .dwtag  DW_TAG_member
    3838                      .dwattr $C$DW$591, DW_AT_type(*$C$DW$T$25)
    3839                      .dwattr $C$DW$591, DW_AT_name("ADCINTSOCSEL2")
    3840                      .dwattr $C$DW$591, DW_AT_TI_symbol_name("_ADCINTSOCSEL2")
    3841                      .dwattr $C$DW$591, DW_AT_data_member_location[DW_OP_plus_uconst 0x6615]
    3842                      .dwattr $C$DW$591, DW_AT_accessibility(DW_ACCESS_public)
    3843              $C$DW$592       .dwtag  DW_TAG_member
    3844                      .dwattr $C$DW$592, DW_AT_type(*$C$DW$T$28)
    3845                      .dwattr $C$DW$592, DW_AT_name("rsvd_6")
    3846                      .dwattr $C$DW$592, DW_AT_TI_symbol_name("_rsvd_6")
    3847                      .dwattr $C$DW$592, DW_AT_data_member_location[DW_OP_plus_uconst 0x6616]
    3848                      .dwattr $C$DW$592, DW_AT_accessibility(DW_ACCESS_public)
    3849              $C$DW$593       .dwtag  DW_TAG_member
    3850                      .dwattr $C$DW$593, DW_AT_type(*$C$DW$T$25)
    3851                      .dwattr $C$DW$593, DW_AT_name("ADCSOCFLG1")
    3852                      .dwattr $C$DW$593, DW_AT_TI_symbol_name("_ADCSOCFLG1")
    3853                      .dwattr $C$DW$593, DW_AT_data_member_location[DW_OP_plus_uconst 0x6618]
    3854                      .dwattr $C$DW$593, DW_AT_accessibility(DW_ACCESS_public)
    3855              $C$DW$594       .dwtag  DW_TAG_member
    3856                      .dwattr $C$DW$594, DW_AT_type(*$C$DW$T$25)
    3857                      .dwattr $C$DW$594, DW_AT_name("rsvd_7")
    3858                      .dwattr $C$DW$594, DW_AT_TI_symbol_name("_rsvd_7")
    3859                      .dwattr $C$DW$594, DW_AT_data_member_location[DW_OP_plus_uconst 0x6619]
    3860                      .dwattr $C$DW$594, DW_AT_accessibility(DW_ACCESS_public)
    3861              $C$DW$595       .dwtag  DW_TAG_member
    3862                      .dwattr $C$DW$595, DW_AT_type(*$C$DW$T$25)
    3863                      .dwattr $C$DW$595, DW_AT_name("ADCSOCFRC1")
    3864                      .dwattr $C$DW$595, DW_AT_TI_symbol_name("_ADCSOCFRC1")
    3865                      .dwattr $C$DW$595, DW_AT_data_member_location[DW_OP_plus_uconst 0x661a]
    3866                      .dwattr $C$DW$595, DW_AT_accessibility(DW_ACCESS_public)
    3867              $C$DW$596       .dwtag  DW_TAG_member
    3868                      .dwattr $C$DW$596, DW_AT_type(*$C$DW$T$25)
    3869                      .dwattr $C$DW$596, DW_AT_name("rsvd_8")
    3870                      .dwattr $C$DW$596, DW_AT_TI_symbol_name("_rsvd_8")
    3871                      .dwattr $C$DW$596, DW_AT_data_member_location[DW_OP_plus_uconst 0x661b]
    3872                      .dwattr $C$DW$596, DW_AT_accessibility(DW_ACCESS_public)
    3873              $C$DW$597       .dwtag  DW_TAG_member
    3874                      .dwattr $C$DW$597, DW_AT_type(*$C$DW$T$25)
    3875                      .dwattr $C$DW$597, DW_AT_name("ADCSOCOVF1")
    3876                      .dwattr $C$DW$597, DW_AT_TI_symbol_name("_ADCSOCOVF1")
    3877                      .dwattr $C$DW$597, DW_AT_data_member_location[DW_OP_plus_uconst 0x661c]
    3878                      .dwattr $C$DW$597, DW_AT_accessibility(DW_ACCESS_public)
    3879              $C$DW$598       .dwtag  DW_TAG_member
    3880                      .dwattr $C$DW$598, DW_AT_type(*$C$DW$T$25)
    3881                      .dwattr $C$DW$598, DW_AT_name("rsvd_9")
    3882                      .dwattr $C$DW$598, DW_AT_TI_symbol_name("_rsvd_9")
    3883                      .dwattr $C$DW$598, DW_AT_data_member_location[DW_OP_plus_uconst 0x661d]
    3884                      .dwattr $C$DW$598, DW_AT_accessibility(DW_ACCESS_public)
    3885              $C$DW$599       .dwtag  DW_TAG_member
    3886                      .dwattr $C$DW$599, DW_AT_type(*$C$DW$T$25)
    3887                      .dwattr $C$DW$599, DW_AT_name("ADCSOCOVFCLR1")
    3888                      .dwattr $C$DW$599, DW_AT_TI_symbol_name("_ADCSOCOVFCLR1")
TMS320C2000 Assembler PC v6.2.5 Mon Sep 11 16:23:19 2017

Tools Copyright (c) 1996-2014 Texas Instruments Incorporated
C:\Users\wmj\AppData\Local\Temp\1011613                              PAGE   77

    3889                      .dwattr $C$DW$599, DW_AT_data_member_location[DW_OP_plus_uconst 0x661e]
    3890                      .dwattr $C$DW$599, DW_AT_accessibility(DW_ACCESS_public)
    3891              $C$DW$600       .dwtag  DW_TAG_member
    3892                      .dwattr $C$DW$600, DW_AT_type(*$C$DW$T$25)
    3893                      .dwattr $C$DW$600, DW_AT_name("rsvd_10")
    3894                      .dwattr $C$DW$600, DW_AT_TI_symbol_name("_rsvd_10")
    3895                      .dwattr $C$DW$600, DW_AT_data_member_location[DW_OP_plus_uconst 0x661f]
    3896                      .dwattr $C$DW$600, DW_AT_accessibility(DW_ACCESS_public)
    3897              $C$DW$601       .dwtag  DW_TAG_member
    3898                      .dwattr $C$DW$601, DW_AT_type(*$C$DW$T$26)
    3899                      .dwattr $C$DW$601, DW_AT_name("ADCSOCxCTL")
    3900                      .dwattr $C$DW$601, DW_AT_TI_symbol_name("_ADCSOCxCTL")
    3901                      .dwattr $C$DW$601, DW_AT_data_member_location[DW_OP_plus_uconst 0x6620]
    3902                      .dwattr $C$DW$601, DW_AT_accessibility(DW_ACCESS_public)
    3903              $C$DW$602       .dwtag  DW_TAG_member
    3904                      .dwattr $C$DW$602, DW_AT_type(*$C$DW$T$26)
    3905                      .dwattr $C$DW$602, DW_AT_name("rsvd_11")
    3906                      .dwattr $C$DW$602, DW_AT_TI_symbol_name("_rsvd_11")
    3907                      .dwattr $C$DW$602, DW_AT_data_member_location[DW_OP_plus_uconst 0x6630]
    3908                      .dwattr $C$DW$602, DW_AT_accessibility(DW_ACCESS_public)
    3909              $C$DW$603       .dwtag  DW_TAG_member
    3910                      .dwattr $C$DW$603, DW_AT_type(*$C$DW$T$25)
    3911                      .dwattr $C$DW$603, DW_AT_name("ADCREFTRIM")
    3912                      .dwattr $C$DW$603, DW_AT_TI_symbol_name("_ADCREFTRIM")
    3913                      .dwattr $C$DW$603, DW_AT_data_member_location[DW_OP_plus_uconst 0x6640]
    3914                      .dwattr $C$DW$603, DW_AT_accessibility(DW_ACCESS_public)
    3915              $C$DW$604       .dwtag  DW_TAG_member
    3916                      .dwattr $C$DW$604, DW_AT_type(*$C$DW$T$25)
    3917                      .dwattr $C$DW$604, DW_AT_name("ADCOFFTRIM")
    3918                      .dwattr $C$DW$604, DW_AT_TI_symbol_name("_ADCOFFTRIM")
    3919                      .dwattr $C$DW$604, DW_AT_data_member_location[DW_OP_plus_uconst 0x6641]
    3920                      .dwattr $C$DW$604, DW_AT_accessibility(DW_ACCESS_public)
    3921              $C$DW$605       .dwtag  DW_TAG_member
    3922                      .dwattr $C$DW$605, DW_AT_type(*$C$DW$T$31)
    3923                      .dwattr $C$DW$605, DW_AT_name("resvd_12")
    3924                      .dwattr $C$DW$605, DW_AT_TI_symbol_name("_resvd_12")
    3925                      .dwattr $C$DW$605, DW_AT_data_member_location[DW_OP_plus_uconst 0x6642]
    3926                      .dwattr $C$DW$605, DW_AT_accessibility(DW_ACCESS_public)
    3927              $C$DW$606       .dwtag  DW_TAG_member
    3928                      .dwattr $C$DW$606, DW_AT_type(*$C$DW$T$25)
    3929                      .dwattr $C$DW$606, DW_AT_name("ADCREV")
    3930                      .dwattr $C$DW$606, DW_AT_TI_symbol_name("_ADCREV")
    3931                      .dwattr $C$DW$606, DW_AT_data_member_location[DW_OP_plus_uconst 0x664f]
    3932                      .dwattr $C$DW$606, DW_AT_accessibility(DW_ACCESS_public)
    3933                      .dwendtag $C$DW$T$32
    3934              
    3935              $C$DW$T$286     .dwtag  DW_TAG_typedef, DW_AT_name("ADC_Obj")
    3936                      .dwattr $C$DW$T$286, DW_AT_type(*$C$DW$T$32)
    3937                      .dwattr $C$DW$T$286, DW_AT_language(DW_LANG_C)
    3938              $C$DW$T$93      .dwtag  DW_TAG_pointer_type
    3939                      .dwattr $C$DW$T$93, DW_AT_type(*$C$DW$T$32)
    3940                      .dwattr $C$DW$T$93, DW_AT_address_class(0x16)
    3941              $C$DW$T$94      .dwtag  DW_TAG_typedef, DW_AT_name("ADC_Handle")
    3942                      .dwattr $C$DW$T$94, DW_AT_type(*$C$DW$T$93)
    3943                      .dwattr $C$DW$T$94, DW_AT_language(DW_LANG_C)
TMS320C2000 Assembler PC v6.2.5 Mon Sep 11 16:23:19 2017

Tools Copyright (c) 1996-2014 Texas Instruments Incorporated
C:\Users\wmj\AppData\Local\Temp\1011613                              PAGE   78

    3944              
    3945              $C$DW$T$35      .dwtag  DW_TAG_structure_type
    3946                      .dwattr $C$DW$T$35, DW_AT_name("_CLARKE_Obj_")
    3947                      .dwattr $C$DW$T$35, DW_AT_byte_size(0x06)
    3948              $C$DW$607       .dwtag  DW_TAG_member
    3949                      .dwattr $C$DW$607, DW_AT_type(*$C$DW$T$33)
    3950                      .dwattr $C$DW$607, DW_AT_name("alpha_sf")
    3951                      .dwattr $C$DW$607, DW_AT_TI_symbol_name("_alpha_sf")
    3952                      .dwattr $C$DW$607, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    3953                      .dwattr $C$DW$607, DW_AT_accessibility(DW_ACCESS_public)
    3954              $C$DW$608       .dwtag  DW_TAG_member
    3955                      .dwattr $C$DW$608, DW_AT_type(*$C$DW$T$33)
    3956                      .dwattr $C$DW$608, DW_AT_name("beta_sf")
    3957                      .dwattr $C$DW$608, DW_AT_TI_symbol_name("_beta_sf")
    3958                      .dwattr $C$DW$608, DW_AT_data_member_location[DW_OP_plus_uconst 0x2]
    3959                      .dwattr $C$DW$608, DW_AT_accessibility(DW_ACCESS_public)
    3960              $C$DW$609       .dwtag  DW_TAG_member
    3961                      .dwattr $C$DW$609, DW_AT_type(*$C$DW$T$34)
    3962                      .dwattr $C$DW$609, DW_AT_name("numSensors")
    3963                      .dwattr $C$DW$609, DW_AT_TI_symbol_name("_numSensors")
    3964                      .dwattr $C$DW$609, DW_AT_data_member_location[DW_OP_plus_uconst 0x4]
    3965                      .dwattr $C$DW$609, DW_AT_accessibility(DW_ACCESS_public)
    3966                      .dwendtag $C$DW$T$35
    3967              
    3968              $C$DW$T$47      .dwtag  DW_TAG_typedef, DW_AT_name("CLARKE_Obj")
    3969                      .dwattr $C$DW$T$47, DW_AT_type(*$C$DW$T$35)
    3970                      .dwattr $C$DW$T$47, DW_AT_language(DW_LANG_C)
    3971              $C$DW$T$45      .dwtag  DW_TAG_pointer_type
    3972                      .dwattr $C$DW$T$45, DW_AT_type(*$C$DW$T$35)
    3973                      .dwattr $C$DW$T$45, DW_AT_address_class(0x16)
    3974              $C$DW$T$46      .dwtag  DW_TAG_typedef, DW_AT_name("CLARKE_Handle")
    3975                      .dwattr $C$DW$T$46, DW_AT_type(*$C$DW$T$45)
    3976                      .dwattr $C$DW$T$46, DW_AT_language(DW_LANG_C)
    3977              
    3978              $C$DW$T$36      .dwtag  DW_TAG_structure_type
    3979                      .dwattr $C$DW$T$36, DW_AT_name("_CLK_DIV_t_")
    3980                      .dwattr $C$DW$T$36, DW_AT_byte_size(0x02)
    3981              $C$DW$610       .dwtag  DW_TAG_member
    3982                      .dwattr $C$DW$610, DW_AT_type(*$C$DW$T$24)
    3983                      .dwattr $C$DW$610, DW_AT_name("FREF_DIVIDER")
    3984                      .dwattr $C$DW$610, DW_AT_TI_symbol_name("_FREF_DIVIDER")
    3985                      .dwattr $C$DW$610, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    3986                      .dwattr $C$DW$610, DW_AT_accessibility(DW_ACCESS_public)
    3987              $C$DW$611       .dwtag  DW_TAG_member
    3988                      .dwattr $C$DW$611, DW_AT_type(*$C$DW$T$24)
    3989                      .dwattr $C$DW$611, DW_AT_name("FIN_DIVIDER")
    3990                      .dwattr $C$DW$611, DW_AT_TI_symbol_name("_FIN_DIVIDER")
    3991                      .dwattr $C$DW$611, DW_AT_data_member_location[DW_OP_plus_uconst 0x1]
    3992                      .dwattr $C$DW$611, DW_AT_accessibility(DW_ACCESS_public)
    3993                      .dwendtag $C$DW$T$36
    3994              
    3995              $C$DW$T$131     .dwtag  DW_TAG_typedef, DW_AT_name("CLK_DIV_t_")
    3996                      .dwattr $C$DW$T$131, DW_AT_type(*$C$DW$T$36)
    3997                      .dwattr $C$DW$T$131, DW_AT_language(DW_LANG_C)
    3998              
TMS320C2000 Assembler PC v6.2.5 Mon Sep 11 16:23:19 2017

Tools Copyright (c) 1996-2014 Texas Instruments Incorporated
C:\Users\wmj\AppData\Local\Temp\1011613                              PAGE   79

    3999              $C$DW$T$38      .dwtag  DW_TAG_structure_type
    4000                      .dwattr $C$DW$T$38, DW_AT_name("_CLK_Obj_")
    4001                      .dwattr $C$DW$T$38, DW_AT_byte_size(0x11)
    4002              $C$DW$612       .dwtag  DW_TAG_member
    4003                      .dwattr $C$DW$612, DW_AT_type(*$C$DW$T$25)
    4004                      .dwattr $C$DW$612, DW_AT_name("XCLK")
    4005                      .dwattr $C$DW$612, DW_AT_TI_symbol_name("_XCLK")
    4006                      .dwattr $C$DW$612, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    4007                      .dwattr $C$DW$612, DW_AT_accessibility(DW_ACCESS_public)
    4008              $C$DW$613       .dwtag  DW_TAG_member
    4009                      .dwattr $C$DW$613, DW_AT_type(*$C$DW$T$25)
    4010                      .dwattr $C$DW$613, DW_AT_name("rsvd_1")
    4011                      .dwattr $C$DW$613, DW_AT_TI_symbol_name("_rsvd_1")
    4012                      .dwattr $C$DW$613, DW_AT_data_member_location[DW_OP_plus_uconst 0x1]
    4013                      .dwattr $C$DW$613, DW_AT_accessibility(DW_ACCESS_public)
    4014              $C$DW$614       .dwtag  DW_TAG_member
    4015                      .dwattr $C$DW$614, DW_AT_type(*$C$DW$T$25)
    4016                      .dwattr $C$DW$614, DW_AT_name("CLKCTL")
    4017                      .dwattr $C$DW$614, DW_AT_TI_symbol_name("_CLKCTL")
    4018                      .dwattr $C$DW$614, DW_AT_data_member_location[DW_OP_plus_uconst 0x2]
    4019                      .dwattr $C$DW$614, DW_AT_accessibility(DW_ACCESS_public)
    4020              $C$DW$615       .dwtag  DW_TAG_member
    4021                      .dwattr $C$DW$615, DW_AT_type(*$C$DW$T$37)
    4022                      .dwattr $C$DW$615, DW_AT_name("rsvd_2")
    4023                      .dwattr $C$DW$615, DW_AT_TI_symbol_name("_rsvd_2")
    4024                      .dwattr $C$DW$615, DW_AT_data_member_location[DW_OP_plus_uconst 0x3]
    4025                      .dwattr $C$DW$615, DW_AT_accessibility(DW_ACCESS_public)
    4026              $C$DW$616       .dwtag  DW_TAG_member
    4027                      .dwattr $C$DW$616, DW_AT_type(*$C$DW$T$25)
    4028                      .dwattr $C$DW$616, DW_AT_name("LOSPCP")
    4029                      .dwattr $C$DW$616, DW_AT_TI_symbol_name("_LOSPCP")
    4030                      .dwattr $C$DW$616, DW_AT_data_member_location[DW_OP_plus_uconst 0xb]
    4031                      .dwattr $C$DW$616, DW_AT_accessibility(DW_ACCESS_public)
    4032              $C$DW$617       .dwtag  DW_TAG_member
    4033                      .dwattr $C$DW$617, DW_AT_type(*$C$DW$T$25)
    4034                      .dwattr $C$DW$617, DW_AT_name("PCLKCR0")
    4035                      .dwattr $C$DW$617, DW_AT_TI_symbol_name("_PCLKCR0")
    4036                      .dwattr $C$DW$617, DW_AT_data_member_location[DW_OP_plus_uconst 0xc]
    4037                      .dwattr $C$DW$617, DW_AT_accessibility(DW_ACCESS_public)
    4038              $C$DW$618       .dwtag  DW_TAG_member
    4039                      .dwattr $C$DW$618, DW_AT_type(*$C$DW$T$25)
    4040                      .dwattr $C$DW$618, DW_AT_name("PCLKCR1")
    4041                      .dwattr $C$DW$618, DW_AT_TI_symbol_name("_PCLKCR1")
    4042                      .dwattr $C$DW$618, DW_AT_data_member_location[DW_OP_plus_uconst 0xd]
    4043                      .dwattr $C$DW$618, DW_AT_accessibility(DW_ACCESS_public)
    4044              $C$DW$619       .dwtag  DW_TAG_member
    4045                      .dwattr $C$DW$619, DW_AT_type(*$C$DW$T$28)
    4046                      .dwattr $C$DW$619, DW_AT_name("rsvd_3")
    4047                      .dwattr $C$DW$619, DW_AT_TI_symbol_name("_rsvd_3")
    4048                      .dwattr $C$DW$619, DW_AT_data_member_location[DW_OP_plus_uconst 0xe]
    4049                      .dwattr $C$DW$619, DW_AT_accessibility(DW_ACCESS_public)
    4050              $C$DW$620       .dwtag  DW_TAG_member
    4051                      .dwattr $C$DW$620, DW_AT_type(*$C$DW$T$25)
    4052                      .dwattr $C$DW$620, DW_AT_name("PCLKCR3")
    4053                      .dwattr $C$DW$620, DW_AT_TI_symbol_name("_PCLKCR3")
TMS320C2000 Assembler PC v6.2.5 Mon Sep 11 16:23:19 2017

Tools Copyright (c) 1996-2014 Texas Instruments Incorporated
C:\Users\wmj\AppData\Local\Temp\1011613                              PAGE   80

    4054                      .dwattr $C$DW$620, DW_AT_data_member_location[DW_OP_plus_uconst 0x10]
    4055                      .dwattr $C$DW$620, DW_AT_accessibility(DW_ACCESS_public)
    4056                      .dwendtag $C$DW$T$38
    4057              
    4058              $C$DW$T$95      .dwtag  DW_TAG_pointer_type
    4059                      .dwattr $C$DW$T$95, DW_AT_type(*$C$DW$T$38)
    4060                      .dwattr $C$DW$T$95, DW_AT_address_class(0x16)
    4061              $C$DW$T$96      .dwtag  DW_TAG_typedef, DW_AT_name("CLK_Handle")
    4062                      .dwattr $C$DW$T$96, DW_AT_type(*$C$DW$T$95)
    4063                      .dwattr $C$DW$T$96, DW_AT_language(DW_LANG_C)
    4064              
    4065              $C$DW$T$39      .dwtag  DW_TAG_structure_type
    4066                      .dwattr $C$DW$T$39, DW_AT_name("_CPU_Obj_")
    4067                      .dwattr $C$DW$T$39, DW_AT_byte_size(0x01)
    4068              $C$DW$621       .dwtag  DW_TAG_member
    4069                      .dwattr $C$DW$621, DW_AT_type(*$C$DW$T$34)
    4070                      .dwattr $C$DW$621, DW_AT_name("tmp")
    4071                      .dwattr $C$DW$621, DW_AT_TI_symbol_name("_tmp")
    4072                      .dwattr $C$DW$621, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    4073                      .dwattr $C$DW$621, DW_AT_accessibility(DW_ACCESS_public)
    4074                      .dwendtag $C$DW$T$39
    4075              
    4076              $C$DW$T$97      .dwtag  DW_TAG_pointer_type
    4077                      .dwattr $C$DW$T$97, DW_AT_type(*$C$DW$T$39)
    4078                      .dwattr $C$DW$T$97, DW_AT_address_class(0x16)
    4079              $C$DW$T$98      .dwtag  DW_TAG_typedef, DW_AT_name("CPU_Handle")
    4080                      .dwattr $C$DW$T$98, DW_AT_type(*$C$DW$T$97)
    4081                      .dwattr $C$DW$T$98, DW_AT_language(DW_LANG_C)
    4082              
    4083              $C$DW$T$73      .dwtag  DW_TAG_structure_type
    4084                      .dwattr $C$DW$T$73, DW_AT_name("_CTRL_Obj_")
    4085                      .dwattr $C$DW$T$73, DW_AT_byte_size(0x108)
    4086              $C$DW$622       .dwtag  DW_TAG_member
    4087                      .dwattr $C$DW$622, DW_AT_type(*$C$DW$T$40)
    4088                      .dwattr $C$DW$622, DW_AT_name("version")
    4089                      .dwattr $C$DW$622, DW_AT_TI_symbol_name("_version")
    4090                      .dwattr $C$DW$622, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    4091                      .dwattr $C$DW$622, DW_AT_accessibility(DW_ACCESS_public)
    4092              $C$DW$623       .dwtag  DW_TAG_member
    4093                      .dwattr $C$DW$623, DW_AT_type(*$C$DW$T$42)
    4094                      .dwattr $C$DW$623, DW_AT_name("state")
    4095                      .dwattr $C$DW$623, DW_AT_TI_symbol_name("_state")
    4096                      .dwattr $C$DW$623, DW_AT_data_member_location[DW_OP_plus_uconst 0x4]
    4097                      .dwattr $C$DW$623, DW_AT_accessibility(DW_ACCESS_public)
    4098              $C$DW$624       .dwtag  DW_TAG_member
    4099                      .dwattr $C$DW$624, DW_AT_type(*$C$DW$T$42)
    4100                      .dwattr $C$DW$624, DW_AT_name("prevState")
    4101                      .dwattr $C$DW$624, DW_AT_TI_symbol_name("_prevState")
    4102                      .dwattr $C$DW$624, DW_AT_data_member_location[DW_OP_plus_uconst 0x5]
    4103                      .dwattr $C$DW$624, DW_AT_accessibility(DW_ACCESS_public)
    4104              $C$DW$625       .dwtag  DW_TAG_member
    4105                      .dwattr $C$DW$625, DW_AT_type(*$C$DW$T$44)
    4106                      .dwattr $C$DW$625, DW_AT_name("errorCode")
    4107                      .dwattr $C$DW$625, DW_AT_TI_symbol_name("_errorCode")
    4108                      .dwattr $C$DW$625, DW_AT_data_member_location[DW_OP_plus_uconst 0x6]
TMS320C2000 Assembler PC v6.2.5 Mon Sep 11 16:23:19 2017

Tools Copyright (c) 1996-2014 Texas Instruments Incorporated
C:\Users\wmj\AppData\Local\Temp\1011613                              PAGE   81

    4109                      .dwattr $C$DW$625, DW_AT_accessibility(DW_ACCESS_public)
    4110              $C$DW$626       .dwtag  DW_TAG_member
    4111                      .dwattr $C$DW$626, DW_AT_type(*$C$DW$T$46)
    4112                      .dwattr $C$DW$626, DW_AT_name("clarkeHandle_I")
    4113                      .dwattr $C$DW$626, DW_AT_TI_symbol_name("_clarkeHandle_I")
    4114                      .dwattr $C$DW$626, DW_AT_data_member_location[DW_OP_plus_uconst 0x8]
    4115                      .dwattr $C$DW$626, DW_AT_accessibility(DW_ACCESS_public)
    4116              $C$DW$627       .dwtag  DW_TAG_member
    4117                      .dwattr $C$DW$627, DW_AT_type(*$C$DW$T$47)
    4118                      .dwattr $C$DW$627, DW_AT_name("clarke_I")
    4119                      .dwattr $C$DW$627, DW_AT_TI_symbol_name("_clarke_I")
    4120                      .dwattr $C$DW$627, DW_AT_data_member_location[DW_OP_plus_uconst 0xa]
    4121                      .dwattr $C$DW$627, DW_AT_accessibility(DW_ACCESS_public)
    4122              $C$DW$628       .dwtag  DW_TAG_member
    4123                      .dwattr $C$DW$628, DW_AT_type(*$C$DW$T$46)
    4124                      .dwattr $C$DW$628, DW_AT_name("clarkeHandle_V")
    4125                      .dwattr $C$DW$628, DW_AT_TI_symbol_name("_clarkeHandle_V")
    4126                      .dwattr $C$DW$628, DW_AT_data_member_location[DW_OP_plus_uconst 0x10]
    4127                      .dwattr $C$DW$628, DW_AT_accessibility(DW_ACCESS_public)
    4128              $C$DW$629       .dwtag  DW_TAG_member
    4129                      .dwattr $C$DW$629, DW_AT_type(*$C$DW$T$47)
    4130                      .dwattr $C$DW$629, DW_AT_name("clarke_V")
    4131                      .dwattr $C$DW$629, DW_AT_TI_symbol_name("_clarke_V")
    4132                      .dwattr $C$DW$629, DW_AT_data_member_location[DW_OP_plus_uconst 0x12]
    4133                      .dwattr $C$DW$629, DW_AT_accessibility(DW_ACCESS_public)
    4134              $C$DW$630       .dwtag  DW_TAG_member
    4135                      .dwattr $C$DW$630, DW_AT_type(*$C$DW$T$49)
    4136                      .dwattr $C$DW$630, DW_AT_name("estHandle")
    4137                      .dwattr $C$DW$630, DW_AT_TI_symbol_name("_estHandle")
    4138                      .dwattr $C$DW$630, DW_AT_data_member_location[DW_OP_plus_uconst 0x18]
    4139                      .dwattr $C$DW$630, DW_AT_accessibility(DW_ACCESS_public)
    4140              $C$DW$631       .dwtag  DW_TAG_member
    4141                      .dwattr $C$DW$631, DW_AT_type(*$C$DW$T$51)
    4142                      .dwattr $C$DW$631, DW_AT_name("parkHandle")
    4143                      .dwattr $C$DW$631, DW_AT_TI_symbol_name("_parkHandle")
    4144                      .dwattr $C$DW$631, DW_AT_data_member_location[DW_OP_plus_uconst 0x1a]
    4145                      .dwattr $C$DW$631, DW_AT_accessibility(DW_ACCESS_public)
    4146              $C$DW$632       .dwtag  DW_TAG_member
    4147                      .dwattr $C$DW$632, DW_AT_type(*$C$DW$T$52)
    4148                      .dwattr $C$DW$632, DW_AT_name("park")
    4149                      .dwattr $C$DW$632, DW_AT_TI_symbol_name("_park")
    4150                      .dwattr $C$DW$632, DW_AT_data_member_location[DW_OP_plus_uconst 0x1c]
    4151                      .dwattr $C$DW$632, DW_AT_accessibility(DW_ACCESS_public)
    4152              $C$DW$633       .dwtag  DW_TAG_member
    4153                      .dwattr $C$DW$633, DW_AT_type(*$C$DW$T$54)
    4154                      .dwattr $C$DW$633, DW_AT_name("pidHandle_Id")
    4155                      .dwattr $C$DW$633, DW_AT_TI_symbol_name("_pidHandle_Id")
    4156                      .dwattr $C$DW$633, DW_AT_data_member_location[DW_OP_plus_uconst 0x20]
    4157                      .dwattr $C$DW$633, DW_AT_accessibility(DW_ACCESS_public)
    4158              $C$DW$634       .dwtag  DW_TAG_member
    4159                      .dwattr $C$DW$634, DW_AT_type(*$C$DW$T$55)
    4160                      .dwattr $C$DW$634, DW_AT_name("pid_Id")
    4161                      .dwattr $C$DW$634, DW_AT_TI_symbol_name("_pid_Id")
    4162                      .dwattr $C$DW$634, DW_AT_data_member_location[DW_OP_plus_uconst 0x22]
    4163                      .dwattr $C$DW$634, DW_AT_accessibility(DW_ACCESS_public)
TMS320C2000 Assembler PC v6.2.5 Mon Sep 11 16:23:19 2017

Tools Copyright (c) 1996-2014 Texas Instruments Incorporated
C:\Users\wmj\AppData\Local\Temp\1011613                              PAGE   82

    4164              $C$DW$635       .dwtag  DW_TAG_member
    4165                      .dwattr $C$DW$635, DW_AT_type(*$C$DW$T$54)
    4166                      .dwattr $C$DW$635, DW_AT_name("pidHandle_Iq")
    4167                      .dwattr $C$DW$635, DW_AT_TI_symbol_name("_pidHandle_Iq")
    4168                      .dwattr $C$DW$635, DW_AT_data_member_location[DW_OP_plus_uconst 0x32]
    4169                      .dwattr $C$DW$635, DW_AT_accessibility(DW_ACCESS_public)
    4170              $C$DW$636       .dwtag  DW_TAG_member
    4171                      .dwattr $C$DW$636, DW_AT_type(*$C$DW$T$55)
    4172                      .dwattr $C$DW$636, DW_AT_name("pid_Iq")
    4173                      .dwattr $C$DW$636, DW_AT_TI_symbol_name("_pid_Iq")
    4174                      .dwattr $C$DW$636, DW_AT_data_member_location[DW_OP_plus_uconst 0x34]
    4175                      .dwattr $C$DW$636, DW_AT_accessibility(DW_ACCESS_public)
    4176              $C$DW$637       .dwtag  DW_TAG_member
    4177                      .dwattr $C$DW$637, DW_AT_type(*$C$DW$T$54)
    4178                      .dwattr $C$DW$637, DW_AT_name("pidHandle_spd")
    4179                      .dwattr $C$DW$637, DW_AT_TI_symbol_name("_pidHandle_spd")
    4180                      .dwattr $C$DW$637, DW_AT_data_member_location[DW_OP_plus_uconst 0x44]
    4181                      .dwattr $C$DW$637, DW_AT_accessibility(DW_ACCESS_public)
    4182              $C$DW$638       .dwtag  DW_TAG_member
    4183                      .dwattr $C$DW$638, DW_AT_type(*$C$DW$T$55)
    4184                      .dwattr $C$DW$638, DW_AT_name("pid_spd")
    4185                      .dwattr $C$DW$638, DW_AT_TI_symbol_name("_pid_spd")
    4186                      .dwattr $C$DW$638, DW_AT_data_member_location[DW_OP_plus_uconst 0x46]
    4187                      .dwattr $C$DW$638, DW_AT_accessibility(DW_ACCESS_public)
    4188              $C$DW$639       .dwtag  DW_TAG_member
    4189                      .dwattr $C$DW$639, DW_AT_type(*$C$DW$T$57)
    4190                      .dwattr $C$DW$639, DW_AT_name("iparkHandle")
    4191                      .dwattr $C$DW$639, DW_AT_TI_symbol_name("_iparkHandle")
    4192                      .dwattr $C$DW$639, DW_AT_data_member_location[DW_OP_plus_uconst 0x56]
    4193                      .dwattr $C$DW$639, DW_AT_accessibility(DW_ACCESS_public)
    4194              $C$DW$640       .dwtag  DW_TAG_member
    4195                      .dwattr $C$DW$640, DW_AT_type(*$C$DW$T$58)
    4196                      .dwattr $C$DW$640, DW_AT_name("ipark")
    4197                      .dwattr $C$DW$640, DW_AT_TI_symbol_name("_ipark")
    4198                      .dwattr $C$DW$640, DW_AT_data_member_location[DW_OP_plus_uconst 0x58]
    4199                      .dwattr $C$DW$640, DW_AT_accessibility(DW_ACCESS_public)
    4200              $C$DW$641       .dwtag  DW_TAG_member
    4201                      .dwattr $C$DW$641, DW_AT_type(*$C$DW$T$60)
    4202                      .dwattr $C$DW$641, DW_AT_name("svgenHandle")
    4203                      .dwattr $C$DW$641, DW_AT_TI_symbol_name("_svgenHandle")
    4204                      .dwattr $C$DW$641, DW_AT_data_member_location[DW_OP_plus_uconst 0x5c]
    4205                      .dwattr $C$DW$641, DW_AT_accessibility(DW_ACCESS_public)
    4206              $C$DW$642       .dwtag  DW_TAG_member
    4207                      .dwattr $C$DW$642, DW_AT_type(*$C$DW$T$61)
    4208                      .dwattr $C$DW$642, DW_AT_name("svgen")
    4209                      .dwattr $C$DW$642, DW_AT_TI_symbol_name("_svgen")
    4210                      .dwattr $C$DW$642, DW_AT_data_member_location[DW_OP_plus_uconst 0x5e]
    4211                      .dwattr $C$DW$642, DW_AT_accessibility(DW_ACCESS_public)
    4212              $C$DW$643       .dwtag  DW_TAG_member
    4213                      .dwattr $C$DW$643, DW_AT_type(*$C$DW$T$63)
    4214                      .dwattr $C$DW$643, DW_AT_name("trajHandle_Id")
    4215                      .dwattr $C$DW$643, DW_AT_TI_symbol_name("_trajHandle_Id")
    4216                      .dwattr $C$DW$643, DW_AT_data_member_location[DW_OP_plus_uconst 0x60]
    4217                      .dwattr $C$DW$643, DW_AT_accessibility(DW_ACCESS_public)
    4218              $C$DW$644       .dwtag  DW_TAG_member
TMS320C2000 Assembler PC v6.2.5 Mon Sep 11 16:23:19 2017

Tools Copyright (c) 1996-2014 Texas Instruments Incorporated
C:\Users\wmj\AppData\Local\Temp\1011613                              PAGE   83

    4219                      .dwattr $C$DW$644, DW_AT_type(*$C$DW$T$64)
    4220                      .dwattr $C$DW$644, DW_AT_name("traj_Id")
    4221                      .dwattr $C$DW$644, DW_AT_TI_symbol_name("_traj_Id")
    4222                      .dwattr $C$DW$644, DW_AT_data_member_location[DW_OP_plus_uconst 0x62]
    4223                      .dwattr $C$DW$644, DW_AT_accessibility(DW_ACCESS_public)
    4224              $C$DW$645       .dwtag  DW_TAG_member
    4225                      .dwattr $C$DW$645, DW_AT_type(*$C$DW$T$63)
    4226                      .dwattr $C$DW$645, DW_AT_name("trajHandle_spd")
    4227                      .dwattr $C$DW$645, DW_AT_TI_symbol_name("_trajHandle_spd")
    4228                      .dwattr $C$DW$645, DW_AT_data_member_location[DW_OP_plus_uconst 0x6c]
    4229                      .dwattr $C$DW$645, DW_AT_accessibility(DW_ACCESS_public)
    4230              $C$DW$646       .dwtag  DW_TAG_member
    4231                      .dwattr $C$DW$646, DW_AT_type(*$C$DW$T$64)
    4232                      .dwattr $C$DW$646, DW_AT_name("traj_spd")
    4233                      .dwattr $C$DW$646, DW_AT_TI_symbol_name("_traj_spd")
    4234                      .dwattr $C$DW$646, DW_AT_data_member_location[DW_OP_plus_uconst 0x6e]
    4235                      .dwattr $C$DW$646, DW_AT_accessibility(DW_ACCESS_public)
    4236              $C$DW$647       .dwtag  DW_TAG_member
    4237                      .dwattr $C$DW$647, DW_AT_type(*$C$DW$T$63)
    4238                      .dwattr $C$DW$647, DW_AT_name("trajHandle_spdMax")
    4239                      .dwattr $C$DW$647, DW_AT_TI_symbol_name("_trajHandle_spdMax")
    4240                      .dwattr $C$DW$647, DW_AT_data_member_location[DW_OP_plus_uconst 0x78]
    4241                      .dwattr $C$DW$647, DW_AT_accessibility(DW_ACCESS_public)
    4242              $C$DW$648       .dwtag  DW_TAG_member
    4243                      .dwattr $C$DW$648, DW_AT_type(*$C$DW$T$64)
    4244                      .dwattr $C$DW$648, DW_AT_name("traj_spdMax")
    4245                      .dwattr $C$DW$648, DW_AT_TI_symbol_name("_traj_spdMax")
    4246                      .dwattr $C$DW$648, DW_AT_data_member_location[DW_OP_plus_uconst 0x7a]
    4247                      .dwattr $C$DW$648, DW_AT_accessibility(DW_ACCESS_public)
    4248              $C$DW$649       .dwtag  DW_TAG_member
    4249                      .dwattr $C$DW$649, DW_AT_type(*$C$DW$T$65)
    4250                      .dwattr $C$DW$649, DW_AT_name("motorParams")
    4251                      .dwattr $C$DW$649, DW_AT_TI_symbol_name("_motorParams")
    4252                      .dwattr $C$DW$649, DW_AT_data_member_location[DW_OP_plus_uconst 0x84]
    4253                      .dwattr $C$DW$649, DW_AT_accessibility(DW_ACCESS_public)
    4254              $C$DW$650       .dwtag  DW_TAG_member
    4255                      .dwattr $C$DW$650, DW_AT_type(*$C$DW$T$68)
    4256                      .dwattr $C$DW$650, DW_AT_name("waitTimes")
    4257                      .dwattr $C$DW$650, DW_AT_TI_symbol_name("_waitTimes")
    4258                      .dwattr $C$DW$650, DW_AT_data_member_location[DW_OP_plus_uconst 0x92]
    4259                      .dwattr $C$DW$650, DW_AT_accessibility(DW_ACCESS_public)
    4260              $C$DW$651       .dwtag  DW_TAG_member
    4261                      .dwattr $C$DW$651, DW_AT_type(*$C$DW$T$67)
    4262                      .dwattr $C$DW$651, DW_AT_name("counter_state")
    4263                      .dwattr $C$DW$651, DW_AT_TI_symbol_name("_counter_state")
    4264                      .dwattr $C$DW$651, DW_AT_data_member_location[DW_OP_plus_uconst 0x9a]
    4265                      .dwattr $C$DW$651, DW_AT_accessibility(DW_ACCESS_public)
    4266              $C$DW$652       .dwtag  DW_TAG_member
    4267                      .dwattr $C$DW$652, DW_AT_type(*$C$DW$T$69)
    4268                      .dwattr $C$DW$652, DW_AT_name("numIsrTicksPerCtrlTick")
    4269                      .dwattr $C$DW$652, DW_AT_TI_symbol_name("_numIsrTicksPerCtrlTick")
    4270                      .dwattr $C$DW$652, DW_AT_data_member_location[DW_OP_plus_uconst 0x9c]
    4271                      .dwattr $C$DW$652, DW_AT_accessibility(DW_ACCESS_public)
    4272              $C$DW$653       .dwtag  DW_TAG_member
    4273                      .dwattr $C$DW$653, DW_AT_type(*$C$DW$T$69)
TMS320C2000 Assembler PC v6.2.5 Mon Sep 11 16:23:19 2017

Tools Copyright (c) 1996-2014 Texas Instruments Incorporated
C:\Users\wmj\AppData\Local\Temp\1011613                              PAGE   84

    4274                      .dwattr $C$DW$653, DW_AT_name("numCtrlTicksPerCurrentTick")
    4275                      .dwattr $C$DW$653, DW_AT_TI_symbol_name("_numCtrlTicksPerCurrentTick")
    4276                      .dwattr $C$DW$653, DW_AT_data_member_location[DW_OP_plus_uconst 0x9d]
    4277                      .dwattr $C$DW$653, DW_AT_accessibility(DW_ACCESS_public)
    4278              $C$DW$654       .dwtag  DW_TAG_member
    4279                      .dwattr $C$DW$654, DW_AT_type(*$C$DW$T$69)
    4280                      .dwattr $C$DW$654, DW_AT_name("numCtrlTicksPerSpeedTick")
    4281                      .dwattr $C$DW$654, DW_AT_TI_symbol_name("_numCtrlTicksPerSpeedTick")
    4282                      .dwattr $C$DW$654, DW_AT_data_member_location[DW_OP_plus_uconst 0x9e]
    4283                      .dwattr $C$DW$654, DW_AT_accessibility(DW_ACCESS_public)
    4284              $C$DW$655       .dwtag  DW_TAG_member
    4285                      .dwattr $C$DW$655, DW_AT_type(*$C$DW$T$69)
    4286                      .dwattr $C$DW$655, DW_AT_name("numCtrlTicksPerTrajTick")
    4287                      .dwattr $C$DW$655, DW_AT_TI_symbol_name("_numCtrlTicksPerTrajTick")
    4288                      .dwattr $C$DW$655, DW_AT_data_member_location[DW_OP_plus_uconst 0x9f]
    4289                      .dwattr $C$DW$655, DW_AT_accessibility(DW_ACCESS_public)
    4290              $C$DW$656       .dwtag  DW_TAG_member
    4291                      .dwattr $C$DW$656, DW_AT_type(*$C$DW$T$67)
    4292                      .dwattr $C$DW$656, DW_AT_name("ctrlFreq_Hz")
    4293                      .dwattr $C$DW$656, DW_AT_TI_symbol_name("_ctrlFreq_Hz")
    4294                      .dwattr $C$DW$656, DW_AT_data_member_location[DW_OP_plus_uconst 0xa0]
    4295                      .dwattr $C$DW$656, DW_AT_accessibility(DW_ACCESS_public)
    4296              $C$DW$657       .dwtag  DW_TAG_member
    4297                      .dwattr $C$DW$657, DW_AT_type(*$C$DW$T$67)
    4298                      .dwattr $C$DW$657, DW_AT_name("trajFreq_Hz")
    4299                      .dwattr $C$DW$657, DW_AT_TI_symbol_name("_trajFreq_Hz")
    4300                      .dwattr $C$DW$657, DW_AT_data_member_location[DW_OP_plus_uconst 0xa2]
    4301                      .dwattr $C$DW$657, DW_AT_accessibility(DW_ACCESS_public)
    4302              $C$DW$658       .dwtag  DW_TAG_member
    4303                      .dwattr $C$DW$658, DW_AT_type(*$C$DW$T$33)
    4304                      .dwattr $C$DW$658, DW_AT_name("trajPeriod_sec")
    4305                      .dwattr $C$DW$658, DW_AT_TI_symbol_name("_trajPeriod_sec")
    4306                      .dwattr $C$DW$658, DW_AT_data_member_location[DW_OP_plus_uconst 0xa4]
    4307                      .dwattr $C$DW$658, DW_AT_accessibility(DW_ACCESS_public)
    4308              $C$DW$659       .dwtag  DW_TAG_member
    4309                      .dwattr $C$DW$659, DW_AT_type(*$C$DW$T$70)
    4310                      .dwattr $C$DW$659, DW_AT_name("ctrlPeriod_sec")
    4311                      .dwattr $C$DW$659, DW_AT_TI_symbol_name("_ctrlPeriod_sec")
    4312                      .dwattr $C$DW$659, DW_AT_data_member_location[DW_OP_plus_uconst 0xa6]
    4313                      .dwattr $C$DW$659, DW_AT_accessibility(DW_ACCESS_public)
    4314              $C$DW$660       .dwtag  DW_TAG_member
    4315                      .dwattr $C$DW$660, DW_AT_type(*$C$DW$T$33)
    4316                      .dwattr $C$DW$660, DW_AT_name("maxVsMag_pu")
    4317                      .dwattr $C$DW$660, DW_AT_TI_symbol_name("_maxVsMag_pu")
    4318                      .dwattr $C$DW$660, DW_AT_data_member_location[DW_OP_plus_uconst 0xa8]
    4319                      .dwattr $C$DW$660, DW_AT_accessibility(DW_ACCESS_public)
    4320              $C$DW$661       .dwtag  DW_TAG_member
    4321                      .dwattr $C$DW$661, DW_AT_type(*$C$DW$T$71)
    4322                      .dwattr $C$DW$661, DW_AT_name("Iab_in")
    4323                      .dwattr $C$DW$661, DW_AT_TI_symbol_name("_Iab_in")
    4324                      .dwattr $C$DW$661, DW_AT_data_member_location[DW_OP_plus_uconst 0xaa]
    4325                      .dwattr $C$DW$661, DW_AT_accessibility(DW_ACCESS_public)
    4326              $C$DW$662       .dwtag  DW_TAG_member
    4327                      .dwattr $C$DW$662, DW_AT_type(*$C$DW$T$71)
    4328                      .dwattr $C$DW$662, DW_AT_name("Iab_filt")
TMS320C2000 Assembler PC v6.2.5 Mon Sep 11 16:23:19 2017

Tools Copyright (c) 1996-2014 Texas Instruments Incorporated
C:\Users\wmj\AppData\Local\Temp\1011613                              PAGE   85

    4329                      .dwattr $C$DW$662, DW_AT_TI_symbol_name("_Iab_filt")
    4330                      .dwattr $C$DW$662, DW_AT_data_member_location[DW_OP_plus_uconst 0xae]
    4331                      .dwattr $C$DW$662, DW_AT_accessibility(DW_ACCESS_public)
    4332              $C$DW$663       .dwtag  DW_TAG_member
    4333                      .dwattr $C$DW$663, DW_AT_type(*$C$DW$T$71)
    4334                      .dwattr $C$DW$663, DW_AT_name("Idq_in")
    4335                      .dwattr $C$DW$663, DW_AT_TI_symbol_name("_Idq_in")
    4336                      .dwattr $C$DW$663, DW_AT_data_member_location[DW_OP_plus_uconst 0xb2]
    4337                      .dwattr $C$DW$663, DW_AT_accessibility(DW_ACCESS_public)
    4338              $C$DW$664       .dwtag  DW_TAG_member
    4339                      .dwattr $C$DW$664, DW_AT_type(*$C$DW$T$71)
    4340                      .dwattr $C$DW$664, DW_AT_name("Vab_in")
    4341                      .dwattr $C$DW$664, DW_AT_TI_symbol_name("_Vab_in")
    4342                      .dwattr $C$DW$664, DW_AT_data_member_location[DW_OP_plus_uconst 0xb6]
    4343                      .dwattr $C$DW$664, DW_AT_accessibility(DW_ACCESS_public)
    4344              $C$DW$665       .dwtag  DW_TAG_member
    4345                      .dwattr $C$DW$665, DW_AT_type(*$C$DW$T$33)
    4346                      .dwattr $C$DW$665, DW_AT_name("spd_out")
    4347                      .dwattr $C$DW$665, DW_AT_TI_symbol_name("_spd_out")
    4348                      .dwattr $C$DW$665, DW_AT_data_member_location[DW_OP_plus_uconst 0xba]
    4349                      .dwattr $C$DW$665, DW_AT_accessibility(DW_ACCESS_public)
    4350              $C$DW$666       .dwtag  DW_TAG_member
    4351                      .dwattr $C$DW$666, DW_AT_type(*$C$DW$T$71)
    4352                      .dwattr $C$DW$666, DW_AT_name("Vab_out")
    4353                      .dwattr $C$DW$666, DW_AT_TI_symbol_name("_Vab_out")
    4354                      .dwattr $C$DW$666, DW_AT_data_member_location[DW_OP_plus_uconst 0xbc]
    4355                      .dwattr $C$DW$666, DW_AT_accessibility(DW_ACCESS_public)
    4356              $C$DW$667       .dwtag  DW_TAG_member
    4357                      .dwattr $C$DW$667, DW_AT_type(*$C$DW$T$71)
    4358                      .dwattr $C$DW$667, DW_AT_name("Vdq_out")
    4359                      .dwattr $C$DW$667, DW_AT_TI_symbol_name("_Vdq_out")
    4360                      .dwattr $C$DW$667, DW_AT_data_member_location[DW_OP_plus_uconst 0xc0]
    4361                      .dwattr $C$DW$667, DW_AT_accessibility(DW_ACCESS_public)
    4362              $C$DW$668       .dwtag  DW_TAG_member
    4363                      .dwattr $C$DW$668, DW_AT_type(*$C$DW$T$70)
    4364                      .dwattr $C$DW$668, DW_AT_name("Rhf")
    4365                      .dwattr $C$DW$668, DW_AT_TI_symbol_name("_Rhf")
    4366                      .dwattr $C$DW$668, DW_AT_data_member_location[DW_OP_plus_uconst 0xc4]
    4367                      .dwattr $C$DW$668, DW_AT_accessibility(DW_ACCESS_public)
    4368              $C$DW$669       .dwtag  DW_TAG_member
    4369                      .dwattr $C$DW$669, DW_AT_type(*$C$DW$T$70)
    4370                      .dwattr $C$DW$669, DW_AT_name("Lhf")
    4371                      .dwattr $C$DW$669, DW_AT_TI_symbol_name("_Lhf")
    4372                      .dwattr $C$DW$669, DW_AT_data_member_location[DW_OP_plus_uconst 0xc6]
    4373                      .dwattr $C$DW$669, DW_AT_accessibility(DW_ACCESS_public)
    4374              $C$DW$670       .dwtag  DW_TAG_member
    4375                      .dwattr $C$DW$670, DW_AT_type(*$C$DW$T$70)
    4376                      .dwattr $C$DW$670, DW_AT_name("RoverL")
    4377                      .dwattr $C$DW$670, DW_AT_TI_symbol_name("_RoverL")
    4378                      .dwattr $C$DW$670, DW_AT_data_member_location[DW_OP_plus_uconst 0xc8]
    4379                      .dwattr $C$DW$670, DW_AT_accessibility(DW_ACCESS_public)
    4380              $C$DW$671       .dwtag  DW_TAG_member
    4381                      .dwattr $C$DW$671, DW_AT_type(*$C$DW$T$33)
    4382                      .dwattr $C$DW$671, DW_AT_name("Kp_Id")
    4383                      .dwattr $C$DW$671, DW_AT_TI_symbol_name("_Kp_Id")
TMS320C2000 Assembler PC v6.2.5 Mon Sep 11 16:23:19 2017

Tools Copyright (c) 1996-2014 Texas Instruments Incorporated
C:\Users\wmj\AppData\Local\Temp\1011613                              PAGE   86

    4384                      .dwattr $C$DW$671, DW_AT_data_member_location[DW_OP_plus_uconst 0xca]
    4385                      .dwattr $C$DW$671, DW_AT_accessibility(DW_ACCESS_public)
    4386              $C$DW$672       .dwtag  DW_TAG_member
    4387                      .dwattr $C$DW$672, DW_AT_type(*$C$DW$T$33)
    4388                      .dwattr $C$DW$672, DW_AT_name("Kp_Iq")
    4389                      .dwattr $C$DW$672, DW_AT_TI_symbol_name("_Kp_Iq")
    4390                      .dwattr $C$DW$672, DW_AT_data_member_location[DW_OP_plus_uconst 0xcc]
    4391                      .dwattr $C$DW$672, DW_AT_accessibility(DW_ACCESS_public)
    4392              $C$DW$673       .dwtag  DW_TAG_member
    4393                      .dwattr $C$DW$673, DW_AT_type(*$C$DW$T$33)
    4394                      .dwattr $C$DW$673, DW_AT_name("Kp_spd")
    4395                      .dwattr $C$DW$673, DW_AT_TI_symbol_name("_Kp_spd")
    4396                      .dwattr $C$DW$673, DW_AT_data_member_location[DW_OP_plus_uconst 0xce]
    4397                      .dwattr $C$DW$673, DW_AT_accessibility(DW_ACCESS_public)
    4398              $C$DW$674       .dwtag  DW_TAG_member
    4399                      .dwattr $C$DW$674, DW_AT_type(*$C$DW$T$33)
    4400                      .dwattr $C$DW$674, DW_AT_name("Ki_Id")
    4401                      .dwattr $C$DW$674, DW_AT_TI_symbol_name("_Ki_Id")
    4402                      .dwattr $C$DW$674, DW_AT_data_member_location[DW_OP_plus_uconst 0xd0]
    4403                      .dwattr $C$DW$674, DW_AT_accessibility(DW_ACCESS_public)
    4404              $C$DW$675       .dwtag  DW_TAG_member
    4405                      .dwattr $C$DW$675, DW_AT_type(*$C$DW$T$33)
    4406                      .dwattr $C$DW$675, DW_AT_name("Ki_Iq")
    4407                      .dwattr $C$DW$675, DW_AT_TI_symbol_name("_Ki_Iq")
    4408                      .dwattr $C$DW$675, DW_AT_data_member_location[DW_OP_plus_uconst 0xd2]
    4409                      .dwattr $C$DW$675, DW_AT_accessibility(DW_ACCESS_public)
    4410              $C$DW$676       .dwtag  DW_TAG_member
    4411                      .dwattr $C$DW$676, DW_AT_type(*$C$DW$T$33)
    4412                      .dwattr $C$DW$676, DW_AT_name("Ki_spd")
    4413                      .dwattr $C$DW$676, DW_AT_TI_symbol_name("_Ki_spd")
    4414                      .dwattr $C$DW$676, DW_AT_data_member_location[DW_OP_plus_uconst 0xd4]
    4415                      .dwattr $C$DW$676, DW_AT_accessibility(DW_ACCESS_public)
    4416              $C$DW$677       .dwtag  DW_TAG_member
    4417                      .dwattr $C$DW$677, DW_AT_type(*$C$DW$T$33)
    4418                      .dwattr $C$DW$677, DW_AT_name("Kd_Id")
    4419                      .dwattr $C$DW$677, DW_AT_TI_symbol_name("_Kd_Id")
    4420                      .dwattr $C$DW$677, DW_AT_data_member_location[DW_OP_plus_uconst 0xd6]
    4421                      .dwattr $C$DW$677, DW_AT_accessibility(DW_ACCESS_public)
    4422              $C$DW$678       .dwtag  DW_TAG_member
    4423                      .dwattr $C$DW$678, DW_AT_type(*$C$DW$T$33)
    4424                      .dwattr $C$DW$678, DW_AT_name("Kd_Iq")
    4425                      .dwattr $C$DW$678, DW_AT_TI_symbol_name("_Kd_Iq")
    4426                      .dwattr $C$DW$678, DW_AT_data_member_location[DW_OP_plus_uconst 0xd8]
    4427                      .dwattr $C$DW$678, DW_AT_accessibility(DW_ACCESS_public)
    4428              $C$DW$679       .dwtag  DW_TAG_member
    4429                      .dwattr $C$DW$679, DW_AT_type(*$C$DW$T$33)
    4430                      .dwattr $C$DW$679, DW_AT_name("Kd_spd")
    4431                      .dwattr $C$DW$679, DW_AT_TI_symbol_name("_Kd_spd")
    4432                      .dwattr $C$DW$679, DW_AT_data_member_location[DW_OP_plus_uconst 0xda]
    4433                      .dwattr $C$DW$679, DW_AT_accessibility(DW_ACCESS_public)
    4434              $C$DW$680       .dwtag  DW_TAG_member
    4435                      .dwattr $C$DW$680, DW_AT_type(*$C$DW$T$33)
    4436                      .dwattr $C$DW$680, DW_AT_name("Ui_Id")
    4437                      .dwattr $C$DW$680, DW_AT_TI_symbol_name("_Ui_Id")
    4438                      .dwattr $C$DW$680, DW_AT_data_member_location[DW_OP_plus_uconst 0xdc]
TMS320C2000 Assembler PC v6.2.5 Mon Sep 11 16:23:19 2017

Tools Copyright (c) 1996-2014 Texas Instruments Incorporated
C:\Users\wmj\AppData\Local\Temp\1011613                              PAGE   87

    4439                      .dwattr $C$DW$680, DW_AT_accessibility(DW_ACCESS_public)
    4440              $C$DW$681       .dwtag  DW_TAG_member
    4441                      .dwattr $C$DW$681, DW_AT_type(*$C$DW$T$33)
    4442                      .dwattr $C$DW$681, DW_AT_name("Ui_Iq")
    4443                      .dwattr $C$DW$681, DW_AT_TI_symbol_name("_Ui_Iq")
    4444                      .dwattr $C$DW$681, DW_AT_data_member_location[DW_OP_plus_uconst 0xde]
    4445                      .dwattr $C$DW$681, DW_AT_accessibility(DW_ACCESS_public)
    4446              $C$DW$682       .dwtag  DW_TAG_member
    4447                      .dwattr $C$DW$682, DW_AT_type(*$C$DW$T$33)
    4448                      .dwattr $C$DW$682, DW_AT_name("Ui_spd")
    4449                      .dwattr $C$DW$682, DW_AT_TI_symbol_name("_Ui_spd")
    4450                      .dwattr $C$DW$682, DW_AT_data_member_location[DW_OP_plus_uconst 0xe0]
    4451                      .dwattr $C$DW$682, DW_AT_accessibility(DW_ACCESS_public)
    4452              $C$DW$683       .dwtag  DW_TAG_member
    4453                      .dwattr $C$DW$683, DW_AT_type(*$C$DW$T$71)
    4454                      .dwattr $C$DW$683, DW_AT_name("Idq_ref")
    4455                      .dwattr $C$DW$683, DW_AT_TI_symbol_name("_Idq_ref")
    4456                      .dwattr $C$DW$683, DW_AT_data_member_location[DW_OP_plus_uconst 0xe2]
    4457                      .dwattr $C$DW$683, DW_AT_accessibility(DW_ACCESS_public)
    4458              $C$DW$684       .dwtag  DW_TAG_member
    4459                      .dwattr $C$DW$684, DW_AT_type(*$C$DW$T$33)
    4460                      .dwattr $C$DW$684, DW_AT_name("IdRated")
    4461                      .dwattr $C$DW$684, DW_AT_TI_symbol_name("_IdRated")
    4462                      .dwattr $C$DW$684, DW_AT_data_member_location[DW_OP_plus_uconst 0xe6]
    4463                      .dwattr $C$DW$684, DW_AT_accessibility(DW_ACCESS_public)
    4464              $C$DW$685       .dwtag  DW_TAG_member
    4465                      .dwattr $C$DW$685, DW_AT_type(*$C$DW$T$33)
    4466                      .dwattr $C$DW$685, DW_AT_name("spd_ref")
    4467                      .dwattr $C$DW$685, DW_AT_TI_symbol_name("_spd_ref")
    4468                      .dwattr $C$DW$685, DW_AT_data_member_location[DW_OP_plus_uconst 0xe8]
    4469                      .dwattr $C$DW$685, DW_AT_accessibility(DW_ACCESS_public)
    4470              $C$DW$686       .dwtag  DW_TAG_member
    4471                      .dwattr $C$DW$686, DW_AT_type(*$C$DW$T$33)
    4472                      .dwattr $C$DW$686, DW_AT_name("spd_max")
    4473                      .dwattr $C$DW$686, DW_AT_TI_symbol_name("_spd_max")
    4474                      .dwattr $C$DW$686, DW_AT_data_member_location[DW_OP_plus_uconst 0xea]
    4475                      .dwattr $C$DW$686, DW_AT_accessibility(DW_ACCESS_public)
    4476              $C$DW$687       .dwtag  DW_TAG_member
    4477                      .dwattr $C$DW$687, DW_AT_type(*$C$DW$T$69)
    4478                      .dwattr $C$DW$687, DW_AT_name("counter_current")
    4479                      .dwattr $C$DW$687, DW_AT_TI_symbol_name("_counter_current")
    4480                      .dwattr $C$DW$687, DW_AT_data_member_location[DW_OP_plus_uconst 0xec]
    4481                      .dwattr $C$DW$687, DW_AT_accessibility(DW_ACCESS_public)
    4482              $C$DW$688       .dwtag  DW_TAG_member
    4483                      .dwattr $C$DW$688, DW_AT_type(*$C$DW$T$69)
    4484                      .dwattr $C$DW$688, DW_AT_name("counter_isr")
    4485                      .dwattr $C$DW$688, DW_AT_TI_symbol_name("_counter_isr")
    4486                      .dwattr $C$DW$688, DW_AT_data_member_location[DW_OP_plus_uconst 0xed]
    4487                      .dwattr $C$DW$688, DW_AT_accessibility(DW_ACCESS_public)
    4488              $C$DW$689       .dwtag  DW_TAG_member
    4489                      .dwattr $C$DW$689, DW_AT_type(*$C$DW$T$69)
    4490                      .dwattr $C$DW$689, DW_AT_name("counter_speed")
    4491                      .dwattr $C$DW$689, DW_AT_TI_symbol_name("_counter_speed")
    4492                      .dwattr $C$DW$689, DW_AT_data_member_location[DW_OP_plus_uconst 0xee]
    4493                      .dwattr $C$DW$689, DW_AT_accessibility(DW_ACCESS_public)
TMS320C2000 Assembler PC v6.2.5 Mon Sep 11 16:23:19 2017

Tools Copyright (c) 1996-2014 Texas Instruments Incorporated
C:\Users\wmj\AppData\Local\Temp\1011613                              PAGE   88

    4494              $C$DW$690       .dwtag  DW_TAG_member
    4495                      .dwattr $C$DW$690, DW_AT_type(*$C$DW$T$69)
    4496                      .dwattr $C$DW$690, DW_AT_name("counter_traj")
    4497                      .dwattr $C$DW$690, DW_AT_TI_symbol_name("_counter_traj")
    4498                      .dwattr $C$DW$690, DW_AT_data_member_location[DW_OP_plus_uconst 0xef]
    4499                      .dwattr $C$DW$690, DW_AT_accessibility(DW_ACCESS_public)
    4500              $C$DW$691       .dwtag  DW_TAG_member
    4501                      .dwattr $C$DW$691, DW_AT_type(*$C$DW$T$72)
    4502                      .dwattr $C$DW$691, DW_AT_name("flag_enableCtrl")
    4503                      .dwattr $C$DW$691, DW_AT_TI_symbol_name("_flag_enableCtrl")
    4504                      .dwattr $C$DW$691, DW_AT_data_member_location[DW_OP_plus_uconst 0xf0]
    4505                      .dwattr $C$DW$691, DW_AT_accessibility(DW_ACCESS_public)
    4506              $C$DW$692       .dwtag  DW_TAG_member
    4507                      .dwattr $C$DW$692, DW_AT_type(*$C$DW$T$72)
    4508                      .dwattr $C$DW$692, DW_AT_name("flag_enableDcBusComp")
    4509                      .dwattr $C$DW$692, DW_AT_TI_symbol_name("_flag_enableDcBusComp")
    4510                      .dwattr $C$DW$692, DW_AT_data_member_location[DW_OP_plus_uconst 0xf1]
    4511                      .dwattr $C$DW$692, DW_AT_accessibility(DW_ACCESS_public)
    4512              $C$DW$693       .dwtag  DW_TAG_member
    4513                      .dwattr $C$DW$693, DW_AT_type(*$C$DW$T$72)
    4514                      .dwattr $C$DW$693, DW_AT_name("flag_enablePowerWarp")
    4515                      .dwattr $C$DW$693, DW_AT_TI_symbol_name("_flag_enablePowerWarp")
    4516                      .dwattr $C$DW$693, DW_AT_data_member_location[DW_OP_plus_uconst 0xf2]
    4517                      .dwattr $C$DW$693, DW_AT_accessibility(DW_ACCESS_public)
    4518              $C$DW$694       .dwtag  DW_TAG_member
    4519                      .dwattr $C$DW$694, DW_AT_type(*$C$DW$T$72)
    4520                      .dwattr $C$DW$694, DW_AT_name("flag_enableOffset")
    4521                      .dwattr $C$DW$694, DW_AT_TI_symbol_name("_flag_enableOffset")
    4522                      .dwattr $C$DW$694, DW_AT_data_member_location[DW_OP_plus_uconst 0xf3]
    4523                      .dwattr $C$DW$694, DW_AT_accessibility(DW_ACCESS_public)
    4524              $C$DW$695       .dwtag  DW_TAG_member
    4525                      .dwattr $C$DW$695, DW_AT_type(*$C$DW$T$72)
    4526                      .dwattr $C$DW$695, DW_AT_name("flag_enableSpeedCtrl")
    4527                      .dwattr $C$DW$695, DW_AT_TI_symbol_name("_flag_enableSpeedCtrl")
    4528                      .dwattr $C$DW$695, DW_AT_data_member_location[DW_OP_plus_uconst 0xf4]
    4529                      .dwattr $C$DW$695, DW_AT_accessibility(DW_ACCESS_public)
    4530              $C$DW$696       .dwtag  DW_TAG_member
    4531                      .dwattr $C$DW$696, DW_AT_type(*$C$DW$T$72)
    4532                      .dwattr $C$DW$696, DW_AT_name("flag_enableUserMotorParams")
    4533                      .dwattr $C$DW$696, DW_AT_TI_symbol_name("_flag_enableUserMotorParams")
    4534                      .dwattr $C$DW$696, DW_AT_data_member_location[DW_OP_plus_uconst 0xf5]
    4535                      .dwattr $C$DW$696, DW_AT_accessibility(DW_ACCESS_public)
    4536              $C$DW$697       .dwtag  DW_TAG_member
    4537                      .dwattr $C$DW$697, DW_AT_type(*$C$DW$T$71)
    4538                      .dwattr $C$DW$697, DW_AT_name("Idq_offset_pu")
    4539                      .dwattr $C$DW$697, DW_AT_TI_symbol_name("_Idq_offset_pu")
    4540                      .dwattr $C$DW$697, DW_AT_data_member_location[DW_OP_plus_uconst 0xf6]
    4541                      .dwattr $C$DW$697, DW_AT_accessibility(DW_ACCESS_public)
    4542              $C$DW$698       .dwtag  DW_TAG_member
    4543                      .dwattr $C$DW$698, DW_AT_type(*$C$DW$T$71)
    4544                      .dwattr $C$DW$698, DW_AT_name("Vdq_offset_pu")
    4545                      .dwattr $C$DW$698, DW_AT_TI_symbol_name("_Vdq_offset_pu")
    4546                      .dwattr $C$DW$698, DW_AT_data_member_location[DW_OP_plus_uconst 0xfa]
    4547                      .dwattr $C$DW$698, DW_AT_accessibility(DW_ACCESS_public)
    4548              $C$DW$699       .dwtag  DW_TAG_member
TMS320C2000 Assembler PC v6.2.5 Mon Sep 11 16:23:19 2017

Tools Copyright (c) 1996-2014 Texas Instruments Incorporated
C:\Users\wmj\AppData\Local\Temp\1011613                              PAGE   89

    4549                      .dwattr $C$DW$699, DW_AT_type(*$C$DW$T$33)
    4550                      .dwattr $C$DW$699, DW_AT_name("angle_pu")
    4551                      .dwattr $C$DW$699, DW_AT_TI_symbol_name("_angle_pu")
    4552                      .dwattr $C$DW$699, DW_AT_data_member_location[DW_OP_plus_uconst 0xfe]
    4553                      .dwattr $C$DW$699, DW_AT_accessibility(DW_ACCESS_public)
    4554              $C$DW$700       .dwtag  DW_TAG_member
    4555                      .dwattr $C$DW$700, DW_AT_type(*$C$DW$T$33)
    4556                      .dwattr $C$DW$700, DW_AT_name("speed_ref_pu")
    4557                      .dwattr $C$DW$700, DW_AT_TI_symbol_name("_speed_ref_pu")
    4558                      .dwattr $C$DW$700, DW_AT_data_member_location[DW_OP_plus_uconst 0x100]
    4559                      .dwattr $C$DW$700, DW_AT_accessibility(DW_ACCESS_public)
    4560              $C$DW$701       .dwtag  DW_TAG_member
    4561                      .dwattr $C$DW$701, DW_AT_type(*$C$DW$T$33)
    4562                      .dwattr $C$DW$701, DW_AT_name("speed_fb_pu")
    4563                      .dwattr $C$DW$701, DW_AT_TI_symbol_name("_speed_fb_pu")
    4564                      .dwattr $C$DW$701, DW_AT_data_member_location[DW_OP_plus_uconst 0x102]
    4565                      .dwattr $C$DW$701, DW_AT_accessibility(DW_ACCESS_public)
    4566              $C$DW$702       .dwtag  DW_TAG_member
    4567                      .dwattr $C$DW$702, DW_AT_type(*$C$DW$T$33)
    4568                      .dwattr $C$DW$702, DW_AT_name("speed_outMax_pu")
    4569                      .dwattr $C$DW$702, DW_AT_TI_symbol_name("_speed_outMax_pu")
    4570                      .dwattr $C$DW$702, DW_AT_data_member_location[DW_OP_plus_uconst 0x104]
    4571                      .dwattr $C$DW$702, DW_AT_accessibility(DW_ACCESS_public)
    4572              $C$DW$703       .dwtag  DW_TAG_member
    4573                      .dwattr $C$DW$703, DW_AT_type(*$C$DW$T$72)
    4574                      .dwattr $C$DW$703, DW_AT_name("flag_enableCurrentCtrl")
    4575                      .dwattr $C$DW$703, DW_AT_TI_symbol_name("_flag_enableCurrentCtrl")
    4576                      .dwattr $C$DW$703, DW_AT_data_member_location[DW_OP_plus_uconst 0x106]
    4577                      .dwattr $C$DW$703, DW_AT_accessibility(DW_ACCESS_public)
    4578                      .dwendtag $C$DW$T$73
    4579              
    4580              $C$DW$T$287     .dwtag  DW_TAG_typedef, DW_AT_name("CTRL_Obj")
    4581                      .dwattr $C$DW$T$287, DW_AT_type(*$C$DW$T$73)
    4582                      .dwattr $C$DW$T$287, DW_AT_language(DW_LANG_C)
    4583              $C$DW$T$288     .dwtag  DW_TAG_pointer_type
    4584                      .dwattr $C$DW$T$288, DW_AT_type(*$C$DW$T$287)
    4585                      .dwattr $C$DW$T$288, DW_AT_address_class(0x16)
    4586              $C$DW$T$255     .dwtag  DW_TAG_pointer_type
    4587                      .dwattr $C$DW$T$255, DW_AT_type(*$C$DW$T$73)
    4588                      .dwattr $C$DW$T$255, DW_AT_address_class(0x16)
    4589              $C$DW$T$256     .dwtag  DW_TAG_typedef, DW_AT_name("CTRL_Handle")
    4590                      .dwattr $C$DW$T$256, DW_AT_type(*$C$DW$T$255)
    4591                      .dwattr $C$DW$T$256, DW_AT_language(DW_LANG_C)
    4592              $C$DW$704       .dwtag  DW_TAG_TI_far_type
    4593                      .dwattr $C$DW$704, DW_AT_type(*$C$DW$T$256)
    4594              $C$DW$T$289     .dwtag  DW_TAG_const_type
    4595                      .dwattr $C$DW$T$289, DW_AT_type(*$C$DW$704)
    4596              
    4597              $C$DW$T$76      .dwtag  DW_TAG_structure_type
    4598                      .dwattr $C$DW$T$76, DW_AT_name("_CTRL_Version_")
    4599                      .dwattr $C$DW$T$76, DW_AT_byte_size(0x04)
    4600              $C$DW$705       .dwtag  DW_TAG_member
    4601                      .dwattr $C$DW$705, DW_AT_type(*$C$DW$T$24)
    4602                      .dwattr $C$DW$705, DW_AT_name("rsvd")
    4603                      .dwattr $C$DW$705, DW_AT_TI_symbol_name("_rsvd")
TMS320C2000 Assembler PC v6.2.5 Mon Sep 11 16:23:19 2017

Tools Copyright (c) 1996-2014 Texas Instruments Incorporated
C:\Users\wmj\AppData\Local\Temp\1011613                              PAGE   90

    4604                      .dwattr $C$DW$705, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    4605                      .dwattr $C$DW$705, DW_AT_accessibility(DW_ACCESS_public)
    4606              $C$DW$706       .dwtag  DW_TAG_member
    4607                      .dwattr $C$DW$706, DW_AT_type(*$C$DW$T$75)
    4608                      .dwattr $C$DW$706, DW_AT_name("targetProc")
    4609                      .dwattr $C$DW$706, DW_AT_TI_symbol_name("_targetProc")
    4610                      .dwattr $C$DW$706, DW_AT_data_member_location[DW_OP_plus_uconst 0x1]
    4611                      .dwattr $C$DW$706, DW_AT_accessibility(DW_ACCESS_public)
    4612              $C$DW$707       .dwtag  DW_TAG_member
    4613                      .dwattr $C$DW$707, DW_AT_type(*$C$DW$T$24)
    4614                      .dwattr $C$DW$707, DW_AT_name("major")
    4615                      .dwattr $C$DW$707, DW_AT_TI_symbol_name("_major")
    4616                      .dwattr $C$DW$707, DW_AT_data_member_location[DW_OP_plus_uconst 0x2]
    4617                      .dwattr $C$DW$707, DW_AT_accessibility(DW_ACCESS_public)
    4618              $C$DW$708       .dwtag  DW_TAG_member
    4619                      .dwattr $C$DW$708, DW_AT_type(*$C$DW$T$24)
    4620                      .dwattr $C$DW$708, DW_AT_name("minor")
    4621                      .dwattr $C$DW$708, DW_AT_TI_symbol_name("_minor")
    4622                      .dwattr $C$DW$708, DW_AT_data_member_location[DW_OP_plus_uconst 0x3]
    4623                      .dwattr $C$DW$708, DW_AT_accessibility(DW_ACCESS_public)
    4624                      .dwendtag $C$DW$T$76
    4625              
    4626              $C$DW$T$40      .dwtag  DW_TAG_typedef, DW_AT_name("CTRL_Version")
    4627                      .dwattr $C$DW$T$40, DW_AT_type(*$C$DW$T$76)
    4628                      .dwattr $C$DW$T$40, DW_AT_language(DW_LANG_C)
    4629              $C$DW$T$297     .dwtag  DW_TAG_pointer_type
    4630                      .dwattr $C$DW$T$297, DW_AT_type(*$C$DW$T$40)
    4631                      .dwattr $C$DW$T$297, DW_AT_address_class(0x16)
    4632              
    4633              $C$DW$T$83      .dwtag  DW_TAG_structure_type
    4634                      .dwattr $C$DW$T$83, DW_AT_name("_DECODER_Obj_")
    4635                      .dwattr $C$DW$T$83, DW_AT_byte_size(0x06)
    4636              $C$DW$709       .dwtag  DW_TAG_member
    4637                      .dwattr $C$DW$709, DW_AT_type(*$C$DW$T$78)
    4638                      .dwattr $C$DW$709, DW_AT_name("spiHandle")
    4639                      .dwattr $C$DW$709, DW_AT_TI_symbol_name("_spiHandle")
    4640                      .dwattr $C$DW$709, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    4641                      .dwattr $C$DW$709, DW_AT_accessibility(DW_ACCESS_public)
    4642              $C$DW$710       .dwtag  DW_TAG_member
    4643                      .dwattr $C$DW$710, DW_AT_type(*$C$DW$T$80)
    4644                      .dwattr $C$DW$710, DW_AT_name("gpioHandle")
    4645                      .dwattr $C$DW$710, DW_AT_TI_symbol_name("_gpioHandle")
    4646                      .dwattr $C$DW$710, DW_AT_data_member_location[DW_OP_plus_uconst 0x2]
    4647                      .dwattr $C$DW$710, DW_AT_accessibility(DW_ACCESS_public)
    4648              $C$DW$711       .dwtag  DW_TAG_member
    4649                      .dwattr $C$DW$711, DW_AT_type(*$C$DW$T$82)
    4650                      .dwattr $C$DW$711, DW_AT_name("gpioNumber")
    4651                      .dwattr $C$DW$711, DW_AT_TI_symbol_name("_gpioNumber")
    4652                      .dwattr $C$DW$711, DW_AT_data_member_location[DW_OP_plus_uconst 0x4]
    4653                      .dwattr $C$DW$711, DW_AT_accessibility(DW_ACCESS_public)
    4654              $C$DW$712       .dwtag  DW_TAG_member
    4655                      .dwattr $C$DW$712, DW_AT_type(*$C$DW$T$72)
    4656                      .dwattr $C$DW$712, DW_AT_name("RxTimeOut")
    4657                      .dwattr $C$DW$712, DW_AT_TI_symbol_name("_RxTimeOut")
    4658                      .dwattr $C$DW$712, DW_AT_data_member_location[DW_OP_plus_uconst 0x5]
TMS320C2000 Assembler PC v6.2.5 Mon Sep 11 16:23:19 2017

Tools Copyright (c) 1996-2014 Texas Instruments Incorporated
C:\Users\wmj\AppData\Local\Temp\1011613                              PAGE   91

    4659                      .dwattr $C$DW$712, DW_AT_accessibility(DW_ACCESS_public)
    4660                      .dwendtag $C$DW$T$83
    4661              
    4662              $C$DW$T$235     .dwtag  DW_TAG_typedef, DW_AT_name("DECODER_Obj")
    4663                      .dwattr $C$DW$T$235, DW_AT_type(*$C$DW$T$83)
    4664                      .dwattr $C$DW$T$235, DW_AT_language(DW_LANG_C)
    4665              $C$DW$T$233     .dwtag  DW_TAG_pointer_type
    4666                      .dwattr $C$DW$T$233, DW_AT_type(*$C$DW$T$83)
    4667                      .dwattr $C$DW$T$233, DW_AT_address_class(0x16)
    4668              $C$DW$T$234     .dwtag  DW_TAG_typedef, DW_AT_name("DECODER_Handle")
    4669                      .dwattr $C$DW$T$234, DW_AT_type(*$C$DW$T$233)
    4670                      .dwattr $C$DW$T$234, DW_AT_language(DW_LANG_C)
    4671              
    4672              $C$DW$T$84      .dwtag  DW_TAG_structure_type
    4673                      .dwattr $C$DW$T$84, DW_AT_name("_DRIVE_CURRENT_t_")
    4674                      .dwattr $C$DW$T$84, DW_AT_byte_size(0x02)
    4675              $C$DW$713       .dwtag  DW_TAG_member
    4676                      .dwattr $C$DW$713, DW_AT_type(*$C$DW$T$24)
    4677                      .dwattr $C$DW$713, DW_AT_name("IDRIVE")
    4678                      .dwattr $C$DW$713, DW_AT_TI_symbol_name("_IDRIVE")
    4679                      .dwattr $C$DW$713, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    4680                      .dwattr $C$DW$713, DW_AT_accessibility(DW_ACCESS_public)
    4681              $C$DW$714       .dwtag  DW_TAG_member
    4682                      .dwattr $C$DW$714, DW_AT_type(*$C$DW$T$24)
    4683                      .dwattr $C$DW$714, DW_AT_name("INIT_IDRIVE")
    4684                      .dwattr $C$DW$714, DW_AT_TI_symbol_name("_INIT_IDRIVE")
    4685                      .dwattr $C$DW$714, DW_AT_data_member_location[DW_OP_plus_uconst 0x1]
    4686                      .dwattr $C$DW$714, DW_AT_accessibility(DW_ACCESS_public)
    4687                      .dwendtag $C$DW$T$84
    4688              
    4689              $C$DW$T$151     .dwtag  DW_TAG_typedef, DW_AT_name("DRIVE_CURRENT_t_")
    4690                      .dwattr $C$DW$T$151, DW_AT_type(*$C$DW$T$84)
    4691                      .dwattr $C$DW$T$151, DW_AT_language(DW_LANG_C)
    4692              
    4693              $C$DW$T$21      .dwtag  DW_TAG_structure_type
    4694                      .dwattr $C$DW$T$21, DW_AT_name("_EST_Obj_")
    4695                      .dwattr $C$DW$T$21, DW_AT_declaration
    4696                      .dwendtag $C$DW$T$21
    4697              
    4698              $C$DW$T$48      .dwtag  DW_TAG_pointer_type
    4699                      .dwattr $C$DW$T$48, DW_AT_type(*$C$DW$T$21)
    4700                      .dwattr $C$DW$T$48, DW_AT_address_class(0x16)
    4701              $C$DW$T$49      .dwtag  DW_TAG_typedef, DW_AT_name("EST_Handle")
    4702                      .dwattr $C$DW$T$49, DW_AT_type(*$C$DW$T$48)
    4703                      .dwattr $C$DW$T$49, DW_AT_language(DW_LANG_C)
    4704              
    4705              $C$DW$T$85      .dwtag  DW_TAG_structure_type
    4706                      .dwattr $C$DW$T$85, DW_AT_name("_FILTER_FO_")
    4707                      .dwattr $C$DW$T$85, DW_AT_byte_size(0x0a)
    4708              $C$DW$715       .dwtag  DW_TAG_member
    4709                      .dwattr $C$DW$715, DW_AT_type(*$C$DW$T$33)
    4710                      .dwattr $C$DW$715, DW_AT_name("a1")
    4711                      .dwattr $C$DW$715, DW_AT_TI_symbol_name("_a1")
    4712                      .dwattr $C$DW$715, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    4713                      .dwattr $C$DW$715, DW_AT_accessibility(DW_ACCESS_public)
TMS320C2000 Assembler PC v6.2.5 Mon Sep 11 16:23:19 2017

Tools Copyright (c) 1996-2014 Texas Instruments Incorporated
C:\Users\wmj\AppData\Local\Temp\1011613                              PAGE   92

    4714              $C$DW$716       .dwtag  DW_TAG_member
    4715                      .dwattr $C$DW$716, DW_AT_type(*$C$DW$T$33)
    4716                      .dwattr $C$DW$716, DW_AT_name("b0")
    4717                      .dwattr $C$DW$716, DW_AT_TI_symbol_name("_b0")
    4718                      .dwattr $C$DW$716, DW_AT_data_member_location[DW_OP_plus_uconst 0x2]
    4719                      .dwattr $C$DW$716, DW_AT_accessibility(DW_ACCESS_public)
    4720              $C$DW$717       .dwtag  DW_TAG_member
    4721                      .dwattr $C$DW$717, DW_AT_type(*$C$DW$T$33)
    4722                      .dwattr $C$DW$717, DW_AT_name("b1")
    4723                      .dwattr $C$DW$717, DW_AT_TI_symbol_name("_b1")
    4724                      .dwattr $C$DW$717, DW_AT_data_member_location[DW_OP_plus_uconst 0x4]
    4725                      .dwattr $C$DW$717, DW_AT_accessibility(DW_ACCESS_public)
    4726              $C$DW$718       .dwtag  DW_TAG_member
    4727                      .dwattr $C$DW$718, DW_AT_type(*$C$DW$T$33)
    4728                      .dwattr $C$DW$718, DW_AT_name("x1")
    4729                      .dwattr $C$DW$718, DW_AT_TI_symbol_name("_x1")
    4730                      .dwattr $C$DW$718, DW_AT_data_member_location[DW_OP_plus_uconst 0x6]
    4731                      .dwattr $C$DW$718, DW_AT_accessibility(DW_ACCESS_public)
    4732              $C$DW$719       .dwtag  DW_TAG_member
    4733                      .dwattr $C$DW$719, DW_AT_type(*$C$DW$T$33)
    4734                      .dwattr $C$DW$719, DW_AT_name("y1")
    4735                      .dwattr $C$DW$719, DW_AT_TI_symbol_name("_y1")
    4736                      .dwattr $C$DW$719, DW_AT_data_member_location[DW_OP_plus_uconst 0x8]
    4737                      .dwattr $C$DW$719, DW_AT_accessibility(DW_ACCESS_public)
    4738                      .dwendtag $C$DW$T$85
    4739              
    4740              $C$DW$T$194     .dwtag  DW_TAG_typedef, DW_AT_name("FILTER_FO_Obj")
    4741                      .dwattr $C$DW$T$194, DW_AT_type(*$C$DW$T$85)
    4742                      .dwattr $C$DW$T$194, DW_AT_language(DW_LANG_C)
    4743              
    4744              $C$DW$T$22      .dwtag  DW_TAG_structure_type
    4745                      .dwattr $C$DW$T$22, DW_AT_name("_FILTER_FO_Obj_")
    4746                      .dwattr $C$DW$T$22, DW_AT_declaration
    4747                      .dwendtag $C$DW$T$22
    4748              
    4749              $C$DW$T$195     .dwtag  DW_TAG_pointer_type
    4750                      .dwattr $C$DW$T$195, DW_AT_type(*$C$DW$T$22)
    4751                      .dwattr $C$DW$T$195, DW_AT_address_class(0x16)
    4752              $C$DW$T$196     .dwtag  DW_TAG_typedef, DW_AT_name("FILTER_FO_Handle")
    4753                      .dwattr $C$DW$T$196, DW_AT_type(*$C$DW$T$195)
    4754                      .dwattr $C$DW$T$196, DW_AT_language(DW_LANG_C)
    4755              
    4756              $C$DW$T$86      .dwtag  DW_TAG_structure_type
    4757                      .dwattr $C$DW$T$86, DW_AT_name("_FLASH_Obj_")
    4758                      .dwattr $C$DW$T$86, DW_AT_byte_size(0x08)
    4759              $C$DW$720       .dwtag  DW_TAG_member
    4760                      .dwattr $C$DW$720, DW_AT_type(*$C$DW$T$25)
    4761                      .dwattr $C$DW$720, DW_AT_name("FOPT")
    4762                      .dwattr $C$DW$720, DW_AT_TI_symbol_name("_FOPT")
    4763                      .dwattr $C$DW$720, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    4764                      .dwattr $C$DW$720, DW_AT_accessibility(DW_ACCESS_public)
    4765              $C$DW$721       .dwtag  DW_TAG_member
    4766                      .dwattr $C$DW$721, DW_AT_type(*$C$DW$T$25)
    4767                      .dwattr $C$DW$721, DW_AT_name("rsvd_1")
    4768                      .dwattr $C$DW$721, DW_AT_TI_symbol_name("_rsvd_1")
TMS320C2000 Assembler PC v6.2.5 Mon Sep 11 16:23:19 2017

Tools Copyright (c) 1996-2014 Texas Instruments Incorporated
C:\Users\wmj\AppData\Local\Temp\1011613                              PAGE   93

    4769                      .dwattr $C$DW$721, DW_AT_data_member_location[DW_OP_plus_uconst 0x1]
    4770                      .dwattr $C$DW$721, DW_AT_accessibility(DW_ACCESS_public)
    4771              $C$DW$722       .dwtag  DW_TAG_member
    4772                      .dwattr $C$DW$722, DW_AT_type(*$C$DW$T$25)
    4773                      .dwattr $C$DW$722, DW_AT_name("FPWR")
    4774                      .dwattr $C$DW$722, DW_AT_TI_symbol_name("_FPWR")
    4775                      .dwattr $C$DW$722, DW_AT_data_member_location[DW_OP_plus_uconst 0x2]
    4776                      .dwattr $C$DW$722, DW_AT_accessibility(DW_ACCESS_public)
    4777              $C$DW$723       .dwtag  DW_TAG_member
    4778                      .dwattr $C$DW$723, DW_AT_type(*$C$DW$T$25)
    4779                      .dwattr $C$DW$723, DW_AT_name("FSTATUS")
    4780                      .dwattr $C$DW$723, DW_AT_TI_symbol_name("_FSTATUS")
    4781                      .dwattr $C$DW$723, DW_AT_data_member_location[DW_OP_plus_uconst 0x3]
    4782                      .dwattr $C$DW$723, DW_AT_accessibility(DW_ACCESS_public)
    4783              $C$DW$724       .dwtag  DW_TAG_member
    4784                      .dwattr $C$DW$724, DW_AT_type(*$C$DW$T$25)
    4785                      .dwattr $C$DW$724, DW_AT_name("FSTDBYWAIT")
    4786                      .dwattr $C$DW$724, DW_AT_TI_symbol_name("_FSTDBYWAIT")
    4787                      .dwattr $C$DW$724, DW_AT_data_member_location[DW_OP_plus_uconst 0x4]
    4788                      .dwattr $C$DW$724, DW_AT_accessibility(DW_ACCESS_public)
    4789              $C$DW$725       .dwtag  DW_TAG_member
    4790                      .dwattr $C$DW$725, DW_AT_type(*$C$DW$T$25)
    4791                      .dwattr $C$DW$725, DW_AT_name("FACTIVEWAIT")
    4792                      .dwattr $C$DW$725, DW_AT_TI_symbol_name("_FACTIVEWAIT")
    4793                      .dwattr $C$DW$725, DW_AT_data_member_location[DW_OP_plus_uconst 0x5]
    4794                      .dwattr $C$DW$725, DW_AT_accessibility(DW_ACCESS_public)
    4795              $C$DW$726       .dwtag  DW_TAG_member
    4796                      .dwattr $C$DW$726, DW_AT_type(*$C$DW$T$25)
    4797                      .dwattr $C$DW$726, DW_AT_name("FBANKWAIT")
    4798                      .dwattr $C$DW$726, DW_AT_TI_symbol_name("_FBANKWAIT")
    4799                      .dwattr $C$DW$726, DW_AT_data_member_location[DW_OP_plus_uconst 0x6]
    4800                      .dwattr $C$DW$726, DW_AT_accessibility(DW_ACCESS_public)
    4801              $C$DW$727       .dwtag  DW_TAG_member
    4802                      .dwattr $C$DW$727, DW_AT_type(*$C$DW$T$25)
    4803                      .dwattr $C$DW$727, DW_AT_name("FOTPWAIT")
    4804                      .dwattr $C$DW$727, DW_AT_TI_symbol_name("_FOTPWAIT")
    4805                      .dwattr $C$DW$727, DW_AT_data_member_location[DW_OP_plus_uconst 0x7]
    4806                      .dwattr $C$DW$727, DW_AT_accessibility(DW_ACCESS_public)
    4807                      .dwendtag $C$DW$T$86
    4808              
    4809              $C$DW$T$99      .dwtag  DW_TAG_pointer_type
    4810                      .dwattr $C$DW$T$99, DW_AT_type(*$C$DW$T$86)
    4811                      .dwattr $C$DW$T$99, DW_AT_address_class(0x16)
    4812              $C$DW$T$100     .dwtag  DW_TAG_typedef, DW_AT_name("FLASH_Handle")
    4813                      .dwattr $C$DW$T$100, DW_AT_type(*$C$DW$T$99)
    4814                      .dwattr $C$DW$T$100, DW_AT_language(DW_LANG_C)
    4815              
    4816              $C$DW$T$90      .dwtag  DW_TAG_structure_type
    4817                      .dwattr $C$DW$T$90, DW_AT_name("_GPIO_Obj_")
    4818                      .dwattr $C$DW$T$90, DW_AT_byte_size(0x6a)
    4819              $C$DW$728       .dwtag  DW_TAG_member
    4820                      .dwattr $C$DW$728, DW_AT_type(*$C$DW$T$87)
    4821                      .dwattr $C$DW$728, DW_AT_name("GPACTRL")
    4822                      .dwattr $C$DW$728, DW_AT_TI_symbol_name("_GPACTRL")
    4823                      .dwattr $C$DW$728, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
TMS320C2000 Assembler PC v6.2.5 Mon Sep 11 16:23:19 2017

Tools Copyright (c) 1996-2014 Texas Instruments Incorporated
C:\Users\wmj\AppData\Local\Temp\1011613                              PAGE   94

    4824                      .dwattr $C$DW$728, DW_AT_accessibility(DW_ACCESS_public)
    4825              $C$DW$729       .dwtag  DW_TAG_member
    4826                      .dwattr $C$DW$729, DW_AT_type(*$C$DW$T$87)
    4827                      .dwattr $C$DW$729, DW_AT_name("GPAQSEL1")
    4828                      .dwattr $C$DW$729, DW_AT_TI_symbol_name("_GPAQSEL1")
    4829                      .dwattr $C$DW$729, DW_AT_data_member_location[DW_OP_plus_uconst 0x2]
    4830                      .dwattr $C$DW$729, DW_AT_accessibility(DW_ACCESS_public)
    4831              $C$DW$730       .dwtag  DW_TAG_member
    4832                      .dwattr $C$DW$730, DW_AT_type(*$C$DW$T$87)
    4833                      .dwattr $C$DW$730, DW_AT_name("GPAQSEL2")
    4834                      .dwattr $C$DW$730, DW_AT_TI_symbol_name("_GPAQSEL2")
    4835                      .dwattr $C$DW$730, DW_AT_data_member_location[DW_OP_plus_uconst 0x4]
    4836                      .dwattr $C$DW$730, DW_AT_accessibility(DW_ACCESS_public)
    4837              $C$DW$731       .dwtag  DW_TAG_member
    4838                      .dwattr $C$DW$731, DW_AT_type(*$C$DW$T$87)
    4839                      .dwattr $C$DW$731, DW_AT_name("GPAMUX1")
    4840                      .dwattr $C$DW$731, DW_AT_TI_symbol_name("_GPAMUX1")
    4841                      .dwattr $C$DW$731, DW_AT_data_member_location[DW_OP_plus_uconst 0x6]
    4842                      .dwattr $C$DW$731, DW_AT_accessibility(DW_ACCESS_public)
    4843              $C$DW$732       .dwtag  DW_TAG_member
    4844                      .dwattr $C$DW$732, DW_AT_type(*$C$DW$T$87)
    4845                      .dwattr $C$DW$732, DW_AT_name("GPAMUX2")
    4846                      .dwattr $C$DW$732, DW_AT_TI_symbol_name("_GPAMUX2")
    4847                      .dwattr $C$DW$732, DW_AT_data_member_location[DW_OP_plus_uconst 0x8]
    4848                      .dwattr $C$DW$732, DW_AT_accessibility(DW_ACCESS_public)
    4849              $C$DW$733       .dwtag  DW_TAG_member
    4850                      .dwattr $C$DW$733, DW_AT_type(*$C$DW$T$87)
    4851                      .dwattr $C$DW$733, DW_AT_name("GPADIR")
    4852                      .dwattr $C$DW$733, DW_AT_TI_symbol_name("_GPADIR")
    4853                      .dwattr $C$DW$733, DW_AT_data_member_location[DW_OP_plus_uconst 0xa]
    4854                      .dwattr $C$DW$733, DW_AT_accessibility(DW_ACCESS_public)
    4855              $C$DW$734       .dwtag  DW_TAG_member
    4856                      .dwattr $C$DW$734, DW_AT_type(*$C$DW$T$87)
    4857                      .dwattr $C$DW$734, DW_AT_name("GPAPUD")
    4858                      .dwattr $C$DW$734, DW_AT_TI_symbol_name("_GPAPUD")
    4859                      .dwattr $C$DW$734, DW_AT_data_member_location[DW_OP_plus_uconst 0xc]
    4860                      .dwattr $C$DW$734, DW_AT_accessibility(DW_ACCESS_public)
    4861              $C$DW$735       .dwtag  DW_TAG_member
    4862                      .dwattr $C$DW$735, DW_AT_type(*$C$DW$T$28)
    4863                      .dwattr $C$DW$735, DW_AT_name("rsvd_1")
    4864                      .dwattr $C$DW$735, DW_AT_TI_symbol_name("_rsvd_1")
    4865                      .dwattr $C$DW$735, DW_AT_data_member_location[DW_OP_plus_uconst 0xe]
    4866                      .dwattr $C$DW$735, DW_AT_accessibility(DW_ACCESS_public)
    4867              $C$DW$736       .dwtag  DW_TAG_member
    4868                      .dwattr $C$DW$736, DW_AT_type(*$C$DW$T$87)
    4869                      .dwattr $C$DW$736, DW_AT_name("GPBCTRL")
    4870                      .dwattr $C$DW$736, DW_AT_TI_symbol_name("_GPBCTRL")
    4871                      .dwattr $C$DW$736, DW_AT_data_member_location[DW_OP_plus_uconst 0x10]
    4872                      .dwattr $C$DW$736, DW_AT_accessibility(DW_ACCESS_public)
    4873              $C$DW$737       .dwtag  DW_TAG_member
    4874                      .dwattr $C$DW$737, DW_AT_type(*$C$DW$T$87)
    4875                      .dwattr $C$DW$737, DW_AT_name("GPBQSEL1")
    4876                      .dwattr $C$DW$737, DW_AT_TI_symbol_name("_GPBQSEL1")
    4877                      .dwattr $C$DW$737, DW_AT_data_member_location[DW_OP_plus_uconst 0x12]
    4878                      .dwattr $C$DW$737, DW_AT_accessibility(DW_ACCESS_public)
TMS320C2000 Assembler PC v6.2.5 Mon Sep 11 16:23:19 2017

Tools Copyright (c) 1996-2014 Texas Instruments Incorporated
C:\Users\wmj\AppData\Local\Temp\1011613                              PAGE   95

    4879              $C$DW$738       .dwtag  DW_TAG_member
    4880                      .dwattr $C$DW$738, DW_AT_type(*$C$DW$T$28)
    4881                      .dwattr $C$DW$738, DW_AT_name("rsvd_2")
    4882                      .dwattr $C$DW$738, DW_AT_TI_symbol_name("_rsvd_2")
    4883                      .dwattr $C$DW$738, DW_AT_data_member_location[DW_OP_plus_uconst 0x14]
    4884                      .dwattr $C$DW$738, DW_AT_accessibility(DW_ACCESS_public)
    4885              $C$DW$739       .dwtag  DW_TAG_member
