TMS320C2000 Assembler PC v6.2.5 Tue Sep 12 21:00:17 2017

Tools Copyright (c) 1996-2014 Texas Instruments Incorporated
C:\Users\wmj\AppData\Local\Temp\0425610                              PAGE    1

       1              ;***************************************************************
       2              ;* TMS320C2000 C/C++ Codegen                         PC v6.2.5 *
       3              ;* Date/Time created: Tue Sep 12 21:00:17 2017                 *
       4              ;***************************************************************
       5                      .compiler_opts --float_support=softlib --hll_source=on --mem_model:code=flat --mem_model:data=large -
       6        0002  FP      .set    XAR2
       7              
       8              $C$DW$CU        .dwtag  DW_TAG_compile_unit
       9                      .dwattr $C$DW$CU, DW_AT_name("D:/BM1000/sw/solutions/instaspin_foc/src/proj_lab11e.c")
      10                      .dwattr $C$DW$CU, DW_AT_producer("TMS320C2000 C/C++ Codegen PC v6.2.5 Copyright (c) 1996-2014 Texas I
      11                      .dwattr $C$DW$CU, DW_AT_TI_version(0x01)
      12                      .dwattr $C$DW$CU, DW_AT_comp_dir("D:\BM1000\sw\solutions\instaspin_foc\boards\hvkit_rev1p1\f28x\f2802
      13              ;**************************************************************
      14              ;* CINIT RECORDS                                              *

    8797              $C$DW$862       .dwtag  DW_TAG_enumerator, DW_AT_name("GPIO_Rsvd_23"), DW_AT_const_value(0x17)
    8798              $C$DW$863       .dwtag  DW_TAG_enumerator, DW_AT_name("GPIO_Rsvd_24"), DW_AT_const_value(0x18)
    8799              $C$DW$864       .dwtag  DW_TAG_enumerator, DW_AT_name("GPIO_Rsvd_25"), DW_AT_const_value(0x19)
    8800              $C$DW$865       .dwtag  DW_TAG_enumerator, DW_AT_name("GPIO_Rsvd_26"), DW_AT_const_value(0x1a)
    8801              $C$DW$866       .dwtag  DW_TAG_enumerator, DW_AT_name("GPIO_Rsvd_27"), DW_AT_const_value(0x1b)
    8802              $C$DW$867       .dwtag  DW_TAG_enumerator, DW_AT_name("GPIO_Number_28"), DW_AT_const_value(0x1c)
    8803              $C$DW$868       .dwtag  DW_TAG_enumerator, DW_AT_name("GPIO_Number_29"), DW_AT_const_value(0x1d)
    8804              $C$DW$869       .dwtag  DW_TAG_enumerator, DW_AT_name("GPIO_Rsvd_30"), DW_AT_const_value(0x1e)
    8805              $C$DW$870       .dwtag  DW_TAG_enumerator, DW_AT_name("GPIO_Rsvd_31"), DW_AT_const_value(0x1f)
    8806              $C$DW$871       .dwtag  DW_TAG_enumerator, DW_AT_name("GPIO_Number_32"), DW_AT_const_value(0x20)
    8807              $C$DW$872       .dwtag  DW_TAG_enumerator, DW_AT_name("GPIO_Number_33"), DW_AT_const_value(0x21)
    8808              $C$DW$873       .dwtag  DW_TAG_enumerator, DW_AT_name("GPIO_Number_34"), DW_AT_const_value(0x22)
    8809              $C$DW$874       .dwtag  DW_TAG_enumerator, DW_AT_name("GPIO_Number_35"), DW_AT_const_value(0x23)
    8810              $C$DW$875       .dwtag  DW_TAG_enumerator, DW_AT_name("GPIO_Number_36"), DW_AT_const_value(0x24)
    8811              $C$DW$876       .dwtag  DW_TAG_enumerator, DW_AT_name("GPIO_Number_37"), DW_AT_const_value(0x25)
    8812              $C$DW$877       .dwtag  DW_TAG_enumerator, DW_AT_name("GPIO_Number_38"), DW_AT_const_value(0x26)
    8813              $C$DW$878       .dwtag  DW_TAG_enumerator, DW_AT_name("GPIO_numGpios"), DW_AT_const_value(0x27)
    8814                      .dwendtag $C$DW$T$186
    8815              
    8816              $C$DW$T$187     .dwtag  DW_TAG_typedef, DW_AT_name("GPIO_Number_e")
    8817                      .dwattr $C$DW$T$187, DW_AT_type(*$C$DW$T$186)
    8818                      .dwattr $C$DW$T$187, DW_AT_language(DW_LANG_C)
    8819              $C$DW$879       .dwtag  DW_TAG_TI_far_type
    8820                      .dwattr $C$DW$879, DW_AT_type(*$C$DW$T$187)
    8821              $C$DW$T$188     .dwtag  DW_TAG_const_type
    8822                      .dwattr $C$DW$T$188, DW_AT_type(*$C$DW$879)
    8823              
    8824              $C$DW$T$189     .dwtag  DW_TAG_enumeration_type
    8825                      .dwattr $C$DW$T$189, DW_AT_byte_size(0x01)
    8826              $C$DW$880       .dwtag  DW_TAG_enumerator, DW_AT_name("PIE_GroupNumber_1"), DW_AT_const_value(0x00)
    8827              $C$DW$881       .dwtag  DW_TAG_enumerator, DW_AT_name("PIE_GroupNumber_2"), DW_AT_const_value(0x01)
TMS320C2000 Assembler PC v6.2.5 Tue Sep 12 21:00:17 2017

Tools Copyright (c) 1996-2014 Texas Instruments Incorporated
C:\Users\wmj\AppData\Local\Temp\0425610                              PAGE  179

    8828              $C$DW$882       .dwtag  DW_TAG_enumerator, DW_AT_name("PIE_GroupNumber_3"), DW_AT_const_value(0x02)
    8829              $C$DW$883       .dwtag  DW_TAG_enumerator, DW_AT_name("PIE_GroupNumber_4"), DW_AT_const_value(0x03)
    8830              $C$DW$884       .dwtag  DW_TAG_enumerator, DW_AT_name("PIE_GroupNumber_5"), DW_AT_const_value(0x04)
    8831              $C$DW$885       .dwtag  DW_TAG_enumerator, DW_AT_name("PIE_GroupNumber_6"), DW_AT_const_value(0x05)
    8832              $C$DW$886       .dwtag  DW_TAG_enumerator, DW_AT_name("PIE_GroupNumber_7"), DW_AT_const_value(0x06)
    8833              $C$DW$887       .dwtag  DW_TAG_enumerator, DW_AT_name("PIE_GroupNumber_8"), DW_AT_const_value(0x07)
    8834              $C$DW$888       .dwtag  DW_TAG_enumerator, DW_AT_name("PIE_GroupNumber_9"), DW_AT_const_value(0x08)
    8835              $C$DW$889       .dwtag  DW_TAG_enumerator, DW_AT_name("PIE_GroupNumber_10"), DW_AT_const_value(0x09)
    8836              $C$DW$890       .dwtag  DW_TAG_enumerator, DW_AT_name("PIE_GroupNumber_11"), DW_AT_const_value(0x0a)
    8837              $C$DW$891       .dwtag  DW_TAG_enumerator, DW_AT_name("PIE_GroupNumber_12"), DW_AT_const_value(0x0b)
    8838                      .dwendtag $C$DW$T$189
    8839              
    8840              $C$DW$T$190     .dwtag  DW_TAG_typedef, DW_AT_name("PIE_GroupNumber_e")
    8841                      .dwattr $C$DW$T$190, DW_AT_type(*$C$DW$T$189)
    8842                      .dwattr $C$DW$T$190, DW_AT_language(DW_LANG_C)
    8843              
    8844              $C$DW$T$19      .dwtag  DW_TAG_structure_type
    8845                      .dwattr $C$DW$T$19, DW_AT_name("I2C_Obj")
    8846                      .dwattr $C$DW$T$19, DW_AT_declaration
    8847                      .dwendtag $C$DW$T$19
    8848              
    8849              $C$DW$T$87      .dwtag  DW_TAG_pointer_type
    8850                      .dwattr $C$DW$T$87, DW_AT_type(*$C$DW$T$19)
    8851                      .dwattr $C$DW$T$87, DW_AT_address_class(0x16)
    8852              $C$DW$T$88      .dwtag  DW_TAG_typedef, DW_AT_name("I2C_Handle")
    8853                      .dwattr $C$DW$T$88, DW_AT_type(*$C$DW$T$87)
    8854                      .dwattr $C$DW$T$88, DW_AT_language(DW_LANG_C)
    8855              
    8856              $C$DW$T$31      .dwtag  DW_TAG_structure_type
    8857                      .dwattr $C$DW$T$31, DW_AT_name("_ADC_Obj_")
    8858                      .dwattr $C$DW$T$31, DW_AT_byte_size(0x6650)
    8859              $C$DW$892       .dwtag  DW_TAG_member
    8860                      .dwattr $C$DW$892, DW_AT_type(*$C$DW$T$25)
    8861                      .dwattr $C$DW$892, DW_AT_name("ADCRESULT")
    8862                      .dwattr $C$DW$892, DW_AT_TI_symbol_name("_ADCRESULT")
    8863                      .dwattr $C$DW$892, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    8864                      .dwattr $C$DW$892, DW_AT_accessibility(DW_ACCESS_public)
    8865              $C$DW$893       .dwtag  DW_TAG_member
    8866                      .dwattr $C$DW$893, DW_AT_type(*$C$DW$T$26)
    8867                      .dwattr $C$DW$893, DW_AT_name("resvd_1")
    8868                      .dwattr $C$DW$893, DW_AT_TI_symbol_name("_resvd_1")
    8869                      .dwattr $C$DW$893, DW_AT_data_member_location[DW_OP_plus_uconst 0x10]
    8870                      .dwattr $C$DW$893, DW_AT_accessibility(DW_ACCESS_public)
    8871              $C$DW$894       .dwtag  DW_TAG_member
    8872                      .dwattr $C$DW$894, DW_AT_type(*$C$DW$T$24)
    8873                      .dwattr $C$DW$894, DW_AT_name("ADCCTL1")
    8874                      .dwattr $C$DW$894, DW_AT_TI_symbol_name("_ADCCTL1")
    8875                      .dwattr $C$DW$894, DW_AT_data_member_location[DW_OP_plus_uconst 0x6600]
    8876                      .dwattr $C$DW$894, DW_AT_accessibility(DW_ACCESS_public)
    8877              $C$DW$895       .dwtag  DW_TAG_member
    8878                      .dwattr $C$DW$895, DW_AT_type(*$C$DW$T$24)
    8879                      .dwattr $C$DW$895, DW_AT_name("ADCCTL2")
    8880                      .dwattr $C$DW$895, DW_AT_TI_symbol_name("_ADCCTL2")
    8881                      .dwattr $C$DW$895, DW_AT_data_member_location[DW_OP_plus_uconst 0x6601]
    8882                      .dwattr $C$DW$895, DW_AT_accessibility(DW_ACCESS_public)
TMS320C2000 Assembler PC v6.2.5 Tue Sep 12 21:00:17 2017

Tools Copyright (c) 1996-2014 Texas Instruments Incorporated
C:\Users\wmj\AppData\Local\Temp\0425610                              PAGE  180

    8883              $C$DW$896       .dwtag  DW_TAG_member
    8884                      .dwattr $C$DW$896, DW_AT_type(*$C$DW$T$27)
    8885                      .dwattr $C$DW$896, DW_AT_name("rsvd_2")
    8886                      .dwattr $C$DW$896, DW_AT_TI_symbol_name("_rsvd_2")
    8887                      .dwattr $C$DW$896, DW_AT_data_member_location[DW_OP_plus_uconst 0x6602]
    8888                      .dwattr $C$DW$896, DW_AT_accessibility(DW_ACCESS_public)
    8889              $C$DW$897       .dwtag  DW_TAG_member
    8890                      .dwattr $C$DW$897, DW_AT_type(*$C$DW$T$24)
    8891                      .dwattr $C$DW$897, DW_AT_name("ADCINTFLG")
    8892                      .dwattr $C$DW$897, DW_AT_TI_symbol_name("_ADCINTFLG")
    8893                      .dwattr $C$DW$897, DW_AT_data_member_location[DW_OP_plus_uconst 0x6604]
    8894                      .dwattr $C$DW$897, DW_AT_accessibility(DW_ACCESS_public)
    8895              $C$DW$898       .dwtag  DW_TAG_member
    8896                      .dwattr $C$DW$898, DW_AT_type(*$C$DW$T$24)
    8897                      .dwattr $C$DW$898, DW_AT_name("ADCINTFLGCLR")
    8898                      .dwattr $C$DW$898, DW_AT_TI_symbol_name("_ADCINTFLGCLR")
    8899                      .dwattr $C$DW$898, DW_AT_data_member_location[DW_OP_plus_uconst 0x6605]
    8900                      .dwattr $C$DW$898, DW_AT_accessibility(DW_ACCESS_public)
    8901              $C$DW$899       .dwtag  DW_TAG_member
    8902                      .dwattr $C$DW$899, DW_AT_type(*$C$DW$T$24)
    8903                      .dwattr $C$DW$899, DW_AT_name("ADCINTOVF")
    8904                      .dwattr $C$DW$899, DW_AT_TI_symbol_name("_ADCINTOVF")
    8905                      .dwattr $C$DW$899, DW_AT_data_member_location[DW_OP_plus_uconst 0x6606]
    8906                      .dwattr $C$DW$899, DW_AT_accessibility(DW_ACCESS_public)
    8907              $C$DW$900       .dwtag  DW_TAG_member
    8908                      .dwattr $C$DW$900, DW_AT_type(*$C$DW$T$24)
    8909                      .dwattr $C$DW$900, DW_AT_name("ADCINTOVFCLR")
    8910                      .dwattr $C$DW$900, DW_AT_TI_symbol_name("_ADCINTOVFCLR")
    8911                      .dwattr $C$DW$900, DW_AT_data_member_location[DW_OP_plus_uconst 0x6607]
    8912                      .dwattr $C$DW$900, DW_AT_accessibility(DW_ACCESS_public)
    8913              $C$DW$901       .dwtag  DW_TAG_member
    8914                      .dwattr $C$DW$901, DW_AT_type(*$C$DW$T$28)
    8915                      .dwattr $C$DW$901, DW_AT_name("INTSELxNy")
    8916                      .dwattr $C$DW$901, DW_AT_TI_symbol_name("_INTSELxNy")
    8917                      .dwattr $C$DW$901, DW_AT_data_member_location[DW_OP_plus_uconst 0x6608]
    8918                      .dwattr $C$DW$901, DW_AT_accessibility(DW_ACCESS_public)
    8919              $C$DW$902       .dwtag  DW_TAG_member
    8920                      .dwattr $C$DW$902, DW_AT_type(*$C$DW$T$29)
    8921                      .dwattr $C$DW$902, DW_AT_name("rsvd_3")
    8922                      .dwattr $C$DW$902, DW_AT_TI_symbol_name("_rsvd_3")
    8923                      .dwattr $C$DW$902, DW_AT_data_member_location[DW_OP_plus_uconst 0x660d]
    8924                      .dwattr $C$DW$902, DW_AT_accessibility(DW_ACCESS_public)
    8925              $C$DW$903       .dwtag  DW_TAG_member
    8926                      .dwattr $C$DW$903, DW_AT_type(*$C$DW$T$24)
    8927                      .dwattr $C$DW$903, DW_AT_name("SOCPRICTRL")
    8928                      .dwattr $C$DW$903, DW_AT_TI_symbol_name("_SOCPRICTRL")
    8929                      .dwattr $C$DW$903, DW_AT_data_member_location[DW_OP_plus_uconst 0x6610]
    8930                      .dwattr $C$DW$903, DW_AT_accessibility(DW_ACCESS_public)
    8931              $C$DW$904       .dwtag  DW_TAG_member
    8932                      .dwattr $C$DW$904, DW_AT_type(*$C$DW$T$24)
    8933                      .dwattr $C$DW$904, DW_AT_name("rsvd_4")
    8934                      .dwattr $C$DW$904, DW_AT_TI_symbol_name("_rsvd_4")
    8935                      .dwattr $C$DW$904, DW_AT_data_member_location[DW_OP_plus_uconst 0x6611]
    8936                      .dwattr $C$DW$904, DW_AT_accessibility(DW_ACCESS_public)
    8937              $C$DW$905       .dwtag  DW_TAG_member
TMS320C2000 Assembler PC v6.2.5 Tue Sep 12 21:00:17 2017

Tools Copyright (c) 1996-2014 Texas Instruments Incorporated
C:\Users\wmj\AppData\Local\Temp\0425610                              PAGE  181

    8938                      .dwattr $C$DW$905, DW_AT_type(*$C$DW$T$24)
    8939                      .dwattr $C$DW$905, DW_AT_name("ADCSAMPLEMODE")
    8940                      .dwattr $C$DW$905, DW_AT_TI_symbol_name("_ADCSAMPLEMODE")
    8941                      .dwattr $C$DW$905, DW_AT_data_member_location[DW_OP_plus_uconst 0x6612]
    8942                      .dwattr $C$DW$905, DW_AT_accessibility(DW_ACCESS_public)
    8943              $C$DW$906       .dwtag  DW_TAG_member
    8944                      .dwattr $C$DW$906, DW_AT_type(*$C$DW$T$24)
    8945                      .dwattr $C$DW$906, DW_AT_name("rsvd_5")
    8946                      .dwattr $C$DW$906, DW_AT_TI_symbol_name("_rsvd_5")
    8947                      .dwattr $C$DW$906, DW_AT_data_member_location[DW_OP_plus_uconst 0x6613]
    8948                      .dwattr $C$DW$906, DW_AT_accessibility(DW_ACCESS_public)
    8949              $C$DW$907       .dwtag  DW_TAG_member
    8950                      .dwattr $C$DW$907, DW_AT_type(*$C$DW$T$24)
    8951                      .dwattr $C$DW$907, DW_AT_name("ADCINTSOCSEL1")
    8952                      .dwattr $C$DW$907, DW_AT_TI_symbol_name("_ADCINTSOCSEL1")
    8953                      .dwattr $C$DW$907, DW_AT_data_member_location[DW_OP_plus_uconst 0x6614]
    8954                      .dwattr $C$DW$907, DW_AT_accessibility(DW_ACCESS_public)
    8955              $C$DW$908       .dwtag  DW_TAG_member
    8956                      .dwattr $C$DW$908, DW_AT_type(*$C$DW$T$24)
    8957                      .dwattr $C$DW$908, DW_AT_name("ADCINTSOCSEL2")
    8958                      .dwattr $C$DW$908, DW_AT_TI_symbol_name("_ADCINTSOCSEL2")
    8959                      .dwattr $C$DW$908, DW_AT_data_member_location[DW_OP_plus_uconst 0x6615]
    8960                      .dwattr $C$DW$908, DW_AT_accessibility(DW_ACCESS_public)
    8961              $C$DW$909       .dwtag  DW_TAG_member
    8962                      .dwattr $C$DW$909, DW_AT_type(*$C$DW$T$27)
    8963                      .dwattr $C$DW$909, DW_AT_name("rsvd_6")
    8964                      .dwattr $C$DW$909, DW_AT_TI_symbol_name("_rsvd_6")
    8965                      .dwattr $C$DW$909, DW_AT_data_member_location[DW_OP_plus_uconst 0x6616]
    8966                      .dwattr $C$DW$909, DW_AT_accessibility(DW_ACCESS_public)
    8967              $C$DW$910       .dwtag  DW_TAG_member
    8968                      .dwattr $C$DW$910, DW_AT_type(*$C$DW$T$24)
    8969                      .dwattr $C$DW$910, DW_AT_name("ADCSOCFLG1")
    8970                      .dwattr $C$DW$910, DW_AT_TI_symbol_name("_ADCSOCFLG1")
    8971                      .dwattr $C$DW$910, DW_AT_data_member_location[DW_OP_plus_uconst 0x6618]
    8972                      .dwattr $C$DW$910, DW_AT_accessibility(DW_ACCESS_public)
    8973              $C$DW$911       .dwtag  DW_TAG_member
    8974                      .dwattr $C$DW$911, DW_AT_type(*$C$DW$T$24)
    8975                      .dwattr $C$DW$911, DW_AT_name("rsvd_7")
    8976                      .dwattr $C$DW$911, DW_AT_TI_symbol_name("_rsvd_7")
    8977                      .dwattr $C$DW$911, DW_AT_data_member_location[DW_OP_plus_uconst 0x6619]
    8978                      .dwattr $C$DW$911, DW_AT_accessibility(DW_ACCESS_public)
    8979              $C$DW$912       .dwtag  DW_TAG_member
    8980                      .dwattr $C$DW$912, DW_AT_type(*$C$DW$T$24)
    8981                      .dwattr $C$DW$912, DW_AT_name("ADCSOCFRC1")
    8982                      .dwattr $C$DW$912, DW_AT_TI_symbol_name("_ADCSOCFRC1")
    8983                      .dwattr $C$DW$912, DW_AT_data_member_location[DW_OP_plus_uconst 0x661a]
    8984                      .dwattr $C$DW$912, DW_AT_accessibility(DW_ACCESS_public)
    8985              $C$DW$913       .dwtag  DW_TAG_member
    8986                      .dwattr $C$DW$913, DW_AT_type(*$C$DW$T$24)
    8987                      .dwattr $C$DW$913, DW_AT_name("rsvd_8")
    8988                      .dwattr $C$DW$913, DW_AT_TI_symbol_name("_rsvd_8")
    8989                      .dwattr $C$DW$913, DW_AT_data_member_location[DW_OP_plus_uconst 0x661b]
    8990                      .dwattr $C$DW$913, DW_AT_accessibility(DW_ACCESS_public)
    8991              $C$DW$914       .dwtag  DW_TAG_member
    8992                      .dwattr $C$DW$914, DW_AT_type(*$C$DW$T$24)
TMS320C2000 Assembler PC v6.2.5 Tue Sep 12 21:00:17 2017

Tools Copyright (c) 1996-2014 Texas Instruments Incorporated
C:\Users\wmj\AppData\Local\Temp\0425610                              PAGE  182

    8993                      .dwattr $C$DW$914, DW_AT_name("ADCSOCOVF1")
    8994                      .dwattr $C$DW$914, DW_AT_TI_symbol_name("_ADCSOCOVF1")
    8995                      .dwattr $C$DW$914, DW_AT_data_member_location[DW_OP_plus_uconst 0x661c]
    8996                      .dwattr $C$DW$914, DW_AT_accessibility(DW_ACCESS_public)
    8997              $C$DW$915       .dwtag  DW_TAG_member
    8998                      .dwattr $C$DW$915, DW_AT_type(*$C$DW$T$24)
    8999                      .dwattr $C$DW$915, DW_AT_name("rsvd_9")
    9000                      .dwattr $C$DW$915, DW_AT_TI_symbol_name("_rsvd_9")
    9001                      .dwattr $C$DW$915, DW_AT_data_member_location[DW_OP_plus_uconst 0x661d]
    9002                      .dwattr $C$DW$915, DW_AT_accessibility(DW_ACCESS_public)
    9003              $C$DW$916       .dwtag  DW_TAG_member
    9004                      .dwattr $C$DW$916, DW_AT_type(*$C$DW$T$24)
    9005                      .dwattr $C$DW$916, DW_AT_name("ADCSOCOVFCLR1")
    9006                      .dwattr $C$DW$916, DW_AT_TI_symbol_name("_ADCSOCOVFCLR1")
    9007                      .dwattr $C$DW$916, DW_AT_data_member_location[DW_OP_plus_uconst 0x661e]
    9008                      .dwattr $C$DW$916, DW_AT_accessibility(DW_ACCESS_public)
    9009              $C$DW$917       .dwtag  DW_TAG_member
    9010                      .dwattr $C$DW$917, DW_AT_type(*$C$DW$T$24)
    9011                      .dwattr $C$DW$917, DW_AT_name("rsvd_10")
    9012                      .dwattr $C$DW$917, DW_AT_TI_symbol_name("_rsvd_10")
    9013                      .dwattr $C$DW$917, DW_AT_data_member_location[DW_OP_plus_uconst 0x661f]
    9014                      .dwattr $C$DW$917, DW_AT_accessibility(DW_ACCESS_public)
    9015              $C$DW$918       .dwtag  DW_TAG_member
    9016                      .dwattr $C$DW$918, DW_AT_type(*$C$DW$T$25)
    9017                      .dwattr $C$DW$918, DW_AT_name("ADCSOCxCTL")
    9018                      .dwattr $C$DW$918, DW_AT_TI_symbol_name("_ADCSOCxCTL")
    9019                      .dwattr $C$DW$918, DW_AT_data_member_location[DW_OP_plus_uconst 0x6620]
    9020                      .dwattr $C$DW$918, DW_AT_accessibility(DW_ACCESS_public)
    9021              $C$DW$919       .dwtag  DW_TAG_member
    9022                      .dwattr $C$DW$919, DW_AT_type(*$C$DW$T$25)
    9023                      .dwattr $C$DW$919, DW_AT_name("rsvd_11")
    9024                      .dwattr $C$DW$919, DW_AT_TI_symbol_name("_rsvd_11")
    9025                      .dwattr $C$DW$919, DW_AT_data_member_location[DW_OP_plus_uconst 0x6630]
    9026                      .dwattr $C$DW$919, DW_AT_accessibility(DW_ACCESS_public)
    9027              $C$DW$920       .dwtag  DW_TAG_member
    9028                      .dwattr $C$DW$920, DW_AT_type(*$C$DW$T$24)
    9029                      .dwattr $C$DW$920, DW_AT_name("ADCREFTRIM")
    9030                      .dwattr $C$DW$920, DW_AT_TI_symbol_name("_ADCREFTRIM")
    9031                      .dwattr $C$DW$920, DW_AT_data_member_location[DW_OP_plus_uconst 0x6640]
    9032                      .dwattr $C$DW$920, DW_AT_accessibility(DW_ACCESS_public)
    9033              $C$DW$921       .dwtag  DW_TAG_member
    9034                      .dwattr $C$DW$921, DW_AT_type(*$C$DW$T$24)
    9035                      .dwattr $C$DW$921, DW_AT_name("ADCOFFTRIM")
    9036                      .dwattr $C$DW$921, DW_AT_TI_symbol_name("_ADCOFFTRIM")
    9037                      .dwattr $C$DW$921, DW_AT_data_member_location[DW_OP_plus_uconst 0x6641]
    9038                      .dwattr $C$DW$921, DW_AT_accessibility(DW_ACCESS_public)
    9039              $C$DW$922       .dwtag  DW_TAG_member
    9040                      .dwattr $C$DW$922, DW_AT_type(*$C$DW$T$30)
    9041                      .dwattr $C$DW$922, DW_AT_name("resvd_12")
    9042                      .dwattr $C$DW$922, DW_AT_TI_symbol_name("_resvd_12")
    9043                      .dwattr $C$DW$922, DW_AT_data_member_location[DW_OP_plus_uconst 0x6642]
    9044                      .dwattr $C$DW$922, DW_AT_accessibility(DW_ACCESS_public)
    9045              $C$DW$923       .dwtag  DW_TAG_member
    9046                      .dwattr $C$DW$923, DW_AT_type(*$C$DW$T$24)
    9047                      .dwattr $C$DW$923, DW_AT_name("ADCREV")
TMS320C2000 Assembler PC v6.2.5 Tue Sep 12 21:00:17 2017

Tools Copyright (c) 1996-2014 Texas Instruments Incorporated
C:\Users\wmj\AppData\Local\Temp\0425610                              PAGE  183

    9048                      .dwattr $C$DW$923, DW_AT_TI_symbol_name("_ADCREV")
    9049                      .dwattr $C$DW$923, DW_AT_data_member_location[DW_OP_plus_uconst 0x664f]
    9050                      .dwattr $C$DW$923, DW_AT_accessibility(DW_ACCESS_public)
    9051                      .dwendtag $C$DW$T$31
    9052              
    9053              $C$DW$T$192     .dwtag  DW_TAG_typedef, DW_AT_name("ADC_Obj")
    9054                      .dwattr $C$DW$T$192, DW_AT_type(*$C$DW$T$31)
    9055                      .dwattr $C$DW$T$192, DW_AT_language(DW_LANG_C)
    9056              $C$DW$T$58      .dwtag  DW_TAG_pointer_type
    9057                      .dwattr $C$DW$T$58, DW_AT_type(*$C$DW$T$31)
    9058                      .dwattr $C$DW$T$58, DW_AT_address_class(0x16)
    9059              $C$DW$T$59      .dwtag  DW_TAG_typedef, DW_AT_name("ADC_Handle")
    9060                      .dwattr $C$DW$T$59, DW_AT_type(*$C$DW$T$58)
    9061                      .dwattr $C$DW$T$59, DW_AT_language(DW_LANG_C)
    9062              
    9063              $C$DW$T$34      .dwtag  DW_TAG_structure_type
    9064                      .dwattr $C$DW$T$34, DW_AT_name("_CLARKE_Obj_")
    9065                      .dwattr $C$DW$T$34, DW_AT_byte_size(0x06)
    9066              $C$DW$924       .dwtag  DW_TAG_member
    9067                      .dwattr $C$DW$924, DW_AT_type(*$C$DW$T$32)
    9068                      .dwattr $C$DW$924, DW_AT_name("alpha_sf")
    9069                      .dwattr $C$DW$924, DW_AT_TI_symbol_name("_alpha_sf")
    9070                      .dwattr $C$DW$924, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    9071                      .dwattr $C$DW$924, DW_AT_accessibility(DW_ACCESS_public)
    9072              $C$DW$925       .dwtag  DW_TAG_member
    9073                      .dwattr $C$DW$925, DW_AT_type(*$C$DW$T$32)
    9074                      .dwattr $C$DW$925, DW_AT_name("beta_sf")
    9075                      .dwattr $C$DW$925, DW_AT_TI_symbol_name("_beta_sf")
    9076                      .dwattr $C$DW$925, DW_AT_data_member_location[DW_OP_plus_uconst 0x2]
    9077                      .dwattr $C$DW$925, DW_AT_accessibility(DW_ACCESS_public)
    9078              $C$DW$926       .dwtag  DW_TAG_member
    9079                      .dwattr $C$DW$926, DW_AT_type(*$C$DW$T$33)
    9080                      .dwattr $C$DW$926, DW_AT_name("numSensors")
    9081                      .dwattr $C$DW$926, DW_AT_TI_symbol_name("_numSensors")
    9082                      .dwattr $C$DW$926, DW_AT_data_member_location[DW_OP_plus_uconst 0x4]
    9083                      .dwattr $C$DW$926, DW_AT_accessibility(DW_ACCESS_public)
    9084                      .dwendtag $C$DW$T$34
    9085              
    9086              $C$DW$T$193     .dwtag  DW_TAG_typedef, DW_AT_name("CLARKE_Obj")
    9087                      .dwattr $C$DW$T$193, DW_AT_type(*$C$DW$T$34)
    9088                      .dwattr $C$DW$T$193, DW_AT_language(DW_LANG_C)
    9089              $C$DW$T$194     .dwtag  DW_TAG_pointer_type
    9090                      .dwattr $C$DW$T$194, DW_AT_type(*$C$DW$T$34)
    9091                      .dwattr $C$DW$T$194, DW_AT_address_class(0x16)
    9092              $C$DW$T$195     .dwtag  DW_TAG_typedef, DW_AT_name("CLARKE_Handle")
    9093                      .dwattr $C$DW$T$195, DW_AT_type(*$C$DW$T$194)
    9094                      .dwattr $C$DW$T$195, DW_AT_language(DW_LANG_C)
    9095              $C$DW$927       .dwtag  DW_TAG_TI_far_type
    9096                      .dwattr $C$DW$927, DW_AT_type(*$C$DW$T$195)
    9097              $C$DW$T$196     .dwtag  DW_TAG_const_type
    9098                      .dwattr $C$DW$T$196, DW_AT_type(*$C$DW$927)
    9099              
    9100              $C$DW$T$36      .dwtag  DW_TAG_structure_type
    9101                      .dwattr $C$DW$T$36, DW_AT_name("_CLK_Obj_")
    9102                      .dwattr $C$DW$T$36, DW_AT_byte_size(0x11)
TMS320C2000 Assembler PC v6.2.5 Tue Sep 12 21:00:17 2017

Tools Copyright (c) 1996-2014 Texas Instruments Incorporated
C:\Users\wmj\AppData\Local\Temp\0425610                              PAGE  184

    9103              $C$DW$928       .dwtag  DW_TAG_member
    9104                      .dwattr $C$DW$928, DW_AT_type(*$C$DW$T$24)
    9105                      .dwattr $C$DW$928, DW_AT_name("XCLK")
    9106                      .dwattr $C$DW$928, DW_AT_TI_symbol_name("_XCLK")
    9107                      .dwattr $C$DW$928, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    9108                      .dwattr $C$DW$928, DW_AT_accessibility(DW_ACCESS_public)
    9109              $C$DW$929       .dwtag  DW_TAG_member
    9110                      .dwattr $C$DW$929, DW_AT_type(*$C$DW$T$24)
    9111                      .dwattr $C$DW$929, DW_AT_name("rsvd_1")
    9112                      .dwattr $C$DW$929, DW_AT_TI_symbol_name("_rsvd_1")
    9113                      .dwattr $C$DW$929, DW_AT_data_member_location[DW_OP_plus_uconst 0x1]
    9114                      .dwattr $C$DW$929, DW_AT_accessibility(DW_ACCESS_public)
    9115              $C$DW$930       .dwtag  DW_TAG_member
    9116                      .dwattr $C$DW$930, DW_AT_type(*$C$DW$T$24)
    9117                      .dwattr $C$DW$930, DW_AT_name("CLKCTL")
    9118                      .dwattr $C$DW$930, DW_AT_TI_symbol_name("_CLKCTL")
    9119                      .dwattr $C$DW$930, DW_AT_data_member_location[DW_OP_plus_uconst 0x2]
    9120                      .dwattr $C$DW$930, DW_AT_accessibility(DW_ACCESS_public)
    9121              $C$DW$931       .dwtag  DW_TAG_member
    9122                      .dwattr $C$DW$931, DW_AT_type(*$C$DW$T$35)
    9123                      .dwattr $C$DW$931, DW_AT_name("rsvd_2")
    9124                      .dwattr $C$DW$931, DW_AT_TI_symbol_name("_rsvd_2")
    9125                      .dwattr $C$DW$931, DW_AT_data_member_location[DW_OP_plus_uconst 0x3]
    9126                      .dwattr $C$DW$931, DW_AT_accessibility(DW_ACCESS_public)
    9127              $C$DW$932       .dwtag  DW_TAG_member
    9128                      .dwattr $C$DW$932, DW_AT_type(*$C$DW$T$24)
    9129                      .dwattr $C$DW$932, DW_AT_name("LOSPCP")
    9130                      .dwattr $C$DW$932, DW_AT_TI_symbol_name("_LOSPCP")
    9131                      .dwattr $C$DW$932, DW_AT_data_member_location[DW_OP_plus_uconst 0xb]
    9132                      .dwattr $C$DW$932, DW_AT_accessibility(DW_ACCESS_public)
    9133              $C$DW$933       .dwtag  DW_TAG_member
    9134                      .dwattr $C$DW$933, DW_AT_type(*$C$DW$T$24)
    9135                      .dwattr $C$DW$933, DW_AT_name("PCLKCR0")
    9136                      .dwattr $C$DW$933, DW_AT_TI_symbol_name("_PCLKCR0")
    9137                      .dwattr $C$DW$933, DW_AT_data_member_location[DW_OP_plus_uconst 0xc]
    9138                      .dwattr $C$DW$933, DW_AT_accessibility(DW_ACCESS_public)
    9139              $C$DW$934       .dwtag  DW_TAG_member
    9140                      .dwattr $C$DW$934, DW_AT_type(*$C$DW$T$24)
    9141                      .dwattr $C$DW$934, DW_AT_name("PCLKCR1")
    9142                      .dwattr $C$DW$934, DW_AT_TI_symbol_name("_PCLKCR1")
    9143                      .dwattr $C$DW$934, DW_AT_data_member_location[DW_OP_plus_uconst 0xd]
    9144                      .dwattr $C$DW$934, DW_AT_accessibility(DW_ACCESS_public)
    9145              $C$DW$935       .dwtag  DW_TAG_member
    9146                      .dwattr $C$DW$935, DW_AT_type(*$C$DW$T$27)
    9147                      .dwattr $C$DW$935, DW_AT_name("rsvd_3")
    9148                      .dwattr $C$DW$935, DW_AT_TI_symbol_name("_rsvd_3")
    9149                      .dwattr $C$DW$935, DW_AT_data_member_location[DW_OP_plus_uconst 0xe]
    9150                      .dwattr $C$DW$935, DW_AT_accessibility(DW_ACCESS_public)
    9151              $C$DW$936       .dwtag  DW_TAG_member
    9152                      .dwattr $C$DW$936, DW_AT_type(*$C$DW$T$24)
    9153                      .dwattr $C$DW$936, DW_AT_name("PCLKCR3")
    9154                      .dwattr $C$DW$936, DW_AT_TI_symbol_name("_PCLKCR3")
    9155                      .dwattr $C$DW$936, DW_AT_data_member_location[DW_OP_plus_uconst 0x10]
    9156                      .dwattr $C$DW$936, DW_AT_accessibility(DW_ACCESS_public)
    9157                      .dwendtag $C$DW$T$36
TMS320C2000 Assembler PC v6.2.5 Tue Sep 12 21:00:17 2017

Tools Copyright (c) 1996-2014 Texas Instruments Incorporated
C:\Users\wmj\AppData\Local\Temp\0425610                              PAGE  185

    9158              
    9159              $C$DW$T$60      .dwtag  DW_TAG_pointer_type
    9160                      .dwattr $C$DW$T$60, DW_AT_type(*$C$DW$T$36)
    9161                      .dwattr $C$DW$T$60, DW_AT_address_class(0x16)
    9162              $C$DW$T$61      .dwtag  DW_TAG_typedef, DW_AT_name("CLK_Handle")
    9163                      .dwattr $C$DW$T$61, DW_AT_type(*$C$DW$T$60)
    9164                      .dwattr $C$DW$T$61, DW_AT_language(DW_LANG_C)
    9165              
    9166              $C$DW$T$37      .dwtag  DW_TAG_structure_type
    9167                      .dwattr $C$DW$T$37, DW_AT_name("_CPU_Obj_")
    9168                      .dwattr $C$DW$T$37, DW_AT_byte_size(0x01)
    9169              $C$DW$937       .dwtag  DW_TAG_member
    9170                      .dwattr $C$DW$937, DW_AT_type(*$C$DW$T$33)
    9171                      .dwattr $C$DW$937, DW_AT_name("tmp")
    9172                      .dwattr $C$DW$937, DW_AT_TI_symbol_name("_tmp")
    9173                      .dwattr $C$DW$937, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    9174                      .dwattr $C$DW$937, DW_AT_accessibility(DW_ACCESS_public)
    9175                      .dwendtag $C$DW$T$37
    9176              
    9177              $C$DW$T$62      .dwtag  DW_TAG_pointer_type
    9178                      .dwattr $C$DW$T$62, DW_AT_type(*$C$DW$T$37)
    9179                      .dwattr $C$DW$T$62, DW_AT_address_class(0x16)
    9180              $C$DW$T$63      .dwtag  DW_TAG_typedef, DW_AT_name("CPU_Handle")
    9181                      .dwattr $C$DW$T$63, DW_AT_type(*$C$DW$T$62)
    9182                      .dwattr $C$DW$T$63, DW_AT_language(DW_LANG_C)
    9183              
    9184              $C$DW$T$40      .dwtag  DW_TAG_structure_type
    9185                      .dwattr $C$DW$T$40, DW_AT_name("_CPU_TIME_Obj_")
    9186                      .dwattr $C$DW$T$40, DW_AT_byte_size(0x18)
    9187              $C$DW$938       .dwtag  DW_TAG_member
    9188                      .dwattr $C$DW$938, DW_AT_type(*$C$DW$T$23)
    9189                      .dwattr $C$DW$938, DW_AT_name("pwm_period")
    9190                      .dwattr $C$DW$938, DW_AT_TI_symbol_name("_pwm_period")
    9191                      .dwattr $C$DW$938, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    9192                      .dwattr $C$DW$938, DW_AT_accessibility(DW_ACCESS_public)
    9193              $C$DW$939       .dwtag  DW_TAG_member
    9194                      .dwattr $C$DW$939, DW_AT_type(*$C$DW$T$38)
    9195                      .dwattr $C$DW$939, DW_AT_name("timer_cnt_now")
    9196                      .dwattr $C$DW$939, DW_AT_TI_symbol_name("_timer_cnt_now")
    9197                      .dwattr $C$DW$939, DW_AT_data_member_location[DW_OP_plus_uconst 0x2]
    9198                      .dwattr $C$DW$939, DW_AT_accessibility(DW_ACCESS_public)
    9199              $C$DW$940       .dwtag  DW_TAG_member
    9200                      .dwattr $C$DW$940, DW_AT_type(*$C$DW$T$38)
    9201                      .dwattr $C$DW$940, DW_AT_name("timer_cnt_prev")
    9202                      .dwattr $C$DW$940, DW_AT_TI_symbol_name("_timer_cnt_prev")
    9203                      .dwattr $C$DW$940, DW_AT_data_member_location[DW_OP_plus_uconst 0x4]
    9204                      .dwattr $C$DW$940, DW_AT_accessibility(DW_ACCESS_public)
    9205              $C$DW$941       .dwtag  DW_TAG_member
    9206                      .dwattr $C$DW$941, DW_AT_type(*$C$DW$T$38)
    9207                      .dwattr $C$DW$941, DW_AT_name("timer_delta_now")
    9208                      .dwattr $C$DW$941, DW_AT_TI_symbol_name("_timer_delta_now")
    9209                      .dwattr $C$DW$941, DW_AT_data_member_location[DW_OP_plus_uconst 0x6]
    9210                      .dwattr $C$DW$941, DW_AT_accessibility(DW_ACCESS_public)
    9211              $C$DW$942       .dwtag  DW_TAG_member
    9212                      .dwattr $C$DW$942, DW_AT_type(*$C$DW$T$38)
TMS320C2000 Assembler PC v6.2.5 Tue Sep 12 21:00:17 2017

Tools Copyright (c) 1996-2014 Texas Instruments Incorporated
C:\Users\wmj\AppData\Local\Temp\0425610                              PAGE  186

    9213                      .dwattr $C$DW$942, DW_AT_name("timer_delta_prev")
    9214                      .dwattr $C$DW$942, DW_AT_TI_symbol_name("_timer_delta_prev")
    9215                      .dwattr $C$DW$942, DW_AT_data_member_location[DW_OP_plus_uconst 0x8]
    9216                      .dwattr $C$DW$942, DW_AT_accessibility(DW_ACCESS_public)
    9217              $C$DW$943       .dwtag  DW_TAG_member
    9218                      .dwattr $C$DW$943, DW_AT_type(*$C$DW$T$38)
    9219                      .dwattr $C$DW$943, DW_AT_name("timer_delta_min")
    9220                      .dwattr $C$DW$943, DW_AT_TI_symbol_name("_timer_delta_min")
    9221                      .dwattr $C$DW$943, DW_AT_data_member_location[DW_OP_plus_uconst 0xa]
    9222                      .dwattr $C$DW$943, DW_AT_accessibility(DW_ACCESS_public)
    9223              $C$DW$944       .dwtag  DW_TAG_member
    9224                      .dwattr $C$DW$944, DW_AT_type(*$C$DW$T$38)
    9225                      .dwattr $C$DW$944, DW_AT_name("timer_delta_max")
    9226                      .dwattr $C$DW$944, DW_AT_TI_symbol_name("_timer_delta_max")
    9227                      .dwattr $C$DW$944, DW_AT_data_member_location[DW_OP_plus_uconst 0xc]
    9228                      .dwattr $C$DW$944, DW_AT_accessibility(DW_ACCESS_public)
    9229              $C$DW$945       .dwtag  DW_TAG_member
    9230                      .dwattr $C$DW$945, DW_AT_type(*$C$DW$T$38)
    9231                      .dwattr $C$DW$945, DW_AT_name("timer_delta_avg")
    9232                      .dwattr $C$DW$945, DW_AT_TI_symbol_name("_timer_delta_avg")
    9233                      .dwattr $C$DW$945, DW_AT_data_member_location[DW_OP_plus_uconst 0xe]
    9234                      .dwattr $C$DW$945, DW_AT_accessibility(DW_ACCESS_public)
    9235              $C$DW$946       .dwtag  DW_TAG_member
    9236                      .dwattr $C$DW$946, DW_AT_type(*$C$DW$T$38)
    9237                      .dwattr $C$DW$946, DW_AT_name("timer_band_max")
    9238                      .dwattr $C$DW$946, DW_AT_TI_symbol_name("_timer_band_max")
    9239                      .dwattr $C$DW$946, DW_AT_data_member_location[DW_OP_plus_uconst 0x10]
    9240                      .dwattr $C$DW$946, DW_AT_accessibility(DW_ACCESS_public)
    9241              $C$DW$947       .dwtag  DW_TAG_member
    9242                      .dwattr $C$DW$947, DW_AT_type(*$C$DW$T$38)
    9243                      .dwattr $C$DW$947, DW_AT_name("timer_delta_CntAcc")
    9244                      .dwattr $C$DW$947, DW_AT_TI_symbol_name("_timer_delta_CntAcc")
    9245                      .dwattr $C$DW$947, DW_AT_data_member_location[DW_OP_plus_uconst 0x12]
    9246                      .dwattr $C$DW$947, DW_AT_accessibility(DW_ACCESS_public)
    9247              $C$DW$948       .dwtag  DW_TAG_member
    9248                      .dwattr $C$DW$948, DW_AT_type(*$C$DW$T$38)
    9249                      .dwattr $C$DW$948, DW_AT_name("timer_delta_AccNum")
    9250                      .dwattr $C$DW$948, DW_AT_TI_symbol_name("_timer_delta_AccNum")
    9251                      .dwattr $C$DW$948, DW_AT_data_member_location[DW_OP_plus_uconst 0x14]
    9252                      .dwattr $C$DW$948, DW_AT_accessibility(DW_ACCESS_public)
    9253              $C$DW$949       .dwtag  DW_TAG_member
    9254                      .dwattr $C$DW$949, DW_AT_type(*$C$DW$T$39)
    9255                      .dwattr $C$DW$949, DW_AT_name("flag_resetStatus")
    9256                      .dwattr $C$DW$949, DW_AT_TI_symbol_name("_flag_resetStatus")
    9257                      .dwattr $C$DW$949, DW_AT_data_member_location[DW_OP_plus_uconst 0x16]
    9258                      .dwattr $C$DW$949, DW_AT_accessibility(DW_ACCESS_public)
    9259                      .dwendtag $C$DW$T$40
    9260              
    9261              $C$DW$T$203     .dwtag  DW_TAG_typedef, DW_AT_name("CPU_TIME_Obj")
    9262                      .dwattr $C$DW$T$203, DW_AT_type(*$C$DW$T$40)
    9263                      .dwattr $C$DW$T$203, DW_AT_language(DW_LANG_C)
    9264              $C$DW$T$204     .dwtag  DW_TAG_pointer_type
    9265                      .dwattr $C$DW$T$204, DW_AT_type(*$C$DW$T$203)
    9266                      .dwattr $C$DW$T$204, DW_AT_address_class(0x16)
    9267              $C$DW$T$205     .dwtag  DW_TAG_pointer_type
TMS320C2000 Assembler PC v6.2.5 Tue Sep 12 21:00:17 2017

Tools Copyright (c) 1996-2014 Texas Instruments Incorporated
C:\Users\wmj\AppData\Local\Temp\0425610                              PAGE  187

    9268                      .dwattr $C$DW$T$205, DW_AT_type(*$C$DW$T$40)
    9269                      .dwattr $C$DW$T$205, DW_AT_address_class(0x16)
    9270              $C$DW$T$206     .dwtag  DW_TAG_typedef, DW_AT_name("CPU_TIME_Handle")
    9271                      .dwattr $C$DW$T$206, DW_AT_type(*$C$DW$T$205)
    9272                      .dwattr $C$DW$T$206, DW_AT_language(DW_LANG_C)
    9273              
    9274              $C$DW$T$43      .dwtag  DW_TAG_structure_type
    9275                      .dwattr $C$DW$T$43, DW_AT_name("_CTRL_Version_")
    9276                      .dwattr $C$DW$T$43, DW_AT_byte_size(0x04)
    9277              $C$DW$950       .dwtag  DW_TAG_member
    9278                      .dwattr $C$DW$950, DW_AT_type(*$C$DW$T$23)
    9279                      .dwattr $C$DW$950, DW_AT_name("rsvd")
    9280                      .dwattr $C$DW$950, DW_AT_TI_symbol_name("_rsvd")
    9281                      .dwattr $C$DW$950, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    9282                      .dwattr $C$DW$950, DW_AT_accessibility(DW_ACCESS_public)
    9283              $C$DW$951       .dwtag  DW_TAG_member
    9284                      .dwattr $C$DW$951, DW_AT_type(*$C$DW$T$42)
    9285                      .dwattr $C$DW$951, DW_AT_name("targetProc")
    9286                      .dwattr $C$DW$951, DW_AT_TI_symbol_name("_targetProc")
    9287                      .dwattr $C$DW$951, DW_AT_data_member_location[DW_OP_plus_uconst 0x1]
    9288                      .dwattr $C$DW$951, DW_AT_accessibility(DW_ACCESS_public)
    9289              $C$DW$952       .dwtag  DW_TAG_member
    9290                      .dwattr $C$DW$952, DW_AT_type(*$C$DW$T$23)
    9291                      .dwattr $C$DW$952, DW_AT_name("major")
    9292                      .dwattr $C$DW$952, DW_AT_TI_symbol_name("_major")
    9293                      .dwattr $C$DW$952, DW_AT_data_member_location[DW_OP_plus_uconst 0x2]
    9294                      .dwattr $C$DW$952, DW_AT_accessibility(DW_ACCESS_public)
    9295              $C$DW$953       .dwtag  DW_TAG_member
    9296                      .dwattr $C$DW$953, DW_AT_type(*$C$DW$T$23)
    9297                      .dwattr $C$DW$953, DW_AT_name("minor")
    9298                      .dwattr $C$DW$953, DW_AT_TI_symbol_name("_minor")
    9299                      .dwattr $C$DW$953, DW_AT_data_member_location[DW_OP_plus_uconst 0x3]
    9300                      .dwattr $C$DW$953, DW_AT_accessibility(DW_ACCESS_public)
    9301                      .dwendtag $C$DW$T$43
    9302              
    9303              $C$DW$T$109     .dwtag  DW_TAG_typedef, DW_AT_name("CTRL_Version")
    9304                      .dwattr $C$DW$T$109, DW_AT_type(*$C$DW$T$43)
    9305                      .dwattr $C$DW$T$109, DW_AT_language(DW_LANG_C)
    9306              
    9307              $C$DW$T$20      .dwtag  DW_TAG_structure_type
    9308                      .dwattr $C$DW$T$20, DW_AT_name("_EST_Obj_")
    9309                      .dwattr $C$DW$T$20, DW_AT_declaration
    9310                      .dwendtag $C$DW$T$20
    9311              
    9312              $C$DW$T$156     .dwtag  DW_TAG_pointer_type
    9313                      .dwattr $C$DW$T$156, DW_AT_type(*$C$DW$T$20)
    9314                      .dwattr $C$DW$T$156, DW_AT_address_class(0x16)
    9315              $C$DW$T$157     .dwtag  DW_TAG_typedef, DW_AT_name("EST_Handle")
    9316                      .dwattr $C$DW$T$157, DW_AT_type(*$C$DW$T$156)
    9317                      .dwattr $C$DW$T$157, DW_AT_language(DW_LANG_C)
    9318              $C$DW$954       .dwtag  DW_TAG_TI_far_type
    9319                      .dwattr $C$DW$954, DW_AT_type(*$C$DW$T$157)
    9320              $C$DW$T$210     .dwtag  DW_TAG_const_type
    9321                      .dwattr $C$DW$T$210, DW_AT_type(*$C$DW$954)
    9322              
TMS320C2000 Assembler PC v6.2.5 Tue Sep 12 21:00:17 2017

Tools Copyright (c) 1996-2014 Texas Instruments Incorporated
C:\Users\wmj\AppData\Local\Temp\0425610                              PAGE  188

    9323              $C$DW$T$44      .dwtag  DW_TAG_structure_type
    9324                      .dwattr $C$DW$T$44, DW_AT_name("_FILTER_FO_")
    9325                      .dwattr $C$DW$T$44, DW_AT_byte_size(0x0a)
    9326              $C$DW$955       .dwtag  DW_TAG_member
    9327                      .dwattr $C$DW$955, DW_AT_type(*$C$DW$T$32)
    9328                      .dwattr $C$DW$955, DW_AT_name("a1")
    9329                      .dwattr $C$DW$955, DW_AT_TI_symbol_name("_a1")
    9330                      .dwattr $C$DW$955, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    9331                      .dwattr $C$DW$955, DW_AT_accessibility(DW_ACCESS_public)
    9332              $C$DW$956       .dwtag  DW_TAG_member
    9333                      .dwattr $C$DW$956, DW_AT_type(*$C$DW$T$32)
    9334                      .dwattr $C$DW$956, DW_AT_name("b0")
    9335                      .dwattr $C$DW$956, DW_AT_TI_symbol_name("_b0")
    9336                      .dwattr $C$DW$956, DW_AT_data_member_location[DW_OP_plus_uconst 0x2]
    9337                      .dwattr $C$DW$956, DW_AT_accessibility(DW_ACCESS_public)
    9338              $C$DW$957       .dwtag  DW_TAG_member
    9339                      .dwattr $C$DW$957, DW_AT_type(*$C$DW$T$32)
    9340                      .dwattr $C$DW$957, DW_AT_name("b1")
    9341                      .dwattr $C$DW$957, DW_AT_TI_symbol_name("_b1")
    9342                      .dwattr $C$DW$957, DW_AT_data_member_location[DW_OP_plus_uconst 0x4]
    9343                      .dwattr $C$DW$957, DW_AT_accessibility(DW_ACCESS_public)
    9344              $C$DW$958       .dwtag  DW_TAG_member
    9345                      .dwattr $C$DW$958, DW_AT_type(*$C$DW$T$32)
    9346                      .dwattr $C$DW$958, DW_AT_name("x1")
    9347                      .dwattr $C$DW$958, DW_AT_TI_symbol_name("_x1")
    9348                      .dwattr $C$DW$958, DW_AT_data_member_location[DW_OP_plus_uconst 0x6]
    9349                      .dwattr $C$DW$958, DW_AT_accessibility(DW_ACCESS_public)
    9350              $C$DW$959       .dwtag  DW_TAG_member
    9351                      .dwattr $C$DW$959, DW_AT_type(*$C$DW$T$32)
    9352                      .dwattr $C$DW$959, DW_AT_name("y1")
    9353                      .dwattr $C$DW$959, DW_AT_TI_symbol_name("_y1")
    9354                      .dwattr $C$DW$959, DW_AT_data_member_location[DW_OP_plus_uconst 0x8]
    9355                      .dwattr $C$DW$959, DW_AT_accessibility(DW_ACCESS_public)
    9356                      .dwendtag $C$DW$T$44
    9357              
    9358              $C$DW$T$112     .dwtag  DW_TAG_typedef, DW_AT_name("FILTER_FO_Obj")
    9359                      .dwattr $C$DW$T$112, DW_AT_type(*$C$DW$T$44)
    9360                      .dwattr $C$DW$T$112, DW_AT_language(DW_LANG_C)
    9361              
    9362              $C$DW$T$215     .dwtag  DW_TAG_array_type
    9363                      .dwattr $C$DW$T$215, DW_AT_type(*$C$DW$T$112)
    9364                      .dwattr $C$DW$T$215, DW_AT_language(DW_LANG_C)
    9365                      .dwattr $C$DW$T$215, DW_AT_byte_size(0x3c)
    9366              $C$DW$960       .dwtag  DW_TAG_subrange_type
    9367                      .dwattr $C$DW$960, DW_AT_upper_bound(0x05)
    9368                      .dwendtag $C$DW$T$215
    9369              
    9370              $C$DW$T$216     .dwtag  DW_TAG_pointer_type
    9371                      .dwattr $C$DW$T$216, DW_AT_type(*$C$DW$T$112)
    9372                      .dwattr $C$DW$T$216, DW_AT_address_class(0x16)
    9373              
    9374              $C$DW$T$21      .dwtag  DW_TAG_structure_type
    9375                      .dwattr $C$DW$T$21, DW_AT_name("_FILTER_FO_Obj_")
    9376                      .dwattr $C$DW$T$21, DW_AT_declaration
    9377                      .dwendtag $C$DW$T$21
TMS320C2000 Assembler PC v6.2.5 Tue Sep 12 21:00:17 2017

Tools Copyright (c) 1996-2014 Texas Instruments Incorporated
C:\Users\wmj\AppData\Local\Temp\0425610                              PAGE  189

    9378              
    9379              $C$DW$T$113     .dwtag  DW_TAG_pointer_type
    9380                      .dwattr $C$DW$T$113, DW_AT_type(*$C$DW$T$21)
    9381                      .dwattr $C$DW$T$113, DW_AT_address_class(0x16)
    9382              $C$DW$T$114     .dwtag  DW_TAG_typedef, DW_AT_name("FILTER_FO_Handle")
    9383                      .dwattr $C$DW$T$114, DW_AT_type(*$C$DW$T$113)
    9384                      .dwattr $C$DW$T$114, DW_AT_language(DW_LANG_C)
    9385              
    9386              $C$DW$T$220     .dwtag  DW_TAG_array_type
    9387                      .dwattr $C$DW$T$220, DW_AT_type(*$C$DW$T$114)
    9388                      .dwattr $C$DW$T$220, DW_AT_language(DW_LANG_C)
    9389                      .dwattr $C$DW$T$220, DW_AT_byte_size(0x0c)
    9390              $C$DW$961       .dwtag  DW_TAG_subrange_type
    9391                      .dwattr $C$DW$961, DW_AT_upper_bound(0x05)
    9392                      .dwendtag $C$DW$T$220
    9393              
    9394              
    9395              $C$DW$T$45      .dwtag  DW_TAG_structure_type
    9396                      .dwattr $C$DW$T$45, DW_AT_name("_FLASH_Obj_")
    9397                      .dwattr $C$DW$T$45, DW_AT_byte_size(0x08)
    9398              $C$DW$962       .dwtag  DW_TAG_member
    9399                      .dwattr $C$DW$962, DW_AT_type(*$C$DW$T$24)
    9400                      .dwattr $C$DW$962, DW_AT_name("FOPT")
    9401                      .dwattr $C$DW$962, DW_AT_TI_symbol_name("_FOPT")
    9402                      .dwattr $C$DW$962, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    9403                      .dwattr $C$DW$962, DW_AT_accessibility(DW_ACCESS_public)
    9404              $C$DW$963       .dwtag  DW_TAG_member
    9405                      .dwattr $C$DW$963, DW_AT_type(*$C$DW$T$24)
    9406                      .dwattr $C$DW$963, DW_AT_name("rsvd_1")
    9407                      .dwattr $C$DW$963, DW_AT_TI_symbol_name("_rsvd_1")
    9408                      .dwattr $C$DW$963, DW_AT_data_member_location[DW_OP_plus_uconst 0x1]
    9409                      .dwattr $C$DW$963, DW_AT_accessibility(DW_ACCESS_public)
    9410              $C$DW$964       .dwtag  DW_TAG_member
    9411                      .dwattr $C$DW$964, DW_AT_type(*$C$DW$T$24)
    9412                      .dwattr $C$DW$964, DW_AT_name("FPWR")
    9413                      .dwattr $C$DW$964, DW_AT_TI_symbol_name("_FPWR")
    9414                      .dwattr $C$DW$964, DW_AT_data_member_location[DW_OP_plus_uconst 0x2]
    9415                      .dwattr $C$DW$964, DW_AT_accessibility(DW_ACCESS_public)
    9416              $C$DW$965       .dwtag  DW_TAG_member
    9417                      .dwattr $C$DW$965, DW_AT_type(*$C$DW$T$24)
    9418                      .dwattr $C$DW$965, DW_AT_name("FSTATUS")
    9419                      .dwattr $C$DW$965, DW_AT_TI_symbol_name("_FSTATUS")
    9420                      .dwattr $C$DW$965, DW_AT_data_member_location[DW_OP_plus_uconst 0x3]
    9421                      .dwattr $C$DW$965, DW_AT_accessibility(DW_ACCESS_public)
    9422              $C$DW$966       .dwtag  DW_TAG_member
    9423                      .dwattr $C$DW$966, DW_AT_type(*$C$DW$T$24)
    9424                      .dwattr $C$DW$966, DW_AT_name("FSTDBYWAIT")
    9425                      .dwattr $C$DW$966, DW_AT_TI_symbol_name("_FSTDBYWAIT")
    9426                      .dwattr $C$DW$966, DW_AT_data_member_location[DW_OP_plus_uconst 0x4]
    9427                      .dwattr $C$DW$966, DW_AT_accessibility(DW_ACCESS_public)
    9428              $C$DW$967       .dwtag  DW_TAG_member
    9429                      .dwattr $C$DW$967, DW_AT_type(*$C$DW$T$24)
    9430                      .dwattr $C$DW$967, DW_AT_name("FACTIVEWAIT")
    9431                      .dwattr $C$DW$967, DW_AT_TI_symbol_name("_FACTIVEWAIT")
    9432                      .dwattr $C$DW$967, DW_AT_data_member_location[DW_OP_plus_uconst 0x5]
TMS320C2000 Assembler PC v6.2.5 Tue Sep 12 21:00:17 2017

Tools Copyright (c) 1996-2014 Texas Instruments Incorporated
C:\Users\wmj\AppData\Local\Temp\0425610                              PAGE  190

    9433                      .dwattr $C$DW$967, DW_AT_accessibility(DW_ACCESS_public)
    9434              $C$DW$968       .dwtag  DW_TAG_member
    9435                      .dwattr $C$DW$968, DW_AT_type(*$C$DW$T$24)
    9436                      .dwattr $C$DW$968, DW_AT_name("FBANKWAIT")
    9437                      .dwattr $C$DW$968, DW_AT_TI_symbol_name("_FBANKWAIT")
    9438                      .dwattr $C$DW$968, DW_AT_data_member_location[DW_OP_plus_uconst 0x6]
    9439                      .dwattr $C$DW$968, DW_AT_accessibility(DW_ACCESS_public)
    9440              $C$DW$969       .dwtag  DW_TAG_member
    9441                      .dwattr $C$DW$969, DW_AT_type(*$C$DW$T$24)
    9442                      .dwattr $C$DW$969, DW_AT_name("FOTPWAIT")
    9443                      .dwattr $C$DW$969, DW_AT_TI_symbol_name("_FOTPWAIT")
    9444                      .dwattr $C$DW$969, DW_AT_data_member_location[DW_OP_plus_uconst 0x7]
    9445                      .dwattr $C$DW$969, DW_AT_accessibility(DW_ACCESS_public)
    9446                      .dwendtag $C$DW$T$45
    9447              
    9448              $C$DW$T$64      .dwtag  DW_TAG_pointer_type
    9449                      .dwattr $C$DW$T$64, DW_AT_type(*$C$DW$T$45)
    9450                      .dwattr $C$DW$T$64, DW_AT_address_class(0x16)
    9451              $C$DW$T$65      .dwtag  DW_TAG_typedef, DW_AT_name("FLASH_Handle")
    9452                      .dwattr $C$DW$T$65, DW_AT_type(*$C$DW$T$64)
    9453                      .dwattr $C$DW$T$65, DW_AT_language(DW_LANG_C)
    9454              
    9455              $C$DW$T$46      .dwtag  DW_TAG_structure_type
    9456                      .dwattr $C$DW$T$46, DW_AT_name("_FW_Obj_")
    9457                      .dwattr $C$DW$T$46, DW_AT_byte_size(0x14)
    9458              $C$DW$970       .dwtag  DW_TAG_member
    9459                      .dwattr $C$DW$970, DW_AT_type(*$C$DW$T$38)
    9460                      .dwattr $C$DW$970, DW_AT_name("numIsrTicksPerFwTick")
    9461                      .dwattr $C$DW$970, DW_AT_TI_symbol_name("_numIsrTicksPerFwTick")
    9462                      .dwattr $C$DW$970, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    9463                      .dwattr $C$DW$970, DW_AT_accessibility(DW_ACCESS_public)
    9464              $C$DW$971       .dwtag  DW_TAG_member
    9465                      .dwattr $C$DW$971, DW_AT_type(*$C$DW$T$38)
    9466                      .dwattr $C$DW$971, DW_AT_name("counter_fw")
    9467                      .dwattr $C$DW$971, DW_AT_TI_symbol_name("_counter_fw")
    9468                      .dwattr $C$DW$971, DW_AT_data_member_location[DW_OP_plus_uconst 0x2]
    9469                      .dwattr $C$DW$971, DW_AT_accessibility(DW_ACCESS_public)
    9470              $C$DW$972       .dwtag  DW_TAG_member
    9471                      .dwattr $C$DW$972, DW_AT_type(*$C$DW$T$32)
    9472                      .dwattr $C$DW$972, DW_AT_name("delta_inc")
    9473                      .dwattr $C$DW$972, DW_AT_TI_symbol_name("_delta_inc")
    9474                      .dwattr $C$DW$972, DW_AT_data_member_location[DW_OP_plus_uconst 0x4]
    9475                      .dwattr $C$DW$972, DW_AT_accessibility(DW_ACCESS_public)
    9476              $C$DW$973       .dwtag  DW_TAG_member
    9477                      .dwattr $C$DW$973, DW_AT_type(*$C$DW$T$32)
    9478                      .dwattr $C$DW$973, DW_AT_name("delta_dec")
    9479                      .dwattr $C$DW$973, DW_AT_TI_symbol_name("_delta_dec")
    9480                      .dwattr $C$DW$973, DW_AT_data_member_location[DW_OP_plus_uconst 0x6]
    9481                      .dwattr $C$DW$973, DW_AT_accessibility(DW_ACCESS_public)
    9482              $C$DW$974       .dwtag  DW_TAG_member
    9483                      .dwattr $C$DW$974, DW_AT_type(*$C$DW$T$32)
    9484                      .dwattr $C$DW$974, DW_AT_name("refValue")
    9485                      .dwattr $C$DW$974, DW_AT_TI_symbol_name("_refValue")
    9486                      .dwattr $C$DW$974, DW_AT_data_member_location[DW_OP_plus_uconst 0x8]
    9487                      .dwattr $C$DW$974, DW_AT_accessibility(DW_ACCESS_public)
TMS320C2000 Assembler PC v6.2.5 Tue Sep 12 21:00:17 2017

Tools Copyright (c) 1996-2014 Texas Instruments Incorporated
C:\Users\wmj\AppData\Local\Temp\0425610                              PAGE  191

    9488              $C$DW$975       .dwtag  DW_TAG_member
    9489                      .dwattr $C$DW$975, DW_AT_type(*$C$DW$T$32)
    9490                      .dwattr $C$DW$975, DW_AT_name("fbackValue")
    9491                      .dwattr $C$DW$975, DW_AT_TI_symbol_name("_fbackValue")
    9492                      .dwattr $C$DW$975, DW_AT_data_member_location[DW_OP_plus_uconst 0xa]
    9493                      .dwattr $C$DW$975, DW_AT_accessibility(DW_ACCESS_public)
    9494              $C$DW$976       .dwtag  DW_TAG_member
    9495                      .dwattr $C$DW$976, DW_AT_type(*$C$DW$T$32)
    9496                      .dwattr $C$DW$976, DW_AT_name("output")
    9497                      .dwattr $C$DW$976, DW_AT_TI_symbol_name("_output")
    9498                      .dwattr $C$DW$976, DW_AT_data_member_location[DW_OP_plus_uconst 0xc]
    9499                      .dwattr $C$DW$976, DW_AT_accessibility(DW_ACCESS_public)
    9500              $C$DW$977       .dwtag  DW_TAG_member
    9501                      .dwattr $C$DW$977, DW_AT_type(*$C$DW$T$32)
    9502                      .dwattr $C$DW$977, DW_AT_name("outMin")
    9503                      .dwattr $C$DW$977, DW_AT_TI_symbol_name("_outMin")
    9504                      .dwattr $C$DW$977, DW_AT_data_member_location[DW_OP_plus_uconst 0xe]
    9505                      .dwattr $C$DW$977, DW_AT_accessibility(DW_ACCESS_public)
    9506              $C$DW$978       .dwtag  DW_TAG_member
    9507                      .dwattr $C$DW$978, DW_AT_type(*$C$DW$T$32)
    9508                      .dwattr $C$DW$978, DW_AT_name("outMax")
    9509                      .dwattr $C$DW$978, DW_AT_TI_symbol_name("_outMax")
    9510                      .dwattr $C$DW$978, DW_AT_data_member_location[DW_OP_plus_uconst 0x10]
    9511                      .dwattr $C$DW$978, DW_AT_accessibility(DW_ACCESS_public)
    9512              $C$DW$979       .dwtag  DW_TAG_member
    9513                      .dwattr $C$DW$979, DW_AT_type(*$C$DW$T$39)
    9514                      .dwattr $C$DW$979, DW_AT_name("flag_enableFw")
    9515                      .dwattr $C$DW$979, DW_AT_TI_symbol_name("_flag_enableFw")
    9516                      .dwattr $C$DW$979, DW_AT_data_member_location[DW_OP_plus_uconst 0x12]
    9517                      .dwattr $C$DW$979, DW_AT_accessibility(DW_ACCESS_public)
    9518                      .dwendtag $C$DW$T$46
    9519              
    9520              $C$DW$T$225     .dwtag  DW_TAG_typedef, DW_AT_name("FW_Obj")
    9521                      .dwattr $C$DW$T$225, DW_AT_type(*$C$DW$T$46)
    9522                      .dwattr $C$DW$T$225, DW_AT_language(DW_LANG_C)
    9523              $C$DW$T$226     .dwtag  DW_TAG_pointer_type
    9524                      .dwattr $C$DW$T$226, DW_AT_type(*$C$DW$T$225)
    9525                      .dwattr $C$DW$T$226, DW_AT_address_class(0x16)
    9526              $C$DW$T$227     .dwtag  DW_TAG_pointer_type
    9527                      .dwattr $C$DW$T$227, DW_AT_type(*$C$DW$T$46)
    9528                      .dwattr $C$DW$T$227, DW_AT_address_class(0x16)
    9529              $C$DW$T$228     .dwtag  DW_TAG_typedef, DW_AT_name("FW_Handle")
    9530                      .dwattr $C$DW$T$228, DW_AT_type(*$C$DW$T$227)
    9531                      .dwattr $C$DW$T$228, DW_AT_language(DW_LANG_C)
    9532              
    9533              $C$DW$T$50      .dwtag  DW_TAG_structure_type
    9534                      .dwattr $C$DW$T$50, DW_AT_name("_GPIO_Obj_")
    9535                      .dwattr $C$DW$T$50, DW_AT_byte_size(0x6a)
    9536              $C$DW$980       .dwtag  DW_TAG_member
    9537                      .dwattr $C$DW$980, DW_AT_type(*$C$DW$T$47)
    9538                      .dwattr $C$DW$980, DW_AT_name("GPACTRL")
    9539                      .dwattr $C$DW$980, DW_AT_TI_symbol_name("_GPACTRL")
    9540                      .dwattr $C$DW$980, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    9541                      .dwattr $C$DW$980, DW_AT_accessibility(DW_ACCESS_public)
    9542              $C$DW$981       .dwtag  DW_TAG_member
TMS320C2000 Assembler PC v6.2.5 Tue Sep 12 21:00:17 2017

Tools Copyright (c) 1996-2014 Texas Instruments Incorporated
C:\Users\wmj\AppData\Local\Temp\0425610                              PAGE  192

    9543                      .dwattr $C$DW$981, DW_AT_type(*$C$DW$T$47)
    9544                      .dwattr $C$DW$981, DW_AT_name("GPAQSEL1")
    9545                      .dwattr $C$DW$981, DW_AT_TI_symbol_name("_GPAQSEL1")
    9546                      .dwattr $C$DW$981, DW_AT_data_member_location[DW_OP_plus_uconst 0x2]
    9547                      .dwattr $C$DW$981, DW_AT_accessibility(DW_ACCESS_public)
    9548              $C$DW$982       .dwtag  DW_TAG_member
    9549                      .dwattr $C$DW$982, DW_AT_type(*$C$DW$T$47)
    9550                      .dwattr $C$DW$982, DW_AT_name("GPAQSEL2")
    9551                      .dwattr $C$DW$982, DW_AT_TI_symbol_name("_GPAQSEL2")
    9552                      .dwattr $C$DW$982, DW_AT_data_member_location[DW_OP_plus_uconst 0x4]
    9553                      .dwattr $C$DW$982, DW_AT_accessibility(DW_ACCESS_public)
    9554              $C$DW$983       .dwtag  DW_TAG_member
    9555                      .dwattr $C$DW$983, DW_AT_type(*$C$DW$T$47)
    9556                      .dwattr $C$DW$983, DW_AT_name("GPAMUX1")
    9557                      .dwattr $C$DW$983, DW_AT_TI_symbol_name("_GPAMUX1")
    9558                      .dwattr $C$DW$983, DW_AT_data_member_location[DW_OP_plus_uconst 0x6]
    9559                      .dwattr $C$DW$983, DW_AT_accessibility(DW_ACCESS_public)
    9560              $C$DW$984       .dwtag  DW_TAG_member
    9561                      .dwattr $C$DW$984, DW_AT_type(*$C$DW$T$47)
    9562                      .dwattr $C$DW$984, DW_AT_name("GPAMUX2")
    9563                      .dwattr $C$DW$984, DW_AT_TI_symbol_name("_GPAMUX2")
    9564                      .dwattr $C$DW$984, DW_AT_data_member_location[DW_OP_plus_uconst 0x8]
    9565                      .dwattr $C$DW$984, DW_AT_accessibility(DW_ACCESS_public)
    9566              $C$DW$985       .dwtag  DW_TAG_member
    9567                      .dwattr $C$DW$985, DW_AT_type(*$C$DW$T$47)
    9568                      .dwattr $C$DW$985, DW_AT_name("GPADIR")
    9569                      .dwattr $C$DW$985, DW_AT_TI_symbol_name("_GPADIR")
    9570                      .dwattr $C$DW$985, DW_AT_data_member_location[DW_OP_plus_uconst 0xa]
    9571                      .dwattr $C$DW$985, DW_AT_accessibility(DW_ACCESS_public)
    9572              $C$DW$986       .dwtag  DW_TAG_member
    9573                      .dwattr $C$DW$986, DW_AT_type(*$C$DW$T$47)
    9574                      .dwattr $C$DW$986, DW_AT_name("GPAPUD")
    9575                      .dwattr $C$DW$986, DW_AT_TI_symbol_name("_GPAPUD")
    9576                      .dwattr $C$DW$986, DW_AT_data_member_location[DW_OP_plus_uconst 0xc]
    9577                      .dwattr $C$DW$986, DW_AT_accessibility(DW_ACCESS_public)
    9578              $C$DW$987       .dwtag  DW_TAG_member
    9579                      .dwattr $C$DW$987, DW_AT_type(*$C$DW$T$27)
    9580                      .dwattr $C$DW$987, DW_AT_name("rsvd_1")
    9581                      .dwattr $C$DW$987, DW_AT_TI_symbol_name("_rsvd_1")
    9582                      .dwattr $C$DW$987, DW_AT_data_member_location[DW_OP_plus_uconst 0xe]
    9583                      .dwattr $C$DW$987, DW_AT_accessibility(DW_ACCESS_public)
    9584              $C$DW$988       .dwtag  DW_TAG_member
    9585                      .dwattr $C$DW$988, DW_AT_type(*$C$DW$T$47)
    9586                      .dwattr $C$DW$988, DW_AT_name("GPBCTRL")
    9587                      .dwattr $C$DW$988, DW_AT_TI_symbol_name("_GPBCTRL")
    9588                      .dwattr $C$DW$988, DW_AT_data_member_location[DW_OP_plus_uconst 0x10]
    9589                      .dwattr $C$DW$988, DW_AT_accessibility(DW_ACCESS_public)
    9590              $C$DW$989       .dwtag  DW_TAG_member
    9591                      .dwattr $C$DW$989, DW_AT_type(*$C$DW$T$47)
    9592                      .dwattr $C$DW$989, DW_AT_name("GPBQSEL1")
    9593                      .dwattr $C$DW$989, DW_AT_TI_symbol_name("_GPBQSEL1")
    9594                      .dwattr $C$DW$989, DW_AT_data_member_location[DW_OP_plus_uconst 0x12]
    9595                      .dwattr $C$DW$989, DW_AT_accessibility(DW_ACCESS_public)
    9596              $C$DW$990       .dwtag  DW_TAG_member
    9597                      .dwattr $C$DW$990, DW_AT_type(*$C$DW$T$27)
TMS320C2000 Assembler PC v6.2.5 Tue Sep 12 21:00:17 2017

Tools Copyright (c) 1996-2014 Texas Instruments Incorporated
C:\Users\wmj\AppData\Local\Temp\0425610                              PAGE  193

    9598                      .dwattr $C$DW$990, DW_AT_name("rsvd_2")
    9599                      .dwattr $C$DW$990, DW_AT_TI_symbol_name("_rsvd_2")
    9600                      .dwattr $C$DW$990, DW_AT_data_member_location[DW_OP_plus_uconst 0x14]
    9601                      .dwattr $C$DW$990, DW_AT_accessibility(DW_ACCESS_public)
    9602              $C$DW$991       .dwtag  DW_TAG_member
    9603                      .dwattr $C$DW$991, DW_AT_type(*$C$DW$T$47)
    9604                      .dwattr $C$DW$991, DW_AT_name("GPBMUX1")
    9605                      .dwattr $C$DW$991, DW_AT_TI_symbol_name("_GPBMUX1")
    9606                      .dwattr $C$DW$991, DW_AT_data_member_location[DW_OP_plus_uconst 0x16]
    9607                      .dwattr $C$DW$991, DW_AT_accessibility(DW_ACCESS_public)
    9608              $C$DW$992       .dwtag  DW_TAG_member
    9609                      .dwattr $C$DW$992, DW_AT_type(*$C$DW$T$27)
    9610                      .dwattr $C$DW$992, DW_AT_name("rsvd_3")
    9611                      .dwattr $C$DW$992, DW_AT_TI_symbol_name("_rsvd_3")
    9612                      .dwattr $C$DW$992, DW_AT_data_member_location[DW_OP_plus_uconst 0x18]
    9613                      .dwattr $C$DW$992, DW_AT_accessibility(DW_ACCESS_public)
    9614              $C$DW$993       .dwtag  DW_TAG_member
    9615                      .dwattr $C$DW$993, DW_AT_type(*$C$DW$T$47)
    9616                      .dwattr $C$DW$993, DW_AT_name("GPBDIR")
    9617                      .dwattr $C$DW$993, DW_AT_TI_symbol_name("_GPBDIR")
    9618                      .dwattr $C$DW$993, DW_AT_data_member_location[DW_OP_plus_uconst 0x1a]
    9619                      .dwattr $C$DW$993, DW_AT_accessibility(DW_ACCESS_public)
    9620              $C$DW$994       .dwtag  DW_TAG_member
    9621                      .dwattr $C$DW$994, DW_AT_type(*$C$DW$T$47)
    9622                      .dwattr $C$DW$994, DW_AT_name("GPBPUD")
    9623                      .dwattr $C$DW$994, DW_AT_TI_symbol_name("_GPBPUD")
    9624                      .dwattr $C$DW$994, DW_AT_data_member_location[DW_OP_plus_uconst 0x1c]
    9625                      .dwattr $C$DW$994, DW_AT_accessibility(DW_ACCESS_public)
    9626              $C$DW$995       .dwtag  DW_TAG_member
    9627                      .dwattr $C$DW$995, DW_AT_type(*$C$DW$T$48)
    9628                      .dwattr $C$DW$995, DW_AT_name("rsvd_4")
    9629                      .dwattr $C$DW$995, DW_AT_TI_symbol_name("_rsvd_4")
    9630                      .dwattr $C$DW$995, DW_AT_data_member_location[DW_OP_plus_uconst 0x1e]
    9631                      .dwattr $C$DW$995, DW_AT_accessibility(DW_ACCESS_public)
    9632              $C$DW$996       .dwtag  DW_TAG_member
    9633                      .dwattr $C$DW$996, DW_AT_type(*$C$DW$T$47)
    9634                      .dwattr $C$DW$996, DW_AT_name("AIOMUX1")
    9635                      .dwattr $C$DW$996, DW_AT_TI_symbol_name("_AIOMUX1")
    9636                      .dwattr $C$DW$996, DW_AT_data_member_location[DW_OP_plus_uconst 0x36]
    9637                      .dwattr $C$DW$996, DW_AT_accessibility(DW_ACCESS_public)
    9638              $C$DW$997       .dwtag  DW_TAG_member
    9639                      .dwattr $C$DW$997, DW_AT_type(*$C$DW$T$27)
    9640                      .dwattr $C$DW$997, DW_AT_name("rsvd_5")
    9641                      .dwattr $C$DW$997, DW_AT_TI_symbol_name("_rsvd_5")
    9642                      .dwattr $C$DW$997, DW_AT_data_member_location[DW_OP_plus_uconst 0x38]
    9643                      .dwattr $C$DW$997, DW_AT_accessibility(DW_ACCESS_public)
    9644              $C$DW$998       .dwtag  DW_TAG_member
    9645                      .dwattr $C$DW$998, DW_AT_type(*$C$DW$T$47)
    9646                      .dwattr $C$DW$998, DW_AT_name("AIODIR")
    9647                      .dwattr $C$DW$998, DW_AT_TI_symbol_name("_AIODIR")
    9648                      .dwattr $C$DW$998, DW_AT_data_member_location[DW_OP_plus_uconst 0x3a]
    9649                      .dwattr $C$DW$998, DW_AT_accessibility(DW_ACCESS_public)
    9650              $C$DW$999       .dwtag  DW_TAG_member
    9651                      .dwattr $C$DW$999, DW_AT_type(*$C$DW$T$49)
    9652                      .dwattr $C$DW$999, DW_AT_name("rsvd_6")
TMS320C2000 Assembler PC v6.2.5 Tue Sep 12 21:00:17 2017

Tools Copyright (c) 1996-2014 Texas Instruments Incorporated
C:\Users\wmj\AppData\Local\Temp\0425610                              PAGE  194

    9653                      .dwattr $C$DW$999, DW_AT_TI_symbol_name("_rsvd_6")
    9654                      .dwattr $C$DW$999, DW_AT_data_member_location[DW_OP_plus_uconst 0x3c]
    9655                      .dwattr $C$DW$999, DW_AT_accessibility(DW_ACCESS_public)
    9656              $C$DW$1000      .dwtag  DW_TAG_member
    9657                      .dwattr $C$DW$1000, DW_AT_type(*$C$DW$T$47)
    9658                      .dwattr $C$DW$1000, DW_AT_name("GPADAT")
    9659                      .dwattr $C$DW$1000, DW_AT_TI_symbol_name("_GPADAT")
    9660                      .dwattr $C$DW$1000, DW_AT_data_member_location[DW_OP_plus_uconst 0x40]
    9661                      .dwattr $C$DW$1000, DW_AT_accessibility(DW_ACCESS_public)
    9662              $C$DW$1001      .dwtag  DW_TAG_member
    9663                      .dwattr $C$DW$1001, DW_AT_type(*$C$DW$T$47)
    9664                      .dwattr $C$DW$1001, DW_AT_name("GPASET")
    9665                      .dwattr $C$DW$1001, DW_AT_TI_symbol_name("_GPASET")
    9666                      .dwattr $C$DW$1001, DW_AT_data_member_location[DW_OP_plus_uconst 0x42]
    9667                      .dwattr $C$DW$1001, DW_AT_accessibility(DW_ACCESS_public)
    9668              $C$DW$1002      .dwtag  DW_TAG_member
    9669                      .dwattr $C$DW$1002, DW_AT_type(*$C$DW$T$47)
    9670                      .dwattr $C$DW$1002, DW_AT_name("GPACLEAR")
    9671                      .dwattr $C$DW$1002, DW_AT_TI_symbol_name("_GPACLEAR")
    9672                      .dwattr $C$DW$1002, DW_AT_data_member_location[DW_OP_plus_uconst 0x44]
    9673                      .dwattr $C$DW$1002, DW_AT_accessibility(DW_ACCESS_public)
    9674              $C$DW$1003      .dwtag  DW_TAG_member
    9675                      .dwattr $C$DW$1003, DW_AT_type(*$C$DW$T$47)
    9676                      .dwattr $C$DW$1003, DW_AT_name("GPATOGGLE")
    9677                      .dwattr $C$DW$1003, DW_AT_TI_symbol_name("_GPATOGGLE")
    9678                      .dwattr $C$DW$1003, DW_AT_data_member_location[DW_OP_plus_uconst 0x46]
    9679                      .dwattr $C$DW$1003, DW_AT_accessibility(DW_ACCESS_public)
    9680              $C$DW$1004      .dwtag  DW_TAG_member
    9681                      .dwattr $C$DW$1004, DW_AT_type(*$C$DW$T$47)
    9682                      .dwattr $C$DW$1004, DW_AT_name("GPBDAT")
    9683                      .dwattr $C$DW$1004, DW_AT_TI_symbol_name("_GPBDAT")
    9684                      .dwattr $C$DW$1004, DW_AT_data_member_location[DW_OP_plus_uconst 0x48]
    9685                      .dwattr $C$DW$1004, DW_AT_accessibility(DW_ACCESS_public)
    9686              $C$DW$1005      .dwtag  DW_TAG_member
    9687                      .dwattr $C$DW$1005, DW_AT_type(*$C$DW$T$47)
    9688                      .dwattr $C$DW$1005, DW_AT_name("GPBSET")
    9689                      .dwattr $C$DW$1005, DW_AT_TI_symbol_name("_GPBSET")
    9690                      .dwattr $C$DW$1005, DW_AT_data_member_location[DW_OP_plus_uconst 0x4a]
    9691                      .dwattr $C$DW$1005, DW_AT_accessibility(DW_ACCESS_public)
    9692              $C$DW$1006      .dwtag  DW_TAG_member
    9693                      .dwattr $C$DW$1006, DW_AT_type(*$C$DW$T$47)
    9694                      .dwattr $C$DW$1006, DW_AT_name("GPBCLEAR")
    9695                      .dwattr $C$DW$1006, DW_AT_TI_symbol_name("_GPBCLEAR")
    9696                      .dwattr $C$DW$1006, DW_AT_data_member_location[DW_OP_plus_uconst 0x4c]
    9697                      .dwattr $C$DW$1006, DW_AT_accessibility(DW_ACCESS_public)
    9698              $C$DW$1007      .dwtag  DW_TAG_member
    9699                      .dwattr $C$DW$1007, DW_AT_type(*$C$DW$T$47)
    9700                      .dwattr $C$DW$1007, DW_AT_name("GPBTOGGLE")
    9701                      .dwattr $C$DW$1007, DW_AT_TI_symbol_name("_GPBTOGGLE")
    9702                      .dwattr $C$DW$1007, DW_AT_data_member_location[DW_OP_plus_uconst 0x4e]
    9703                      .dwattr $C$DW$1007, DW_AT_accessibility(DW_ACCESS_public)
    9704              $C$DW$1008      .dwtag  DW_TAG_member
    9705                      .dwattr $C$DW$1008, DW_AT_type(*$C$DW$T$35)
    9706                      .dwattr $C$DW$1008, DW_AT_name("rsvd_7")
    9707                      .dwattr $C$DW$1008, DW_AT_TI_symbol_name("_rsvd_7")
TMS320C2000 Assembler PC v6.2.5 Tue Sep 12 21:00:17 2017

Tools Copyright (c) 1996-2014 Texas Instruments Incorporated
C:\Users\wmj\AppData\Local\Temp\0425610                              PAGE  195

    9708                      .dwattr $C$DW$1008, DW_AT_data_member_location[DW_OP_plus_uconst 0x50]
    9709                      .dwattr $C$DW$1008, DW_AT_accessibility(DW_ACCESS_public)
    9710              $C$DW$1009      .dwtag  DW_TAG_member
    9711                      .dwattr $C$DW$1009, DW_AT_type(*$C$DW$T$47)
    9712                      .dwattr $C$DW$1009, DW_AT_name("AIODAT")
    9713                      .dwattr $C$DW$1009, DW_AT_TI_symbol_name("_AIODAT")
    9714                      .dwattr $C$DW$1009, DW_AT_data_member_location[DW_OP_plus_uconst 0x58]
    9715                      .dwattr $C$DW$1009, DW_AT_accessibility(DW_ACCESS_public)
    9716              $C$DW$1010      .dwtag  DW_TAG_member
    9717                      .dwattr $C$DW$1010, DW_AT_type(*$C$DW$T$47)
    9718                      .dwattr $C$DW$1010, DW_AT_name("AIOSET")
    9719                      .dwattr $C$DW$1010, DW_AT_TI_symbol_name("_AIOSET")
    9720                      .dwattr $C$DW$1010, DW_AT_data_member_location[DW_OP_plus_uconst 0x5a]
    9721                      .dwattr $C$DW$1010, DW_AT_accessibility(DW_ACCESS_public)
    9722              $C$DW$1011      .dwtag  DW_TAG_member
    9723                      .dwattr $C$DW$1011, DW_AT_type(*$C$DW$T$47)
    9724                      .dwattr $C$DW$1011, DW_AT_name("AIOCLEAR")
    9725                      .dwattr $C$DW$1011, DW_AT_TI_symbol_name("_AIOCLEAR")
    9726                      .dwattr $C$DW$1011, DW_AT_data_member_location[DW_OP_plus_uconst 0x5c]
    9727                      .dwattr $C$DW$1011, DW_AT_accessibility(DW_ACCESS_public)
    9728              $C$DW$1012      .dwtag  DW_TAG_member
    9729                      .dwattr $C$DW$1012, DW_AT_type(*$C$DW$T$47)
    9730                      .dwattr $C$DW$1012, DW_AT_name("AIOTOGGLE")
    9731                      .dwattr $C$DW$1012, DW_AT_TI_symbol_name("_AIOTOGGLE")
    9732                      .dwattr $C$DW$1012, DW_AT_data_member_location[DW_OP_plus_uconst 0x5e]
    9733                      .dwattr $C$DW$1012, DW_AT_accessibility(DW_ACCESS_public)
    9734              $C$DW$1013      .dwtag  DW_TAG_member
    9735                      .dwattr $C$DW$1013, DW_AT_type(*$C$DW$T$29)
    9736                      .dwattr $C$DW$1013, DW_AT_name("GPIOXINTnSEL")
    9737                      .dwattr $C$DW$1013, DW_AT_TI_symbol_name("_GPIOXINTnSEL")
    9738                      .dwattr $C$DW$1013, DW_AT_data_member_location[DW_OP_plus_uconst 0x60]
    9739                      .dwattr $C$DW$1013, DW_AT_accessibility(DW_ACCESS_public)
    9740              $C$DW$1014      .dwtag  DW_TAG_member
    9741                      .dwattr $C$DW$1014, DW_AT_type(*$C$DW$T$28)
    9742                      .dwattr $C$DW$1014, DW_AT_name("rsvd_8")
    9743                      .dwattr $C$DW$1014, DW_AT_TI_symbol_name("_rsvd_8")
    9744                      .dwattr $C$DW$1014, DW_AT_data_member_location[DW_OP_plus_uconst 0x63]
    9745                      .dwattr $C$DW$1014, DW_AT_accessibility(DW_ACCESS_public)
    9746              $C$DW$1015      .dwtag  DW_TAG_member
    9747                      .dwattr $C$DW$1015, DW_AT_type(*$C$DW$T$47)
    9748                      .dwattr $C$DW$1015, DW_AT_name("GPIOLPMSEL")
    9749                      .dwattr $C$DW$1015, DW_AT_TI_symbol_name("_GPIOLPMSEL")
    9750                      .dwattr $C$DW$1015, DW_AT_data_member_location[DW_OP_plus_uconst 0x68]
    9751                      .dwattr $C$DW$1015, DW_AT_accessibility(DW_ACCESS_public)
    9752                      .dwendtag $C$DW$T$50
    9753              
    9754              $C$DW$T$66      .dwtag  DW_TAG_pointer_type
    9755                      .dwattr $C$DW$T$66, DW_AT_type(*$C$DW$T$50)
    9756                      .dwattr $C$DW$T$66, DW_AT_address_class(0x16)
    9757              $C$DW$T$67      .dwtag  DW_TAG_typedef, DW_AT_name("GPIO_Handle")
    9758                      .dwattr $C$DW$T$67, DW_AT_type(*$C$DW$T$66)
    9759                      .dwattr $C$DW$T$67, DW_AT_language(DW_LANG_C)
    9760              
    9761              $C$DW$T$52      .dwtag  DW_TAG_structure_type
    9762                      .dwattr $C$DW$T$52, DW_AT_name("_HAL_AdcData_t_")
TMS320C2000 Assembler PC v6.2.5 Tue Sep 12 21:00:17 2017

Tools Copyright (c) 1996-2014 Texas Instruments Incorporated
C:\Users\wmj\AppData\Local\Temp\0425610                              PAGE  196

    9763                      .dwattr $C$DW$T$52, DW_AT_byte_size(0x16)
    9764              $C$DW$1016      .dwtag  DW_TAG_member
    9765                      .dwattr $C$DW$1016, DW_AT_type(*$C$DW$T$51)
    9766                      .dwattr $C$DW$1016, DW_AT_name("I")
    9767                      .dwattr $C$DW$1016, DW_AT_TI_symbol_name("_I")
    9768                      .dwattr $C$DW$1016, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    9769                      .dwattr $C$DW$1016, DW_AT_accessibility(DW_ACCESS_public)
    9770              $C$DW$1017      .dwtag  DW_TAG_member
    9771                      .dwattr $C$DW$1017, DW_AT_type(*$C$DW$T$51)
    9772                      .dwattr $C$DW$1017, DW_AT_name("V")
    9773                      .dwattr $C$DW$1017, DW_AT_TI_symbol_name("_V")
    9774                      .dwattr $C$DW$1017, DW_AT_data_member_location[DW_OP_plus_uconst 0x6]
    9775                      .dwattr $C$DW$1017, DW_AT_accessibility(DW_ACCESS_public)
    9776              $C$DW$1018      .dwtag  DW_TAG_member
    9777                      .dwattr $C$DW$1018, DW_AT_type(*$C$DW$T$32)
    9778                      .dwattr $C$DW$1018, DW_AT_name("dcBus")
    9779                      .dwattr $C$DW$1018, DW_AT_TI_symbol_name("_dcBus")
    9780                      .dwattr $C$DW$1018, DW_AT_data_member_location[DW_OP_plus_uconst 0xc]
    9781                      .dwattr $C$DW$1018, DW_AT_accessibility(DW_ACCESS_public)
    9782              $C$DW$1019      .dwtag  DW_TAG_member
    9783                      .dwattr $C$DW$1019, DW_AT_type(*$C$DW$T$32)
    9784                      .dwattr $C$DW$1019, DW_AT_name("analogSensor1")
    9785                      .dwattr $C$DW$1019, DW_AT_TI_symbol_name("_analogSensor1")
    9786                      .dwattr $C$DW$1019, DW_AT_data_member_location[DW_OP_plus_uconst 0xe]
    9787                      .dwattr $C$DW$1019, DW_AT_accessibility(DW_ACCESS_public)
    9788              $C$DW$1020      .dwtag  DW_TAG_member
    9789                      .dwattr $C$DW$1020, DW_AT_type(*$C$DW$T$32)
    9790                      .dwattr $C$DW$1020, DW_AT_name("analogSensor2")
    9791                      .dwattr $C$DW$1020, DW_AT_TI_symbol_name("_analogSensor2")
    9792                      .dwattr $C$DW$1020, DW_AT_data_member_location[DW_OP_plus_uconst 0x10]
    9793                      .dwattr $C$DW$1020, DW_AT_accessibility(DW_ACCESS_public)
    9794              $C$DW$1021      .dwtag  DW_TAG_member
    9795                      .dwattr $C$DW$1021, DW_AT_type(*$C$DW$T$32)
    9796                      .dwattr $C$DW$1021, DW_AT_name("igbtNTC")
    9797                      .dwattr $C$DW$1021, DW_AT_TI_symbol_name("_igbtNTC")
    9798                      .dwattr $C$DW$1021, DW_AT_data_member_location[DW_OP_plus_uconst 0x12]
    9799                      .dwattr $C$DW$1021, DW_AT_accessibility(DW_ACCESS_public)
    9800              $C$DW$1022      .dwtag  DW_TAG_member
    9801                      .dwattr $C$DW$1022, DW_AT_type(*$C$DW$T$32)
    9802                      .dwattr $C$DW$1022, DW_AT_name("boardAddr")
    9803                      .dwattr $C$DW$1022, DW_AT_TI_symbol_name("_boardAddr")
    9804                      .dwattr $C$DW$1022, DW_AT_data_member_location[DW_OP_plus_uconst 0x14]
    9805                      .dwattr $C$DW$1022, DW_AT_accessibility(DW_ACCESS_public)
    9806                      .dwendtag $C$DW$T$52
    9807              
    9808              $C$DW$T$95      .dwtag  DW_TAG_typedef, DW_AT_name("HAL_AdcData_t")
    9809                      .dwattr $C$DW$T$95, DW_AT_type(*$C$DW$T$52)
    9810                      .dwattr $C$DW$T$95, DW_AT_language(DW_LANG_C)
    9811              
    9812              $C$DW$T$57      .dwtag  DW_TAG_structure_type
    9813                      .dwattr $C$DW$T$57, DW_AT_name("_HAL_DacData_t_")
    9814                      .dwattr $C$DW$T$57, DW_AT_byte_size(0x22)
    9815              $C$DW$1023      .dwtag  DW_TAG_member
    9816                      .dwattr $C$DW$1023, DW_AT_type(*$C$DW$T$23)
    9817                      .dwattr $C$DW$1023, DW_AT_name("PeriodMax")
TMS320C2000 Assembler PC v6.2.5 Tue Sep 12 21:00:17 2017

Tools Copyright (c) 1996-2014 Texas Instruments Incorporated
C:\Users\wmj\AppData\Local\Temp\0425610                              PAGE  197

    9818                      .dwattr $C$DW$1023, DW_AT_TI_symbol_name("_PeriodMax")
    9819                      .dwattr $C$DW$1023, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    9820                      .dwattr $C$DW$1023, DW_AT_accessibility(DW_ACCESS_public)
    9821              $C$DW$1024      .dwtag  DW_TAG_member
    9822                      .dwattr $C$DW$1024, DW_AT_type(*$C$DW$T$55)
    9823                      .dwattr $C$DW$1024, DW_AT_name("ptrData")
    9824                      .dwattr $C$DW$1024, DW_AT_TI_symbol_name("_ptrData")
    9825                      .dwattr $C$DW$1024, DW_AT_data_member_location[DW_OP_plus_uconst 0x2]
    9826                      .dwattr $C$DW$1024, DW_AT_accessibility(DW_ACCESS_public)
    9827              $C$DW$1025      .dwtag  DW_TAG_member
    9828                      .dwattr $C$DW$1025, DW_AT_type(*$C$DW$T$56)
    9829                      .dwattr $C$DW$1025, DW_AT_name("value")
    9830                      .dwattr $C$DW$1025, DW_AT_TI_symbol_name("_value")
    9831                      .dwattr $C$DW$1025, DW_AT_data_member_location[DW_OP_plus_uconst 0xa]
    9832                      .dwattr $C$DW$1025, DW_AT_accessibility(DW_ACCESS_public)
    9833              $C$DW$1026      .dwtag  DW_TAG_member
    9834                      .dwattr $C$DW$1026, DW_AT_type(*$C$DW$T$56)
    9835                      .dwattr $C$DW$1026, DW_AT_name("offset")
    9836                      .dwattr $C$DW$1026, DW_AT_TI_symbol_name("_offset")
    9837                      .dwattr $C$DW$1026, DW_AT_data_member_location[DW_OP_plus_uconst 0x12]
    9838                      .dwattr $C$DW$1026, DW_AT_accessibility(DW_ACCESS_public)
    9839              $C$DW$1027      .dwtag  DW_TAG_member
    9840                      .dwattr $C$DW$1027, DW_AT_type(*$C$DW$T$56)
    9841                      .dwattr $C$DW$1027, DW_AT_name("gain")
    9842                      .dwattr $C$DW$1027, DW_AT_TI_symbol_name("_gain")
    9843                      .dwattr $C$DW$1027, DW_AT_data_member_location[DW_OP_plus_uconst 0x1a]
    9844                      .dwattr $C$DW$1027, DW_AT_accessibility(DW_ACCESS_public)
    9845                      .dwendtag $C$DW$T$57
    9846              
    9847              $C$DW$T$232     .dwtag  DW_TAG_typedef, DW_AT_name("HAL_DacData_t")
    9848                      .dwattr $C$DW$T$232, DW_AT_type(*$C$DW$T$57)
    9849                      .dwattr $C$DW$T$232, DW_AT_language(DW_LANG_C)
    9850              
    9851              $C$DW$T$96      .dwtag  DW_TAG_structure_type
    9852                      .dwattr $C$DW$T$96, DW_AT_name("_HAL_Obj_")
    9853                      .dwattr $C$DW$T$96, DW_AT_byte_size(0xb4)
    9854              $C$DW$1028      .dwtag  DW_TAG_member
    9855                      .dwattr $C$DW$1028, DW_AT_type(*$C$DW$T$59)
    9856                      .dwattr $C$DW$1028, DW_AT_name("adcHandle")
    9857                      .dwattr $C$DW$1028, DW_AT_TI_symbol_name("_adcHandle")
    9858                      .dwattr $C$DW$1028, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    9859                      .dwattr $C$DW$1028, DW_AT_accessibility(DW_ACCESS_public)
    9860              $C$DW$1029      .dwtag  DW_TAG_member
    9861                      .dwattr $C$DW$1029, DW_AT_type(*$C$DW$T$61)
    9862                      .dwattr $C$DW$1029, DW_AT_name("clkHandle")
    9863                      .dwattr $C$DW$1029, DW_AT_TI_symbol_name("_clkHandle")
    9864                      .dwattr $C$DW$1029, DW_AT_data_member_location[DW_OP_plus_uconst 0x2]
    9865                      .dwattr $C$DW$1029, DW_AT_accessibility(DW_ACCESS_public)
    9866              $C$DW$1030      .dwtag  DW_TAG_member
    9867                      .dwattr $C$DW$1030, DW_AT_type(*$C$DW$T$63)
    9868                      .dwattr $C$DW$1030, DW_AT_name("cpuHandle")
    9869                      .dwattr $C$DW$1030, DW_AT_TI_symbol_name("_cpuHandle")
    9870                      .dwattr $C$DW$1030, DW_AT_data_member_location[DW_OP_plus_uconst 0x4]
    9871                      .dwattr $C$DW$1030, DW_AT_accessibility(DW_ACCESS_public)
    9872              $C$DW$1031      .dwtag  DW_TAG_member
TMS320C2000 Assembler PC v6.2.5 Tue Sep 12 21:00:17 2017

Tools Copyright (c) 1996-2014 Texas Instruments Incorporated
C:\Users\wmj\AppData\Local\Temp\0425610                              PAGE  198

    9873                      .dwattr $C$DW$1031, DW_AT_type(*$C$DW$T$65)
    9874                      .dwattr $C$DW$1031, DW_AT_name("flashHandle")
    9875                      .dwattr $C$DW$1031, DW_AT_TI_symbol_name("_flashHandle")
    9876                      .dwattr $C$DW$1031, DW_AT_data_member_location[DW_OP_plus_uconst 0x6]
    9877                      .dwattr $C$DW$1031, DW_AT_accessibility(DW_ACCESS_public)
    9878              $C$DW$1032      .dwtag  DW_TAG_member
    9879                      .dwattr $C$DW$1032, DW_AT_type(*$C$DW$T$67)
    9880                      .dwattr $C$DW$1032, DW_AT_name("gpioHandle")
    9881                      .dwattr $C$DW$1032, DW_AT_TI_symbol_name("_gpioHandle")
    9882                      .dwattr $C$DW$1032, DW_AT_data_member_location[DW_OP_plus_uconst 0x8]
    9883                      .dwattr $C$DW$1032, DW_AT_accessibility(DW_ACCESS_public)
    9884              $C$DW$1033      .dwtag  DW_TAG_member
    9885                      .dwattr $C$DW$1033, DW_AT_type(*$C$DW$T$70)
    9886                      .dwattr $C$DW$1033, DW_AT_name("offsetHandle_I")
    9887                      .dwattr $C$DW$1033, DW_AT_TI_symbol_name("_offsetHandle_I")
    9888                      .dwattr $C$DW$1033, DW_AT_data_member_location[DW_OP_plus_uconst 0xa]
    9889                      .dwattr $C$DW$1033, DW_AT_accessibility(DW_ACCESS_public)
    9890              $C$DW$1034      .dwtag  DW_TAG_member
    9891                      .dwattr $C$DW$1034, DW_AT_type(*$C$DW$T$72)
    9892                      .dwattr $C$DW$1034, DW_AT_name("offset_I")
    9893                      .dwattr $C$DW$1034, DW_AT_TI_symbol_name("_offset_I")
    9894                      .dwattr $C$DW$1034, DW_AT_data_member_location[DW_OP_plus_uconst 0x10]
    9895                      .dwattr $C$DW$1034, DW_AT_accessibility(DW_ACCESS_public)
    9896              $C$DW$1035      .dwtag  DW_TAG_member
    9897                      .dwattr $C$DW$1035, DW_AT_type(*$C$DW$T$70)
    9898                      .dwattr $C$DW$1035, DW_AT_name("offsetHandle_V")
    9899                      .dwattr $C$DW$1035, DW_AT_TI_symbol_name("_offsetHandle_V")
    9900                      .dwattr $C$DW$1035, DW_AT_data_member_location[DW_OP_plus_uconst 0x40]
    9901                      .dwattr $C$DW$1035, DW_AT_accessibility(DW_ACCESS_public)
    9902              $C$DW$1036      .dwtag  DW_TAG_member
    9903                      .dwattr $C$DW$1036, DW_AT_type(*$C$DW$T$72)
    9904                      .dwattr $C$DW$1036, DW_AT_name("offset_V")
    9905                      .dwattr $C$DW$1036, DW_AT_TI_symbol_name("_offset_V")
    9906                      .dwattr $C$DW$1036, DW_AT_data_member_location[DW_OP_plus_uconst 0x46]
    9907                      .dwattr $C$DW$1036, DW_AT_accessibility(DW_ACCESS_public)
    9908              $C$DW$1037      .dwtag  DW_TAG_member
    9909                      .dwattr $C$DW$1037, DW_AT_type(*$C$DW$T$74)
    9910                      .dwattr $C$DW$1037, DW_AT_name("oscHandle")
    9911                      .dwattr $C$DW$1037, DW_AT_TI_symbol_name("_oscHandle")
    9912                      .dwattr $C$DW$1037, DW_AT_data_member_location[DW_OP_plus_uconst 0x76]
    9913                      .dwattr $C$DW$1037, DW_AT_accessibility(DW_ACCESS_public)
    9914              $C$DW$1038      .dwtag  DW_TAG_member
    9915                      .dwattr $C$DW$1038, DW_AT_type(*$C$DW$T$76)
    9916                      .dwattr $C$DW$1038, DW_AT_name("pieHandle")
    9917                      .dwattr $C$DW$1038, DW_AT_TI_symbol_name("_pieHandle")
    9918                      .dwattr $C$DW$1038, DW_AT_data_member_location[DW_OP_plus_uconst 0x78]
    9919                      .dwattr $C$DW$1038, DW_AT_accessibility(DW_ACCESS_public)
    9920              $C$DW$1039      .dwtag  DW_TAG_member
    9921                      .dwattr $C$DW$1039, DW_AT_type(*$C$DW$T$78)
    9922                      .dwattr $C$DW$1039, DW_AT_name("pllHandle")
    9923                      .dwattr $C$DW$1039, DW_AT_TI_symbol_name("_pllHandle")
    9924                      .dwattr $C$DW$1039, DW_AT_data_member_location[DW_OP_plus_uconst 0x7a]
    9925                      .dwattr $C$DW$1039, DW_AT_accessibility(DW_ACCESS_public)
    9926              $C$DW$1040      .dwtag  DW_TAG_member
    9927                      .dwattr $C$DW$1040, DW_AT_type(*$C$DW$T$81)
TMS320C2000 Assembler PC v6.2.5 Tue Sep 12 21:00:17 2017

Tools Copyright (c) 1996-2014 Texas Instruments Incorporated
C:\Users\wmj\AppData\Local\Temp\0425610                              PAGE  199

    9928                      .dwattr $C$DW$1040, DW_AT_name("pwmHandle")
    9929                      .dwattr $C$DW$1040, DW_AT_TI_symbol_name("_pwmHandle")
    9930                      .dwattr $C$DW$1040, DW_AT_data_member_location[DW_OP_plus_uconst 0x7c]
    9931                      .dwattr $C$DW$1040, DW_AT_accessibility(DW_ACCESS_public)
    9932              $C$DW$1041      .dwtag  DW_TAG_member
    9933                      .dwattr $C$DW$1041, DW_AT_type(*$C$DW$T$81)
    9934                      .dwattr $C$DW$1041, DW_AT_name("pwmDacHandle")
    9935                      .dwattr $C$DW$1041, DW_AT_TI_symbol_name("_pwmDacHandle")
    9936                      .dwattr $C$DW$1041, DW_AT_data_member_location[DW_OP_plus_uconst 0x82]
    9937                      .dwattr $C$DW$1041, DW_AT_accessibility(DW_ACCESS_public)
    9938              $C$DW$1042      .dwtag  DW_TAG_member
    9939                      .dwattr $C$DW$1042, DW_AT_type(*$C$DW$T$83)
    9940                      .dwattr $C$DW$1042, DW_AT_name("pwrHandle")
    9941                      .dwattr $C$DW$1042, DW_AT_TI_symbol_name("_pwrHandle")
    9942                      .dwattr $C$DW$1042, DW_AT_data_member_location[DW_OP_plus_uconst 0x88]
    9943                      .dwattr $C$DW$1042, DW_AT_accessibility(DW_ACCESS_public)
    9944              $C$DW$1043      .dwtag  DW_TAG_member
    9945                      .dwattr $C$DW$1043, DW_AT_type(*$C$DW$T$86)
    9946                      .dwattr $C$DW$1043, DW_AT_name("timerHandle")
    9947                      .dwattr $C$DW$1043, DW_AT_TI_symbol_name("_timerHandle")
    9948                      .dwattr $C$DW$1043, DW_AT_data_member_location[DW_OP_plus_uconst 0x8a]
    9949                      .dwattr $C$DW$1043, DW_AT_accessibility(DW_ACCESS_public)
    9950              $C$DW$1044      .dwtag  DW_TAG_member
    9951                      .dwattr $C$DW$1044, DW_AT_type(*$C$DW$T$88)
    9952                      .dwattr $C$DW$1044, DW_AT_name("i2cHandle")
    9953                      .dwattr $C$DW$1044, DW_AT_TI_symbol_name("_i2cHandle")
    9954                      .dwattr $C$DW$1044, DW_AT_data_member_location[DW_OP_plus_uconst 0x90]
    9955                      .dwattr $C$DW$1044, DW_AT_accessibility(DW_ACCESS_public)
    9956              $C$DW$1045      .dwtag  DW_TAG_member
    9957                      .dwattr $C$DW$1045, DW_AT_type(*$C$DW$T$90)
    9958                      .dwattr $C$DW$1045, DW_AT_name("spiAHandle")
    9959                      .dwattr $C$DW$1045, DW_AT_TI_symbol_name("_spiAHandle")
    9960                      .dwattr $C$DW$1045, DW_AT_data_member_location[DW_OP_plus_uconst 0x92]
    9961                      .dwattr $C$DW$1045, DW_AT_accessibility(DW_ACCESS_public)
    9962              $C$DW$1046      .dwtag  DW_TAG_member
    9963                      .dwattr $C$DW$1046, DW_AT_type(*$C$DW$T$92)
    9964                      .dwattr $C$DW$1046, DW_AT_name("wdogHandle")
    9965                      .dwattr $C$DW$1046, DW_AT_TI_symbol_name("_wdogHandle")
    9966                      .dwattr $C$DW$1046, DW_AT_data_member_location[DW_OP_plus_uconst 0x94]
    9967                      .dwattr $C$DW$1046, DW_AT_accessibility(DW_ACCESS_public)
    9968              $C$DW$1047      .dwtag  DW_TAG_member
    9969                      .dwattr $C$DW$1047, DW_AT_type(*$C$DW$T$94)
    9970                      .dwattr $C$DW$1047, DW_AT_name("sciHandle")
    9971                      .dwattr $C$DW$1047, DW_AT_TI_symbol_name("_sciHandle")
    9972                      .dwattr $C$DW$1047, DW_AT_data_member_location[DW_OP_plus_uconst 0x96]
    9973                      .dwattr $C$DW$1047, DW_AT_accessibility(DW_ACCESS_public)
    9974              $C$DW$1048      .dwtag  DW_TAG_member
    9975                      .dwattr $C$DW$1048, DW_AT_type(*$C$DW$T$95)
    9976                      .dwattr $C$DW$1048, DW_AT_name("adcBias")
    9977                      .dwattr $C$DW$1048, DW_AT_TI_symbol_name("_adcBias")
    9978                      .dwattr $C$DW$1048, DW_AT_data_member_location[DW_OP_plus_uconst 0x98]
    9979                      .dwattr $C$DW$1048, DW_AT_accessibility(DW_ACCESS_public)
    9980              $C$DW$1049      .dwtag  DW_TAG_member
    9981                      .dwattr $C$DW$1049, DW_AT_type(*$C$DW$T$32)
    9982                      .dwattr $C$DW$1049, DW_AT_name("current_sf")
TMS320C2000 Assembler PC v6.2.5 Tue Sep 12 21:00:17 2017

Tools Copyright (c) 1996-2014 Texas Instruments Incorporated
C:\Users\wmj\AppData\Local\Temp\0425610                              PAGE  200

    9983                      .dwattr $C$DW$1049, DW_AT_TI_symbol_name("_current_sf")
    9984                      .dwattr $C$DW$1049, DW_AT_data_member_location[DW_OP_plus_uconst 0xae]
    9985                      .dwattr $C$DW$1049, DW_AT_accessibility(DW_ACCESS_public)
    9986              $C$DW$1050      .dwtag  DW_TAG_member
    9987                      .dwattr $C$DW$1050, DW_AT_type(*$C$DW$T$32)
    9988                      .dwattr $C$DW$1050, DW_AT_name("voltage_sf")
    9989                      .dwattr $C$DW$1050, DW_AT_TI_symbol_name("_voltage_sf")
    9990                      .dwattr $C$DW$1050, DW_AT_data_member_location[DW_OP_plus_uconst 0xb0]
    9991                      .dwattr $C$DW$1050, DW_AT_accessibility(DW_ACCESS_public)
    9992              $C$DW$1051      .dwtag  DW_TAG_member
    9993                      .dwattr $C$DW$1051, DW_AT_type(*$C$DW$T$33)
    9994                      .dwattr $C$DW$1051, DW_AT_name("numCurrentSensors")
    9995                      .dwattr $C$DW$1051, DW_AT_TI_symbol_name("_numCurrentSensors")
    9996                      .dwattr $C$DW$1051, DW_AT_data_member_location[DW_OP_plus_uconst 0xb2]
    9997                      .dwattr $C$DW$1051, DW_AT_accessibility(DW_ACCESS_public)
    9998              $C$DW$1052      .dwtag  DW_TAG_member
    9999                      .dwattr $C$DW$1052, DW_AT_type(*$C$DW$T$33)
   10000                      .dwattr $C$DW$1052, DW_AT_name("numVoltageSensors")
   10001                      .dwattr $C$DW$1052, DW_AT_TI_symbol_name("_numVoltageSensors")
   10002                      .dwattr $C$DW$1052, DW_AT_data_member_location[DW_OP_plus_uconst 0xb3]
   10003                      .dwattr $C$DW$1052, DW_AT_accessibility(DW_ACCESS_public)
   10004                      .dwendtag $C$DW$T$96
   10005              
   10006              $C$DW$T$233     .dwtag  DW_TAG_typedef, DW_AT_name("HAL_Obj")
   10007                      .dwattr $C$DW$T$233, DW_AT_type(*$C$DW$T$96)
   10008                      .dwattr $C$DW$T$233, DW_AT_language(DW_LANG_C)
   10009              $C$DW$T$234     .dwtag  DW_TAG_pointer_type
   10010                      .dwattr $C$DW$T$234, DW_AT_type(*$C$DW$T$233)
