TMS320C2000 Assembler PC v6.2.5 Tue Sep 12 21:00:19 2017

Tools Copyright (c) 1996-2014 Texas Instruments Incorporated
C:\Users\wmj\AppData\Local\Temp\1224411                              PAGE    1

       1              ;***************************************************************
       2              ;* TMS320C2000 C/C++ Codegen                         PC v6.2.5 *
       3              ;* Date/Time created: Tue Sep 12 21:00:19 2017                 *
       4              ;***************************************************************
       5                      .compiler_opts --float_support=softlib --hll_source=on --mem_model:code=flat --mem_model:data=large -
       6        0002  FP      .set    XAR2
       7              
       8              $C$DW$CU        .dwtag  DW_TAG_compile_unit
       9                      .dwattr $C$DW$CU, DW_AT_name("D:/BM1000/sw/modules/user/src/32b/user.c")
      10                      .dwattr $C$DW$CU, DW_AT_producer("TMS320C2000 C/C++ Codegen PC v6.2.5 Copyright (c) 1996-2014 Texas I
      11                      .dwattr $C$DW$CU, DW_AT_TI_version(0x01)
      12                      .dwattr $C$DW$CU, DW_AT_comp_dir("D:\BM1000\sw\solutions\instaspin_foc\boards\hvkit_rev1p1\f28x\f2802
      13              
      14              $C$DW$1 .dwtag  DW_TAG_subprogram, DW_AT_name("EST_setLs_d_pu")
      15                      .dwattr $C$DW$1, DW_AT_TI_symbol_name("_EST_setLs_d_pu")

    2416              $C$DW$272       .dwtag  DW_TAG_enumerator, DW_AT_name("USER_ErrorCode_motor_Ls_d_High"), DW_AT_const_value(0x
    2417              $C$DW$273       .dwtag  DW_TAG_enumerator, DW_AT_name("USER_ErrorCode_motor_Ls_d_Low"), DW_AT_const_value(0x4
    2418              $C$DW$274       .dwtag  DW_TAG_enumerator, DW_AT_name("USER_ErrorCode_motor_Ls_q_High"), DW_AT_const_value(0x
    2419              $C$DW$275       .dwtag  DW_TAG_enumerator, DW_AT_name("USER_ErrorCode_motor_Ls_q_Low"), DW_AT_const_value(0x4
    2420              $C$DW$276       .dwtag  DW_TAG_enumerator, DW_AT_name("USER_ErrorCode_maxCurrent_High"), DW_AT_const_value(0x
    2421              $C$DW$277       .dwtag  DW_TAG_enumerator, DW_AT_name("USER_ErrorCode_maxCurrent_Low"), DW_AT_const_value(0x4
    2422              $C$DW$278       .dwtag  DW_TAG_enumerator, DW_AT_name("USER_ErrorCode_maxCurrent_resEst_High"), DW_AT_const_v
    2423              $C$DW$279       .dwtag  DW_TAG_enumerator, DW_AT_name("USER_ErrorCode_maxCurrent_resEst_Low"), DW_AT_const_va
    2424              $C$DW$280       .dwtag  DW_TAG_enumerator, DW_AT_name("USER_ErrorCode_maxCurrent_indEst_High"), DW_AT_const_v
    2425              $C$DW$281       .dwtag  DW_TAG_enumerator, DW_AT_name("USER_ErrorCode_maxCurrent_indEst_Low"), DW_AT_const_va
    2426              $C$DW$282       .dwtag  DW_TAG_enumerator, DW_AT_name("USER_ErrorCode_maxCurrentSlope_High"), DW_AT_const_val
    2427              $C$DW$283       .dwtag  DW_TAG_enumerator, DW_AT_name("USER_ErrorCode_maxCurrentSlope_Low"), DW_AT_const_valu
    2428              $C$DW$284       .dwtag  DW_TAG_enumerator, DW_AT_name("USER_ErrorCode_maxCurrentSlope_powerWarp_High"), DW_AT
    2429              $C$DW$285       .dwtag  DW_TAG_enumerator, DW_AT_name("USER_ErrorCode_maxCurrentSlope_powerWarp_Low"), DW_AT_
    2430              $C$DW$286       .dwtag  DW_TAG_enumerator, DW_AT_name("USER_ErrorCode_IdRated_High"), DW_AT_const_value(0x54)
    2431              $C$DW$287       .dwtag  DW_TAG_enumerator, DW_AT_name("USER_ErrorCode_IdRated_Low"), DW_AT_const_value(0x55)
    2432              $C$DW$288       .dwtag  DW_TAG_enumerator, DW_AT_name("USER_ErrorCode_IdRatedFraction_indEst_High"), DW_AT_co
    2433              $C$DW$289       .dwtag  DW_TAG_enumerator, DW_AT_name("USER_ErrorCode_IdRatedFraction_indEst_Low"), DW_AT_con
    2434              $C$DW$290       .dwtag  DW_TAG_enumerator, DW_AT_name("USER_ErrorCode_IdRatedFraction_ratedFlux_High"), DW_AT
    2435              $C$DW$291       .dwtag  DW_TAG_enumerator, DW_AT_name("USER_ErrorCode_IdRatedFraction_ratedFlux_Low"), DW_AT_
    2436              $C$DW$292       .dwtag  DW_TAG_enumerator, DW_AT_name("USER_ErrorCode_IdRated_delta_High"), DW_AT_const_value
    2437              $C$DW$293       .dwtag  DW_TAG_enumerator, DW_AT_name("USER_ErrorCode_IdRated_delta_Low"), DW_AT_const_value(
    2438              $C$DW$294       .dwtag  DW_TAG_enumerator, DW_AT_name("USER_ErrorCode_fluxEstFreq_Hz_High"), DW_AT_const_valu
    2439              $C$DW$295       .dwtag  DW_TAG_enumerator, DW_AT_name("USER_ErrorCode_fluxEstFreq_Hz_Low"), DW_AT_const_value
    2440              $C$DW$296       .dwtag  DW_TAG_enumerator, DW_AT_name("USER_ErrorCode_ctrlFreq_Hz_High"), DW_AT_const_value(0
    2441              $C$DW$297       .dwtag  DW_TAG_enumerator, DW_AT_name("USER_ErrorCode_ctrlFreq_Hz_Low"), DW_AT_const_value(0x
    2442              $C$DW$298       .dwtag  DW_TAG_enumerator, DW_AT_name("USER_ErrorCode_estFreq_Hz_High"), DW_AT_const_value(0x
    2443              $C$DW$299       .dwtag  DW_TAG_enumerator, DW_AT_name("USER_ErrorCode_estFreq_Hz_Low"), DW_AT_const_value(0x6
    2444              $C$DW$300       .dwtag  DW_TAG_enumerator, DW_AT_name("USER_ErrorCode_RoverL_estFreq_Hz_High"), DW_AT_const_v
    2445              $C$DW$301       .dwtag  DW_TAG_enumerator, DW_AT_name("USER_ErrorCode_RoverL_estFreq_Hz_Low"), DW_AT_const_va
    2446              $C$DW$302       .dwtag  DW_TAG_enumerator, DW_AT_name("USER_ErrorCode_trajFreq_Hz_High"), DW_AT_const_value(0
    2447              $C$DW$303       .dwtag  DW_TAG_enumerator, DW_AT_name("USER_ErrorCode_trajFreq_Hz_Low"), DW_AT_const_value(0x
    2448              $C$DW$304       .dwtag  DW_TAG_enumerator, DW_AT_name("USER_ErrorCode_ctrlPeriod_sec_High"), DW_AT_const_valu
    2449              $C$DW$305       .dwtag  DW_TAG_enumerator, DW_AT_name("USER_ErrorCode_ctrlPeriod_sec_Low"), DW_AT_const_value
    2450              $C$DW$306       .dwtag  DW_TAG_enumerator, DW_AT_name("USER_ErrorCode_maxNegativeIdCurrent_a_High"), DW_AT_co
    2451              $C$DW$307       .dwtag  DW_TAG_enumerator, DW_AT_name("USER_ErrorCode_maxNegativeIdCurrent_a_Low"), DW_AT_con
    2452              $C$DW$308       .dwtag  DW_TAG_enumerator, DW_AT_name("USER_numErrorCodes"), DW_AT_const_value(0x6a)
    2453                      .dwendtag $C$DW$T$74
    2454              
    2455              $C$DW$T$75      .dwtag  DW_TAG_typedef, DW_AT_name("USER_ErrorCode_e")
    2456                      .dwattr $C$DW$T$75, DW_AT_type(*$C$DW$T$74)
    2457                      .dwattr $C$DW$T$75, DW_AT_language(DW_LANG_C)
    2458              $C$DW$309       .dwtag  DW_TAG_TI_far_type
    2459                      .dwattr $C$DW$309, DW_AT_type(*$C$DW$T$75)
    2460              $C$DW$T$77      .dwtag  DW_TAG_const_type
    2461                      .dwattr $C$DW$T$77, DW_AT_type(*$C$DW$309)
    2462              
    2463              $C$DW$T$23      .dwtag  DW_TAG_structure_type
    2464                      .dwattr $C$DW$T$23, DW_AT_name("_CLARKE_Obj_")
    2465                      .dwattr $C$DW$T$23, DW_AT_byte_size(0x06)
    2466              $C$DW$310       .dwtag  DW_TAG_member
    2467                      .dwattr $C$DW$310, DW_AT_type(*$C$DW$T$20)
    2468                      .dwattr $C$DW$310, DW_AT_name("alpha_sf")
    2469                      .dwattr $C$DW$310, DW_AT_TI_symbol_name("_alpha_sf")
    2470                      .dwattr $C$DW$310, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
TMS320C2000 Assembler PC v6.2.5 Tue Sep 12 21:00:19 2017

Tools Copyright (c) 1996-2014 Texas Instruments Incorporated
C:\Users\wmj\AppData\Local\Temp\1224411                              PAGE   50

    2471                      .dwattr $C$DW$310, DW_AT_accessibility(DW_ACCESS_public)
    2472              $C$DW$311       .dwtag  DW_TAG_member
    2473                      .dwattr $C$DW$311, DW_AT_type(*$C$DW$T$20)
    2474                      .dwattr $C$DW$311, DW_AT_name("beta_sf")
    2475                      .dwattr $C$DW$311, DW_AT_TI_symbol_name("_beta_sf")
    2476                      .dwattr $C$DW$311, DW_AT_data_member_location[DW_OP_plus_uconst 0x2]
    2477                      .dwattr $C$DW$311, DW_AT_accessibility(DW_ACCESS_public)
    2478              $C$DW$312       .dwtag  DW_TAG_member
    2479                      .dwattr $C$DW$312, DW_AT_type(*$C$DW$T$22)
    2480                      .dwattr $C$DW$312, DW_AT_name("numSensors")
    2481                      .dwattr $C$DW$312, DW_AT_TI_symbol_name("_numSensors")
    2482                      .dwattr $C$DW$312, DW_AT_data_member_location[DW_OP_plus_uconst 0x4]
    2483                      .dwattr $C$DW$312, DW_AT_accessibility(DW_ACCESS_public)
    2484                      .dwendtag $C$DW$T$23
    2485              
    2486              $C$DW$T$31      .dwtag  DW_TAG_typedef, DW_AT_name("CLARKE_Obj")
    2487                      .dwattr $C$DW$T$31, DW_AT_type(*$C$DW$T$23)
    2488                      .dwattr $C$DW$T$31, DW_AT_language(DW_LANG_C)
    2489              $C$DW$T$29      .dwtag  DW_TAG_pointer_type
    2490                      .dwattr $C$DW$T$29, DW_AT_type(*$C$DW$T$23)
    2491                      .dwattr $C$DW$T$29, DW_AT_address_class(0x16)
    2492              $C$DW$T$30      .dwtag  DW_TAG_typedef, DW_AT_name("CLARKE_Handle")
    2493                      .dwattr $C$DW$T$30, DW_AT_type(*$C$DW$T$29)
    2494                      .dwattr $C$DW$T$30, DW_AT_language(DW_LANG_C)
    2495              
    2496              $C$DW$T$57      .dwtag  DW_TAG_structure_type
    2497                      .dwattr $C$DW$T$57, DW_AT_name("_CTRL_Obj_")
    2498                      .dwattr $C$DW$T$57, DW_AT_byte_size(0x108)
    2499              $C$DW$313       .dwtag  DW_TAG_member
    2500                      .dwattr $C$DW$313, DW_AT_type(*$C$DW$T$24)
    2501                      .dwattr $C$DW$313, DW_AT_name("version")
    2502                      .dwattr $C$DW$313, DW_AT_TI_symbol_name("_version")
    2503                      .dwattr $C$DW$313, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    2504                      .dwattr $C$DW$313, DW_AT_accessibility(DW_ACCESS_public)
    2505              $C$DW$314       .dwtag  DW_TAG_member
    2506                      .dwattr $C$DW$314, DW_AT_type(*$C$DW$T$26)
    2507                      .dwattr $C$DW$314, DW_AT_name("state")
    2508                      .dwattr $C$DW$314, DW_AT_TI_symbol_name("_state")
    2509                      .dwattr $C$DW$314, DW_AT_data_member_location[DW_OP_plus_uconst 0x4]
    2510                      .dwattr $C$DW$314, DW_AT_accessibility(DW_ACCESS_public)
    2511              $C$DW$315       .dwtag  DW_TAG_member
    2512                      .dwattr $C$DW$315, DW_AT_type(*$C$DW$T$26)
    2513                      .dwattr $C$DW$315, DW_AT_name("prevState")
    2514                      .dwattr $C$DW$315, DW_AT_TI_symbol_name("_prevState")
    2515                      .dwattr $C$DW$315, DW_AT_data_member_location[DW_OP_plus_uconst 0x5]
    2516                      .dwattr $C$DW$315, DW_AT_accessibility(DW_ACCESS_public)
    2517              $C$DW$316       .dwtag  DW_TAG_member
    2518                      .dwattr $C$DW$316, DW_AT_type(*$C$DW$T$28)
    2519                      .dwattr $C$DW$316, DW_AT_name("errorCode")
    2520                      .dwattr $C$DW$316, DW_AT_TI_symbol_name("_errorCode")
    2521                      .dwattr $C$DW$316, DW_AT_data_member_location[DW_OP_plus_uconst 0x6]
    2522                      .dwattr $C$DW$316, DW_AT_accessibility(DW_ACCESS_public)
    2523              $C$DW$317       .dwtag  DW_TAG_member
    2524                      .dwattr $C$DW$317, DW_AT_type(*$C$DW$T$30)
    2525                      .dwattr $C$DW$317, DW_AT_name("clarkeHandle_I")
TMS320C2000 Assembler PC v6.2.5 Tue Sep 12 21:00:19 2017

Tools Copyright (c) 1996-2014 Texas Instruments Incorporated
C:\Users\wmj\AppData\Local\Temp\1224411                              PAGE   51

    2526                      .dwattr $C$DW$317, DW_AT_TI_symbol_name("_clarkeHandle_I")
    2527                      .dwattr $C$DW$317, DW_AT_data_member_location[DW_OP_plus_uconst 0x8]
    2528                      .dwattr $C$DW$317, DW_AT_accessibility(DW_ACCESS_public)
    2529              $C$DW$318       .dwtag  DW_TAG_member
    2530                      .dwattr $C$DW$318, DW_AT_type(*$C$DW$T$31)
    2531                      .dwattr $C$DW$318, DW_AT_name("clarke_I")
    2532                      .dwattr $C$DW$318, DW_AT_TI_symbol_name("_clarke_I")
    2533                      .dwattr $C$DW$318, DW_AT_data_member_location[DW_OP_plus_uconst 0xa]
    2534                      .dwattr $C$DW$318, DW_AT_accessibility(DW_ACCESS_public)
    2535              $C$DW$319       .dwtag  DW_TAG_member
    2536                      .dwattr $C$DW$319, DW_AT_type(*$C$DW$T$30)
    2537                      .dwattr $C$DW$319, DW_AT_name("clarkeHandle_V")
    2538                      .dwattr $C$DW$319, DW_AT_TI_symbol_name("_clarkeHandle_V")
    2539                      .dwattr $C$DW$319, DW_AT_data_member_location[DW_OP_plus_uconst 0x10]
    2540                      .dwattr $C$DW$319, DW_AT_accessibility(DW_ACCESS_public)
    2541              $C$DW$320       .dwtag  DW_TAG_member
    2542                      .dwattr $C$DW$320, DW_AT_type(*$C$DW$T$31)
    2543                      .dwattr $C$DW$320, DW_AT_name("clarke_V")
    2544                      .dwattr $C$DW$320, DW_AT_TI_symbol_name("_clarke_V")
    2545                      .dwattr $C$DW$320, DW_AT_data_member_location[DW_OP_plus_uconst 0x12]
    2546                      .dwattr $C$DW$320, DW_AT_accessibility(DW_ACCESS_public)
    2547              $C$DW$321       .dwtag  DW_TAG_member
    2548                      .dwattr $C$DW$321, DW_AT_type(*$C$DW$T$33)
    2549                      .dwattr $C$DW$321, DW_AT_name("estHandle")
    2550                      .dwattr $C$DW$321, DW_AT_TI_symbol_name("_estHandle")
    2551                      .dwattr $C$DW$321, DW_AT_data_member_location[DW_OP_plus_uconst 0x18]
    2552                      .dwattr $C$DW$321, DW_AT_accessibility(DW_ACCESS_public)
    2553              $C$DW$322       .dwtag  DW_TAG_member
    2554                      .dwattr $C$DW$322, DW_AT_type(*$C$DW$T$35)
    2555                      .dwattr $C$DW$322, DW_AT_name("parkHandle")
    2556                      .dwattr $C$DW$322, DW_AT_TI_symbol_name("_parkHandle")
    2557                      .dwattr $C$DW$322, DW_AT_data_member_location[DW_OP_plus_uconst 0x1a]
    2558                      .dwattr $C$DW$322, DW_AT_accessibility(DW_ACCESS_public)
    2559              $C$DW$323       .dwtag  DW_TAG_member
    2560                      .dwattr $C$DW$323, DW_AT_type(*$C$DW$T$36)
    2561                      .dwattr $C$DW$323, DW_AT_name("park")
    2562                      .dwattr $C$DW$323, DW_AT_TI_symbol_name("_park")
    2563                      .dwattr $C$DW$323, DW_AT_data_member_location[DW_OP_plus_uconst 0x1c]
    2564                      .dwattr $C$DW$323, DW_AT_accessibility(DW_ACCESS_public)
    2565              $C$DW$324       .dwtag  DW_TAG_member
    2566                      .dwattr $C$DW$324, DW_AT_type(*$C$DW$T$38)
    2567                      .dwattr $C$DW$324, DW_AT_name("pidHandle_Id")
    2568                      .dwattr $C$DW$324, DW_AT_TI_symbol_name("_pidHandle_Id")
    2569                      .dwattr $C$DW$324, DW_AT_data_member_location[DW_OP_plus_uconst 0x20]
    2570                      .dwattr $C$DW$324, DW_AT_accessibility(DW_ACCESS_public)
    2571              $C$DW$325       .dwtag  DW_TAG_member
    2572                      .dwattr $C$DW$325, DW_AT_type(*$C$DW$T$39)
    2573                      .dwattr $C$DW$325, DW_AT_name("pid_Id")
    2574                      .dwattr $C$DW$325, DW_AT_TI_symbol_name("_pid_Id")
    2575                      .dwattr $C$DW$325, DW_AT_data_member_location[DW_OP_plus_uconst 0x22]
    2576                      .dwattr $C$DW$325, DW_AT_accessibility(DW_ACCESS_public)
    2577              $C$DW$326       .dwtag  DW_TAG_member
    2578                      .dwattr $C$DW$326, DW_AT_type(*$C$DW$T$38)
    2579                      .dwattr $C$DW$326, DW_AT_name("pidHandle_Iq")
    2580                      .dwattr $C$DW$326, DW_AT_TI_symbol_name("_pidHandle_Iq")
TMS320C2000 Assembler PC v6.2.5 Tue Sep 12 21:00:19 2017

Tools Copyright (c) 1996-2014 Texas Instruments Incorporated
C:\Users\wmj\AppData\Local\Temp\1224411                              PAGE   52

    2581                      .dwattr $C$DW$326, DW_AT_data_member_location[DW_OP_plus_uconst 0x32]
    2582                      .dwattr $C$DW$326, DW_AT_accessibility(DW_ACCESS_public)
    2583              $C$DW$327       .dwtag  DW_TAG_member
    2584                      .dwattr $C$DW$327, DW_AT_type(*$C$DW$T$39)
    2585                      .dwattr $C$DW$327, DW_AT_name("pid_Iq")
    2586                      .dwattr $C$DW$327, DW_AT_TI_symbol_name("_pid_Iq")
    2587                      .dwattr $C$DW$327, DW_AT_data_member_location[DW_OP_plus_uconst 0x34]
    2588                      .dwattr $C$DW$327, DW_AT_accessibility(DW_ACCESS_public)
    2589              $C$DW$328       .dwtag  DW_TAG_member
    2590                      .dwattr $C$DW$328, DW_AT_type(*$C$DW$T$38)
    2591                      .dwattr $C$DW$328, DW_AT_name("pidHandle_spd")
    2592                      .dwattr $C$DW$328, DW_AT_TI_symbol_name("_pidHandle_spd")
    2593                      .dwattr $C$DW$328, DW_AT_data_member_location[DW_OP_plus_uconst 0x44]
    2594                      .dwattr $C$DW$328, DW_AT_accessibility(DW_ACCESS_public)
    2595              $C$DW$329       .dwtag  DW_TAG_member
    2596                      .dwattr $C$DW$329, DW_AT_type(*$C$DW$T$39)
    2597                      .dwattr $C$DW$329, DW_AT_name("pid_spd")
    2598                      .dwattr $C$DW$329, DW_AT_TI_symbol_name("_pid_spd")
    2599                      .dwattr $C$DW$329, DW_AT_data_member_location[DW_OP_plus_uconst 0x46]
    2600                      .dwattr $C$DW$329, DW_AT_accessibility(DW_ACCESS_public)
    2601              $C$DW$330       .dwtag  DW_TAG_member
    2602                      .dwattr $C$DW$330, DW_AT_type(*$C$DW$T$41)
    2603                      .dwattr $C$DW$330, DW_AT_name("iparkHandle")
    2604                      .dwattr $C$DW$330, DW_AT_TI_symbol_name("_iparkHandle")
    2605                      .dwattr $C$DW$330, DW_AT_data_member_location[DW_OP_plus_uconst 0x56]
    2606                      .dwattr $C$DW$330, DW_AT_accessibility(DW_ACCESS_public)
    2607              $C$DW$331       .dwtag  DW_TAG_member
    2608                      .dwattr $C$DW$331, DW_AT_type(*$C$DW$T$42)
    2609                      .dwattr $C$DW$331, DW_AT_name("ipark")
    2610                      .dwattr $C$DW$331, DW_AT_TI_symbol_name("_ipark")
    2611                      .dwattr $C$DW$331, DW_AT_data_member_location[DW_OP_plus_uconst 0x58]
    2612                      .dwattr $C$DW$331, DW_AT_accessibility(DW_ACCESS_public)
    2613              $C$DW$332       .dwtag  DW_TAG_member
    2614                      .dwattr $C$DW$332, DW_AT_type(*$C$DW$T$44)
    2615                      .dwattr $C$DW$332, DW_AT_name("svgenHandle")
    2616                      .dwattr $C$DW$332, DW_AT_TI_symbol_name("_svgenHandle")
    2617                      .dwattr $C$DW$332, DW_AT_data_member_location[DW_OP_plus_uconst 0x5c]
    2618                      .dwattr $C$DW$332, DW_AT_accessibility(DW_ACCESS_public)
    2619              $C$DW$333       .dwtag  DW_TAG_member
    2620                      .dwattr $C$DW$333, DW_AT_type(*$C$DW$T$45)
    2621                      .dwattr $C$DW$333, DW_AT_name("svgen")
    2622                      .dwattr $C$DW$333, DW_AT_TI_symbol_name("_svgen")
    2623                      .dwattr $C$DW$333, DW_AT_data_member_location[DW_OP_plus_uconst 0x5e]
    2624                      .dwattr $C$DW$333, DW_AT_accessibility(DW_ACCESS_public)
    2625              $C$DW$334       .dwtag  DW_TAG_member
    2626                      .dwattr $C$DW$334, DW_AT_type(*$C$DW$T$47)
    2627                      .dwattr $C$DW$334, DW_AT_name("trajHandle_Id")
    2628                      .dwattr $C$DW$334, DW_AT_TI_symbol_name("_trajHandle_Id")
    2629                      .dwattr $C$DW$334, DW_AT_data_member_location[DW_OP_plus_uconst 0x60]
    2630                      .dwattr $C$DW$334, DW_AT_accessibility(DW_ACCESS_public)
    2631              $C$DW$335       .dwtag  DW_TAG_member
    2632                      .dwattr $C$DW$335, DW_AT_type(*$C$DW$T$48)
    2633                      .dwattr $C$DW$335, DW_AT_name("traj_Id")
    2634                      .dwattr $C$DW$335, DW_AT_TI_symbol_name("_traj_Id")
    2635                      .dwattr $C$DW$335, DW_AT_data_member_location[DW_OP_plus_uconst 0x62]
TMS320C2000 Assembler PC v6.2.5 Tue Sep 12 21:00:19 2017

Tools Copyright (c) 1996-2014 Texas Instruments Incorporated
C:\Users\wmj\AppData\Local\Temp\1224411                              PAGE   53

    2636                      .dwattr $C$DW$335, DW_AT_accessibility(DW_ACCESS_public)
    2637              $C$DW$336       .dwtag  DW_TAG_member
    2638                      .dwattr $C$DW$336, DW_AT_type(*$C$DW$T$47)
    2639                      .dwattr $C$DW$336, DW_AT_name("trajHandle_spd")
    2640                      .dwattr $C$DW$336, DW_AT_TI_symbol_name("_trajHandle_spd")
    2641                      .dwattr $C$DW$336, DW_AT_data_member_location[DW_OP_plus_uconst 0x6c]
    2642                      .dwattr $C$DW$336, DW_AT_accessibility(DW_ACCESS_public)
    2643              $C$DW$337       .dwtag  DW_TAG_member
    2644                      .dwattr $C$DW$337, DW_AT_type(*$C$DW$T$48)
    2645                      .dwattr $C$DW$337, DW_AT_name("traj_spd")
    2646                      .dwattr $C$DW$337, DW_AT_TI_symbol_name("_traj_spd")
    2647                      .dwattr $C$DW$337, DW_AT_data_member_location[DW_OP_plus_uconst 0x6e]
    2648                      .dwattr $C$DW$337, DW_AT_accessibility(DW_ACCESS_public)
    2649              $C$DW$338       .dwtag  DW_TAG_member
    2650                      .dwattr $C$DW$338, DW_AT_type(*$C$DW$T$47)
    2651                      .dwattr $C$DW$338, DW_AT_name("trajHandle_spdMax")
    2652                      .dwattr $C$DW$338, DW_AT_TI_symbol_name("_trajHandle_spdMax")
    2653                      .dwattr $C$DW$338, DW_AT_data_member_location[DW_OP_plus_uconst 0x78]
    2654                      .dwattr $C$DW$338, DW_AT_accessibility(DW_ACCESS_public)
    2655              $C$DW$339       .dwtag  DW_TAG_member
    2656                      .dwattr $C$DW$339, DW_AT_type(*$C$DW$T$48)
    2657                      .dwattr $C$DW$339, DW_AT_name("traj_spdMax")
    2658                      .dwattr $C$DW$339, DW_AT_TI_symbol_name("_traj_spdMax")
    2659                      .dwattr $C$DW$339, DW_AT_data_member_location[DW_OP_plus_uconst 0x7a]
    2660                      .dwattr $C$DW$339, DW_AT_accessibility(DW_ACCESS_public)
    2661              $C$DW$340       .dwtag  DW_TAG_member
    2662                      .dwattr $C$DW$340, DW_AT_type(*$C$DW$T$49)
    2663                      .dwattr $C$DW$340, DW_AT_name("motorParams")
    2664                      .dwattr $C$DW$340, DW_AT_TI_symbol_name("_motorParams")
    2665                      .dwattr $C$DW$340, DW_AT_data_member_location[DW_OP_plus_uconst 0x84]
    2666                      .dwattr $C$DW$340, DW_AT_accessibility(DW_ACCESS_public)
    2667              $C$DW$341       .dwtag  DW_TAG_member
    2668                      .dwattr $C$DW$341, DW_AT_type(*$C$DW$T$52)
    2669                      .dwattr $C$DW$341, DW_AT_name("waitTimes")
    2670                      .dwattr $C$DW$341, DW_AT_TI_symbol_name("_waitTimes")
    2671                      .dwattr $C$DW$341, DW_AT_data_member_location[DW_OP_plus_uconst 0x92]
    2672                      .dwattr $C$DW$341, DW_AT_accessibility(DW_ACCESS_public)
    2673              $C$DW$342       .dwtag  DW_TAG_member
    2674                      .dwattr $C$DW$342, DW_AT_type(*$C$DW$T$51)
    2675                      .dwattr $C$DW$342, DW_AT_name("counter_state")
    2676                      .dwattr $C$DW$342, DW_AT_TI_symbol_name("_counter_state")
    2677                      .dwattr $C$DW$342, DW_AT_data_member_location[DW_OP_plus_uconst 0x9a]
    2678                      .dwattr $C$DW$342, DW_AT_accessibility(DW_ACCESS_public)
    2679              $C$DW$343       .dwtag  DW_TAG_member
    2680                      .dwattr $C$DW$343, DW_AT_type(*$C$DW$T$53)
    2681                      .dwattr $C$DW$343, DW_AT_name("numIsrTicksPerCtrlTick")
    2682                      .dwattr $C$DW$343, DW_AT_TI_symbol_name("_numIsrTicksPerCtrlTick")
    2683                      .dwattr $C$DW$343, DW_AT_data_member_location[DW_OP_plus_uconst 0x9c]
    2684                      .dwattr $C$DW$343, DW_AT_accessibility(DW_ACCESS_public)
    2685              $C$DW$344       .dwtag  DW_TAG_member
    2686                      .dwattr $C$DW$344, DW_AT_type(*$C$DW$T$53)
    2687                      .dwattr $C$DW$344, DW_AT_name("numCtrlTicksPerCurrentTick")
    2688                      .dwattr $C$DW$344, DW_AT_TI_symbol_name("_numCtrlTicksPerCurrentTick")
    2689                      .dwattr $C$DW$344, DW_AT_data_member_location[DW_OP_plus_uconst 0x9d]
    2690                      .dwattr $C$DW$344, DW_AT_accessibility(DW_ACCESS_public)
TMS320C2000 Assembler PC v6.2.5 Tue Sep 12 21:00:19 2017

Tools Copyright (c) 1996-2014 Texas Instruments Incorporated
C:\Users\wmj\AppData\Local\Temp\1224411                              PAGE   54

    2691              $C$DW$345       .dwtag  DW_TAG_member
    2692                      .dwattr $C$DW$345, DW_AT_type(*$C$DW$T$53)
    2693                      .dwattr $C$DW$345, DW_AT_name("numCtrlTicksPerSpeedTick")
    2694                      .dwattr $C$DW$345, DW_AT_TI_symbol_name("_numCtrlTicksPerSpeedTick")
    2695                      .dwattr $C$DW$345, DW_AT_data_member_location[DW_OP_plus_uconst 0x9e]
    2696                      .dwattr $C$DW$345, DW_AT_accessibility(DW_ACCESS_public)
    2697              $C$DW$346       .dwtag  DW_TAG_member
    2698                      .dwattr $C$DW$346, DW_AT_type(*$C$DW$T$53)
    2699                      .dwattr $C$DW$346, DW_AT_name("numCtrlTicksPerTrajTick")
    2700                      .dwattr $C$DW$346, DW_AT_TI_symbol_name("_numCtrlTicksPerTrajTick")
    2701                      .dwattr $C$DW$346, DW_AT_data_member_location[DW_OP_plus_uconst 0x9f]
    2702                      .dwattr $C$DW$346, DW_AT_accessibility(DW_ACCESS_public)
    2703              $C$DW$347       .dwtag  DW_TAG_member
    2704                      .dwattr $C$DW$347, DW_AT_type(*$C$DW$T$51)
    2705                      .dwattr $C$DW$347, DW_AT_name("ctrlFreq_Hz")
    2706                      .dwattr $C$DW$347, DW_AT_TI_symbol_name("_ctrlFreq_Hz")
    2707                      .dwattr $C$DW$347, DW_AT_data_member_location[DW_OP_plus_uconst 0xa0]
    2708                      .dwattr $C$DW$347, DW_AT_accessibility(DW_ACCESS_public)
    2709              $C$DW$348       .dwtag  DW_TAG_member
    2710                      .dwattr $C$DW$348, DW_AT_type(*$C$DW$T$51)
    2711                      .dwattr $C$DW$348, DW_AT_name("trajFreq_Hz")
    2712                      .dwattr $C$DW$348, DW_AT_TI_symbol_name("_trajFreq_Hz")
    2713                      .dwattr $C$DW$348, DW_AT_data_member_location[DW_OP_plus_uconst 0xa2]
    2714                      .dwattr $C$DW$348, DW_AT_accessibility(DW_ACCESS_public)
    2715              $C$DW$349       .dwtag  DW_TAG_member
    2716                      .dwattr $C$DW$349, DW_AT_type(*$C$DW$T$20)
    2717                      .dwattr $C$DW$349, DW_AT_name("trajPeriod_sec")
    2718                      .dwattr $C$DW$349, DW_AT_TI_symbol_name("_trajPeriod_sec")
    2719                      .dwattr $C$DW$349, DW_AT_data_member_location[DW_OP_plus_uconst 0xa4]
    2720                      .dwattr $C$DW$349, DW_AT_accessibility(DW_ACCESS_public)
    2721              $C$DW$350       .dwtag  DW_TAG_member
    2722                      .dwattr $C$DW$350, DW_AT_type(*$C$DW$T$54)
    2723                      .dwattr $C$DW$350, DW_AT_name("ctrlPeriod_sec")
    2724                      .dwattr $C$DW$350, DW_AT_TI_symbol_name("_ctrlPeriod_sec")
    2725                      .dwattr $C$DW$350, DW_AT_data_member_location[DW_OP_plus_uconst 0xa6]
    2726                      .dwattr $C$DW$350, DW_AT_accessibility(DW_ACCESS_public)
    2727              $C$DW$351       .dwtag  DW_TAG_member
    2728                      .dwattr $C$DW$351, DW_AT_type(*$C$DW$T$20)
    2729                      .dwattr $C$DW$351, DW_AT_name("maxVsMag_pu")
    2730                      .dwattr $C$DW$351, DW_AT_TI_symbol_name("_maxVsMag_pu")
    2731                      .dwattr $C$DW$351, DW_AT_data_member_location[DW_OP_plus_uconst 0xa8]
    2732                      .dwattr $C$DW$351, DW_AT_accessibility(DW_ACCESS_public)
    2733              $C$DW$352       .dwtag  DW_TAG_member
    2734                      .dwattr $C$DW$352, DW_AT_type(*$C$DW$T$55)
    2735                      .dwattr $C$DW$352, DW_AT_name("Iab_in")
    2736                      .dwattr $C$DW$352, DW_AT_TI_symbol_name("_Iab_in")
    2737                      .dwattr $C$DW$352, DW_AT_data_member_location[DW_OP_plus_uconst 0xaa]
    2738                      .dwattr $C$DW$352, DW_AT_accessibility(DW_ACCESS_public)
    2739              $C$DW$353       .dwtag  DW_TAG_member
    2740                      .dwattr $C$DW$353, DW_AT_type(*$C$DW$T$55)
    2741                      .dwattr $C$DW$353, DW_AT_name("Iab_filt")
    2742                      .dwattr $C$DW$353, DW_AT_TI_symbol_name("_Iab_filt")
    2743                      .dwattr $C$DW$353, DW_AT_data_member_location[DW_OP_plus_uconst 0xae]
    2744                      .dwattr $C$DW$353, DW_AT_accessibility(DW_ACCESS_public)
    2745              $C$DW$354       .dwtag  DW_TAG_member
TMS320C2000 Assembler PC v6.2.5 Tue Sep 12 21:00:19 2017

Tools Copyright (c) 1996-2014 Texas Instruments Incorporated
C:\Users\wmj\AppData\Local\Temp\1224411                              PAGE   55

    2746                      .dwattr $C$DW$354, DW_AT_type(*$C$DW$T$55)
    2747                      .dwattr $C$DW$354, DW_AT_name("Idq_in")
    2748                      .dwattr $C$DW$354, DW_AT_TI_symbol_name("_Idq_in")
    2749                      .dwattr $C$DW$354, DW_AT_data_member_location[DW_OP_plus_uconst 0xb2]
    2750                      .dwattr $C$DW$354, DW_AT_accessibility(DW_ACCESS_public)
    2751              $C$DW$355       .dwtag  DW_TAG_member
    2752                      .dwattr $C$DW$355, DW_AT_type(*$C$DW$T$55)
    2753                      .dwattr $C$DW$355, DW_AT_name("Vab_in")
    2754                      .dwattr $C$DW$355, DW_AT_TI_symbol_name("_Vab_in")
    2755                      .dwattr $C$DW$355, DW_AT_data_member_location[DW_OP_plus_uconst 0xb6]
    2756                      .dwattr $C$DW$355, DW_AT_accessibility(DW_ACCESS_public)
    2757              $C$DW$356       .dwtag  DW_TAG_member
    2758                      .dwattr $C$DW$356, DW_AT_type(*$C$DW$T$20)
    2759                      .dwattr $C$DW$356, DW_AT_name("spd_out")
    2760                      .dwattr $C$DW$356, DW_AT_TI_symbol_name("_spd_out")
    2761                      .dwattr $C$DW$356, DW_AT_data_member_location[DW_OP_plus_uconst 0xba]
    2762                      .dwattr $C$DW$356, DW_AT_accessibility(DW_ACCESS_public)
    2763              $C$DW$357       .dwtag  DW_TAG_member
    2764                      .dwattr $C$DW$357, DW_AT_type(*$C$DW$T$55)
    2765                      .dwattr $C$DW$357, DW_AT_name("Vab_out")
    2766                      .dwattr $C$DW$357, DW_AT_TI_symbol_name("_Vab_out")
    2767                      .dwattr $C$DW$357, DW_AT_data_member_location[DW_OP_plus_uconst 0xbc]
    2768                      .dwattr $C$DW$357, DW_AT_accessibility(DW_ACCESS_public)
    2769              $C$DW$358       .dwtag  DW_TAG_member
    2770                      .dwattr $C$DW$358, DW_AT_type(*$C$DW$T$55)
    2771                      .dwattr $C$DW$358, DW_AT_name("Vdq_out")
    2772                      .dwattr $C$DW$358, DW_AT_TI_symbol_name("_Vdq_out")
    2773                      .dwattr $C$DW$358, DW_AT_data_member_location[DW_OP_plus_uconst 0xc0]
    2774                      .dwattr $C$DW$358, DW_AT_accessibility(DW_ACCESS_public)
    2775              $C$DW$359       .dwtag  DW_TAG_member
    2776                      .dwattr $C$DW$359, DW_AT_type(*$C$DW$T$54)
    2777                      .dwattr $C$DW$359, DW_AT_name("Rhf")
    2778                      .dwattr $C$DW$359, DW_AT_TI_symbol_name("_Rhf")
    2779                      .dwattr $C$DW$359, DW_AT_data_member_location[DW_OP_plus_uconst 0xc4]
    2780                      .dwattr $C$DW$359, DW_AT_accessibility(DW_ACCESS_public)
    2781              $C$DW$360       .dwtag  DW_TAG_member
    2782                      .dwattr $C$DW$360, DW_AT_type(*$C$DW$T$54)
    2783                      .dwattr $C$DW$360, DW_AT_name("Lhf")
    2784                      .dwattr $C$DW$360, DW_AT_TI_symbol_name("_Lhf")
    2785                      .dwattr $C$DW$360, DW_AT_data_member_location[DW_OP_plus_uconst 0xc6]
    2786                      .dwattr $C$DW$360, DW_AT_accessibility(DW_ACCESS_public)
    2787              $C$DW$361       .dwtag  DW_TAG_member
    2788                      .dwattr $C$DW$361, DW_AT_type(*$C$DW$T$54)
    2789                      .dwattr $C$DW$361, DW_AT_name("RoverL")
    2790                      .dwattr $C$DW$361, DW_AT_TI_symbol_name("_RoverL")
    2791                      .dwattr $C$DW$361, DW_AT_data_member_location[DW_OP_plus_uconst 0xc8]
    2792                      .dwattr $C$DW$361, DW_AT_accessibility(DW_ACCESS_public)
    2793              $C$DW$362       .dwtag  DW_TAG_member
    2794                      .dwattr $C$DW$362, DW_AT_type(*$C$DW$T$20)
    2795                      .dwattr $C$DW$362, DW_AT_name("Kp_Id")
    2796                      .dwattr $C$DW$362, DW_AT_TI_symbol_name("_Kp_Id")
    2797                      .dwattr $C$DW$362, DW_AT_data_member_location[DW_OP_plus_uconst 0xca]
    2798                      .dwattr $C$DW$362, DW_AT_accessibility(DW_ACCESS_public)
    2799              $C$DW$363       .dwtag  DW_TAG_member
    2800                      .dwattr $C$DW$363, DW_AT_type(*$C$DW$T$20)
TMS320C2000 Assembler PC v6.2.5 Tue Sep 12 21:00:19 2017

Tools Copyright (c) 1996-2014 Texas Instruments Incorporated
C:\Users\wmj\AppData\Local\Temp\1224411                              PAGE   56

    2801                      .dwattr $C$DW$363, DW_AT_name("Kp_Iq")
    2802                      .dwattr $C$DW$363, DW_AT_TI_symbol_name("_Kp_Iq")
    2803                      .dwattr $C$DW$363, DW_AT_data_member_location[DW_OP_plus_uconst 0xcc]
    2804                      .dwattr $C$DW$363, DW_AT_accessibility(DW_ACCESS_public)
    2805              $C$DW$364       .dwtag  DW_TAG_member
    2806                      .dwattr $C$DW$364, DW_AT_type(*$C$DW$T$20)
    2807                      .dwattr $C$DW$364, DW_AT_name("Kp_spd")
    2808                      .dwattr $C$DW$364, DW_AT_TI_symbol_name("_Kp_spd")
    2809                      .dwattr $C$DW$364, DW_AT_data_member_location[DW_OP_plus_uconst 0xce]
    2810                      .dwattr $C$DW$364, DW_AT_accessibility(DW_ACCESS_public)
    2811              $C$DW$365       .dwtag  DW_TAG_member
    2812                      .dwattr $C$DW$365, DW_AT_type(*$C$DW$T$20)
    2813                      .dwattr $C$DW$365, DW_AT_name("Ki_Id")
    2814                      .dwattr $C$DW$365, DW_AT_TI_symbol_name("_Ki_Id")
    2815                      .dwattr $C$DW$365, DW_AT_data_member_location[DW_OP_plus_uconst 0xd0]
    2816                      .dwattr $C$DW$365, DW_AT_accessibility(DW_ACCESS_public)
    2817              $C$DW$366       .dwtag  DW_TAG_member
    2818                      .dwattr $C$DW$366, DW_AT_type(*$C$DW$T$20)
    2819                      .dwattr $C$DW$366, DW_AT_name("Ki_Iq")
    2820                      .dwattr $C$DW$366, DW_AT_TI_symbol_name("_Ki_Iq")
    2821                      .dwattr $C$DW$366, DW_AT_data_member_location[DW_OP_plus_uconst 0xd2]
    2822                      .dwattr $C$DW$366, DW_AT_accessibility(DW_ACCESS_public)
    2823              $C$DW$367       .dwtag  DW_TAG_member
    2824                      .dwattr $C$DW$367, DW_AT_type(*$C$DW$T$20)
    2825                      .dwattr $C$DW$367, DW_AT_name("Ki_spd")
    2826                      .dwattr $C$DW$367, DW_AT_TI_symbol_name("_Ki_spd")
    2827                      .dwattr $C$DW$367, DW_AT_data_member_location[DW_OP_plus_uconst 0xd4]
    2828                      .dwattr $C$DW$367, DW_AT_accessibility(DW_ACCESS_public)
    2829              $C$DW$368       .dwtag  DW_TAG_member
    2830                      .dwattr $C$DW$368, DW_AT_type(*$C$DW$T$20)
    2831                      .dwattr $C$DW$368, DW_AT_name("Kd_Id")
    2832                      .dwattr $C$DW$368, DW_AT_TI_symbol_name("_Kd_Id")
    2833                      .dwattr $C$DW$368, DW_AT_data_member_location[DW_OP_plus_uconst 0xd6]
    2834                      .dwattr $C$DW$368, DW_AT_accessibility(DW_ACCESS_public)
    2835              $C$DW$369       .dwtag  DW_TAG_member
    2836                      .dwattr $C$DW$369, DW_AT_type(*$C$DW$T$20)
    2837                      .dwattr $C$DW$369, DW_AT_name("Kd_Iq")
    2838                      .dwattr $C$DW$369, DW_AT_TI_symbol_name("_Kd_Iq")
    2839                      .dwattr $C$DW$369, DW_AT_data_member_location[DW_OP_plus_uconst 0xd8]
    2840                      .dwattr $C$DW$369, DW_AT_accessibility(DW_ACCESS_public)
    2841              $C$DW$370       .dwtag  DW_TAG_member
    2842                      .dwattr $C$DW$370, DW_AT_type(*$C$DW$T$20)
    2843                      .dwattr $C$DW$370, DW_AT_name("Kd_spd")
    2844                      .dwattr $C$DW$370, DW_AT_TI_symbol_name("_Kd_spd")
    2845                      .dwattr $C$DW$370, DW_AT_data_member_location[DW_OP_plus_uconst 0xda]
    2846                      .dwattr $C$DW$370, DW_AT_accessibility(DW_ACCESS_public)
    2847              $C$DW$371       .dwtag  DW_TAG_member
    2848                      .dwattr $C$DW$371, DW_AT_type(*$C$DW$T$20)
    2849                      .dwattr $C$DW$371, DW_AT_name("Ui_Id")
    2850                      .dwattr $C$DW$371, DW_AT_TI_symbol_name("_Ui_Id")
    2851                      .dwattr $C$DW$371, DW_AT_data_member_location[DW_OP_plus_uconst 0xdc]
    2852                      .dwattr $C$DW$371, DW_AT_accessibility(DW_ACCESS_public)
    2853              $C$DW$372       .dwtag  DW_TAG_member
    2854                      .dwattr $C$DW$372, DW_AT_type(*$C$DW$T$20)
    2855                      .dwattr $C$DW$372, DW_AT_name("Ui_Iq")
TMS320C2000 Assembler PC v6.2.5 Tue Sep 12 21:00:19 2017

Tools Copyright (c) 1996-2014 Texas Instruments Incorporated
C:\Users\wmj\AppData\Local\Temp\1224411                              PAGE   57

    2856                      .dwattr $C$DW$372, DW_AT_TI_symbol_name("_Ui_Iq")
    2857                      .dwattr $C$DW$372, DW_AT_data_member_location[DW_OP_plus_uconst 0xde]
    2858                      .dwattr $C$DW$372, DW_AT_accessibility(DW_ACCESS_public)
    2859              $C$DW$373       .dwtag  DW_TAG_member
    2860                      .dwattr $C$DW$373, DW_AT_type(*$C$DW$T$20)
    2861                      .dwattr $C$DW$373, DW_AT_name("Ui_spd")
    2862                      .dwattr $C$DW$373, DW_AT_TI_symbol_name("_Ui_spd")
    2863                      .dwattr $C$DW$373, DW_AT_data_member_location[DW_OP_plus_uconst 0xe0]
    2864                      .dwattr $C$DW$373, DW_AT_accessibility(DW_ACCESS_public)
    2865              $C$DW$374       .dwtag  DW_TAG_member
    2866                      .dwattr $C$DW$374, DW_AT_type(*$C$DW$T$55)
    2867                      .dwattr $C$DW$374, DW_AT_name("Idq_ref")
    2868                      .dwattr $C$DW$374, DW_AT_TI_symbol_name("_Idq_ref")
    2869                      .dwattr $C$DW$374, DW_AT_data_member_location[DW_OP_plus_uconst 0xe2]
    2870                      .dwattr $C$DW$374, DW_AT_accessibility(DW_ACCESS_public)
    2871              $C$DW$375       .dwtag  DW_TAG_member
    2872                      .dwattr $C$DW$375, DW_AT_type(*$C$DW$T$20)
    2873                      .dwattr $C$DW$375, DW_AT_name("IdRated")
    2874                      .dwattr $C$DW$375, DW_AT_TI_symbol_name("_IdRated")
    2875                      .dwattr $C$DW$375, DW_AT_data_member_location[DW_OP_plus_uconst 0xe6]
    2876                      .dwattr $C$DW$375, DW_AT_accessibility(DW_ACCESS_public)
    2877              $C$DW$376       .dwtag  DW_TAG_member
    2878                      .dwattr $C$DW$376, DW_AT_type(*$C$DW$T$20)
    2879                      .dwattr $C$DW$376, DW_AT_name("spd_ref")
    2880                      .dwattr $C$DW$376, DW_AT_TI_symbol_name("_spd_ref")
    2881                      .dwattr $C$DW$376, DW_AT_data_member_location[DW_OP_plus_uconst 0xe8]
    2882                      .dwattr $C$DW$376, DW_AT_accessibility(DW_ACCESS_public)
    2883              $C$DW$377       .dwtag  DW_TAG_member
    2884                      .dwattr $C$DW$377, DW_AT_type(*$C$DW$T$20)
    2885                      .dwattr $C$DW$377, DW_AT_name("spd_max")
    2886                      .dwattr $C$DW$377, DW_AT_TI_symbol_name("_spd_max")
    2887                      .dwattr $C$DW$377, DW_AT_data_member_location[DW_OP_plus_uconst 0xea]
    2888                      .dwattr $C$DW$377, DW_AT_accessibility(DW_ACCESS_public)
    2889              $C$DW$378       .dwtag  DW_TAG_member
    2890                      .dwattr $C$DW$378, DW_AT_type(*$C$DW$T$53)
    2891                      .dwattr $C$DW$378, DW_AT_name("counter_current")
    2892                      .dwattr $C$DW$378, DW_AT_TI_symbol_name("_counter_current")
    2893                      .dwattr $C$DW$378, DW_AT_data_member_location[DW_OP_plus_uconst 0xec]
    2894                      .dwattr $C$DW$378, DW_AT_accessibility(DW_ACCESS_public)
    2895              $C$DW$379       .dwtag  DW_TAG_member
    2896                      .dwattr $C$DW$379, DW_AT_type(*$C$DW$T$53)
    2897                      .dwattr $C$DW$379, DW_AT_name("counter_isr")
    2898                      .dwattr $C$DW$379, DW_AT_TI_symbol_name("_counter_isr")
    2899                      .dwattr $C$DW$379, DW_AT_data_member_location[DW_OP_plus_uconst 0xed]
    2900                      .dwattr $C$DW$379, DW_AT_accessibility(DW_ACCESS_public)
    2901              $C$DW$380       .dwtag  DW_TAG_member
    2902                      .dwattr $C$DW$380, DW_AT_type(*$C$DW$T$53)
    2903                      .dwattr $C$DW$380, DW_AT_name("counter_speed")
    2904                      .dwattr $C$DW$380, DW_AT_TI_symbol_name("_counter_speed")
    2905                      .dwattr $C$DW$380, DW_AT_data_member_location[DW_OP_plus_uconst 0xee]
    2906                      .dwattr $C$DW$380, DW_AT_accessibility(DW_ACCESS_public)
    2907              $C$DW$381       .dwtag  DW_TAG_member
    2908                      .dwattr $C$DW$381, DW_AT_type(*$C$DW$T$53)
    2909                      .dwattr $C$DW$381, DW_AT_name("counter_traj")
    2910                      .dwattr $C$DW$381, DW_AT_TI_symbol_name("_counter_traj")
TMS320C2000 Assembler PC v6.2.5 Tue Sep 12 21:00:19 2017

Tools Copyright (c) 1996-2014 Texas Instruments Incorporated
C:\Users\wmj\AppData\Local\Temp\1224411                              PAGE   58

    2911                      .dwattr $C$DW$381, DW_AT_data_member_location[DW_OP_plus_uconst 0xef]
    2912                      .dwattr $C$DW$381, DW_AT_accessibility(DW_ACCESS_public)
    2913              $C$DW$382       .dwtag  DW_TAG_member
    2914                      .dwattr $C$DW$382, DW_AT_type(*$C$DW$T$56)
    2915                      .dwattr $C$DW$382, DW_AT_name("flag_enableCtrl")
    2916                      .dwattr $C$DW$382, DW_AT_TI_symbol_name("_flag_enableCtrl")
    2917                      .dwattr $C$DW$382, DW_AT_data_member_location[DW_OP_plus_uconst 0xf0]
    2918                      .dwattr $C$DW$382, DW_AT_accessibility(DW_ACCESS_public)
    2919              $C$DW$383       .dwtag  DW_TAG_member
    2920                      .dwattr $C$DW$383, DW_AT_type(*$C$DW$T$56)
    2921                      .dwattr $C$DW$383, DW_AT_name("flag_enableDcBusComp")
    2922                      .dwattr $C$DW$383, DW_AT_TI_symbol_name("_flag_enableDcBusComp")
    2923                      .dwattr $C$DW$383, DW_AT_data_member_location[DW_OP_plus_uconst 0xf1]
    2924                      .dwattr $C$DW$383, DW_AT_accessibility(DW_ACCESS_public)
    2925              $C$DW$384       .dwtag  DW_TAG_member
    2926                      .dwattr $C$DW$384, DW_AT_type(*$C$DW$T$56)
    2927                      .dwattr $C$DW$384, DW_AT_name("flag_enablePowerWarp")
    2928                      .dwattr $C$DW$384, DW_AT_TI_symbol_name("_flag_enablePowerWarp")
    2929                      .dwattr $C$DW$384, DW_AT_data_member_location[DW_OP_plus_uconst 0xf2]
    2930                      .dwattr $C$DW$384, DW_AT_accessibility(DW_ACCESS_public)
    2931              $C$DW$385       .dwtag  DW_TAG_member
    2932                      .dwattr $C$DW$385, DW_AT_type(*$C$DW$T$56)
    2933                      .dwattr $C$DW$385, DW_AT_name("flag_enableOffset")
    2934                      .dwattr $C$DW$385, DW_AT_TI_symbol_name("_flag_enableOffset")
    2935                      .dwattr $C$DW$385, DW_AT_data_member_location[DW_OP_plus_uconst 0xf3]
    2936                      .dwattr $C$DW$385, DW_AT_accessibility(DW_ACCESS_public)
    2937              $C$DW$386       .dwtag  DW_TAG_member
    2938                      .dwattr $C$DW$386, DW_AT_type(*$C$DW$T$56)
    2939                      .dwattr $C$DW$386, DW_AT_name("flag_enableSpeedCtrl")
    2940                      .dwattr $C$DW$386, DW_AT_TI_symbol_name("_flag_enableSpeedCtrl")
    2941                      .dwattr $C$DW$386, DW_AT_data_member_location[DW_OP_plus_uconst 0xf4]
    2942                      .dwattr $C$DW$386, DW_AT_accessibility(DW_ACCESS_public)
    2943              $C$DW$387       .dwtag  DW_TAG_member
    2944                      .dwattr $C$DW$387, DW_AT_type(*$C$DW$T$56)
    2945                      .dwattr $C$DW$387, DW_AT_name("flag_enableUserMotorParams")
    2946                      .dwattr $C$DW$387, DW_AT_TI_symbol_name("_flag_enableUserMotorParams")
    2947                      .dwattr $C$DW$387, DW_AT_data_member_location[DW_OP_plus_uconst 0xf5]
    2948                      .dwattr $C$DW$387, DW_AT_accessibility(DW_ACCESS_public)
    2949              $C$DW$388       .dwtag  DW_TAG_member
    2950                      .dwattr $C$DW$388, DW_AT_type(*$C$DW$T$55)
    2951                      .dwattr $C$DW$388, DW_AT_name("Idq_offset_pu")
    2952                      .dwattr $C$DW$388, DW_AT_TI_symbol_name("_Idq_offset_pu")
    2953                      .dwattr $C$DW$388, DW_AT_data_member_location[DW_OP_plus_uconst 0xf6]
    2954                      .dwattr $C$DW$388, DW_AT_accessibility(DW_ACCESS_public)
    2955              $C$DW$389       .dwtag  DW_TAG_member
    2956                      .dwattr $C$DW$389, DW_AT_type(*$C$DW$T$55)
    2957                      .dwattr $C$DW$389, DW_AT_name("Vdq_offset_pu")
    2958                      .dwattr $C$DW$389, DW_AT_TI_symbol_name("_Vdq_offset_pu")
    2959                      .dwattr $C$DW$389, DW_AT_data_member_location[DW_OP_plus_uconst 0xfa]
    2960                      .dwattr $C$DW$389, DW_AT_accessibility(DW_ACCESS_public)
    2961              $C$DW$390       .dwtag  DW_TAG_member
    2962                      .dwattr $C$DW$390, DW_AT_type(*$C$DW$T$20)
    2963                      .dwattr $C$DW$390, DW_AT_name("angle_pu")
    2964                      .dwattr $C$DW$390, DW_AT_TI_symbol_name("_angle_pu")
    2965                      .dwattr $C$DW$390, DW_AT_data_member_location[DW_OP_plus_uconst 0xfe]
TMS320C2000 Assembler PC v6.2.5 Tue Sep 12 21:00:19 2017

Tools Copyright (c) 1996-2014 Texas Instruments Incorporated
C:\Users\wmj\AppData\Local\Temp\1224411                              PAGE   59

    2966                      .dwattr $C$DW$390, DW_AT_accessibility(DW_ACCESS_public)
    2967              $C$DW$391       .dwtag  DW_TAG_member
    2968                      .dwattr $C$DW$391, DW_AT_type(*$C$DW$T$20)
    2969                      .dwattr $C$DW$391, DW_AT_name("speed_ref_pu")
    2970                      .dwattr $C$DW$391, DW_AT_TI_symbol_name("_speed_ref_pu")
    2971                      .dwattr $C$DW$391, DW_AT_data_member_location[DW_OP_plus_uconst 0x100]
    2972                      .dwattr $C$DW$391, DW_AT_accessibility(DW_ACCESS_public)
    2973              $C$DW$392       .dwtag  DW_TAG_member
    2974                      .dwattr $C$DW$392, DW_AT_type(*$C$DW$T$20)
    2975                      .dwattr $C$DW$392, DW_AT_name("speed_fb_pu")
    2976                      .dwattr $C$DW$392, DW_AT_TI_symbol_name("_speed_fb_pu")
    2977                      .dwattr $C$DW$392, DW_AT_data_member_location[DW_OP_plus_uconst 0x102]
    2978                      .dwattr $C$DW$392, DW_AT_accessibility(DW_ACCESS_public)
    2979              $C$DW$393       .dwtag  DW_TAG_member
    2980                      .dwattr $C$DW$393, DW_AT_type(*$C$DW$T$20)
    2981                      .dwattr $C$DW$393, DW_AT_name("speed_outMax_pu")
    2982                      .dwattr $C$DW$393, DW_AT_TI_symbol_name("_speed_outMax_pu")
    2983                      .dwattr $C$DW$393, DW_AT_data_member_location[DW_OP_plus_uconst 0x104]
    2984                      .dwattr $C$DW$393, DW_AT_accessibility(DW_ACCESS_public)
    2985              $C$DW$394       .dwtag  DW_TAG_member
    2986                      .dwattr $C$DW$394, DW_AT_type(*$C$DW$T$56)
    2987                      .dwattr $C$DW$394, DW_AT_name("flag_enableCurrentCtrl")
    2988                      .dwattr $C$DW$394, DW_AT_TI_symbol_name("_flag_enableCurrentCtrl")
    2989                      .dwattr $C$DW$394, DW_AT_data_member_location[DW_OP_plus_uconst 0x106]
    2990                      .dwattr $C$DW$394, DW_AT_accessibility(DW_ACCESS_public)
    2991                      .dwendtag $C$DW$T$57
    2992              
    2993              $C$DW$T$82      .dwtag  DW_TAG_typedef, DW_AT_name("CTRL_Obj")
    2994                      .dwattr $C$DW$T$82, DW_AT_type(*$C$DW$T$57)
    2995                      .dwattr $C$DW$T$82, DW_AT_language(DW_LANG_C)
    2996              $C$DW$T$83      .dwtag  DW_TAG_pointer_type
    2997                      .dwattr $C$DW$T$83, DW_AT_type(*$C$DW$T$57)
    2998                      .dwattr $C$DW$T$83, DW_AT_address_class(0x16)
    2999              $C$DW$T$84      .dwtag  DW_TAG_typedef, DW_AT_name("CTRL_Handle")
    3000                      .dwattr $C$DW$T$84, DW_AT_type(*$C$DW$T$83)
    3001                      .dwattr $C$DW$T$84, DW_AT_language(DW_LANG_C)
    3002              $C$DW$395       .dwtag  DW_TAG_TI_far_type
    3003                      .dwattr $C$DW$395, DW_AT_type(*$C$DW$T$84)
    3004              $C$DW$T$85      .dwtag  DW_TAG_const_type
    3005                      .dwattr $C$DW$T$85, DW_AT_type(*$C$DW$395)
    3006              
    3007              $C$DW$T$60      .dwtag  DW_TAG_structure_type
    3008                      .dwattr $C$DW$T$60, DW_AT_name("_CTRL_Version_")
    3009                      .dwattr $C$DW$T$60, DW_AT_byte_size(0x04)
    3010              $C$DW$396       .dwtag  DW_TAG_member
    3011                      .dwattr $C$DW$396, DW_AT_type(*$C$DW$T$21)
    3012                      .dwattr $C$DW$396, DW_AT_name("rsvd")
    3013                      .dwattr $C$DW$396, DW_AT_TI_symbol_name("_rsvd")
    3014                      .dwattr $C$DW$396, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    3015                      .dwattr $C$DW$396, DW_AT_accessibility(DW_ACCESS_public)
    3016              $C$DW$397       .dwtag  DW_TAG_member
    3017                      .dwattr $C$DW$397, DW_AT_type(*$C$DW$T$59)
    3018                      .dwattr $C$DW$397, DW_AT_name("targetProc")
    3019                      .dwattr $C$DW$397, DW_AT_TI_symbol_name("_targetProc")
    3020                      .dwattr $C$DW$397, DW_AT_data_member_location[DW_OP_plus_uconst 0x1]
TMS320C2000 Assembler PC v6.2.5 Tue Sep 12 21:00:19 2017

Tools Copyright (c) 1996-2014 Texas Instruments Incorporated
C:\Users\wmj\AppData\Local\Temp\1224411                              PAGE   60

    3021                      .dwattr $C$DW$397, DW_AT_accessibility(DW_ACCESS_public)
    3022              $C$DW$398       .dwtag  DW_TAG_member
    3023                      .dwattr $C$DW$398, DW_AT_type(*$C$DW$T$21)
    3024                      .dwattr $C$DW$398, DW_AT_name("major")
    3025                      .dwattr $C$DW$398, DW_AT_TI_symbol_name("_major")
    3026                      .dwattr $C$DW$398, DW_AT_data_member_location[DW_OP_plus_uconst 0x2]
    3027                      .dwattr $C$DW$398, DW_AT_accessibility(DW_ACCESS_public)
    3028              $C$DW$399       .dwtag  DW_TAG_member
    3029                      .dwattr $C$DW$399, DW_AT_type(*$C$DW$T$21)
    3030                      .dwattr $C$DW$399, DW_AT_name("minor")
    3031                      .dwattr $C$DW$399, DW_AT_TI_symbol_name("_minor")
    3032                      .dwattr $C$DW$399, DW_AT_data_member_location[DW_OP_plus_uconst 0x3]
    3033                      .dwattr $C$DW$399, DW_AT_accessibility(DW_ACCESS_public)
    3034                      .dwendtag $C$DW$T$60
    3035              
    3036              $C$DW$T$24      .dwtag  DW_TAG_typedef, DW_AT_name("CTRL_Version")
    3037                      .dwattr $C$DW$T$24, DW_AT_type(*$C$DW$T$60)
    3038                      .dwattr $C$DW$T$24, DW_AT_language(DW_LANG_C)
    3039              
    3040              $C$DW$T$19      .dwtag  DW_TAG_structure_type
    3041                      .dwattr $C$DW$T$19, DW_AT_name("_EST_Obj_")
    3042                      .dwattr $C$DW$T$19, DW_AT_declaration
    3043                      .dwendtag $C$DW$T$19
    3044              
    3045              $C$DW$T$32      .dwtag  DW_TAG_pointer_type
    3046                      .dwattr $C$DW$T$32, DW_AT_type(*$C$DW$T$19)
    3047                      .dwattr $C$DW$T$32, DW_AT_address_class(0x16)
    3048              $C$DW$T$33      .dwtag  DW_TAG_typedef, DW_AT_name("EST_Handle")
    3049                      .dwattr $C$DW$T$33, DW_AT_type(*$C$DW$T$32)
    3050                      .dwattr $C$DW$T$33, DW_AT_language(DW_LANG_C)
    3051              
    3052              $C$DW$T$61      .dwtag  DW_TAG_structure_type
    3053                      .dwattr $C$DW$T$61, DW_AT_name("_IPARK_Obj_")
    3054                      .dwattr $C$DW$T$61, DW_AT_byte_size(0x04)
    3055              $C$DW$400       .dwtag  DW_TAG_member
    3056                      .dwattr $C$DW$400, DW_AT_type(*$C$DW$T$20)
    3057                      .dwattr $C$DW$400, DW_AT_name("sinTh")
    3058                      .dwattr $C$DW$400, DW_AT_TI_symbol_name("_sinTh")
    3059                      .dwattr $C$DW$400, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    3060                      .dwattr $C$DW$400, DW_AT_accessibility(DW_ACCESS_public)
    3061              $C$DW$401       .dwtag  DW_TAG_member
    3062                      .dwattr $C$DW$401, DW_AT_type(*$C$DW$T$20)
    3063                      .dwattr $C$DW$401, DW_AT_name("cosTh")
    3064                      .dwattr $C$DW$401, DW_AT_TI_symbol_name("_cosTh")
    3065                      .dwattr $C$DW$401, DW_AT_data_member_location[DW_OP_plus_uconst 0x2]
    3066                      .dwattr $C$DW$401, DW_AT_accessibility(DW_ACCESS_public)
    3067                      .dwendtag $C$DW$T$61
    3068              
    3069              $C$DW$T$42      .dwtag  DW_TAG_typedef, DW_AT_name("IPARK_Obj")
    3070                      .dwattr $C$DW$T$42, DW_AT_type(*$C$DW$T$61)
    3071                      .dwattr $C$DW$T$42, DW_AT_language(DW_LANG_C)
    3072              $C$DW$T$40      .dwtag  DW_TAG_pointer_type
    3073                      .dwattr $C$DW$T$40, DW_AT_type(*$C$DW$T$61)
    3074                      .dwattr $C$DW$T$40, DW_AT_address_class(0x16)
    3075              $C$DW$T$41      .dwtag  DW_TAG_typedef, DW_AT_name("IPARK_Handle")
TMS320C2000 Assembler PC v6.2.5 Tue Sep 12 21:00:19 2017

Tools Copyright (c) 1996-2014 Texas Instruments Incorporated
C:\Users\wmj\AppData\Local\Temp\1224411                              PAGE   61

    3076                      .dwattr $C$DW$T$41, DW_AT_type(*$C$DW$T$40)
    3077                      .dwattr $C$DW$T$41, DW_AT_language(DW_LANG_C)
    3078              
    3079              $C$DW$T$63      .dwtag  DW_TAG_structure_type
    3080                      .dwattr $C$DW$T$63, DW_AT_name("_MATH_vec2_")
    3081                      .dwattr $C$DW$T$63, DW_AT_byte_size(0x04)
    3082              $C$DW$402       .dwtag  DW_TAG_member
    3083                      .dwattr $C$DW$402, DW_AT_type(*$C$DW$T$62)
    3084                      .dwattr $C$DW$402, DW_AT_name("value")
    3085                      .dwattr $C$DW$402, DW_AT_TI_symbol_name("_value")
    3086                      .dwattr $C$DW$402, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    3087                      .dwattr $C$DW$402, DW_AT_accessibility(DW_ACCESS_public)
    3088                      .dwendtag $C$DW$T$63
    3089              
    3090              $C$DW$T$55      .dwtag  DW_TAG_typedef, DW_AT_name("MATH_vec2")
    3091                      .dwattr $C$DW$T$55, DW_AT_type(*$C$DW$T$63)
    3092                      .dwattr $C$DW$T$55, DW_AT_language(DW_LANG_C)
    3093              
    3094              $C$DW$T$66      .dwtag  DW_TAG_structure_type
    3095                      .dwattr $C$DW$T$66, DW_AT_name("_MOTOR_Params_")
    3096                      .dwattr $C$DW$T$66, DW_AT_byte_size(0x0e)
    3097              $C$DW$403       .dwtag  DW_TAG_member
    3098                      .dwattr $C$DW$403, DW_AT_type(*$C$DW$T$65)
    3099                      .dwattr $C$DW$403, DW_AT_name("type")
    3100                      .dwattr $C$DW$403, DW_AT_TI_symbol_name("_type")
    3101                      .dwattr $C$DW$403, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    3102                      .dwattr $C$DW$403, DW_AT_accessibility(DW_ACCESS_public)
    3103              $C$DW$404       .dwtag  DW_TAG_member
    3104                      .dwattr $C$DW$404, DW_AT_type(*$C$DW$T$53)
    3105                      .dwattr $C$DW$404, DW_AT_name("numPolePairs")
    3106                      .dwattr $C$DW$404, DW_AT_TI_symbol_name("_numPolePairs")
    3107                      .dwattr $C$DW$404, DW_AT_data_member_location[DW_OP_plus_uconst 0x1]
    3108                      .dwattr $C$DW$404, DW_AT_accessibility(DW_ACCESS_public)
    3109              $C$DW$405       .dwtag  DW_TAG_member
    3110                      .dwattr $C$DW$405, DW_AT_type(*$C$DW$T$54)
    3111                      .dwattr $C$DW$405, DW_AT_name("Lr_H")
    3112                      .dwattr $C$DW$405, DW_AT_TI_symbol_name("_Lr_H")
    3113                      .dwattr $C$DW$405, DW_AT_data_member_location[DW_OP_plus_uconst 0x2]
    3114                      .dwattr $C$DW$405, DW_AT_accessibility(DW_ACCESS_public)
    3115              $C$DW$406       .dwtag  DW_TAG_member
    3116                      .dwattr $C$DW$406, DW_AT_type(*$C$DW$T$54)
    3117                      .dwattr $C$DW$406, DW_AT_name("Ls_d_H")
    3118                      .dwattr $C$DW$406, DW_AT_TI_symbol_name("_Ls_d_H")
    3119                      .dwattr $C$DW$406, DW_AT_data_member_location[DW_OP_plus_uconst 0x4]
    3120                      .dwattr $C$DW$406, DW_AT_accessibility(DW_ACCESS_public)
    3121              $C$DW$407       .dwtag  DW_TAG_member
    3122                      .dwattr $C$DW$407, DW_AT_type(*$C$DW$T$54)
    3123                      .dwattr $C$DW$407, DW_AT_name("Ls_q_H")
    3124                      .dwattr $C$DW$407, DW_AT_TI_symbol_name("_Ls_q_H")
    3125                      .dwattr $C$DW$407, DW_AT_data_member_location[DW_OP_plus_uconst 0x6]
    3126                      .dwattr $C$DW$407, DW_AT_accessibility(DW_ACCESS_public)
    3127              $C$DW$408       .dwtag  DW_TAG_member
    3128                      .dwattr $C$DW$408, DW_AT_type(*$C$DW$T$54)
    3129                      .dwattr $C$DW$408, DW_AT_name("Rr_Ohm")
    3130                      .dwattr $C$DW$408, DW_AT_TI_symbol_name("_Rr_Ohm")
TMS320C2000 Assembler PC v6.2.5 Tue Sep 12 21:00:19 2017

Tools Copyright (c) 1996-2014 Texas Instruments Incorporated
C:\Users\wmj\AppData\Local\Temp\1224411                              PAGE   62

    3131                      .dwattr $C$DW$408, DW_AT_data_member_location[DW_OP_plus_uconst 0x8]
    3132                      .dwattr $C$DW$408, DW_AT_accessibility(DW_ACCESS_public)
    3133              $C$DW$409       .dwtag  DW_TAG_member
    3134                      .dwattr $C$DW$409, DW_AT_type(*$C$DW$T$54)
    3135                      .dwattr $C$DW$409, DW_AT_name("Rs_Ohm")
    3136                      .dwattr $C$DW$409, DW_AT_TI_symbol_name("_Rs_Ohm")
    3137                      .dwattr $C$DW$409, DW_AT_data_member_location[DW_OP_plus_uconst 0xa]
    3138                      .dwattr $C$DW$409, DW_AT_accessibility(DW_ACCESS_public)
    3139              $C$DW$410       .dwtag  DW_TAG_member
    3140                      .dwattr $C$DW$410, DW_AT_type(*$C$DW$T$54)
    3141                      .dwattr $C$DW$410, DW_AT_name("ratedFlux_VpHz")
    3142                      .dwattr $C$DW$410, DW_AT_TI_symbol_name("_ratedFlux_VpHz")
    3143                      .dwattr $C$DW$410, DW_AT_data_member_location[DW_OP_plus_uconst 0xc]
    3144                      .dwattr $C$DW$410, DW_AT_accessibility(DW_ACCESS_public)
    3145                      .dwendtag $C$DW$T$66
    3146              
    3147              $C$DW$T$49      .dwtag  DW_TAG_typedef, DW_AT_name("MOTOR_Params")
    3148                      .dwattr $C$DW$T$49, DW_AT_type(*$C$DW$T$66)
    3149                      .dwattr $C$DW$T$49, DW_AT_language(DW_LANG_C)
    3150              
    3151              $C$DW$T$67      .dwtag  DW_TAG_structure_type
    3152                      .dwattr $C$DW$T$67, DW_AT_name("_PARK_Obj_")
    3153                      .dwattr $C$DW$T$67, DW_AT_byte_size(0x04)
    3154              $C$DW$411       .dwtag  DW_TAG_member
    3155                      .dwattr $C$DW$411, DW_AT_type(*$C$DW$T$20)
    3156                      .dwattr $C$DW$411, DW_AT_name("sinTh")
    3157                      .dwattr $C$DW$411, DW_AT_TI_symbol_name("_sinTh")
    3158                      .dwattr $C$DW$411, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    3159                      .dwattr $C$DW$411, DW_AT_accessibility(DW_ACCESS_public)
    3160              $C$DW$412       .dwtag  DW_TAG_member
    3161                      .dwattr $C$DW$412, DW_AT_type(*$C$DW$T$20)
    3162                      .dwattr $C$DW$412, DW_AT_name("cosTh")
    3163                      .dwattr $C$DW$412, DW_AT_TI_symbol_name("_cosTh")
    3164                      .dwattr $C$DW$412, DW_AT_data_member_location[DW_OP_plus_uconst 0x2]
    3165                      .dwattr $C$DW$412, DW_AT_accessibility(DW_ACCESS_public)
    3166                      .dwendtag $C$DW$T$67
    3167              
    3168              $C$DW$T$36      .dwtag  DW_TAG_typedef, DW_AT_name("PARK_Obj")
    3169                      .dwattr $C$DW$T$36, DW_AT_type(*$C$DW$T$67)
    3170                      .dwattr $C$DW$T$36, DW_AT_language(DW_LANG_C)
    3171              $C$DW$T$34      .dwtag  DW_TAG_pointer_type
    3172                      .dwattr $C$DW$T$34, DW_AT_type(*$C$DW$T$67)
    3173                      .dwattr $C$DW$T$34, DW_AT_address_class(0x16)
    3174              $C$DW$T$35      .dwtag  DW_TAG_typedef, DW_AT_name("PARK_Handle")
    3175                      .dwattr $C$DW$T$35, DW_AT_type(*$C$DW$T$34)
    3176                      .dwattr $C$DW$T$35, DW_AT_language(DW_LANG_C)
    3177              
    3178              $C$DW$T$68      .dwtag  DW_TAG_structure_type
    3179                      .dwattr $C$DW$T$68, DW_AT_name("_PID_Obj_")
    3180                      .dwattr $C$DW$T$68, DW_AT_byte_size(0x10)
    3181              $C$DW$413       .dwtag  DW_TAG_member
    3182                      .dwattr $C$DW$413, DW_AT_type(*$C$DW$T$20)
    3183                      .dwattr $C$DW$413, DW_AT_name("Kp")
    3184                      .dwattr $C$DW$413, DW_AT_TI_symbol_name("_Kp")
    3185                      .dwattr $C$DW$413, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
TMS320C2000 Assembler PC v6.2.5 Tue Sep 12 21:00:19 2017

Tools Copyright (c) 1996-2014 Texas Instruments Incorporated
C:\Users\wmj\AppData\Local\Temp\1224411                              PAGE   63

    3186                      .dwattr $C$DW$413, DW_AT_accessibility(DW_ACCESS_public)
    3187              $C$DW$414       .dwtag  DW_TAG_member
    3188                      .dwattr $C$DW$414, DW_AT_type(*$C$DW$T$20)
    3189                      .dwattr $C$DW$414, DW_AT_name("Ki")
    3190                      .dwattr $C$DW$414, DW_AT_TI_symbol_name("_Ki")
    3191                      .dwattr $C$DW$414, DW_AT_data_member_location[DW_OP_plus_uconst 0x2]
    3192                      .dwattr $C$DW$414, DW_AT_accessibility(DW_ACCESS_public)
    3193              $C$DW$415       .dwtag  DW_TAG_member
    3194                      .dwattr $C$DW$415, DW_AT_type(*$C$DW$T$20)
    3195                      .dwattr $C$DW$415, DW_AT_name("Kd")
    3196                      .dwattr $C$DW$415, DW_AT_TI_symbol_name("_Kd")
    3197                      .dwattr $C$DW$415, DW_AT_data_member_location[DW_OP_plus_uconst 0x4]
    3198                      .dwattr $C$DW$415, DW_AT_accessibility(DW_ACCESS_public)
    3199              $C$DW$416       .dwtag  DW_TAG_member
    3200                      .dwattr $C$DW$416, DW_AT_type(*$C$DW$T$20)
    3201                      .dwattr $C$DW$416, DW_AT_name("Ui")
    3202                      .dwattr $C$DW$416, DW_AT_TI_symbol_name("_Ui")
    3203                      .dwattr $C$DW$416, DW_AT_data_member_location[DW_OP_plus_uconst 0x6]
    3204                      .dwattr $C$DW$416, DW_AT_accessibility(DW_ACCESS_public)
    3205              $C$DW$417       .dwtag  DW_TAG_member
    3206                      .dwattr $C$DW$417, DW_AT_type(*$C$DW$T$20)
    3207                      .dwattr $C$DW$417, DW_AT_name("refValue")
    3208                      .dwattr $C$DW$417, DW_AT_TI_symbol_name("_refValue")
    3209                      .dwattr $C$DW$417, DW_AT_data_member_location[DW_OP_plus_uconst 0x8]
    3210                      .dwattr $C$DW$417, DW_AT_accessibility(DW_ACCESS_public)
    3211              $C$DW$418       .dwtag  DW_TAG_member
    3212                      .dwattr $C$DW$418, DW_AT_type(*$C$DW$T$20)
    3213                      .dwattr $C$DW$418, DW_AT_name("fbackValue")
    3214                      .dwattr $C$DW$418, DW_AT_TI_symbol_name("_fbackValue")
    3215                      .dwattr $C$DW$418, DW_AT_data_member_location[DW_OP_plus_uconst 0xa]
    3216                      .dwattr $C$DW$418, DW_AT_accessibility(DW_ACCESS_public)
    3217              $C$DW$419       .dwtag  DW_TAG_member
    3218                      .dwattr $C$DW$419, DW_AT_type(*$C$DW$T$20)
    3219                      .dwattr $C$DW$419, DW_AT_name("outMin")
    3220                      .dwattr $C$DW$419, DW_AT_TI_symbol_name("_outMin")
    3221                      .dwattr $C$DW$419, DW_AT_data_member_location[DW_OP_plus_uconst 0xc]
    3222                      .dwattr $C$DW$419, DW_AT_accessibility(DW_ACCESS_public)
    3223              $C$DW$420       .dwtag  DW_TAG_member
    3224                      .dwattr $C$DW$420, DW_AT_type(*$C$DW$T$20)
    3225                      .dwattr $C$DW$420, DW_AT_name("outMax")
    3226                      .dwattr $C$DW$420, DW_AT_TI_symbol_name("_outMax")
    3227                      .dwattr $C$DW$420, DW_AT_data_member_location[DW_OP_plus_uconst 0xe]
    3228                      .dwattr $C$DW$420, DW_AT_accessibility(DW_ACCESS_public)
    3229                      .dwendtag $C$DW$T$68
    3230              
    3231              $C$DW$T$39      .dwtag  DW_TAG_typedef, DW_AT_name("PID_Obj")
    3232                      .dwattr $C$DW$T$39, DW_AT_type(*$C$DW$T$68)
    3233                      .dwattr $C$DW$T$39, DW_AT_language(DW_LANG_C)
    3234              $C$DW$T$37      .dwtag  DW_TAG_pointer_type
    3235                      .dwattr $C$DW$T$37, DW_AT_type(*$C$DW$T$68)
    3236                      .dwattr $C$DW$T$37, DW_AT_address_class(0x16)
    3237              $C$DW$T$38      .dwtag  DW_TAG_typedef, DW_AT_name("PID_Handle")
    3238                      .dwattr $C$DW$T$38, DW_AT_type(*$C$DW$T$37)
    3239                      .dwattr $C$DW$T$38, DW_AT_language(DW_LANG_C)
    3240              
TMS320C2000 Assembler PC v6.2.5 Tue Sep 12 21:00:19 2017

Tools Copyright (c) 1996-2014 Texas Instruments Incorporated
C:\Users\wmj\AppData\Local\Temp\1224411                              PAGE   64

    3241              $C$DW$T$69      .dwtag  DW_TAG_structure_type
    3242                      .dwattr $C$DW$T$69, DW_AT_name("_SVGEN_Obj_")
    3243                      .dwattr $C$DW$T$69, DW_AT_byte_size(0x02)
    3244              $C$DW$421       .dwtag  DW_TAG_member
    3245                      .dwattr $C$DW$421, DW_AT_type(*$C$DW$T$20)
    3246                      .dwattr $C$DW$421, DW_AT_name("maxModulation")
    3247                      .dwattr $C$DW$421, DW_AT_TI_symbol_name("_maxModulation")
    3248                      .dwattr $C$DW$421, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    3249                      .dwattr $C$DW$421, DW_AT_accessibility(DW_ACCESS_public)
    3250                      .dwendtag $C$DW$T$69
    3251              
    3252              $C$DW$T$45      .dwtag  DW_TAG_typedef, DW_AT_name("SVGEN_Obj")
    3253                      .dwattr $C$DW$T$45, DW_AT_type(*$C$DW$T$69)
    3254                      .dwattr $C$DW$T$45, DW_AT_language(DW_LANG_C)
    3255              $C$DW$T$43      .dwtag  DW_TAG_pointer_type
    3256                      .dwattr $C$DW$T$43, DW_AT_type(*$C$DW$T$69)
    3257                      .dwattr $C$DW$T$43, DW_AT_address_class(0x16)
    3258              $C$DW$T$44      .dwtag  DW_TAG_typedef, DW_AT_name("SVGEN_Handle")
    3259                      .dwattr $C$DW$T$44, DW_AT_type(*$C$DW$T$43)
    3260                      .dwattr $C$DW$T$44, DW_AT_language(DW_LANG_C)
    3261              
    3262              $C$DW$T$70      .dwtag  DW_TAG_structure_type
    3263                      .dwattr $C$DW$T$70, DW_AT_name("_TRAJ_Obj_")
    3264                      .dwattr $C$DW$T$70, DW_AT_byte_size(0x0a)
    3265              $C$DW$422       .dwtag  DW_TAG_member
    3266                      .dwattr $C$DW$422, DW_AT_type(*$C$DW$T$20)
    3267                      .dwattr $C$DW$422, DW_AT_name("targetValue")
    3268                      .dwattr $C$DW$422, DW_AT_TI_symbol_name("_targetValue")
    3269                      .dwattr $C$DW$422, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    3270                      .dwattr $C$DW$422, DW_AT_accessibility(DW_ACCESS_public)
    3271              $C$DW$423       .dwtag  DW_TAG_member
    3272                      .dwattr $C$DW$423, DW_AT_type(*$C$DW$T$20)
    3273                      .dwattr $C$DW$423, DW_AT_name("intValue")
    3274                      .dwattr $C$DW$423, DW_AT_TI_symbol_name("_intValue")
    3275                      .dwattr $C$DW$423, DW_AT_data_member_location[DW_OP_plus_uconst 0x2]
    3276                      .dwattr $C$DW$423, DW_AT_accessibility(DW_ACCESS_public)
    3277              $C$DW$424       .dwtag  DW_TAG_member
    3278                      .dwattr $C$DW$424, DW_AT_type(*$C$DW$T$20)
    3279                      .dwattr $C$DW$424, DW_AT_name("minValue")
    3280                      .dwattr $C$DW$424, DW_AT_TI_symbol_name("_minValue")
    3281                      .dwattr $C$DW$424, DW_AT_data_member_location[DW_OP_plus_uconst 0x4]
    3282                      .dwattr $C$DW$424, DW_AT_accessibility(DW_ACCESS_public)
    3283              $C$DW$425       .dwtag  DW_TAG_member
    3284                      .dwattr $C$DW$425, DW_AT_type(*$C$DW$T$20)
    3285                      .dwattr $C$DW$425, DW_AT_name("maxValue")
    3286                      .dwattr $C$DW$425, DW_AT_TI_symbol_name("_maxValue")
    3287                      .dwattr $C$DW$425, DW_AT_data_member_location[DW_OP_plus_uconst 0x6]
    3288                      .dwattr $C$DW$425, DW_AT_accessibility(DW_ACCESS_public)
    3289              $C$DW$426       .dwtag  DW_TAG_member
    3290                      .dwattr $C$DW$426, DW_AT_type(*$C$DW$T$20)
    3291                      .dwattr $C$DW$426, DW_AT_name("maxDelta")
    3292                      .dwattr $C$DW$426, DW_AT_TI_symbol_name("_maxDelta")
    3293                      .dwattr $C$DW$426, DW_AT_data_member_location[DW_OP_plus_uconst 0x8]
    3294                      .dwattr $C$DW$426, DW_AT_accessibility(DW_ACCESS_public)
    3295                      .dwendtag $C$DW$T$70
TMS320C2000 Assembler PC v6.2.5 Tue Sep 12 21:00:19 2017

Tools Copyright (c) 1996-2014 Texas Instruments Incorporated
C:\Users\wmj\AppData\Local\Temp\1224411                              PAGE   65

    3296              
    3297              $C$DW$T$48      .dwtag  DW_TAG_typedef, DW_AT_name("TRAJ_Obj")
    3298                      .dwattr $C$DW$T$48, DW_AT_type(*$C$DW$T$70)
    3299                      .dwattr $C$DW$T$48, DW_AT_language(DW_LANG_C)
    3300              $C$DW$T$46      .dwtag  DW_TAG_pointer_type
    3301                      .dwattr $C$DW$T$46, DW_AT_type(*$C$DW$T$70)
    3302                      .dwattr $C$DW$T$46, DW_AT_address_class(0x16)
    3303              $C$DW$T$47      .dwtag  DW_TAG_typedef, DW_AT_name("TRAJ_Handle")
    3304                      .dwattr $C$DW$T$47, DW_AT_type(*$C$DW$T$46)
    3305                      .dwattr $C$DW$T$47, DW_AT_language(DW_LANG_C)
    3306              
    3307              $C$DW$T$76      .dwtag  DW_TAG_structure_type
    3308                      .dwattr $C$DW$T$76, DW_AT_name("_USER_Params_")
    3309                      .dwattr $C$DW$T$76, DW_AT_byte_size(0xac)
    3310              $C$DW$427       .dwtag  DW_TAG_member
    3311                      .dwattr $C$DW$427, DW_AT_type(*$C$DW$T$54)
    3312                      .dwattr $C$DW$427, DW_AT_name("iqFullScaleCurrent_A")
    3313                      .dwattr $C$DW$427, DW_AT_TI_symbol_name("_iqFullScaleCurrent_A")
    3314                      .dwattr $C$DW$427, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    3315                      .dwattr $C$DW$427, DW_AT_accessibility(DW_ACCESS_public)
    3316              $C$DW$428       .dwtag  DW_TAG_member
    3317                      .dwattr $C$DW$428, DW_AT_type(*$C$DW$T$54)
    3318                      .dwattr $C$DW$428, DW_AT_name("iqFullScaleVoltage_V")
    3319                      .dwattr $C$DW$428, DW_AT_TI_symbol_name("_iqFullScaleVoltage_V")
    3320                      .dwattr $C$DW$428, DW_AT_data_member_location[DW_OP_plus_uconst 0x2]
    3321                      .dwattr $C$DW$428, DW_AT_accessibility(DW_ACCESS_public)
    3322              $C$DW$429       .dwtag  DW_TAG_member
    3323                      .dwattr $C$DW$429, DW_AT_type(*$C$DW$T$54)
    3324                      .dwattr $C$DW$429, DW_AT_name("iqFullScaleFreq_Hz")
    3325                      .dwattr $C$DW$429, DW_AT_TI_symbol_name("_iqFullScaleFreq_Hz")
    3326                      .dwattr $C$DW$429, DW_AT_data_member_location[DW_OP_plus_uconst 0x4]
    3327                      .dwattr $C$DW$429, DW_AT_accessibility(DW_ACCESS_public)
    3328              $C$DW$430       .dwtag  DW_TAG_member
    3329                      .dwattr $C$DW$430, DW_AT_type(*$C$DW$T$53)
    3330                      .dwattr $C$DW$430, DW_AT_name("numIsrTicksPerCtrlTick")
    3331                      .dwattr $C$DW$430, DW_AT_TI_symbol_name("_numIsrTicksPerCtrlTick")
    3332                      .dwattr $C$DW$430, DW_AT_data_member_location[DW_OP_plus_uconst 0x6]
    3333                      .dwattr $C$DW$430, DW_AT_accessibility(DW_ACCESS_public)
    3334              $C$DW$431       .dwtag  DW_TAG_member
    3335                      .dwattr $C$DW$431, DW_AT_type(*$C$DW$T$53)
    3336                      .dwattr $C$DW$431, DW_AT_name("numCtrlTicksPerCurrentTick")
    3337                      .dwattr $C$DW$431, DW_AT_TI_symbol_name("_numCtrlTicksPerCurrentTick")
    3338                      .dwattr $C$DW$431, DW_AT_data_member_location[DW_OP_plus_uconst 0x7]
    3339                      .dwattr $C$DW$431, DW_AT_accessibility(DW_ACCESS_public)
    3340              $C$DW$432       .dwtag  DW_TAG_member
    3341                      .dwattr $C$DW$432, DW_AT_type(*$C$DW$T$53)
    3342                      .dwattr $C$DW$432, DW_AT_name("numCtrlTicksPerEstTick")
    3343                      .dwattr $C$DW$432, DW_AT_TI_symbol_name("_numCtrlTicksPerEstTick")
    3344                      .dwattr $C$DW$432, DW_AT_data_member_location[DW_OP_plus_uconst 0x8]
    3345                      .dwattr $C$DW$432, DW_AT_accessibility(DW_ACCESS_public)
    3346              $C$DW$433       .dwtag  DW_TAG_member
    3347                      .dwattr $C$DW$433, DW_AT_type(*$C$DW$T$53)
    3348                      .dwattr $C$DW$433, DW_AT_name("numCtrlTicksPerSpeedTick")
    3349                      .dwattr $C$DW$433, DW_AT_TI_symbol_name("_numCtrlTicksPerSpeedTick")
    3350                      .dwattr $C$DW$433, DW_AT_data_member_location[DW_OP_plus_uconst 0x9]
TMS320C2000 Assembler PC v6.2.5 Tue Sep 12 21:00:19 2017

Tools Copyright (c) 1996-2014 Texas Instruments Incorporated
C:\Users\wmj\AppData\Local\Temp\1224411                              PAGE   66

    3351                      .dwattr $C$DW$433, DW_AT_accessibility(DW_ACCESS_public)
    3352              $C$DW$434       .dwtag  DW_TAG_member
    3353                      .dwattr $C$DW$434, DW_AT_type(*$C$DW$T$53)
    3354                      .dwattr $C$DW$434, DW_AT_name("numCtrlTicksPerTrajTick")
    3355                      .dwattr $C$DW$434, DW_AT_TI_symbol_name("_numCtrlTicksPerTrajTick")
    3356                      .dwattr $C$DW$434, DW_AT_data_member_location[DW_OP_plus_uconst 0xa]
    3357                      .dwattr $C$DW$434, DW_AT_accessibility(DW_ACCESS_public)
    3358              $C$DW$435       .dwtag  DW_TAG_member
    3359                      .dwattr $C$DW$435, DW_AT_type(*$C$DW$T$22)
    3360                      .dwattr $C$DW$435, DW_AT_name("numCurrentSensors")
    3361                      .dwattr $C$DW$435, DW_AT_TI_symbol_name("_numCurrentSensors")
    3362                      .dwattr $C$DW$435, DW_AT_data_member_location[DW_OP_plus_uconst 0xb]
    3363                      .dwattr $C$DW$435, DW_AT_accessibility(DW_ACCESS_public)
    3364              $C$DW$436       .dwtag  DW_TAG_member
    3365                      .dwattr $C$DW$436, DW_AT_type(*$C$DW$T$22)
    3366                      .dwattr $C$DW$436, DW_AT_name("numVoltageSensors")
    3367                      .dwattr $C$DW$436, DW_AT_TI_symbol_name("_numVoltageSensors")
    3368                      .dwattr $C$DW$436, DW_AT_data_member_location[DW_OP_plus_uconst 0xc]
    3369                      .dwattr $C$DW$436, DW_AT_accessibility(DW_ACCESS_public)
    3370              $C$DW$437       .dwtag  DW_TAG_member
    3371                      .dwattr $C$DW$437, DW_AT_type(*$C$DW$T$54)
    3372                      .dwattr $C$DW$437, DW_AT_name("offsetPole_rps")
    3373                      .dwattr $C$DW$437, DW_AT_TI_symbol_name("_offsetPole_rps")
    3374                      .dwattr $C$DW$437, DW_AT_data_member_location[DW_OP_plus_uconst 0xe]
    3375                      .dwattr $C$DW$437, DW_AT_accessibility(DW_ACCESS_public)
    3376              $C$DW$438       .dwtag  DW_TAG_member
    3377                      .dwattr $C$DW$438, DW_AT_type(*$C$DW$T$54)
    3378                      .dwattr $C$DW$438, DW_AT_name("fluxPole_rps")
    3379                      .dwattr $C$DW$438, DW_AT_TI_symbol_name("_fluxPole_rps")
    3380                      .dwattr $C$DW$438, DW_AT_data_member_location[DW_OP_plus_uconst 0x10]
    3381                      .dwattr $C$DW$438, DW_AT_accessibility(DW_ACCESS_public)
    3382              $C$DW$439       .dwtag  DW_TAG_member
    3383                      .dwattr $C$DW$439, DW_AT_type(*$C$DW$T$54)
    3384                      .dwattr $C$DW$439, DW_AT_name("zeroSpeedLimit")
    3385                      .dwattr $C$DW$439, DW_AT_TI_symbol_name("_zeroSpeedLimit")
    3386                      .dwattr $C$DW$439, DW_AT_data_member_location[DW_OP_plus_uconst 0x12]
    3387                      .dwattr $C$DW$439, DW_AT_accessibility(DW_ACCESS_public)
    3388              $C$DW$440       .dwtag  DW_TAG_member
    3389                      .dwattr $C$DW$440, DW_AT_type(*$C$DW$T$54)
    3390                      .dwattr $C$DW$440, DW_AT_name("forceAngleFreq_Hz")
    3391                      .dwattr $C$DW$440, DW_AT_TI_symbol_name("_forceAngleFreq_Hz")
    3392                      .dwattr $C$DW$440, DW_AT_data_member_location[DW_OP_plus_uconst 0x14]
    3393                      .dwattr $C$DW$440, DW_AT_accessibility(DW_ACCESS_public)
    3394              $C$DW$441       .dwtag  DW_TAG_member
    3395                      .dwattr $C$DW$441, DW_AT_type(*$C$DW$T$54)
    3396                      .dwattr $C$DW$441, DW_AT_name("maxAccel_Hzps")
    3397                      .dwattr $C$DW$441, DW_AT_TI_symbol_name("_maxAccel_Hzps")
    3398                      .dwattr $C$DW$441, DW_AT_data_member_location[DW_OP_plus_uconst 0x16]
    3399                      .dwattr $C$DW$441, DW_AT_accessibility(DW_ACCESS_public)
    3400              $C$DW$442       .dwtag  DW_TAG_member
    3401                      .dwattr $C$DW$442, DW_AT_type(*$C$DW$T$54)
    3402                      .dwattr $C$DW$442, DW_AT_name("maxAccel_est_Hzps")
    3403                      .dwattr $C$DW$442, DW_AT_TI_symbol_name("_maxAccel_est_Hzps")
    3404                      .dwattr $C$DW$442, DW_AT_data_member_location[DW_OP_plus_uconst 0x18]
    3405                      .dwattr $C$DW$442, DW_AT_accessibility(DW_ACCESS_public)
TMS320C2000 Assembler PC v6.2.5 Tue Sep 12 21:00:19 2017

Tools Copyright (c) 1996-2014 Texas Instruments Incorporated
C:\Users\wmj\AppData\Local\Temp\1224411                              PAGE   67

    3406              $C$DW$443       .dwtag  DW_TAG_member
    3407                      .dwattr $C$DW$443, DW_AT_type(*$C$DW$T$54)
    3408                      .dwattr $C$DW$443, DW_AT_name("directionPole_rps")
    3409                      .dwattr $C$DW$443, DW_AT_TI_symbol_name("_directionPole_rps")
    3410                      .dwattr $C$DW$443, DW_AT_data_member_location[DW_OP_plus_uconst 0x1a]
    3411                      .dwattr $C$DW$443, DW_AT_accessibility(DW_ACCESS_public)
    3412              $C$DW$444       .dwtag  DW_TAG_member
    3413                      .dwattr $C$DW$444, DW_AT_type(*$C$DW$T$54)
    3414                      .dwattr $C$DW$444, DW_AT_name("speedPole_rps")
    3415                      .dwattr $C$DW$444, DW_AT_TI_symbol_name("_speedPole_rps")
    3416                      .dwattr $C$DW$444, DW_AT_data_member_location[DW_OP_plus_uconst 0x1c]
    3417                      .dwattr $C$DW$444, DW_AT_accessibility(DW_ACCESS_public)
    3418              $C$DW$445       .dwtag  DW_TAG_member
    3419                      .dwattr $C$DW$445, DW_AT_type(*$C$DW$T$54)
    3420                      .dwattr $C$DW$445, DW_AT_name("dcBusPole_rps")
    3421                      .dwattr $C$DW$445, DW_AT_TI_symbol_name("_dcBusPole_rps")
    3422                      .dwattr $C$DW$445, DW_AT_data_member_location[DW_OP_plus_uconst 0x1e]
    3423                      .dwattr $C$DW$445, DW_AT_accessibility(DW_ACCESS_public)
    3424              $C$DW$446       .dwtag  DW_TAG_member
    3425                      .dwattr $C$DW$446, DW_AT_type(*$C$DW$T$54)
    3426                      .dwattr $C$DW$446, DW_AT_name("fluxFraction")
    3427                      .dwattr $C$DW$446, DW_AT_TI_symbol_name("_fluxFraction")
    3428                      .dwattr $C$DW$446, DW_AT_data_member_location[DW_OP_plus_uconst 0x20]
    3429                      .dwattr $C$DW$446, DW_AT_accessibility(DW_ACCESS_public)
    3430              $C$DW$447       .dwtag  DW_TAG_member
    3431                      .dwattr $C$DW$447, DW_AT_type(*$C$DW$T$54)
    3432                      .dwattr $C$DW$447, DW_AT_name("indEst_speedMaxFraction")
    3433                      .dwattr $C$DW$447, DW_AT_TI_symbol_name("_indEst_speedMaxFraction")
    3434                      .dwattr $C$DW$447, DW_AT_data_member_location[DW_OP_plus_uconst 0x22]
    3435                      .dwattr $C$DW$447, DW_AT_accessibility(DW_ACCESS_public)
    3436              $C$DW$448       .dwtag  DW_TAG_member
    3437                      .dwattr $C$DW$448, DW_AT_type(*$C$DW$T$54)
    3438                      .dwattr $C$DW$448, DW_AT_name("powerWarpGain")
    3439                      .dwattr $C$DW$448, DW_AT_TI_symbol_name("_powerWarpGain")
    3440                      .dwattr $C$DW$448, DW_AT_data_member_location[DW_OP_plus_uconst 0x24]
    3441                      .dwattr $C$DW$448, DW_AT_accessibility(DW_ACCESS_public)
    3442              $C$DW$449       .dwtag  DW_TAG_member
    3443                      .dwattr $C$DW$449, DW_AT_type(*$C$DW$T$53)
    3444                      .dwattr $C$DW$449, DW_AT_name("systemFreq_MHz")
    3445                      .dwattr $C$DW$449, DW_AT_TI_symbol_name("_systemFreq_MHz")
    3446                      .dwattr $C$DW$449, DW_AT_data_member_location[DW_OP_plus_uconst 0x26]
    3447                      .dwattr $C$DW$449, DW_AT_accessibility(DW_ACCESS_public)
    3448              $C$DW$450       .dwtag  DW_TAG_member
    3449                      .dwattr $C$DW$450, DW_AT_type(*$C$DW$T$54)
    3450                      .dwattr $C$DW$450, DW_AT_name("pwmPeriod_usec")
    3451                      .dwattr $C$DW$450, DW_AT_TI_symbol_name("_pwmPeriod_usec")
    3452                      .dwattr $C$DW$450, DW_AT_data_member_location[DW_OP_plus_uconst 0x28]
    3453                      .dwattr $C$DW$450, DW_AT_accessibility(DW_ACCESS_public)
    3454              $C$DW$451       .dwtag  DW_TAG_member
    3455                      .dwattr $C$DW$451, DW_AT_type(*$C$DW$T$54)
    3456                      .dwattr $C$DW$451, DW_AT_name("voltage_sf")
    3457                      .dwattr $C$DW$451, DW_AT_TI_symbol_name("_voltage_sf")
    3458                      .dwattr $C$DW$451, DW_AT_data_member_location[DW_OP_plus_uconst 0x2a]
    3459                      .dwattr $C$DW$451, DW_AT_accessibility(DW_ACCESS_public)
    3460              $C$DW$452       .dwtag  DW_TAG_member
TMS320C2000 Assembler PC v6.2.5 Tue Sep 12 21:00:19 2017

Tools Copyright (c) 1996-2014 Texas Instruments Incorporated
C:\Users\wmj\AppData\Local\Temp\1224411                              PAGE   68

    3461                      .dwattr $C$DW$452, DW_AT_type(*$C$DW$T$54)
    3462                      .dwattr $C$DW$452, DW_AT_name("current_sf")
    3463                      .dwattr $C$DW$452, DW_AT_TI_symbol_name("_current_sf")
    3464                      .dwattr $C$DW$452, DW_AT_data_member_location[DW_OP_plus_uconst 0x2c]
    3465                      .dwattr $C$DW$452, DW_AT_accessibility(DW_ACCESS_public)
    3466              $C$DW$453       .dwtag  DW_TAG_member
    3467                      .dwattr $C$DW$453, DW_AT_type(*$C$DW$T$54)
    3468                      .dwattr $C$DW$453, DW_AT_name("voltageFilterPole_rps")
    3469                      .dwattr $C$DW$453, DW_AT_TI_symbol_name("_voltageFilterPole_rps")
    3470                      .dwattr $C$DW$453, DW_AT_data_member_location[DW_OP_plus_uconst 0x2e]
    3471                      .dwattr $C$DW$453, DW_AT_accessibility(DW_ACCESS_public)
    3472              $C$DW$454       .dwtag  DW_TAG_member
    3473                      .dwattr $C$DW$454, DW_AT_type(*$C$DW$T$54)
    3474                      .dwattr $C$DW$454, DW_AT_name("maxVsMag_pu")
    3475                      .dwattr $C$DW$454, DW_AT_TI_symbol_name("_maxVsMag_pu")
    3476                      .dwattr $C$DW$454, DW_AT_data_member_location[DW_OP_plus_uconst 0x30]
    3477                      .dwattr $C$DW$454, DW_AT_accessibility(DW_ACCESS_public)
    3478              $C$DW$455       .dwtag  DW_TAG_member
    3479                      .dwattr $C$DW$455, DW_AT_type(*$C$DW$T$54)
    3480                      .dwattr $C$DW$455, DW_AT_name("estKappa")
    3481                      .dwattr $C$DW$455, DW_AT_TI_symbol_name("_estKappa")
    3482                      .dwattr $C$DW$455, DW_AT_data_member_location[DW_OP_plus_uconst 0x32]
    3483                      .dwattr $C$DW$455, DW_AT_accessibility(DW_ACCESS_public)
    3484              $C$DW$456       .dwtag  DW_TAG_member
    3485                      .dwattr $C$DW$456, DW_AT_type(*$C$DW$T$65)
    3486                      .dwattr $C$DW$456, DW_AT_name("motor_type")
    3487                      .dwattr $C$DW$456, DW_AT_TI_symbol_name("_motor_type")
    3488                      .dwattr $C$DW$456, DW_AT_data_member_location[DW_OP_plus_uconst 0x34]
    3489                      .dwattr $C$DW$456, DW_AT_accessibility(DW_ACCESS_public)
    3490              $C$DW$457       .dwtag  DW_TAG_member
    3491                      .dwattr $C$DW$457, DW_AT_type(*$C$DW$T$53)
    3492                      .dwattr $C$DW$457, DW_AT_name("motor_numPolePairs")
    3493                      .dwattr $C$DW$457, DW_AT_TI_symbol_name("_motor_numPolePairs")
    3494                      .dwattr $C$DW$457, DW_AT_data_member_location[DW_OP_plus_uconst 0x35]
    3495                      .dwattr $C$DW$457, DW_AT_accessibility(DW_ACCESS_public)
    3496              $C$DW$458       .dwtag  DW_TAG_member
    3497                      .dwattr $C$DW$458, DW_AT_type(*$C$DW$T$54)
    3498                      .dwattr $C$DW$458, DW_AT_name("motor_ratedFlux")
    3499                      .dwattr $C$DW$458, DW_AT_TI_symbol_name("_motor_ratedFlux")
    3500                      .dwattr $C$DW$458, DW_AT_data_member_location[DW_OP_plus_uconst 0x36]
    3501                      .dwattr $C$DW$458, DW_AT_accessibility(DW_ACCESS_public)
    3502              $C$DW$459       .dwtag  DW_TAG_member
    3503                      .dwattr $C$DW$459, DW_AT_type(*$C$DW$T$54)
    3504                      .dwattr $C$DW$459, DW_AT_name("motor_Rr")
    3505                      .dwattr $C$DW$459, DW_AT_TI_symbol_name("_motor_Rr")
    3506                      .dwattr $C$DW$459, DW_AT_data_member_location[DW_OP_plus_uconst 0x38]
    3507                      .dwattr $C$DW$459, DW_AT_accessibility(DW_ACCESS_public)
    3508              $C$DW$460       .dwtag  DW_TAG_member
    3509                      .dwattr $C$DW$460, DW_AT_type(*$C$DW$T$54)
    3510                      .dwattr $C$DW$460, DW_AT_name("motor_Rs")
    3511                      .dwattr $C$DW$460, DW_AT_TI_symbol_name("_motor_Rs")
    3512                      .dwattr $C$DW$460, DW_AT_data_member_location[DW_OP_plus_uconst 0x3a]
    3513                      .dwattr $C$DW$460, DW_AT_accessibility(DW_ACCESS_public)
    3514              $C$DW$461       .dwtag  DW_TAG_member
    3515                      .dwattr $C$DW$461, DW_AT_type(*$C$DW$T$54)
TMS320C2000 Assembler PC v6.2.5 Tue Sep 12 21:00:19 2017

Tools Copyright (c) 1996-2014 Texas Instruments Incorporated
C:\Users\wmj\AppData\Local\Temp\1224411                              PAGE   69

    3516                      .dwattr $C$DW$461, DW_AT_name("motor_Ls_d")
    3517                      .dwattr $C$DW$461, DW_AT_TI_symbol_name("_motor_Ls_d")
    3518                      .dwattr $C$DW$461, DW_AT_data_member_location[DW_OP_plus_uconst 0x3c]
    3519                      .dwattr $C$DW$461, DW_AT_accessibility(DW_ACCESS_public)
    3520              $C$DW$462       .dwtag  DW_TAG_member
    3521                      .dwattr $C$DW$462, DW_AT_type(*$C$DW$T$54)
    3522                      .dwattr $C$DW$462, DW_AT_name("motor_Ls_q")
    3523                      .dwattr $C$DW$462, DW_AT_TI_symbol_name("_motor_Ls_q")
    3524                      .dwattr $C$DW$462, DW_AT_data_member_location[DW_OP_plus_uconst 0x3e]
    3525                      .dwattr $C$DW$462, DW_AT_accessibility(DW_ACCESS_public)
    3526              $C$DW$463       .dwtag  DW_TAG_member
    3527                      .dwattr $C$DW$463, DW_AT_type(*$C$DW$T$54)
    3528                      .dwattr $C$DW$463, DW_AT_name("maxCurrent")
    3529                      .dwattr $C$DW$463, DW_AT_TI_symbol_name("_maxCurrent")
    3530                      .dwattr $C$DW$463, DW_AT_data_member_location[DW_OP_plus_uconst 0x40]
    3531                      .dwattr $C$DW$463, DW_AT_accessibility(DW_ACCESS_public)
    3532              $C$DW$464       .dwtag  DW_TAG_member
    3533                      .dwattr $C$DW$464, DW_AT_type(*$C$DW$T$54)
    3534                      .dwattr $C$DW$464, DW_AT_name("maxCurrent_resEst")
    3535                      .dwattr $C$DW$464, DW_AT_TI_symbol_name("_maxCurrent_resEst")
    3536                      .dwattr $C$DW$464, DW_AT_data_member_location[DW_OP_plus_uconst 0x42]
    3537                      .dwattr $C$DW$464, DW_AT_accessibility(DW_ACCESS_public)
    3538              $C$DW$465       .dwtag  DW_TAG_member
    3539                      .dwattr $C$DW$465, DW_AT_type(*$C$DW$T$54)
    3540                      .dwattr $C$DW$465, DW_AT_name("maxCurrent_indEst")
    3541                      .dwattr $C$DW$465, DW_AT_TI_symbol_name("_maxCurrent_indEst")
    3542                      .dwattr $C$DW$465, DW_AT_data_member_location[DW_OP_plus_uconst 0x44]
    3543                      .dwattr $C$DW$465, DW_AT_accessibility(DW_ACCESS_public)
    3544              $C$DW$466       .dwtag  DW_TAG_member
    3545                      .dwattr $C$DW$466, DW_AT_type(*$C$DW$T$54)
    3546                      .dwattr $C$DW$466, DW_AT_name("maxCurrentSlope")
    3547                      .dwattr $C$DW$466, DW_AT_TI_symbol_name("_maxCurrentSlope")
    3548                      .dwattr $C$DW$466, DW_AT_data_member_location[DW_OP_plus_uconst 0x46]
    3549                      .dwattr $C$DW$466, DW_AT_accessibility(DW_ACCESS_public)
    3550              $C$DW$467       .dwtag  DW_TAG_member
    3551                      .dwattr $C$DW$467, DW_AT_type(*$C$DW$T$54)
    3552                      .dwattr $C$DW$467, DW_AT_name("maxCurrentSlope_powerWarp")
    3553                      .dwattr $C$DW$467, DW_AT_TI_symbol_name("_maxCurrentSlope_powerWarp")
    3554                      .dwattr $C$DW$467, DW_AT_data_member_location[DW_OP_plus_uconst 0x48]
    3555                      .dwattr $C$DW$467, DW_AT_accessibility(DW_ACCESS_public)
    3556              $C$DW$468       .dwtag  DW_TAG_member
    3557                      .dwattr $C$DW$468, DW_AT_type(*$C$DW$T$54)
    3558                      .dwattr $C$DW$468, DW_AT_name("IdRated")
    3559                      .dwattr $C$DW$468, DW_AT_TI_symbol_name("_IdRated")
    3560                      .dwattr $C$DW$468, DW_AT_data_member_location[DW_OP_plus_uconst 0x4a]
    3561                      .dwattr $C$DW$468, DW_AT_accessibility(DW_ACCESS_public)
    3562              $C$DW$469       .dwtag  DW_TAG_member
    3563                      .dwattr $C$DW$469, DW_AT_type(*$C$DW$T$54)
    3564                      .dwattr $C$DW$469, DW_AT_name("IdRatedFraction_indEst")
    3565                      .dwattr $C$DW$469, DW_AT_TI_symbol_name("_IdRatedFraction_indEst")
    3566                      .dwattr $C$DW$469, DW_AT_data_member_location[DW_OP_plus_uconst 0x4c]
    3567                      .dwattr $C$DW$469, DW_AT_accessibility(DW_ACCESS_public)
    3568              $C$DW$470       .dwtag  DW_TAG_member
    3569                      .dwattr $C$DW$470, DW_AT_type(*$C$DW$T$54)
    3570                      .dwattr $C$DW$470, DW_AT_name("IdRatedFraction_ratedFlux")
TMS320C2000 Assembler PC v6.2.5 Tue Sep 12 21:00:19 2017

Tools Copyright (c) 1996-2014 Texas Instruments Incorporated
C:\Users\wmj\AppData\Local\Temp\1224411                              PAGE   70

    3571                      .dwattr $C$DW$470, DW_AT_TI_symbol_name("_IdRatedFraction_ratedFlux")
    3572                      .dwattr $C$DW$470, DW_AT_data_member_location[DW_OP_plus_uconst 0x4e]
    3573                      .dwattr $C$DW$470, DW_AT_accessibility(DW_ACCESS_public)
    3574              $C$DW$471       .dwtag  DW_TAG_member
    3575                      .dwattr $C$DW$471, DW_AT_type(*$C$DW$T$54)
    3576                      .dwattr $C$DW$471, DW_AT_name("IdRated_delta")
    3577                      .dwattr $C$DW$471, DW_AT_TI_symbol_name("_IdRated_delta")
    3578                      .dwattr $C$DW$471, DW_AT_data_member_location[DW_OP_plus_uconst 0x50]
    3579                      .dwattr $C$DW$471, DW_AT_accessibility(DW_ACCESS_public)
    3580              $C$DW$472       .dwtag  DW_TAG_member
    3581                      .dwattr $C$DW$472, DW_AT_type(*$C$DW$T$54)
    3582                      .dwattr $C$DW$472, DW_AT_name("fluxEstFreq_Hz")
    3583                      .dwattr $C$DW$472, DW_AT_TI_symbol_name("_fluxEstFreq_Hz")
    3584                      .dwattr $C$DW$472, DW_AT_data_member_location[DW_OP_plus_uconst 0x52]
    3585                      .dwattr $C$DW$472, DW_AT_accessibility(DW_ACCESS_public)
    3586              $C$DW$473       .dwtag  DW_TAG_member
    3587                      .dwattr $C$DW$473, DW_AT_type(*$C$DW$T$52)
    3588                      .dwattr $C$DW$473, DW_AT_name("ctrlWaitTime")
    3589                      .dwattr $C$DW$473, DW_AT_TI_symbol_name("_ctrlWaitTime")
    3590                      .dwattr $C$DW$473, DW_AT_data_member_location[DW_OP_plus_uconst 0x54]
    3591                      .dwattr $C$DW$473, DW_AT_accessibility(DW_ACCESS_public)
    3592              $C$DW$474       .dwtag  DW_TAG_member
    3593                      .dwattr $C$DW$474, DW_AT_type(*$C$DW$T$71)
    3594                      .dwattr $C$DW$474, DW_AT_name("estWaitTime")
    3595                      .dwattr $C$DW$474, DW_AT_TI_symbol_name("_estWaitTime")
    3596                      .dwattr $C$DW$474, DW_AT_data_member_location[DW_OP_plus_uconst 0x5c]
    3597                      .dwattr $C$DW$474, DW_AT_accessibility(DW_ACCESS_public)
