TMS320C2000 Assembler PC v6.2.5 Sun Oct 08 22:38:01 2017

Tools Copyright (c) 1996-2014 Texas Instruments Incorporated
C:\Users\wmj\AppData\Local\Temp\0385210                              PAGE    1

       1              ;***************************************************************
       2              ;* TMS320C2000 C/C++ Codegen                         PC v6.2.5 *
       3              ;* Date/Time created: Sun Oct 08 22:38:00 2017                 *
       4              ;***************************************************************
       5                      .compiler_opts --float_support=softlib --hll_source=on --mem_model:code=flat --mem_model:data=large -
       6        0002  FP      .set    XAR2
       7              
       8              $C$DW$CU        .dwtag  DW_TAG_compile_unit
       9                      .dwattr $C$DW$CU, DW_AT_name("D:/BM1000/sw/modules/ctrl/src/32b/ctrl.c")
      10                      .dwattr $C$DW$CU, DW_AT_producer("TMS320C2000 C/C++ Codegen PC v6.2.5 Copyright (c) 1996-2014 Texas I
      11                      .dwattr $C$DW$CU, DW_AT_TI_version(0x01)
      12                      .dwattr $C$DW$CU, DW_AT_comp_dir("D:\BM1000\sw\solutions\instaspin_foc\boards\hvkit_rev1p1\f28x\f2802
      13              
      14              ;**************************************************************
      15              ;* FUNCTION SYNONYMS                                          *

    6787              $C$DW$639       .dwtag  DW_TAG_enumerator, DW_AT_name("USER_ErrorCode_trajFreq_Hz_Low"), DW_AT_const_value(0x
    6788              $C$DW$640       .dwtag  DW_TAG_enumerator, DW_AT_name("USER_ErrorCode_ctrlPeriod_sec_High"), DW_AT_const_valu
    6789              $C$DW$641       .dwtag  DW_TAG_enumerator, DW_AT_name("USER_ErrorCode_ctrlPeriod_sec_Low"), DW_AT_const_value
    6790              $C$DW$642       .dwtag  DW_TAG_enumerator, DW_AT_name("USER_ErrorCode_maxNegativeIdCurrent_a_High"), DW_AT_co
    6791              $C$DW$643       .dwtag  DW_TAG_enumerator, DW_AT_name("USER_ErrorCode_maxNegativeIdCurrent_a_Low"), DW_AT_con
    6792              $C$DW$644       .dwtag  DW_TAG_enumerator, DW_AT_name("USER_numErrorCodes"), DW_AT_const_value(0x6a)
    6793                      .dwendtag $C$DW$T$167
    6794              
    6795              $C$DW$T$168     .dwtag  DW_TAG_typedef, DW_AT_name("USER_ErrorCode_e")
    6796                      .dwattr $C$DW$T$168, DW_AT_type(*$C$DW$T$167)
    6797                      .dwattr $C$DW$T$168, DW_AT_language(DW_LANG_C)
    6798              
    6799              $C$DW$T$177     .dwtag  DW_TAG_enumeration_type
    6800                      .dwattr $C$DW$T$177, DW_AT_byte_size(0x01)
    6801              $C$DW$645       .dwtag  DW_TAG_enumerator, DW_AT_name("EST_State_Error"), DW_AT_const_value(0x00)
    6802              $C$DW$646       .dwtag  DW_TAG_enumerator, DW_AT_name("EST_State_Idle"), DW_AT_const_value(0x01)
    6803              $C$DW$647       .dwtag  DW_TAG_enumerator, DW_AT_name("EST_State_RoverL"), DW_AT_const_value(0x02)
    6804              $C$DW$648       .dwtag  DW_TAG_enumerator, DW_AT_name("EST_State_Rs"), DW_AT_const_value(0x03)
    6805              $C$DW$649       .dwtag  DW_TAG_enumerator, DW_AT_name("EST_State_RampUp"), DW_AT_const_value(0x04)
    6806              $C$DW$650       .dwtag  DW_TAG_enumerator, DW_AT_name("EST_State_IdRated"), DW_AT_const_value(0x05)
    6807              $C$DW$651       .dwtag  DW_TAG_enumerator, DW_AT_name("EST_State_RatedFlux_OL"), DW_AT_const_value(0x06)
    6808              $C$DW$652       .dwtag  DW_TAG_enumerator, DW_AT_name("EST_State_RatedFlux"), DW_AT_const_value(0x07)
    6809              $C$DW$653       .dwtag  DW_TAG_enumerator, DW_AT_name("EST_State_RampDown"), DW_AT_const_value(0x08)
    6810              $C$DW$654       .dwtag  DW_TAG_enumerator, DW_AT_name("EST_State_LockRotor"), DW_AT_const_value(0x09)
    6811              $C$DW$655       .dwtag  DW_TAG_enumerator, DW_AT_name("EST_State_Ls"), DW_AT_const_value(0x0a)
    6812              $C$DW$656       .dwtag  DW_TAG_enumerator, DW_AT_name("EST_State_Rr"), DW_AT_const_value(0x0b)
    6813              $C$DW$657       .dwtag  DW_TAG_enumerator, DW_AT_name("EST_State_MotorIdentified"), DW_AT_const_value(0x0c)
    6814              $C$DW$658       .dwtag  DW_TAG_enumerator, DW_AT_name("EST_State_OnLine"), DW_AT_const_value(0x0d)
    6815              $C$DW$659       .dwtag  DW_TAG_enumerator, DW_AT_name("EST_numStates"), DW_AT_const_value(0x0e)
    6816                      .dwendtag $C$DW$T$177
    6817              
    6818              $C$DW$T$178     .dwtag  DW_TAG_typedef, DW_AT_name("EST_State_e")
    6819                      .dwattr $C$DW$T$178, DW_AT_type(*$C$DW$T$177)
    6820                      .dwattr $C$DW$T$178, DW_AT_language(DW_LANG_C)
    6821              
    6822              $C$DW$T$182     .dwtag  DW_TAG_enumeration_type
    6823                      .dwattr $C$DW$T$182, DW_AT_byte_size(0x01)
    6824              $C$DW$660       .dwtag  DW_TAG_enumerator, DW_AT_name("CTRL_Type_PID_spd"), DW_AT_const_value(0x00)
    6825              $C$DW$661       .dwtag  DW_TAG_enumerator, DW_AT_name("CTRL_Type_PID_Id"), DW_AT_const_value(0x01)
    6826              $C$DW$662       .dwtag  DW_TAG_enumerator, DW_AT_name("CTRL_Type_PID_Iq"), DW_AT_const_value(0x02)
    6827                      .dwendtag $C$DW$T$182
    6828              
    6829              $C$DW$T$183     .dwtag  DW_TAG_typedef, DW_AT_name("CTRL_Type_e")
    6830                      .dwattr $C$DW$T$183, DW_AT_type(*$C$DW$T$182)
    6831                      .dwattr $C$DW$T$183, DW_AT_language(DW_LANG_C)
    6832              $C$DW$663       .dwtag  DW_TAG_TI_far_type
    6833                      .dwattr $C$DW$663, DW_AT_type(*$C$DW$T$183)
    6834              $C$DW$T$184     .dwtag  DW_TAG_const_type
    6835                      .dwattr $C$DW$T$184, DW_AT_type(*$C$DW$663)
    6836              
    6837              $C$DW$T$19      .dwtag  DW_TAG_structure_type
    6838                      .dwattr $C$DW$T$19, DW_AT_name("I2C_Obj")
    6839                      .dwattr $C$DW$T$19, DW_AT_declaration
    6840                      .dwendtag $C$DW$T$19
    6841              
TMS320C2000 Assembler PC v6.2.5 Sun Oct 08 22:38:01 2017

Tools Copyright (c) 1996-2014 Texas Instruments Incorporated
C:\Users\wmj\AppData\Local\Temp\0385210                              PAGE  132

    6842              $C$DW$T$116     .dwtag  DW_TAG_pointer_type
    6843                      .dwattr $C$DW$T$116, DW_AT_type(*$C$DW$T$19)
    6844                      .dwattr $C$DW$T$116, DW_AT_address_class(0x16)
    6845              $C$DW$T$117     .dwtag  DW_TAG_typedef, DW_AT_name("I2C_Handle")
    6846                      .dwattr $C$DW$T$117, DW_AT_type(*$C$DW$T$116)
    6847                      .dwattr $C$DW$T$117, DW_AT_language(DW_LANG_C)
    6848              
    6849              $C$DW$T$31      .dwtag  DW_TAG_structure_type
    6850                      .dwattr $C$DW$T$31, DW_AT_name("_ADC_Obj_")
    6851                      .dwattr $C$DW$T$31, DW_AT_byte_size(0x6650)
    6852              $C$DW$664       .dwtag  DW_TAG_member
    6853                      .dwattr $C$DW$664, DW_AT_type(*$C$DW$T$25)
    6854                      .dwattr $C$DW$664, DW_AT_name("ADCRESULT")
    6855                      .dwattr $C$DW$664, DW_AT_TI_symbol_name("_ADCRESULT")
    6856                      .dwattr $C$DW$664, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    6857                      .dwattr $C$DW$664, DW_AT_accessibility(DW_ACCESS_public)
    6858              $C$DW$665       .dwtag  DW_TAG_member
    6859                      .dwattr $C$DW$665, DW_AT_type(*$C$DW$T$26)
    6860                      .dwattr $C$DW$665, DW_AT_name("resvd_1")
    6861                      .dwattr $C$DW$665, DW_AT_TI_symbol_name("_resvd_1")
    6862                      .dwattr $C$DW$665, DW_AT_data_member_location[DW_OP_plus_uconst 0x10]
    6863                      .dwattr $C$DW$665, DW_AT_accessibility(DW_ACCESS_public)
    6864              $C$DW$666       .dwtag  DW_TAG_member
    6865                      .dwattr $C$DW$666, DW_AT_type(*$C$DW$T$24)
    6866                      .dwattr $C$DW$666, DW_AT_name("ADCCTL1")
    6867                      .dwattr $C$DW$666, DW_AT_TI_symbol_name("_ADCCTL1")
    6868                      .dwattr $C$DW$666, DW_AT_data_member_location[DW_OP_plus_uconst 0x6600]
    6869                      .dwattr $C$DW$666, DW_AT_accessibility(DW_ACCESS_public)
    6870              $C$DW$667       .dwtag  DW_TAG_member
    6871                      .dwattr $C$DW$667, DW_AT_type(*$C$DW$T$24)
    6872                      .dwattr $C$DW$667, DW_AT_name("ADCCTL2")
    6873                      .dwattr $C$DW$667, DW_AT_TI_symbol_name("_ADCCTL2")
    6874                      .dwattr $C$DW$667, DW_AT_data_member_location[DW_OP_plus_uconst 0x6601]
    6875                      .dwattr $C$DW$667, DW_AT_accessibility(DW_ACCESS_public)
    6876              $C$DW$668       .dwtag  DW_TAG_member
    6877                      .dwattr $C$DW$668, DW_AT_type(*$C$DW$T$27)
    6878                      .dwattr $C$DW$668, DW_AT_name("rsvd_2")
    6879                      .dwattr $C$DW$668, DW_AT_TI_symbol_name("_rsvd_2")
    6880                      .dwattr $C$DW$668, DW_AT_data_member_location[DW_OP_plus_uconst 0x6602]
    6881                      .dwattr $C$DW$668, DW_AT_accessibility(DW_ACCESS_public)
    6882              $C$DW$669       .dwtag  DW_TAG_member
    6883                      .dwattr $C$DW$669, DW_AT_type(*$C$DW$T$24)
    6884                      .dwattr $C$DW$669, DW_AT_name("ADCINTFLG")
    6885                      .dwattr $C$DW$669, DW_AT_TI_symbol_name("_ADCINTFLG")
    6886                      .dwattr $C$DW$669, DW_AT_data_member_location[DW_OP_plus_uconst 0x6604]
    6887                      .dwattr $C$DW$669, DW_AT_accessibility(DW_ACCESS_public)
    6888              $C$DW$670       .dwtag  DW_TAG_member
    6889                      .dwattr $C$DW$670, DW_AT_type(*$C$DW$T$24)
    6890                      .dwattr $C$DW$670, DW_AT_name("ADCINTFLGCLR")
    6891                      .dwattr $C$DW$670, DW_AT_TI_symbol_name("_ADCINTFLGCLR")
    6892                      .dwattr $C$DW$670, DW_AT_data_member_location[DW_OP_plus_uconst 0x6605]
    6893                      .dwattr $C$DW$670, DW_AT_accessibility(DW_ACCESS_public)
    6894              $C$DW$671       .dwtag  DW_TAG_member
    6895                      .dwattr $C$DW$671, DW_AT_type(*$C$DW$T$24)
    6896                      .dwattr $C$DW$671, DW_AT_name("ADCINTOVF")
TMS320C2000 Assembler PC v6.2.5 Sun Oct 08 22:38:01 2017

Tools Copyright (c) 1996-2014 Texas Instruments Incorporated
C:\Users\wmj\AppData\Local\Temp\0385210                              PAGE  133

    6897                      .dwattr $C$DW$671, DW_AT_TI_symbol_name("_ADCINTOVF")
    6898                      .dwattr $C$DW$671, DW_AT_data_member_location[DW_OP_plus_uconst 0x6606]
    6899                      .dwattr $C$DW$671, DW_AT_accessibility(DW_ACCESS_public)
    6900              $C$DW$672       .dwtag  DW_TAG_member
    6901                      .dwattr $C$DW$672, DW_AT_type(*$C$DW$T$24)
    6902                      .dwattr $C$DW$672, DW_AT_name("ADCINTOVFCLR")
    6903                      .dwattr $C$DW$672, DW_AT_TI_symbol_name("_ADCINTOVFCLR")
    6904                      .dwattr $C$DW$672, DW_AT_data_member_location[DW_OP_plus_uconst 0x6607]
    6905                      .dwattr $C$DW$672, DW_AT_accessibility(DW_ACCESS_public)
    6906              $C$DW$673       .dwtag  DW_TAG_member
    6907                      .dwattr $C$DW$673, DW_AT_type(*$C$DW$T$28)
    6908                      .dwattr $C$DW$673, DW_AT_name("INTSELxNy")
    6909                      .dwattr $C$DW$673, DW_AT_TI_symbol_name("_INTSELxNy")
    6910                      .dwattr $C$DW$673, DW_AT_data_member_location[DW_OP_plus_uconst 0x6608]
    6911                      .dwattr $C$DW$673, DW_AT_accessibility(DW_ACCESS_public)
    6912              $C$DW$674       .dwtag  DW_TAG_member
    6913                      .dwattr $C$DW$674, DW_AT_type(*$C$DW$T$29)
    6914                      .dwattr $C$DW$674, DW_AT_name("rsvd_3")
    6915                      .dwattr $C$DW$674, DW_AT_TI_symbol_name("_rsvd_3")
    6916                      .dwattr $C$DW$674, DW_AT_data_member_location[DW_OP_plus_uconst 0x660d]
    6917                      .dwattr $C$DW$674, DW_AT_accessibility(DW_ACCESS_public)
    6918              $C$DW$675       .dwtag  DW_TAG_member
    6919                      .dwattr $C$DW$675, DW_AT_type(*$C$DW$T$24)
    6920                      .dwattr $C$DW$675, DW_AT_name("SOCPRICTRL")
    6921                      .dwattr $C$DW$675, DW_AT_TI_symbol_name("_SOCPRICTRL")
    6922                      .dwattr $C$DW$675, DW_AT_data_member_location[DW_OP_plus_uconst 0x6610]
    6923                      .dwattr $C$DW$675, DW_AT_accessibility(DW_ACCESS_public)
    6924              $C$DW$676       .dwtag  DW_TAG_member
    6925                      .dwattr $C$DW$676, DW_AT_type(*$C$DW$T$24)
    6926                      .dwattr $C$DW$676, DW_AT_name("rsvd_4")
    6927                      .dwattr $C$DW$676, DW_AT_TI_symbol_name("_rsvd_4")
    6928                      .dwattr $C$DW$676, DW_AT_data_member_location[DW_OP_plus_uconst 0x6611]
    6929                      .dwattr $C$DW$676, DW_AT_accessibility(DW_ACCESS_public)
    6930              $C$DW$677       .dwtag  DW_TAG_member
    6931                      .dwattr $C$DW$677, DW_AT_type(*$C$DW$T$24)
    6932                      .dwattr $C$DW$677, DW_AT_name("ADCSAMPLEMODE")
    6933                      .dwattr $C$DW$677, DW_AT_TI_symbol_name("_ADCSAMPLEMODE")
    6934                      .dwattr $C$DW$677, DW_AT_data_member_location[DW_OP_plus_uconst 0x6612]
    6935                      .dwattr $C$DW$677, DW_AT_accessibility(DW_ACCESS_public)
    6936              $C$DW$678       .dwtag  DW_TAG_member
    6937                      .dwattr $C$DW$678, DW_AT_type(*$C$DW$T$24)
    6938                      .dwattr $C$DW$678, DW_AT_name("rsvd_5")
    6939                      .dwattr $C$DW$678, DW_AT_TI_symbol_name("_rsvd_5")
    6940                      .dwattr $C$DW$678, DW_AT_data_member_location[DW_OP_plus_uconst 0x6613]
    6941                      .dwattr $C$DW$678, DW_AT_accessibility(DW_ACCESS_public)
    6942              $C$DW$679       .dwtag  DW_TAG_member
    6943                      .dwattr $C$DW$679, DW_AT_type(*$C$DW$T$24)
    6944                      .dwattr $C$DW$679, DW_AT_name("ADCINTSOCSEL1")
    6945                      .dwattr $C$DW$679, DW_AT_TI_symbol_name("_ADCINTSOCSEL1")
    6946                      .dwattr $C$DW$679, DW_AT_data_member_location[DW_OP_plus_uconst 0x6614]
    6947                      .dwattr $C$DW$679, DW_AT_accessibility(DW_ACCESS_public)
    6948              $C$DW$680       .dwtag  DW_TAG_member
    6949                      .dwattr $C$DW$680, DW_AT_type(*$C$DW$T$24)
    6950                      .dwattr $C$DW$680, DW_AT_name("ADCINTSOCSEL2")
    6951                      .dwattr $C$DW$680, DW_AT_TI_symbol_name("_ADCINTSOCSEL2")
TMS320C2000 Assembler PC v6.2.5 Sun Oct 08 22:38:01 2017

Tools Copyright (c) 1996-2014 Texas Instruments Incorporated
C:\Users\wmj\AppData\Local\Temp\0385210                              PAGE  134

    6952                      .dwattr $C$DW$680, DW_AT_data_member_location[DW_OP_plus_uconst 0x6615]
    6953                      .dwattr $C$DW$680, DW_AT_accessibility(DW_ACCESS_public)
    6954              $C$DW$681       .dwtag  DW_TAG_member
    6955                      .dwattr $C$DW$681, DW_AT_type(*$C$DW$T$27)
    6956                      .dwattr $C$DW$681, DW_AT_name("rsvd_6")
    6957                      .dwattr $C$DW$681, DW_AT_TI_symbol_name("_rsvd_6")
    6958                      .dwattr $C$DW$681, DW_AT_data_member_location[DW_OP_plus_uconst 0x6616]
    6959                      .dwattr $C$DW$681, DW_AT_accessibility(DW_ACCESS_public)
    6960              $C$DW$682       .dwtag  DW_TAG_member
    6961                      .dwattr $C$DW$682, DW_AT_type(*$C$DW$T$24)
    6962                      .dwattr $C$DW$682, DW_AT_name("ADCSOCFLG1")
    6963                      .dwattr $C$DW$682, DW_AT_TI_symbol_name("_ADCSOCFLG1")
    6964                      .dwattr $C$DW$682, DW_AT_data_member_location[DW_OP_plus_uconst 0x6618]
    6965                      .dwattr $C$DW$682, DW_AT_accessibility(DW_ACCESS_public)
    6966              $C$DW$683       .dwtag  DW_TAG_member
    6967                      .dwattr $C$DW$683, DW_AT_type(*$C$DW$T$24)
    6968                      .dwattr $C$DW$683, DW_AT_name("rsvd_7")
    6969                      .dwattr $C$DW$683, DW_AT_TI_symbol_name("_rsvd_7")
    6970                      .dwattr $C$DW$683, DW_AT_data_member_location[DW_OP_plus_uconst 0x6619]
    6971                      .dwattr $C$DW$683, DW_AT_accessibility(DW_ACCESS_public)
    6972              $C$DW$684       .dwtag  DW_TAG_member
    6973                      .dwattr $C$DW$684, DW_AT_type(*$C$DW$T$24)
    6974                      .dwattr $C$DW$684, DW_AT_name("ADCSOCFRC1")
    6975                      .dwattr $C$DW$684, DW_AT_TI_symbol_name("_ADCSOCFRC1")
    6976                      .dwattr $C$DW$684, DW_AT_data_member_location[DW_OP_plus_uconst 0x661a]
    6977                      .dwattr $C$DW$684, DW_AT_accessibility(DW_ACCESS_public)
    6978              $C$DW$685       .dwtag  DW_TAG_member
    6979                      .dwattr $C$DW$685, DW_AT_type(*$C$DW$T$24)
    6980                      .dwattr $C$DW$685, DW_AT_name("rsvd_8")
    6981                      .dwattr $C$DW$685, DW_AT_TI_symbol_name("_rsvd_8")
    6982                      .dwattr $C$DW$685, DW_AT_data_member_location[DW_OP_plus_uconst 0x661b]
    6983                      .dwattr $C$DW$685, DW_AT_accessibility(DW_ACCESS_public)
    6984              $C$DW$686       .dwtag  DW_TAG_member
    6985                      .dwattr $C$DW$686, DW_AT_type(*$C$DW$T$24)
    6986                      .dwattr $C$DW$686, DW_AT_name("ADCSOCOVF1")
    6987                      .dwattr $C$DW$686, DW_AT_TI_symbol_name("_ADCSOCOVF1")
    6988                      .dwattr $C$DW$686, DW_AT_data_member_location[DW_OP_plus_uconst 0x661c]
    6989                      .dwattr $C$DW$686, DW_AT_accessibility(DW_ACCESS_public)
    6990              $C$DW$687       .dwtag  DW_TAG_member
    6991                      .dwattr $C$DW$687, DW_AT_type(*$C$DW$T$24)
    6992                      .dwattr $C$DW$687, DW_AT_name("rsvd_9")
    6993                      .dwattr $C$DW$687, DW_AT_TI_symbol_name("_rsvd_9")
    6994                      .dwattr $C$DW$687, DW_AT_data_member_location[DW_OP_plus_uconst 0x661d]
    6995                      .dwattr $C$DW$687, DW_AT_accessibility(DW_ACCESS_public)
    6996              $C$DW$688       .dwtag  DW_TAG_member
    6997                      .dwattr $C$DW$688, DW_AT_type(*$C$DW$T$24)
    6998                      .dwattr $C$DW$688, DW_AT_name("ADCSOCOVFCLR1")
    6999                      .dwattr $C$DW$688, DW_AT_TI_symbol_name("_ADCSOCOVFCLR1")
    7000                      .dwattr $C$DW$688, DW_AT_data_member_location[DW_OP_plus_uconst 0x661e]
    7001                      .dwattr $C$DW$688, DW_AT_accessibility(DW_ACCESS_public)
    7002              $C$DW$689       .dwtag  DW_TAG_member
    7003                      .dwattr $C$DW$689, DW_AT_type(*$C$DW$T$24)
    7004                      .dwattr $C$DW$689, DW_AT_name("rsvd_10")
    7005                      .dwattr $C$DW$689, DW_AT_TI_symbol_name("_rsvd_10")
    7006                      .dwattr $C$DW$689, DW_AT_data_member_location[DW_OP_plus_uconst 0x661f]
TMS320C2000 Assembler PC v6.2.5 Sun Oct 08 22:38:01 2017

Tools Copyright (c) 1996-2014 Texas Instruments Incorporated
C:\Users\wmj\AppData\Local\Temp\0385210                              PAGE  135

    7007                      .dwattr $C$DW$689, DW_AT_accessibility(DW_ACCESS_public)
    7008              $C$DW$690       .dwtag  DW_TAG_member
    7009                      .dwattr $C$DW$690, DW_AT_type(*$C$DW$T$25)
    7010                      .dwattr $C$DW$690, DW_AT_name("ADCSOCxCTL")
    7011                      .dwattr $C$DW$690, DW_AT_TI_symbol_name("_ADCSOCxCTL")
    7012                      .dwattr $C$DW$690, DW_AT_data_member_location[DW_OP_plus_uconst 0x6620]
    7013                      .dwattr $C$DW$690, DW_AT_accessibility(DW_ACCESS_public)
    7014              $C$DW$691       .dwtag  DW_TAG_member
    7015                      .dwattr $C$DW$691, DW_AT_type(*$C$DW$T$25)
    7016                      .dwattr $C$DW$691, DW_AT_name("rsvd_11")
    7017                      .dwattr $C$DW$691, DW_AT_TI_symbol_name("_rsvd_11")
    7018                      .dwattr $C$DW$691, DW_AT_data_member_location[DW_OP_plus_uconst 0x6630]
    7019                      .dwattr $C$DW$691, DW_AT_accessibility(DW_ACCESS_public)
    7020              $C$DW$692       .dwtag  DW_TAG_member
    7021                      .dwattr $C$DW$692, DW_AT_type(*$C$DW$T$24)
    7022                      .dwattr $C$DW$692, DW_AT_name("ADCREFTRIM")
    7023                      .dwattr $C$DW$692, DW_AT_TI_symbol_name("_ADCREFTRIM")
    7024                      .dwattr $C$DW$692, DW_AT_data_member_location[DW_OP_plus_uconst 0x6640]
    7025                      .dwattr $C$DW$692, DW_AT_accessibility(DW_ACCESS_public)
    7026              $C$DW$693       .dwtag  DW_TAG_member
    7027                      .dwattr $C$DW$693, DW_AT_type(*$C$DW$T$24)
    7028                      .dwattr $C$DW$693, DW_AT_name("ADCOFFTRIM")
    7029                      .dwattr $C$DW$693, DW_AT_TI_symbol_name("_ADCOFFTRIM")
    7030                      .dwattr $C$DW$693, DW_AT_data_member_location[DW_OP_plus_uconst 0x6641]
    7031                      .dwattr $C$DW$693, DW_AT_accessibility(DW_ACCESS_public)
    7032              $C$DW$694       .dwtag  DW_TAG_member
    7033                      .dwattr $C$DW$694, DW_AT_type(*$C$DW$T$30)
    7034                      .dwattr $C$DW$694, DW_AT_name("resvd_12")
    7035                      .dwattr $C$DW$694, DW_AT_TI_symbol_name("_resvd_12")
    7036                      .dwattr $C$DW$694, DW_AT_data_member_location[DW_OP_plus_uconst 0x6642]
    7037                      .dwattr $C$DW$694, DW_AT_accessibility(DW_ACCESS_public)
    7038              $C$DW$695       .dwtag  DW_TAG_member
    7039                      .dwattr $C$DW$695, DW_AT_type(*$C$DW$T$24)
    7040                      .dwattr $C$DW$695, DW_AT_name("ADCREV")
    7041                      .dwattr $C$DW$695, DW_AT_TI_symbol_name("_ADCREV")
    7042                      .dwattr $C$DW$695, DW_AT_data_member_location[DW_OP_plus_uconst 0x664f]
    7043                      .dwattr $C$DW$695, DW_AT_accessibility(DW_ACCESS_public)
    7044                      .dwendtag $C$DW$T$31
    7045              
    7046              $C$DW$T$87      .dwtag  DW_TAG_pointer_type
    7047                      .dwattr $C$DW$T$87, DW_AT_type(*$C$DW$T$31)
    7048                      .dwattr $C$DW$T$87, DW_AT_address_class(0x16)
    7049              $C$DW$T$88      .dwtag  DW_TAG_typedef, DW_AT_name("ADC_Handle")
    7050                      .dwattr $C$DW$T$88, DW_AT_type(*$C$DW$T$87)
    7051                      .dwattr $C$DW$T$88, DW_AT_language(DW_LANG_C)
    7052              
    7053              $C$DW$T$35      .dwtag  DW_TAG_structure_type
    7054                      .dwattr $C$DW$T$35, DW_AT_name("_BRAKE_Obj_")
    7055                      .dwattr $C$DW$T$35, DW_AT_byte_size(0x08)
    7056              $C$DW$696       .dwtag  DW_TAG_member
    7057                      .dwattr $C$DW$696, DW_AT_type(*$C$DW$T$32)
    7058                      .dwattr $C$DW$696, DW_AT_name("angle_pu")
    7059                      .dwattr $C$DW$696, DW_AT_TI_symbol_name("_angle_pu")
    7060                      .dwattr $C$DW$696, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    7061                      .dwattr $C$DW$696, DW_AT_accessibility(DW_ACCESS_public)
TMS320C2000 Assembler PC v6.2.5 Sun Oct 08 22:38:01 2017

Tools Copyright (c) 1996-2014 Texas Instruments Incorporated
C:\Users\wmj\AppData\Local\Temp\0385210                              PAGE  136

    7062              $C$DW$697       .dwtag  DW_TAG_member
    7063                      .dwattr $C$DW$697, DW_AT_type(*$C$DW$T$33)
    7064                      .dwattr $C$DW$697, DW_AT_name("Idq_brake")
    7065                      .dwattr $C$DW$697, DW_AT_TI_symbol_name("_Idq_brake")
    7066                      .dwattr $C$DW$697, DW_AT_data_member_location[DW_OP_plus_uconst 0x2]
    7067                      .dwattr $C$DW$697, DW_AT_accessibility(DW_ACCESS_public)
    7068              $C$DW$698       .dwtag  DW_TAG_member
    7069                      .dwattr $C$DW$698, DW_AT_type(*$C$DW$T$34)
    7070                      .dwattr $C$DW$698, DW_AT_name("brake_enable")
    7071                      .dwattr $C$DW$698, DW_AT_TI_symbol_name("_brake_enable")
    7072                      .dwattr $C$DW$698, DW_AT_data_member_location[DW_OP_plus_uconst 0x6]
    7073                      .dwattr $C$DW$698, DW_AT_accessibility(DW_ACCESS_public)
    7074                      .dwendtag $C$DW$T$35
    7075              
    7076              $C$DW$T$74      .dwtag  DW_TAG_typedef, DW_AT_name("BRAKE_Obj")
    7077                      .dwattr $C$DW$T$74, DW_AT_type(*$C$DW$T$35)
    7078                      .dwattr $C$DW$T$74, DW_AT_language(DW_LANG_C)
    7079              $C$DW$T$72      .dwtag  DW_TAG_pointer_type
    7080                      .dwattr $C$DW$T$72, DW_AT_type(*$C$DW$T$35)
    7081                      .dwattr $C$DW$T$72, DW_AT_address_class(0x16)
    7082              $C$DW$T$73      .dwtag  DW_TAG_typedef, DW_AT_name("BRAKE_Handle")
    7083                      .dwattr $C$DW$T$73, DW_AT_type(*$C$DW$T$72)
    7084                      .dwattr $C$DW$T$73, DW_AT_language(DW_LANG_C)
    7085              
    7086              $C$DW$T$37      .dwtag  DW_TAG_structure_type
    7087                      .dwattr $C$DW$T$37, DW_AT_name("_CLARKE_Obj_")
    7088                      .dwattr $C$DW$T$37, DW_AT_byte_size(0x06)
    7089              $C$DW$699       .dwtag  DW_TAG_member
    7090                      .dwattr $C$DW$699, DW_AT_type(*$C$DW$T$32)
    7091                      .dwattr $C$DW$699, DW_AT_name("alpha_sf")
    7092                      .dwattr $C$DW$699, DW_AT_TI_symbol_name("_alpha_sf")
    7093                      .dwattr $C$DW$699, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    7094                      .dwattr $C$DW$699, DW_AT_accessibility(DW_ACCESS_public)
    7095              $C$DW$700       .dwtag  DW_TAG_member
    7096                      .dwattr $C$DW$700, DW_AT_type(*$C$DW$T$32)
    7097                      .dwattr $C$DW$700, DW_AT_name("beta_sf")
    7098                      .dwattr $C$DW$700, DW_AT_TI_symbol_name("_beta_sf")
    7099                      .dwattr $C$DW$700, DW_AT_data_member_location[DW_OP_plus_uconst 0x2]
    7100                      .dwattr $C$DW$700, DW_AT_accessibility(DW_ACCESS_public)
    7101              $C$DW$701       .dwtag  DW_TAG_member
    7102                      .dwattr $C$DW$701, DW_AT_type(*$C$DW$T$36)
    7103                      .dwattr $C$DW$701, DW_AT_name("numSensors")
    7104                      .dwattr $C$DW$701, DW_AT_TI_symbol_name("_numSensors")
    7105                      .dwattr $C$DW$701, DW_AT_data_member_location[DW_OP_plus_uconst 0x4]
    7106                      .dwattr $C$DW$701, DW_AT_accessibility(DW_ACCESS_public)
    7107                      .dwendtag $C$DW$T$37
    7108              
    7109              $C$DW$T$48      .dwtag  DW_TAG_typedef, DW_AT_name("CLARKE_Obj")
    7110                      .dwattr $C$DW$T$48, DW_AT_type(*$C$DW$T$37)
    7111                      .dwattr $C$DW$T$48, DW_AT_language(DW_LANG_C)
    7112              $C$DW$T$190     .dwtag  DW_TAG_pointer_type
    7113                      .dwattr $C$DW$T$190, DW_AT_type(*$C$DW$T$48)
    7114                      .dwattr $C$DW$T$190, DW_AT_address_class(0x16)
    7115              $C$DW$T$46      .dwtag  DW_TAG_pointer_type
    7116                      .dwattr $C$DW$T$46, DW_AT_type(*$C$DW$T$37)
TMS320C2000 Assembler PC v6.2.5 Sun Oct 08 22:38:01 2017

Tools Copyright (c) 1996-2014 Texas Instruments Incorporated
C:\Users\wmj\AppData\Local\Temp\0385210                              PAGE  137

    7117                      .dwattr $C$DW$T$46, DW_AT_address_class(0x16)
    7118              $C$DW$T$47      .dwtag  DW_TAG_typedef, DW_AT_name("CLARKE_Handle")
    7119                      .dwattr $C$DW$T$47, DW_AT_type(*$C$DW$T$46)
    7120                      .dwattr $C$DW$T$47, DW_AT_language(DW_LANG_C)
    7121              
    7122              $C$DW$T$39      .dwtag  DW_TAG_structure_type
    7123                      .dwattr $C$DW$T$39, DW_AT_name("_CLK_Obj_")
    7124                      .dwattr $C$DW$T$39, DW_AT_byte_size(0x11)
    7125              $C$DW$702       .dwtag  DW_TAG_member
    7126                      .dwattr $C$DW$702, DW_AT_type(*$C$DW$T$24)
    7127                      .dwattr $C$DW$702, DW_AT_name("XCLK")
    7128                      .dwattr $C$DW$702, DW_AT_TI_symbol_name("_XCLK")
    7129                      .dwattr $C$DW$702, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    7130                      .dwattr $C$DW$702, DW_AT_accessibility(DW_ACCESS_public)
    7131              $C$DW$703       .dwtag  DW_TAG_member
    7132                      .dwattr $C$DW$703, DW_AT_type(*$C$DW$T$24)
    7133                      .dwattr $C$DW$703, DW_AT_name("rsvd_1")
    7134                      .dwattr $C$DW$703, DW_AT_TI_symbol_name("_rsvd_1")
    7135                      .dwattr $C$DW$703, DW_AT_data_member_location[DW_OP_plus_uconst 0x1]
    7136                      .dwattr $C$DW$703, DW_AT_accessibility(DW_ACCESS_public)
    7137              $C$DW$704       .dwtag  DW_TAG_member
    7138                      .dwattr $C$DW$704, DW_AT_type(*$C$DW$T$24)
    7139                      .dwattr $C$DW$704, DW_AT_name("CLKCTL")
    7140                      .dwattr $C$DW$704, DW_AT_TI_symbol_name("_CLKCTL")
    7141                      .dwattr $C$DW$704, DW_AT_data_member_location[DW_OP_plus_uconst 0x2]
    7142                      .dwattr $C$DW$704, DW_AT_accessibility(DW_ACCESS_public)
    7143              $C$DW$705       .dwtag  DW_TAG_member
    7144                      .dwattr $C$DW$705, DW_AT_type(*$C$DW$T$38)
    7145                      .dwattr $C$DW$705, DW_AT_name("rsvd_2")
    7146                      .dwattr $C$DW$705, DW_AT_TI_symbol_name("_rsvd_2")
    7147                      .dwattr $C$DW$705, DW_AT_data_member_location[DW_OP_plus_uconst 0x3]
    7148                      .dwattr $C$DW$705, DW_AT_accessibility(DW_ACCESS_public)
    7149              $C$DW$706       .dwtag  DW_TAG_member
    7150                      .dwattr $C$DW$706, DW_AT_type(*$C$DW$T$24)
    7151                      .dwattr $C$DW$706, DW_AT_name("LOSPCP")
    7152                      .dwattr $C$DW$706, DW_AT_TI_symbol_name("_LOSPCP")
    7153                      .dwattr $C$DW$706, DW_AT_data_member_location[DW_OP_plus_uconst 0xb]
    7154                      .dwattr $C$DW$706, DW_AT_accessibility(DW_ACCESS_public)
    7155              $C$DW$707       .dwtag  DW_TAG_member
    7156                      .dwattr $C$DW$707, DW_AT_type(*$C$DW$T$24)
    7157                      .dwattr $C$DW$707, DW_AT_name("PCLKCR0")
    7158                      .dwattr $C$DW$707, DW_AT_TI_symbol_name("_PCLKCR0")
    7159                      .dwattr $C$DW$707, DW_AT_data_member_location[DW_OP_plus_uconst 0xc]
    7160                      .dwattr $C$DW$707, DW_AT_accessibility(DW_ACCESS_public)
    7161              $C$DW$708       .dwtag  DW_TAG_member
    7162                      .dwattr $C$DW$708, DW_AT_type(*$C$DW$T$24)
    7163                      .dwattr $C$DW$708, DW_AT_name("PCLKCR1")
    7164                      .dwattr $C$DW$708, DW_AT_TI_symbol_name("_PCLKCR1")
    7165                      .dwattr $C$DW$708, DW_AT_data_member_location[DW_OP_plus_uconst 0xd]
    7166                      .dwattr $C$DW$708, DW_AT_accessibility(DW_ACCESS_public)
    7167              $C$DW$709       .dwtag  DW_TAG_member
    7168                      .dwattr $C$DW$709, DW_AT_type(*$C$DW$T$27)
    7169                      .dwattr $C$DW$709, DW_AT_name("rsvd_3")
    7170                      .dwattr $C$DW$709, DW_AT_TI_symbol_name("_rsvd_3")
    7171                      .dwattr $C$DW$709, DW_AT_data_member_location[DW_OP_plus_uconst 0xe]
TMS320C2000 Assembler PC v6.2.5 Sun Oct 08 22:38:01 2017

Tools Copyright (c) 1996-2014 Texas Instruments Incorporated
C:\Users\wmj\AppData\Local\Temp\0385210                              PAGE  138

    7172                      .dwattr $C$DW$709, DW_AT_accessibility(DW_ACCESS_public)
    7173              $C$DW$710       .dwtag  DW_TAG_member
    7174                      .dwattr $C$DW$710, DW_AT_type(*$C$DW$T$24)
    7175                      .dwattr $C$DW$710, DW_AT_name("PCLKCR3")
    7176                      .dwattr $C$DW$710, DW_AT_TI_symbol_name("_PCLKCR3")
    7177                      .dwattr $C$DW$710, DW_AT_data_member_location[DW_OP_plus_uconst 0x10]
    7178                      .dwattr $C$DW$710, DW_AT_accessibility(DW_ACCESS_public)
    7179                      .dwendtag $C$DW$T$39
    7180              
    7181              $C$DW$T$89      .dwtag  DW_TAG_pointer_type
    7182                      .dwattr $C$DW$T$89, DW_AT_type(*$C$DW$T$39)
    7183                      .dwattr $C$DW$T$89, DW_AT_address_class(0x16)
    7184              $C$DW$T$90      .dwtag  DW_TAG_typedef, DW_AT_name("CLK_Handle")
    7185                      .dwattr $C$DW$T$90, DW_AT_type(*$C$DW$T$89)
    7186                      .dwattr $C$DW$T$90, DW_AT_language(DW_LANG_C)
    7187              
    7188              $C$DW$T$40      .dwtag  DW_TAG_structure_type
    7189                      .dwattr $C$DW$T$40, DW_AT_name("_CPU_Obj_")
    7190                      .dwattr $C$DW$T$40, DW_AT_byte_size(0x01)
    7191              $C$DW$711       .dwtag  DW_TAG_member
    7192                      .dwattr $C$DW$711, DW_AT_type(*$C$DW$T$36)
    7193                      .dwattr $C$DW$711, DW_AT_name("tmp")
    7194                      .dwattr $C$DW$711, DW_AT_TI_symbol_name("_tmp")
    7195                      .dwattr $C$DW$711, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    7196                      .dwattr $C$DW$711, DW_AT_accessibility(DW_ACCESS_public)
    7197                      .dwendtag $C$DW$T$40
    7198              
    7199              $C$DW$T$91      .dwtag  DW_TAG_pointer_type
    7200                      .dwattr $C$DW$T$91, DW_AT_type(*$C$DW$T$40)
    7201                      .dwattr $C$DW$T$91, DW_AT_address_class(0x16)
    7202              $C$DW$T$92      .dwtag  DW_TAG_typedef, DW_AT_name("CPU_Handle")
    7203                      .dwattr $C$DW$T$92, DW_AT_type(*$C$DW$T$91)
    7204                      .dwattr $C$DW$T$92, DW_AT_language(DW_LANG_C)
    7205              
    7206              $C$DW$T$75      .dwtag  DW_TAG_structure_type
    7207                      .dwattr $C$DW$T$75, DW_AT_name("_CTRL_Obj_")
    7208                      .dwattr $C$DW$T$75, DW_AT_byte_size(0x112)
    7209              $C$DW$712       .dwtag  DW_TAG_member
    7210                      .dwattr $C$DW$712, DW_AT_type(*$C$DW$T$41)
    7211                      .dwattr $C$DW$712, DW_AT_name("version")
    7212                      .dwattr $C$DW$712, DW_AT_TI_symbol_name("_version")
    7213                      .dwattr $C$DW$712, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    7214                      .dwattr $C$DW$712, DW_AT_accessibility(DW_ACCESS_public)
    7215              $C$DW$713       .dwtag  DW_TAG_member
    7216                      .dwattr $C$DW$713, DW_AT_type(*$C$DW$T$43)
    7217                      .dwattr $C$DW$713, DW_AT_name("state")
    7218                      .dwattr $C$DW$713, DW_AT_TI_symbol_name("_state")
    7219                      .dwattr $C$DW$713, DW_AT_data_member_location[DW_OP_plus_uconst 0x4]
    7220                      .dwattr $C$DW$713, DW_AT_accessibility(DW_ACCESS_public)
    7221              $C$DW$714       .dwtag  DW_TAG_member
    7222                      .dwattr $C$DW$714, DW_AT_type(*$C$DW$T$43)
    7223                      .dwattr $C$DW$714, DW_AT_name("prevState")
    7224                      .dwattr $C$DW$714, DW_AT_TI_symbol_name("_prevState")
    7225                      .dwattr $C$DW$714, DW_AT_data_member_location[DW_OP_plus_uconst 0x5]
    7226                      .dwattr $C$DW$714, DW_AT_accessibility(DW_ACCESS_public)
TMS320C2000 Assembler PC v6.2.5 Sun Oct 08 22:38:01 2017

Tools Copyright (c) 1996-2014 Texas Instruments Incorporated
C:\Users\wmj\AppData\Local\Temp\0385210                              PAGE  139

    7227              $C$DW$715       .dwtag  DW_TAG_member
    7228                      .dwattr $C$DW$715, DW_AT_type(*$C$DW$T$45)
    7229                      .dwattr $C$DW$715, DW_AT_name("errorCode")
    7230                      .dwattr $C$DW$715, DW_AT_TI_symbol_name("_errorCode")
    7231                      .dwattr $C$DW$715, DW_AT_data_member_location[DW_OP_plus_uconst 0x6]
    7232                      .dwattr $C$DW$715, DW_AT_accessibility(DW_ACCESS_public)
    7233              $C$DW$716       .dwtag  DW_TAG_member
    7234                      .dwattr $C$DW$716, DW_AT_type(*$C$DW$T$47)
    7235                      .dwattr $C$DW$716, DW_AT_name("clarkeHandle_I")
    7236                      .dwattr $C$DW$716, DW_AT_TI_symbol_name("_clarkeHandle_I")
    7237                      .dwattr $C$DW$716, DW_AT_data_member_location[DW_OP_plus_uconst 0x8]
    7238                      .dwattr $C$DW$716, DW_AT_accessibility(DW_ACCESS_public)
    7239              $C$DW$717       .dwtag  DW_TAG_member
    7240                      .dwattr $C$DW$717, DW_AT_type(*$C$DW$T$48)
    7241                      .dwattr $C$DW$717, DW_AT_name("clarke_I")
    7242                      .dwattr $C$DW$717, DW_AT_TI_symbol_name("_clarke_I")
    7243                      .dwattr $C$DW$717, DW_AT_data_member_location[DW_OP_plus_uconst 0xa]
    7244                      .dwattr $C$DW$717, DW_AT_accessibility(DW_ACCESS_public)
    7245              $C$DW$718       .dwtag  DW_TAG_member
    7246                      .dwattr $C$DW$718, DW_AT_type(*$C$DW$T$47)
    7247                      .dwattr $C$DW$718, DW_AT_name("clarkeHandle_V")
    7248                      .dwattr $C$DW$718, DW_AT_TI_symbol_name("_clarkeHandle_V")
    7249                      .dwattr $C$DW$718, DW_AT_data_member_location[DW_OP_plus_uconst 0x10]
    7250                      .dwattr $C$DW$718, DW_AT_accessibility(DW_ACCESS_public)
    7251              $C$DW$719       .dwtag  DW_TAG_member
    7252                      .dwattr $C$DW$719, DW_AT_type(*$C$DW$T$48)
    7253                      .dwattr $C$DW$719, DW_AT_name("clarke_V")
    7254                      .dwattr $C$DW$719, DW_AT_TI_symbol_name("_clarke_V")
    7255                      .dwattr $C$DW$719, DW_AT_data_member_location[DW_OP_plus_uconst 0x12]
    7256                      .dwattr $C$DW$719, DW_AT_accessibility(DW_ACCESS_public)
    7257              $C$DW$720       .dwtag  DW_TAG_member
    7258                      .dwattr $C$DW$720, DW_AT_type(*$C$DW$T$50)
    7259                      .dwattr $C$DW$720, DW_AT_name("estHandle")
    7260                      .dwattr $C$DW$720, DW_AT_TI_symbol_name("_estHandle")
    7261                      .dwattr $C$DW$720, DW_AT_data_member_location[DW_OP_plus_uconst 0x18]
    7262                      .dwattr $C$DW$720, DW_AT_accessibility(DW_ACCESS_public)
    7263              $C$DW$721       .dwtag  DW_TAG_member
    7264                      .dwattr $C$DW$721, DW_AT_type(*$C$DW$T$52)
    7265                      .dwattr $C$DW$721, DW_AT_name("parkHandle")
    7266                      .dwattr $C$DW$721, DW_AT_TI_symbol_name("_parkHandle")
    7267                      .dwattr $C$DW$721, DW_AT_data_member_location[DW_OP_plus_uconst 0x1a]
    7268                      .dwattr $C$DW$721, DW_AT_accessibility(DW_ACCESS_public)
    7269              $C$DW$722       .dwtag  DW_TAG_member
    7270                      .dwattr $C$DW$722, DW_AT_type(*$C$DW$T$53)
    7271                      .dwattr $C$DW$722, DW_AT_name("park")
    7272                      .dwattr $C$DW$722, DW_AT_TI_symbol_name("_park")
    7273                      .dwattr $C$DW$722, DW_AT_data_member_location[DW_OP_plus_uconst 0x1c]
    7274                      .dwattr $C$DW$722, DW_AT_accessibility(DW_ACCESS_public)
    7275              $C$DW$723       .dwtag  DW_TAG_member
    7276                      .dwattr $C$DW$723, DW_AT_type(*$C$DW$T$55)
    7277                      .dwattr $C$DW$723, DW_AT_name("pidHandle_Id")
    7278                      .dwattr $C$DW$723, DW_AT_TI_symbol_name("_pidHandle_Id")
    7279                      .dwattr $C$DW$723, DW_AT_data_member_location[DW_OP_plus_uconst 0x20]
    7280                      .dwattr $C$DW$723, DW_AT_accessibility(DW_ACCESS_public)
    7281              $C$DW$724       .dwtag  DW_TAG_member
TMS320C2000 Assembler PC v6.2.5 Sun Oct 08 22:38:01 2017

Tools Copyright (c) 1996-2014 Texas Instruments Incorporated
C:\Users\wmj\AppData\Local\Temp\0385210                              PAGE  140

    7282                      .dwattr $C$DW$724, DW_AT_type(*$C$DW$T$56)
    7283                      .dwattr $C$DW$724, DW_AT_name("pid_Id")
    7284                      .dwattr $C$DW$724, DW_AT_TI_symbol_name("_pid_Id")
    7285                      .dwattr $C$DW$724, DW_AT_data_member_location[DW_OP_plus_uconst 0x22]
    7286                      .dwattr $C$DW$724, DW_AT_accessibility(DW_ACCESS_public)
    7287              $C$DW$725       .dwtag  DW_TAG_member
    7288                      .dwattr $C$DW$725, DW_AT_type(*$C$DW$T$55)
    7289                      .dwattr $C$DW$725, DW_AT_name("pidHandle_Iq")
    7290                      .dwattr $C$DW$725, DW_AT_TI_symbol_name("_pidHandle_Iq")
    7291                      .dwattr $C$DW$725, DW_AT_data_member_location[DW_OP_plus_uconst 0x32]
    7292                      .dwattr $C$DW$725, DW_AT_accessibility(DW_ACCESS_public)
    7293              $C$DW$726       .dwtag  DW_TAG_member
    7294                      .dwattr $C$DW$726, DW_AT_type(*$C$DW$T$56)
    7295                      .dwattr $C$DW$726, DW_AT_name("pid_Iq")
    7296                      .dwattr $C$DW$726, DW_AT_TI_symbol_name("_pid_Iq")
    7297                      .dwattr $C$DW$726, DW_AT_data_member_location[DW_OP_plus_uconst 0x34]
    7298                      .dwattr $C$DW$726, DW_AT_accessibility(DW_ACCESS_public)
    7299              $C$DW$727       .dwtag  DW_TAG_member
    7300                      .dwattr $C$DW$727, DW_AT_type(*$C$DW$T$55)
    7301                      .dwattr $C$DW$727, DW_AT_name("pidHandle_spd")
    7302                      .dwattr $C$DW$727, DW_AT_TI_symbol_name("_pidHandle_spd")
    7303                      .dwattr $C$DW$727, DW_AT_data_member_location[DW_OP_plus_uconst 0x44]
    7304                      .dwattr $C$DW$727, DW_AT_accessibility(DW_ACCESS_public)
    7305              $C$DW$728       .dwtag  DW_TAG_member
    7306                      .dwattr $C$DW$728, DW_AT_type(*$C$DW$T$56)
    7307                      .dwattr $C$DW$728, DW_AT_name("pid_spd")
    7308                      .dwattr $C$DW$728, DW_AT_TI_symbol_name("_pid_spd")
    7309                      .dwattr $C$DW$728, DW_AT_data_member_location[DW_OP_plus_uconst 0x46]
    7310                      .dwattr $C$DW$728, DW_AT_accessibility(DW_ACCESS_public)
    7311              $C$DW$729       .dwtag  DW_TAG_member
    7312                      .dwattr $C$DW$729, DW_AT_type(*$C$DW$T$58)
    7313                      .dwattr $C$DW$729, DW_AT_name("iparkHandle")
    7314                      .dwattr $C$DW$729, DW_AT_TI_symbol_name("_iparkHandle")
    7315                      .dwattr $C$DW$729, DW_AT_data_member_location[DW_OP_plus_uconst 0x56]
    7316                      .dwattr $C$DW$729, DW_AT_accessibility(DW_ACCESS_public)
    7317              $C$DW$730       .dwtag  DW_TAG_member
    7318                      .dwattr $C$DW$730, DW_AT_type(*$C$DW$T$59)
    7319                      .dwattr $C$DW$730, DW_AT_name("ipark")
    7320                      .dwattr $C$DW$730, DW_AT_TI_symbol_name("_ipark")
    7321                      .dwattr $C$DW$730, DW_AT_data_member_location[DW_OP_plus_uconst 0x58]
    7322                      .dwattr $C$DW$730, DW_AT_accessibility(DW_ACCESS_public)
    7323              $C$DW$731       .dwtag  DW_TAG_member
    7324                      .dwattr $C$DW$731, DW_AT_type(*$C$DW$T$61)
    7325                      .dwattr $C$DW$731, DW_AT_name("svgenHandle")
    7326                      .dwattr $C$DW$731, DW_AT_TI_symbol_name("_svgenHandle")
    7327                      .dwattr $C$DW$731, DW_AT_data_member_location[DW_OP_plus_uconst 0x5c]
    7328                      .dwattr $C$DW$731, DW_AT_accessibility(DW_ACCESS_public)
    7329              $C$DW$732       .dwtag  DW_TAG_member
    7330                      .dwattr $C$DW$732, DW_AT_type(*$C$DW$T$62)
    7331                      .dwattr $C$DW$732, DW_AT_name("svgen")
    7332                      .dwattr $C$DW$732, DW_AT_TI_symbol_name("_svgen")
    7333                      .dwattr $C$DW$732, DW_AT_data_member_location[DW_OP_plus_uconst 0x5e]
    7334                      .dwattr $C$DW$732, DW_AT_accessibility(DW_ACCESS_public)
    7335              $C$DW$733       .dwtag  DW_TAG_member
    7336                      .dwattr $C$DW$733, DW_AT_type(*$C$DW$T$64)
TMS320C2000 Assembler PC v6.2.5 Sun Oct 08 22:38:01 2017

Tools Copyright (c) 1996-2014 Texas Instruments Incorporated
C:\Users\wmj\AppData\Local\Temp\0385210                              PAGE  141

    7337                      .dwattr $C$DW$733, DW_AT_name("trajHandle_Id")
    7338                      .dwattr $C$DW$733, DW_AT_TI_symbol_name("_trajHandle_Id")
    7339                      .dwattr $C$DW$733, DW_AT_data_member_location[DW_OP_plus_uconst 0x60]
    7340                      .dwattr $C$DW$733, DW_AT_accessibility(DW_ACCESS_public)
    7341              $C$DW$734       .dwtag  DW_TAG_member
    7342                      .dwattr $C$DW$734, DW_AT_type(*$C$DW$T$65)
    7343                      .dwattr $C$DW$734, DW_AT_name("traj_Id")
    7344                      .dwattr $C$DW$734, DW_AT_TI_symbol_name("_traj_Id")
    7345                      .dwattr $C$DW$734, DW_AT_data_member_location[DW_OP_plus_uconst 0x62]
    7346                      .dwattr $C$DW$734, DW_AT_accessibility(DW_ACCESS_public)
    7347              $C$DW$735       .dwtag  DW_TAG_member
    7348                      .dwattr $C$DW$735, DW_AT_type(*$C$DW$T$64)
    7349                      .dwattr $C$DW$735, DW_AT_name("trajHandle_spd")
    7350                      .dwattr $C$DW$735, DW_AT_TI_symbol_name("_trajHandle_spd")
    7351                      .dwattr $C$DW$735, DW_AT_data_member_location[DW_OP_plus_uconst 0x6c]
    7352                      .dwattr $C$DW$735, DW_AT_accessibility(DW_ACCESS_public)
    7353              $C$DW$736       .dwtag  DW_TAG_member
    7354                      .dwattr $C$DW$736, DW_AT_type(*$C$DW$T$65)
    7355                      .dwattr $C$DW$736, DW_AT_name("traj_spd")
    7356                      .dwattr $C$DW$736, DW_AT_TI_symbol_name("_traj_spd")
    7357                      .dwattr $C$DW$736, DW_AT_data_member_location[DW_OP_plus_uconst 0x6e]
    7358                      .dwattr $C$DW$736, DW_AT_accessibility(DW_ACCESS_public)
    7359              $C$DW$737       .dwtag  DW_TAG_member
    7360                      .dwattr $C$DW$737, DW_AT_type(*$C$DW$T$64)
    7361                      .dwattr $C$DW$737, DW_AT_name("trajHandle_spdMax")
    7362                      .dwattr $C$DW$737, DW_AT_TI_symbol_name("_trajHandle_spdMax")
    7363                      .dwattr $C$DW$737, DW_AT_data_member_location[DW_OP_plus_uconst 0x78]
    7364                      .dwattr $C$DW$737, DW_AT_accessibility(DW_ACCESS_public)
    7365              $C$DW$738       .dwtag  DW_TAG_member
    7366                      .dwattr $C$DW$738, DW_AT_type(*$C$DW$T$65)
    7367                      .dwattr $C$DW$738, DW_AT_name("traj_spdMax")
    7368                      .dwattr $C$DW$738, DW_AT_TI_symbol_name("_traj_spdMax")
    7369                      .dwattr $C$DW$738, DW_AT_data_member_location[DW_OP_plus_uconst 0x7a]
    7370                      .dwattr $C$DW$738, DW_AT_accessibility(DW_ACCESS_public)
    7371              $C$DW$739       .dwtag  DW_TAG_member
    7372                      .dwattr $C$DW$739, DW_AT_type(*$C$DW$T$66)
    7373                      .dwattr $C$DW$739, DW_AT_name("motorParams")
    7374                      .dwattr $C$DW$739, DW_AT_TI_symbol_name("_motorParams")
    7375                      .dwattr $C$DW$739, DW_AT_data_member_location[DW_OP_plus_uconst 0x84]
    7376                      .dwattr $C$DW$739, DW_AT_accessibility(DW_ACCESS_public)
    7377              $C$DW$740       .dwtag  DW_TAG_member
    7378                      .dwattr $C$DW$740, DW_AT_type(*$C$DW$T$69)
    7379                      .dwattr $C$DW$740, DW_AT_name("waitTimes")
    7380                      .dwattr $C$DW$740, DW_AT_TI_symbol_name("_waitTimes")
    7381                      .dwattr $C$DW$740, DW_AT_data_member_location[DW_OP_plus_uconst 0x92]
    7382                      .dwattr $C$DW$740, DW_AT_accessibility(DW_ACCESS_public)
    7383              $C$DW$741       .dwtag  DW_TAG_member
    7384                      .dwattr $C$DW$741, DW_AT_type(*$C$DW$T$68)
    7385                      .dwattr $C$DW$741, DW_AT_name("counter_state")
    7386                      .dwattr $C$DW$741, DW_AT_TI_symbol_name("_counter_state")
    7387                      .dwattr $C$DW$741, DW_AT_data_member_location[DW_OP_plus_uconst 0x9a]
    7388                      .dwattr $C$DW$741, DW_AT_accessibility(DW_ACCESS_public)
    7389              $C$DW$742       .dwtag  DW_TAG_member
    7390                      .dwattr $C$DW$742, DW_AT_type(*$C$DW$T$70)
    7391                      .dwattr $C$DW$742, DW_AT_name("numIsrTicksPerCtrlTick")
TMS320C2000 Assembler PC v6.2.5 Sun Oct 08 22:38:01 2017

Tools Copyright (c) 1996-2014 Texas Instruments Incorporated
C:\Users\wmj\AppData\Local\Temp\0385210                              PAGE  142

    7392                      .dwattr $C$DW$742, DW_AT_TI_symbol_name("_numIsrTicksPerCtrlTick")
    7393                      .dwattr $C$DW$742, DW_AT_data_member_location[DW_OP_plus_uconst 0x9c]
    7394                      .dwattr $C$DW$742, DW_AT_accessibility(DW_ACCESS_public)
    7395              $C$DW$743       .dwtag  DW_TAG_member
    7396                      .dwattr $C$DW$743, DW_AT_type(*$C$DW$T$70)
    7397                      .dwattr $C$DW$743, DW_AT_name("numCtrlTicksPerCurrentTick")
    7398                      .dwattr $C$DW$743, DW_AT_TI_symbol_name("_numCtrlTicksPerCurrentTick")
    7399                      .dwattr $C$DW$743, DW_AT_data_member_location[DW_OP_plus_uconst 0x9d]
    7400                      .dwattr $C$DW$743, DW_AT_accessibility(DW_ACCESS_public)
    7401              $C$DW$744       .dwtag  DW_TAG_member
    7402                      .dwattr $C$DW$744, DW_AT_type(*$C$DW$T$70)
    7403                      .dwattr $C$DW$744, DW_AT_name("numCtrlTicksPerSpeedTick")
    7404                      .dwattr $C$DW$744, DW_AT_TI_symbol_name("_numCtrlTicksPerSpeedTick")
    7405                      .dwattr $C$DW$744, DW_AT_data_member_location[DW_OP_plus_uconst 0x9e]
    7406                      .dwattr $C$DW$744, DW_AT_accessibility(DW_ACCESS_public)
    7407              $C$DW$745       .dwtag  DW_TAG_member
    7408                      .dwattr $C$DW$745, DW_AT_type(*$C$DW$T$70)
    7409                      .dwattr $C$DW$745, DW_AT_name("numCtrlTicksPerTrajTick")
    7410                      .dwattr $C$DW$745, DW_AT_TI_symbol_name("_numCtrlTicksPerTrajTick")
    7411                      .dwattr $C$DW$745, DW_AT_data_member_location[DW_OP_plus_uconst 0x9f]
    7412                      .dwattr $C$DW$745, DW_AT_accessibility(DW_ACCESS_public)
    7413              $C$DW$746       .dwtag  DW_TAG_member
    7414                      .dwattr $C$DW$746, DW_AT_type(*$C$DW$T$68)
    7415                      .dwattr $C$DW$746, DW_AT_name("ctrlFreq_Hz")
    7416                      .dwattr $C$DW$746, DW_AT_TI_symbol_name("_ctrlFreq_Hz")
    7417                      .dwattr $C$DW$746, DW_AT_data_member_location[DW_OP_plus_uconst 0xa0]
    7418                      .dwattr $C$DW$746, DW_AT_accessibility(DW_ACCESS_public)
    7419              $C$DW$747       .dwtag  DW_TAG_member
    7420                      .dwattr $C$DW$747, DW_AT_type(*$C$DW$T$68)
    7421                      .dwattr $C$DW$747, DW_AT_name("trajFreq_Hz")
    7422                      .dwattr $C$DW$747, DW_AT_TI_symbol_name("_trajFreq_Hz")
    7423                      .dwattr $C$DW$747, DW_AT_data_member_location[DW_OP_plus_uconst 0xa2]
    7424                      .dwattr $C$DW$747, DW_AT_accessibility(DW_ACCESS_public)
    7425              $C$DW$748       .dwtag  DW_TAG_member
    7426                      .dwattr $C$DW$748, DW_AT_type(*$C$DW$T$32)
    7427                      .dwattr $C$DW$748, DW_AT_name("trajPeriod_sec")
    7428                      .dwattr $C$DW$748, DW_AT_TI_symbol_name("_trajPeriod_sec")
    7429                      .dwattr $C$DW$748, DW_AT_data_member_location[DW_OP_plus_uconst 0xa4]
    7430                      .dwattr $C$DW$748, DW_AT_accessibility(DW_ACCESS_public)
    7431              $C$DW$749       .dwtag  DW_TAG_member
    7432                      .dwattr $C$DW$749, DW_AT_type(*$C$DW$T$71)
    7433                      .dwattr $C$DW$749, DW_AT_name("ctrlPeriod_sec")
    7434                      .dwattr $C$DW$749, DW_AT_TI_symbol_name("_ctrlPeriod_sec")
    7435                      .dwattr $C$DW$749, DW_AT_data_member_location[DW_OP_plus_uconst 0xa6]
    7436                      .dwattr $C$DW$749, DW_AT_accessibility(DW_ACCESS_public)
    7437              $C$DW$750       .dwtag  DW_TAG_member
    7438                      .dwattr $C$DW$750, DW_AT_type(*$C$DW$T$32)
    7439                      .dwattr $C$DW$750, DW_AT_name("maxVsMag_pu")
    7440                      .dwattr $C$DW$750, DW_AT_TI_symbol_name("_maxVsMag_pu")
    7441                      .dwattr $C$DW$750, DW_AT_data_member_location[DW_OP_plus_uconst 0xa8]
    7442                      .dwattr $C$DW$750, DW_AT_accessibility(DW_ACCESS_public)
    7443              $C$DW$751       .dwtag  DW_TAG_member
    7444                      .dwattr $C$DW$751, DW_AT_type(*$C$DW$T$33)
    7445                      .dwattr $C$DW$751, DW_AT_name("Iab_in")
    7446                      .dwattr $C$DW$751, DW_AT_TI_symbol_name("_Iab_in")
TMS320C2000 Assembler PC v6.2.5 Sun Oct 08 22:38:01 2017

Tools Copyright (c) 1996-2014 Texas Instruments Incorporated
C:\Users\wmj\AppData\Local\Temp\0385210                              PAGE  143

    7447                      .dwattr $C$DW$751, DW_AT_data_member_location[DW_OP_plus_uconst 0xaa]
    7448                      .dwattr $C$DW$751, DW_AT_accessibility(DW_ACCESS_public)
    7449              $C$DW$752       .dwtag  DW_TAG_member
    7450                      .dwattr $C$DW$752, DW_AT_type(*$C$DW$T$33)
    7451                      .dwattr $C$DW$752, DW_AT_name("Iab_filt")
    7452                      .dwattr $C$DW$752, DW_AT_TI_symbol_name("_Iab_filt")
    7453                      .dwattr $C$DW$752, DW_AT_data_member_location[DW_OP_plus_uconst 0xae]
    7454                      .dwattr $C$DW$752, DW_AT_accessibility(DW_ACCESS_public)
    7455              $C$DW$753       .dwtag  DW_TAG_member
    7456                      .dwattr $C$DW$753, DW_AT_type(*$C$DW$T$33)
    7457                      .dwattr $C$DW$753, DW_AT_name("Idq_in")
    7458                      .dwattr $C$DW$753, DW_AT_TI_symbol_name("_Idq_in")
    7459                      .dwattr $C$DW$753, DW_AT_data_member_location[DW_OP_plus_uconst 0xb2]
    7460                      .dwattr $C$DW$753, DW_AT_accessibility(DW_ACCESS_public)
    7461              $C$DW$754       .dwtag  DW_TAG_member
    7462                      .dwattr $C$DW$754, DW_AT_type(*$C$DW$T$33)
    7463                      .dwattr $C$DW$754, DW_AT_name("Vab_in")
    7464                      .dwattr $C$DW$754, DW_AT_TI_symbol_name("_Vab_in")
    7465                      .dwattr $C$DW$754, DW_AT_data_member_location[DW_OP_plus_uconst 0xb6]
    7466                      .dwattr $C$DW$754, DW_AT_accessibility(DW_ACCESS_public)
    7467              $C$DW$755       .dwtag  DW_TAG_member
    7468                      .dwattr $C$DW$755, DW_AT_type(*$C$DW$T$32)
    7469                      .dwattr $C$DW$755, DW_AT_name("spd_out")
    7470                      .dwattr $C$DW$755, DW_AT_TI_symbol_name("_spd_out")
    7471                      .dwattr $C$DW$755, DW_AT_data_member_location[DW_OP_plus_uconst 0xba]
    7472                      .dwattr $C$DW$755, DW_AT_accessibility(DW_ACCESS_public)
    7473              $C$DW$756       .dwtag  DW_TAG_member
    7474                      .dwattr $C$DW$756, DW_AT_type(*$C$DW$T$33)
    7475                      .dwattr $C$DW$756, DW_AT_name("Vab_out")
    7476                      .dwattr $C$DW$756, DW_AT_TI_symbol_name("_Vab_out")
    7477                      .dwattr $C$DW$756, DW_AT_data_member_location[DW_OP_plus_uconst 0xbc]
    7478                      .dwattr $C$DW$756, DW_AT_accessibility(DW_ACCESS_public)
    7479              $C$DW$757       .dwtag  DW_TAG_member
    7480                      .dwattr $C$DW$757, DW_AT_type(*$C$DW$T$33)
    7481                      .dwattr $C$DW$757, DW_AT_name("Vdq_out")
    7482                      .dwattr $C$DW$757, DW_AT_TI_symbol_name("_Vdq_out")
    7483                      .dwattr $C$DW$757, DW_AT_data_member_location[DW_OP_plus_uconst 0xc0]
    7484                      .dwattr $C$DW$757, DW_AT_accessibility(DW_ACCESS_public)
    7485              $C$DW$758       .dwtag  DW_TAG_member
    7486                      .dwattr $C$DW$758, DW_AT_type(*$C$DW$T$71)
    7487                      .dwattr $C$DW$758, DW_AT_name("Rhf")
    7488                      .dwattr $C$DW$758, DW_AT_TI_symbol_name("_Rhf")
    7489                      .dwattr $C$DW$758, DW_AT_data_member_location[DW_OP_plus_uconst 0xc4]
    7490                      .dwattr $C$DW$758, DW_AT_accessibility(DW_ACCESS_public)
    7491              $C$DW$759       .dwtag  DW_TAG_member
    7492                      .dwattr $C$DW$759, DW_AT_type(*$C$DW$T$71)
    7493                      .dwattr $C$DW$759, DW_AT_name("Lhf")
    7494                      .dwattr $C$DW$759, DW_AT_TI_symbol_name("_Lhf")
    7495                      .dwattr $C$DW$759, DW_AT_data_member_location[DW_OP_plus_uconst 0xc6]
    7496                      .dwattr $C$DW$759, DW_AT_accessibility(DW_ACCESS_public)
    7497              $C$DW$760       .dwtag  DW_TAG_member
    7498                      .dwattr $C$DW$760, DW_AT_type(*$C$DW$T$71)
    7499                      .dwattr $C$DW$760, DW_AT_name("RoverL")
    7500                      .dwattr $C$DW$760, DW_AT_TI_symbol_name("_RoverL")
    7501                      .dwattr $C$DW$760, DW_AT_data_member_location[DW_OP_plus_uconst 0xc8]
TMS320C2000 Assembler PC v6.2.5 Sun Oct 08 22:38:01 2017

Tools Copyright (c) 1996-2014 Texas Instruments Incorporated
C:\Users\wmj\AppData\Local\Temp\0385210                              PAGE  144

    7502                      .dwattr $C$DW$760, DW_AT_accessibility(DW_ACCESS_public)
    7503              $C$DW$761       .dwtag  DW_TAG_member
    7504                      .dwattr $C$DW$761, DW_AT_type(*$C$DW$T$32)
    7505                      .dwattr $C$DW$761, DW_AT_name("Kp_Id")
    7506                      .dwattr $C$DW$761, DW_AT_TI_symbol_name("_Kp_Id")
    7507                      .dwattr $C$DW$761, DW_AT_data_member_location[DW_OP_plus_uconst 0xca]
    7508                      .dwattr $C$DW$761, DW_AT_accessibility(DW_ACCESS_public)
    7509              $C$DW$762       .dwtag  DW_TAG_member
    7510                      .dwattr $C$DW$762, DW_AT_type(*$C$DW$T$32)
    7511                      .dwattr $C$DW$762, DW_AT_name("Kp_Iq")
    7512                      .dwattr $C$DW$762, DW_AT_TI_symbol_name("_Kp_Iq")
    7513                      .dwattr $C$DW$762, DW_AT_data_member_location[DW_OP_plus_uconst 0xcc]
    7514                      .dwattr $C$DW$762, DW_AT_accessibility(DW_ACCESS_public)
    7515              $C$DW$763       .dwtag  DW_TAG_member
    7516                      .dwattr $C$DW$763, DW_AT_type(*$C$DW$T$32)
    7517                      .dwattr $C$DW$763, DW_AT_name("Kp_spd")
    7518                      .dwattr $C$DW$763, DW_AT_TI_symbol_name("_Kp_spd")
    7519                      .dwattr $C$DW$763, DW_AT_data_member_location[DW_OP_plus_uconst 0xce]
    7520                      .dwattr $C$DW$763, DW_AT_accessibility(DW_ACCESS_public)
    7521              $C$DW$764       .dwtag  DW_TAG_member
    7522                      .dwattr $C$DW$764, DW_AT_type(*$C$DW$T$32)
    7523                      .dwattr $C$DW$764, DW_AT_name("Ki_Id")
    7524                      .dwattr $C$DW$764, DW_AT_TI_symbol_name("_Ki_Id")
    7525                      .dwattr $C$DW$764, DW_AT_data_member_location[DW_OP_plus_uconst 0xd0]
    7526                      .dwattr $C$DW$764, DW_AT_accessibility(DW_ACCESS_public)
    7527              $C$DW$765       .dwtag  DW_TAG_member
    7528                      .dwattr $C$DW$765, DW_AT_type(*$C$DW$T$32)
    7529                      .dwattr $C$DW$765, DW_AT_name("Ki_Iq")
    7530                      .dwattr $C$DW$765, DW_AT_TI_symbol_name("_Ki_Iq")
    7531                      .dwattr $C$DW$765, DW_AT_data_member_location[DW_OP_plus_uconst 0xd2]
    7532                      .dwattr $C$DW$765, DW_AT_accessibility(DW_ACCESS_public)
    7533              $C$DW$766       .dwtag  DW_TAG_member
    7534                      .dwattr $C$DW$766, DW_AT_type(*$C$DW$T$32)
    7535                      .dwattr $C$DW$766, DW_AT_name("Ki_spd")
    7536                      .dwattr $C$DW$766, DW_AT_TI_symbol_name("_Ki_spd")
    7537                      .dwattr $C$DW$766, DW_AT_data_member_location[DW_OP_plus_uconst 0xd4]
    7538                      .dwattr $C$DW$766, DW_AT_accessibility(DW_ACCESS_public)
    7539              $C$DW$767       .dwtag  DW_TAG_member
    7540                      .dwattr $C$DW$767, DW_AT_type(*$C$DW$T$32)
    7541                      .dwattr $C$DW$767, DW_AT_name("Kd_Id")
    7542                      .dwattr $C$DW$767, DW_AT_TI_symbol_name("_Kd_Id")
    7543                      .dwattr $C$DW$767, DW_AT_data_member_location[DW_OP_plus_uconst 0xd6]
    7544                      .dwattr $C$DW$767, DW_AT_accessibility(DW_ACCESS_public)
    7545              $C$DW$768       .dwtag  DW_TAG_member
    7546                      .dwattr $C$DW$768, DW_AT_type(*$C$DW$T$32)
    7547                      .dwattr $C$DW$768, DW_AT_name("Kd_Iq")
    7548                      .dwattr $C$DW$768, DW_AT_TI_symbol_name("_Kd_Iq")
    7549                      .dwattr $C$DW$768, DW_AT_data_member_location[DW_OP_plus_uconst 0xd8]
    7550                      .dwattr $C$DW$768, DW_AT_accessibility(DW_ACCESS_public)
    7551              $C$DW$769       .dwtag  DW_TAG_member
    7552                      .dwattr $C$DW$769, DW_AT_type(*$C$DW$T$32)
    7553                      .dwattr $C$DW$769, DW_AT_name("Kd_spd")
    7554                      .dwattr $C$DW$769, DW_AT_TI_symbol_name("_Kd_spd")
    7555                      .dwattr $C$DW$769, DW_AT_data_member_location[DW_OP_plus_uconst 0xda]
    7556                      .dwattr $C$DW$769, DW_AT_accessibility(DW_ACCESS_public)
TMS320C2000 Assembler PC v6.2.5 Sun Oct 08 22:38:01 2017

Tools Copyright (c) 1996-2014 Texas Instruments Incorporated
C:\Users\wmj\AppData\Local\Temp\0385210                              PAGE  145

    7557              $C$DW$770       .dwtag  DW_TAG_member
    7558                      .dwattr $C$DW$770, DW_AT_type(*$C$DW$T$32)
    7559                      .dwattr $C$DW$770, DW_AT_name("Ui_Id")
    7560                      .dwattr $C$DW$770, DW_AT_TI_symbol_name("_Ui_Id")
    7561                      .dwattr $C$DW$770, DW_AT_data_member_location[DW_OP_plus_uconst 0xdc]
    7562                      .dwattr $C$DW$770, DW_AT_accessibility(DW_ACCESS_public)
    7563              $C$DW$771       .dwtag  DW_TAG_member
    7564                      .dwattr $C$DW$771, DW_AT_type(*$C$DW$T$32)
    7565                      .dwattr $C$DW$771, DW_AT_name("Ui_Iq")
    7566                      .dwattr $C$DW$771, DW_AT_TI_symbol_name("_Ui_Iq")
    7567                      .dwattr $C$DW$771, DW_AT_data_member_location[DW_OP_plus_uconst 0xde]
    7568                      .dwattr $C$DW$771, DW_AT_accessibility(DW_ACCESS_public)
    7569              $C$DW$772       .dwtag  DW_TAG_member
    7570                      .dwattr $C$DW$772, DW_AT_type(*$C$DW$T$32)
    7571                      .dwattr $C$DW$772, DW_AT_name("Ui_spd")
    7572                      .dwattr $C$DW$772, DW_AT_TI_symbol_name("_Ui_spd")
    7573                      .dwattr $C$DW$772, DW_AT_data_member_location[DW_OP_plus_uconst 0xe0]
    7574                      .dwattr $C$DW$772, DW_AT_accessibility(DW_ACCESS_public)
    7575              $C$DW$773       .dwtag  DW_TAG_member
    7576                      .dwattr $C$DW$773, DW_AT_type(*$C$DW$T$33)
    7577                      .dwattr $C$DW$773, DW_AT_name("Idq_ref")
    7578                      .dwattr $C$DW$773, DW_AT_TI_symbol_name("_Idq_ref")
    7579                      .dwattr $C$DW$773, DW_AT_data_member_location[DW_OP_plus_uconst 0xe2]
    7580                      .dwattr $C$DW$773, DW_AT_accessibility(DW_ACCESS_public)
    7581              $C$DW$774       .dwtag  DW_TAG_member
    7582                      .dwattr $C$DW$774, DW_AT_type(*$C$DW$T$32)
    7583                      .dwattr $C$DW$774, DW_AT_name("IdRated")
    7584                      .dwattr $C$DW$774, DW_AT_TI_symbol_name("_IdRated")
    7585                      .dwattr $C$DW$774, DW_AT_data_member_location[DW_OP_plus_uconst 0xe6]
    7586                      .dwattr $C$DW$774, DW_AT_accessibility(DW_ACCESS_public)
    7587              $C$DW$775       .dwtag  DW_TAG_member
    7588                      .dwattr $C$DW$775, DW_AT_type(*$C$DW$T$32)
    7589                      .dwattr $C$DW$775, DW_AT_name("spd_ref")
    7590                      .dwattr $C$DW$775, DW_AT_TI_symbol_name("_spd_ref")
    7591                      .dwattr $C$DW$775, DW_AT_data_member_location[DW_OP_plus_uconst 0xe8]
    7592                      .dwattr $C$DW$775, DW_AT_accessibility(DW_ACCESS_public)
    7593              $C$DW$776       .dwtag  DW_TAG_member
    7594                      .dwattr $C$DW$776, DW_AT_type(*$C$DW$T$32)
    7595                      .dwattr $C$DW$776, DW_AT_name("spd_max")
    7596                      .dwattr $C$DW$776, DW_AT_TI_symbol_name("_spd_max")
    7597                      .dwattr $C$DW$776, DW_AT_data_member_location[DW_OP_plus_uconst 0xea]
    7598                      .dwattr $C$DW$776, DW_AT_accessibility(DW_ACCESS_public)
    7599              $C$DW$777       .dwtag  DW_TAG_member
    7600                      .dwattr $C$DW$777, DW_AT_type(*$C$DW$T$70)
    7601                      .dwattr $C$DW$777, DW_AT_name("counter_current")
    7602                      .dwattr $C$DW$777, DW_AT_TI_symbol_name("_counter_current")
    7603                      .dwattr $C$DW$777, DW_AT_data_member_location[DW_OP_plus_uconst 0xec]
    7604                      .dwattr $C$DW$777, DW_AT_accessibility(DW_ACCESS_public)
    7605              $C$DW$778       .dwtag  DW_TAG_member
    7606                      .dwattr $C$DW$778, DW_AT_type(*$C$DW$T$70)
    7607                      .dwattr $C$DW$778, DW_AT_name("counter_isr")
    7608                      .dwattr $C$DW$778, DW_AT_TI_symbol_name("_counter_isr")
    7609                      .dwattr $C$DW$778, DW_AT_data_member_location[DW_OP_plus_uconst 0xed]
    7610                      .dwattr $C$DW$778, DW_AT_accessibility(DW_ACCESS_public)
    7611              $C$DW$779       .dwtag  DW_TAG_member
TMS320C2000 Assembler PC v6.2.5 Sun Oct 08 22:38:01 2017

Tools Copyright (c) 1996-2014 Texas Instruments Incorporated
C:\Users\wmj\AppData\Local\Temp\0385210                              PAGE  146

    7612                      .dwattr $C$DW$779, DW_AT_type(*$C$DW$T$70)
    7613                      .dwattr $C$DW$779, DW_AT_name("counter_speed")
    7614                      .dwattr $C$DW$779, DW_AT_TI_symbol_name("_counter_speed")
    7615                      .dwattr $C$DW$779, DW_AT_data_member_location[DW_OP_plus_uconst 0xee]
    7616                      .dwattr $C$DW$779, DW_AT_accessibility(DW_ACCESS_public)
    7617              $C$DW$780       .dwtag  DW_TAG_member
    7618                      .dwattr $C$DW$780, DW_AT_type(*$C$DW$T$70)
    7619                      .dwattr $C$DW$780, DW_AT_name("counter_traj")
    7620                      .dwattr $C$DW$780, DW_AT_TI_symbol_name("_counter_traj")
    7621                      .dwattr $C$DW$780, DW_AT_data_member_location[DW_OP_plus_uconst 0xef]
    7622                      .dwattr $C$DW$780, DW_AT_accessibility(DW_ACCESS_public)
    7623              $C$DW$781       .dwtag  DW_TAG_member
    7624                      .dwattr $C$DW$781, DW_AT_type(*$C$DW$T$34)
    7625                      .dwattr $C$DW$781, DW_AT_name("flag_enableCtrl")
    7626                      .dwattr $C$DW$781, DW_AT_TI_symbol_name("_flag_enableCtrl")
    7627                      .dwattr $C$DW$781, DW_AT_data_member_location[DW_OP_plus_uconst 0xf0]
    7628                      .dwattr $C$DW$781, DW_AT_accessibility(DW_ACCESS_public)
    7629              $C$DW$782       .dwtag  DW_TAG_member
    7630                      .dwattr $C$DW$782, DW_AT_type(*$C$DW$T$34)
    7631                      .dwattr $C$DW$782, DW_AT_name("flag_enableDcBusComp")
    7632                      .dwattr $C$DW$782, DW_AT_TI_symbol_name("_flag_enableDcBusComp")
    7633                      .dwattr $C$DW$782, DW_AT_data_member_location[DW_OP_plus_uconst 0xf1]
    7634                      .dwattr $C$DW$782, DW_AT_accessibility(DW_ACCESS_public)
    7635              $C$DW$783       .dwtag  DW_TAG_member
    7636                      .dwattr $C$DW$783, DW_AT_type(*$C$DW$T$34)
    7637                      .dwattr $C$DW$783, DW_AT_name("flag_enablePowerWarp")
    7638                      .dwattr $C$DW$783, DW_AT_TI_symbol_name("_flag_enablePowerWarp")
    7639                      .dwattr $C$DW$783, DW_AT_data_member_location[DW_OP_plus_uconst 0xf2]
    7640                      .dwattr $C$DW$783, DW_AT_accessibility(DW_ACCESS_public)
    7641              $C$DW$784       .dwtag  DW_TAG_member
    7642                      .dwattr $C$DW$784, DW_AT_type(*$C$DW$T$34)
    7643                      .dwattr $C$DW$784, DW_AT_name("flag_enableOffset")
    7644                      .dwattr $C$DW$784, DW_AT_TI_symbol_name("_flag_enableOffset")
    7645                      .dwattr $C$DW$784, DW_AT_data_member_location[DW_OP_plus_uconst 0xf3]
    7646                      .dwattr $C$DW$784, DW_AT_accessibility(DW_ACCESS_public)
    7647              $C$DW$785       .dwtag  DW_TAG_member
    7648                      .dwattr $C$DW$785, DW_AT_type(*$C$DW$T$34)
    7649                      .dwattr $C$DW$785, DW_AT_name("flag_enableSpeedCtrl")
    7650                      .dwattr $C$DW$785, DW_AT_TI_symbol_name("_flag_enableSpeedCtrl")
    7651                      .dwattr $C$DW$785, DW_AT_data_member_location[DW_OP_plus_uconst 0xf4]
    7652                      .dwattr $C$DW$785, DW_AT_accessibility(DW_ACCESS_public)
    7653              $C$DW$786       .dwtag  DW_TAG_member
    7654                      .dwattr $C$DW$786, DW_AT_type(*$C$DW$T$34)
    7655                      .dwattr $C$DW$786, DW_AT_name("flag_enableUserMotorParams")
    7656                      .dwattr $C$DW$786, DW_AT_TI_symbol_name("_flag_enableUserMotorParams")
    7657                      .dwattr $C$DW$786, DW_AT_data_member_location[DW_OP_plus_uconst 0xf5]
    7658                      .dwattr $C$DW$786, DW_AT_accessibility(DW_ACCESS_public)
    7659              $C$DW$787       .dwtag  DW_TAG_member
    7660                      .dwattr $C$DW$787, DW_AT_type(*$C$DW$T$33)
    7661                      .dwattr $C$DW$787, DW_AT_name("Idq_offset_pu")
    7662                      .dwattr $C$DW$787, DW_AT_TI_symbol_name("_Idq_offset_pu")
    7663                      .dwattr $C$DW$787, DW_AT_data_member_location[DW_OP_plus_uconst 0xf6]
    7664                      .dwattr $C$DW$787, DW_AT_accessibility(DW_ACCESS_public)
    7665              $C$DW$788       .dwtag  DW_TAG_member
    7666                      .dwattr $C$DW$788, DW_AT_type(*$C$DW$T$33)
TMS320C2000 Assembler PC v6.2.5 Sun Oct 08 22:38:01 2017

Tools Copyright (c) 1996-2014 Texas Instruments Incorporated
C:\Users\wmj\AppData\Local\Temp\0385210                              PAGE  147

    7667                      .dwattr $C$DW$788, DW_AT_name("Vdq_offset_pu")
    7668                      .dwattr $C$DW$788, DW_AT_TI_symbol_name("_Vdq_offset_pu")
    7669                      .dwattr $C$DW$788, DW_AT_data_member_location[DW_OP_plus_uconst 0xfa]
    7670                      .dwattr $C$DW$788, DW_AT_accessibility(DW_ACCESS_public)
    7671              $C$DW$789       .dwtag  DW_TAG_member
    7672                      .dwattr $C$DW$789, DW_AT_type(*$C$DW$T$32)
    7673                      .dwattr $C$DW$789, DW_AT_name("angle_pu")
    7674                      .dwattr $C$DW$789, DW_AT_TI_symbol_name("_angle_pu")
    7675                      .dwattr $C$DW$789, DW_AT_data_member_location[DW_OP_plus_uconst 0xfe]
    7676                      .dwattr $C$DW$789, DW_AT_accessibility(DW_ACCESS_public)
    7677              $C$DW$790       .dwtag  DW_TAG_member
    7678                      .dwattr $C$DW$790, DW_AT_type(*$C$DW$T$32)
    7679                      .dwattr $C$DW$790, DW_AT_name("speed_ref_pu")
    7680                      .dwattr $C$DW$790, DW_AT_TI_symbol_name("_speed_ref_pu")
    7681                      .dwattr $C$DW$790, DW_AT_data_member_location[DW_OP_plus_uconst 0x100]
    7682                      .dwattr $C$DW$790, DW_AT_accessibility(DW_ACCESS_public)
    7683              $C$DW$791       .dwtag  DW_TAG_member
    7684                      .dwattr $C$DW$791, DW_AT_type(*$C$DW$T$32)
    7685                      .dwattr $C$DW$791, DW_AT_name("speed_fb_pu")
    7686                      .dwattr $C$DW$791, DW_AT_TI_symbol_name("_speed_fb_pu")
    7687                      .dwattr $C$DW$791, DW_AT_data_member_location[DW_OP_plus_uconst 0x102]
    7688                      .dwattr $C$DW$791, DW_AT_accessibility(DW_ACCESS_public)
    7689              $C$DW$792       .dwtag  DW_TAG_member
    7690                      .dwattr $C$DW$792, DW_AT_type(*$C$DW$T$32)
    7691                      .dwattr $C$DW$792, DW_AT_name("speed_outMax_pu")
    7692                      .dwattr $C$DW$792, DW_AT_TI_symbol_name("_speed_outMax_pu")
    7693                      .dwattr $C$DW$792, DW_AT_data_member_location[DW_OP_plus_uconst 0x104]
    7694                      .dwattr $C$DW$792, DW_AT_accessibility(DW_ACCESS_public)
    7695              $C$DW$793       .dwtag  DW_TAG_member
    7696                      .dwattr $C$DW$793, DW_AT_type(*$C$DW$T$34)
    7697                      .dwattr $C$DW$793, DW_AT_name("flag_enableCurrentCtrl")
    7698                      .dwattr $C$DW$793, DW_AT_TI_symbol_name("_flag_enableCurrentCtrl")
    7699                      .dwattr $C$DW$793, DW_AT_data_member_location[DW_OP_plus_uconst 0x106]
    7700                      .dwattr $C$DW$793, DW_AT_accessibility(DW_ACCESS_public)
    7701              $C$DW$794       .dwtag  DW_TAG_member
    7702                      .dwattr $C$DW$794, DW_AT_type(*$C$DW$T$73)
    7703                      .dwattr $C$DW$794, DW_AT_name("brakeHandle")
    7704                      .dwattr $C$DW$794, DW_AT_TI_symbol_name("_brakeHandle")
    7705                      .dwattr $C$DW$794, DW_AT_data_member_location[DW_OP_plus_uconst 0x108]
    7706                      .dwattr $C$DW$794, DW_AT_accessibility(DW_ACCESS_public)
    7707              $C$DW$795       .dwtag  DW_TAG_member
    7708                      .dwattr $C$DW$795, DW_AT_type(*$C$DW$T$74)
    7709                      .dwattr $C$DW$795, DW_AT_name("brake")
    7710                      .dwattr $C$DW$795, DW_AT_TI_symbol_name("_brake")
    7711                      .dwattr $C$DW$795, DW_AT_data_member_location[DW_OP_plus_uconst 0x10a]
    7712                      .dwattr $C$DW$795, DW_AT_accessibility(DW_ACCESS_public)
    7713                      .dwendtag $C$DW$T$75
    7714              
    7715              $C$DW$T$191     .dwtag  DW_TAG_typedef, DW_AT_name("CTRL_Obj")
    7716                      .dwattr $C$DW$T$191, DW_AT_type(*$C$DW$T$75)
    7717                      .dwattr $C$DW$T$191, DW_AT_language(DW_LANG_C)
    7718              $C$DW$T$172     .dwtag  DW_TAG_pointer_type
    7719                      .dwattr $C$DW$T$172, DW_AT_type(*$C$DW$T$75)
    7720                      .dwattr $C$DW$T$172, DW_AT_address_class(0x16)
    7721              $C$DW$T$173     .dwtag  DW_TAG_typedef, DW_AT_name("CTRL_Handle")
TMS320C2000 Assembler PC v6.2.5 Sun Oct 08 22:38:01 2017

Tools Copyright (c) 1996-2014 Texas Instruments Incorporated
C:\Users\wmj\AppData\Local\Temp\0385210                              PAGE  148

    7722                      .dwattr $C$DW$T$173, DW_AT_type(*$C$DW$T$172)
    7723                      .dwattr $C$DW$T$173, DW_AT_language(DW_LANG_C)
    7724              $C$DW$796       .dwtag  DW_TAG_TI_far_type
    7725                      .dwattr $C$DW$796, DW_AT_type(*$C$DW$T$173)
    7726              $C$DW$T$192     .dwtag  DW_TAG_const_type
    7727                      .dwattr $C$DW$T$192, DW_AT_type(*$C$DW$796)
    7728              
    7729              $C$DW$T$78      .dwtag  DW_TAG_structure_type
    7730                      .dwattr $C$DW$T$78, DW_AT_name("_CTRL_Version_")
    7731                      .dwattr $C$DW$T$78, DW_AT_byte_size(0x04)
    7732              $C$DW$797       .dwtag  DW_TAG_member
    7733                      .dwattr $C$DW$797, DW_AT_type(*$C$DW$T$23)
    7734                      .dwattr $C$DW$797, DW_AT_name("rsvd")
    7735                      .dwattr $C$DW$797, DW_AT_TI_symbol_name("_rsvd")
    7736                      .dwattr $C$DW$797, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    7737                      .dwattr $C$DW$797, DW_AT_accessibility(DW_ACCESS_public)
    7738              $C$DW$798       .dwtag  DW_TAG_member
    7739                      .dwattr $C$DW$798, DW_AT_type(*$C$DW$T$77)
    7740                      .dwattr $C$DW$798, DW_AT_name("targetProc")
    7741                      .dwattr $C$DW$798, DW_AT_TI_symbol_name("_targetProc")
    7742                      .dwattr $C$DW$798, DW_AT_data_member_location[DW_OP_plus_uconst 0x1]
    7743                      .dwattr $C$DW$798, DW_AT_accessibility(DW_ACCESS_public)
    7744              $C$DW$799       .dwtag  DW_TAG_member
    7745                      .dwattr $C$DW$799, DW_AT_type(*$C$DW$T$23)
    7746                      .dwattr $C$DW$799, DW_AT_name("major")
    7747                      .dwattr $C$DW$799, DW_AT_TI_symbol_name("_major")
    7748                      .dwattr $C$DW$799, DW_AT_data_member_location[DW_OP_plus_uconst 0x2]
    7749                      .dwattr $C$DW$799, DW_AT_accessibility(DW_ACCESS_public)
    7750              $C$DW$800       .dwtag  DW_TAG_member
    7751                      .dwattr $C$DW$800, DW_AT_type(*$C$DW$T$23)
    7752                      .dwattr $C$DW$800, DW_AT_name("minor")
    7753                      .dwattr $C$DW$800, DW_AT_TI_symbol_name("_minor")
    7754                      .dwattr $C$DW$800, DW_AT_data_member_location[DW_OP_plus_uconst 0x3]
    7755                      .dwattr $C$DW$800, DW_AT_accessibility(DW_ACCESS_public)
    7756                      .dwendtag $C$DW$T$78
    7757              
    7758              $C$DW$T$41      .dwtag  DW_TAG_typedef, DW_AT_name("CTRL_Version")
    7759                      .dwattr $C$DW$T$41, DW_AT_type(*$C$DW$T$78)
    7760                      .dwattr $C$DW$T$41, DW_AT_language(DW_LANG_C)
    7761              
    7762              $C$DW$T$20      .dwtag  DW_TAG_structure_type
    7763                      .dwattr $C$DW$T$20, DW_AT_name("_EST_Obj_")
    7764                      .dwattr $C$DW$T$20, DW_AT_declaration
    7765                      .dwendtag $C$DW$T$20
    7766              
    7767              $C$DW$T$49      .dwtag  DW_TAG_pointer_type
    7768                      .dwattr $C$DW$T$49, DW_AT_type(*$C$DW$T$20)
    7769                      .dwattr $C$DW$T$49, DW_AT_address_class(0x16)
    7770              $C$DW$T$50      .dwtag  DW_TAG_typedef, DW_AT_name("EST_Handle")
    7771                      .dwattr $C$DW$T$50, DW_AT_type(*$C$DW$T$49)
    7772                      .dwattr $C$DW$T$50, DW_AT_language(DW_LANG_C)
    7773              
    7774              $C$DW$T$79      .dwtag  DW_TAG_structure_type
    7775                      .dwattr $C$DW$T$79, DW_AT_name("_FILTER_FO_")
    7776                      .dwattr $C$DW$T$79, DW_AT_byte_size(0x0a)
TMS320C2000 Assembler PC v6.2.5 Sun Oct 08 22:38:01 2017

Tools Copyright (c) 1996-2014 Texas Instruments Incorporated
C:\Users\wmj\AppData\Local\Temp\0385210                              PAGE  149

    7777              $C$DW$801       .dwtag  DW_TAG_member
    7778                      .dwattr $C$DW$801, DW_AT_type(*$C$DW$T$32)
    7779                      .dwattr $C$DW$801, DW_AT_name("a1")
    7780                      .dwattr $C$DW$801, DW_AT_TI_symbol_name("_a1")
    7781                      .dwattr $C$DW$801, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    7782                      .dwattr $C$DW$801, DW_AT_accessibility(DW_ACCESS_public)
    7783              $C$DW$802       .dwtag  DW_TAG_member
    7784                      .dwattr $C$DW$802, DW_AT_type(*$C$DW$T$32)
    7785                      .dwattr $C$DW$802, DW_AT_name("b0")
    7786                      .dwattr $C$DW$802, DW_AT_TI_symbol_name("_b0")
    7787                      .dwattr $C$DW$802, DW_AT_data_member_location[DW_OP_plus_uconst 0x2]
    7788                      .dwattr $C$DW$802, DW_AT_accessibility(DW_ACCESS_public)
    7789              $C$DW$803       .dwtag  DW_TAG_member
    7790                      .dwattr $C$DW$803, DW_AT_type(*$C$DW$T$32)
    7791                      .dwattr $C$DW$803, DW_AT_name("b1")
    7792                      .dwattr $C$DW$803, DW_AT_TI_symbol_name("_b1")
    7793                      .dwattr $C$DW$803, DW_AT_data_member_location[DW_OP_plus_uconst 0x4]
    7794                      .dwattr $C$DW$803, DW_AT_accessibility(DW_ACCESS_public)
    7795              $C$DW$804       .dwtag  DW_TAG_member
    7796                      .dwattr $C$DW$804, DW_AT_type(*$C$DW$T$32)
    7797                      .dwattr $C$DW$804, DW_AT_name("x1")
    7798                      .dwattr $C$DW$804, DW_AT_TI_symbol_name("_x1")
    7799                      .dwattr $C$DW$804, DW_AT_data_member_location[DW_OP_plus_uconst 0x6]
    7800                      .dwattr $C$DW$804, DW_AT_accessibility(DW_ACCESS_public)
    7801              $C$DW$805       .dwtag  DW_TAG_member
    7802                      .dwattr $C$DW$805, DW_AT_type(*$C$DW$T$32)
    7803                      .dwattr $C$DW$805, DW_AT_name("y1")
    7804                      .dwattr $C$DW$805, DW_AT_TI_symbol_name("_y1")
    7805                      .dwattr $C$DW$805, DW_AT_data_member_location[DW_OP_plus_uconst 0x8]
    7806                      .dwattr $C$DW$805, DW_AT_accessibility(DW_ACCESS_public)
    7807                      .dwendtag $C$DW$T$79
    7808              
    7809              $C$DW$T$137     .dwtag  DW_TAG_typedef, DW_AT_name("FILTER_FO_Obj")
    7810                      .dwattr $C$DW$T$137, DW_AT_type(*$C$DW$T$79)
    7811                      .dwattr $C$DW$T$137, DW_AT_language(DW_LANG_C)
    7812              $C$DW$T$194     .dwtag  DW_TAG_pointer_type
    7813                      .dwattr $C$DW$T$194, DW_AT_type(*$C$DW$T$137)
    7814                      .dwattr $C$DW$T$194, DW_AT_address_class(0x16)
    7815              
    7816              $C$DW$T$21      .dwtag  DW_TAG_structure_type
    7817                      .dwattr $C$DW$T$21, DW_AT_name("_FILTER_FO_Obj_")
    7818                      .dwattr $C$DW$T$21, DW_AT_declaration
    7819                      .dwendtag $C$DW$T$21
    7820              
    7821              $C$DW$T$138     .dwtag  DW_TAG_pointer_type
    7822                      .dwattr $C$DW$T$138, DW_AT_type(*$C$DW$T$21)
    7823                      .dwattr $C$DW$T$138, DW_AT_address_class(0x16)
    7824              $C$DW$T$139     .dwtag  DW_TAG_typedef, DW_AT_name("FILTER_FO_Handle")
    7825                      .dwattr $C$DW$T$139, DW_AT_type(*$C$DW$T$138)
    7826                      .dwattr $C$DW$T$139, DW_AT_language(DW_LANG_C)
    7827              
    7828              $C$DW$T$80      .dwtag  DW_TAG_structure_type
    7829                      .dwattr $C$DW$T$80, DW_AT_name("_FLASH_Obj_")
    7830                      .dwattr $C$DW$T$80, DW_AT_byte_size(0x08)
    7831              $C$DW$806       .dwtag  DW_TAG_member
TMS320C2000 Assembler PC v6.2.5 Sun Oct 08 22:38:01 2017

Tools Copyright (c) 1996-2014 Texas Instruments Incorporated
C:\Users\wmj\AppData\Local\Temp\0385210                              PAGE  150

    7832                      .dwattr $C$DW$806, DW_AT_type(*$C$DW$T$24)
    7833                      .dwattr $C$DW$806, DW_AT_name("FOPT")
    7834                      .dwattr $C$DW$806, DW_AT_TI_symbol_name("_FOPT")
    7835                      .dwattr $C$DW$806, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    7836                      .dwattr $C$DW$806, DW_AT_accessibility(DW_ACCESS_public)
    7837              $C$DW$807       .dwtag  DW_TAG_member
    7838                      .dwattr $C$DW$807, DW_AT_type(*$C$DW$T$24)
    7839                      .dwattr $C$DW$807, DW_AT_name("rsvd_1")
    7840                      .dwattr $C$DW$807, DW_AT_TI_symbol_name("_rsvd_1")
    7841                      .dwattr $C$DW$807, DW_AT_data_member_location[DW_OP_plus_uconst 0x1]
    7842                      .dwattr $C$DW$807, DW_AT_accessibility(DW_ACCESS_public)
    7843              $C$DW$808       .dwtag  DW_TAG_member
    7844                      .dwattr $C$DW$808, DW_AT_type(*$C$DW$T$24)
    7845                      .dwattr $C$DW$808, DW_AT_name("FPWR")
    7846                      .dwattr $C$DW$808, DW_AT_TI_symbol_name("_FPWR")
    7847                      .dwattr $C$DW$808, DW_AT_data_member_location[DW_OP_plus_uconst 0x2]
    7848                      .dwattr $C$DW$808, DW_AT_accessibility(DW_ACCESS_public)
    7849              $C$DW$809       .dwtag  DW_TAG_member
    7850                      .dwattr $C$DW$809, DW_AT_type(*$C$DW$T$24)
    7851                      .dwattr $C$DW$809, DW_AT_name("FSTATUS")
    7852                      .dwattr $C$DW$809, DW_AT_TI_symbol_name("_FSTATUS")
    7853                      .dwattr $C$DW$809, DW_AT_data_member_location[DW_OP_plus_uconst 0x3]
    7854                      .dwattr $C$DW$809, DW_AT_accessibility(DW_ACCESS_public)
    7855              $C$DW$810       .dwtag  DW_TAG_member
    7856                      .dwattr $C$DW$810, DW_AT_type(*$C$DW$T$24)
    7857                      .dwattr $C$DW$810, DW_AT_name("FSTDBYWAIT")
    7858                      .dwattr $C$DW$810, DW_AT_TI_symbol_name("_FSTDBYWAIT")
    7859                      .dwattr $C$DW$810, DW_AT_data_member_location[DW_OP_plus_uconst 0x4]
    7860                      .dwattr $C$DW$810, DW_AT_accessibility(DW_ACCESS_public)
    7861              $C$DW$811       .dwtag  DW_TAG_member
    7862                      .dwattr $C$DW$811, DW_AT_type(*$C$DW$T$24)
    7863                      .dwattr $C$DW$811, DW_AT_name("FACTIVEWAIT")
    7864                      .dwattr $C$DW$811, DW_AT_TI_symbol_name("_FACTIVEWAIT")
    7865                      .dwattr $C$DW$811, DW_AT_data_member_location[DW_OP_plus_uconst 0x5]
    7866                      .dwattr $C$DW$811, DW_AT_accessibility(DW_ACCESS_public)
    7867              $C$DW$812       .dwtag  DW_TAG_member
    7868                      .dwattr $C$DW$812, DW_AT_type(*$C$DW$T$24)
    7869                      .dwattr $C$DW$812, DW_AT_name("FBANKWAIT")
    7870                      .dwattr $C$DW$812, DW_AT_TI_symbol_name("_FBANKWAIT")
    7871                      .dwattr $C$DW$812, DW_AT_data_member_location[DW_OP_plus_uconst 0x6]
    7872                      .dwattr $C$DW$812, DW_AT_accessibility(DW_ACCESS_public)
    7873              $C$DW$813       .dwtag  DW_TAG_member
    7874                      .dwattr $C$DW$813, DW_AT_type(*$C$DW$T$24)
    7875                      .dwattr $C$DW$813, DW_AT_name("FOTPWAIT")
    7876                      .dwattr $C$DW$813, DW_AT_TI_symbol_name("_FOTPWAIT")
    7877                      .dwattr $C$DW$813, DW_AT_data_member_location[DW_OP_plus_uconst 0x7]
    7878                      .dwattr $C$DW$813, DW_AT_accessibility(DW_ACCESS_public)
    7879                      .dwendtag $C$DW$T$80
    7880              
    7881              $C$DW$T$93      .dwtag  DW_TAG_pointer_type
    7882                      .dwattr $C$DW$T$93, DW_AT_type(*$C$DW$T$80)
    7883                      .dwattr $C$DW$T$93, DW_AT_address_class(0x16)
    7884              $C$DW$T$94      .dwtag  DW_TAG_typedef, DW_AT_name("FLASH_Handle")
    7885                      .dwattr $C$DW$T$94, DW_AT_type(*$C$DW$T$93)
    7886                      .dwattr $C$DW$T$94, DW_AT_language(DW_LANG_C)
TMS320C2000 Assembler PC v6.2.5 Sun Oct 08 22:38:01 2017

Tools Copyright (c) 1996-2014 Texas Instruments Incorporated
C:\Users\wmj\AppData\Local\Temp\0385210                              PAGE  151

    7887              
    7888              $C$DW$T$84      .dwtag  DW_TAG_structure_type
    7889                      .dwattr $C$DW$T$84, DW_AT_name("_GPIO_Obj_")
    7890                      .dwattr $C$DW$T$84, DW_AT_byte_size(0x6a)
    7891              $C$DW$814       .dwtag  DW_TAG_member
    7892                      .dwattr $C$DW$814, DW_AT_type(*$C$DW$T$81)
    7893                      .dwattr $C$DW$814, DW_AT_name("GPACTRL")
    7894                      .dwattr $C$DW$814, DW_AT_TI_symbol_name("_GPACTRL")
    7895                      .dwattr $C$DW$814, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    7896                      .dwattr $C$DW$814, DW_AT_accessibility(DW_ACCESS_public)
    7897              $C$DW$815       .dwtag  DW_TAG_member
    7898                      .dwattr $C$DW$815, DW_AT_type(*$C$DW$T$81)
    7899                      .dwattr $C$DW$815, DW_AT_name("GPAQSEL1")
    7900                      .dwattr $C$DW$815, DW_AT_TI_symbol_name("_GPAQSEL1")
    7901                      .dwattr $C$DW$815, DW_AT_data_member_location[DW_OP_plus_uconst 0x2]
    7902                      .dwattr $C$DW$815, DW_AT_accessibility(DW_ACCESS_public)
    7903              $C$DW$816       .dwtag  DW_TAG_member
    7904                      .dwattr $C$DW$816, DW_AT_type(*$C$DW$T$81)
    7905                      .dwattr $C$DW$816, DW_AT_name("GPAQSEL2")
    7906                      .dwattr $C$DW$816, DW_AT_TI_symbol_name("_GPAQSEL2")
    7907                      .dwattr $C$DW$816, DW_AT_data_member_location[DW_OP_plus_uconst 0x4]
    7908                      .dwattr $C$DW$816, DW_AT_accessibility(DW_ACCESS_public)
    7909              $C$DW$817       .dwtag  DW_TAG_member
    7910                      .dwattr $C$DW$817, DW_AT_type(*$C$DW$T$81)
    7911                      .dwattr $C$DW$817, DW_AT_name("GPAMUX1")
    7912                      .dwattr $C$DW$817, DW_AT_TI_symbol_name("_GPAMUX1")
    7913                      .dwattr $C$DW$817, DW_AT_data_member_location[DW_OP_plus_uconst 0x6]
    7914                      .dwattr $C$DW$817, DW_AT_accessibility(DW_ACCESS_public)
    7915              $C$DW$818       .dwtag  DW_TAG_member
    7916                      .dwattr $C$DW$818, DW_AT_type(*$C$DW$T$81)
    7917                      .dwattr $C$DW$818, DW_AT_name("GPAMUX2")
    7918                      .dwattr $C$DW$818, DW_AT_TI_symbol_name("_GPAMUX2")
    7919                      .dwattr $C$DW$818, DW_AT_data_member_location[DW_OP_plus_uconst 0x8]
    7920                      .dwattr $C$DW$818, DW_AT_accessibility(DW_ACCESS_public)
    7921              $C$DW$819       .dwtag  DW_TAG_member
    7922                      .dwattr $C$DW$819, DW_AT_type(*$C$DW$T$81)
    7923                      .dwattr $C$DW$819, DW_AT_name("GPADIR")
    7924                      .dwattr $C$DW$819, DW_AT_TI_symbol_name("_GPADIR")
    7925                      .dwattr $C$DW$819, DW_AT_data_member_location[DW_OP_plus_uconst 0xa]
    7926                      .dwattr $C$DW$819, DW_AT_accessibility(DW_ACCESS_public)
    7927              $C$DW$820       .dwtag  DW_TAG_member
    7928                      .dwattr $C$DW$820, DW_AT_type(*$C$DW$T$81)
    7929                      .dwattr $C$DW$820, DW_AT_name("GPAPUD")
    7930                      .dwattr $C$DW$820, DW_AT_TI_symbol_name("_GPAPUD")
    7931                      .dwattr $C$DW$820, DW_AT_data_member_location[DW_OP_plus_uconst 0xc]
    7932                      .dwattr $C$DW$820, DW_AT_accessibility(DW_ACCESS_public)
    7933              $C$DW$821       .dwtag  DW_TAG_member
    7934                      .dwattr $C$DW$821, DW_AT_type(*$C$DW$T$27)
    7935                      .dwattr $C$DW$821, DW_AT_name("rsvd_1")
    7936                      .dwattr $C$DW$821, DW_AT_TI_symbol_name("_rsvd_1")
    7937                      .dwattr $C$DW$821, DW_AT_data_member_location[DW_OP_plus_uconst 0xe]
    7938                      .dwattr $C$DW$821, DW_AT_accessibility(DW_ACCESS_public)
    7939              $C$DW$822       .dwtag  DW_TAG_member
    7940                      .dwattr $C$DW$822, DW_AT_type(*$C$DW$T$81)
    7941                      .dwattr $C$DW$822, DW_AT_name("GPBCTRL")
TMS320C2000 Assembler PC v6.2.5 Sun Oct 08 22:38:01 2017

Tools Copyright (c) 1996-2014 Texas Instruments Incorporated
C:\Users\wmj\AppData\Local\Temp\0385210                              PAGE  152

    7942                      .dwattr $C$DW$822, DW_AT_TI_symbol_name("_GPBCTRL")
    7943                      .dwattr $C$DW$822, DW_AT_data_member_location[DW_OP_plus_uconst 0x10]
    7944                      .dwattr $C$DW$822, DW_AT_accessibility(DW_ACCESS_public)
    7945              $C$DW$823       .dwtag  DW_TAG_member
    7946                      .dwattr $C$DW$823, DW_AT_type(*$C$DW$T$81)
    7947                      .dwattr $C$DW$823, DW_AT_name("GPBQSEL1")
    7948                      .dwattr $C$DW$823, DW_AT_TI_symbol_name("_GPBQSEL1")
    7949                      .dwattr $C$DW$823, DW_AT_data_member_location[DW_OP_plus_uconst 0x12]
    7950                      .dwattr $C$DW$823, DW_AT_accessibility(DW_ACCESS_public)
    7951              $C$DW$824       .dwtag  DW_TAG_member
    7952                      .dwattr $C$DW$824, DW_AT_type(*$C$DW$T$27)
    7953                      .dwattr $C$DW$824, DW_AT_name("rsvd_2")
    7954                      .dwattr $C$DW$824, DW_AT_TI_symbol_name("_rsvd_2")
    7955                      .dwattr $C$DW$824, DW_AT_data_member_location[DW_OP_plus_uconst 0x14]
    7956                      .dwattr $C$DW$824, DW_AT_accessibility(DW_ACCESS_public)
    7957              $C$DW$825       .dwtag  DW_TAG_member
    7958                      .dwattr $C$DW$825, DW_AT_type(*$C$DW$T$81)
    7959                      .dwattr $C$DW$825, DW_AT_name("GPBMUX1")
    7960                      .dwattr $C$DW$825, DW_AT_TI_symbol_name("_GPBMUX1")
    7961                      .dwattr $C$DW$825, DW_AT_data_member_location[DW_OP_plus_uconst 0x16]
    7962                      .dwattr $C$DW$825, DW_AT_accessibility(DW_ACCESS_public)
    7963              $C$DW$826       .dwtag  DW_TAG_member
    7964                      .dwattr $C$DW$826, DW_AT_type(*$C$DW$T$27)
    7965                      .dwattr $C$DW$826, DW_AT_name("rsvd_3")
    7966                      .dwattr $C$DW$826, DW_AT_TI_symbol_name("_rsvd_3")
    7967                      .dwattr $C$DW$826, DW_AT_data_member_location[DW_OP_plus_uconst 0x18]
    7968                      .dwattr $C$DW$826, DW_AT_accessibility(DW_ACCESS_public)
    7969              $C$DW$827       .dwtag  DW_TAG_member
    7970                      .dwattr $C$DW$827, DW_AT_type(*$C$DW$T$81)
    7971                      .dwattr $C$DW$827, DW_AT_name("GPBDIR")
    7972                      .dwattr $C$DW$827, DW_AT_TI_symbol_name("_GPBDIR")
    7973                      .dwattr $C$DW$827, DW_AT_data_member_location[DW_OP_plus_uconst 0x1a]
    7974                      .dwattr $C$DW$827, DW_AT_accessibility(DW_ACCESS_public)
    7975              $C$DW$828       .dwtag  DW_TAG_member
    7976                      .dwattr $C$DW$828, DW_AT_type(*$C$DW$T$81)
    7977                      .dwattr $C$DW$828, DW_AT_name("GPBPUD")
    7978                      .dwattr $C$DW$828, DW_AT_TI_symbol_name("_GPBPUD")
    7979                      .dwattr $C$DW$828, DW_AT_data_member_location[DW_OP_plus_uconst 0x1c]
    7980                      .dwattr $C$DW$828, DW_AT_accessibility(DW_ACCESS_public)
    7981              $C$DW$829       .dwtag  DW_TAG_member
    7982                      .dwattr $C$DW$829, DW_AT_type(*$C$DW$T$82)
    7983                      .dwattr $C$DW$829, DW_AT_name("rsvd_4")
    7984                      .dwattr $C$DW$829, DW_AT_TI_symbol_name("_rsvd_4")
    7985                      .dwattr $C$DW$829, DW_AT_data_member_location[DW_OP_plus_uconst 0x1e]
    7986                      .dwattr $C$DW$829, DW_AT_accessibility(DW_ACCESS_public)
    7987              $C$DW$830       .dwtag  DW_TAG_member
    7988                      .dwattr $C$DW$830, DW_AT_type(*$C$DW$T$81)
    7989                      .dwattr $C$DW$830, DW_AT_name("AIOMUX1")
    7990                      .dwattr $C$DW$830, DW_AT_TI_symbol_name("_AIOMUX1")
    7991                      .dwattr $C$DW$830, DW_AT_data_member_location[DW_OP_plus_uconst 0x36]
    7992                      .dwattr $C$DW$830, DW_AT_accessibility(DW_ACCESS_public)
    7993              $C$DW$831       .dwtag  DW_TAG_member
    7994                      .dwattr $C$DW$831, DW_AT_type(*$C$DW$T$27)
    7995                      .dwattr $C$DW$831, DW_AT_name("rsvd_5")
