TMS320C2000 Assembler PC v6.2.5 Sun Oct 08 22:38:44 2017

Tools Copyright (c) 1996-2014 Texas Instruments Incorporated
C:\Users\wmj\AppData\Local\Temp\0622810                              PAGE    1

       1              ;***************************************************************
       2              ;* TMS320C2000 C/C++ Codegen                         PC v6.2.5 *
       3              ;* Date/Time created: Sun Oct 08 22:38:44 2017                 *
       4              ;***************************************************************
       5                      .compiler_opts --float_support=softlib --hll_source=on --mem_model:code=flat --mem_model:data=large -
       6        0002  FP      .set    XAR2
       7              
       8              $C$DW$CU        .dwtag  DW_TAG_compile_unit
       9                      .dwattr $C$DW$CU, DW_AT_name("D:/BM1000/sw/modules/user/src/32b/user.c")
      10                      .dwattr $C$DW$CU, DW_AT_producer("TMS320C2000 C/C++ Codegen PC v6.2.5 Copyright (c) 1996-2014 Texas I
      11                      .dwattr $C$DW$CU, DW_AT_TI_version(0x01)
      12                      .dwattr $C$DW$CU, DW_AT_comp_dir("D:\BM1000\sw\solutions\instaspin_foc\boards\hvkit_rev1p1\f28x\f2802
      13              
      14              $C$DW$1 .dwtag  DW_TAG_subprogram, DW_AT_name("EST_setLs_qFmt")
      15                      .dwattr $C$DW$1, DW_AT_TI_symbol_name("_EST_setLs_qFmt")

    5936              $C$DW$547       .dwtag  DW_TAG_enumerator, DW_AT_name("USER_ErrorCode_motor_Ls_d_Low"), DW_AT_const_value(0x4
    5937              $C$DW$548       .dwtag  DW_TAG_enumerator, DW_AT_name("USER_ErrorCode_motor_Ls_q_High"), DW_AT_const_value(0x
    5938              $C$DW$549       .dwtag  DW_TAG_enumerator, DW_AT_name("USER_ErrorCode_motor_Ls_q_Low"), DW_AT_const_value(0x4
    5939              $C$DW$550       .dwtag  DW_TAG_enumerator, DW_AT_name("USER_ErrorCode_maxCurrent_High"), DW_AT_const_value(0x
    5940              $C$DW$551       .dwtag  DW_TAG_enumerator, DW_AT_name("USER_ErrorCode_maxCurrent_Low"), DW_AT_const_value(0x4
    5941              $C$DW$552       .dwtag  DW_TAG_enumerator, DW_AT_name("USER_ErrorCode_maxCurrent_resEst_High"), DW_AT_const_v
    5942              $C$DW$553       .dwtag  DW_TAG_enumerator, DW_AT_name("USER_ErrorCode_maxCurrent_resEst_Low"), DW_AT_const_va
    5943              $C$DW$554       .dwtag  DW_TAG_enumerator, DW_AT_name("USER_ErrorCode_maxCurrent_indEst_High"), DW_AT_const_v
    5944              $C$DW$555       .dwtag  DW_TAG_enumerator, DW_AT_name("USER_ErrorCode_maxCurrent_indEst_Low"), DW_AT_const_va
    5945              $C$DW$556       .dwtag  DW_TAG_enumerator, DW_AT_name("USER_ErrorCode_maxCurrentSlope_High"), DW_AT_const_val
    5946              $C$DW$557       .dwtag  DW_TAG_enumerator, DW_AT_name("USER_ErrorCode_maxCurrentSlope_Low"), DW_AT_const_valu
    5947              $C$DW$558       .dwtag  DW_TAG_enumerator, DW_AT_name("USER_ErrorCode_maxCurrentSlope_powerWarp_High"), DW_AT
    5948              $C$DW$559       .dwtag  DW_TAG_enumerator, DW_AT_name("USER_ErrorCode_maxCurrentSlope_powerWarp_Low"), DW_AT_
    5949              $C$DW$560       .dwtag  DW_TAG_enumerator, DW_AT_name("USER_ErrorCode_IdRated_High"), DW_AT_const_value(0x54)
    5950              $C$DW$561       .dwtag  DW_TAG_enumerator, DW_AT_name("USER_ErrorCode_IdRated_Low"), DW_AT_const_value(0x55)
    5951              $C$DW$562       .dwtag  DW_TAG_enumerator, DW_AT_name("USER_ErrorCode_IdRatedFraction_indEst_High"), DW_AT_co
    5952              $C$DW$563       .dwtag  DW_TAG_enumerator, DW_AT_name("USER_ErrorCode_IdRatedFraction_indEst_Low"), DW_AT_con
    5953              $C$DW$564       .dwtag  DW_TAG_enumerator, DW_AT_name("USER_ErrorCode_IdRatedFraction_ratedFlux_High"), DW_AT
    5954              $C$DW$565       .dwtag  DW_TAG_enumerator, DW_AT_name("USER_ErrorCode_IdRatedFraction_ratedFlux_Low"), DW_AT_
    5955              $C$DW$566       .dwtag  DW_TAG_enumerator, DW_AT_name("USER_ErrorCode_IdRated_delta_High"), DW_AT_const_value
    5956              $C$DW$567       .dwtag  DW_TAG_enumerator, DW_AT_name("USER_ErrorCode_IdRated_delta_Low"), DW_AT_const_value(
    5957              $C$DW$568       .dwtag  DW_TAG_enumerator, DW_AT_name("USER_ErrorCode_fluxEstFreq_Hz_High"), DW_AT_const_valu
    5958              $C$DW$569       .dwtag  DW_TAG_enumerator, DW_AT_name("USER_ErrorCode_fluxEstFreq_Hz_Low"), DW_AT_const_value
TMS320C2000 Assembler PC v6.2.5 Sun Oct 08 22:38:44 2017

Tools Copyright (c) 1996-2014 Texas Instruments Incorporated
C:\Users\wmj\AppData\Local\Temp\0622810                              PAGE  122

    5959              $C$DW$570       .dwtag  DW_TAG_enumerator, DW_AT_name("USER_ErrorCode_ctrlFreq_Hz_High"), DW_AT_const_value(0
    5960              $C$DW$571       .dwtag  DW_TAG_enumerator, DW_AT_name("USER_ErrorCode_ctrlFreq_Hz_Low"), DW_AT_const_value(0x
    5961              $C$DW$572       .dwtag  DW_TAG_enumerator, DW_AT_name("USER_ErrorCode_estFreq_Hz_High"), DW_AT_const_value(0x
    5962              $C$DW$573       .dwtag  DW_TAG_enumerator, DW_AT_name("USER_ErrorCode_estFreq_Hz_Low"), DW_AT_const_value(0x6
    5963              $C$DW$574       .dwtag  DW_TAG_enumerator, DW_AT_name("USER_ErrorCode_RoverL_estFreq_Hz_High"), DW_AT_const_v
    5964              $C$DW$575       .dwtag  DW_TAG_enumerator, DW_AT_name("USER_ErrorCode_RoverL_estFreq_Hz_Low"), DW_AT_const_va
    5965              $C$DW$576       .dwtag  DW_TAG_enumerator, DW_AT_name("USER_ErrorCode_trajFreq_Hz_High"), DW_AT_const_value(0
    5966              $C$DW$577       .dwtag  DW_TAG_enumerator, DW_AT_name("USER_ErrorCode_trajFreq_Hz_Low"), DW_AT_const_value(0x
    5967              $C$DW$578       .dwtag  DW_TAG_enumerator, DW_AT_name("USER_ErrorCode_ctrlPeriod_sec_High"), DW_AT_const_valu
    5968              $C$DW$579       .dwtag  DW_TAG_enumerator, DW_AT_name("USER_ErrorCode_ctrlPeriod_sec_Low"), DW_AT_const_value
    5969              $C$DW$580       .dwtag  DW_TAG_enumerator, DW_AT_name("USER_ErrorCode_maxNegativeIdCurrent_a_High"), DW_AT_co
    5970              $C$DW$581       .dwtag  DW_TAG_enumerator, DW_AT_name("USER_ErrorCode_maxNegativeIdCurrent_a_Low"), DW_AT_con
    5971              $C$DW$582       .dwtag  DW_TAG_enumerator, DW_AT_name("USER_numErrorCodes"), DW_AT_const_value(0x6a)
    5972                      .dwendtag $C$DW$T$78
    5973              
    5974              $C$DW$T$79      .dwtag  DW_TAG_typedef, DW_AT_name("USER_ErrorCode_e")
    5975                      .dwattr $C$DW$T$79, DW_AT_type(*$C$DW$T$78)
    5976                      .dwattr $C$DW$T$79, DW_AT_language(DW_LANG_C)
    5977              $C$DW$583       .dwtag  DW_TAG_TI_far_type
    5978                      .dwattr $C$DW$583, DW_AT_type(*$C$DW$T$79)
    5979              $C$DW$T$83      .dwtag  DW_TAG_const_type
    5980                      .dwattr $C$DW$T$83, DW_AT_type(*$C$DW$583)
    5981              
    5982              $C$DW$T$23      .dwtag  DW_TAG_structure_type
    5983                      .dwattr $C$DW$T$23, DW_AT_name("_BRAKE_Obj_")
    5984                      .dwattr $C$DW$T$23, DW_AT_byte_size(0x08)
    5985              $C$DW$584       .dwtag  DW_TAG_member
    5986                      .dwattr $C$DW$584, DW_AT_type(*$C$DW$T$20)
    5987                      .dwattr $C$DW$584, DW_AT_name("angle_pu")
    5988                      .dwattr $C$DW$584, DW_AT_TI_symbol_name("_angle_pu")
    5989                      .dwattr $C$DW$584, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    5990                      .dwattr $C$DW$584, DW_AT_accessibility(DW_ACCESS_public)
    5991              $C$DW$585       .dwtag  DW_TAG_member
    5992                      .dwattr $C$DW$585, DW_AT_type(*$C$DW$T$21)
    5993                      .dwattr $C$DW$585, DW_AT_name("Idq_brake")
    5994                      .dwattr $C$DW$585, DW_AT_TI_symbol_name("_Idq_brake")
    5995                      .dwattr $C$DW$585, DW_AT_data_member_location[DW_OP_plus_uconst 0x2]
    5996                      .dwattr $C$DW$585, DW_AT_accessibility(DW_ACCESS_public)
    5997              $C$DW$586       .dwtag  DW_TAG_member
    5998                      .dwattr $C$DW$586, DW_AT_type(*$C$DW$T$22)
    5999                      .dwattr $C$DW$586, DW_AT_name("brake_enable")
    6000                      .dwattr $C$DW$586, DW_AT_TI_symbol_name("_brake_enable")
    6001                      .dwattr $C$DW$586, DW_AT_data_member_location[DW_OP_plus_uconst 0x6]
    6002                      .dwattr $C$DW$586, DW_AT_accessibility(DW_ACCESS_public)
    6003                      .dwendtag $C$DW$T$23
    6004              
    6005              $C$DW$T$60      .dwtag  DW_TAG_typedef, DW_AT_name("BRAKE_Obj")
    6006                      .dwattr $C$DW$T$60, DW_AT_type(*$C$DW$T$23)
    6007                      .dwattr $C$DW$T$60, DW_AT_language(DW_LANG_C)
    6008              $C$DW$T$58      .dwtag  DW_TAG_pointer_type
    6009                      .dwattr $C$DW$T$58, DW_AT_type(*$C$DW$T$23)
    6010                      .dwattr $C$DW$T$58, DW_AT_address_class(0x16)
    6011              $C$DW$T$59      .dwtag  DW_TAG_typedef, DW_AT_name("BRAKE_Handle")
    6012                      .dwattr $C$DW$T$59, DW_AT_type(*$C$DW$T$58)
    6013                      .dwattr $C$DW$T$59, DW_AT_language(DW_LANG_C)
TMS320C2000 Assembler PC v6.2.5 Sun Oct 08 22:38:44 2017

Tools Copyright (c) 1996-2014 Texas Instruments Incorporated
C:\Users\wmj\AppData\Local\Temp\0622810                              PAGE  123

    6014              
    6015              $C$DW$T$26      .dwtag  DW_TAG_structure_type
    6016                      .dwattr $C$DW$T$26, DW_AT_name("_CLARKE_Obj_")
    6017                      .dwattr $C$DW$T$26, DW_AT_byte_size(0x06)
    6018              $C$DW$587       .dwtag  DW_TAG_member
    6019                      .dwattr $C$DW$587, DW_AT_type(*$C$DW$T$20)
    6020                      .dwattr $C$DW$587, DW_AT_name("alpha_sf")
    6021                      .dwattr $C$DW$587, DW_AT_TI_symbol_name("_alpha_sf")
    6022                      .dwattr $C$DW$587, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    6023                      .dwattr $C$DW$587, DW_AT_accessibility(DW_ACCESS_public)
    6024              $C$DW$588       .dwtag  DW_TAG_member
    6025                      .dwattr $C$DW$588, DW_AT_type(*$C$DW$T$20)
    6026                      .dwattr $C$DW$588, DW_AT_name("beta_sf")
    6027                      .dwattr $C$DW$588, DW_AT_TI_symbol_name("_beta_sf")
    6028                      .dwattr $C$DW$588, DW_AT_data_member_location[DW_OP_plus_uconst 0x2]
    6029                      .dwattr $C$DW$588, DW_AT_accessibility(DW_ACCESS_public)
    6030              $C$DW$589       .dwtag  DW_TAG_member
    6031                      .dwattr $C$DW$589, DW_AT_type(*$C$DW$T$25)
    6032                      .dwattr $C$DW$589, DW_AT_name("numSensors")
    6033                      .dwattr $C$DW$589, DW_AT_TI_symbol_name("_numSensors")
    6034                      .dwattr $C$DW$589, DW_AT_data_member_location[DW_OP_plus_uconst 0x4]
    6035                      .dwattr $C$DW$589, DW_AT_accessibility(DW_ACCESS_public)
    6036                      .dwendtag $C$DW$T$26
    6037              
    6038              $C$DW$T$34      .dwtag  DW_TAG_typedef, DW_AT_name("CLARKE_Obj")
    6039                      .dwattr $C$DW$T$34, DW_AT_type(*$C$DW$T$26)
    6040                      .dwattr $C$DW$T$34, DW_AT_language(DW_LANG_C)
    6041              $C$DW$T$32      .dwtag  DW_TAG_pointer_type
    6042                      .dwattr $C$DW$T$32, DW_AT_type(*$C$DW$T$26)
    6043                      .dwattr $C$DW$T$32, DW_AT_address_class(0x16)
    6044              $C$DW$T$33      .dwtag  DW_TAG_typedef, DW_AT_name("CLARKE_Handle")
    6045                      .dwattr $C$DW$T$33, DW_AT_type(*$C$DW$T$32)
    6046                      .dwattr $C$DW$T$33, DW_AT_language(DW_LANG_C)
    6047              
    6048              $C$DW$T$61      .dwtag  DW_TAG_structure_type
    6049                      .dwattr $C$DW$T$61, DW_AT_name("_CTRL_Obj_")
    6050                      .dwattr $C$DW$T$61, DW_AT_byte_size(0x112)
    6051              $C$DW$590       .dwtag  DW_TAG_member
    6052                      .dwattr $C$DW$590, DW_AT_type(*$C$DW$T$27)
    6053                      .dwattr $C$DW$590, DW_AT_name("version")
    6054                      .dwattr $C$DW$590, DW_AT_TI_symbol_name("_version")
    6055                      .dwattr $C$DW$590, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    6056                      .dwattr $C$DW$590, DW_AT_accessibility(DW_ACCESS_public)
    6057              $C$DW$591       .dwtag  DW_TAG_member
    6058                      .dwattr $C$DW$591, DW_AT_type(*$C$DW$T$29)
    6059                      .dwattr $C$DW$591, DW_AT_name("state")
    6060                      .dwattr $C$DW$591, DW_AT_TI_symbol_name("_state")
    6061                      .dwattr $C$DW$591, DW_AT_data_member_location[DW_OP_plus_uconst 0x4]
    6062                      .dwattr $C$DW$591, DW_AT_accessibility(DW_ACCESS_public)
    6063              $C$DW$592       .dwtag  DW_TAG_member
    6064                      .dwattr $C$DW$592, DW_AT_type(*$C$DW$T$29)
    6065                      .dwattr $C$DW$592, DW_AT_name("prevState")
    6066                      .dwattr $C$DW$592, DW_AT_TI_symbol_name("_prevState")
    6067                      .dwattr $C$DW$592, DW_AT_data_member_location[DW_OP_plus_uconst 0x5]
    6068                      .dwattr $C$DW$592, DW_AT_accessibility(DW_ACCESS_public)
TMS320C2000 Assembler PC v6.2.5 Sun Oct 08 22:38:44 2017

Tools Copyright (c) 1996-2014 Texas Instruments Incorporated
C:\Users\wmj\AppData\Local\Temp\0622810                              PAGE  124

    6069              $C$DW$593       .dwtag  DW_TAG_member
    6070                      .dwattr $C$DW$593, DW_AT_type(*$C$DW$T$31)
    6071                      .dwattr $C$DW$593, DW_AT_name("errorCode")
    6072                      .dwattr $C$DW$593, DW_AT_TI_symbol_name("_errorCode")
    6073                      .dwattr $C$DW$593, DW_AT_data_member_location[DW_OP_plus_uconst 0x6]
    6074                      .dwattr $C$DW$593, DW_AT_accessibility(DW_ACCESS_public)
    6075              $C$DW$594       .dwtag  DW_TAG_member
    6076                      .dwattr $C$DW$594, DW_AT_type(*$C$DW$T$33)
    6077                      .dwattr $C$DW$594, DW_AT_name("clarkeHandle_I")
    6078                      .dwattr $C$DW$594, DW_AT_TI_symbol_name("_clarkeHandle_I")
    6079                      .dwattr $C$DW$594, DW_AT_data_member_location[DW_OP_plus_uconst 0x8]
    6080                      .dwattr $C$DW$594, DW_AT_accessibility(DW_ACCESS_public)
    6081              $C$DW$595       .dwtag  DW_TAG_member
    6082                      .dwattr $C$DW$595, DW_AT_type(*$C$DW$T$34)
    6083                      .dwattr $C$DW$595, DW_AT_name("clarke_I")
    6084                      .dwattr $C$DW$595, DW_AT_TI_symbol_name("_clarke_I")
    6085                      .dwattr $C$DW$595, DW_AT_data_member_location[DW_OP_plus_uconst 0xa]
    6086                      .dwattr $C$DW$595, DW_AT_accessibility(DW_ACCESS_public)
    6087              $C$DW$596       .dwtag  DW_TAG_member
    6088                      .dwattr $C$DW$596, DW_AT_type(*$C$DW$T$33)
    6089                      .dwattr $C$DW$596, DW_AT_name("clarkeHandle_V")
    6090                      .dwattr $C$DW$596, DW_AT_TI_symbol_name("_clarkeHandle_V")
    6091                      .dwattr $C$DW$596, DW_AT_data_member_location[DW_OP_plus_uconst 0x10]
    6092                      .dwattr $C$DW$596, DW_AT_accessibility(DW_ACCESS_public)
    6093              $C$DW$597       .dwtag  DW_TAG_member
    6094                      .dwattr $C$DW$597, DW_AT_type(*$C$DW$T$34)
    6095                      .dwattr $C$DW$597, DW_AT_name("clarke_V")
    6096                      .dwattr $C$DW$597, DW_AT_TI_symbol_name("_clarke_V")
    6097                      .dwattr $C$DW$597, DW_AT_data_member_location[DW_OP_plus_uconst 0x12]
    6098                      .dwattr $C$DW$597, DW_AT_accessibility(DW_ACCESS_public)
    6099              $C$DW$598       .dwtag  DW_TAG_member
    6100                      .dwattr $C$DW$598, DW_AT_type(*$C$DW$T$36)
    6101                      .dwattr $C$DW$598, DW_AT_name("estHandle")
    6102                      .dwattr $C$DW$598, DW_AT_TI_symbol_name("_estHandle")
    6103                      .dwattr $C$DW$598, DW_AT_data_member_location[DW_OP_plus_uconst 0x18]
    6104                      .dwattr $C$DW$598, DW_AT_accessibility(DW_ACCESS_public)
    6105              $C$DW$599       .dwtag  DW_TAG_member
    6106                      .dwattr $C$DW$599, DW_AT_type(*$C$DW$T$38)
    6107                      .dwattr $C$DW$599, DW_AT_name("parkHandle")
    6108                      .dwattr $C$DW$599, DW_AT_TI_symbol_name("_parkHandle")
    6109                      .dwattr $C$DW$599, DW_AT_data_member_location[DW_OP_plus_uconst 0x1a]
    6110                      .dwattr $C$DW$599, DW_AT_accessibility(DW_ACCESS_public)
    6111              $C$DW$600       .dwtag  DW_TAG_member
    6112                      .dwattr $C$DW$600, DW_AT_type(*$C$DW$T$39)
    6113                      .dwattr $C$DW$600, DW_AT_name("park")
    6114                      .dwattr $C$DW$600, DW_AT_TI_symbol_name("_park")
    6115                      .dwattr $C$DW$600, DW_AT_data_member_location[DW_OP_plus_uconst 0x1c]
    6116                      .dwattr $C$DW$600, DW_AT_accessibility(DW_ACCESS_public)
    6117              $C$DW$601       .dwtag  DW_TAG_member
    6118                      .dwattr $C$DW$601, DW_AT_type(*$C$DW$T$41)
    6119                      .dwattr $C$DW$601, DW_AT_name("pidHandle_Id")
    6120                      .dwattr $C$DW$601, DW_AT_TI_symbol_name("_pidHandle_Id")
    6121                      .dwattr $C$DW$601, DW_AT_data_member_location[DW_OP_plus_uconst 0x20]
    6122                      .dwattr $C$DW$601, DW_AT_accessibility(DW_ACCESS_public)
    6123              $C$DW$602       .dwtag  DW_TAG_member
TMS320C2000 Assembler PC v6.2.5 Sun Oct 08 22:38:44 2017

Tools Copyright (c) 1996-2014 Texas Instruments Incorporated
C:\Users\wmj\AppData\Local\Temp\0622810                              PAGE  125

    6124                      .dwattr $C$DW$602, DW_AT_type(*$C$DW$T$42)
    6125                      .dwattr $C$DW$602, DW_AT_name("pid_Id")
    6126                      .dwattr $C$DW$602, DW_AT_TI_symbol_name("_pid_Id")
    6127                      .dwattr $C$DW$602, DW_AT_data_member_location[DW_OP_plus_uconst 0x22]
    6128                      .dwattr $C$DW$602, DW_AT_accessibility(DW_ACCESS_public)
    6129              $C$DW$603       .dwtag  DW_TAG_member
    6130                      .dwattr $C$DW$603, DW_AT_type(*$C$DW$T$41)
    6131                      .dwattr $C$DW$603, DW_AT_name("pidHandle_Iq")
    6132                      .dwattr $C$DW$603, DW_AT_TI_symbol_name("_pidHandle_Iq")
    6133                      .dwattr $C$DW$603, DW_AT_data_member_location[DW_OP_plus_uconst 0x32]
    6134                      .dwattr $C$DW$603, DW_AT_accessibility(DW_ACCESS_public)
    6135              $C$DW$604       .dwtag  DW_TAG_member
    6136                      .dwattr $C$DW$604, DW_AT_type(*$C$DW$T$42)
    6137                      .dwattr $C$DW$604, DW_AT_name("pid_Iq")
    6138                      .dwattr $C$DW$604, DW_AT_TI_symbol_name("_pid_Iq")
    6139                      .dwattr $C$DW$604, DW_AT_data_member_location[DW_OP_plus_uconst 0x34]
    6140                      .dwattr $C$DW$604, DW_AT_accessibility(DW_ACCESS_public)
    6141              $C$DW$605       .dwtag  DW_TAG_member
    6142                      .dwattr $C$DW$605, DW_AT_type(*$C$DW$T$41)
    6143                      .dwattr $C$DW$605, DW_AT_name("pidHandle_spd")
    6144                      .dwattr $C$DW$605, DW_AT_TI_symbol_name("_pidHandle_spd")
    6145                      .dwattr $C$DW$605, DW_AT_data_member_location[DW_OP_plus_uconst 0x44]
    6146                      .dwattr $C$DW$605, DW_AT_accessibility(DW_ACCESS_public)
    6147              $C$DW$606       .dwtag  DW_TAG_member
    6148                      .dwattr $C$DW$606, DW_AT_type(*$C$DW$T$42)
    6149                      .dwattr $C$DW$606, DW_AT_name("pid_spd")
    6150                      .dwattr $C$DW$606, DW_AT_TI_symbol_name("_pid_spd")
    6151                      .dwattr $C$DW$606, DW_AT_data_member_location[DW_OP_plus_uconst 0x46]
    6152                      .dwattr $C$DW$606, DW_AT_accessibility(DW_ACCESS_public)
    6153              $C$DW$607       .dwtag  DW_TAG_member
    6154                      .dwattr $C$DW$607, DW_AT_type(*$C$DW$T$44)
    6155                      .dwattr $C$DW$607, DW_AT_name("iparkHandle")
    6156                      .dwattr $C$DW$607, DW_AT_TI_symbol_name("_iparkHandle")
    6157                      .dwattr $C$DW$607, DW_AT_data_member_location[DW_OP_plus_uconst 0x56]
    6158                      .dwattr $C$DW$607, DW_AT_accessibility(DW_ACCESS_public)
    6159              $C$DW$608       .dwtag  DW_TAG_member
    6160                      .dwattr $C$DW$608, DW_AT_type(*$C$DW$T$45)
    6161                      .dwattr $C$DW$608, DW_AT_name("ipark")
    6162                      .dwattr $C$DW$608, DW_AT_TI_symbol_name("_ipark")
    6163                      .dwattr $C$DW$608, DW_AT_data_member_location[DW_OP_plus_uconst 0x58]
    6164                      .dwattr $C$DW$608, DW_AT_accessibility(DW_ACCESS_public)
    6165              $C$DW$609       .dwtag  DW_TAG_member
    6166                      .dwattr $C$DW$609, DW_AT_type(*$C$DW$T$47)
    6167                      .dwattr $C$DW$609, DW_AT_name("svgenHandle")
    6168                      .dwattr $C$DW$609, DW_AT_TI_symbol_name("_svgenHandle")
    6169                      .dwattr $C$DW$609, DW_AT_data_member_location[DW_OP_plus_uconst 0x5c]
    6170                      .dwattr $C$DW$609, DW_AT_accessibility(DW_ACCESS_public)
    6171              $C$DW$610       .dwtag  DW_TAG_member
    6172                      .dwattr $C$DW$610, DW_AT_type(*$C$DW$T$48)
    6173                      .dwattr $C$DW$610, DW_AT_name("svgen")
    6174                      .dwattr $C$DW$610, DW_AT_TI_symbol_name("_svgen")
    6175                      .dwattr $C$DW$610, DW_AT_data_member_location[DW_OP_plus_uconst 0x5e]
    6176                      .dwattr $C$DW$610, DW_AT_accessibility(DW_ACCESS_public)
    6177              $C$DW$611       .dwtag  DW_TAG_member
    6178                      .dwattr $C$DW$611, DW_AT_type(*$C$DW$T$50)
TMS320C2000 Assembler PC v6.2.5 Sun Oct 08 22:38:44 2017

Tools Copyright (c) 1996-2014 Texas Instruments Incorporated
C:\Users\wmj\AppData\Local\Temp\0622810                              PAGE  126

    6179                      .dwattr $C$DW$611, DW_AT_name("trajHandle_Id")
    6180                      .dwattr $C$DW$611, DW_AT_TI_symbol_name("_trajHandle_Id")
    6181                      .dwattr $C$DW$611, DW_AT_data_member_location[DW_OP_plus_uconst 0x60]
    6182                      .dwattr $C$DW$611, DW_AT_accessibility(DW_ACCESS_public)
    6183              $C$DW$612       .dwtag  DW_TAG_member
    6184                      .dwattr $C$DW$612, DW_AT_type(*$C$DW$T$51)
    6185                      .dwattr $C$DW$612, DW_AT_name("traj_Id")
    6186                      .dwattr $C$DW$612, DW_AT_TI_symbol_name("_traj_Id")
    6187                      .dwattr $C$DW$612, DW_AT_data_member_location[DW_OP_plus_uconst 0x62]
    6188                      .dwattr $C$DW$612, DW_AT_accessibility(DW_ACCESS_public)
    6189              $C$DW$613       .dwtag  DW_TAG_member
    6190                      .dwattr $C$DW$613, DW_AT_type(*$C$DW$T$50)
    6191                      .dwattr $C$DW$613, DW_AT_name("trajHandle_spd")
    6192                      .dwattr $C$DW$613, DW_AT_TI_symbol_name("_trajHandle_spd")
    6193                      .dwattr $C$DW$613, DW_AT_data_member_location[DW_OP_plus_uconst 0x6c]
    6194                      .dwattr $C$DW$613, DW_AT_accessibility(DW_ACCESS_public)
    6195              $C$DW$614       .dwtag  DW_TAG_member
    6196                      .dwattr $C$DW$614, DW_AT_type(*$C$DW$T$51)
    6197                      .dwattr $C$DW$614, DW_AT_name("traj_spd")
    6198                      .dwattr $C$DW$614, DW_AT_TI_symbol_name("_traj_spd")
    6199                      .dwattr $C$DW$614, DW_AT_data_member_location[DW_OP_plus_uconst 0x6e]
    6200                      .dwattr $C$DW$614, DW_AT_accessibility(DW_ACCESS_public)
    6201              $C$DW$615       .dwtag  DW_TAG_member
    6202                      .dwattr $C$DW$615, DW_AT_type(*$C$DW$T$50)
    6203                      .dwattr $C$DW$615, DW_AT_name("trajHandle_spdMax")
    6204                      .dwattr $C$DW$615, DW_AT_TI_symbol_name("_trajHandle_spdMax")
    6205                      .dwattr $C$DW$615, DW_AT_data_member_location[DW_OP_plus_uconst 0x78]
    6206                      .dwattr $C$DW$615, DW_AT_accessibility(DW_ACCESS_public)
    6207              $C$DW$616       .dwtag  DW_TAG_member
    6208                      .dwattr $C$DW$616, DW_AT_type(*$C$DW$T$51)
    6209                      .dwattr $C$DW$616, DW_AT_name("traj_spdMax")
    6210                      .dwattr $C$DW$616, DW_AT_TI_symbol_name("_traj_spdMax")
    6211                      .dwattr $C$DW$616, DW_AT_data_member_location[DW_OP_plus_uconst 0x7a]
    6212                      .dwattr $C$DW$616, DW_AT_accessibility(DW_ACCESS_public)
    6213              $C$DW$617       .dwtag  DW_TAG_member
    6214                      .dwattr $C$DW$617, DW_AT_type(*$C$DW$T$52)
    6215                      .dwattr $C$DW$617, DW_AT_name("motorParams")
    6216                      .dwattr $C$DW$617, DW_AT_TI_symbol_name("_motorParams")
    6217                      .dwattr $C$DW$617, DW_AT_data_member_location[DW_OP_plus_uconst 0x84]
    6218                      .dwattr $C$DW$617, DW_AT_accessibility(DW_ACCESS_public)
    6219              $C$DW$618       .dwtag  DW_TAG_member
    6220                      .dwattr $C$DW$618, DW_AT_type(*$C$DW$T$55)
    6221                      .dwattr $C$DW$618, DW_AT_name("waitTimes")
    6222                      .dwattr $C$DW$618, DW_AT_TI_symbol_name("_waitTimes")
    6223                      .dwattr $C$DW$618, DW_AT_data_member_location[DW_OP_plus_uconst 0x92]
    6224                      .dwattr $C$DW$618, DW_AT_accessibility(DW_ACCESS_public)
    6225              $C$DW$619       .dwtag  DW_TAG_member
    6226                      .dwattr $C$DW$619, DW_AT_type(*$C$DW$T$54)
    6227                      .dwattr $C$DW$619, DW_AT_name("counter_state")
    6228                      .dwattr $C$DW$619, DW_AT_TI_symbol_name("_counter_state")
    6229                      .dwattr $C$DW$619, DW_AT_data_member_location[DW_OP_plus_uconst 0x9a]
    6230                      .dwattr $C$DW$619, DW_AT_accessibility(DW_ACCESS_public)
    6231              $C$DW$620       .dwtag  DW_TAG_member
    6232                      .dwattr $C$DW$620, DW_AT_type(*$C$DW$T$56)
    6233                      .dwattr $C$DW$620, DW_AT_name("numIsrTicksPerCtrlTick")
TMS320C2000 Assembler PC v6.2.5 Sun Oct 08 22:38:44 2017

Tools Copyright (c) 1996-2014 Texas Instruments Incorporated
C:\Users\wmj\AppData\Local\Temp\0622810                              PAGE  127

    6234                      .dwattr $C$DW$620, DW_AT_TI_symbol_name("_numIsrTicksPerCtrlTick")
    6235                      .dwattr $C$DW$620, DW_AT_data_member_location[DW_OP_plus_uconst 0x9c]
    6236                      .dwattr $C$DW$620, DW_AT_accessibility(DW_ACCESS_public)
    6237              $C$DW$621       .dwtag  DW_TAG_member
    6238                      .dwattr $C$DW$621, DW_AT_type(*$C$DW$T$56)
    6239                      .dwattr $C$DW$621, DW_AT_name("numCtrlTicksPerCurrentTick")
    6240                      .dwattr $C$DW$621, DW_AT_TI_symbol_name("_numCtrlTicksPerCurrentTick")
    6241                      .dwattr $C$DW$621, DW_AT_data_member_location[DW_OP_plus_uconst 0x9d]
    6242                      .dwattr $C$DW$621, DW_AT_accessibility(DW_ACCESS_public)
    6243              $C$DW$622       .dwtag  DW_TAG_member
    6244                      .dwattr $C$DW$622, DW_AT_type(*$C$DW$T$56)
    6245                      .dwattr $C$DW$622, DW_AT_name("numCtrlTicksPerSpeedTick")
    6246                      .dwattr $C$DW$622, DW_AT_TI_symbol_name("_numCtrlTicksPerSpeedTick")
    6247                      .dwattr $C$DW$622, DW_AT_data_member_location[DW_OP_plus_uconst 0x9e]
    6248                      .dwattr $C$DW$622, DW_AT_accessibility(DW_ACCESS_public)
    6249              $C$DW$623       .dwtag  DW_TAG_member
    6250                      .dwattr $C$DW$623, DW_AT_type(*$C$DW$T$56)
    6251                      .dwattr $C$DW$623, DW_AT_name("numCtrlTicksPerTrajTick")
    6252                      .dwattr $C$DW$623, DW_AT_TI_symbol_name("_numCtrlTicksPerTrajTick")
    6253                      .dwattr $C$DW$623, DW_AT_data_member_location[DW_OP_plus_uconst 0x9f]
    6254                      .dwattr $C$DW$623, DW_AT_accessibility(DW_ACCESS_public)
    6255              $C$DW$624       .dwtag  DW_TAG_member
    6256                      .dwattr $C$DW$624, DW_AT_type(*$C$DW$T$54)
    6257                      .dwattr $C$DW$624, DW_AT_name("ctrlFreq_Hz")
    6258                      .dwattr $C$DW$624, DW_AT_TI_symbol_name("_ctrlFreq_Hz")
    6259                      .dwattr $C$DW$624, DW_AT_data_member_location[DW_OP_plus_uconst 0xa0]
    6260                      .dwattr $C$DW$624, DW_AT_accessibility(DW_ACCESS_public)
    6261              $C$DW$625       .dwtag  DW_TAG_member
    6262                      .dwattr $C$DW$625, DW_AT_type(*$C$DW$T$54)
    6263                      .dwattr $C$DW$625, DW_AT_name("trajFreq_Hz")
    6264                      .dwattr $C$DW$625, DW_AT_TI_symbol_name("_trajFreq_Hz")
    6265                      .dwattr $C$DW$625, DW_AT_data_member_location[DW_OP_plus_uconst 0xa2]
    6266                      .dwattr $C$DW$625, DW_AT_accessibility(DW_ACCESS_public)
    6267              $C$DW$626       .dwtag  DW_TAG_member
    6268                      .dwattr $C$DW$626, DW_AT_type(*$C$DW$T$20)
    6269                      .dwattr $C$DW$626, DW_AT_name("trajPeriod_sec")
    6270                      .dwattr $C$DW$626, DW_AT_TI_symbol_name("_trajPeriod_sec")
    6271                      .dwattr $C$DW$626, DW_AT_data_member_location[DW_OP_plus_uconst 0xa4]
    6272                      .dwattr $C$DW$626, DW_AT_accessibility(DW_ACCESS_public)
    6273              $C$DW$627       .dwtag  DW_TAG_member
    6274                      .dwattr $C$DW$627, DW_AT_type(*$C$DW$T$57)
    6275                      .dwattr $C$DW$627, DW_AT_name("ctrlPeriod_sec")
    6276                      .dwattr $C$DW$627, DW_AT_TI_symbol_name("_ctrlPeriod_sec")
    6277                      .dwattr $C$DW$627, DW_AT_data_member_location[DW_OP_plus_uconst 0xa6]
    6278                      .dwattr $C$DW$627, DW_AT_accessibility(DW_ACCESS_public)
    6279              $C$DW$628       .dwtag  DW_TAG_member
    6280                      .dwattr $C$DW$628, DW_AT_type(*$C$DW$T$20)
    6281                      .dwattr $C$DW$628, DW_AT_name("maxVsMag_pu")
    6282                      .dwattr $C$DW$628, DW_AT_TI_symbol_name("_maxVsMag_pu")
    6283                      .dwattr $C$DW$628, DW_AT_data_member_location[DW_OP_plus_uconst 0xa8]
    6284                      .dwattr $C$DW$628, DW_AT_accessibility(DW_ACCESS_public)
    6285              $C$DW$629       .dwtag  DW_TAG_member
    6286                      .dwattr $C$DW$629, DW_AT_type(*$C$DW$T$21)
    6287                      .dwattr $C$DW$629, DW_AT_name("Iab_in")
    6288                      .dwattr $C$DW$629, DW_AT_TI_symbol_name("_Iab_in")
TMS320C2000 Assembler PC v6.2.5 Sun Oct 08 22:38:44 2017

Tools Copyright (c) 1996-2014 Texas Instruments Incorporated
C:\Users\wmj\AppData\Local\Temp\0622810                              PAGE  128

    6289                      .dwattr $C$DW$629, DW_AT_data_member_location[DW_OP_plus_uconst 0xaa]
    6290                      .dwattr $C$DW$629, DW_AT_accessibility(DW_ACCESS_public)
    6291              $C$DW$630       .dwtag  DW_TAG_member
    6292                      .dwattr $C$DW$630, DW_AT_type(*$C$DW$T$21)
    6293                      .dwattr $C$DW$630, DW_AT_name("Iab_filt")
    6294                      .dwattr $C$DW$630, DW_AT_TI_symbol_name("_Iab_filt")
    6295                      .dwattr $C$DW$630, DW_AT_data_member_location[DW_OP_plus_uconst 0xae]
    6296                      .dwattr $C$DW$630, DW_AT_accessibility(DW_ACCESS_public)
    6297              $C$DW$631       .dwtag  DW_TAG_member
    6298                      .dwattr $C$DW$631, DW_AT_type(*$C$DW$T$21)
    6299                      .dwattr $C$DW$631, DW_AT_name("Idq_in")
    6300                      .dwattr $C$DW$631, DW_AT_TI_symbol_name("_Idq_in")
    6301                      .dwattr $C$DW$631, DW_AT_data_member_location[DW_OP_plus_uconst 0xb2]
    6302                      .dwattr $C$DW$631, DW_AT_accessibility(DW_ACCESS_public)
    6303              $C$DW$632       .dwtag  DW_TAG_member
    6304                      .dwattr $C$DW$632, DW_AT_type(*$C$DW$T$21)
    6305                      .dwattr $C$DW$632, DW_AT_name("Vab_in")
    6306                      .dwattr $C$DW$632, DW_AT_TI_symbol_name("_Vab_in")
    6307                      .dwattr $C$DW$632, DW_AT_data_member_location[DW_OP_plus_uconst 0xb6]
    6308                      .dwattr $C$DW$632, DW_AT_accessibility(DW_ACCESS_public)
    6309              $C$DW$633       .dwtag  DW_TAG_member
    6310                      .dwattr $C$DW$633, DW_AT_type(*$C$DW$T$20)
    6311                      .dwattr $C$DW$633, DW_AT_name("spd_out")
    6312                      .dwattr $C$DW$633, DW_AT_TI_symbol_name("_spd_out")
    6313                      .dwattr $C$DW$633, DW_AT_data_member_location[DW_OP_plus_uconst 0xba]
    6314                      .dwattr $C$DW$633, DW_AT_accessibility(DW_ACCESS_public)
    6315              $C$DW$634       .dwtag  DW_TAG_member
    6316                      .dwattr $C$DW$634, DW_AT_type(*$C$DW$T$21)
    6317                      .dwattr $C$DW$634, DW_AT_name("Vab_out")
    6318                      .dwattr $C$DW$634, DW_AT_TI_symbol_name("_Vab_out")
    6319                      .dwattr $C$DW$634, DW_AT_data_member_location[DW_OP_plus_uconst 0xbc]
    6320                      .dwattr $C$DW$634, DW_AT_accessibility(DW_ACCESS_public)
    6321              $C$DW$635       .dwtag  DW_TAG_member
    6322                      .dwattr $C$DW$635, DW_AT_type(*$C$DW$T$21)
    6323                      .dwattr $C$DW$635, DW_AT_name("Vdq_out")
    6324                      .dwattr $C$DW$635, DW_AT_TI_symbol_name("_Vdq_out")
    6325                      .dwattr $C$DW$635, DW_AT_data_member_location[DW_OP_plus_uconst 0xc0]
    6326                      .dwattr $C$DW$635, DW_AT_accessibility(DW_ACCESS_public)
    6327              $C$DW$636       .dwtag  DW_TAG_member
    6328                      .dwattr $C$DW$636, DW_AT_type(*$C$DW$T$57)
    6329                      .dwattr $C$DW$636, DW_AT_name("Rhf")
    6330                      .dwattr $C$DW$636, DW_AT_TI_symbol_name("_Rhf")
    6331                      .dwattr $C$DW$636, DW_AT_data_member_location[DW_OP_plus_uconst 0xc4]
    6332                      .dwattr $C$DW$636, DW_AT_accessibility(DW_ACCESS_public)
    6333              $C$DW$637       .dwtag  DW_TAG_member
    6334                      .dwattr $C$DW$637, DW_AT_type(*$C$DW$T$57)
    6335                      .dwattr $C$DW$637, DW_AT_name("Lhf")
    6336                      .dwattr $C$DW$637, DW_AT_TI_symbol_name("_Lhf")
    6337                      .dwattr $C$DW$637, DW_AT_data_member_location[DW_OP_plus_uconst 0xc6]
    6338                      .dwattr $C$DW$637, DW_AT_accessibility(DW_ACCESS_public)
    6339              $C$DW$638       .dwtag  DW_TAG_member
    6340                      .dwattr $C$DW$638, DW_AT_type(*$C$DW$T$57)
    6341                      .dwattr $C$DW$638, DW_AT_name("RoverL")
    6342                      .dwattr $C$DW$638, DW_AT_TI_symbol_name("_RoverL")
    6343                      .dwattr $C$DW$638, DW_AT_data_member_location[DW_OP_plus_uconst 0xc8]
TMS320C2000 Assembler PC v6.2.5 Sun Oct 08 22:38:44 2017

Tools Copyright (c) 1996-2014 Texas Instruments Incorporated
C:\Users\wmj\AppData\Local\Temp\0622810                              PAGE  129

    6344                      .dwattr $C$DW$638, DW_AT_accessibility(DW_ACCESS_public)
    6345              $C$DW$639       .dwtag  DW_TAG_member
    6346                      .dwattr $C$DW$639, DW_AT_type(*$C$DW$T$20)
    6347                      .dwattr $C$DW$639, DW_AT_name("Kp_Id")
    6348                      .dwattr $C$DW$639, DW_AT_TI_symbol_name("_Kp_Id")
    6349                      .dwattr $C$DW$639, DW_AT_data_member_location[DW_OP_plus_uconst 0xca]
    6350                      .dwattr $C$DW$639, DW_AT_accessibility(DW_ACCESS_public)
    6351              $C$DW$640       .dwtag  DW_TAG_member
    6352                      .dwattr $C$DW$640, DW_AT_type(*$C$DW$T$20)
    6353                      .dwattr $C$DW$640, DW_AT_name("Kp_Iq")
    6354                      .dwattr $C$DW$640, DW_AT_TI_symbol_name("_Kp_Iq")
    6355                      .dwattr $C$DW$640, DW_AT_data_member_location[DW_OP_plus_uconst 0xcc]
    6356                      .dwattr $C$DW$640, DW_AT_accessibility(DW_ACCESS_public)
    6357              $C$DW$641       .dwtag  DW_TAG_member
    6358                      .dwattr $C$DW$641, DW_AT_type(*$C$DW$T$20)
    6359                      .dwattr $C$DW$641, DW_AT_name("Kp_spd")
    6360                      .dwattr $C$DW$641, DW_AT_TI_symbol_name("_Kp_spd")
    6361                      .dwattr $C$DW$641, DW_AT_data_member_location[DW_OP_plus_uconst 0xce]
    6362                      .dwattr $C$DW$641, DW_AT_accessibility(DW_ACCESS_public)
    6363              $C$DW$642       .dwtag  DW_TAG_member
    6364                      .dwattr $C$DW$642, DW_AT_type(*$C$DW$T$20)
    6365                      .dwattr $C$DW$642, DW_AT_name("Ki_Id")
    6366                      .dwattr $C$DW$642, DW_AT_TI_symbol_name("_Ki_Id")
    6367                      .dwattr $C$DW$642, DW_AT_data_member_location[DW_OP_plus_uconst 0xd0]
    6368                      .dwattr $C$DW$642, DW_AT_accessibility(DW_ACCESS_public)
    6369              $C$DW$643       .dwtag  DW_TAG_member
    6370                      .dwattr $C$DW$643, DW_AT_type(*$C$DW$T$20)
    6371                      .dwattr $C$DW$643, DW_AT_name("Ki_Iq")
    6372                      .dwattr $C$DW$643, DW_AT_TI_symbol_name("_Ki_Iq")
    6373                      .dwattr $C$DW$643, DW_AT_data_member_location[DW_OP_plus_uconst 0xd2]
    6374                      .dwattr $C$DW$643, DW_AT_accessibility(DW_ACCESS_public)
    6375              $C$DW$644       .dwtag  DW_TAG_member
    6376                      .dwattr $C$DW$644, DW_AT_type(*$C$DW$T$20)
    6377                      .dwattr $C$DW$644, DW_AT_name("Ki_spd")
    6378                      .dwattr $C$DW$644, DW_AT_TI_symbol_name("_Ki_spd")
    6379                      .dwattr $C$DW$644, DW_AT_data_member_location[DW_OP_plus_uconst 0xd4]
    6380                      .dwattr $C$DW$644, DW_AT_accessibility(DW_ACCESS_public)
    6381              $C$DW$645       .dwtag  DW_TAG_member
    6382                      .dwattr $C$DW$645, DW_AT_type(*$C$DW$T$20)
    6383                      .dwattr $C$DW$645, DW_AT_name("Kd_Id")
    6384                      .dwattr $C$DW$645, DW_AT_TI_symbol_name("_Kd_Id")
    6385                      .dwattr $C$DW$645, DW_AT_data_member_location[DW_OP_plus_uconst 0xd6]
    6386                      .dwattr $C$DW$645, DW_AT_accessibility(DW_ACCESS_public)
    6387              $C$DW$646       .dwtag  DW_TAG_member
    6388                      .dwattr $C$DW$646, DW_AT_type(*$C$DW$T$20)
    6389                      .dwattr $C$DW$646, DW_AT_name("Kd_Iq")
    6390                      .dwattr $C$DW$646, DW_AT_TI_symbol_name("_Kd_Iq")
    6391                      .dwattr $C$DW$646, DW_AT_data_member_location[DW_OP_plus_uconst 0xd8]
    6392                      .dwattr $C$DW$646, DW_AT_accessibility(DW_ACCESS_public)
    6393              $C$DW$647       .dwtag  DW_TAG_member
    6394                      .dwattr $C$DW$647, DW_AT_type(*$C$DW$T$20)
    6395                      .dwattr $C$DW$647, DW_AT_name("Kd_spd")
    6396                      .dwattr $C$DW$647, DW_AT_TI_symbol_name("_Kd_spd")
    6397                      .dwattr $C$DW$647, DW_AT_data_member_location[DW_OP_plus_uconst 0xda]
    6398                      .dwattr $C$DW$647, DW_AT_accessibility(DW_ACCESS_public)
TMS320C2000 Assembler PC v6.2.5 Sun Oct 08 22:38:44 2017

Tools Copyright (c) 1996-2014 Texas Instruments Incorporated
C:\Users\wmj\AppData\Local\Temp\0622810                              PAGE  130

    6399              $C$DW$648       .dwtag  DW_TAG_member
    6400                      .dwattr $C$DW$648, DW_AT_type(*$C$DW$T$20)
    6401                      .dwattr $C$DW$648, DW_AT_name("Ui_Id")
    6402                      .dwattr $C$DW$648, DW_AT_TI_symbol_name("_Ui_Id")
    6403                      .dwattr $C$DW$648, DW_AT_data_member_location[DW_OP_plus_uconst 0xdc]
    6404                      .dwattr $C$DW$648, DW_AT_accessibility(DW_ACCESS_public)
    6405              $C$DW$649       .dwtag  DW_TAG_member
    6406                      .dwattr $C$DW$649, DW_AT_type(*$C$DW$T$20)
    6407                      .dwattr $C$DW$649, DW_AT_name("Ui_Iq")
    6408                      .dwattr $C$DW$649, DW_AT_TI_symbol_name("_Ui_Iq")
    6409                      .dwattr $C$DW$649, DW_AT_data_member_location[DW_OP_plus_uconst 0xde]
    6410                      .dwattr $C$DW$649, DW_AT_accessibility(DW_ACCESS_public)
    6411              $C$DW$650       .dwtag  DW_TAG_member
    6412                      .dwattr $C$DW$650, DW_AT_type(*$C$DW$T$20)
    6413                      .dwattr $C$DW$650, DW_AT_name("Ui_spd")
    6414                      .dwattr $C$DW$650, DW_AT_TI_symbol_name("_Ui_spd")
    6415                      .dwattr $C$DW$650, DW_AT_data_member_location[DW_OP_plus_uconst 0xe0]
    6416                      .dwattr $C$DW$650, DW_AT_accessibility(DW_ACCESS_public)
    6417              $C$DW$651       .dwtag  DW_TAG_member
    6418                      .dwattr $C$DW$651, DW_AT_type(*$C$DW$T$21)
    6419                      .dwattr $C$DW$651, DW_AT_name("Idq_ref")
    6420                      .dwattr $C$DW$651, DW_AT_TI_symbol_name("_Idq_ref")
    6421                      .dwattr $C$DW$651, DW_AT_data_member_location[DW_OP_plus_uconst 0xe2]
    6422                      .dwattr $C$DW$651, DW_AT_accessibility(DW_ACCESS_public)
    6423              $C$DW$652       .dwtag  DW_TAG_member
    6424                      .dwattr $C$DW$652, DW_AT_type(*$C$DW$T$20)
    6425                      .dwattr $C$DW$652, DW_AT_name("IdRated")
    6426                      .dwattr $C$DW$652, DW_AT_TI_symbol_name("_IdRated")
    6427                      .dwattr $C$DW$652, DW_AT_data_member_location[DW_OP_plus_uconst 0xe6]
    6428                      .dwattr $C$DW$652, DW_AT_accessibility(DW_ACCESS_public)
    6429              $C$DW$653       .dwtag  DW_TAG_member
    6430                      .dwattr $C$DW$653, DW_AT_type(*$C$DW$T$20)
    6431                      .dwattr $C$DW$653, DW_AT_name("spd_ref")
    6432                      .dwattr $C$DW$653, DW_AT_TI_symbol_name("_spd_ref")
    6433                      .dwattr $C$DW$653, DW_AT_data_member_location[DW_OP_plus_uconst 0xe8]
    6434                      .dwattr $C$DW$653, DW_AT_accessibility(DW_ACCESS_public)
    6435              $C$DW$654       .dwtag  DW_TAG_member
    6436                      .dwattr $C$DW$654, DW_AT_type(*$C$DW$T$20)
    6437                      .dwattr $C$DW$654, DW_AT_name("spd_max")
    6438                      .dwattr $C$DW$654, DW_AT_TI_symbol_name("_spd_max")
    6439                      .dwattr $C$DW$654, DW_AT_data_member_location[DW_OP_plus_uconst 0xea]
    6440                      .dwattr $C$DW$654, DW_AT_accessibility(DW_ACCESS_public)
    6441              $C$DW$655       .dwtag  DW_TAG_member
    6442                      .dwattr $C$DW$655, DW_AT_type(*$C$DW$T$56)
    6443                      .dwattr $C$DW$655, DW_AT_name("counter_current")
    6444                      .dwattr $C$DW$655, DW_AT_TI_symbol_name("_counter_current")
    6445                      .dwattr $C$DW$655, DW_AT_data_member_location[DW_OP_plus_uconst 0xec]
    6446                      .dwattr $C$DW$655, DW_AT_accessibility(DW_ACCESS_public)
    6447              $C$DW$656       .dwtag  DW_TAG_member
    6448                      .dwattr $C$DW$656, DW_AT_type(*$C$DW$T$56)
    6449                      .dwattr $C$DW$656, DW_AT_name("counter_isr")
    6450                      .dwattr $C$DW$656, DW_AT_TI_symbol_name("_counter_isr")
    6451                      .dwattr $C$DW$656, DW_AT_data_member_location[DW_OP_plus_uconst 0xed]
    6452                      .dwattr $C$DW$656, DW_AT_accessibility(DW_ACCESS_public)
    6453              $C$DW$657       .dwtag  DW_TAG_member
TMS320C2000 Assembler PC v6.2.5 Sun Oct 08 22:38:44 2017

Tools Copyright (c) 1996-2014 Texas Instruments Incorporated
C:\Users\wmj\AppData\Local\Temp\0622810                              PAGE  131

    6454                      .dwattr $C$DW$657, DW_AT_type(*$C$DW$T$56)
    6455                      .dwattr $C$DW$657, DW_AT_name("counter_speed")
    6456                      .dwattr $C$DW$657, DW_AT_TI_symbol_name("_counter_speed")
    6457                      .dwattr $C$DW$657, DW_AT_data_member_location[DW_OP_plus_uconst 0xee]
    6458                      .dwattr $C$DW$657, DW_AT_accessibility(DW_ACCESS_public)
    6459              $C$DW$658       .dwtag  DW_TAG_member
    6460                      .dwattr $C$DW$658, DW_AT_type(*$C$DW$T$56)
    6461                      .dwattr $C$DW$658, DW_AT_name("counter_traj")
    6462                      .dwattr $C$DW$658, DW_AT_TI_symbol_name("_counter_traj")
    6463                      .dwattr $C$DW$658, DW_AT_data_member_location[DW_OP_plus_uconst 0xef]
    6464                      .dwattr $C$DW$658, DW_AT_accessibility(DW_ACCESS_public)
    6465              $C$DW$659       .dwtag  DW_TAG_member
    6466                      .dwattr $C$DW$659, DW_AT_type(*$C$DW$T$22)
    6467                      .dwattr $C$DW$659, DW_AT_name("flag_enableCtrl")
    6468                      .dwattr $C$DW$659, DW_AT_TI_symbol_name("_flag_enableCtrl")
    6469                      .dwattr $C$DW$659, DW_AT_data_member_location[DW_OP_plus_uconst 0xf0]
    6470                      .dwattr $C$DW$659, DW_AT_accessibility(DW_ACCESS_public)
    6471              $C$DW$660       .dwtag  DW_TAG_member
    6472                      .dwattr $C$DW$660, DW_AT_type(*$C$DW$T$22)
    6473                      .dwattr $C$DW$660, DW_AT_name("flag_enableDcBusComp")
    6474                      .dwattr $C$DW$660, DW_AT_TI_symbol_name("_flag_enableDcBusComp")
    6475                      .dwattr $C$DW$660, DW_AT_data_member_location[DW_OP_plus_uconst 0xf1]
    6476                      .dwattr $C$DW$660, DW_AT_accessibility(DW_ACCESS_public)
    6477              $C$DW$661       .dwtag  DW_TAG_member
    6478                      .dwattr $C$DW$661, DW_AT_type(*$C$DW$T$22)
    6479                      .dwattr $C$DW$661, DW_AT_name("flag_enablePowerWarp")
    6480                      .dwattr $C$DW$661, DW_AT_TI_symbol_name("_flag_enablePowerWarp")
    6481                      .dwattr $C$DW$661, DW_AT_data_member_location[DW_OP_plus_uconst 0xf2]
    6482                      .dwattr $C$DW$661, DW_AT_accessibility(DW_ACCESS_public)
    6483              $C$DW$662       .dwtag  DW_TAG_member
    6484                      .dwattr $C$DW$662, DW_AT_type(*$C$DW$T$22)
    6485                      .dwattr $C$DW$662, DW_AT_name("flag_enableOffset")
    6486                      .dwattr $C$DW$662, DW_AT_TI_symbol_name("_flag_enableOffset")
    6487                      .dwattr $C$DW$662, DW_AT_data_member_location[DW_OP_plus_uconst 0xf3]
    6488                      .dwattr $C$DW$662, DW_AT_accessibility(DW_ACCESS_public)
    6489              $C$DW$663       .dwtag  DW_TAG_member
    6490                      .dwattr $C$DW$663, DW_AT_type(*$C$DW$T$22)
    6491                      .dwattr $C$DW$663, DW_AT_name("flag_enableSpeedCtrl")
    6492                      .dwattr $C$DW$663, DW_AT_TI_symbol_name("_flag_enableSpeedCtrl")
    6493                      .dwattr $C$DW$663, DW_AT_data_member_location[DW_OP_plus_uconst 0xf4]
    6494                      .dwattr $C$DW$663, DW_AT_accessibility(DW_ACCESS_public)
    6495              $C$DW$664       .dwtag  DW_TAG_member
    6496                      .dwattr $C$DW$664, DW_AT_type(*$C$DW$T$22)
    6497                      .dwattr $C$DW$664, DW_AT_name("flag_enableUserMotorParams")
    6498                      .dwattr $C$DW$664, DW_AT_TI_symbol_name("_flag_enableUserMotorParams")
    6499                      .dwattr $C$DW$664, DW_AT_data_member_location[DW_OP_plus_uconst 0xf5]
    6500                      .dwattr $C$DW$664, DW_AT_accessibility(DW_ACCESS_public)
    6501              $C$DW$665       .dwtag  DW_TAG_member
    6502                      .dwattr $C$DW$665, DW_AT_type(*$C$DW$T$21)
    6503                      .dwattr $C$DW$665, DW_AT_name("Idq_offset_pu")
    6504                      .dwattr $C$DW$665, DW_AT_TI_symbol_name("_Idq_offset_pu")
    6505                      .dwattr $C$DW$665, DW_AT_data_member_location[DW_OP_plus_uconst 0xf6]
    6506                      .dwattr $C$DW$665, DW_AT_accessibility(DW_ACCESS_public)
    6507              $C$DW$666       .dwtag  DW_TAG_member
    6508                      .dwattr $C$DW$666, DW_AT_type(*$C$DW$T$21)
TMS320C2000 Assembler PC v6.2.5 Sun Oct 08 22:38:44 2017

Tools Copyright (c) 1996-2014 Texas Instruments Incorporated
C:\Users\wmj\AppData\Local\Temp\0622810                              PAGE  132

    6509                      .dwattr $C$DW$666, DW_AT_name("Vdq_offset_pu")
    6510                      .dwattr $C$DW$666, DW_AT_TI_symbol_name("_Vdq_offset_pu")
    6511                      .dwattr $C$DW$666, DW_AT_data_member_location[DW_OP_plus_uconst 0xfa]
    6512                      .dwattr $C$DW$666, DW_AT_accessibility(DW_ACCESS_public)
    6513              $C$DW$667       .dwtag  DW_TAG_member
    6514                      .dwattr $C$DW$667, DW_AT_type(*$C$DW$T$20)
    6515                      .dwattr $C$DW$667, DW_AT_name("angle_pu")
    6516                      .dwattr $C$DW$667, DW_AT_TI_symbol_name("_angle_pu")
    6517                      .dwattr $C$DW$667, DW_AT_data_member_location[DW_OP_plus_uconst 0xfe]
    6518                      .dwattr $C$DW$667, DW_AT_accessibility(DW_ACCESS_public)
    6519              $C$DW$668       .dwtag  DW_TAG_member
    6520                      .dwattr $C$DW$668, DW_AT_type(*$C$DW$T$20)
    6521                      .dwattr $C$DW$668, DW_AT_name("speed_ref_pu")
    6522                      .dwattr $C$DW$668, DW_AT_TI_symbol_name("_speed_ref_pu")
    6523                      .dwattr $C$DW$668, DW_AT_data_member_location[DW_OP_plus_uconst 0x100]
    6524                      .dwattr $C$DW$668, DW_AT_accessibility(DW_ACCESS_public)
    6525              $C$DW$669       .dwtag  DW_TAG_member
    6526                      .dwattr $C$DW$669, DW_AT_type(*$C$DW$T$20)
    6527                      .dwattr $C$DW$669, DW_AT_name("speed_fb_pu")
    6528                      .dwattr $C$DW$669, DW_AT_TI_symbol_name("_speed_fb_pu")
    6529                      .dwattr $C$DW$669, DW_AT_data_member_location[DW_OP_plus_uconst 0x102]
    6530                      .dwattr $C$DW$669, DW_AT_accessibility(DW_ACCESS_public)
    6531              $C$DW$670       .dwtag  DW_TAG_member
    6532                      .dwattr $C$DW$670, DW_AT_type(*$C$DW$T$20)
    6533                      .dwattr $C$DW$670, DW_AT_name("speed_outMax_pu")
    6534                      .dwattr $C$DW$670, DW_AT_TI_symbol_name("_speed_outMax_pu")
    6535                      .dwattr $C$DW$670, DW_AT_data_member_location[DW_OP_plus_uconst 0x104]
    6536                      .dwattr $C$DW$670, DW_AT_accessibility(DW_ACCESS_public)
    6537              $C$DW$671       .dwtag  DW_TAG_member
    6538                      .dwattr $C$DW$671, DW_AT_type(*$C$DW$T$22)
    6539                      .dwattr $C$DW$671, DW_AT_name("flag_enableCurrentCtrl")
    6540                      .dwattr $C$DW$671, DW_AT_TI_symbol_name("_flag_enableCurrentCtrl")
    6541                      .dwattr $C$DW$671, DW_AT_data_member_location[DW_OP_plus_uconst 0x106]
    6542                      .dwattr $C$DW$671, DW_AT_accessibility(DW_ACCESS_public)
    6543              $C$DW$672       .dwtag  DW_TAG_member
    6544                      .dwattr $C$DW$672, DW_AT_type(*$C$DW$T$59)
    6545                      .dwattr $C$DW$672, DW_AT_name("brakeHandle")
    6546                      .dwattr $C$DW$672, DW_AT_TI_symbol_name("_brakeHandle")
    6547                      .dwattr $C$DW$672, DW_AT_data_member_location[DW_OP_plus_uconst 0x108]
    6548                      .dwattr $C$DW$672, DW_AT_accessibility(DW_ACCESS_public)
    6549              $C$DW$673       .dwtag  DW_TAG_member
    6550                      .dwattr $C$DW$673, DW_AT_type(*$C$DW$T$60)
    6551                      .dwattr $C$DW$673, DW_AT_name("brake")
    6552                      .dwattr $C$DW$673, DW_AT_TI_symbol_name("_brake")
    6553                      .dwattr $C$DW$673, DW_AT_data_member_location[DW_OP_plus_uconst 0x10a]
    6554                      .dwattr $C$DW$673, DW_AT_accessibility(DW_ACCESS_public)
    6555                      .dwendtag $C$DW$T$61
    6556              
    6557              $C$DW$T$88      .dwtag  DW_TAG_typedef, DW_AT_name("CTRL_Obj")
    6558                      .dwattr $C$DW$T$88, DW_AT_type(*$C$DW$T$61)
    6559                      .dwattr $C$DW$T$88, DW_AT_language(DW_LANG_C)
    6560              $C$DW$T$89      .dwtag  DW_TAG_pointer_type
    6561                      .dwattr $C$DW$T$89, DW_AT_type(*$C$DW$T$61)
    6562                      .dwattr $C$DW$T$89, DW_AT_address_class(0x16)
    6563              $C$DW$T$90      .dwtag  DW_TAG_typedef, DW_AT_name("CTRL_Handle")
TMS320C2000 Assembler PC v6.2.5 Sun Oct 08 22:38:44 2017

Tools Copyright (c) 1996-2014 Texas Instruments Incorporated
C:\Users\wmj\AppData\Local\Temp\0622810                              PAGE  133

    6564                      .dwattr $C$DW$T$90, DW_AT_type(*$C$DW$T$89)
    6565                      .dwattr $C$DW$T$90, DW_AT_language(DW_LANG_C)
    6566              $C$DW$674       .dwtag  DW_TAG_TI_far_type
    6567                      .dwattr $C$DW$674, DW_AT_type(*$C$DW$T$90)
    6568              $C$DW$T$91      .dwtag  DW_TAG_const_type
    6569                      .dwattr $C$DW$T$91, DW_AT_type(*$C$DW$674)
    6570              
    6571              $C$DW$T$64      .dwtag  DW_TAG_structure_type
    6572                      .dwattr $C$DW$T$64, DW_AT_name("_CTRL_Version_")
    6573                      .dwattr $C$DW$T$64, DW_AT_byte_size(0x04)
    6574              $C$DW$675       .dwtag  DW_TAG_member
    6575                      .dwattr $C$DW$675, DW_AT_type(*$C$DW$T$24)
    6576                      .dwattr $C$DW$675, DW_AT_name("rsvd")
    6577                      .dwattr $C$DW$675, DW_AT_TI_symbol_name("_rsvd")
    6578                      .dwattr $C$DW$675, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    6579                      .dwattr $C$DW$675, DW_AT_accessibility(DW_ACCESS_public)
    6580              $C$DW$676       .dwtag  DW_TAG_member
    6581                      .dwattr $C$DW$676, DW_AT_type(*$C$DW$T$63)
    6582                      .dwattr $C$DW$676, DW_AT_name("targetProc")
    6583                      .dwattr $C$DW$676, DW_AT_TI_symbol_name("_targetProc")
    6584                      .dwattr $C$DW$676, DW_AT_data_member_location[DW_OP_plus_uconst 0x1]
    6585                      .dwattr $C$DW$676, DW_AT_accessibility(DW_ACCESS_public)
    6586              $C$DW$677       .dwtag  DW_TAG_member
    6587                      .dwattr $C$DW$677, DW_AT_type(*$C$DW$T$24)
    6588                      .dwattr $C$DW$677, DW_AT_name("major")
    6589                      .dwattr $C$DW$677, DW_AT_TI_symbol_name("_major")
    6590                      .dwattr $C$DW$677, DW_AT_data_member_location[DW_OP_plus_uconst 0x2]
    6591                      .dwattr $C$DW$677, DW_AT_accessibility(DW_ACCESS_public)
    6592              $C$DW$678       .dwtag  DW_TAG_member
    6593                      .dwattr $C$DW$678, DW_AT_type(*$C$DW$T$24)
    6594                      .dwattr $C$DW$678, DW_AT_name("minor")
    6595                      .dwattr $C$DW$678, DW_AT_TI_symbol_name("_minor")
    6596                      .dwattr $C$DW$678, DW_AT_data_member_location[DW_OP_plus_uconst 0x3]
    6597                      .dwattr $C$DW$678, DW_AT_accessibility(DW_ACCESS_public)
    6598                      .dwendtag $C$DW$T$64
    6599              
    6600              $C$DW$T$27      .dwtag  DW_TAG_typedef, DW_AT_name("CTRL_Version")
    6601                      .dwattr $C$DW$T$27, DW_AT_type(*$C$DW$T$64)
    6602                      .dwattr $C$DW$T$27, DW_AT_language(DW_LANG_C)
    6603              
    6604              $C$DW$T$19      .dwtag  DW_TAG_structure_type
    6605                      .dwattr $C$DW$T$19, DW_AT_name("_EST_Obj_")
    6606                      .dwattr $C$DW$T$19, DW_AT_declaration
    6607                      .dwendtag $C$DW$T$19
    6608              
    6609              $C$DW$T$35      .dwtag  DW_TAG_pointer_type
    6610                      .dwattr $C$DW$T$35, DW_AT_type(*$C$DW$T$19)
    6611                      .dwattr $C$DW$T$35, DW_AT_address_class(0x16)
    6612              $C$DW$T$36      .dwtag  DW_TAG_typedef, DW_AT_name("EST_Handle")
    6613                      .dwattr $C$DW$T$36, DW_AT_type(*$C$DW$T$35)
    6614                      .dwattr $C$DW$T$36, DW_AT_language(DW_LANG_C)
    6615              
    6616              $C$DW$T$65      .dwtag  DW_TAG_structure_type
    6617                      .dwattr $C$DW$T$65, DW_AT_name("_IPARK_Obj_")
    6618                      .dwattr $C$DW$T$65, DW_AT_byte_size(0x04)
TMS320C2000 Assembler PC v6.2.5 Sun Oct 08 22:38:44 2017

Tools Copyright (c) 1996-2014 Texas Instruments Incorporated
C:\Users\wmj\AppData\Local\Temp\0622810                              PAGE  134

    6619              $C$DW$679       .dwtag  DW_TAG_member
    6620                      .dwattr $C$DW$679, DW_AT_type(*$C$DW$T$20)
    6621                      .dwattr $C$DW$679, DW_AT_name("sinTh")
    6622                      .dwattr $C$DW$679, DW_AT_TI_symbol_name("_sinTh")
    6623                      .dwattr $C$DW$679, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    6624                      .dwattr $C$DW$679, DW_AT_accessibility(DW_ACCESS_public)
    6625              $C$DW$680       .dwtag  DW_TAG_member
    6626                      .dwattr $C$DW$680, DW_AT_type(*$C$DW$T$20)
    6627                      .dwattr $C$DW$680, DW_AT_name("cosTh")
    6628                      .dwattr $C$DW$680, DW_AT_TI_symbol_name("_cosTh")
    6629                      .dwattr $C$DW$680, DW_AT_data_member_location[DW_OP_plus_uconst 0x2]
    6630                      .dwattr $C$DW$680, DW_AT_accessibility(DW_ACCESS_public)
    6631                      .dwendtag $C$DW$T$65
    6632              
    6633              $C$DW$T$45      .dwtag  DW_TAG_typedef, DW_AT_name("IPARK_Obj")
    6634                      .dwattr $C$DW$T$45, DW_AT_type(*$C$DW$T$65)
    6635                      .dwattr $C$DW$T$45, DW_AT_language(DW_LANG_C)
    6636              $C$DW$T$43      .dwtag  DW_TAG_pointer_type
    6637                      .dwattr $C$DW$T$43, DW_AT_type(*$C$DW$T$65)
    6638                      .dwattr $C$DW$T$43, DW_AT_address_class(0x16)
    6639              $C$DW$T$44      .dwtag  DW_TAG_typedef, DW_AT_name("IPARK_Handle")
    6640                      .dwattr $C$DW$T$44, DW_AT_type(*$C$DW$T$43)
    6641                      .dwattr $C$DW$T$44, DW_AT_language(DW_LANG_C)
    6642              
    6643              $C$DW$T$67      .dwtag  DW_TAG_structure_type
    6644                      .dwattr $C$DW$T$67, DW_AT_name("_MATH_vec2_")
    6645                      .dwattr $C$DW$T$67, DW_AT_byte_size(0x04)
    6646              $C$DW$681       .dwtag  DW_TAG_member
    6647                      .dwattr $C$DW$681, DW_AT_type(*$C$DW$T$66)
    6648                      .dwattr $C$DW$681, DW_AT_name("value")
    6649                      .dwattr $C$DW$681, DW_AT_TI_symbol_name("_value")
    6650                      .dwattr $C$DW$681, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    6651                      .dwattr $C$DW$681, DW_AT_accessibility(DW_ACCESS_public)
    6652                      .dwendtag $C$DW$T$67
    6653              
    6654              $C$DW$T$21      .dwtag  DW_TAG_typedef, DW_AT_name("MATH_vec2")
    6655                      .dwattr $C$DW$T$21, DW_AT_type(*$C$DW$T$67)
    6656                      .dwattr $C$DW$T$21, DW_AT_language(DW_LANG_C)
    6657              
    6658              $C$DW$T$70      .dwtag  DW_TAG_structure_type
    6659                      .dwattr $C$DW$T$70, DW_AT_name("_MOTOR_Params_")
    6660                      .dwattr $C$DW$T$70, DW_AT_byte_size(0x0e)
    6661              $C$DW$682       .dwtag  DW_TAG_member
    6662                      .dwattr $C$DW$682, DW_AT_type(*$C$DW$T$69)
    6663                      .dwattr $C$DW$682, DW_AT_name("type")
    6664                      .dwattr $C$DW$682, DW_AT_TI_symbol_name("_type")
    6665                      .dwattr $C$DW$682, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    6666                      .dwattr $C$DW$682, DW_AT_accessibility(DW_ACCESS_public)
    6667              $C$DW$683       .dwtag  DW_TAG_member
    6668                      .dwattr $C$DW$683, DW_AT_type(*$C$DW$T$56)
    6669                      .dwattr $C$DW$683, DW_AT_name("numPolePairs")
    6670                      .dwattr $C$DW$683, DW_AT_TI_symbol_name("_numPolePairs")
    6671                      .dwattr $C$DW$683, DW_AT_data_member_location[DW_OP_plus_uconst 0x1]
    6672                      .dwattr $C$DW$683, DW_AT_accessibility(DW_ACCESS_public)
    6673              $C$DW$684       .dwtag  DW_TAG_member
TMS320C2000 Assembler PC v6.2.5 Sun Oct 08 22:38:44 2017

Tools Copyright (c) 1996-2014 Texas Instruments Incorporated
C:\Users\wmj\AppData\Local\Temp\0622810                              PAGE  135

    6674                      .dwattr $C$DW$684, DW_AT_type(*$C$DW$T$57)
    6675                      .dwattr $C$DW$684, DW_AT_name("Lr_H")
    6676                      .dwattr $C$DW$684, DW_AT_TI_symbol_name("_Lr_H")
    6677                      .dwattr $C$DW$684, DW_AT_data_member_location[DW_OP_plus_uconst 0x2]
    6678                      .dwattr $C$DW$684, DW_AT_accessibility(DW_ACCESS_public)
    6679              $C$DW$685       .dwtag  DW_TAG_member
    6680                      .dwattr $C$DW$685, DW_AT_type(*$C$DW$T$57)
    6681                      .dwattr $C$DW$685, DW_AT_name("Ls_d_H")
    6682                      .dwattr $C$DW$685, DW_AT_TI_symbol_name("_Ls_d_H")
    6683                      .dwattr $C$DW$685, DW_AT_data_member_location[DW_OP_plus_uconst 0x4]
    6684                      .dwattr $C$DW$685, DW_AT_accessibility(DW_ACCESS_public)
    6685              $C$DW$686       .dwtag  DW_TAG_member
    6686                      .dwattr $C$DW$686, DW_AT_type(*$C$DW$T$57)
    6687                      .dwattr $C$DW$686, DW_AT_name("Ls_q_H")
    6688                      .dwattr $C$DW$686, DW_AT_TI_symbol_name("_Ls_q_H")
    6689                      .dwattr $C$DW$686, DW_AT_data_member_location[DW_OP_plus_uconst 0x6]
    6690                      .dwattr $C$DW$686, DW_AT_accessibility(DW_ACCESS_public)
    6691              $C$DW$687       .dwtag  DW_TAG_member
    6692                      .dwattr $C$DW$687, DW_AT_type(*$C$DW$T$57)
    6693                      .dwattr $C$DW$687, DW_AT_name("Rr_Ohm")
    6694                      .dwattr $C$DW$687, DW_AT_TI_symbol_name("_Rr_Ohm")
    6695                      .dwattr $C$DW$687, DW_AT_data_member_location[DW_OP_plus_uconst 0x8]
    6696                      .dwattr $C$DW$687, DW_AT_accessibility(DW_ACCESS_public)
    6697              $C$DW$688       .dwtag  DW_TAG_member
    6698                      .dwattr $C$DW$688, DW_AT_type(*$C$DW$T$57)
    6699                      .dwattr $C$DW$688, DW_AT_name("Rs_Ohm")
    6700                      .dwattr $C$DW$688, DW_AT_TI_symbol_name("_Rs_Ohm")
    6701                      .dwattr $C$DW$688, DW_AT_data_member_location[DW_OP_plus_uconst 0xa]
    6702                      .dwattr $C$DW$688, DW_AT_accessibility(DW_ACCESS_public)
    6703              $C$DW$689       .dwtag  DW_TAG_member
    6704                      .dwattr $C$DW$689, DW_AT_type(*$C$DW$T$57)
    6705                      .dwattr $C$DW$689, DW_AT_name("ratedFlux_VpHz")
    6706                      .dwattr $C$DW$689, DW_AT_TI_symbol_name("_ratedFlux_VpHz")
    6707                      .dwattr $C$DW$689, DW_AT_data_member_location[DW_OP_plus_uconst 0xc]
    6708                      .dwattr $C$DW$689, DW_AT_accessibility(DW_ACCESS_public)
    6709                      .dwendtag $C$DW$T$70
    6710              
    6711              $C$DW$T$52      .dwtag  DW_TAG_typedef, DW_AT_name("MOTOR_Params")
    6712                      .dwattr $C$DW$T$52, DW_AT_type(*$C$DW$T$70)
    6713                      .dwattr $C$DW$T$52, DW_AT_language(DW_LANG_C)
    6714              
    6715              $C$DW$T$71      .dwtag  DW_TAG_structure_type
    6716                      .dwattr $C$DW$T$71, DW_AT_name("_PARK_Obj_")
    6717                      .dwattr $C$DW$T$71, DW_AT_byte_size(0x04)
    6718              $C$DW$690       .dwtag  DW_TAG_member
    6719                      .dwattr $C$DW$690, DW_AT_type(*$C$DW$T$20)
    6720                      .dwattr $C$DW$690, DW_AT_name("sinTh")
    6721                      .dwattr $C$DW$690, DW_AT_TI_symbol_name("_sinTh")
    6722                      .dwattr $C$DW$690, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    6723                      .dwattr $C$DW$690, DW_AT_accessibility(DW_ACCESS_public)
    6724              $C$DW$691       .dwtag  DW_TAG_member
    6725                      .dwattr $C$DW$691, DW_AT_type(*$C$DW$T$20)
    6726                      .dwattr $C$DW$691, DW_AT_name("cosTh")
    6727                      .dwattr $C$DW$691, DW_AT_TI_symbol_name("_cosTh")
    6728                      .dwattr $C$DW$691, DW_AT_data_member_location[DW_OP_plus_uconst 0x2]
TMS320C2000 Assembler PC v6.2.5 Sun Oct 08 22:38:44 2017

Tools Copyright (c) 1996-2014 Texas Instruments Incorporated
C:\Users\wmj\AppData\Local\Temp\0622810                              PAGE  136

    6729                      .dwattr $C$DW$691, DW_AT_accessibility(DW_ACCESS_public)
    6730                      .dwendtag $C$DW$T$71
    6731              
    6732              $C$DW$T$39      .dwtag  DW_TAG_typedef, DW_AT_name("PARK_Obj")
    6733                      .dwattr $C$DW$T$39, DW_AT_type(*$C$DW$T$71)
    6734                      .dwattr $C$DW$T$39, DW_AT_language(DW_LANG_C)
    6735              $C$DW$T$37      .dwtag  DW_TAG_pointer_type
    6736                      .dwattr $C$DW$T$37, DW_AT_type(*$C$DW$T$71)
    6737                      .dwattr $C$DW$T$37, DW_AT_address_class(0x16)
    6738              $C$DW$T$38      .dwtag  DW_TAG_typedef, DW_AT_name("PARK_Handle")
    6739                      .dwattr $C$DW$T$38, DW_AT_type(*$C$DW$T$37)
    6740                      .dwattr $C$DW$T$38, DW_AT_language(DW_LANG_C)
    6741              
    6742              $C$DW$T$72      .dwtag  DW_TAG_structure_type
    6743                      .dwattr $C$DW$T$72, DW_AT_name("_PID_Obj_")
    6744                      .dwattr $C$DW$T$72, DW_AT_byte_size(0x10)
    6745              $C$DW$692       .dwtag  DW_TAG_member
    6746                      .dwattr $C$DW$692, DW_AT_type(*$C$DW$T$20)
    6747                      .dwattr $C$DW$692, DW_AT_name("Kp")
    6748                      .dwattr $C$DW$692, DW_AT_TI_symbol_name("_Kp")
    6749                      .dwattr $C$DW$692, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    6750                      .dwattr $C$DW$692, DW_AT_accessibility(DW_ACCESS_public)
    6751              $C$DW$693       .dwtag  DW_TAG_member
    6752                      .dwattr $C$DW$693, DW_AT_type(*$C$DW$T$20)
    6753                      .dwattr $C$DW$693, DW_AT_name("Ki")
    6754                      .dwattr $C$DW$693, DW_AT_TI_symbol_name("_Ki")
    6755                      .dwattr $C$DW$693, DW_AT_data_member_location[DW_OP_plus_uconst 0x2]
    6756                      .dwattr $C$DW$693, DW_AT_accessibility(DW_ACCESS_public)
    6757              $C$DW$694       .dwtag  DW_TAG_member
    6758                      .dwattr $C$DW$694, DW_AT_type(*$C$DW$T$20)
    6759                      .dwattr $C$DW$694, DW_AT_name("Kd")
    6760                      .dwattr $C$DW$694, DW_AT_TI_symbol_name("_Kd")
    6761                      .dwattr $C$DW$694, DW_AT_data_member_location[DW_OP_plus_uconst 0x4]
    6762                      .dwattr $C$DW$694, DW_AT_accessibility(DW_ACCESS_public)
    6763              $C$DW$695       .dwtag  DW_TAG_member
    6764                      .dwattr $C$DW$695, DW_AT_type(*$C$DW$T$20)
    6765                      .dwattr $C$DW$695, DW_AT_name("Ui")
    6766                      .dwattr $C$DW$695, DW_AT_TI_symbol_name("_Ui")
    6767                      .dwattr $C$DW$695, DW_AT_data_member_location[DW_OP_plus_uconst 0x6]
    6768                      .dwattr $C$DW$695, DW_AT_accessibility(DW_ACCESS_public)
    6769              $C$DW$696       .dwtag  DW_TAG_member
    6770                      .dwattr $C$DW$696, DW_AT_type(*$C$DW$T$20)
    6771                      .dwattr $C$DW$696, DW_AT_name("refValue")
    6772                      .dwattr $C$DW$696, DW_AT_TI_symbol_name("_refValue")
    6773                      .dwattr $C$DW$696, DW_AT_data_member_location[DW_OP_plus_uconst 0x8]
    6774                      .dwattr $C$DW$696, DW_AT_accessibility(DW_ACCESS_public)
    6775              $C$DW$697       .dwtag  DW_TAG_member
    6776                      .dwattr $C$DW$697, DW_AT_type(*$C$DW$T$20)
    6777                      .dwattr $C$DW$697, DW_AT_name("fbackValue")
    6778                      .dwattr $C$DW$697, DW_AT_TI_symbol_name("_fbackValue")
    6779                      .dwattr $C$DW$697, DW_AT_data_member_location[DW_OP_plus_uconst 0xa]
    6780                      .dwattr $C$DW$697, DW_AT_accessibility(DW_ACCESS_public)
    6781              $C$DW$698       .dwtag  DW_TAG_member
    6782                      .dwattr $C$DW$698, DW_AT_type(*$C$DW$T$20)
    6783                      .dwattr $C$DW$698, DW_AT_name("outMin")
TMS320C2000 Assembler PC v6.2.5 Sun Oct 08 22:38:44 2017

Tools Copyright (c) 1996-2014 Texas Instruments Incorporated
C:\Users\wmj\AppData\Local\Temp\0622810                              PAGE  137

    6784                      .dwattr $C$DW$698, DW_AT_TI_symbol_name("_outMin")
    6785                      .dwattr $C$DW$698, DW_AT_data_member_location[DW_OP_plus_uconst 0xc]
    6786                      .dwattr $C$DW$698, DW_AT_accessibility(DW_ACCESS_public)
    6787              $C$DW$699       .dwtag  DW_TAG_member
    6788                      .dwattr $C$DW$699, DW_AT_type(*$C$DW$T$20)
    6789                      .dwattr $C$DW$699, DW_AT_name("outMax")
    6790                      .dwattr $C$DW$699, DW_AT_TI_symbol_name("_outMax")
    6791                      .dwattr $C$DW$699, DW_AT_data_member_location[DW_OP_plus_uconst 0xe]
    6792                      .dwattr $C$DW$699, DW_AT_accessibility(DW_ACCESS_public)
    6793                      .dwendtag $C$DW$T$72
    6794              
    6795              $C$DW$T$42      .dwtag  DW_TAG_typedef, DW_AT_name("PID_Obj")
    6796                      .dwattr $C$DW$T$42, DW_AT_type(*$C$DW$T$72)
    6797                      .dwattr $C$DW$T$42, DW_AT_language(DW_LANG_C)
    6798              $C$DW$T$40      .dwtag  DW_TAG_pointer_type
    6799                      .dwattr $C$DW$T$40, DW_AT_type(*$C$DW$T$72)
    6800                      .dwattr $C$DW$T$40, DW_AT_address_class(0x16)
    6801              $C$DW$T$41      .dwtag  DW_TAG_typedef, DW_AT_name("PID_Handle")
    6802                      .dwattr $C$DW$T$41, DW_AT_type(*$C$DW$T$40)
    6803                      .dwattr $C$DW$T$41, DW_AT_language(DW_LANG_C)
    6804              
    6805              $C$DW$T$73      .dwtag  DW_TAG_structure_type
    6806                      .dwattr $C$DW$T$73, DW_AT_name("_SVGEN_Obj_")
    6807                      .dwattr $C$DW$T$73, DW_AT_byte_size(0x02)
    6808              $C$DW$700       .dwtag  DW_TAG_member
    6809                      .dwattr $C$DW$700, DW_AT_type(*$C$DW$T$20)
    6810                      .dwattr $C$DW$700, DW_AT_name("maxModulation")
    6811                      .dwattr $C$DW$700, DW_AT_TI_symbol_name("_maxModulation")
    6812                      .dwattr $C$DW$700, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    6813                      .dwattr $C$DW$700, DW_AT_accessibility(DW_ACCESS_public)
    6814                      .dwendtag $C$DW$T$73
    6815              
    6816              $C$DW$T$48      .dwtag  DW_TAG_typedef, DW_AT_name("SVGEN_Obj")
    6817                      .dwattr $C$DW$T$48, DW_AT_type(*$C$DW$T$73)
    6818                      .dwattr $C$DW$T$48, DW_AT_language(DW_LANG_C)
    6819              $C$DW$T$46      .dwtag  DW_TAG_pointer_type
    6820                      .dwattr $C$DW$T$46, DW_AT_type(*$C$DW$T$73)
    6821                      .dwattr $C$DW$T$46, DW_AT_address_class(0x16)
    6822              $C$DW$T$47      .dwtag  DW_TAG_typedef, DW_AT_name("SVGEN_Handle")
    6823                      .dwattr $C$DW$T$47, DW_AT_type(*$C$DW$T$46)
    6824                      .dwattr $C$DW$T$47, DW_AT_language(DW_LANG_C)
    6825              
    6826              $C$DW$T$74      .dwtag  DW_TAG_structure_type
    6827                      .dwattr $C$DW$T$74, DW_AT_name("_TRAJ_Obj_")
    6828                      .dwattr $C$DW$T$74, DW_AT_byte_size(0x0a)
    6829              $C$DW$701       .dwtag  DW_TAG_member
    6830                      .dwattr $C$DW$701, DW_AT_type(*$C$DW$T$20)
    6831                      .dwattr $C$DW$701, DW_AT_name("targetValue")
    6832                      .dwattr $C$DW$701, DW_AT_TI_symbol_name("_targetValue")
    6833                      .dwattr $C$DW$701, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    6834                      .dwattr $C$DW$701, DW_AT_accessibility(DW_ACCESS_public)
    6835              $C$DW$702       .dwtag  DW_TAG_member
    6836                      .dwattr $C$DW$702, DW_AT_type(*$C$DW$T$20)
    6837                      .dwattr $C$DW$702, DW_AT_name("intValue")
    6838                      .dwattr $C$DW$702, DW_AT_TI_symbol_name("_intValue")
TMS320C2000 Assembler PC v6.2.5 Sun Oct 08 22:38:44 2017

Tools Copyright (c) 1996-2014 Texas Instruments Incorporated
C:\Users\wmj\AppData\Local\Temp\0622810                              PAGE  138

    6839                      .dwattr $C$DW$702, DW_AT_data_member_location[DW_OP_plus_uconst 0x2]
    6840                      .dwattr $C$DW$702, DW_AT_accessibility(DW_ACCESS_public)
    6841              $C$DW$703       .dwtag  DW_TAG_member
    6842                      .dwattr $C$DW$703, DW_AT_type(*$C$DW$T$20)
    6843                      .dwattr $C$DW$703, DW_AT_name("minValue")
    6844                      .dwattr $C$DW$703, DW_AT_TI_symbol_name("_minValue")
    6845                      .dwattr $C$DW$703, DW_AT_data_member_location[DW_OP_plus_uconst 0x4]
    6846                      .dwattr $C$DW$703, DW_AT_accessibility(DW_ACCESS_public)
    6847              $C$DW$704       .dwtag  DW_TAG_member
    6848                      .dwattr $C$DW$704, DW_AT_type(*$C$DW$T$20)
    6849                      .dwattr $C$DW$704, DW_AT_name("maxValue")
    6850                      .dwattr $C$DW$704, DW_AT_TI_symbol_name("_maxValue")
    6851                      .dwattr $C$DW$704, DW_AT_data_member_location[DW_OP_plus_uconst 0x6]
    6852                      .dwattr $C$DW$704, DW_AT_accessibility(DW_ACCESS_public)
    6853              $C$DW$705       .dwtag  DW_TAG_member
    6854                      .dwattr $C$DW$705, DW_AT_type(*$C$DW$T$20)
    6855                      .dwattr $C$DW$705, DW_AT_name("maxDelta")
    6856                      .dwattr $C$DW$705, DW_AT_TI_symbol_name("_maxDelta")
    6857                      .dwattr $C$DW$705, DW_AT_data_member_location[DW_OP_plus_uconst 0x8]
    6858                      .dwattr $C$DW$705, DW_AT_accessibility(DW_ACCESS_public)
    6859                      .dwendtag $C$DW$T$74
    6860              
    6861              $C$DW$T$51      .dwtag  DW_TAG_typedef, DW_AT_name("TRAJ_Obj")
    6862                      .dwattr $C$DW$T$51, DW_AT_type(*$C$DW$T$74)
    6863                      .dwattr $C$DW$T$51, DW_AT_language(DW_LANG_C)
    6864              $C$DW$T$49      .dwtag  DW_TAG_pointer_type
    6865                      .dwattr $C$DW$T$49, DW_AT_type(*$C$DW$T$74)
    6866                      .dwattr $C$DW$T$49, DW_AT_address_class(0x16)
    6867              $C$DW$T$50      .dwtag  DW_TAG_typedef, DW_AT_name("TRAJ_Handle")
    6868                      .dwattr $C$DW$T$50, DW_AT_type(*$C$DW$T$49)
    6869                      .dwattr $C$DW$T$50, DW_AT_language(DW_LANG_C)
    6870              
    6871              $C$DW$T$80      .dwtag  DW_TAG_structure_type
    6872                      .dwattr $C$DW$T$80, DW_AT_name("_USER_Params_")
    6873                      .dwattr $C$DW$T$80, DW_AT_byte_size(0xac)
    6874              $C$DW$706       .dwtag  DW_TAG_member
    6875                      .dwattr $C$DW$706, DW_AT_type(*$C$DW$T$57)
    6876                      .dwattr $C$DW$706, DW_AT_name("iqFullScaleCurrent_A")
    6877                      .dwattr $C$DW$706, DW_AT_TI_symbol_name("_iqFullScaleCurrent_A")
    6878                      .dwattr $C$DW$706, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    6879                      .dwattr $C$DW$706, DW_AT_accessibility(DW_ACCESS_public)
    6880              $C$DW$707       .dwtag  DW_TAG_member
    6881                      .dwattr $C$DW$707, DW_AT_type(*$C$DW$T$57)
    6882                      .dwattr $C$DW$707, DW_AT_name("iqFullScaleVoltage_V")
    6883                      .dwattr $C$DW$707, DW_AT_TI_symbol_name("_iqFullScaleVoltage_V")
    6884                      .dwattr $C$DW$707, DW_AT_data_member_location[DW_OP_plus_uconst 0x2]
    6885                      .dwattr $C$DW$707, DW_AT_accessibility(DW_ACCESS_public)
    6886              $C$DW$708       .dwtag  DW_TAG_member
    6887                      .dwattr $C$DW$708, DW_AT_type(*$C$DW$T$57)
    6888                      .dwattr $C$DW$708, DW_AT_name("iqFullScaleFreq_Hz")
    6889                      .dwattr $C$DW$708, DW_AT_TI_symbol_name("_iqFullScaleFreq_Hz")
    6890                      .dwattr $C$DW$708, DW_AT_data_member_location[DW_OP_plus_uconst 0x4]
    6891                      .dwattr $C$DW$708, DW_AT_accessibility(DW_ACCESS_public)
    6892              $C$DW$709       .dwtag  DW_TAG_member
    6893                      .dwattr $C$DW$709, DW_AT_type(*$C$DW$T$56)
TMS320C2000 Assembler PC v6.2.5 Sun Oct 08 22:38:44 2017

Tools Copyright (c) 1996-2014 Texas Instruments Incorporated
C:\Users\wmj\AppData\Local\Temp\0622810                              PAGE  139

    6894                      .dwattr $C$DW$709, DW_AT_name("numIsrTicksPerCtrlTick")
    6895                      .dwattr $C$DW$709, DW_AT_TI_symbol_name("_numIsrTicksPerCtrlTick")
    6896                      .dwattr $C$DW$709, DW_AT_data_member_location[DW_OP_plus_uconst 0x6]
    6897                      .dwattr $C$DW$709, DW_AT_accessibility(DW_ACCESS_public)
    6898              $C$DW$710       .dwtag  DW_TAG_member
    6899                      .dwattr $C$DW$710, DW_AT_type(*$C$DW$T$56)
    6900                      .dwattr $C$DW$710, DW_AT_name("numCtrlTicksPerCurrentTick")
    6901                      .dwattr $C$DW$710, DW_AT_TI_symbol_name("_numCtrlTicksPerCurrentTick")
    6902                      .dwattr $C$DW$710, DW_AT_data_member_location[DW_OP_plus_uconst 0x7]
    6903                      .dwattr $C$DW$710, DW_AT_accessibility(DW_ACCESS_public)
    6904              $C$DW$711       .dwtag  DW_TAG_member
    6905                      .dwattr $C$DW$711, DW_AT_type(*$C$DW$T$56)
    6906                      .dwattr $C$DW$711, DW_AT_name("numCtrlTicksPerEstTick")
    6907                      .dwattr $C$DW$711, DW_AT_TI_symbol_name("_numCtrlTicksPerEstTick")
    6908                      .dwattr $C$DW$711, DW_AT_data_member_location[DW_OP_plus_uconst 0x8]
    6909                      .dwattr $C$DW$711, DW_AT_accessibility(DW_ACCESS_public)
    6910              $C$DW$712       .dwtag  DW_TAG_member
    6911                      .dwattr $C$DW$712, DW_AT_type(*$C$DW$T$56)
    6912                      .dwattr $C$DW$712, DW_AT_name("numCtrlTicksPerSpeedTick")
    6913                      .dwattr $C$DW$712, DW_AT_TI_symbol_name("_numCtrlTicksPerSpeedTick")
    6914                      .dwattr $C$DW$712, DW_AT_data_member_location[DW_OP_plus_uconst 0x9]
    6915                      .dwattr $C$DW$712, DW_AT_accessibility(DW_ACCESS_public)
    6916              $C$DW$713       .dwtag  DW_TAG_member
    6917                      .dwattr $C$DW$713, DW_AT_type(*$C$DW$T$56)
    6918                      .dwattr $C$DW$713, DW_AT_name("numCtrlTicksPerTrajTick")
    6919                      .dwattr $C$DW$713, DW_AT_TI_symbol_name("_numCtrlTicksPerTrajTick")
    6920                      .dwattr $C$DW$713, DW_AT_data_member_location[DW_OP_plus_uconst 0xa]
    6921                      .dwattr $C$DW$713, DW_AT_accessibility(DW_ACCESS_public)
    6922              $C$DW$714       .dwtag  DW_TAG_member
    6923                      .dwattr $C$DW$714, DW_AT_type(*$C$DW$T$25)
    6924                      .dwattr $C$DW$714, DW_AT_name("numCurrentSensors")
    6925                      .dwattr $C$DW$714, DW_AT_TI_symbol_name("_numCurrentSensors")
    6926                      .dwattr $C$DW$714, DW_AT_data_member_location[DW_OP_plus_uconst 0xb]
    6927                      .dwattr $C$DW$714, DW_AT_accessibility(DW_ACCESS_public)
    6928              $C$DW$715       .dwtag  DW_TAG_member
    6929                      .dwattr $C$DW$715, DW_AT_type(*$C$DW$T$25)
    6930                      .dwattr $C$DW$715, DW_AT_name("numVoltageSensors")
    6931                      .dwattr $C$DW$715, DW_AT_TI_symbol_name("_numVoltageSensors")
    6932                      .dwattr $C$DW$715, DW_AT_data_member_location[DW_OP_plus_uconst 0xc]
    6933                      .dwattr $C$DW$715, DW_AT_accessibility(DW_ACCESS_public)
    6934              $C$DW$716       .dwtag  DW_TAG_member
    6935                      .dwattr $C$DW$716, DW_AT_type(*$C$DW$T$57)
    6936                      .dwattr $C$DW$716, DW_AT_name("offsetPole_rps")
    6937                      .dwattr $C$DW$716, DW_AT_TI_symbol_name("_offsetPole_rps")
    6938                      .dwattr $C$DW$716, DW_AT_data_member_location[DW_OP_plus_uconst 0xe]
    6939                      .dwattr $C$DW$716, DW_AT_accessibility(DW_ACCESS_public)
    6940              $C$DW$717       .dwtag  DW_TAG_member
    6941                      .dwattr $C$DW$717, DW_AT_type(*$C$DW$T$57)
    6942                      .dwattr $C$DW$717, DW_AT_name("fluxPole_rps")
    6943                      .dwattr $C$DW$717, DW_AT_TI_symbol_name("_fluxPole_rps")
    6944                      .dwattr $C$DW$717, DW_AT_data_member_location[DW_OP_plus_uconst 0x10]
    6945                      .dwattr $C$DW$717, DW_AT_accessibility(DW_ACCESS_public)
    6946              $C$DW$718       .dwtag  DW_TAG_member
    6947                      .dwattr $C$DW$718, DW_AT_type(*$C$DW$T$57)
    6948                      .dwattr $C$DW$718, DW_AT_name("zeroSpeedLimit")
TMS320C2000 Assembler PC v6.2.5 Sun Oct 08 22:38:44 2017

Tools Copyright (c) 1996-2014 Texas Instruments Incorporated
C:\Users\wmj\AppData\Local\Temp\0622810                              PAGE  140

    6949                      .dwattr $C$DW$718, DW_AT_TI_symbol_name("_zeroSpeedLimit")
    6950                      .dwattr $C$DW$718, DW_AT_data_member_location[DW_OP_plus_uconst 0x12]
    6951                      .dwattr $C$DW$718, DW_AT_accessibility(DW_ACCESS_public)
    6952              $C$DW$719       .dwtag  DW_TAG_member
    6953                      .dwattr $C$DW$719, DW_AT_type(*$C$DW$T$57)
    6954                      .dwattr $C$DW$719, DW_AT_name("forceAngleFreq_Hz")
    6955                      .dwattr $C$DW$719, DW_AT_TI_symbol_name("_forceAngleFreq_Hz")
    6956                      .dwattr $C$DW$719, DW_AT_data_member_location[DW_OP_plus_uconst 0x14]
    6957                      .dwattr $C$DW$719, DW_AT_accessibility(DW_ACCESS_public)
    6958              $C$DW$720       .dwtag  DW_TAG_member
    6959                      .dwattr $C$DW$720, DW_AT_type(*$C$DW$T$57)
    6960                      .dwattr $C$DW$720, DW_AT_name("maxAccel_Hzps")
    6961                      .dwattr $C$DW$720, DW_AT_TI_symbol_name("_maxAccel_Hzps")
    6962                      .dwattr $C$DW$720, DW_AT_data_member_location[DW_OP_plus_uconst 0x16]
    6963                      .dwattr $C$DW$720, DW_AT_accessibility(DW_ACCESS_public)
    6964              $C$DW$721       .dwtag  DW_TAG_member
    6965                      .dwattr $C$DW$721, DW_AT_type(*$C$DW$T$57)
    6966                      .dwattr $C$DW$721, DW_AT_name("maxAccel_est_Hzps")
    6967                      .dwattr $C$DW$721, DW_AT_TI_symbol_name("_maxAccel_est_Hzps")
    6968                      .dwattr $C$DW$721, DW_AT_data_member_location[DW_OP_plus_uconst 0x18]
    6969                      .dwattr $C$DW$721, DW_AT_accessibility(DW_ACCESS_public)
    6970              $C$DW$722       .dwtag  DW_TAG_member
    6971                      .dwattr $C$DW$722, DW_AT_type(*$C$DW$T$57)
    6972                      .dwattr $C$DW$722, DW_AT_name("directionPole_rps")
    6973                      .dwattr $C$DW$722, DW_AT_TI_symbol_name("_directionPole_rps")
    6974                      .dwattr $C$DW$722, DW_AT_data_member_location[DW_OP_plus_uconst 0x1a]
    6975                      .dwattr $C$DW$722, DW_AT_accessibility(DW_ACCESS_public)
    6976              $C$DW$723       .dwtag  DW_TAG_member
    6977                      .dwattr $C$DW$723, DW_AT_type(*$C$DW$T$57)
    6978                      .dwattr $C$DW$723, DW_AT_name("speedPole_rps")
    6979                      .dwattr $C$DW$723, DW_AT_TI_symbol_name("_speedPole_rps")
    6980                      .dwattr $C$DW$723, DW_AT_data_member_location[DW_OP_plus_uconst 0x1c]
    6981                      .dwattr $C$DW$723, DW_AT_accessibility(DW_ACCESS_public)
    6982              $C$DW$724       .dwtag  DW_TAG_member
    6983                      .dwattr $C$DW$724, DW_AT_type(*$C$DW$T$57)
    6984                      .dwattr $C$DW$724, DW_AT_name("dcBusPole_rps")
    6985                      .dwattr $C$DW$724, DW_AT_TI_symbol_name("_dcBusPole_rps")
    6986                      .dwattr $C$DW$724, DW_AT_data_member_location[DW_OP_plus_uconst 0x1e]
    6987                      .dwattr $C$DW$724, DW_AT_accessibility(DW_ACCESS_public)
    6988              $C$DW$725       .dwtag  DW_TAG_member
    6989                      .dwattr $C$DW$725, DW_AT_type(*$C$DW$T$57)
    6990                      .dwattr $C$DW$725, DW_AT_name("fluxFraction")
    6991                      .dwattr $C$DW$725, DW_AT_TI_symbol_name("_fluxFraction")
    6992                      .dwattr $C$DW$725, DW_AT_data_member_location[DW_OP_plus_uconst 0x20]
    6993                      .dwattr $C$DW$725, DW_AT_accessibility(DW_ACCESS_public)
    6994              $C$DW$726       .dwtag  DW_TAG_member
    6995                      .dwattr $C$DW$726, DW_AT_type(*$C$DW$T$57)
    6996                      .dwattr $C$DW$726, DW_AT_name("indEst_speedMaxFraction")
    6997                      .dwattr $C$DW$726, DW_AT_TI_symbol_name("_indEst_speedMaxFraction")
    6998                      .dwattr $C$DW$726, DW_AT_data_member_location[DW_OP_plus_uconst 0x22]
    6999                      .dwattr $C$DW$726, DW_AT_accessibility(DW_ACCESS_public)
    7000              $C$DW$727       .dwtag  DW_TAG_member
    7001                      .dwattr $C$DW$727, DW_AT_type(*$C$DW$T$57)
    7002                      .dwattr $C$DW$727, DW_AT_name("powerWarpGain")
    7003                      .dwattr $C$DW$727, DW_AT_TI_symbol_name("_powerWarpGain")
TMS320C2000 Assembler PC v6.2.5 Sun Oct 08 22:38:44 2017

Tools Copyright (c) 1996-2014 Texas Instruments Incorporated
C:\Users\wmj\AppData\Local\Temp\0622810                              PAGE  141

    7004                      .dwattr $C$DW$727, DW_AT_data_member_location[DW_OP_plus_uconst 0x24]
    7005                      .dwattr $C$DW$727, DW_AT_accessibility(DW_ACCESS_public)
    7006              $C$DW$728       .dwtag  DW_TAG_member
    7007                      .dwattr $C$DW$728, DW_AT_type(*$C$DW$T$56)
    7008                      .dwattr $C$DW$728, DW_AT_name("systemFreq_MHz")
    7009                      .dwattr $C$DW$728, DW_AT_TI_symbol_name("_systemFreq_MHz")
    7010                      .dwattr $C$DW$728, DW_AT_data_member_location[DW_OP_plus_uconst 0x26]
    7011                      .dwattr $C$DW$728, DW_AT_accessibility(DW_ACCESS_public)
    7012              $C$DW$729       .dwtag  DW_TAG_member
    7013                      .dwattr $C$DW$729, DW_AT_type(*$C$DW$T$57)
    7014                      .dwattr $C$DW$729, DW_AT_name("pwmPeriod_usec")
    7015                      .dwattr $C$DW$729, DW_AT_TI_symbol_name("_pwmPeriod_usec")
    7016                      .dwattr $C$DW$729, DW_AT_data_member_location[DW_OP_plus_uconst 0x28]
    7017                      .dwattr $C$DW$729, DW_AT_accessibility(DW_ACCESS_public)
    7018              $C$DW$730       .dwtag  DW_TAG_member
    7019                      .dwattr $C$DW$730, DW_AT_type(*$C$DW$T$57)
    7020                      .dwattr $C$DW$730, DW_AT_name("voltage_sf")
    7021                      .dwattr $C$DW$730, DW_AT_TI_symbol_name("_voltage_sf")
    7022                      .dwattr $C$DW$730, DW_AT_data_member_location[DW_OP_plus_uconst 0x2a]
    7023                      .dwattr $C$DW$730, DW_AT_accessibility(DW_ACCESS_public)
    7024              $C$DW$731       .dwtag  DW_TAG_member
    7025                      .dwattr $C$DW$731, DW_AT_type(*$C$DW$T$57)
    7026                      .dwattr $C$DW$731, DW_AT_name("current_sf")
    7027                      .dwattr $C$DW$731, DW_AT_TI_symbol_name("_current_sf")
    7028                      .dwattr $C$DW$731, DW_AT_data_member_location[DW_OP_plus_uconst 0x2c]
    7029                      .dwattr $C$DW$731, DW_AT_accessibility(DW_ACCESS_public)
    7030              $C$DW$732       .dwtag  DW_TAG_member
    7031                      .dwattr $C$DW$732, DW_AT_type(*$C$DW$T$57)
    7032                      .dwattr $C$DW$732, DW_AT_name("voltageFilterPole_rps")
    7033                      .dwattr $C$DW$732, DW_AT_TI_symbol_name("_voltageFilterPole_rps")
    7034                      .dwattr $C$DW$732, DW_AT_data_member_location[DW_OP_plus_uconst 0x2e]
    7035                      .dwattr $C$DW$732, DW_AT_accessibility(DW_ACCESS_public)
    7036              $C$DW$733       .dwtag  DW_TAG_member
    7037                      .dwattr $C$DW$733, DW_AT_type(*$C$DW$T$57)
    7038                      .dwattr $C$DW$733, DW_AT_name("maxVsMag_pu")
    7039                      .dwattr $C$DW$733, DW_AT_TI_symbol_name("_maxVsMag_pu")
    7040                      .dwattr $C$DW$733, DW_AT_data_member_location[DW_OP_plus_uconst 0x30]
    7041                      .dwattr $C$DW$733, DW_AT_accessibility(DW_ACCESS_public)
    7042              $C$DW$734       .dwtag  DW_TAG_member
    7043                      .dwattr $C$DW$734, DW_AT_type(*$C$DW$T$57)
    7044                      .dwattr $C$DW$734, DW_AT_name("estKappa")
    7045                      .dwattr $C$DW$734, DW_AT_TI_symbol_name("_estKappa")
    7046                      .dwattr $C$DW$734, DW_AT_data_member_location[DW_OP_plus_uconst 0x32]
    7047                      .dwattr $C$DW$734, DW_AT_accessibility(DW_ACCESS_public)
    7048              $C$DW$735       .dwtag  DW_TAG_member
    7049                      .dwattr $C$DW$735, DW_AT_type(*$C$DW$T$69)
    7050                      .dwattr $C$DW$735, DW_AT_name("motor_type")
    7051                      .dwattr $C$DW$735, DW_AT_TI_symbol_name("_motor_type")
    7052                      .dwattr $C$DW$735, DW_AT_data_member_location[DW_OP_plus_uconst 0x34]
    7053                      .dwattr $C$DW$735, DW_AT_accessibility(DW_ACCESS_public)
    7054              $C$DW$736       .dwtag  DW_TAG_member
    7055                      .dwattr $C$DW$736, DW_AT_type(*$C$DW$T$56)
    7056                      .dwattr $C$DW$736, DW_AT_name("motor_numPolePairs")
    7057                      .dwattr $C$DW$736, DW_AT_TI_symbol_name("_motor_numPolePairs")
    7058                      .dwattr $C$DW$736, DW_AT_data_member_location[DW_OP_plus_uconst 0x35]
TMS320C2000 Assembler PC v6.2.5 Sun Oct 08 22:38:44 2017

Tools Copyright (c) 1996-2014 Texas Instruments Incorporated
C:\Users\wmj\AppData\Local\Temp\0622810                              PAGE  142

    7059                      .dwattr $C$DW$736, DW_AT_accessibility(DW_ACCESS_public)
    7060              $C$DW$737       .dwtag  DW_TAG_member
    7061                      .dwattr $C$DW$737, DW_AT_type(*$C$DW$T$57)
    7062                      .dwattr $C$DW$737, DW_AT_name("motor_ratedFlux")
    7063                      .dwattr $C$DW$737, DW_AT_TI_symbol_name("_motor_ratedFlux")
    7064                      .dwattr $C$DW$737, DW_AT_data_member_location[DW_OP_plus_uconst 0x36]
    7065                      .dwattr $C$DW$737, DW_AT_accessibility(DW_ACCESS_public)
    7066              $C$DW$738       .dwtag  DW_TAG_member
    7067                      .dwattr $C$DW$738, DW_AT_type(*$C$DW$T$57)
    7068                      .dwattr $C$DW$738, DW_AT_name("motor_Rr")
    7069                      .dwattr $C$DW$738, DW_AT_TI_symbol_name("_motor_Rr")
    7070                      .dwattr $C$DW$738, DW_AT_data_member_location[DW_OP_plus_uconst 0x38]
    7071                      .dwattr $C$DW$738, DW_AT_accessibility(DW_ACCESS_public)
    7072              $C$DW$739       .dwtag  DW_TAG_member
    7073                      .dwattr $C$DW$739, DW_AT_type(*$C$DW$T$57)
    7074                      .dwattr $C$DW$739, DW_AT_name("motor_Rs")
    7075                      .dwattr $C$DW$739, DW_AT_TI_symbol_name("_motor_Rs")
    7076                      .dwattr $C$DW$739, DW_AT_data_member_location[DW_OP_plus_uconst 0x3a]
    7077                      .dwattr $C$DW$739, DW_AT_accessibility(DW_ACCESS_public)
    7078              $C$DW$740       .dwtag  DW_TAG_member
    7079                      .dwattr $C$DW$740, DW_AT_type(*$C$DW$T$57)
    7080                      .dwattr $C$DW$740, DW_AT_name("motor_Ls_d")
    7081                      .dwattr $C$DW$740, DW_AT_TI_symbol_name("_motor_Ls_d")
    7082                      .dwattr $C$DW$740, DW_AT_data_member_location[DW_OP_plus_uconst 0x3c]
    7083                      .dwattr $C$DW$740, DW_AT_accessibility(DW_ACCESS_public)
    7084              $C$DW$741       .dwtag  DW_TAG_member
    7085                      .dwattr $C$DW$741, DW_AT_type(*$C$DW$T$57)
    7086                      .dwattr $C$DW$741, DW_AT_name("motor_Ls_q")
    7087                      .dwattr $C$DW$741, DW_AT_TI_symbol_name("_motor_Ls_q")
    7088                      .dwattr $C$DW$741, DW_AT_data_member_location[DW_OP_plus_uconst 0x3e]
    7089                      .dwattr $C$DW$741, DW_AT_accessibility(DW_ACCESS_public)
    7090              $C$DW$742       .dwtag  DW_TAG_member
    7091                      .dwattr $C$DW$742, DW_AT_type(*$C$DW$T$57)
    7092                      .dwattr $C$DW$742, DW_AT_name("maxCurrent")
    7093                      .dwattr $C$DW$742, DW_AT_TI_symbol_name("_maxCurrent")
    7094                      .dwattr $C$DW$742, DW_AT_data_member_location[DW_OP_plus_uconst 0x40]
    7095                      .dwattr $C$DW$742, DW_AT_accessibility(DW_ACCESS_public)
    7096              $C$DW$743       .dwtag  DW_TAG_member
    7097                      .dwattr $C$DW$743, DW_AT_type(*$C$DW$T$57)
    7098                      .dwattr $C$DW$743, DW_AT_name("maxCurrent_resEst")
    7099                      .dwattr $C$DW$743, DW_AT_TI_symbol_name("_maxCurrent_resEst")
    7100                      .dwattr $C$DW$743, DW_AT_data_member_location[DW_OP_plus_uconst 0x42]
    7101                      .dwattr $C$DW$743, DW_AT_accessibility(DW_ACCESS_public)
    7102              $C$DW$744       .dwtag  DW_TAG_member
    7103                      .dwattr $C$DW$744, DW_AT_type(*$C$DW$T$57)
    7104                      .dwattr $C$DW$744, DW_AT_name("maxCurrent_indEst")
    7105                      .dwattr $C$DW$744, DW_AT_TI_symbol_name("_maxCurrent_indEst")
    7106                      .dwattr $C$DW$744, DW_AT_data_member_location[DW_OP_plus_uconst 0x44]
    7107                      .dwattr $C$DW$744, DW_AT_accessibility(DW_ACCESS_public)
    7108              $C$DW$745       .dwtag  DW_TAG_member
    7109                      .dwattr $C$DW$745, DW_AT_type(*$C$DW$T$57)
    7110                      .dwattr $C$DW$745, DW_AT_name("maxCurrentSlope")
    7111                      .dwattr $C$DW$745, DW_AT_TI_symbol_name("_maxCurrentSlope")
    7112                      .dwattr $C$DW$745, DW_AT_data_member_location[DW_OP_plus_uconst 0x46]
    7113                      .dwattr $C$DW$745, DW_AT_accessibility(DW_ACCESS_public)
TMS320C2000 Assembler PC v6.2.5 Sun Oct 08 22:38:44 2017

Tools Copyright (c) 1996-2014 Texas Instruments Incorporated
C:\Users\wmj\AppData\Local\Temp\0622810                              PAGE  143

    7114              $C$DW$746       .dwtag  DW_TAG_member
    7115                      .dwattr $C$DW$746, DW_AT_type(*$C$DW$T$57)
    7116                      .dwattr $C$DW$746, DW_AT_name("maxCurrentSlope_powerWarp")
    7117                      .dwattr $C$DW$746, DW_AT_TI_symbol_name("_maxCurrentSlope_powerWarp")
    7118                      .dwattr $C$DW$746, DW_AT_data_member_location[DW_OP_plus_uconst 0x48]
    7119                      .dwattr $C$DW$746, DW_AT_accessibility(DW_ACCESS_public)
