TMS320C2000 Assembler PC v6.2.5 Tue Nov 21 21:02:52 2017

Tools Copyright (c) 1996-2014 Texas Instruments Incorporated
C:\Users\wmj\AppData\Local\Temp\1032411                              PAGE    1

       1              ;***************************************************************
       2              ;* TMS320C2000 C/C++ Codegen                         PC v6.2.5 *
       3              ;* Date/Time created: Tue Nov 21 21:02:51 2017                 *
       4              ;***************************************************************
       5                      .compiler_opts --float_support=softlib --hll_source=on --mem_model:code=flat --mem_model:data=large -
       6        0002  FP      .set    XAR2
       7              
       8              $C$DW$CU        .dwtag  DW_TAG_compile_unit
       9                      .dwattr $C$DW$CU, DW_AT_name("D:/BM1000_v1.1/sw/modules/ctrl/src/32b/ctrl.c")
      10                      .dwattr $C$DW$CU, DW_AT_producer("TMS320C2000 C/C++ Codegen PC v6.2.5 Copyright (c) 1996-2014 Texas I
      11                      .dwattr $C$DW$CU, DW_AT_TI_version(0x01)
      12                      .dwattr $C$DW$CU, DW_AT_comp_dir("D:\BM1000_v1.1\sw\solutions\instaspin_foc\boards\hvkit_rev1p1\f28x\
      13              
      14              ;**************************************************************
      15              ;* FUNCTION SYNONYMS                                          *

    6576              $C$DW$614       .dwtag  DW_TAG_enumerator, DW_AT_name("USER_ErrorCode_estFreq_Hz_High"), DW_AT_const_value(0x
    6577              $C$DW$615       .dwtag  DW_TAG_enumerator, DW_AT_name("USER_ErrorCode_estFreq_Hz_Low"), DW_AT_const_value(0x6
    6578              $C$DW$616       .dwtag  DW_TAG_enumerator, DW_AT_name("USER_ErrorCode_RoverL_estFreq_Hz_High"), DW_AT_const_v
    6579              $C$DW$617       .dwtag  DW_TAG_enumerator, DW_AT_name("USER_ErrorCode_RoverL_estFreq_Hz_Low"), DW_AT_const_va
    6580              $C$DW$618       .dwtag  DW_TAG_enumerator, DW_AT_name("USER_ErrorCode_trajFreq_Hz_High"), DW_AT_const_value(0
    6581              $C$DW$619       .dwtag  DW_TAG_enumerator, DW_AT_name("USER_ErrorCode_trajFreq_Hz_Low"), DW_AT_const_value(0x
    6582              $C$DW$620       .dwtag  DW_TAG_enumerator, DW_AT_name("USER_ErrorCode_ctrlPeriod_sec_High"), DW_AT_const_valu
    6583              $C$DW$621       .dwtag  DW_TAG_enumerator, DW_AT_name("USER_ErrorCode_ctrlPeriod_sec_Low"), DW_AT_const_value
    6584              $C$DW$622       .dwtag  DW_TAG_enumerator, DW_AT_name("USER_ErrorCode_maxNegativeIdCurrent_a_High"), DW_AT_co
    6585              $C$DW$623       .dwtag  DW_TAG_enumerator, DW_AT_name("USER_ErrorCode_maxNegativeIdCurrent_a_Low"), DW_AT_con
    6586              $C$DW$624       .dwtag  DW_TAG_enumerator, DW_AT_name("USER_numErrorCodes"), DW_AT_const_value(0x6a)
    6587                      .dwendtag $C$DW$T$164
    6588              
    6589              $C$DW$T$165     .dwtag  DW_TAG_typedef, DW_AT_name("USER_ErrorCode_e")
    6590                      .dwattr $C$DW$T$165, DW_AT_type(*$C$DW$T$164)
    6591                      .dwattr $C$DW$T$165, DW_AT_language(DW_LANG_C)
    6592              
    6593              $C$DW$T$174     .dwtag  DW_TAG_enumeration_type
    6594                      .dwattr $C$DW$T$174, DW_AT_byte_size(0x01)
    6595              $C$DW$625       .dwtag  DW_TAG_enumerator, DW_AT_name("EST_State_Error"), DW_AT_const_value(0x00)
    6596              $C$DW$626       .dwtag  DW_TAG_enumerator, DW_AT_name("EST_State_Idle"), DW_AT_const_value(0x01)
    6597              $C$DW$627       .dwtag  DW_TAG_enumerator, DW_AT_name("EST_State_RoverL"), DW_AT_const_value(0x02)
    6598              $C$DW$628       .dwtag  DW_TAG_enumerator, DW_AT_name("EST_State_Rs"), DW_AT_const_value(0x03)
    6599              $C$DW$629       .dwtag  DW_TAG_enumerator, DW_AT_name("EST_State_RampUp"), DW_AT_const_value(0x04)
    6600              $C$DW$630       .dwtag  DW_TAG_enumerator, DW_AT_name("EST_State_IdRated"), DW_AT_const_value(0x05)
    6601              $C$DW$631       .dwtag  DW_TAG_enumerator, DW_AT_name("EST_State_RatedFlux_OL"), DW_AT_const_value(0x06)
    6602              $C$DW$632       .dwtag  DW_TAG_enumerator, DW_AT_name("EST_State_RatedFlux"), DW_AT_const_value(0x07)
    6603              $C$DW$633       .dwtag  DW_TAG_enumerator, DW_AT_name("EST_State_RampDown"), DW_AT_const_value(0x08)
    6604              $C$DW$634       .dwtag  DW_TAG_enumerator, DW_AT_name("EST_State_LockRotor"), DW_AT_const_value(0x09)
    6605              $C$DW$635       .dwtag  DW_TAG_enumerator, DW_AT_name("EST_State_Ls"), DW_AT_const_value(0x0a)
    6606              $C$DW$636       .dwtag  DW_TAG_enumerator, DW_AT_name("EST_State_Rr"), DW_AT_const_value(0x0b)
    6607              $C$DW$637       .dwtag  DW_TAG_enumerator, DW_AT_name("EST_State_MotorIdentified"), DW_AT_const_value(0x0c)
    6608              $C$DW$638       .dwtag  DW_TAG_enumerator, DW_AT_name("EST_State_OnLine"), DW_AT_const_value(0x0d)
    6609              $C$DW$639       .dwtag  DW_TAG_enumerator, DW_AT_name("EST_numStates"), DW_AT_const_value(0x0e)
    6610                      .dwendtag $C$DW$T$174
    6611              
    6612              $C$DW$T$175     .dwtag  DW_TAG_typedef, DW_AT_name("EST_State_e")
    6613                      .dwattr $C$DW$T$175, DW_AT_type(*$C$DW$T$174)
    6614                      .dwattr $C$DW$T$175, DW_AT_language(DW_LANG_C)
    6615              
    6616              $C$DW$T$179     .dwtag  DW_TAG_enumeration_type
    6617                      .dwattr $C$DW$T$179, DW_AT_byte_size(0x01)
    6618              $C$DW$640       .dwtag  DW_TAG_enumerator, DW_AT_name("CTRL_Type_PID_spd"), DW_AT_const_value(0x00)
    6619              $C$DW$641       .dwtag  DW_TAG_enumerator, DW_AT_name("CTRL_Type_PID_Id"), DW_AT_const_value(0x01)
    6620              $C$DW$642       .dwtag  DW_TAG_enumerator, DW_AT_name("CTRL_Type_PID_Iq"), DW_AT_const_value(0x02)
    6621                      .dwendtag $C$DW$T$179
    6622              
    6623              $C$DW$T$180     .dwtag  DW_TAG_typedef, DW_AT_name("CTRL_Type_e")
    6624                      .dwattr $C$DW$T$180, DW_AT_type(*$C$DW$T$179)
    6625                      .dwattr $C$DW$T$180, DW_AT_language(DW_LANG_C)
    6626              $C$DW$643       .dwtag  DW_TAG_TI_far_type
    6627                      .dwattr $C$DW$643, DW_AT_type(*$C$DW$T$180)
    6628              $C$DW$T$181     .dwtag  DW_TAG_const_type
TMS320C2000 Assembler PC v6.2.5 Tue Nov 21 21:02:52 2017

Tools Copyright (c) 1996-2014 Texas Instruments Incorporated
C:\Users\wmj\AppData\Local\Temp\1032411                              PAGE  128

    6629                      .dwattr $C$DW$T$181, DW_AT_type(*$C$DW$643)
    6630              
    6631              $C$DW$T$30      .dwtag  DW_TAG_structure_type
    6632                      .dwattr $C$DW$T$30, DW_AT_name("_ADC_Obj_")
    6633                      .dwattr $C$DW$T$30, DW_AT_byte_size(0x6650)
    6634              $C$DW$644       .dwtag  DW_TAG_member
    6635                      .dwattr $C$DW$644, DW_AT_type(*$C$DW$T$24)
    6636                      .dwattr $C$DW$644, DW_AT_name("ADCRESULT")
    6637                      .dwattr $C$DW$644, DW_AT_TI_symbol_name("_ADCRESULT")
    6638                      .dwattr $C$DW$644, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    6639                      .dwattr $C$DW$644, DW_AT_accessibility(DW_ACCESS_public)
    6640              $C$DW$645       .dwtag  DW_TAG_member
    6641                      .dwattr $C$DW$645, DW_AT_type(*$C$DW$T$25)
    6642                      .dwattr $C$DW$645, DW_AT_name("resvd_1")
    6643                      .dwattr $C$DW$645, DW_AT_TI_symbol_name("_resvd_1")
    6644                      .dwattr $C$DW$645, DW_AT_data_member_location[DW_OP_plus_uconst 0x10]
    6645                      .dwattr $C$DW$645, DW_AT_accessibility(DW_ACCESS_public)
    6646              $C$DW$646       .dwtag  DW_TAG_member
    6647                      .dwattr $C$DW$646, DW_AT_type(*$C$DW$T$23)
    6648                      .dwattr $C$DW$646, DW_AT_name("ADCCTL1")
    6649                      .dwattr $C$DW$646, DW_AT_TI_symbol_name("_ADCCTL1")
    6650                      .dwattr $C$DW$646, DW_AT_data_member_location[DW_OP_plus_uconst 0x6600]
    6651                      .dwattr $C$DW$646, DW_AT_accessibility(DW_ACCESS_public)
    6652              $C$DW$647       .dwtag  DW_TAG_member
    6653                      .dwattr $C$DW$647, DW_AT_type(*$C$DW$T$23)
    6654                      .dwattr $C$DW$647, DW_AT_name("ADCCTL2")
    6655                      .dwattr $C$DW$647, DW_AT_TI_symbol_name("_ADCCTL2")
    6656                      .dwattr $C$DW$647, DW_AT_data_member_location[DW_OP_plus_uconst 0x6601]
    6657                      .dwattr $C$DW$647, DW_AT_accessibility(DW_ACCESS_public)
    6658              $C$DW$648       .dwtag  DW_TAG_member
    6659                      .dwattr $C$DW$648, DW_AT_type(*$C$DW$T$26)
    6660                      .dwattr $C$DW$648, DW_AT_name("rsvd_2")
    6661                      .dwattr $C$DW$648, DW_AT_TI_symbol_name("_rsvd_2")
    6662                      .dwattr $C$DW$648, DW_AT_data_member_location[DW_OP_plus_uconst 0x6602]
    6663                      .dwattr $C$DW$648, DW_AT_accessibility(DW_ACCESS_public)
    6664              $C$DW$649       .dwtag  DW_TAG_member
    6665                      .dwattr $C$DW$649, DW_AT_type(*$C$DW$T$23)
    6666                      .dwattr $C$DW$649, DW_AT_name("ADCINTFLG")
    6667                      .dwattr $C$DW$649, DW_AT_TI_symbol_name("_ADCINTFLG")
    6668                      .dwattr $C$DW$649, DW_AT_data_member_location[DW_OP_plus_uconst 0x6604]
    6669                      .dwattr $C$DW$649, DW_AT_accessibility(DW_ACCESS_public)
    6670              $C$DW$650       .dwtag  DW_TAG_member
    6671                      .dwattr $C$DW$650, DW_AT_type(*$C$DW$T$23)
    6672                      .dwattr $C$DW$650, DW_AT_name("ADCINTFLGCLR")
    6673                      .dwattr $C$DW$650, DW_AT_TI_symbol_name("_ADCINTFLGCLR")
    6674                      .dwattr $C$DW$650, DW_AT_data_member_location[DW_OP_plus_uconst 0x6605]
    6675                      .dwattr $C$DW$650, DW_AT_accessibility(DW_ACCESS_public)
    6676              $C$DW$651       .dwtag  DW_TAG_member
    6677                      .dwattr $C$DW$651, DW_AT_type(*$C$DW$T$23)
    6678                      .dwattr $C$DW$651, DW_AT_name("ADCINTOVF")
    6679                      .dwattr $C$DW$651, DW_AT_TI_symbol_name("_ADCINTOVF")
    6680                      .dwattr $C$DW$651, DW_AT_data_member_location[DW_OP_plus_uconst 0x6606]
    6681                      .dwattr $C$DW$651, DW_AT_accessibility(DW_ACCESS_public)
    6682              $C$DW$652       .dwtag  DW_TAG_member
    6683                      .dwattr $C$DW$652, DW_AT_type(*$C$DW$T$23)
TMS320C2000 Assembler PC v6.2.5 Tue Nov 21 21:02:52 2017

Tools Copyright (c) 1996-2014 Texas Instruments Incorporated
C:\Users\wmj\AppData\Local\Temp\1032411                              PAGE  129

    6684                      .dwattr $C$DW$652, DW_AT_name("ADCINTOVFCLR")
    6685                      .dwattr $C$DW$652, DW_AT_TI_symbol_name("_ADCINTOVFCLR")
    6686                      .dwattr $C$DW$652, DW_AT_data_member_location[DW_OP_plus_uconst 0x6607]
    6687                      .dwattr $C$DW$652, DW_AT_accessibility(DW_ACCESS_public)
    6688              $C$DW$653       .dwtag  DW_TAG_member
    6689                      .dwattr $C$DW$653, DW_AT_type(*$C$DW$T$27)
    6690                      .dwattr $C$DW$653, DW_AT_name("INTSELxNy")
    6691                      .dwattr $C$DW$653, DW_AT_TI_symbol_name("_INTSELxNy")
    6692                      .dwattr $C$DW$653, DW_AT_data_member_location[DW_OP_plus_uconst 0x6608]
    6693                      .dwattr $C$DW$653, DW_AT_accessibility(DW_ACCESS_public)
    6694              $C$DW$654       .dwtag  DW_TAG_member
    6695                      .dwattr $C$DW$654, DW_AT_type(*$C$DW$T$28)
    6696                      .dwattr $C$DW$654, DW_AT_name("rsvd_3")
    6697                      .dwattr $C$DW$654, DW_AT_TI_symbol_name("_rsvd_3")
    6698                      .dwattr $C$DW$654, DW_AT_data_member_location[DW_OP_plus_uconst 0x660d]
    6699                      .dwattr $C$DW$654, DW_AT_accessibility(DW_ACCESS_public)
    6700              $C$DW$655       .dwtag  DW_TAG_member
    6701                      .dwattr $C$DW$655, DW_AT_type(*$C$DW$T$23)
    6702                      .dwattr $C$DW$655, DW_AT_name("SOCPRICTRL")
    6703                      .dwattr $C$DW$655, DW_AT_TI_symbol_name("_SOCPRICTRL")
    6704                      .dwattr $C$DW$655, DW_AT_data_member_location[DW_OP_plus_uconst 0x6610]
    6705                      .dwattr $C$DW$655, DW_AT_accessibility(DW_ACCESS_public)
    6706              $C$DW$656       .dwtag  DW_TAG_member
    6707                      .dwattr $C$DW$656, DW_AT_type(*$C$DW$T$23)
    6708                      .dwattr $C$DW$656, DW_AT_name("rsvd_4")
    6709                      .dwattr $C$DW$656, DW_AT_TI_symbol_name("_rsvd_4")
    6710                      .dwattr $C$DW$656, DW_AT_data_member_location[DW_OP_plus_uconst 0x6611]
    6711                      .dwattr $C$DW$656, DW_AT_accessibility(DW_ACCESS_public)
    6712              $C$DW$657       .dwtag  DW_TAG_member
    6713                      .dwattr $C$DW$657, DW_AT_type(*$C$DW$T$23)
    6714                      .dwattr $C$DW$657, DW_AT_name("ADCSAMPLEMODE")
    6715                      .dwattr $C$DW$657, DW_AT_TI_symbol_name("_ADCSAMPLEMODE")
    6716                      .dwattr $C$DW$657, DW_AT_data_member_location[DW_OP_plus_uconst 0x6612]
    6717                      .dwattr $C$DW$657, DW_AT_accessibility(DW_ACCESS_public)
    6718              $C$DW$658       .dwtag  DW_TAG_member
    6719                      .dwattr $C$DW$658, DW_AT_type(*$C$DW$T$23)
    6720                      .dwattr $C$DW$658, DW_AT_name("rsvd_5")
    6721                      .dwattr $C$DW$658, DW_AT_TI_symbol_name("_rsvd_5")
    6722                      .dwattr $C$DW$658, DW_AT_data_member_location[DW_OP_plus_uconst 0x6613]
    6723                      .dwattr $C$DW$658, DW_AT_accessibility(DW_ACCESS_public)
    6724              $C$DW$659       .dwtag  DW_TAG_member
    6725                      .dwattr $C$DW$659, DW_AT_type(*$C$DW$T$23)
    6726                      .dwattr $C$DW$659, DW_AT_name("ADCINTSOCSEL1")
    6727                      .dwattr $C$DW$659, DW_AT_TI_symbol_name("_ADCINTSOCSEL1")
    6728                      .dwattr $C$DW$659, DW_AT_data_member_location[DW_OP_plus_uconst 0x6614]
    6729                      .dwattr $C$DW$659, DW_AT_accessibility(DW_ACCESS_public)
    6730              $C$DW$660       .dwtag  DW_TAG_member
    6731                      .dwattr $C$DW$660, DW_AT_type(*$C$DW$T$23)
    6732                      .dwattr $C$DW$660, DW_AT_name("ADCINTSOCSEL2")
    6733                      .dwattr $C$DW$660, DW_AT_TI_symbol_name("_ADCINTSOCSEL2")
    6734                      .dwattr $C$DW$660, DW_AT_data_member_location[DW_OP_plus_uconst 0x6615]
    6735                      .dwattr $C$DW$660, DW_AT_accessibility(DW_ACCESS_public)
    6736              $C$DW$661       .dwtag  DW_TAG_member
    6737                      .dwattr $C$DW$661, DW_AT_type(*$C$DW$T$26)
    6738                      .dwattr $C$DW$661, DW_AT_name("rsvd_6")
TMS320C2000 Assembler PC v6.2.5 Tue Nov 21 21:02:52 2017

Tools Copyright (c) 1996-2014 Texas Instruments Incorporated
C:\Users\wmj\AppData\Local\Temp\1032411                              PAGE  130

    6739                      .dwattr $C$DW$661, DW_AT_TI_symbol_name("_rsvd_6")
    6740                      .dwattr $C$DW$661, DW_AT_data_member_location[DW_OP_plus_uconst 0x6616]
    6741                      .dwattr $C$DW$661, DW_AT_accessibility(DW_ACCESS_public)
    6742              $C$DW$662       .dwtag  DW_TAG_member
    6743                      .dwattr $C$DW$662, DW_AT_type(*$C$DW$T$23)
    6744                      .dwattr $C$DW$662, DW_AT_name("ADCSOCFLG1")
    6745                      .dwattr $C$DW$662, DW_AT_TI_symbol_name("_ADCSOCFLG1")
    6746                      .dwattr $C$DW$662, DW_AT_data_member_location[DW_OP_plus_uconst 0x6618]
    6747                      .dwattr $C$DW$662, DW_AT_accessibility(DW_ACCESS_public)
    6748              $C$DW$663       .dwtag  DW_TAG_member
    6749                      .dwattr $C$DW$663, DW_AT_type(*$C$DW$T$23)
    6750                      .dwattr $C$DW$663, DW_AT_name("rsvd_7")
    6751                      .dwattr $C$DW$663, DW_AT_TI_symbol_name("_rsvd_7")
    6752                      .dwattr $C$DW$663, DW_AT_data_member_location[DW_OP_plus_uconst 0x6619]
    6753                      .dwattr $C$DW$663, DW_AT_accessibility(DW_ACCESS_public)
    6754              $C$DW$664       .dwtag  DW_TAG_member
    6755                      .dwattr $C$DW$664, DW_AT_type(*$C$DW$T$23)
    6756                      .dwattr $C$DW$664, DW_AT_name("ADCSOCFRC1")
    6757                      .dwattr $C$DW$664, DW_AT_TI_symbol_name("_ADCSOCFRC1")
    6758                      .dwattr $C$DW$664, DW_AT_data_member_location[DW_OP_plus_uconst 0x661a]
    6759                      .dwattr $C$DW$664, DW_AT_accessibility(DW_ACCESS_public)
    6760              $C$DW$665       .dwtag  DW_TAG_member
    6761                      .dwattr $C$DW$665, DW_AT_type(*$C$DW$T$23)
    6762                      .dwattr $C$DW$665, DW_AT_name("rsvd_8")
    6763                      .dwattr $C$DW$665, DW_AT_TI_symbol_name("_rsvd_8")
    6764                      .dwattr $C$DW$665, DW_AT_data_member_location[DW_OP_plus_uconst 0x661b]
    6765                      .dwattr $C$DW$665, DW_AT_accessibility(DW_ACCESS_public)
    6766              $C$DW$666       .dwtag  DW_TAG_member
    6767                      .dwattr $C$DW$666, DW_AT_type(*$C$DW$T$23)
    6768                      .dwattr $C$DW$666, DW_AT_name("ADCSOCOVF1")
    6769                      .dwattr $C$DW$666, DW_AT_TI_symbol_name("_ADCSOCOVF1")
    6770                      .dwattr $C$DW$666, DW_AT_data_member_location[DW_OP_plus_uconst 0x661c]
    6771                      .dwattr $C$DW$666, DW_AT_accessibility(DW_ACCESS_public)
    6772              $C$DW$667       .dwtag  DW_TAG_member
    6773                      .dwattr $C$DW$667, DW_AT_type(*$C$DW$T$23)
    6774                      .dwattr $C$DW$667, DW_AT_name("rsvd_9")
    6775                      .dwattr $C$DW$667, DW_AT_TI_symbol_name("_rsvd_9")
    6776                      .dwattr $C$DW$667, DW_AT_data_member_location[DW_OP_plus_uconst 0x661d]
    6777                      .dwattr $C$DW$667, DW_AT_accessibility(DW_ACCESS_public)
    6778              $C$DW$668       .dwtag  DW_TAG_member
    6779                      .dwattr $C$DW$668, DW_AT_type(*$C$DW$T$23)
    6780                      .dwattr $C$DW$668, DW_AT_name("ADCSOCOVFCLR1")
    6781                      .dwattr $C$DW$668, DW_AT_TI_symbol_name("_ADCSOCOVFCLR1")
    6782                      .dwattr $C$DW$668, DW_AT_data_member_location[DW_OP_plus_uconst 0x661e]
    6783                      .dwattr $C$DW$668, DW_AT_accessibility(DW_ACCESS_public)
    6784              $C$DW$669       .dwtag  DW_TAG_member
    6785                      .dwattr $C$DW$669, DW_AT_type(*$C$DW$T$23)
    6786                      .dwattr $C$DW$669, DW_AT_name("rsvd_10")
    6787                      .dwattr $C$DW$669, DW_AT_TI_symbol_name("_rsvd_10")
    6788                      .dwattr $C$DW$669, DW_AT_data_member_location[DW_OP_plus_uconst 0x661f]
    6789                      .dwattr $C$DW$669, DW_AT_accessibility(DW_ACCESS_public)
    6790              $C$DW$670       .dwtag  DW_TAG_member
    6791                      .dwattr $C$DW$670, DW_AT_type(*$C$DW$T$24)
    6792                      .dwattr $C$DW$670, DW_AT_name("ADCSOCxCTL")
    6793                      .dwattr $C$DW$670, DW_AT_TI_symbol_name("_ADCSOCxCTL")
TMS320C2000 Assembler PC v6.2.5 Tue Nov 21 21:02:52 2017

Tools Copyright (c) 1996-2014 Texas Instruments Incorporated
C:\Users\wmj\AppData\Local\Temp\1032411                              PAGE  131

    6794                      .dwattr $C$DW$670, DW_AT_data_member_location[DW_OP_plus_uconst 0x6620]
    6795                      .dwattr $C$DW$670, DW_AT_accessibility(DW_ACCESS_public)
    6796              $C$DW$671       .dwtag  DW_TAG_member
    6797                      .dwattr $C$DW$671, DW_AT_type(*$C$DW$T$24)
    6798                      .dwattr $C$DW$671, DW_AT_name("rsvd_11")
    6799                      .dwattr $C$DW$671, DW_AT_TI_symbol_name("_rsvd_11")
    6800                      .dwattr $C$DW$671, DW_AT_data_member_location[DW_OP_plus_uconst 0x6630]
    6801                      .dwattr $C$DW$671, DW_AT_accessibility(DW_ACCESS_public)
    6802              $C$DW$672       .dwtag  DW_TAG_member
    6803                      .dwattr $C$DW$672, DW_AT_type(*$C$DW$T$23)
    6804                      .dwattr $C$DW$672, DW_AT_name("ADCREFTRIM")
    6805                      .dwattr $C$DW$672, DW_AT_TI_symbol_name("_ADCREFTRIM")
    6806                      .dwattr $C$DW$672, DW_AT_data_member_location[DW_OP_plus_uconst 0x6640]
    6807                      .dwattr $C$DW$672, DW_AT_accessibility(DW_ACCESS_public)
    6808              $C$DW$673       .dwtag  DW_TAG_member
    6809                      .dwattr $C$DW$673, DW_AT_type(*$C$DW$T$23)
    6810                      .dwattr $C$DW$673, DW_AT_name("ADCOFFTRIM")
    6811                      .dwattr $C$DW$673, DW_AT_TI_symbol_name("_ADCOFFTRIM")
    6812                      .dwattr $C$DW$673, DW_AT_data_member_location[DW_OP_plus_uconst 0x6641]
    6813                      .dwattr $C$DW$673, DW_AT_accessibility(DW_ACCESS_public)
    6814              $C$DW$674       .dwtag  DW_TAG_member
    6815                      .dwattr $C$DW$674, DW_AT_type(*$C$DW$T$29)
    6816                      .dwattr $C$DW$674, DW_AT_name("resvd_12")
    6817                      .dwattr $C$DW$674, DW_AT_TI_symbol_name("_resvd_12")
    6818                      .dwattr $C$DW$674, DW_AT_data_member_location[DW_OP_plus_uconst 0x6642]
    6819                      .dwattr $C$DW$674, DW_AT_accessibility(DW_ACCESS_public)
    6820              $C$DW$675       .dwtag  DW_TAG_member
    6821                      .dwattr $C$DW$675, DW_AT_type(*$C$DW$T$23)
    6822                      .dwattr $C$DW$675, DW_AT_name("ADCREV")
    6823                      .dwattr $C$DW$675, DW_AT_TI_symbol_name("_ADCREV")
    6824                      .dwattr $C$DW$675, DW_AT_data_member_location[DW_OP_plus_uconst 0x664f]
    6825                      .dwattr $C$DW$675, DW_AT_accessibility(DW_ACCESS_public)
    6826                      .dwendtag $C$DW$T$30
    6827              
    6828              $C$DW$T$86      .dwtag  DW_TAG_pointer_type
    6829                      .dwattr $C$DW$T$86, DW_AT_type(*$C$DW$T$30)
    6830                      .dwattr $C$DW$T$86, DW_AT_address_class(0x16)
    6831              $C$DW$T$87      .dwtag  DW_TAG_typedef, DW_AT_name("ADC_Handle")
    6832                      .dwattr $C$DW$T$87, DW_AT_type(*$C$DW$T$86)
    6833                      .dwattr $C$DW$T$87, DW_AT_language(DW_LANG_C)
    6834              
    6835              $C$DW$T$34      .dwtag  DW_TAG_structure_type
    6836                      .dwattr $C$DW$T$34, DW_AT_name("_BRAKE_Obj_")
    6837                      .dwattr $C$DW$T$34, DW_AT_byte_size(0x08)
    6838              $C$DW$676       .dwtag  DW_TAG_member
    6839                      .dwattr $C$DW$676, DW_AT_type(*$C$DW$T$31)
    6840                      .dwattr $C$DW$676, DW_AT_name("angle_pu")
    6841                      .dwattr $C$DW$676, DW_AT_TI_symbol_name("_angle_pu")
    6842                      .dwattr $C$DW$676, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    6843                      .dwattr $C$DW$676, DW_AT_accessibility(DW_ACCESS_public)
    6844              $C$DW$677       .dwtag  DW_TAG_member
    6845                      .dwattr $C$DW$677, DW_AT_type(*$C$DW$T$32)
    6846                      .dwattr $C$DW$677, DW_AT_name("Idq_brake")
    6847                      .dwattr $C$DW$677, DW_AT_TI_symbol_name("_Idq_brake")
    6848                      .dwattr $C$DW$677, DW_AT_data_member_location[DW_OP_plus_uconst 0x2]
TMS320C2000 Assembler PC v6.2.5 Tue Nov 21 21:02:52 2017

Tools Copyright (c) 1996-2014 Texas Instruments Incorporated
C:\Users\wmj\AppData\Local\Temp\1032411                              PAGE  132

    6849                      .dwattr $C$DW$677, DW_AT_accessibility(DW_ACCESS_public)
    6850              $C$DW$678       .dwtag  DW_TAG_member
    6851                      .dwattr $C$DW$678, DW_AT_type(*$C$DW$T$33)
    6852                      .dwattr $C$DW$678, DW_AT_name("brake_enable")
    6853                      .dwattr $C$DW$678, DW_AT_TI_symbol_name("_brake_enable")
    6854                      .dwattr $C$DW$678, DW_AT_data_member_location[DW_OP_plus_uconst 0x6]
    6855                      .dwattr $C$DW$678, DW_AT_accessibility(DW_ACCESS_public)
    6856                      .dwendtag $C$DW$T$34
    6857              
    6858              $C$DW$T$73      .dwtag  DW_TAG_typedef, DW_AT_name("BRAKE_Obj")
    6859                      .dwattr $C$DW$T$73, DW_AT_type(*$C$DW$T$34)
    6860                      .dwattr $C$DW$T$73, DW_AT_language(DW_LANG_C)
    6861              $C$DW$T$71      .dwtag  DW_TAG_pointer_type
    6862                      .dwattr $C$DW$T$71, DW_AT_type(*$C$DW$T$34)
    6863                      .dwattr $C$DW$T$71, DW_AT_address_class(0x16)
    6864              $C$DW$T$72      .dwtag  DW_TAG_typedef, DW_AT_name("BRAKE_Handle")
    6865                      .dwattr $C$DW$T$72, DW_AT_type(*$C$DW$T$71)
    6866                      .dwattr $C$DW$T$72, DW_AT_language(DW_LANG_C)
    6867              
    6868              $C$DW$T$36      .dwtag  DW_TAG_structure_type
    6869                      .dwattr $C$DW$T$36, DW_AT_name("_CLARKE_Obj_")
    6870                      .dwattr $C$DW$T$36, DW_AT_byte_size(0x06)
    6871              $C$DW$679       .dwtag  DW_TAG_member
    6872                      .dwattr $C$DW$679, DW_AT_type(*$C$DW$T$31)
    6873                      .dwattr $C$DW$679, DW_AT_name("alpha_sf")
    6874                      .dwattr $C$DW$679, DW_AT_TI_symbol_name("_alpha_sf")
    6875                      .dwattr $C$DW$679, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    6876                      .dwattr $C$DW$679, DW_AT_accessibility(DW_ACCESS_public)
    6877              $C$DW$680       .dwtag  DW_TAG_member
    6878                      .dwattr $C$DW$680, DW_AT_type(*$C$DW$T$31)
    6879                      .dwattr $C$DW$680, DW_AT_name("beta_sf")
    6880                      .dwattr $C$DW$680, DW_AT_TI_symbol_name("_beta_sf")
    6881                      .dwattr $C$DW$680, DW_AT_data_member_location[DW_OP_plus_uconst 0x2]
    6882                      .dwattr $C$DW$680, DW_AT_accessibility(DW_ACCESS_public)
    6883              $C$DW$681       .dwtag  DW_TAG_member
    6884                      .dwattr $C$DW$681, DW_AT_type(*$C$DW$T$35)
    6885                      .dwattr $C$DW$681, DW_AT_name("numSensors")
    6886                      .dwattr $C$DW$681, DW_AT_TI_symbol_name("_numSensors")
    6887                      .dwattr $C$DW$681, DW_AT_data_member_location[DW_OP_plus_uconst 0x4]
    6888                      .dwattr $C$DW$681, DW_AT_accessibility(DW_ACCESS_public)
    6889                      .dwendtag $C$DW$T$36
    6890              
    6891              $C$DW$T$47      .dwtag  DW_TAG_typedef, DW_AT_name("CLARKE_Obj")
    6892                      .dwattr $C$DW$T$47, DW_AT_type(*$C$DW$T$36)
    6893                      .dwattr $C$DW$T$47, DW_AT_language(DW_LANG_C)
    6894              $C$DW$T$187     .dwtag  DW_TAG_pointer_type
    6895                      .dwattr $C$DW$T$187, DW_AT_type(*$C$DW$T$47)
    6896                      .dwattr $C$DW$T$187, DW_AT_address_class(0x16)
    6897              $C$DW$T$45      .dwtag  DW_TAG_pointer_type
    6898                      .dwattr $C$DW$T$45, DW_AT_type(*$C$DW$T$36)
    6899                      .dwattr $C$DW$T$45, DW_AT_address_class(0x16)
    6900              $C$DW$T$46      .dwtag  DW_TAG_typedef, DW_AT_name("CLARKE_Handle")
    6901                      .dwattr $C$DW$T$46, DW_AT_type(*$C$DW$T$45)
    6902                      .dwattr $C$DW$T$46, DW_AT_language(DW_LANG_C)
    6903              
TMS320C2000 Assembler PC v6.2.5 Tue Nov 21 21:02:52 2017

Tools Copyright (c) 1996-2014 Texas Instruments Incorporated
C:\Users\wmj\AppData\Local\Temp\1032411                              PAGE  133

    6904              $C$DW$T$38      .dwtag  DW_TAG_structure_type
    6905                      .dwattr $C$DW$T$38, DW_AT_name("_CLK_Obj_")
    6906                      .dwattr $C$DW$T$38, DW_AT_byte_size(0x11)
    6907              $C$DW$682       .dwtag  DW_TAG_member
    6908                      .dwattr $C$DW$682, DW_AT_type(*$C$DW$T$23)
    6909                      .dwattr $C$DW$682, DW_AT_name("XCLK")
    6910                      .dwattr $C$DW$682, DW_AT_TI_symbol_name("_XCLK")
    6911                      .dwattr $C$DW$682, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    6912                      .dwattr $C$DW$682, DW_AT_accessibility(DW_ACCESS_public)
    6913              $C$DW$683       .dwtag  DW_TAG_member
    6914                      .dwattr $C$DW$683, DW_AT_type(*$C$DW$T$23)
    6915                      .dwattr $C$DW$683, DW_AT_name("rsvd_1")
    6916                      .dwattr $C$DW$683, DW_AT_TI_symbol_name("_rsvd_1")
    6917                      .dwattr $C$DW$683, DW_AT_data_member_location[DW_OP_plus_uconst 0x1]
    6918                      .dwattr $C$DW$683, DW_AT_accessibility(DW_ACCESS_public)
    6919              $C$DW$684       .dwtag  DW_TAG_member
    6920                      .dwattr $C$DW$684, DW_AT_type(*$C$DW$T$23)
    6921                      .dwattr $C$DW$684, DW_AT_name("CLKCTL")
    6922                      .dwattr $C$DW$684, DW_AT_TI_symbol_name("_CLKCTL")
    6923                      .dwattr $C$DW$684, DW_AT_data_member_location[DW_OP_plus_uconst 0x2]
    6924                      .dwattr $C$DW$684, DW_AT_accessibility(DW_ACCESS_public)
    6925              $C$DW$685       .dwtag  DW_TAG_member
    6926                      .dwattr $C$DW$685, DW_AT_type(*$C$DW$T$37)
    6927                      .dwattr $C$DW$685, DW_AT_name("rsvd_2")
    6928                      .dwattr $C$DW$685, DW_AT_TI_symbol_name("_rsvd_2")
    6929                      .dwattr $C$DW$685, DW_AT_data_member_location[DW_OP_plus_uconst 0x3]
    6930                      .dwattr $C$DW$685, DW_AT_accessibility(DW_ACCESS_public)
    6931              $C$DW$686       .dwtag  DW_TAG_member
    6932                      .dwattr $C$DW$686, DW_AT_type(*$C$DW$T$23)
    6933                      .dwattr $C$DW$686, DW_AT_name("LOSPCP")
    6934                      .dwattr $C$DW$686, DW_AT_TI_symbol_name("_LOSPCP")
    6935                      .dwattr $C$DW$686, DW_AT_data_member_location[DW_OP_plus_uconst 0xb]
    6936                      .dwattr $C$DW$686, DW_AT_accessibility(DW_ACCESS_public)
    6937              $C$DW$687       .dwtag  DW_TAG_member
    6938                      .dwattr $C$DW$687, DW_AT_type(*$C$DW$T$23)
    6939                      .dwattr $C$DW$687, DW_AT_name("PCLKCR0")
    6940                      .dwattr $C$DW$687, DW_AT_TI_symbol_name("_PCLKCR0")
    6941                      .dwattr $C$DW$687, DW_AT_data_member_location[DW_OP_plus_uconst 0xc]
    6942                      .dwattr $C$DW$687, DW_AT_accessibility(DW_ACCESS_public)
    6943              $C$DW$688       .dwtag  DW_TAG_member
    6944                      .dwattr $C$DW$688, DW_AT_type(*$C$DW$T$23)
    6945                      .dwattr $C$DW$688, DW_AT_name("PCLKCR1")
    6946                      .dwattr $C$DW$688, DW_AT_TI_symbol_name("_PCLKCR1")
    6947                      .dwattr $C$DW$688, DW_AT_data_member_location[DW_OP_plus_uconst 0xd]
    6948                      .dwattr $C$DW$688, DW_AT_accessibility(DW_ACCESS_public)
    6949              $C$DW$689       .dwtag  DW_TAG_member
    6950                      .dwattr $C$DW$689, DW_AT_type(*$C$DW$T$26)
    6951                      .dwattr $C$DW$689, DW_AT_name("rsvd_3")
    6952                      .dwattr $C$DW$689, DW_AT_TI_symbol_name("_rsvd_3")
    6953                      .dwattr $C$DW$689, DW_AT_data_member_location[DW_OP_plus_uconst 0xe]
    6954                      .dwattr $C$DW$689, DW_AT_accessibility(DW_ACCESS_public)
    6955              $C$DW$690       .dwtag  DW_TAG_member
    6956                      .dwattr $C$DW$690, DW_AT_type(*$C$DW$T$23)
    6957                      .dwattr $C$DW$690, DW_AT_name("PCLKCR3")
    6958                      .dwattr $C$DW$690, DW_AT_TI_symbol_name("_PCLKCR3")
TMS320C2000 Assembler PC v6.2.5 Tue Nov 21 21:02:52 2017

Tools Copyright (c) 1996-2014 Texas Instruments Incorporated
C:\Users\wmj\AppData\Local\Temp\1032411                              PAGE  134

    6959                      .dwattr $C$DW$690, DW_AT_data_member_location[DW_OP_plus_uconst 0x10]
    6960                      .dwattr $C$DW$690, DW_AT_accessibility(DW_ACCESS_public)
    6961                      .dwendtag $C$DW$T$38
    6962              
    6963              $C$DW$T$88      .dwtag  DW_TAG_pointer_type
    6964                      .dwattr $C$DW$T$88, DW_AT_type(*$C$DW$T$38)
    6965                      .dwattr $C$DW$T$88, DW_AT_address_class(0x16)
    6966              $C$DW$T$89      .dwtag  DW_TAG_typedef, DW_AT_name("CLK_Handle")
    6967                      .dwattr $C$DW$T$89, DW_AT_type(*$C$DW$T$88)
    6968                      .dwattr $C$DW$T$89, DW_AT_language(DW_LANG_C)
    6969              
    6970              $C$DW$T$39      .dwtag  DW_TAG_structure_type
    6971                      .dwattr $C$DW$T$39, DW_AT_name("_CPU_Obj_")
    6972                      .dwattr $C$DW$T$39, DW_AT_byte_size(0x01)
    6973              $C$DW$691       .dwtag  DW_TAG_member
    6974                      .dwattr $C$DW$691, DW_AT_type(*$C$DW$T$35)
    6975                      .dwattr $C$DW$691, DW_AT_name("tmp")
    6976                      .dwattr $C$DW$691, DW_AT_TI_symbol_name("_tmp")
    6977                      .dwattr $C$DW$691, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    6978                      .dwattr $C$DW$691, DW_AT_accessibility(DW_ACCESS_public)
    6979                      .dwendtag $C$DW$T$39
    6980              
    6981              $C$DW$T$90      .dwtag  DW_TAG_pointer_type
    6982                      .dwattr $C$DW$T$90, DW_AT_type(*$C$DW$T$39)
    6983                      .dwattr $C$DW$T$90, DW_AT_address_class(0x16)
    6984              $C$DW$T$91      .dwtag  DW_TAG_typedef, DW_AT_name("CPU_Handle")
    6985                      .dwattr $C$DW$T$91, DW_AT_type(*$C$DW$T$90)
    6986                      .dwattr $C$DW$T$91, DW_AT_language(DW_LANG_C)
    6987              
    6988              $C$DW$T$74      .dwtag  DW_TAG_structure_type
    6989                      .dwattr $C$DW$T$74, DW_AT_name("_CTRL_Obj_")
    6990                      .dwattr $C$DW$T$74, DW_AT_byte_size(0x108)
    6991              $C$DW$692       .dwtag  DW_TAG_member
    6992                      .dwattr $C$DW$692, DW_AT_type(*$C$DW$T$40)
    6993                      .dwattr $C$DW$692, DW_AT_name("version")
    6994                      .dwattr $C$DW$692, DW_AT_TI_symbol_name("_version")
    6995                      .dwattr $C$DW$692, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    6996                      .dwattr $C$DW$692, DW_AT_accessibility(DW_ACCESS_public)
    6997              $C$DW$693       .dwtag  DW_TAG_member
    6998                      .dwattr $C$DW$693, DW_AT_type(*$C$DW$T$42)
    6999                      .dwattr $C$DW$693, DW_AT_name("state")
    7000                      .dwattr $C$DW$693, DW_AT_TI_symbol_name("_state")
    7001                      .dwattr $C$DW$693, DW_AT_data_member_location[DW_OP_plus_uconst 0x4]
    7002                      .dwattr $C$DW$693, DW_AT_accessibility(DW_ACCESS_public)
    7003              $C$DW$694       .dwtag  DW_TAG_member
    7004                      .dwattr $C$DW$694, DW_AT_type(*$C$DW$T$42)
    7005                      .dwattr $C$DW$694, DW_AT_name("prevState")
    7006                      .dwattr $C$DW$694, DW_AT_TI_symbol_name("_prevState")
    7007                      .dwattr $C$DW$694, DW_AT_data_member_location[DW_OP_plus_uconst 0x5]
    7008                      .dwattr $C$DW$694, DW_AT_accessibility(DW_ACCESS_public)
    7009              $C$DW$695       .dwtag  DW_TAG_member
    7010                      .dwattr $C$DW$695, DW_AT_type(*$C$DW$T$44)
    7011                      .dwattr $C$DW$695, DW_AT_name("errorCode")
    7012                      .dwattr $C$DW$695, DW_AT_TI_symbol_name("_errorCode")
    7013                      .dwattr $C$DW$695, DW_AT_data_member_location[DW_OP_plus_uconst 0x6]
TMS320C2000 Assembler PC v6.2.5 Tue Nov 21 21:02:52 2017

Tools Copyright (c) 1996-2014 Texas Instruments Incorporated
C:\Users\wmj\AppData\Local\Temp\1032411                              PAGE  135

    7014                      .dwattr $C$DW$695, DW_AT_accessibility(DW_ACCESS_public)
    7015              $C$DW$696       .dwtag  DW_TAG_member
    7016                      .dwattr $C$DW$696, DW_AT_type(*$C$DW$T$46)
    7017                      .dwattr $C$DW$696, DW_AT_name("clarkeHandle_I")
    7018                      .dwattr $C$DW$696, DW_AT_TI_symbol_name("_clarkeHandle_I")
    7019                      .dwattr $C$DW$696, DW_AT_data_member_location[DW_OP_plus_uconst 0x8]
    7020                      .dwattr $C$DW$696, DW_AT_accessibility(DW_ACCESS_public)
    7021              $C$DW$697       .dwtag  DW_TAG_member
    7022                      .dwattr $C$DW$697, DW_AT_type(*$C$DW$T$47)
    7023                      .dwattr $C$DW$697, DW_AT_name("clarke_I")
    7024                      .dwattr $C$DW$697, DW_AT_TI_symbol_name("_clarke_I")
    7025                      .dwattr $C$DW$697, DW_AT_data_member_location[DW_OP_plus_uconst 0xa]
    7026                      .dwattr $C$DW$697, DW_AT_accessibility(DW_ACCESS_public)
    7027              $C$DW$698       .dwtag  DW_TAG_member
    7028                      .dwattr $C$DW$698, DW_AT_type(*$C$DW$T$46)
    7029                      .dwattr $C$DW$698, DW_AT_name("clarkeHandle_V")
    7030                      .dwattr $C$DW$698, DW_AT_TI_symbol_name("_clarkeHandle_V")
    7031                      .dwattr $C$DW$698, DW_AT_data_member_location[DW_OP_plus_uconst 0x10]
    7032                      .dwattr $C$DW$698, DW_AT_accessibility(DW_ACCESS_public)
    7033              $C$DW$699       .dwtag  DW_TAG_member
    7034                      .dwattr $C$DW$699, DW_AT_type(*$C$DW$T$47)
    7035                      .dwattr $C$DW$699, DW_AT_name("clarke_V")
    7036                      .dwattr $C$DW$699, DW_AT_TI_symbol_name("_clarke_V")
    7037                      .dwattr $C$DW$699, DW_AT_data_member_location[DW_OP_plus_uconst 0x12]
    7038                      .dwattr $C$DW$699, DW_AT_accessibility(DW_ACCESS_public)
    7039              $C$DW$700       .dwtag  DW_TAG_member
    7040                      .dwattr $C$DW$700, DW_AT_type(*$C$DW$T$49)
    7041                      .dwattr $C$DW$700, DW_AT_name("estHandle")
    7042                      .dwattr $C$DW$700, DW_AT_TI_symbol_name("_estHandle")
    7043                      .dwattr $C$DW$700, DW_AT_data_member_location[DW_OP_plus_uconst 0x18]
    7044                      .dwattr $C$DW$700, DW_AT_accessibility(DW_ACCESS_public)
    7045              $C$DW$701       .dwtag  DW_TAG_member
    7046                      .dwattr $C$DW$701, DW_AT_type(*$C$DW$T$51)
    7047                      .dwattr $C$DW$701, DW_AT_name("parkHandle")
    7048                      .dwattr $C$DW$701, DW_AT_TI_symbol_name("_parkHandle")
    7049                      .dwattr $C$DW$701, DW_AT_data_member_location[DW_OP_plus_uconst 0x1a]
    7050                      .dwattr $C$DW$701, DW_AT_accessibility(DW_ACCESS_public)
    7051              $C$DW$702       .dwtag  DW_TAG_member
    7052                      .dwattr $C$DW$702, DW_AT_type(*$C$DW$T$52)
    7053                      .dwattr $C$DW$702, DW_AT_name("park")
    7054                      .dwattr $C$DW$702, DW_AT_TI_symbol_name("_park")
    7055                      .dwattr $C$DW$702, DW_AT_data_member_location[DW_OP_plus_uconst 0x1c]
    7056                      .dwattr $C$DW$702, DW_AT_accessibility(DW_ACCESS_public)
    7057              $C$DW$703       .dwtag  DW_TAG_member
    7058                      .dwattr $C$DW$703, DW_AT_type(*$C$DW$T$54)
    7059                      .dwattr $C$DW$703, DW_AT_name("pidHandle_Id")
    7060                      .dwattr $C$DW$703, DW_AT_TI_symbol_name("_pidHandle_Id")
    7061                      .dwattr $C$DW$703, DW_AT_data_member_location[DW_OP_plus_uconst 0x20]
    7062                      .dwattr $C$DW$703, DW_AT_accessibility(DW_ACCESS_public)
    7063              $C$DW$704       .dwtag  DW_TAG_member
    7064                      .dwattr $C$DW$704, DW_AT_type(*$C$DW$T$55)
    7065                      .dwattr $C$DW$704, DW_AT_name("pid_Id")
    7066                      .dwattr $C$DW$704, DW_AT_TI_symbol_name("_pid_Id")
    7067                      .dwattr $C$DW$704, DW_AT_data_member_location[DW_OP_plus_uconst 0x22]
    7068                      .dwattr $C$DW$704, DW_AT_accessibility(DW_ACCESS_public)
TMS320C2000 Assembler PC v6.2.5 Tue Nov 21 21:02:52 2017

Tools Copyright (c) 1996-2014 Texas Instruments Incorporated
C:\Users\wmj\AppData\Local\Temp\1032411                              PAGE  136

    7069              $C$DW$705       .dwtag  DW_TAG_member
    7070                      .dwattr $C$DW$705, DW_AT_type(*$C$DW$T$54)
    7071                      .dwattr $C$DW$705, DW_AT_name("pidHandle_Iq")
    7072                      .dwattr $C$DW$705, DW_AT_TI_symbol_name("_pidHandle_Iq")
    7073                      .dwattr $C$DW$705, DW_AT_data_member_location[DW_OP_plus_uconst 0x32]
    7074                      .dwattr $C$DW$705, DW_AT_accessibility(DW_ACCESS_public)
    7075              $C$DW$706       .dwtag  DW_TAG_member
    7076                      .dwattr $C$DW$706, DW_AT_type(*$C$DW$T$55)
    7077                      .dwattr $C$DW$706, DW_AT_name("pid_Iq")
    7078                      .dwattr $C$DW$706, DW_AT_TI_symbol_name("_pid_Iq")
    7079                      .dwattr $C$DW$706, DW_AT_data_member_location[DW_OP_plus_uconst 0x34]
    7080                      .dwattr $C$DW$706, DW_AT_accessibility(DW_ACCESS_public)
    7081              $C$DW$707       .dwtag  DW_TAG_member
    7082                      .dwattr $C$DW$707, DW_AT_type(*$C$DW$T$54)
    7083                      .dwattr $C$DW$707, DW_AT_name("pidHandle_spd")
    7084                      .dwattr $C$DW$707, DW_AT_TI_symbol_name("_pidHandle_spd")
    7085                      .dwattr $C$DW$707, DW_AT_data_member_location[DW_OP_plus_uconst 0x44]
    7086                      .dwattr $C$DW$707, DW_AT_accessibility(DW_ACCESS_public)
    7087              $C$DW$708       .dwtag  DW_TAG_member
    7088                      .dwattr $C$DW$708, DW_AT_type(*$C$DW$T$55)
    7089                      .dwattr $C$DW$708, DW_AT_name("pid_spd")
    7090                      .dwattr $C$DW$708, DW_AT_TI_symbol_name("_pid_spd")
    7091                      .dwattr $C$DW$708, DW_AT_data_member_location[DW_OP_plus_uconst 0x46]
    7092                      .dwattr $C$DW$708, DW_AT_accessibility(DW_ACCESS_public)
    7093              $C$DW$709       .dwtag  DW_TAG_member
    7094                      .dwattr $C$DW$709, DW_AT_type(*$C$DW$T$57)
    7095                      .dwattr $C$DW$709, DW_AT_name("iparkHandle")
    7096                      .dwattr $C$DW$709, DW_AT_TI_symbol_name("_iparkHandle")
    7097                      .dwattr $C$DW$709, DW_AT_data_member_location[DW_OP_plus_uconst 0x56]
    7098                      .dwattr $C$DW$709, DW_AT_accessibility(DW_ACCESS_public)
    7099              $C$DW$710       .dwtag  DW_TAG_member
    7100                      .dwattr $C$DW$710, DW_AT_type(*$C$DW$T$58)
    7101                      .dwattr $C$DW$710, DW_AT_name("ipark")
    7102                      .dwattr $C$DW$710, DW_AT_TI_symbol_name("_ipark")
    7103                      .dwattr $C$DW$710, DW_AT_data_member_location[DW_OP_plus_uconst 0x58]
    7104                      .dwattr $C$DW$710, DW_AT_accessibility(DW_ACCESS_public)
    7105              $C$DW$711       .dwtag  DW_TAG_member
    7106                      .dwattr $C$DW$711, DW_AT_type(*$C$DW$T$60)
    7107                      .dwattr $C$DW$711, DW_AT_name("svgenHandle")
    7108                      .dwattr $C$DW$711, DW_AT_TI_symbol_name("_svgenHandle")
    7109                      .dwattr $C$DW$711, DW_AT_data_member_location[DW_OP_plus_uconst 0x5c]
    7110                      .dwattr $C$DW$711, DW_AT_accessibility(DW_ACCESS_public)
    7111              $C$DW$712       .dwtag  DW_TAG_member
    7112                      .dwattr $C$DW$712, DW_AT_type(*$C$DW$T$61)
    7113                      .dwattr $C$DW$712, DW_AT_name("svgen")
    7114                      .dwattr $C$DW$712, DW_AT_TI_symbol_name("_svgen")
    7115                      .dwattr $C$DW$712, DW_AT_data_member_location[DW_OP_plus_uconst 0x5e]
    7116                      .dwattr $C$DW$712, DW_AT_accessibility(DW_ACCESS_public)
    7117              $C$DW$713       .dwtag  DW_TAG_member
    7118                      .dwattr $C$DW$713, DW_AT_type(*$C$DW$T$63)
    7119                      .dwattr $C$DW$713, DW_AT_name("trajHandle_Id")
    7120                      .dwattr $C$DW$713, DW_AT_TI_symbol_name("_trajHandle_Id")
    7121                      .dwattr $C$DW$713, DW_AT_data_member_location[DW_OP_plus_uconst 0x60]
    7122                      .dwattr $C$DW$713, DW_AT_accessibility(DW_ACCESS_public)
    7123              $C$DW$714       .dwtag  DW_TAG_member
TMS320C2000 Assembler PC v6.2.5 Tue Nov 21 21:02:52 2017

Tools Copyright (c) 1996-2014 Texas Instruments Incorporated
C:\Users\wmj\AppData\Local\Temp\1032411                              PAGE  137

    7124                      .dwattr $C$DW$714, DW_AT_type(*$C$DW$T$64)
    7125                      .dwattr $C$DW$714, DW_AT_name("traj_Id")
    7126                      .dwattr $C$DW$714, DW_AT_TI_symbol_name("_traj_Id")
    7127                      .dwattr $C$DW$714, DW_AT_data_member_location[DW_OP_plus_uconst 0x62]
    7128                      .dwattr $C$DW$714, DW_AT_accessibility(DW_ACCESS_public)
    7129              $C$DW$715       .dwtag  DW_TAG_member
    7130                      .dwattr $C$DW$715, DW_AT_type(*$C$DW$T$63)
    7131                      .dwattr $C$DW$715, DW_AT_name("trajHandle_spd")
    7132                      .dwattr $C$DW$715, DW_AT_TI_symbol_name("_trajHandle_spd")
    7133                      .dwattr $C$DW$715, DW_AT_data_member_location[DW_OP_plus_uconst 0x6c]
    7134                      .dwattr $C$DW$715, DW_AT_accessibility(DW_ACCESS_public)
    7135              $C$DW$716       .dwtag  DW_TAG_member
    7136                      .dwattr $C$DW$716, DW_AT_type(*$C$DW$T$64)
    7137                      .dwattr $C$DW$716, DW_AT_name("traj_spd")
    7138                      .dwattr $C$DW$716, DW_AT_TI_symbol_name("_traj_spd")
    7139                      .dwattr $C$DW$716, DW_AT_data_member_location[DW_OP_plus_uconst 0x6e]
    7140                      .dwattr $C$DW$716, DW_AT_accessibility(DW_ACCESS_public)
    7141              $C$DW$717       .dwtag  DW_TAG_member
    7142                      .dwattr $C$DW$717, DW_AT_type(*$C$DW$T$63)
    7143                      .dwattr $C$DW$717, DW_AT_name("trajHandle_spdMax")
    7144                      .dwattr $C$DW$717, DW_AT_TI_symbol_name("_trajHandle_spdMax")
    7145                      .dwattr $C$DW$717, DW_AT_data_member_location[DW_OP_plus_uconst 0x78]
    7146                      .dwattr $C$DW$717, DW_AT_accessibility(DW_ACCESS_public)
    7147              $C$DW$718       .dwtag  DW_TAG_member
    7148                      .dwattr $C$DW$718, DW_AT_type(*$C$DW$T$64)
    7149                      .dwattr $C$DW$718, DW_AT_name("traj_spdMax")
    7150                      .dwattr $C$DW$718, DW_AT_TI_symbol_name("_traj_spdMax")
    7151                      .dwattr $C$DW$718, DW_AT_data_member_location[DW_OP_plus_uconst 0x7a]
    7152                      .dwattr $C$DW$718, DW_AT_accessibility(DW_ACCESS_public)
    7153              $C$DW$719       .dwtag  DW_TAG_member
    7154                      .dwattr $C$DW$719, DW_AT_type(*$C$DW$T$65)
    7155                      .dwattr $C$DW$719, DW_AT_name("motorParams")
    7156                      .dwattr $C$DW$719, DW_AT_TI_symbol_name("_motorParams")
    7157                      .dwattr $C$DW$719, DW_AT_data_member_location[DW_OP_plus_uconst 0x84]
    7158                      .dwattr $C$DW$719, DW_AT_accessibility(DW_ACCESS_public)
    7159              $C$DW$720       .dwtag  DW_TAG_member
    7160                      .dwattr $C$DW$720, DW_AT_type(*$C$DW$T$68)
    7161                      .dwattr $C$DW$720, DW_AT_name("waitTimes")
    7162                      .dwattr $C$DW$720, DW_AT_TI_symbol_name("_waitTimes")
    7163                      .dwattr $C$DW$720, DW_AT_data_member_location[DW_OP_plus_uconst 0x92]
    7164                      .dwattr $C$DW$720, DW_AT_accessibility(DW_ACCESS_public)
    7165              $C$DW$721       .dwtag  DW_TAG_member
    7166                      .dwattr $C$DW$721, DW_AT_type(*$C$DW$T$67)
    7167                      .dwattr $C$DW$721, DW_AT_name("counter_state")
    7168                      .dwattr $C$DW$721, DW_AT_TI_symbol_name("_counter_state")
    7169                      .dwattr $C$DW$721, DW_AT_data_member_location[DW_OP_plus_uconst 0x9a]
    7170                      .dwattr $C$DW$721, DW_AT_accessibility(DW_ACCESS_public)
    7171              $C$DW$722       .dwtag  DW_TAG_member
    7172                      .dwattr $C$DW$722, DW_AT_type(*$C$DW$T$69)
    7173                      .dwattr $C$DW$722, DW_AT_name("numIsrTicksPerCtrlTick")
    7174                      .dwattr $C$DW$722, DW_AT_TI_symbol_name("_numIsrTicksPerCtrlTick")
    7175                      .dwattr $C$DW$722, DW_AT_data_member_location[DW_OP_plus_uconst 0x9c]
    7176                      .dwattr $C$DW$722, DW_AT_accessibility(DW_ACCESS_public)
    7177              $C$DW$723       .dwtag  DW_TAG_member
    7178                      .dwattr $C$DW$723, DW_AT_type(*$C$DW$T$69)
TMS320C2000 Assembler PC v6.2.5 Tue Nov 21 21:02:52 2017

Tools Copyright (c) 1996-2014 Texas Instruments Incorporated
C:\Users\wmj\AppData\Local\Temp\1032411                              PAGE  138

    7179                      .dwattr $C$DW$723, DW_AT_name("numCtrlTicksPerCurrentTick")
    7180                      .dwattr $C$DW$723, DW_AT_TI_symbol_name("_numCtrlTicksPerCurrentTick")
    7181                      .dwattr $C$DW$723, DW_AT_data_member_location[DW_OP_plus_uconst 0x9d]
    7182                      .dwattr $C$DW$723, DW_AT_accessibility(DW_ACCESS_public)
    7183              $C$DW$724       .dwtag  DW_TAG_member
    7184                      .dwattr $C$DW$724, DW_AT_type(*$C$DW$T$69)
    7185                      .dwattr $C$DW$724, DW_AT_name("numCtrlTicksPerSpeedTick")
    7186                      .dwattr $C$DW$724, DW_AT_TI_symbol_name("_numCtrlTicksPerSpeedTick")
    7187                      .dwattr $C$DW$724, DW_AT_data_member_location[DW_OP_plus_uconst 0x9e]
    7188                      .dwattr $C$DW$724, DW_AT_accessibility(DW_ACCESS_public)
    7189              $C$DW$725       .dwtag  DW_TAG_member
    7190                      .dwattr $C$DW$725, DW_AT_type(*$C$DW$T$69)
    7191                      .dwattr $C$DW$725, DW_AT_name("numCtrlTicksPerTrajTick")
    7192                      .dwattr $C$DW$725, DW_AT_TI_symbol_name("_numCtrlTicksPerTrajTick")
    7193                      .dwattr $C$DW$725, DW_AT_data_member_location[DW_OP_plus_uconst 0x9f]
    7194                      .dwattr $C$DW$725, DW_AT_accessibility(DW_ACCESS_public)
    7195              $C$DW$726       .dwtag  DW_TAG_member
    7196                      .dwattr $C$DW$726, DW_AT_type(*$C$DW$T$67)
    7197                      .dwattr $C$DW$726, DW_AT_name("ctrlFreq_Hz")
    7198                      .dwattr $C$DW$726, DW_AT_TI_symbol_name("_ctrlFreq_Hz")
    7199                      .dwattr $C$DW$726, DW_AT_data_member_location[DW_OP_plus_uconst 0xa0]
    7200                      .dwattr $C$DW$726, DW_AT_accessibility(DW_ACCESS_public)
    7201              $C$DW$727       .dwtag  DW_TAG_member
    7202                      .dwattr $C$DW$727, DW_AT_type(*$C$DW$T$67)
    7203                      .dwattr $C$DW$727, DW_AT_name("trajFreq_Hz")
    7204                      .dwattr $C$DW$727, DW_AT_TI_symbol_name("_trajFreq_Hz")
    7205                      .dwattr $C$DW$727, DW_AT_data_member_location[DW_OP_plus_uconst 0xa2]
    7206                      .dwattr $C$DW$727, DW_AT_accessibility(DW_ACCESS_public)
    7207              $C$DW$728       .dwtag  DW_TAG_member
    7208                      .dwattr $C$DW$728, DW_AT_type(*$C$DW$T$31)
    7209                      .dwattr $C$DW$728, DW_AT_name("trajPeriod_sec")
    7210                      .dwattr $C$DW$728, DW_AT_TI_symbol_name("_trajPeriod_sec")
    7211                      .dwattr $C$DW$728, DW_AT_data_member_location[DW_OP_plus_uconst 0xa4]
    7212                      .dwattr $C$DW$728, DW_AT_accessibility(DW_ACCESS_public)
    7213              $C$DW$729       .dwtag  DW_TAG_member
    7214                      .dwattr $C$DW$729, DW_AT_type(*$C$DW$T$70)
    7215                      .dwattr $C$DW$729, DW_AT_name("ctrlPeriod_sec")
    7216                      .dwattr $C$DW$729, DW_AT_TI_symbol_name("_ctrlPeriod_sec")
    7217                      .dwattr $C$DW$729, DW_AT_data_member_location[DW_OP_plus_uconst 0xa6]
    7218                      .dwattr $C$DW$729, DW_AT_accessibility(DW_ACCESS_public)
    7219              $C$DW$730       .dwtag  DW_TAG_member
    7220                      .dwattr $C$DW$730, DW_AT_type(*$C$DW$T$31)
    7221                      .dwattr $C$DW$730, DW_AT_name("maxVsMag_pu")
    7222                      .dwattr $C$DW$730, DW_AT_TI_symbol_name("_maxVsMag_pu")
    7223                      .dwattr $C$DW$730, DW_AT_data_member_location[DW_OP_plus_uconst 0xa8]
    7224                      .dwattr $C$DW$730, DW_AT_accessibility(DW_ACCESS_public)
    7225              $C$DW$731       .dwtag  DW_TAG_member
    7226                      .dwattr $C$DW$731, DW_AT_type(*$C$DW$T$32)
    7227                      .dwattr $C$DW$731, DW_AT_name("Iab_in")
    7228                      .dwattr $C$DW$731, DW_AT_TI_symbol_name("_Iab_in")
    7229                      .dwattr $C$DW$731, DW_AT_data_member_location[DW_OP_plus_uconst 0xaa]
    7230                      .dwattr $C$DW$731, DW_AT_accessibility(DW_ACCESS_public)
    7231              $C$DW$732       .dwtag  DW_TAG_member
    7232                      .dwattr $C$DW$732, DW_AT_type(*$C$DW$T$32)
    7233                      .dwattr $C$DW$732, DW_AT_name("Iab_filt")
TMS320C2000 Assembler PC v6.2.5 Tue Nov 21 21:02:52 2017

Tools Copyright (c) 1996-2014 Texas Instruments Incorporated
C:\Users\wmj\AppData\Local\Temp\1032411                              PAGE  139

    7234                      .dwattr $C$DW$732, DW_AT_TI_symbol_name("_Iab_filt")
    7235                      .dwattr $C$DW$732, DW_AT_data_member_location[DW_OP_plus_uconst 0xae]
    7236                      .dwattr $C$DW$732, DW_AT_accessibility(DW_ACCESS_public)
    7237              $C$DW$733       .dwtag  DW_TAG_member
    7238                      .dwattr $C$DW$733, DW_AT_type(*$C$DW$T$32)
    7239                      .dwattr $C$DW$733, DW_AT_name("Idq_in")
    7240                      .dwattr $C$DW$733, DW_AT_TI_symbol_name("_Idq_in")
    7241                      .dwattr $C$DW$733, DW_AT_data_member_location[DW_OP_plus_uconst 0xb2]
    7242                      .dwattr $C$DW$733, DW_AT_accessibility(DW_ACCESS_public)
    7243              $C$DW$734       .dwtag  DW_TAG_member
    7244                      .dwattr $C$DW$734, DW_AT_type(*$C$DW$T$32)
    7245                      .dwattr $C$DW$734, DW_AT_name("Vab_in")
    7246                      .dwattr $C$DW$734, DW_AT_TI_symbol_name("_Vab_in")
    7247                      .dwattr $C$DW$734, DW_AT_data_member_location[DW_OP_plus_uconst 0xb6]
    7248                      .dwattr $C$DW$734, DW_AT_accessibility(DW_ACCESS_public)
    7249              $C$DW$735       .dwtag  DW_TAG_member
    7250                      .dwattr $C$DW$735, DW_AT_type(*$C$DW$T$31)
    7251                      .dwattr $C$DW$735, DW_AT_name("spd_out")
    7252                      .dwattr $C$DW$735, DW_AT_TI_symbol_name("_spd_out")
    7253                      .dwattr $C$DW$735, DW_AT_data_member_location[DW_OP_plus_uconst 0xba]
    7254                      .dwattr $C$DW$735, DW_AT_accessibility(DW_ACCESS_public)
    7255              $C$DW$736       .dwtag  DW_TAG_member
    7256                      .dwattr $C$DW$736, DW_AT_type(*$C$DW$T$32)
    7257                      .dwattr $C$DW$736, DW_AT_name("Vab_out")
    7258                      .dwattr $C$DW$736, DW_AT_TI_symbol_name("_Vab_out")
    7259                      .dwattr $C$DW$736, DW_AT_data_member_location[DW_OP_plus_uconst 0xbc]
    7260                      .dwattr $C$DW$736, DW_AT_accessibility(DW_ACCESS_public)
    7261              $C$DW$737       .dwtag  DW_TAG_member
    7262                      .dwattr $C$DW$737, DW_AT_type(*$C$DW$T$32)
    7263                      .dwattr $C$DW$737, DW_AT_name("Vdq_out")
    7264                      .dwattr $C$DW$737, DW_AT_TI_symbol_name("_Vdq_out")
    7265                      .dwattr $C$DW$737, DW_AT_data_member_location[DW_OP_plus_uconst 0xc0]
    7266                      .dwattr $C$DW$737, DW_AT_accessibility(DW_ACCESS_public)
    7267              $C$DW$738       .dwtag  DW_TAG_member
    7268                      .dwattr $C$DW$738, DW_AT_type(*$C$DW$T$70)
    7269                      .dwattr $C$DW$738, DW_AT_name("Rhf")
    7270                      .dwattr $C$DW$738, DW_AT_TI_symbol_name("_Rhf")
    7271                      .dwattr $C$DW$738, DW_AT_data_member_location[DW_OP_plus_uconst 0xc4]
    7272                      .dwattr $C$DW$738, DW_AT_accessibility(DW_ACCESS_public)
    7273              $C$DW$739       .dwtag  DW_TAG_member
    7274                      .dwattr $C$DW$739, DW_AT_type(*$C$DW$T$70)
    7275                      .dwattr $C$DW$739, DW_AT_name("Lhf")
    7276                      .dwattr $C$DW$739, DW_AT_TI_symbol_name("_Lhf")
    7277                      .dwattr $C$DW$739, DW_AT_data_member_location[DW_OP_plus_uconst 0xc6]
    7278                      .dwattr $C$DW$739, DW_AT_accessibility(DW_ACCESS_public)
    7279              $C$DW$740       .dwtag  DW_TAG_member
    7280                      .dwattr $C$DW$740, DW_AT_type(*$C$DW$T$70)
    7281                      .dwattr $C$DW$740, DW_AT_name("RoverL")
    7282                      .dwattr $C$DW$740, DW_AT_TI_symbol_name("_RoverL")
    7283                      .dwattr $C$DW$740, DW_AT_data_member_location[DW_OP_plus_uconst 0xc8]
    7284                      .dwattr $C$DW$740, DW_AT_accessibility(DW_ACCESS_public)
    7285              $C$DW$741       .dwtag  DW_TAG_member
    7286                      .dwattr $C$DW$741, DW_AT_type(*$C$DW$T$31)
    7287                      .dwattr $C$DW$741, DW_AT_name("Kp_Id")
    7288                      .dwattr $C$DW$741, DW_AT_TI_symbol_name("_Kp_Id")
TMS320C2000 Assembler PC v6.2.5 Tue Nov 21 21:02:52 2017

Tools Copyright (c) 1996-2014 Texas Instruments Incorporated
C:\Users\wmj\AppData\Local\Temp\1032411                              PAGE  140

    7289                      .dwattr $C$DW$741, DW_AT_data_member_location[DW_OP_plus_uconst 0xca]
    7290                      .dwattr $C$DW$741, DW_AT_accessibility(DW_ACCESS_public)
    7291              $C$DW$742       .dwtag  DW_TAG_member
    7292                      .dwattr $C$DW$742, DW_AT_type(*$C$DW$T$31)
    7293                      .dwattr $C$DW$742, DW_AT_name("Kp_Iq")
    7294                      .dwattr $C$DW$742, DW_AT_TI_symbol_name("_Kp_Iq")
    7295                      .dwattr $C$DW$742, DW_AT_data_member_location[DW_OP_plus_uconst 0xcc]
    7296                      .dwattr $C$DW$742, DW_AT_accessibility(DW_ACCESS_public)
    7297              $C$DW$743       .dwtag  DW_TAG_member
    7298                      .dwattr $C$DW$743, DW_AT_type(*$C$DW$T$31)
    7299                      .dwattr $C$DW$743, DW_AT_name("Kp_spd")
    7300                      .dwattr $C$DW$743, DW_AT_TI_symbol_name("_Kp_spd")
    7301                      .dwattr $C$DW$743, DW_AT_data_member_location[DW_OP_plus_uconst 0xce]
    7302                      .dwattr $C$DW$743, DW_AT_accessibility(DW_ACCESS_public)
    7303              $C$DW$744       .dwtag  DW_TAG_member
    7304                      .dwattr $C$DW$744, DW_AT_type(*$C$DW$T$31)
    7305                      .dwattr $C$DW$744, DW_AT_name("Ki_Id")
    7306                      .dwattr $C$DW$744, DW_AT_TI_symbol_name("_Ki_Id")
    7307                      .dwattr $C$DW$744, DW_AT_data_member_location[DW_OP_plus_uconst 0xd0]
    7308                      .dwattr $C$DW$744, DW_AT_accessibility(DW_ACCESS_public)
    7309              $C$DW$745       .dwtag  DW_TAG_member
    7310                      .dwattr $C$DW$745, DW_AT_type(*$C$DW$T$31)
    7311                      .dwattr $C$DW$745, DW_AT_name("Ki_Iq")
    7312                      .dwattr $C$DW$745, DW_AT_TI_symbol_name("_Ki_Iq")
    7313                      .dwattr $C$DW$745, DW_AT_data_member_location[DW_OP_plus_uconst 0xd2]
    7314                      .dwattr $C$DW$745, DW_AT_accessibility(DW_ACCESS_public)
    7315              $C$DW$746       .dwtag  DW_TAG_member
    7316                      .dwattr $C$DW$746, DW_AT_type(*$C$DW$T$31)
    7317                      .dwattr $C$DW$746, DW_AT_name("Ki_spd")
    7318                      .dwattr $C$DW$746, DW_AT_TI_symbol_name("_Ki_spd")
    7319                      .dwattr $C$DW$746, DW_AT_data_member_location[DW_OP_plus_uconst 0xd4]
    7320                      .dwattr $C$DW$746, DW_AT_accessibility(DW_ACCESS_public)
    7321              $C$DW$747       .dwtag  DW_TAG_member
    7322                      .dwattr $C$DW$747, DW_AT_type(*$C$DW$T$31)
    7323                      .dwattr $C$DW$747, DW_AT_name("Kd_Id")
    7324                      .dwattr $C$DW$747, DW_AT_TI_symbol_name("_Kd_Id")
    7325                      .dwattr $C$DW$747, DW_AT_data_member_location[DW_OP_plus_uconst 0xd6]
    7326                      .dwattr $C$DW$747, DW_AT_accessibility(DW_ACCESS_public)
    7327              $C$DW$748       .dwtag  DW_TAG_member
    7328                      .dwattr $C$DW$748, DW_AT_type(*$C$DW$T$31)
    7329                      .dwattr $C$DW$748, DW_AT_name("Kd_Iq")
    7330                      .dwattr $C$DW$748, DW_AT_TI_symbol_name("_Kd_Iq")
    7331                      .dwattr $C$DW$748, DW_AT_data_member_location[DW_OP_plus_uconst 0xd8]
    7332                      .dwattr $C$DW$748, DW_AT_accessibility(DW_ACCESS_public)
    7333              $C$DW$749       .dwtag  DW_TAG_member
    7334                      .dwattr $C$DW$749, DW_AT_type(*$C$DW$T$31)
    7335                      .dwattr $C$DW$749, DW_AT_name("Kd_spd")
    7336                      .dwattr $C$DW$749, DW_AT_TI_symbol_name("_Kd_spd")
    7337                      .dwattr $C$DW$749, DW_AT_data_member_location[DW_OP_plus_uconst 0xda]
    7338                      .dwattr $C$DW$749, DW_AT_accessibility(DW_ACCESS_public)
    7339              $C$DW$750       .dwtag  DW_TAG_member
    7340                      .dwattr $C$DW$750, DW_AT_type(*$C$DW$T$31)
    7341                      .dwattr $C$DW$750, DW_AT_name("Ui_Id")
    7342                      .dwattr $C$DW$750, DW_AT_TI_symbol_name("_Ui_Id")
    7343                      .dwattr $C$DW$750, DW_AT_data_member_location[DW_OP_plus_uconst 0xdc]
TMS320C2000 Assembler PC v6.2.5 Tue Nov 21 21:02:52 2017

Tools Copyright (c) 1996-2014 Texas Instruments Incorporated
C:\Users\wmj\AppData\Local\Temp\1032411                              PAGE  141

    7344                      .dwattr $C$DW$750, DW_AT_accessibility(DW_ACCESS_public)
    7345              $C$DW$751       .dwtag  DW_TAG_member
    7346                      .dwattr $C$DW$751, DW_AT_type(*$C$DW$T$31)
    7347                      .dwattr $C$DW$751, DW_AT_name("Ui_Iq")
    7348                      .dwattr $C$DW$751, DW_AT_TI_symbol_name("_Ui_Iq")
    7349                      .dwattr $C$DW$751, DW_AT_data_member_location[DW_OP_plus_uconst 0xde]
    7350                      .dwattr $C$DW$751, DW_AT_accessibility(DW_ACCESS_public)
    7351              $C$DW$752       .dwtag  DW_TAG_member
    7352                      .dwattr $C$DW$752, DW_AT_type(*$C$DW$T$31)
    7353                      .dwattr $C$DW$752, DW_AT_name("Ui_spd")
    7354                      .dwattr $C$DW$752, DW_AT_TI_symbol_name("_Ui_spd")
    7355                      .dwattr $C$DW$752, DW_AT_data_member_location[DW_OP_plus_uconst 0xe0]
    7356                      .dwattr $C$DW$752, DW_AT_accessibility(DW_ACCESS_public)
    7357              $C$DW$753       .dwtag  DW_TAG_member
    7358                      .dwattr $C$DW$753, DW_AT_type(*$C$DW$T$32)
    7359                      .dwattr $C$DW$753, DW_AT_name("Idq_ref")
    7360                      .dwattr $C$DW$753, DW_AT_TI_symbol_name("_Idq_ref")
    7361                      .dwattr $C$DW$753, DW_AT_data_member_location[DW_OP_plus_uconst 0xe2]
    7362                      .dwattr $C$DW$753, DW_AT_accessibility(DW_ACCESS_public)
    7363              $C$DW$754       .dwtag  DW_TAG_member
    7364                      .dwattr $C$DW$754, DW_AT_type(*$C$DW$T$31)
    7365                      .dwattr $C$DW$754, DW_AT_name("IdRated")
    7366                      .dwattr $C$DW$754, DW_AT_TI_symbol_name("_IdRated")
    7367                      .dwattr $C$DW$754, DW_AT_data_member_location[DW_OP_plus_uconst 0xe6]
    7368                      .dwattr $C$DW$754, DW_AT_accessibility(DW_ACCESS_public)
    7369              $C$DW$755       .dwtag  DW_TAG_member
    7370                      .dwattr $C$DW$755, DW_AT_type(*$C$DW$T$31)
    7371                      .dwattr $C$DW$755, DW_AT_name("spd_ref")
    7372                      .dwattr $C$DW$755, DW_AT_TI_symbol_name("_spd_ref")
    7373                      .dwattr $C$DW$755, DW_AT_data_member_location[DW_OP_plus_uconst 0xe8]
    7374                      .dwattr $C$DW$755, DW_AT_accessibility(DW_ACCESS_public)
    7375              $C$DW$756       .dwtag  DW_TAG_member
    7376                      .dwattr $C$DW$756, DW_AT_type(*$C$DW$T$31)
    7377                      .dwattr $C$DW$756, DW_AT_name("spd_max")
    7378                      .dwattr $C$DW$756, DW_AT_TI_symbol_name("_spd_max")
    7379                      .dwattr $C$DW$756, DW_AT_data_member_location[DW_OP_plus_uconst 0xea]
    7380                      .dwattr $C$DW$756, DW_AT_accessibility(DW_ACCESS_public)
    7381              $C$DW$757       .dwtag  DW_TAG_member
    7382                      .dwattr $C$DW$757, DW_AT_type(*$C$DW$T$69)
    7383                      .dwattr $C$DW$757, DW_AT_name("counter_current")
    7384                      .dwattr $C$DW$757, DW_AT_TI_symbol_name("_counter_current")
    7385                      .dwattr $C$DW$757, DW_AT_data_member_location[DW_OP_plus_uconst 0xec]
    7386                      .dwattr $C$DW$757, DW_AT_accessibility(DW_ACCESS_public)
    7387              $C$DW$758       .dwtag  DW_TAG_member
    7388                      .dwattr $C$DW$758, DW_AT_type(*$C$DW$T$69)
    7389                      .dwattr $C$DW$758, DW_AT_name("counter_isr")
    7390                      .dwattr $C$DW$758, DW_AT_TI_symbol_name("_counter_isr")
    7391                      .dwattr $C$DW$758, DW_AT_data_member_location[DW_OP_plus_uconst 0xed]
    7392                      .dwattr $C$DW$758, DW_AT_accessibility(DW_ACCESS_public)
    7393              $C$DW$759       .dwtag  DW_TAG_member
    7394                      .dwattr $C$DW$759, DW_AT_type(*$C$DW$T$69)
    7395                      .dwattr $C$DW$759, DW_AT_name("counter_speed")
    7396                      .dwattr $C$DW$759, DW_AT_TI_symbol_name("_counter_speed")
    7397                      .dwattr $C$DW$759, DW_AT_data_member_location[DW_OP_plus_uconst 0xee]
    7398                      .dwattr $C$DW$759, DW_AT_accessibility(DW_ACCESS_public)
TMS320C2000 Assembler PC v6.2.5 Tue Nov 21 21:02:52 2017

Tools Copyright (c) 1996-2014 Texas Instruments Incorporated
C:\Users\wmj\AppData\Local\Temp\1032411                              PAGE  142

    7399              $C$DW$760       .dwtag  DW_TAG_member
    7400                      .dwattr $C$DW$760, DW_AT_type(*$C$DW$T$69)
    7401                      .dwattr $C$DW$760, DW_AT_name("counter_traj")
    7402                      .dwattr $C$DW$760, DW_AT_TI_symbol_name("_counter_traj")
    7403                      .dwattr $C$DW$760, DW_AT_data_member_location[DW_OP_plus_uconst 0xef]
    7404                      .dwattr $C$DW$760, DW_AT_accessibility(DW_ACCESS_public)
    7405              $C$DW$761       .dwtag  DW_TAG_member
    7406                      .dwattr $C$DW$761, DW_AT_type(*$C$DW$T$33)
    7407                      .dwattr $C$DW$761, DW_AT_name("flag_enableCtrl")
    7408                      .dwattr $C$DW$761, DW_AT_TI_symbol_name("_flag_enableCtrl")
    7409                      .dwattr $C$DW$761, DW_AT_data_member_location[DW_OP_plus_uconst 0xf0]
    7410                      .dwattr $C$DW$761, DW_AT_accessibility(DW_ACCESS_public)
    7411              $C$DW$762       .dwtag  DW_TAG_member
    7412                      .dwattr $C$DW$762, DW_AT_type(*$C$DW$T$33)
    7413                      .dwattr $C$DW$762, DW_AT_name("flag_enableDcBusComp")
    7414                      .dwattr $C$DW$762, DW_AT_TI_symbol_name("_flag_enableDcBusComp")
    7415                      .dwattr $C$DW$762, DW_AT_data_member_location[DW_OP_plus_uconst 0xf1]
    7416                      .dwattr $C$DW$762, DW_AT_accessibility(DW_ACCESS_public)
    7417              $C$DW$763       .dwtag  DW_TAG_member
    7418                      .dwattr $C$DW$763, DW_AT_type(*$C$DW$T$33)
    7419                      .dwattr $C$DW$763, DW_AT_name("flag_enablePowerWarp")
    7420                      .dwattr $C$DW$763, DW_AT_TI_symbol_name("_flag_enablePowerWarp")
    7421                      .dwattr $C$DW$763, DW_AT_data_member_location[DW_OP_plus_uconst 0xf2]
    7422                      .dwattr $C$DW$763, DW_AT_accessibility(DW_ACCESS_public)
    7423              $C$DW$764       .dwtag  DW_TAG_member
    7424                      .dwattr $C$DW$764, DW_AT_type(*$C$DW$T$33)
    7425                      .dwattr $C$DW$764, DW_AT_name("flag_enableOffset")
    7426                      .dwattr $C$DW$764, DW_AT_TI_symbol_name("_flag_enableOffset")
    7427                      .dwattr $C$DW$764, DW_AT_data_member_location[DW_OP_plus_uconst 0xf3]
    7428                      .dwattr $C$DW$764, DW_AT_accessibility(DW_ACCESS_public)
    7429              $C$DW$765       .dwtag  DW_TAG_member
    7430                      .dwattr $C$DW$765, DW_AT_type(*$C$DW$T$33)
    7431                      .dwattr $C$DW$765, DW_AT_name("flag_enableSpeedCtrl")
    7432                      .dwattr $C$DW$765, DW_AT_TI_symbol_name("_flag_enableSpeedCtrl")
    7433                      .dwattr $C$DW$765, DW_AT_data_member_location[DW_OP_plus_uconst 0xf4]
    7434                      .dwattr $C$DW$765, DW_AT_accessibility(DW_ACCESS_public)
    7435              $C$DW$766       .dwtag  DW_TAG_member
    7436                      .dwattr $C$DW$766, DW_AT_type(*$C$DW$T$33)
    7437                      .dwattr $C$DW$766, DW_AT_name("flag_enableUserMotorParams")
    7438                      .dwattr $C$DW$766, DW_AT_TI_symbol_name("_flag_enableUserMotorParams")
    7439                      .dwattr $C$DW$766, DW_AT_data_member_location[DW_OP_plus_uconst 0xf5]
    7440                      .dwattr $C$DW$766, DW_AT_accessibility(DW_ACCESS_public)
    7441              $C$DW$767       .dwtag  DW_TAG_member
    7442                      .dwattr $C$DW$767, DW_AT_type(*$C$DW$T$33)
    7443                      .dwattr $C$DW$767, DW_AT_name("flag_enableCurrentCtrl")
    7444                      .dwattr $C$DW$767, DW_AT_TI_symbol_name("_flag_enableCurrentCtrl")
    7445                      .dwattr $C$DW$767, DW_AT_data_member_location[DW_OP_plus_uconst 0xf6]
    7446                      .dwattr $C$DW$767, DW_AT_accessibility(DW_ACCESS_public)
    7447              $C$DW$768       .dwtag  DW_TAG_member
    7448                      .dwattr $C$DW$768, DW_AT_type(*$C$DW$T$31)
    7449                      .dwattr $C$DW$768, DW_AT_name("spd_outMaxRatio_pu")
    7450                      .dwattr $C$DW$768, DW_AT_TI_symbol_name("_spd_outMaxRatio_pu")
    7451                      .dwattr $C$DW$768, DW_AT_data_member_location[DW_OP_plus_uconst 0xf8]
    7452                      .dwattr $C$DW$768, DW_AT_accessibility(DW_ACCESS_public)
    7453              $C$DW$769       .dwtag  DW_TAG_member
TMS320C2000 Assembler PC v6.2.5 Tue Nov 21 21:02:52 2017

Tools Copyright (c) 1996-2014 Texas Instruments Incorporated
C:\Users\wmj\AppData\Local\Temp\1032411                              PAGE  143

    7454                      .dwattr $C$DW$769, DW_AT_type(*$C$DW$T$31)
    7455                      .dwattr $C$DW$769, DW_AT_name("enc_Angle")
    7456                      .dwattr $C$DW$769, DW_AT_TI_symbol_name("_enc_Angle")
    7457                      .dwattr $C$DW$769, DW_AT_data_member_location[DW_OP_plus_uconst 0xfa]
    7458                      .dwattr $C$DW$769, DW_AT_accessibility(DW_ACCESS_public)
    7459              $C$DW$770       .dwtag  DW_TAG_member
    7460                      .dwattr $C$DW$770, DW_AT_type(*$C$DW$T$33)
    7461                      .dwattr $C$DW$770, DW_AT_name("flag_enableEncAngle")
    7462                      .dwattr $C$DW$770, DW_AT_TI_symbol_name("_flag_enableEncAngle")
    7463                      .dwattr $C$DW$770, DW_AT_data_member_location[DW_OP_plus_uconst 0xfc]
    7464                      .dwattr $C$DW$770, DW_AT_accessibility(DW_ACCESS_public)
    7465              $C$DW$771       .dwtag  DW_TAG_member
    7466                      .dwattr $C$DW$771, DW_AT_type(*$C$DW$T$72)
    7467                      .dwattr $C$DW$771, DW_AT_name("brakeHandle")
    7468                      .dwattr $C$DW$771, DW_AT_TI_symbol_name("_brakeHandle")
    7469                      .dwattr $C$DW$771, DW_AT_data_member_location[DW_OP_plus_uconst 0xfe]
    7470                      .dwattr $C$DW$771, DW_AT_accessibility(DW_ACCESS_public)
    7471              $C$DW$772       .dwtag  DW_TAG_member
    7472                      .dwattr $C$DW$772, DW_AT_type(*$C$DW$T$73)
    7473                      .dwattr $C$DW$772, DW_AT_name("brake")
    7474                      .dwattr $C$DW$772, DW_AT_TI_symbol_name("_brake")
    7475                      .dwattr $C$DW$772, DW_AT_data_member_location[DW_OP_plus_uconst 0x100]
    7476                      .dwattr $C$DW$772, DW_AT_accessibility(DW_ACCESS_public)
    7477                      .dwendtag $C$DW$T$74
    7478              
    7479              $C$DW$T$188     .dwtag  DW_TAG_typedef, DW_AT_name("CTRL_Obj")
    7480                      .dwattr $C$DW$T$188, DW_AT_type(*$C$DW$T$74)
    7481                      .dwattr $C$DW$T$188, DW_AT_language(DW_LANG_C)
    7482              $C$DW$T$169     .dwtag  DW_TAG_pointer_type
    7483                      .dwattr $C$DW$T$169, DW_AT_type(*$C$DW$T$74)
    7484                      .dwattr $C$DW$T$169, DW_AT_address_class(0x16)
    7485              $C$DW$T$170     .dwtag  DW_TAG_typedef, DW_AT_name("CTRL_Handle")
    7486                      .dwattr $C$DW$T$170, DW_AT_type(*$C$DW$T$169)
    7487                      .dwattr $C$DW$T$170, DW_AT_language(DW_LANG_C)
    7488              $C$DW$773       .dwtag  DW_TAG_TI_far_type
    7489                      .dwattr $C$DW$773, DW_AT_type(*$C$DW$T$170)
    7490              $C$DW$T$189     .dwtag  DW_TAG_const_type
    7491                      .dwattr $C$DW$T$189, DW_AT_type(*$C$DW$773)
    7492              
    7493              $C$DW$T$77      .dwtag  DW_TAG_structure_type
    7494                      .dwattr $C$DW$T$77, DW_AT_name("_CTRL_Version_")
    7495                      .dwattr $C$DW$T$77, DW_AT_byte_size(0x04)
    7496              $C$DW$774       .dwtag  DW_TAG_member
    7497                      .dwattr $C$DW$774, DW_AT_type(*$C$DW$T$22)
    7498                      .dwattr $C$DW$774, DW_AT_name("rsvd")
    7499                      .dwattr $C$DW$774, DW_AT_TI_symbol_name("_rsvd")
    7500                      .dwattr $C$DW$774, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    7501                      .dwattr $C$DW$774, DW_AT_accessibility(DW_ACCESS_public)
    7502              $C$DW$775       .dwtag  DW_TAG_member
    7503                      .dwattr $C$DW$775, DW_AT_type(*$C$DW$T$76)
    7504                      .dwattr $C$DW$775, DW_AT_name("targetProc")
    7505                      .dwattr $C$DW$775, DW_AT_TI_symbol_name("_targetProc")
    7506                      .dwattr $C$DW$775, DW_AT_data_member_location[DW_OP_plus_uconst 0x1]
    7507                      .dwattr $C$DW$775, DW_AT_accessibility(DW_ACCESS_public)
    7508              $C$DW$776       .dwtag  DW_TAG_member
TMS320C2000 Assembler PC v6.2.5 Tue Nov 21 21:02:52 2017

Tools Copyright (c) 1996-2014 Texas Instruments Incorporated
C:\Users\wmj\AppData\Local\Temp\1032411                              PAGE  144

    7509                      .dwattr $C$DW$776, DW_AT_type(*$C$DW$T$22)
    7510                      .dwattr $C$DW$776, DW_AT_name("major")
    7511                      .dwattr $C$DW$776, DW_AT_TI_symbol_name("_major")
    7512                      .dwattr $C$DW$776, DW_AT_data_member_location[DW_OP_plus_uconst 0x2]
    7513                      .dwattr $C$DW$776, DW_AT_accessibility(DW_ACCESS_public)
    7514              $C$DW$777       .dwtag  DW_TAG_member
    7515                      .dwattr $C$DW$777, DW_AT_type(*$C$DW$T$22)
    7516                      .dwattr $C$DW$777, DW_AT_name("minor")
    7517                      .dwattr $C$DW$777, DW_AT_TI_symbol_name("_minor")
    7518                      .dwattr $C$DW$777, DW_AT_data_member_location[DW_OP_plus_uconst 0x3]
    7519                      .dwattr $C$DW$777, DW_AT_accessibility(DW_ACCESS_public)
    7520                      .dwendtag $C$DW$T$77
    7521              
    7522              $C$DW$T$40      .dwtag  DW_TAG_typedef, DW_AT_name("CTRL_Version")
    7523                      .dwattr $C$DW$T$40, DW_AT_type(*$C$DW$T$77)
    7524                      .dwattr $C$DW$T$40, DW_AT_language(DW_LANG_C)
    7525              
    7526              $C$DW$T$19      .dwtag  DW_TAG_structure_type
    7527                      .dwattr $C$DW$T$19, DW_AT_name("_EST_Obj_")
    7528                      .dwattr $C$DW$T$19, DW_AT_declaration
    7529                      .dwendtag $C$DW$T$19
    7530              
    7531              $C$DW$T$48      .dwtag  DW_TAG_pointer_type
    7532                      .dwattr $C$DW$T$48, DW_AT_type(*$C$DW$T$19)
    7533                      .dwattr $C$DW$T$48, DW_AT_address_class(0x16)
    7534              $C$DW$T$49      .dwtag  DW_TAG_typedef, DW_AT_name("EST_Handle")
    7535                      .dwattr $C$DW$T$49, DW_AT_type(*$C$DW$T$48)
    7536                      .dwattr $C$DW$T$49, DW_AT_language(DW_LANG_C)
    7537              
    7538              $C$DW$T$78      .dwtag  DW_TAG_structure_type
    7539                      .dwattr $C$DW$T$78, DW_AT_name("_FILTER_FO_")
    7540                      .dwattr $C$DW$T$78, DW_AT_byte_size(0x0a)
    7541              $C$DW$778       .dwtag  DW_TAG_member
    7542                      .dwattr $C$DW$778, DW_AT_type(*$C$DW$T$31)
    7543                      .dwattr $C$DW$778, DW_AT_name("a1")
    7544                      .dwattr $C$DW$778, DW_AT_TI_symbol_name("_a1")
    7545                      .dwattr $C$DW$778, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    7546                      .dwattr $C$DW$778, DW_AT_accessibility(DW_ACCESS_public)
    7547              $C$DW$779       .dwtag  DW_TAG_member
    7548                      .dwattr $C$DW$779, DW_AT_type(*$C$DW$T$31)
    7549                      .dwattr $C$DW$779, DW_AT_name("b0")
    7550                      .dwattr $C$DW$779, DW_AT_TI_symbol_name("_b0")
    7551                      .dwattr $C$DW$779, DW_AT_data_member_location[DW_OP_plus_uconst 0x2]
    7552                      .dwattr $C$DW$779, DW_AT_accessibility(DW_ACCESS_public)
    7553              $C$DW$780       .dwtag  DW_TAG_member
    7554                      .dwattr $C$DW$780, DW_AT_type(*$C$DW$T$31)
    7555                      .dwattr $C$DW$780, DW_AT_name("b1")
    7556                      .dwattr $C$DW$780, DW_AT_TI_symbol_name("_b1")
    7557                      .dwattr $C$DW$780, DW_AT_data_member_location[DW_OP_plus_uconst 0x4]
    7558                      .dwattr $C$DW$780, DW_AT_accessibility(DW_ACCESS_public)
    7559              $C$DW$781       .dwtag  DW_TAG_member
    7560                      .dwattr $C$DW$781, DW_AT_type(*$C$DW$T$31)
    7561                      .dwattr $C$DW$781, DW_AT_name("x1")
    7562                      .dwattr $C$DW$781, DW_AT_TI_symbol_name("_x1")
    7563                      .dwattr $C$DW$781, DW_AT_data_member_location[DW_OP_plus_uconst 0x6]
TMS320C2000 Assembler PC v6.2.5 Tue Nov 21 21:02:52 2017

Tools Copyright (c) 1996-2014 Texas Instruments Incorporated
C:\Users\wmj\AppData\Local\Temp\1032411                              PAGE  145

    7564                      .dwattr $C$DW$781, DW_AT_accessibility(DW_ACCESS_public)
    7565              $C$DW$782       .dwtag  DW_TAG_member
    7566                      .dwattr $C$DW$782, DW_AT_type(*$C$DW$T$31)
    7567                      .dwattr $C$DW$782, DW_AT_name("y1")
    7568                      .dwattr $C$DW$782, DW_AT_TI_symbol_name("_y1")
    7569                      .dwattr $C$DW$782, DW_AT_data_member_location[DW_OP_plus_uconst 0x8]
    7570                      .dwattr $C$DW$782, DW_AT_accessibility(DW_ACCESS_public)
    7571                      .dwendtag $C$DW$T$78
    7572              
    7573              $C$DW$T$134     .dwtag  DW_TAG_typedef, DW_AT_name("FILTER_FO_Obj")
    7574                      .dwattr $C$DW$T$134, DW_AT_type(*$C$DW$T$78)
    7575                      .dwattr $C$DW$T$134, DW_AT_language(DW_LANG_C)
    7576              $C$DW$T$191     .dwtag  DW_TAG_pointer_type
    7577                      .dwattr $C$DW$T$191, DW_AT_type(*$C$DW$T$134)
    7578                      .dwattr $C$DW$T$191, DW_AT_address_class(0x16)
    7579              
    7580              $C$DW$T$20      .dwtag  DW_TAG_structure_type
    7581                      .dwattr $C$DW$T$20, DW_AT_name("_FILTER_FO_Obj_")
    7582                      .dwattr $C$DW$T$20, DW_AT_declaration
    7583                      .dwendtag $C$DW$T$20
    7584              
    7585              $C$DW$T$135     .dwtag  DW_TAG_pointer_type
    7586                      .dwattr $C$DW$T$135, DW_AT_type(*$C$DW$T$20)
    7587                      .dwattr $C$DW$T$135, DW_AT_address_class(0x16)
    7588              $C$DW$T$136     .dwtag  DW_TAG_typedef, DW_AT_name("FILTER_FO_Handle")
    7589                      .dwattr $C$DW$T$136, DW_AT_type(*$C$DW$T$135)
    7590                      .dwattr $C$DW$T$136, DW_AT_language(DW_LANG_C)
    7591              
    7592              $C$DW$T$79      .dwtag  DW_TAG_structure_type
    7593                      .dwattr $C$DW$T$79, DW_AT_name("_FLASH_Obj_")
    7594                      .dwattr $C$DW$T$79, DW_AT_byte_size(0x08)
    7595              $C$DW$783       .dwtag  DW_TAG_member
    7596                      .dwattr $C$DW$783, DW_AT_type(*$C$DW$T$23)
    7597                      .dwattr $C$DW$783, DW_AT_name("FOPT")
    7598                      .dwattr $C$DW$783, DW_AT_TI_symbol_name("_FOPT")
    7599                      .dwattr $C$DW$783, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    7600                      .dwattr $C$DW$783, DW_AT_accessibility(DW_ACCESS_public)
    7601              $C$DW$784       .dwtag  DW_TAG_member
    7602                      .dwattr $C$DW$784, DW_AT_type(*$C$DW$T$23)
    7603                      .dwattr $C$DW$784, DW_AT_name("rsvd_1")
    7604                      .dwattr $C$DW$784, DW_AT_TI_symbol_name("_rsvd_1")
    7605                      .dwattr $C$DW$784, DW_AT_data_member_location[DW_OP_plus_uconst 0x1]
    7606                      .dwattr $C$DW$784, DW_AT_accessibility(DW_ACCESS_public)
    7607              $C$DW$785       .dwtag  DW_TAG_member
    7608                      .dwattr $C$DW$785, DW_AT_type(*$C$DW$T$23)
    7609                      .dwattr $C$DW$785, DW_AT_name("FPWR")
    7610                      .dwattr $C$DW$785, DW_AT_TI_symbol_name("_FPWR")
    7611                      .dwattr $C$DW$785, DW_AT_data_member_location[DW_OP_plus_uconst 0x2]
    7612                      .dwattr $C$DW$785, DW_AT_accessibility(DW_ACCESS_public)
    7613              $C$DW$786       .dwtag  DW_TAG_member
    7614                      .dwattr $C$DW$786, DW_AT_type(*$C$DW$T$23)
    7615                      .dwattr $C$DW$786, DW_AT_name("FSTATUS")
    7616                      .dwattr $C$DW$786, DW_AT_TI_symbol_name("_FSTATUS")
    7617                      .dwattr $C$DW$786, DW_AT_data_member_location[DW_OP_plus_uconst 0x3]
    7618                      .dwattr $C$DW$786, DW_AT_accessibility(DW_ACCESS_public)
TMS320C2000 Assembler PC v6.2.5 Tue Nov 21 21:02:52 2017

Tools Copyright (c) 1996-2014 Texas Instruments Incorporated
C:\Users\wmj\AppData\Local\Temp\1032411                              PAGE  146

    7619              $C$DW$787       .dwtag  DW_TAG_member
    7620                      .dwattr $C$DW$787, DW_AT_type(*$C$DW$T$23)
    7621                      .dwattr $C$DW$787, DW_AT_name("FSTDBYWAIT")
    7622                      .dwattr $C$DW$787, DW_AT_TI_symbol_name("_FSTDBYWAIT")
    7623                      .dwattr $C$DW$787, DW_AT_data_member_location[DW_OP_plus_uconst 0x4]
    7624                      .dwattr $C$DW$787, DW_AT_accessibility(DW_ACCESS_public)
    7625              $C$DW$788       .dwtag  DW_TAG_member
    7626                      .dwattr $C$DW$788, DW_AT_type(*$C$DW$T$23)
    7627                      .dwattr $C$DW$788, DW_AT_name("FACTIVEWAIT")
    7628                      .dwattr $C$DW$788, DW_AT_TI_symbol_name("_FACTIVEWAIT")
    7629                      .dwattr $C$DW$788, DW_AT_data_member_location[DW_OP_plus_uconst 0x5]
    7630                      .dwattr $C$DW$788, DW_AT_accessibility(DW_ACCESS_public)
    7631              $C$DW$789       .dwtag  DW_TAG_member
    7632                      .dwattr $C$DW$789, DW_AT_type(*$C$DW$T$23)
    7633                      .dwattr $C$DW$789, DW_AT_name("FBANKWAIT")
    7634                      .dwattr $C$DW$789, DW_AT_TI_symbol_name("_FBANKWAIT")
    7635                      .dwattr $C$DW$789, DW_AT_data_member_location[DW_OP_plus_uconst 0x6]
    7636                      .dwattr $C$DW$789, DW_AT_accessibility(DW_ACCESS_public)
    7637              $C$DW$790       .dwtag  DW_TAG_member
    7638                      .dwattr $C$DW$790, DW_AT_type(*$C$DW$T$23)
    7639                      .dwattr $C$DW$790, DW_AT_name("FOTPWAIT")
    7640                      .dwattr $C$DW$790, DW_AT_TI_symbol_name("_FOTPWAIT")
    7641                      .dwattr $C$DW$790, DW_AT_data_member_location[DW_OP_plus_uconst 0x7]
    7642                      .dwattr $C$DW$790, DW_AT_accessibility(DW_ACCESS_public)
    7643                      .dwendtag $C$DW$T$79
    7644              
    7645              $C$DW$T$92      .dwtag  DW_TAG_pointer_type
    7646                      .dwattr $C$DW$T$92, DW_AT_type(*$C$DW$T$79)
    7647                      .dwattr $C$DW$T$92, DW_AT_address_class(0x16)
    7648              $C$DW$T$93      .dwtag  DW_TAG_typedef, DW_AT_name("FLASH_Handle")
    7649                      .dwattr $C$DW$T$93, DW_AT_type(*$C$DW$T$92)
    7650                      .dwattr $C$DW$T$93, DW_AT_language(DW_LANG_C)
    7651              
    7652              $C$DW$T$83      .dwtag  DW_TAG_structure_type
    7653                      .dwattr $C$DW$T$83, DW_AT_name("_GPIO_Obj_")
    7654                      .dwattr $C$DW$T$83, DW_AT_byte_size(0x6a)
    7655              $C$DW$791       .dwtag  DW_TAG_member
    7656                      .dwattr $C$DW$791, DW_AT_type(*$C$DW$T$80)
    7657                      .dwattr $C$DW$791, DW_AT_name("GPACTRL")
    7658                      .dwattr $C$DW$791, DW_AT_TI_symbol_name("_GPACTRL")
    7659                      .dwattr $C$DW$791, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    7660                      .dwattr $C$DW$791, DW_AT_accessibility(DW_ACCESS_public)
    7661              $C$DW$792       .dwtag  DW_TAG_member
    7662                      .dwattr $C$DW$792, DW_AT_type(*$C$DW$T$80)
    7663                      .dwattr $C$DW$792, DW_AT_name("GPAQSEL1")
    7664                      .dwattr $C$DW$792, DW_AT_TI_symbol_name("_GPAQSEL1")
    7665                      .dwattr $C$DW$792, DW_AT_data_member_location[DW_OP_plus_uconst 0x2]
    7666                      .dwattr $C$DW$792, DW_AT_accessibility(DW_ACCESS_public)
    7667              $C$DW$793       .dwtag  DW_TAG_member
    7668                      .dwattr $C$DW$793, DW_AT_type(*$C$DW$T$80)
    7669                      .dwattr $C$DW$793, DW_AT_name("GPAQSEL2")
    7670                      .dwattr $C$DW$793, DW_AT_TI_symbol_name("_GPAQSEL2")
    7671                      .dwattr $C$DW$793, DW_AT_data_member_location[DW_OP_plus_uconst 0x4]
    7672                      .dwattr $C$DW$793, DW_AT_accessibility(DW_ACCESS_public)
    7673              $C$DW$794       .dwtag  DW_TAG_member
TMS320C2000 Assembler PC v6.2.5 Tue Nov 21 21:02:52 2017

Tools Copyright (c) 1996-2014 Texas Instruments Incorporated
C:\Users\wmj\AppData\Local\Temp\1032411                              PAGE  147

    7674                      .dwattr $C$DW$794, DW_AT_type(*$C$DW$T$80)
    7675                      .dwattr $C$DW$794, DW_AT_name("GPAMUX1")
    7676                      .dwattr $C$DW$794, DW_AT_TI_symbol_name("_GPAMUX1")
    7677                      .dwattr $C$DW$794, DW_AT_data_member_location[DW_OP_plus_uconst 0x6]
    7678                      .dwattr $C$DW$794, DW_AT_accessibility(DW_ACCESS_public)
    7679              $C$DW$795       .dwtag  DW_TAG_member
    7680                      .dwattr $C$DW$795, DW_AT_type(*$C$DW$T$80)
    7681                      .dwattr $C$DW$795, DW_AT_name("GPAMUX2")
    7682                      .dwattr $C$DW$795, DW_AT_TI_symbol_name("_GPAMUX2")
    7683                      .dwattr $C$DW$795, DW_AT_data_member_location[DW_OP_plus_uconst 0x8]
    7684                      .dwattr $C$DW$795, DW_AT_accessibility(DW_ACCESS_public)
    7685              $C$DW$796       .dwtag  DW_TAG_member
    7686                      .dwattr $C$DW$796, DW_AT_type(*$C$DW$T$80)
    7687                      .dwattr $C$DW$796, DW_AT_name("GPADIR")
    7688                      .dwattr $C$DW$796, DW_AT_TI_symbol_name("_GPADIR")
    7689                      .dwattr $C$DW$796, DW_AT_data_member_location[DW_OP_plus_uconst 0xa]
    7690                      .dwattr $C$DW$796, DW_AT_accessibility(DW_ACCESS_public)
    7691              $C$DW$797       .dwtag  DW_TAG_member
    7692                      .dwattr $C$DW$797, DW_AT_type(*$C$DW$T$80)
    7693                      .dwattr $C$DW$797, DW_AT_name("GPAPUD")
    7694                      .dwattr $C$DW$797, DW_AT_TI_symbol_name("_GPAPUD")
    7695                      .dwattr $C$DW$797, DW_AT_data_member_location[DW_OP_plus_uconst 0xc]
    7696                      .dwattr $C$DW$797, DW_AT_accessibility(DW_ACCESS_public)
    7697              $C$DW$798       .dwtag  DW_TAG_member
    7698                      .dwattr $C$DW$798, DW_AT_type(*$C$DW$T$26)
    7699                      .dwattr $C$DW$798, DW_AT_name("rsvd_1")
    7700                      .dwattr $C$DW$798, DW_AT_TI_symbol_name("_rsvd_1")
    7701                      .dwattr $C$DW$798, DW_AT_data_member_location[DW_OP_plus_uconst 0xe]
    7702                      .dwattr $C$DW$798, DW_AT_accessibility(DW_ACCESS_public)
    7703              $C$DW$799       .dwtag  DW_TAG_member
    7704                      .dwattr $C$DW$799, DW_AT_type(*$C$DW$T$80)
    7705                      .dwattr $C$DW$799, DW_AT_name("GPBCTRL")
    7706                      .dwattr $C$DW$799, DW_AT_TI_symbol_name("_GPBCTRL")
    7707                      .dwattr $C$DW$799, DW_AT_data_member_location[DW_OP_plus_uconst 0x10]
    7708                      .dwattr $C$DW$799, DW_AT_accessibility(DW_ACCESS_public)
    7709              $C$DW$800       .dwtag  DW_TAG_member
    7710                      .dwattr $C$DW$800, DW_AT_type(*$C$DW$T$80)
    7711                      .dwattr $C$DW$800, DW_AT_name("GPBQSEL1")
    7712                      .dwattr $C$DW$800, DW_AT_TI_symbol_name("_GPBQSEL1")
    7713                      .dwattr $C$DW$800, DW_AT_data_member_location[DW_OP_plus_uconst 0x12]
    7714                      .dwattr $C$DW$800, DW_AT_accessibility(DW_ACCESS_public)
    7715              $C$DW$801       .dwtag  DW_TAG_member
    7716                      .dwattr $C$DW$801, DW_AT_type(*$C$DW$T$26)
    7717                      .dwattr $C$DW$801, DW_AT_name("rsvd_2")
    7718                      .dwattr $C$DW$801, DW_AT_TI_symbol_name("_rsvd_2")
    7719                      .dwattr $C$DW$801, DW_AT_data_member_location[DW_OP_plus_uconst 0x14]
    7720                      .dwattr $C$DW$801, DW_AT_accessibility(DW_ACCESS_public)
    7721              $C$DW$802       .dwtag  DW_TAG_member
    7722                      .dwattr $C$DW$802, DW_AT_type(*$C$DW$T$80)
    7723                      .dwattr $C$DW$802, DW_AT_name("GPBMUX1")
    7724                      .dwattr $C$DW$802, DW_AT_TI_symbol_name("_GPBMUX1")
    7725                      .dwattr $C$DW$802, DW_AT_data_member_location[DW_OP_plus_uconst 0x16]
    7726                      .dwattr $C$DW$802, DW_AT_accessibility(DW_ACCESS_public)
    7727              $C$DW$803       .dwtag  DW_TAG_member
    7728                      .dwattr $C$DW$803, DW_AT_type(*$C$DW$T$26)
TMS320C2000 Assembler PC v6.2.5 Tue Nov 21 21:02:52 2017

Tools Copyright (c) 1996-2014 Texas Instruments Incorporated
C:\Users\wmj\AppData\Local\Temp\1032411                              PAGE  148

    7729                      .dwattr $C$DW$803, DW_AT_name("rsvd_3")
    7730                      .dwattr $C$DW$803, DW_AT_TI_symbol_name("_rsvd_3")
    7731                      .dwattr $C$DW$803, DW_AT_data_member_location[DW_OP_plus_uconst 0x18]
    7732                      .dwattr $C$DW$803, DW_AT_accessibility(DW_ACCESS_public)
    7733              $C$DW$804       .dwtag  DW_TAG_member
    7734                      .dwattr $C$DW$804, DW_AT_type(*$C$DW$T$80)
    7735                      .dwattr $C$DW$804, DW_AT_name("GPBDIR")
    7736                      .dwattr $C$DW$804, DW_AT_TI_symbol_name("_GPBDIR")
    7737                      .dwattr $C$DW$804, DW_AT_data_member_location[DW_OP_plus_uconst 0x1a]
    7738                      .dwattr $C$DW$804, DW_AT_accessibility(DW_ACCESS_public)
    7739              $C$DW$805       .dwtag  DW_TAG_member
    7740                      .dwattr $C$DW$805, DW_AT_type(*$C$DW$T$80)
    7741                      .dwattr $C$DW$805, DW_AT_name("GPBPUD")
    7742                      .dwattr $C$DW$805, DW_AT_TI_symbol_name("_GPBPUD")
    7743                      .dwattr $C$DW$805, DW_AT_data_member_location[DW_OP_plus_uconst 0x1c]
    7744                      .dwattr $C$DW$805, DW_AT_accessibility(DW_ACCESS_public)
    7745              $C$DW$806       .dwtag  DW_TAG_member
    7746                      .dwattr $C$DW$806, DW_AT_type(*$C$DW$T$81)
    7747                      .dwattr $C$DW$806, DW_AT_name("rsvd_4")
    7748                      .dwattr $C$DW$806, DW_AT_TI_symbol_name("_rsvd_4")
    7749                      .dwattr $C$DW$806, DW_AT_data_member_location[DW_OP_plus_uconst 0x1e]
    7750                      .dwattr $C$DW$806, DW_AT_accessibility(DW_ACCESS_public)
    7751              $C$DW$807       .dwtag  DW_TAG_member
    7752                      .dwattr $C$DW$807, DW_AT_type(*$C$DW$T$80)
    7753                      .dwattr $C$DW$807, DW_AT_name("AIOMUX1")
    7754                      .dwattr $C$DW$807, DW_AT_TI_symbol_name("_AIOMUX1")
    7755                      .dwattr $C$DW$807, DW_AT_data_member_location[DW_OP_plus_uconst 0x36]
    7756                      .dwattr $C$DW$807, DW_AT_accessibility(DW_ACCESS_public)
    7757              $C$DW$808       .dwtag  DW_TAG_member
    7758                      .dwattr $C$DW$808, DW_AT_type(*$C$DW$T$26)
    7759                      .dwattr $C$DW$808, DW_AT_name("rsvd_5")
    7760                      .dwattr $C$DW$808, DW_AT_TI_symbol_name("_rsvd_5")
    7761                      .dwattr $C$DW$808, DW_AT_data_member_location[DW_OP_plus_uconst 0x38]
