TMS320C2000 Assembler PC v15.12.3 Wed Nov 22 00:56:17 2017

Tools Copyright (c) 1996-2015 Texas Instruments Incorporated
C:\Users\wmj\AppData\Local\Temp\0070810                              PAGE    1

       1              ;***************************************************************
       2              ;* TMS320C2000 C/C++ Codegen                   PC v15.12.3.LTS *
       3              ;* Date/Time created: Wed Nov 22 00:56:16 2017                 *
       4              ;***************************************************************
       5                      .compiler_opts --abi=coffabi --float_support=softlib --hll_source=on --mem_model:code=flat --mem_mode
       6        0002  FP      .set    XAR2
       7              
       8              $C$DW$CU        .dwtag  DW_TAG_compile_unit
       9                      .dwattr $C$DW$CU, DW_AT_name("C:/Users/wmj/Desktop/BM1000_v1.1/sw/modules/ctrl/src/32b/ctrl.c")
      10                      .dwattr $C$DW$CU, DW_AT_producer("TI TMS320C2000 C/C++ Codegen PC v15.12.3.LTS Copyright (c) 1996-201
      11                      .dwattr $C$DW$CU, DW_AT_TI_version(0x01)
      12                      .dwattr $C$DW$CU, DW_AT_comp_dir("C:\Users\wmj\Desktop\BM1000_v1.1\sw\solutions\instaspin_foc\boards\
      13              
      14              ;**************************************************************
      15              ;* FUNCTION SYNONYMS                                          *

    7614                      .dwattr $C$DW$620, DW_AT_const_value(0x02)
    7615              
    7616              $C$DW$621       .dwtag  DW_TAG_enumerator
    7617                      .dwattr $C$DW$621, DW_AT_name("EST_State_Rs")
    7618                      .dwattr $C$DW$621, DW_AT_const_value(0x03)
    7619              
    7620              $C$DW$622       .dwtag  DW_TAG_enumerator
    7621                      .dwattr $C$DW$622, DW_AT_name("EST_State_RampUp")
TMS320C2000 Assembler PC v15.12.3 Wed Nov 22 00:56:17 2017

Tools Copyright (c) 1996-2015 Texas Instruments Incorporated
C:\Users\wmj\AppData\Local\Temp\0070810                              PAGE  146

    7622                      .dwattr $C$DW$622, DW_AT_const_value(0x04)
    7623              
    7624              $C$DW$623       .dwtag  DW_TAG_enumerator
    7625                      .dwattr $C$DW$623, DW_AT_name("EST_State_IdRated")
    7626                      .dwattr $C$DW$623, DW_AT_const_value(0x05)
    7627              
    7628              $C$DW$624       .dwtag  DW_TAG_enumerator
    7629                      .dwattr $C$DW$624, DW_AT_name("EST_State_RatedFlux_OL")
    7630                      .dwattr $C$DW$624, DW_AT_const_value(0x06)
    7631              
    7632              $C$DW$625       .dwtag  DW_TAG_enumerator
    7633                      .dwattr $C$DW$625, DW_AT_name("EST_State_RatedFlux")
    7634                      .dwattr $C$DW$625, DW_AT_const_value(0x07)
    7635              
    7636              $C$DW$626       .dwtag  DW_TAG_enumerator
    7637                      .dwattr $C$DW$626, DW_AT_name("EST_State_RampDown")
    7638                      .dwattr $C$DW$626, DW_AT_const_value(0x08)
    7639              
    7640              $C$DW$627       .dwtag  DW_TAG_enumerator
    7641                      .dwattr $C$DW$627, DW_AT_name("EST_State_LockRotor")
    7642                      .dwattr $C$DW$627, DW_AT_const_value(0x09)
    7643              
    7644              $C$DW$628       .dwtag  DW_TAG_enumerator
    7645                      .dwattr $C$DW$628, DW_AT_name("EST_State_Ls")
    7646                      .dwattr $C$DW$628, DW_AT_const_value(0x0a)
    7647              
    7648              $C$DW$629       .dwtag  DW_TAG_enumerator
    7649                      .dwattr $C$DW$629, DW_AT_name("EST_State_Rr")
    7650                      .dwattr $C$DW$629, DW_AT_const_value(0x0b)
    7651              
    7652              $C$DW$630       .dwtag  DW_TAG_enumerator
    7653                      .dwattr $C$DW$630, DW_AT_name("EST_State_MotorIdentified")
    7654                      .dwattr $C$DW$630, DW_AT_const_value(0x0c)
    7655              
    7656              $C$DW$631       .dwtag  DW_TAG_enumerator
    7657                      .dwattr $C$DW$631, DW_AT_name("EST_State_OnLine")
    7658                      .dwattr $C$DW$631, DW_AT_const_value(0x0d)
    7659              
    7660              $C$DW$632       .dwtag  DW_TAG_enumerator
    7661                      .dwattr $C$DW$632, DW_AT_name("EST_numStates")
    7662                      .dwattr $C$DW$632, DW_AT_const_value(0x0e)
    7663              
    7664                      .dwendtag $C$DW$T$174
    7665              
    7666              $C$DW$T$175     .dwtag  DW_TAG_typedef
    7667                      .dwattr $C$DW$T$175, DW_AT_name("EST_State_e")
    7668                      .dwattr $C$DW$T$175, DW_AT_type(*$C$DW$T$174)
    7669                      .dwattr $C$DW$T$175, DW_AT_language(DW_LANG_C)
    7670              
    7671              
    7672              $C$DW$T$179     .dwtag  DW_TAG_enumeration_type
    7673                      .dwattr $C$DW$T$179, DW_AT_byte_size(0x01)
    7674              $C$DW$633       .dwtag  DW_TAG_enumerator
    7675                      .dwattr $C$DW$633, DW_AT_name("CTRL_Type_PID_spd")
    7676                      .dwattr $C$DW$633, DW_AT_const_value(0x00)
TMS320C2000 Assembler PC v15.12.3 Wed Nov 22 00:56:17 2017

Tools Copyright (c) 1996-2015 Texas Instruments Incorporated
C:\Users\wmj\AppData\Local\Temp\0070810                              PAGE  147

    7677              
    7678              $C$DW$634       .dwtag  DW_TAG_enumerator
    7679                      .dwattr $C$DW$634, DW_AT_name("CTRL_Type_PID_Id")
    7680                      .dwattr $C$DW$634, DW_AT_const_value(0x01)
    7681              
    7682              $C$DW$635       .dwtag  DW_TAG_enumerator
    7683                      .dwattr $C$DW$635, DW_AT_name("CTRL_Type_PID_Iq")
    7684                      .dwattr $C$DW$635, DW_AT_const_value(0x02)
    7685              
    7686                      .dwendtag $C$DW$T$179
    7687              
    7688              $C$DW$T$180     .dwtag  DW_TAG_typedef
    7689                      .dwattr $C$DW$T$180, DW_AT_name("CTRL_Type_e")
    7690                      .dwattr $C$DW$T$180, DW_AT_type(*$C$DW$T$179)
    7691                      .dwattr $C$DW$T$180, DW_AT_language(DW_LANG_C)
    7692              
    7693              $C$DW$636       .dwtag  DW_TAG_TI_far_type
    7694                      .dwattr $C$DW$636, DW_AT_type(*$C$DW$T$180)
    7695              
    7696              $C$DW$T$181     .dwtag  DW_TAG_const_type
    7697                      .dwattr $C$DW$T$181, DW_AT_type(*$C$DW$636)
    7698              
    7699              
    7700              $C$DW$T$30      .dwtag  DW_TAG_structure_type
    7701                      .dwattr $C$DW$T$30, DW_AT_name("_ADC_Obj_")
    7702                      .dwattr $C$DW$T$30, DW_AT_byte_size(0x6650)
    7703              $C$DW$637       .dwtag  DW_TAG_member
    7704                      .dwattr $C$DW$637, DW_AT_type(*$C$DW$T$24)
    7705                      .dwattr $C$DW$637, DW_AT_name("ADCRESULT")
    7706                      .dwattr $C$DW$637, DW_AT_TI_symbol_name("_ADCRESULT")
    7707                      .dwattr $C$DW$637, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    7708                      .dwattr $C$DW$637, DW_AT_accessibility(DW_ACCESS_public)
    7709              
    7710              $C$DW$638       .dwtag  DW_TAG_member
    7711                      .dwattr $C$DW$638, DW_AT_type(*$C$DW$T$25)
    7712                      .dwattr $C$DW$638, DW_AT_name("resvd_1")
    7713                      .dwattr $C$DW$638, DW_AT_TI_symbol_name("_resvd_1")
    7714                      .dwattr $C$DW$638, DW_AT_data_member_location[DW_OP_plus_uconst 0x10]
    7715                      .dwattr $C$DW$638, DW_AT_accessibility(DW_ACCESS_public)
    7716              
    7717              $C$DW$639       .dwtag  DW_TAG_member
    7718                      .dwattr $C$DW$639, DW_AT_type(*$C$DW$T$23)
    7719                      .dwattr $C$DW$639, DW_AT_name("ADCCTL1")
    7720                      .dwattr $C$DW$639, DW_AT_TI_symbol_name("_ADCCTL1")
    7721                      .dwattr $C$DW$639, DW_AT_data_member_location[DW_OP_plus_uconst 0x6600]
    7722                      .dwattr $C$DW$639, DW_AT_accessibility(DW_ACCESS_public)
    7723              
    7724              $C$DW$640       .dwtag  DW_TAG_member
    7725                      .dwattr $C$DW$640, DW_AT_type(*$C$DW$T$23)
    7726                      .dwattr $C$DW$640, DW_AT_name("ADCCTL2")
    7727                      .dwattr $C$DW$640, DW_AT_TI_symbol_name("_ADCCTL2")
    7728                      .dwattr $C$DW$640, DW_AT_data_member_location[DW_OP_plus_uconst 0x6601]
    7729                      .dwattr $C$DW$640, DW_AT_accessibility(DW_ACCESS_public)
    7730              
    7731              $C$DW$641       .dwtag  DW_TAG_member
TMS320C2000 Assembler PC v15.12.3 Wed Nov 22 00:56:17 2017

Tools Copyright (c) 1996-2015 Texas Instruments Incorporated
C:\Users\wmj\AppData\Local\Temp\0070810                              PAGE  148

    7732                      .dwattr $C$DW$641, DW_AT_type(*$C$DW$T$26)
    7733                      .dwattr $C$DW$641, DW_AT_name("rsvd_2")
    7734                      .dwattr $C$DW$641, DW_AT_TI_symbol_name("_rsvd_2")
    7735                      .dwattr $C$DW$641, DW_AT_data_member_location[DW_OP_plus_uconst 0x6602]
    7736                      .dwattr $C$DW$641, DW_AT_accessibility(DW_ACCESS_public)
    7737              
    7738              $C$DW$642       .dwtag  DW_TAG_member
    7739                      .dwattr $C$DW$642, DW_AT_type(*$C$DW$T$23)
    7740                      .dwattr $C$DW$642, DW_AT_name("ADCINTFLG")
    7741                      .dwattr $C$DW$642, DW_AT_TI_symbol_name("_ADCINTFLG")
    7742                      .dwattr $C$DW$642, DW_AT_data_member_location[DW_OP_plus_uconst 0x6604]
    7743                      .dwattr $C$DW$642, DW_AT_accessibility(DW_ACCESS_public)
    7744              
    7745              $C$DW$643       .dwtag  DW_TAG_member
    7746                      .dwattr $C$DW$643, DW_AT_type(*$C$DW$T$23)
    7747                      .dwattr $C$DW$643, DW_AT_name("ADCINTFLGCLR")
    7748                      .dwattr $C$DW$643, DW_AT_TI_symbol_name("_ADCINTFLGCLR")
    7749                      .dwattr $C$DW$643, DW_AT_data_member_location[DW_OP_plus_uconst 0x6605]
    7750                      .dwattr $C$DW$643, DW_AT_accessibility(DW_ACCESS_public)
    7751              
    7752              $C$DW$644       .dwtag  DW_TAG_member
    7753                      .dwattr $C$DW$644, DW_AT_type(*$C$DW$T$23)
    7754                      .dwattr $C$DW$644, DW_AT_name("ADCINTOVF")
    7755                      .dwattr $C$DW$644, DW_AT_TI_symbol_name("_ADCINTOVF")
    7756                      .dwattr $C$DW$644, DW_AT_data_member_location[DW_OP_plus_uconst 0x6606]
    7757                      .dwattr $C$DW$644, DW_AT_accessibility(DW_ACCESS_public)
    7758              
    7759              $C$DW$645       .dwtag  DW_TAG_member
    7760                      .dwattr $C$DW$645, DW_AT_type(*$C$DW$T$23)
    7761                      .dwattr $C$DW$645, DW_AT_name("ADCINTOVFCLR")
    7762                      .dwattr $C$DW$645, DW_AT_TI_symbol_name("_ADCINTOVFCLR")
    7763                      .dwattr $C$DW$645, DW_AT_data_member_location[DW_OP_plus_uconst 0x6607]
    7764                      .dwattr $C$DW$645, DW_AT_accessibility(DW_ACCESS_public)
    7765              
    7766              $C$DW$646       .dwtag  DW_TAG_member
    7767                      .dwattr $C$DW$646, DW_AT_type(*$C$DW$T$27)
    7768                      .dwattr $C$DW$646, DW_AT_name("INTSELxNy")
    7769                      .dwattr $C$DW$646, DW_AT_TI_symbol_name("_INTSELxNy")
    7770                      .dwattr $C$DW$646, DW_AT_data_member_location[DW_OP_plus_uconst 0x6608]
    7771                      .dwattr $C$DW$646, DW_AT_accessibility(DW_ACCESS_public)
    7772              
    7773              $C$DW$647       .dwtag  DW_TAG_member
    7774                      .dwattr $C$DW$647, DW_AT_type(*$C$DW$T$28)
    7775                      .dwattr $C$DW$647, DW_AT_name("rsvd_3")
    7776                      .dwattr $C$DW$647, DW_AT_TI_symbol_name("_rsvd_3")
    7777                      .dwattr $C$DW$647, DW_AT_data_member_location[DW_OP_plus_uconst 0x660d]
    7778                      .dwattr $C$DW$647, DW_AT_accessibility(DW_ACCESS_public)
    7779              
    7780              $C$DW$648       .dwtag  DW_TAG_member
    7781                      .dwattr $C$DW$648, DW_AT_type(*$C$DW$T$23)
    7782                      .dwattr $C$DW$648, DW_AT_name("SOCPRICTRL")
    7783                      .dwattr $C$DW$648, DW_AT_TI_symbol_name("_SOCPRICTRL")
    7784                      .dwattr $C$DW$648, DW_AT_data_member_location[DW_OP_plus_uconst 0x6610]
    7785                      .dwattr $C$DW$648, DW_AT_accessibility(DW_ACCESS_public)
    7786              
TMS320C2000 Assembler PC v15.12.3 Wed Nov 22 00:56:17 2017

Tools Copyright (c) 1996-2015 Texas Instruments Incorporated
C:\Users\wmj\AppData\Local\Temp\0070810                              PAGE  149

    7787              $C$DW$649       .dwtag  DW_TAG_member
    7788                      .dwattr $C$DW$649, DW_AT_type(*$C$DW$T$23)
    7789                      .dwattr $C$DW$649, DW_AT_name("rsvd_4")
    7790                      .dwattr $C$DW$649, DW_AT_TI_symbol_name("_rsvd_4")
    7791                      .dwattr $C$DW$649, DW_AT_data_member_location[DW_OP_plus_uconst 0x6611]
    7792                      .dwattr $C$DW$649, DW_AT_accessibility(DW_ACCESS_public)
    7793              
    7794              $C$DW$650       .dwtag  DW_TAG_member
    7795                      .dwattr $C$DW$650, DW_AT_type(*$C$DW$T$23)
    7796                      .dwattr $C$DW$650, DW_AT_name("ADCSAMPLEMODE")
    7797                      .dwattr $C$DW$650, DW_AT_TI_symbol_name("_ADCSAMPLEMODE")
    7798                      .dwattr $C$DW$650, DW_AT_data_member_location[DW_OP_plus_uconst 0x6612]
    7799                      .dwattr $C$DW$650, DW_AT_accessibility(DW_ACCESS_public)
    7800              
    7801              $C$DW$651       .dwtag  DW_TAG_member
    7802                      .dwattr $C$DW$651, DW_AT_type(*$C$DW$T$23)
    7803                      .dwattr $C$DW$651, DW_AT_name("rsvd_5")
    7804                      .dwattr $C$DW$651, DW_AT_TI_symbol_name("_rsvd_5")
    7805                      .dwattr $C$DW$651, DW_AT_data_member_location[DW_OP_plus_uconst 0x6613]
    7806                      .dwattr $C$DW$651, DW_AT_accessibility(DW_ACCESS_public)
    7807              
    7808              $C$DW$652       .dwtag  DW_TAG_member
    7809                      .dwattr $C$DW$652, DW_AT_type(*$C$DW$T$23)
    7810                      .dwattr $C$DW$652, DW_AT_name("ADCINTSOCSEL1")
    7811                      .dwattr $C$DW$652, DW_AT_TI_symbol_name("_ADCINTSOCSEL1")
    7812                      .dwattr $C$DW$652, DW_AT_data_member_location[DW_OP_plus_uconst 0x6614]
    7813                      .dwattr $C$DW$652, DW_AT_accessibility(DW_ACCESS_public)
    7814              
    7815              $C$DW$653       .dwtag  DW_TAG_member
    7816                      .dwattr $C$DW$653, DW_AT_type(*$C$DW$T$23)
    7817                      .dwattr $C$DW$653, DW_AT_name("ADCINTSOCSEL2")
    7818                      .dwattr $C$DW$653, DW_AT_TI_symbol_name("_ADCINTSOCSEL2")
    7819                      .dwattr $C$DW$653, DW_AT_data_member_location[DW_OP_plus_uconst 0x6615]
    7820                      .dwattr $C$DW$653, DW_AT_accessibility(DW_ACCESS_public)
    7821              
    7822              $C$DW$654       .dwtag  DW_TAG_member
    7823                      .dwattr $C$DW$654, DW_AT_type(*$C$DW$T$26)
    7824                      .dwattr $C$DW$654, DW_AT_name("rsvd_6")
    7825                      .dwattr $C$DW$654, DW_AT_TI_symbol_name("_rsvd_6")
    7826                      .dwattr $C$DW$654, DW_AT_data_member_location[DW_OP_plus_uconst 0x6616]
    7827                      .dwattr $C$DW$654, DW_AT_accessibility(DW_ACCESS_public)
    7828              
    7829              $C$DW$655       .dwtag  DW_TAG_member
    7830                      .dwattr $C$DW$655, DW_AT_type(*$C$DW$T$23)
    7831                      .dwattr $C$DW$655, DW_AT_name("ADCSOCFLG1")
    7832                      .dwattr $C$DW$655, DW_AT_TI_symbol_name("_ADCSOCFLG1")
    7833                      .dwattr $C$DW$655, DW_AT_data_member_location[DW_OP_plus_uconst 0x6618]
    7834                      .dwattr $C$DW$655, DW_AT_accessibility(DW_ACCESS_public)
    7835              
    7836              $C$DW$656       .dwtag  DW_TAG_member
    7837                      .dwattr $C$DW$656, DW_AT_type(*$C$DW$T$23)
    7838                      .dwattr $C$DW$656, DW_AT_name("rsvd_7")
    7839                      .dwattr $C$DW$656, DW_AT_TI_symbol_name("_rsvd_7")
    7840                      .dwattr $C$DW$656, DW_AT_data_member_location[DW_OP_plus_uconst 0x6619]
    7841                      .dwattr $C$DW$656, DW_AT_accessibility(DW_ACCESS_public)
TMS320C2000 Assembler PC v15.12.3 Wed Nov 22 00:56:17 2017

Tools Copyright (c) 1996-2015 Texas Instruments Incorporated
C:\Users\wmj\AppData\Local\Temp\0070810                              PAGE  150

    7842              
    7843              $C$DW$657       .dwtag  DW_TAG_member
    7844                      .dwattr $C$DW$657, DW_AT_type(*$C$DW$T$23)
    7845                      .dwattr $C$DW$657, DW_AT_name("ADCSOCFRC1")
    7846                      .dwattr $C$DW$657, DW_AT_TI_symbol_name("_ADCSOCFRC1")
    7847                      .dwattr $C$DW$657, DW_AT_data_member_location[DW_OP_plus_uconst 0x661a]
    7848                      .dwattr $C$DW$657, DW_AT_accessibility(DW_ACCESS_public)
    7849              
    7850              $C$DW$658       .dwtag  DW_TAG_member
    7851                      .dwattr $C$DW$658, DW_AT_type(*$C$DW$T$23)
    7852                      .dwattr $C$DW$658, DW_AT_name("rsvd_8")
    7853                      .dwattr $C$DW$658, DW_AT_TI_symbol_name("_rsvd_8")
    7854                      .dwattr $C$DW$658, DW_AT_data_member_location[DW_OP_plus_uconst 0x661b]
    7855                      .dwattr $C$DW$658, DW_AT_accessibility(DW_ACCESS_public)
    7856              
    7857              $C$DW$659       .dwtag  DW_TAG_member
    7858                      .dwattr $C$DW$659, DW_AT_type(*$C$DW$T$23)
    7859                      .dwattr $C$DW$659, DW_AT_name("ADCSOCOVF1")
    7860                      .dwattr $C$DW$659, DW_AT_TI_symbol_name("_ADCSOCOVF1")
    7861                      .dwattr $C$DW$659, DW_AT_data_member_location[DW_OP_plus_uconst 0x661c]
    7862                      .dwattr $C$DW$659, DW_AT_accessibility(DW_ACCESS_public)
    7863              
    7864              $C$DW$660       .dwtag  DW_TAG_member
    7865                      .dwattr $C$DW$660, DW_AT_type(*$C$DW$T$23)
    7866                      .dwattr $C$DW$660, DW_AT_name("rsvd_9")
    7867                      .dwattr $C$DW$660, DW_AT_TI_symbol_name("_rsvd_9")
    7868                      .dwattr $C$DW$660, DW_AT_data_member_location[DW_OP_plus_uconst 0x661d]
    7869                      .dwattr $C$DW$660, DW_AT_accessibility(DW_ACCESS_public)
    7870              
    7871              $C$DW$661       .dwtag  DW_TAG_member
    7872                      .dwattr $C$DW$661, DW_AT_type(*$C$DW$T$23)
    7873                      .dwattr $C$DW$661, DW_AT_name("ADCSOCOVFCLR1")
    7874                      .dwattr $C$DW$661, DW_AT_TI_symbol_name("_ADCSOCOVFCLR1")
    7875                      .dwattr $C$DW$661, DW_AT_data_member_location[DW_OP_plus_uconst 0x661e]
    7876                      .dwattr $C$DW$661, DW_AT_accessibility(DW_ACCESS_public)
    7877              
    7878              $C$DW$662       .dwtag  DW_TAG_member
    7879                      .dwattr $C$DW$662, DW_AT_type(*$C$DW$T$23)
    7880                      .dwattr $C$DW$662, DW_AT_name("rsvd_10")
    7881                      .dwattr $C$DW$662, DW_AT_TI_symbol_name("_rsvd_10")
    7882                      .dwattr $C$DW$662, DW_AT_data_member_location[DW_OP_plus_uconst 0x661f]
    7883                      .dwattr $C$DW$662, DW_AT_accessibility(DW_ACCESS_public)
    7884              
    7885              $C$DW$663       .dwtag  DW_TAG_member
    7886                      .dwattr $C$DW$663, DW_AT_type(*$C$DW$T$24)
    7887                      .dwattr $C$DW$663, DW_AT_name("ADCSOCxCTL")
    7888                      .dwattr $C$DW$663, DW_AT_TI_symbol_name("_ADCSOCxCTL")
    7889                      .dwattr $C$DW$663, DW_AT_data_member_location[DW_OP_plus_uconst 0x6620]
    7890                      .dwattr $C$DW$663, DW_AT_accessibility(DW_ACCESS_public)
    7891              
    7892              $C$DW$664       .dwtag  DW_TAG_member
    7893                      .dwattr $C$DW$664, DW_AT_type(*$C$DW$T$24)
    7894                      .dwattr $C$DW$664, DW_AT_name("rsvd_11")
    7895                      .dwattr $C$DW$664, DW_AT_TI_symbol_name("_rsvd_11")
    7896                      .dwattr $C$DW$664, DW_AT_data_member_location[DW_OP_plus_uconst 0x6630]
TMS320C2000 Assembler PC v15.12.3 Wed Nov 22 00:56:17 2017

Tools Copyright (c) 1996-2015 Texas Instruments Incorporated
C:\Users\wmj\AppData\Local\Temp\0070810                              PAGE  151

    7897                      .dwattr $C$DW$664, DW_AT_accessibility(DW_ACCESS_public)
    7898              
    7899              $C$DW$665       .dwtag  DW_TAG_member
    7900                      .dwattr $C$DW$665, DW_AT_type(*$C$DW$T$23)
    7901                      .dwattr $C$DW$665, DW_AT_name("ADCREFTRIM")
    7902                      .dwattr $C$DW$665, DW_AT_TI_symbol_name("_ADCREFTRIM")
    7903                      .dwattr $C$DW$665, DW_AT_data_member_location[DW_OP_plus_uconst 0x6640]
    7904                      .dwattr $C$DW$665, DW_AT_accessibility(DW_ACCESS_public)
    7905              
    7906              $C$DW$666       .dwtag  DW_TAG_member
    7907                      .dwattr $C$DW$666, DW_AT_type(*$C$DW$T$23)
    7908                      .dwattr $C$DW$666, DW_AT_name("ADCOFFTRIM")
    7909                      .dwattr $C$DW$666, DW_AT_TI_symbol_name("_ADCOFFTRIM")
    7910                      .dwattr $C$DW$666, DW_AT_data_member_location[DW_OP_plus_uconst 0x6641]
    7911                      .dwattr $C$DW$666, DW_AT_accessibility(DW_ACCESS_public)
    7912              
    7913              $C$DW$667       .dwtag  DW_TAG_member
    7914                      .dwattr $C$DW$667, DW_AT_type(*$C$DW$T$29)
    7915                      .dwattr $C$DW$667, DW_AT_name("resvd_12")
    7916                      .dwattr $C$DW$667, DW_AT_TI_symbol_name("_resvd_12")
    7917                      .dwattr $C$DW$667, DW_AT_data_member_location[DW_OP_plus_uconst 0x6642]
    7918                      .dwattr $C$DW$667, DW_AT_accessibility(DW_ACCESS_public)
    7919              
    7920              $C$DW$668       .dwtag  DW_TAG_member
    7921                      .dwattr $C$DW$668, DW_AT_type(*$C$DW$T$23)
    7922                      .dwattr $C$DW$668, DW_AT_name("ADCREV")
    7923                      .dwattr $C$DW$668, DW_AT_TI_symbol_name("_ADCREV")
    7924                      .dwattr $C$DW$668, DW_AT_data_member_location[DW_OP_plus_uconst 0x664f]
    7925                      .dwattr $C$DW$668, DW_AT_accessibility(DW_ACCESS_public)
    7926              
    7927                      .dwendtag $C$DW$T$30
    7928              
    7929              $C$DW$T$86      .dwtag  DW_TAG_pointer_type
    7930                      .dwattr $C$DW$T$86, DW_AT_type(*$C$DW$T$30)
    7931                      .dwattr $C$DW$T$86, DW_AT_address_class(0x20)
    7932              
    7933              $C$DW$T$87      .dwtag  DW_TAG_typedef
    7934                      .dwattr $C$DW$T$87, DW_AT_name("ADC_Handle")
    7935                      .dwattr $C$DW$T$87, DW_AT_type(*$C$DW$T$86)
    7936                      .dwattr $C$DW$T$87, DW_AT_language(DW_LANG_C)
    7937              
    7938              
    7939              $C$DW$T$34      .dwtag  DW_TAG_structure_type
    7940                      .dwattr $C$DW$T$34, DW_AT_name("_BRAKE_Obj_")
    7941                      .dwattr $C$DW$T$34, DW_AT_byte_size(0x08)
    7942              $C$DW$669       .dwtag  DW_TAG_member
    7943                      .dwattr $C$DW$669, DW_AT_type(*$C$DW$T$31)
    7944                      .dwattr $C$DW$669, DW_AT_name("angle_pu")
    7945                      .dwattr $C$DW$669, DW_AT_TI_symbol_name("_angle_pu")
    7946                      .dwattr $C$DW$669, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    7947                      .dwattr $C$DW$669, DW_AT_accessibility(DW_ACCESS_public)
    7948              
    7949              $C$DW$670       .dwtag  DW_TAG_member
    7950                      .dwattr $C$DW$670, DW_AT_type(*$C$DW$T$32)
    7951                      .dwattr $C$DW$670, DW_AT_name("Idq_brake")
TMS320C2000 Assembler PC v15.12.3 Wed Nov 22 00:56:17 2017

Tools Copyright (c) 1996-2015 Texas Instruments Incorporated
C:\Users\wmj\AppData\Local\Temp\0070810                              PAGE  152

    7952                      .dwattr $C$DW$670, DW_AT_TI_symbol_name("_Idq_brake")
    7953                      .dwattr $C$DW$670, DW_AT_data_member_location[DW_OP_plus_uconst 0x2]
    7954                      .dwattr $C$DW$670, DW_AT_accessibility(DW_ACCESS_public)
    7955              
    7956              $C$DW$671       .dwtag  DW_TAG_member
    7957                      .dwattr $C$DW$671, DW_AT_type(*$C$DW$T$33)
    7958                      .dwattr $C$DW$671, DW_AT_name("brake_enable")
    7959                      .dwattr $C$DW$671, DW_AT_TI_symbol_name("_brake_enable")
    7960                      .dwattr $C$DW$671, DW_AT_data_member_location[DW_OP_plus_uconst 0x6]
    7961                      .dwattr $C$DW$671, DW_AT_accessibility(DW_ACCESS_public)
    7962              
    7963                      .dwendtag $C$DW$T$34
    7964              
    7965              $C$DW$T$73      .dwtag  DW_TAG_typedef
    7966                      .dwattr $C$DW$T$73, DW_AT_name("BRAKE_Obj")
    7967                      .dwattr $C$DW$T$73, DW_AT_type(*$C$DW$T$34)
    7968                      .dwattr $C$DW$T$73, DW_AT_language(DW_LANG_C)
    7969              
    7970              $C$DW$T$71      .dwtag  DW_TAG_pointer_type
    7971                      .dwattr $C$DW$T$71, DW_AT_type(*$C$DW$T$34)
    7972                      .dwattr $C$DW$T$71, DW_AT_address_class(0x20)
    7973              
    7974              $C$DW$T$72      .dwtag  DW_TAG_typedef
    7975                      .dwattr $C$DW$T$72, DW_AT_name("BRAKE_Handle")
    7976                      .dwattr $C$DW$T$72, DW_AT_type(*$C$DW$T$71)
    7977                      .dwattr $C$DW$T$72, DW_AT_language(DW_LANG_C)
    7978              
    7979              
    7980              $C$DW$T$36      .dwtag  DW_TAG_structure_type
    7981                      .dwattr $C$DW$T$36, DW_AT_name("_CLARKE_Obj_")
    7982                      .dwattr $C$DW$T$36, DW_AT_byte_size(0x06)
    7983              $C$DW$672       .dwtag  DW_TAG_member
    7984                      .dwattr $C$DW$672, DW_AT_type(*$C$DW$T$31)
    7985                      .dwattr $C$DW$672, DW_AT_name("alpha_sf")
    7986                      .dwattr $C$DW$672, DW_AT_TI_symbol_name("_alpha_sf")
    7987                      .dwattr $C$DW$672, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    7988                      .dwattr $C$DW$672, DW_AT_accessibility(DW_ACCESS_public)
    7989              
    7990              $C$DW$673       .dwtag  DW_TAG_member
    7991                      .dwattr $C$DW$673, DW_AT_type(*$C$DW$T$31)
    7992                      .dwattr $C$DW$673, DW_AT_name("beta_sf")
    7993                      .dwattr $C$DW$673, DW_AT_TI_symbol_name("_beta_sf")
    7994                      .dwattr $C$DW$673, DW_AT_data_member_location[DW_OP_plus_uconst 0x2]
    7995                      .dwattr $C$DW$673, DW_AT_accessibility(DW_ACCESS_public)
    7996              
    7997              $C$DW$674       .dwtag  DW_TAG_member
    7998                      .dwattr $C$DW$674, DW_AT_type(*$C$DW$T$35)
    7999                      .dwattr $C$DW$674, DW_AT_name("numSensors")
    8000                      .dwattr $C$DW$674, DW_AT_TI_symbol_name("_numSensors")
    8001                      .dwattr $C$DW$674, DW_AT_data_member_location[DW_OP_plus_uconst 0x4]
    8002                      .dwattr $C$DW$674, DW_AT_accessibility(DW_ACCESS_public)
    8003              
    8004                      .dwendtag $C$DW$T$36
    8005              
    8006              $C$DW$T$47      .dwtag  DW_TAG_typedef
TMS320C2000 Assembler PC v15.12.3 Wed Nov 22 00:56:17 2017

Tools Copyright (c) 1996-2015 Texas Instruments Incorporated
C:\Users\wmj\AppData\Local\Temp\0070810                              PAGE  153

    8007                      .dwattr $C$DW$T$47, DW_AT_name("CLARKE_Obj")
    8008                      .dwattr $C$DW$T$47, DW_AT_type(*$C$DW$T$36)
    8009                      .dwattr $C$DW$T$47, DW_AT_language(DW_LANG_C)
    8010              
    8011              $C$DW$T$187     .dwtag  DW_TAG_pointer_type
    8012                      .dwattr $C$DW$T$187, DW_AT_type(*$C$DW$T$47)
    8013                      .dwattr $C$DW$T$187, DW_AT_address_class(0x20)
    8014              
    8015              $C$DW$T$45      .dwtag  DW_TAG_pointer_type
    8016                      .dwattr $C$DW$T$45, DW_AT_type(*$C$DW$T$36)
    8017                      .dwattr $C$DW$T$45, DW_AT_address_class(0x20)
    8018              
    8019              $C$DW$T$46      .dwtag  DW_TAG_typedef
    8020                      .dwattr $C$DW$T$46, DW_AT_name("CLARKE_Handle")
    8021                      .dwattr $C$DW$T$46, DW_AT_type(*$C$DW$T$45)
    8022                      .dwattr $C$DW$T$46, DW_AT_language(DW_LANG_C)
    8023              
    8024              
    8025              $C$DW$T$38      .dwtag  DW_TAG_structure_type
    8026                      .dwattr $C$DW$T$38, DW_AT_name("_CLK_Obj_")
    8027                      .dwattr $C$DW$T$38, DW_AT_byte_size(0x11)
    8028              $C$DW$675       .dwtag  DW_TAG_member
    8029                      .dwattr $C$DW$675, DW_AT_type(*$C$DW$T$23)
    8030                      .dwattr $C$DW$675, DW_AT_name("XCLK")
    8031                      .dwattr $C$DW$675, DW_AT_TI_symbol_name("_XCLK")
    8032                      .dwattr $C$DW$675, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    8033                      .dwattr $C$DW$675, DW_AT_accessibility(DW_ACCESS_public)
    8034              
    8035              $C$DW$676       .dwtag  DW_TAG_member
    8036                      .dwattr $C$DW$676, DW_AT_type(*$C$DW$T$23)
    8037                      .dwattr $C$DW$676, DW_AT_name("rsvd_1")
    8038                      .dwattr $C$DW$676, DW_AT_TI_symbol_name("_rsvd_1")
    8039                      .dwattr $C$DW$676, DW_AT_data_member_location[DW_OP_plus_uconst 0x1]
    8040                      .dwattr $C$DW$676, DW_AT_accessibility(DW_ACCESS_public)
    8041              
    8042              $C$DW$677       .dwtag  DW_TAG_member
    8043                      .dwattr $C$DW$677, DW_AT_type(*$C$DW$T$23)
    8044                      .dwattr $C$DW$677, DW_AT_name("CLKCTL")
    8045                      .dwattr $C$DW$677, DW_AT_TI_symbol_name("_CLKCTL")
    8046                      .dwattr $C$DW$677, DW_AT_data_member_location[DW_OP_plus_uconst 0x2]
    8047                      .dwattr $C$DW$677, DW_AT_accessibility(DW_ACCESS_public)
    8048              
    8049              $C$DW$678       .dwtag  DW_TAG_member
    8050                      .dwattr $C$DW$678, DW_AT_type(*$C$DW$T$37)
    8051                      .dwattr $C$DW$678, DW_AT_name("rsvd_2")
    8052                      .dwattr $C$DW$678, DW_AT_TI_symbol_name("_rsvd_2")
    8053                      .dwattr $C$DW$678, DW_AT_data_member_location[DW_OP_plus_uconst 0x3]
    8054                      .dwattr $C$DW$678, DW_AT_accessibility(DW_ACCESS_public)
    8055              
    8056              $C$DW$679       .dwtag  DW_TAG_member
    8057                      .dwattr $C$DW$679, DW_AT_type(*$C$DW$T$23)
    8058                      .dwattr $C$DW$679, DW_AT_name("LOSPCP")
    8059                      .dwattr $C$DW$679, DW_AT_TI_symbol_name("_LOSPCP")
    8060                      .dwattr $C$DW$679, DW_AT_data_member_location[DW_OP_plus_uconst 0xb]
    8061                      .dwattr $C$DW$679, DW_AT_accessibility(DW_ACCESS_public)
TMS320C2000 Assembler PC v15.12.3 Wed Nov 22 00:56:17 2017

Tools Copyright (c) 1996-2015 Texas Instruments Incorporated
C:\Users\wmj\AppData\Local\Temp\0070810                              PAGE  154

    8062              
    8063              $C$DW$680       .dwtag  DW_TAG_member
    8064                      .dwattr $C$DW$680, DW_AT_type(*$C$DW$T$23)
    8065                      .dwattr $C$DW$680, DW_AT_name("PCLKCR0")
    8066                      .dwattr $C$DW$680, DW_AT_TI_symbol_name("_PCLKCR0")
    8067                      .dwattr $C$DW$680, DW_AT_data_member_location[DW_OP_plus_uconst 0xc]
    8068                      .dwattr $C$DW$680, DW_AT_accessibility(DW_ACCESS_public)
    8069              
    8070              $C$DW$681       .dwtag  DW_TAG_member
    8071                      .dwattr $C$DW$681, DW_AT_type(*$C$DW$T$23)
    8072                      .dwattr $C$DW$681, DW_AT_name("PCLKCR1")
    8073                      .dwattr $C$DW$681, DW_AT_TI_symbol_name("_PCLKCR1")
    8074                      .dwattr $C$DW$681, DW_AT_data_member_location[DW_OP_plus_uconst 0xd]
    8075                      .dwattr $C$DW$681, DW_AT_accessibility(DW_ACCESS_public)
    8076              
    8077              $C$DW$682       .dwtag  DW_TAG_member
    8078                      .dwattr $C$DW$682, DW_AT_type(*$C$DW$T$26)
    8079                      .dwattr $C$DW$682, DW_AT_name("rsvd_3")
    8080                      .dwattr $C$DW$682, DW_AT_TI_symbol_name("_rsvd_3")
    8081                      .dwattr $C$DW$682, DW_AT_data_member_location[DW_OP_plus_uconst 0xe]
    8082                      .dwattr $C$DW$682, DW_AT_accessibility(DW_ACCESS_public)
    8083              
    8084              $C$DW$683       .dwtag  DW_TAG_member
    8085                      .dwattr $C$DW$683, DW_AT_type(*$C$DW$T$23)
    8086                      .dwattr $C$DW$683, DW_AT_name("PCLKCR3")
    8087                      .dwattr $C$DW$683, DW_AT_TI_symbol_name("_PCLKCR3")
    8088                      .dwattr $C$DW$683, DW_AT_data_member_location[DW_OP_plus_uconst 0x10]
    8089                      .dwattr $C$DW$683, DW_AT_accessibility(DW_ACCESS_public)
    8090              
    8091                      .dwendtag $C$DW$T$38
    8092              
    8093              $C$DW$T$88      .dwtag  DW_TAG_pointer_type
    8094                      .dwattr $C$DW$T$88, DW_AT_type(*$C$DW$T$38)
    8095                      .dwattr $C$DW$T$88, DW_AT_address_class(0x20)
    8096              
    8097              $C$DW$T$89      .dwtag  DW_TAG_typedef
    8098                      .dwattr $C$DW$T$89, DW_AT_name("CLK_Handle")
    8099                      .dwattr $C$DW$T$89, DW_AT_type(*$C$DW$T$88)
    8100                      .dwattr $C$DW$T$89, DW_AT_language(DW_LANG_C)
    8101              
    8102              
    8103              $C$DW$T$39      .dwtag  DW_TAG_structure_type
    8104                      .dwattr $C$DW$T$39, DW_AT_name("_CPU_Obj_")
    8105                      .dwattr $C$DW$T$39, DW_AT_byte_size(0x01)
    8106              $C$DW$684       .dwtag  DW_TAG_member
    8107                      .dwattr $C$DW$684, DW_AT_type(*$C$DW$T$35)
    8108                      .dwattr $C$DW$684, DW_AT_name("tmp")
    8109                      .dwattr $C$DW$684, DW_AT_TI_symbol_name("_tmp")
    8110                      .dwattr $C$DW$684, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    8111                      .dwattr $C$DW$684, DW_AT_accessibility(DW_ACCESS_public)
    8112              
    8113                      .dwendtag $C$DW$T$39
    8114              
    8115              $C$DW$T$90      .dwtag  DW_TAG_pointer_type
    8116                      .dwattr $C$DW$T$90, DW_AT_type(*$C$DW$T$39)
TMS320C2000 Assembler PC v15.12.3 Wed Nov 22 00:56:17 2017

Tools Copyright (c) 1996-2015 Texas Instruments Incorporated
C:\Users\wmj\AppData\Local\Temp\0070810                              PAGE  155

    8117                      .dwattr $C$DW$T$90, DW_AT_address_class(0x20)
    8118              
    8119              $C$DW$T$91      .dwtag  DW_TAG_typedef
    8120                      .dwattr $C$DW$T$91, DW_AT_name("CPU_Handle")
    8121                      .dwattr $C$DW$T$91, DW_AT_type(*$C$DW$T$90)
    8122                      .dwattr $C$DW$T$91, DW_AT_language(DW_LANG_C)
    8123              
    8124              
    8125              $C$DW$T$74      .dwtag  DW_TAG_structure_type
    8126                      .dwattr $C$DW$T$74, DW_AT_name("_CTRL_Obj_")
    8127                      .dwattr $C$DW$T$74, DW_AT_byte_size(0x108)
    8128              $C$DW$685       .dwtag  DW_TAG_member
    8129                      .dwattr $C$DW$685, DW_AT_type(*$C$DW$T$40)
    8130                      .dwattr $C$DW$685, DW_AT_name("version")
    8131                      .dwattr $C$DW$685, DW_AT_TI_symbol_name("_version")
    8132                      .dwattr $C$DW$685, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    8133                      .dwattr $C$DW$685, DW_AT_accessibility(DW_ACCESS_public)
    8134              
    8135              $C$DW$686       .dwtag  DW_TAG_member
    8136                      .dwattr $C$DW$686, DW_AT_type(*$C$DW$T$42)
    8137                      .dwattr $C$DW$686, DW_AT_name("state")
    8138                      .dwattr $C$DW$686, DW_AT_TI_symbol_name("_state")
    8139                      .dwattr $C$DW$686, DW_AT_data_member_location[DW_OP_plus_uconst 0x4]
    8140                      .dwattr $C$DW$686, DW_AT_accessibility(DW_ACCESS_public)
    8141              
    8142              $C$DW$687       .dwtag  DW_TAG_member
    8143                      .dwattr $C$DW$687, DW_AT_type(*$C$DW$T$42)
    8144                      .dwattr $C$DW$687, DW_AT_name("prevState")
    8145                      .dwattr $C$DW$687, DW_AT_TI_symbol_name("_prevState")
    8146                      .dwattr $C$DW$687, DW_AT_data_member_location[DW_OP_plus_uconst 0x5]
    8147                      .dwattr $C$DW$687, DW_AT_accessibility(DW_ACCESS_public)
    8148              
    8149              $C$DW$688       .dwtag  DW_TAG_member
    8150                      .dwattr $C$DW$688, DW_AT_type(*$C$DW$T$44)
    8151                      .dwattr $C$DW$688, DW_AT_name("errorCode")
    8152                      .dwattr $C$DW$688, DW_AT_TI_symbol_name("_errorCode")
    8153                      .dwattr $C$DW$688, DW_AT_data_member_location[DW_OP_plus_uconst 0x6]
    8154                      .dwattr $C$DW$688, DW_AT_accessibility(DW_ACCESS_public)
    8155              
    8156              $C$DW$689       .dwtag  DW_TAG_member
    8157                      .dwattr $C$DW$689, DW_AT_type(*$C$DW$T$46)
    8158                      .dwattr $C$DW$689, DW_AT_name("clarkeHandle_I")
    8159                      .dwattr $C$DW$689, DW_AT_TI_symbol_name("_clarkeHandle_I")
    8160                      .dwattr $C$DW$689, DW_AT_data_member_location[DW_OP_plus_uconst 0x8]
    8161                      .dwattr $C$DW$689, DW_AT_accessibility(DW_ACCESS_public)
    8162              
    8163              $C$DW$690       .dwtag  DW_TAG_member
    8164                      .dwattr $C$DW$690, DW_AT_type(*$C$DW$T$47)
    8165                      .dwattr $C$DW$690, DW_AT_name("clarke_I")
    8166                      .dwattr $C$DW$690, DW_AT_TI_symbol_name("_clarke_I")
    8167                      .dwattr $C$DW$690, DW_AT_data_member_location[DW_OP_plus_uconst 0xa]
    8168                      .dwattr $C$DW$690, DW_AT_accessibility(DW_ACCESS_public)
    8169              
    8170              $C$DW$691       .dwtag  DW_TAG_member
    8171                      .dwattr $C$DW$691, DW_AT_type(*$C$DW$T$46)
TMS320C2000 Assembler PC v15.12.3 Wed Nov 22 00:56:17 2017

Tools Copyright (c) 1996-2015 Texas Instruments Incorporated
C:\Users\wmj\AppData\Local\Temp\0070810                              PAGE  156

    8172                      .dwattr $C$DW$691, DW_AT_name("clarkeHandle_V")
    8173                      .dwattr $C$DW$691, DW_AT_TI_symbol_name("_clarkeHandle_V")
    8174                      .dwattr $C$DW$691, DW_AT_data_member_location[DW_OP_plus_uconst 0x10]
    8175                      .dwattr $C$DW$691, DW_AT_accessibility(DW_ACCESS_public)
    8176              
    8177              $C$DW$692       .dwtag  DW_TAG_member
    8178                      .dwattr $C$DW$692, DW_AT_type(*$C$DW$T$47)
    8179                      .dwattr $C$DW$692, DW_AT_name("clarke_V")
    8180                      .dwattr $C$DW$692, DW_AT_TI_symbol_name("_clarke_V")
    8181                      .dwattr $C$DW$692, DW_AT_data_member_location[DW_OP_plus_uconst 0x12]
    8182                      .dwattr $C$DW$692, DW_AT_accessibility(DW_ACCESS_public)
    8183              
    8184              $C$DW$693       .dwtag  DW_TAG_member
    8185                      .dwattr $C$DW$693, DW_AT_type(*$C$DW$T$49)
    8186                      .dwattr $C$DW$693, DW_AT_name("estHandle")
    8187                      .dwattr $C$DW$693, DW_AT_TI_symbol_name("_estHandle")
    8188                      .dwattr $C$DW$693, DW_AT_data_member_location[DW_OP_plus_uconst 0x18]
    8189                      .dwattr $C$DW$693, DW_AT_accessibility(DW_ACCESS_public)
    8190              
    8191              $C$DW$694       .dwtag  DW_TAG_member
    8192                      .dwattr $C$DW$694, DW_AT_type(*$C$DW$T$51)
    8193                      .dwattr $C$DW$694, DW_AT_name("parkHandle")
    8194                      .dwattr $C$DW$694, DW_AT_TI_symbol_name("_parkHandle")
    8195                      .dwattr $C$DW$694, DW_AT_data_member_location[DW_OP_plus_uconst 0x1a]
    8196                      .dwattr $C$DW$694, DW_AT_accessibility(DW_ACCESS_public)
    8197              
    8198              $C$DW$695       .dwtag  DW_TAG_member
    8199                      .dwattr $C$DW$695, DW_AT_type(*$C$DW$T$52)
    8200                      .dwattr $C$DW$695, DW_AT_name("park")
    8201                      .dwattr $C$DW$695, DW_AT_TI_symbol_name("_park")
    8202                      .dwattr $C$DW$695, DW_AT_data_member_location[DW_OP_plus_uconst 0x1c]
    8203                      .dwattr $C$DW$695, DW_AT_accessibility(DW_ACCESS_public)
    8204              
    8205              $C$DW$696       .dwtag  DW_TAG_member
    8206                      .dwattr $C$DW$696, DW_AT_type(*$C$DW$T$54)
    8207                      .dwattr $C$DW$696, DW_AT_name("pidHandle_Id")
    8208                      .dwattr $C$DW$696, DW_AT_TI_symbol_name("_pidHandle_Id")
    8209                      .dwattr $C$DW$696, DW_AT_data_member_location[DW_OP_plus_uconst 0x20]
    8210                      .dwattr $C$DW$696, DW_AT_accessibility(DW_ACCESS_public)
    8211              
    8212              $C$DW$697       .dwtag  DW_TAG_member
    8213                      .dwattr $C$DW$697, DW_AT_type(*$C$DW$T$55)
    8214                      .dwattr $C$DW$697, DW_AT_name("pid_Id")
    8215                      .dwattr $C$DW$697, DW_AT_TI_symbol_name("_pid_Id")
    8216                      .dwattr $C$DW$697, DW_AT_data_member_location[DW_OP_plus_uconst 0x22]
    8217                      .dwattr $C$DW$697, DW_AT_accessibility(DW_ACCESS_public)
    8218              
    8219              $C$DW$698       .dwtag  DW_TAG_member
    8220                      .dwattr $C$DW$698, DW_AT_type(*$C$DW$T$54)
    8221                      .dwattr $C$DW$698, DW_AT_name("pidHandle_Iq")
    8222                      .dwattr $C$DW$698, DW_AT_TI_symbol_name("_pidHandle_Iq")
    8223                      .dwattr $C$DW$698, DW_AT_data_member_location[DW_OP_plus_uconst 0x32]
    8224                      .dwattr $C$DW$698, DW_AT_accessibility(DW_ACCESS_public)
    8225              
    8226              $C$DW$699       .dwtag  DW_TAG_member
TMS320C2000 Assembler PC v15.12.3 Wed Nov 22 00:56:17 2017

Tools Copyright (c) 1996-2015 Texas Instruments Incorporated
C:\Users\wmj\AppData\Local\Temp\0070810                              PAGE  157

    8227                      .dwattr $C$DW$699, DW_AT_type(*$C$DW$T$55)
    8228                      .dwattr $C$DW$699, DW_AT_name("pid_Iq")
    8229                      .dwattr $C$DW$699, DW_AT_TI_symbol_name("_pid_Iq")
    8230                      .dwattr $C$DW$699, DW_AT_data_member_location[DW_OP_plus_uconst 0x34]
    8231                      .dwattr $C$DW$699, DW_AT_accessibility(DW_ACCESS_public)
    8232              
    8233              $C$DW$700       .dwtag  DW_TAG_member
    8234                      .dwattr $C$DW$700, DW_AT_type(*$C$DW$T$54)
    8235                      .dwattr $C$DW$700, DW_AT_name("pidHandle_spd")
    8236                      .dwattr $C$DW$700, DW_AT_TI_symbol_name("_pidHandle_spd")
    8237                      .dwattr $C$DW$700, DW_AT_data_member_location[DW_OP_plus_uconst 0x44]
    8238                      .dwattr $C$DW$700, DW_AT_accessibility(DW_ACCESS_public)
    8239              
    8240              $C$DW$701       .dwtag  DW_TAG_member
    8241                      .dwattr $C$DW$701, DW_AT_type(*$C$DW$T$55)
    8242                      .dwattr $C$DW$701, DW_AT_name("pid_spd")
    8243                      .dwattr $C$DW$701, DW_AT_TI_symbol_name("_pid_spd")
    8244                      .dwattr $C$DW$701, DW_AT_data_member_location[DW_OP_plus_uconst 0x46]
    8245                      .dwattr $C$DW$701, DW_AT_accessibility(DW_ACCESS_public)
    8246              
    8247              $C$DW$702       .dwtag  DW_TAG_member
    8248                      .dwattr $C$DW$702, DW_AT_type(*$C$DW$T$57)
    8249                      .dwattr $C$DW$702, DW_AT_name("iparkHandle")
    8250                      .dwattr $C$DW$702, DW_AT_TI_symbol_name("_iparkHandle")
    8251                      .dwattr $C$DW$702, DW_AT_data_member_location[DW_OP_plus_uconst 0x56]
    8252                      .dwattr $C$DW$702, DW_AT_accessibility(DW_ACCESS_public)
    8253              
    8254              $C$DW$703       .dwtag  DW_TAG_member
    8255                      .dwattr $C$DW$703, DW_AT_type(*$C$DW$T$58)
    8256                      .dwattr $C$DW$703, DW_AT_name("ipark")
    8257                      .dwattr $C$DW$703, DW_AT_TI_symbol_name("_ipark")
    8258                      .dwattr $C$DW$703, DW_AT_data_member_location[DW_OP_plus_uconst 0x58]
    8259                      .dwattr $C$DW$703, DW_AT_accessibility(DW_ACCESS_public)
    8260              
    8261              $C$DW$704       .dwtag  DW_TAG_member
    8262                      .dwattr $C$DW$704, DW_AT_type(*$C$DW$T$60)
    8263                      .dwattr $C$DW$704, DW_AT_name("svgenHandle")
    8264                      .dwattr $C$DW$704, DW_AT_TI_symbol_name("_svgenHandle")
    8265                      .dwattr $C$DW$704, DW_AT_data_member_location[DW_OP_plus_uconst 0x5c]
    8266                      .dwattr $C$DW$704, DW_AT_accessibility(DW_ACCESS_public)
    8267              
    8268              $C$DW$705       .dwtag  DW_TAG_member
    8269                      .dwattr $C$DW$705, DW_AT_type(*$C$DW$T$61)
    8270                      .dwattr $C$DW$705, DW_AT_name("svgen")
    8271                      .dwattr $C$DW$705, DW_AT_TI_symbol_name("_svgen")
    8272                      .dwattr $C$DW$705, DW_AT_data_member_location[DW_OP_plus_uconst 0x5e]
    8273                      .dwattr $C$DW$705, DW_AT_accessibility(DW_ACCESS_public)
    8274              
    8275              $C$DW$706       .dwtag  DW_TAG_member
    8276                      .dwattr $C$DW$706, DW_AT_type(*$C$DW$T$63)
    8277                      .dwattr $C$DW$706, DW_AT_name("trajHandle_Id")
    8278                      .dwattr $C$DW$706, DW_AT_TI_symbol_name("_trajHandle_Id")
    8279                      .dwattr $C$DW$706, DW_AT_data_member_location[DW_OP_plus_uconst 0x60]
    8280                      .dwattr $C$DW$706, DW_AT_accessibility(DW_ACCESS_public)
    8281              
TMS320C2000 Assembler PC v15.12.3 Wed Nov 22 00:56:17 2017

Tools Copyright (c) 1996-2015 Texas Instruments Incorporated
C:\Users\wmj\AppData\Local\Temp\0070810                              PAGE  158

    8282              $C$DW$707       .dwtag  DW_TAG_member
    8283                      .dwattr $C$DW$707, DW_AT_type(*$C$DW$T$64)
    8284                      .dwattr $C$DW$707, DW_AT_name("traj_Id")
    8285                      .dwattr $C$DW$707, DW_AT_TI_symbol_name("_traj_Id")
    8286                      .dwattr $C$DW$707, DW_AT_data_member_location[DW_OP_plus_uconst 0x62]
    8287                      .dwattr $C$DW$707, DW_AT_accessibility(DW_ACCESS_public)
    8288              
    8289              $C$DW$708       .dwtag  DW_TAG_member
    8290                      .dwattr $C$DW$708, DW_AT_type(*$C$DW$T$63)
    8291                      .dwattr $C$DW$708, DW_AT_name("trajHandle_spd")
    8292                      .dwattr $C$DW$708, DW_AT_TI_symbol_name("_trajHandle_spd")
    8293                      .dwattr $C$DW$708, DW_AT_data_member_location[DW_OP_plus_uconst 0x6c]
    8294                      .dwattr $C$DW$708, DW_AT_accessibility(DW_ACCESS_public)
    8295              
    8296              $C$DW$709       .dwtag  DW_TAG_member
    8297                      .dwattr $C$DW$709, DW_AT_type(*$C$DW$T$64)
    8298                      .dwattr $C$DW$709, DW_AT_name("traj_spd")
    8299                      .dwattr $C$DW$709, DW_AT_TI_symbol_name("_traj_spd")
    8300                      .dwattr $C$DW$709, DW_AT_data_member_location[DW_OP_plus_uconst 0x6e]
    8301                      .dwattr $C$DW$709, DW_AT_accessibility(DW_ACCESS_public)
    8302              
    8303              $C$DW$710       .dwtag  DW_TAG_member
    8304                      .dwattr $C$DW$710, DW_AT_type(*$C$DW$T$63)
    8305                      .dwattr $C$DW$710, DW_AT_name("trajHandle_spdMax")
    8306                      .dwattr $C$DW$710, DW_AT_TI_symbol_name("_trajHandle_spdMax")
    8307                      .dwattr $C$DW$710, DW_AT_data_member_location[DW_OP_plus_uconst 0x78]
    8308                      .dwattr $C$DW$710, DW_AT_accessibility(DW_ACCESS_public)
    8309              
    8310              $C$DW$711       .dwtag  DW_TAG_member
    8311                      .dwattr $C$DW$711, DW_AT_type(*$C$DW$T$64)
    8312                      .dwattr $C$DW$711, DW_AT_name("traj_spdMax")
    8313                      .dwattr $C$DW$711, DW_AT_TI_symbol_name("_traj_spdMax")
    8314                      .dwattr $C$DW$711, DW_AT_data_member_location[DW_OP_plus_uconst 0x7a]
    8315                      .dwattr $C$DW$711, DW_AT_accessibility(DW_ACCESS_public)
    8316              
    8317              $C$DW$712       .dwtag  DW_TAG_member
    8318                      .dwattr $C$DW$712, DW_AT_type(*$C$DW$T$65)
    8319                      .dwattr $C$DW$712, DW_AT_name("motorParams")
    8320                      .dwattr $C$DW$712, DW_AT_TI_symbol_name("_motorParams")
    8321                      .dwattr $C$DW$712, DW_AT_data_member_location[DW_OP_plus_uconst 0x84]
    8322                      .dwattr $C$DW$712, DW_AT_accessibility(DW_ACCESS_public)
    8323              
    8324              $C$DW$713       .dwtag  DW_TAG_member
    8325                      .dwattr $C$DW$713, DW_AT_type(*$C$DW$T$68)
    8326                      .dwattr $C$DW$713, DW_AT_name("waitTimes")
    8327                      .dwattr $C$DW$713, DW_AT_TI_symbol_name("_waitTimes")
    8328                      .dwattr $C$DW$713, DW_AT_data_member_location[DW_OP_plus_uconst 0x92]
    8329                      .dwattr $C$DW$713, DW_AT_accessibility(DW_ACCESS_public)
    8330              
    8331              $C$DW$714       .dwtag  DW_TAG_member
    8332                      .dwattr $C$DW$714, DW_AT_type(*$C$DW$T$67)
    8333                      .dwattr $C$DW$714, DW_AT_name("counter_state")
    8334                      .dwattr $C$DW$714, DW_AT_TI_symbol_name("_counter_state")
    8335                      .dwattr $C$DW$714, DW_AT_data_member_location[DW_OP_plus_uconst 0x9a]
    8336                      .dwattr $C$DW$714, DW_AT_accessibility(DW_ACCESS_public)
TMS320C2000 Assembler PC v15.12.3 Wed Nov 22 00:56:17 2017

Tools Copyright (c) 1996-2015 Texas Instruments Incorporated
C:\Users\wmj\AppData\Local\Temp\0070810                              PAGE  159

    8337              
    8338              $C$DW$715       .dwtag  DW_TAG_member
    8339                      .dwattr $C$DW$715, DW_AT_type(*$C$DW$T$69)
    8340                      .dwattr $C$DW$715, DW_AT_name("numIsrTicksPerCtrlTick")
    8341                      .dwattr $C$DW$715, DW_AT_TI_symbol_name("_numIsrTicksPerCtrlTick")
    8342                      .dwattr $C$DW$715, DW_AT_data_member_location[DW_OP_plus_uconst 0x9c]
    8343                      .dwattr $C$DW$715, DW_AT_accessibility(DW_ACCESS_public)
    8344              
    8345              $C$DW$716       .dwtag  DW_TAG_member
    8346                      .dwattr $C$DW$716, DW_AT_type(*$C$DW$T$69)
    8347                      .dwattr $C$DW$716, DW_AT_name("numCtrlTicksPerCurrentTick")
    8348                      .dwattr $C$DW$716, DW_AT_TI_symbol_name("_numCtrlTicksPerCurrentTick")
    8349                      .dwattr $C$DW$716, DW_AT_data_member_location[DW_OP_plus_uconst 0x9d]
    8350                      .dwattr $C$DW$716, DW_AT_accessibility(DW_ACCESS_public)
    8351              
    8352              $C$DW$717       .dwtag  DW_TAG_member
    8353                      .dwattr $C$DW$717, DW_AT_type(*$C$DW$T$69)
    8354                      .dwattr $C$DW$717, DW_AT_name("numCtrlTicksPerSpeedTick")
    8355                      .dwattr $C$DW$717, DW_AT_TI_symbol_name("_numCtrlTicksPerSpeedTick")
    8356                      .dwattr $C$DW$717, DW_AT_data_member_location[DW_OP_plus_uconst 0x9e]
    8357                      .dwattr $C$DW$717, DW_AT_accessibility(DW_ACCESS_public)
    8358              
    8359              $C$DW$718       .dwtag  DW_TAG_member
    8360                      .dwattr $C$DW$718, DW_AT_type(*$C$DW$T$69)
    8361                      .dwattr $C$DW$718, DW_AT_name("numCtrlTicksPerTrajTick")
    8362                      .dwattr $C$DW$718, DW_AT_TI_symbol_name("_numCtrlTicksPerTrajTick")
    8363                      .dwattr $C$DW$718, DW_AT_data_member_location[DW_OP_plus_uconst 0x9f]
    8364                      .dwattr $C$DW$718, DW_AT_accessibility(DW_ACCESS_public)
    8365              
    8366              $C$DW$719       .dwtag  DW_TAG_member
    8367                      .dwattr $C$DW$719, DW_AT_type(*$C$DW$T$67)
    8368                      .dwattr $C$DW$719, DW_AT_name("ctrlFreq_Hz")
    8369                      .dwattr $C$DW$719, DW_AT_TI_symbol_name("_ctrlFreq_Hz")
    8370                      .dwattr $C$DW$719, DW_AT_data_member_location[DW_OP_plus_uconst 0xa0]
    8371                      .dwattr $C$DW$719, DW_AT_accessibility(DW_ACCESS_public)
    8372              
    8373              $C$DW$720       .dwtag  DW_TAG_member
    8374                      .dwattr $C$DW$720, DW_AT_type(*$C$DW$T$67)
    8375                      .dwattr $C$DW$720, DW_AT_name("trajFreq_Hz")
    8376                      .dwattr $C$DW$720, DW_AT_TI_symbol_name("_trajFreq_Hz")
    8377                      .dwattr $C$DW$720, DW_AT_data_member_location[DW_OP_plus_uconst 0xa2]
    8378                      .dwattr $C$DW$720, DW_AT_accessibility(DW_ACCESS_public)
    8379              
    8380              $C$DW$721       .dwtag  DW_TAG_member
    8381                      .dwattr $C$DW$721, DW_AT_type(*$C$DW$T$31)
    8382                      .dwattr $C$DW$721, DW_AT_name("trajPeriod_sec")
    8383                      .dwattr $C$DW$721, DW_AT_TI_symbol_name("_trajPeriod_sec")
    8384                      .dwattr $C$DW$721, DW_AT_data_member_location[DW_OP_plus_uconst 0xa4]
    8385                      .dwattr $C$DW$721, DW_AT_accessibility(DW_ACCESS_public)
    8386              
    8387              $C$DW$722       .dwtag  DW_TAG_member
    8388                      .dwattr $C$DW$722, DW_AT_type(*$C$DW$T$70)
    8389                      .dwattr $C$DW$722, DW_AT_name("ctrlPeriod_sec")
    8390                      .dwattr $C$DW$722, DW_AT_TI_symbol_name("_ctrlPeriod_sec")
    8391                      .dwattr $C$DW$722, DW_AT_data_member_location[DW_OP_plus_uconst 0xa6]
TMS320C2000 Assembler PC v15.12.3 Wed Nov 22 00:56:17 2017

Tools Copyright (c) 1996-2015 Texas Instruments Incorporated
C:\Users\wmj\AppData\Local\Temp\0070810                              PAGE  160

    8392                      .dwattr $C$DW$722, DW_AT_accessibility(DW_ACCESS_public)
    8393              
    8394              $C$DW$723       .dwtag  DW_TAG_member
    8395                      .dwattr $C$DW$723, DW_AT_type(*$C$DW$T$31)
    8396                      .dwattr $C$DW$723, DW_AT_name("maxVsMag_pu")
    8397                      .dwattr $C$DW$723, DW_AT_TI_symbol_name("_maxVsMag_pu")
    8398                      .dwattr $C$DW$723, DW_AT_data_member_location[DW_OP_plus_uconst 0xa8]
    8399                      .dwattr $C$DW$723, DW_AT_accessibility(DW_ACCESS_public)
    8400              
    8401              $C$DW$724       .dwtag  DW_TAG_member
    8402                      .dwattr $C$DW$724, DW_AT_type(*$C$DW$T$32)
    8403                      .dwattr $C$DW$724, DW_AT_name("Iab_in")
    8404                      .dwattr $C$DW$724, DW_AT_TI_symbol_name("_Iab_in")
    8405                      .dwattr $C$DW$724, DW_AT_data_member_location[DW_OP_plus_uconst 0xaa]
    8406                      .dwattr $C$DW$724, DW_AT_accessibility(DW_ACCESS_public)
    8407              
    8408              $C$DW$725       .dwtag  DW_TAG_member
    8409                      .dwattr $C$DW$725, DW_AT_type(*$C$DW$T$32)
    8410                      .dwattr $C$DW$725, DW_AT_name("Iab_filt")
    8411                      .dwattr $C$DW$725, DW_AT_TI_symbol_name("_Iab_filt")
    8412                      .dwattr $C$DW$725, DW_AT_data_member_location[DW_OP_plus_uconst 0xae]
    8413                      .dwattr $C$DW$725, DW_AT_accessibility(DW_ACCESS_public)
    8414              
    8415              $C$DW$726       .dwtag  DW_TAG_member
    8416                      .dwattr $C$DW$726, DW_AT_type(*$C$DW$T$32)
    8417                      .dwattr $C$DW$726, DW_AT_name("Idq_in")
    8418                      .dwattr $C$DW$726, DW_AT_TI_symbol_name("_Idq_in")
    8419                      .dwattr $C$DW$726, DW_AT_data_member_location[DW_OP_plus_uconst 0xb2]
    8420                      .dwattr $C$DW$726, DW_AT_accessibility(DW_ACCESS_public)
    8421              
    8422              $C$DW$727       .dwtag  DW_TAG_member
    8423                      .dwattr $C$DW$727, DW_AT_type(*$C$DW$T$32)
    8424                      .dwattr $C$DW$727, DW_AT_name("Vab_in")
    8425                      .dwattr $C$DW$727, DW_AT_TI_symbol_name("_Vab_in")
    8426                      .dwattr $C$DW$727, DW_AT_data_member_location[DW_OP_plus_uconst 0xb6]
    8427                      .dwattr $C$DW$727, DW_AT_accessibility(DW_ACCESS_public)
    8428              
    8429              $C$DW$728       .dwtag  DW_TAG_member
    8430                      .dwattr $C$DW$728, DW_AT_type(*$C$DW$T$31)
    8431                      .dwattr $C$DW$728, DW_AT_name("spd_out")
    8432                      .dwattr $C$DW$728, DW_AT_TI_symbol_name("_spd_out")
    8433                      .dwattr $C$DW$728, DW_AT_data_member_location[DW_OP_plus_uconst 0xba]
    8434                      .dwattr $C$DW$728, DW_AT_accessibility(DW_ACCESS_public)
    8435              
    8436              $C$DW$729       .dwtag  DW_TAG_member
    8437                      .dwattr $C$DW$729, DW_AT_type(*$C$DW$T$32)
    8438                      .dwattr $C$DW$729, DW_AT_name("Vab_out")
    8439                      .dwattr $C$DW$729, DW_AT_TI_symbol_name("_Vab_out")
    8440                      .dwattr $C$DW$729, DW_AT_data_member_location[DW_OP_plus_uconst 0xbc]
    8441                      .dwattr $C$DW$729, DW_AT_accessibility(DW_ACCESS_public)
    8442              
    8443              $C$DW$730       .dwtag  DW_TAG_member
    8444                      .dwattr $C$DW$730, DW_AT_type(*$C$DW$T$32)
    8445                      .dwattr $C$DW$730, DW_AT_name("Vdq_out")
    8446                      .dwattr $C$DW$730, DW_AT_TI_symbol_name("_Vdq_out")
TMS320C2000 Assembler PC v15.12.3 Wed Nov 22 00:56:17 2017

Tools Copyright (c) 1996-2015 Texas Instruments Incorporated
C:\Users\wmj\AppData\Local\Temp\0070810                              PAGE  161

    8447                      .dwattr $C$DW$730, DW_AT_data_member_location[DW_OP_plus_uconst 0xc0]
    8448                      .dwattr $C$DW$730, DW_AT_accessibility(DW_ACCESS_public)
    8449              
    8450              $C$DW$731       .dwtag  DW_TAG_member
    8451                      .dwattr $C$DW$731, DW_AT_type(*$C$DW$T$70)
    8452                      .dwattr $C$DW$731, DW_AT_name("Rhf")
    8453                      .dwattr $C$DW$731, DW_AT_TI_symbol_name("_Rhf")
    8454                      .dwattr $C$DW$731, DW_AT_data_member_location[DW_OP_plus_uconst 0xc4]
    8455                      .dwattr $C$DW$731, DW_AT_accessibility(DW_ACCESS_public)
    8456              
    8457              $C$DW$732       .dwtag  DW_TAG_member
    8458                      .dwattr $C$DW$732, DW_AT_type(*$C$DW$T$70)
    8459                      .dwattr $C$DW$732, DW_AT_name("Lhf")
    8460                      .dwattr $C$DW$732, DW_AT_TI_symbol_name("_Lhf")
    8461                      .dwattr $C$DW$732, DW_AT_data_member_location[DW_OP_plus_uconst 0xc6]
    8462                      .dwattr $C$DW$732, DW_AT_accessibility(DW_ACCESS_public)
    8463              
    8464              $C$DW$733       .dwtag  DW_TAG_member
    8465                      .dwattr $C$DW$733, DW_AT_type(*$C$DW$T$70)
    8466                      .dwattr $C$DW$733, DW_AT_name("RoverL")
    8467                      .dwattr $C$DW$733, DW_AT_TI_symbol_name("_RoverL")
    8468                      .dwattr $C$DW$733, DW_AT_data_member_location[DW_OP_plus_uconst 0xc8]
    8469                      .dwattr $C$DW$733, DW_AT_accessibility(DW_ACCESS_public)
    8470              
    8471              $C$DW$734       .dwtag  DW_TAG_member
    8472                      .dwattr $C$DW$734, DW_AT_type(*$C$DW$T$31)
    8473                      .dwattr $C$DW$734, DW_AT_name("Kp_Id")
    8474                      .dwattr $C$DW$734, DW_AT_TI_symbol_name("_Kp_Id")
    8475                      .dwattr $C$DW$734, DW_AT_data_member_location[DW_OP_plus_uconst 0xca]
    8476                      .dwattr $C$DW$734, DW_AT_accessibility(DW_ACCESS_public)
    8477              
    8478              $C$DW$735       .dwtag  DW_TAG_member
    8479                      .dwattr $C$DW$735, DW_AT_type(*$C$DW$T$31)
    8480                      .dwattr $C$DW$735, DW_AT_name("Kp_Iq")
    8481                      .dwattr $C$DW$735, DW_AT_TI_symbol_name("_Kp_Iq")
    8482                      .dwattr $C$DW$735, DW_AT_data_member_location[DW_OP_plus_uconst 0xcc]
    8483                      .dwattr $C$DW$735, DW_AT_accessibility(DW_ACCESS_public)
    8484              
    8485              $C$DW$736       .dwtag  DW_TAG_member
    8486                      .dwattr $C$DW$736, DW_AT_type(*$C$DW$T$31)
    8487                      .dwattr $C$DW$736, DW_AT_name("Kp_spd")
    8488                      .dwattr $C$DW$736, DW_AT_TI_symbol_name("_Kp_spd")
    8489                      .dwattr $C$DW$736, DW_AT_data_member_location[DW_OP_plus_uconst 0xce]
    8490                      .dwattr $C$DW$736, DW_AT_accessibility(DW_ACCESS_public)
    8491              
    8492              $C$DW$737       .dwtag  DW_TAG_member
    8493                      .dwattr $C$DW$737, DW_AT_type(*$C$DW$T$31)
    8494                      .dwattr $C$DW$737, DW_AT_name("Ki_Id")
    8495                      .dwattr $C$DW$737, DW_AT_TI_symbol_name("_Ki_Id")
    8496                      .dwattr $C$DW$737, DW_AT_data_member_location[DW_OP_plus_uconst 0xd0]
    8497                      .dwattr $C$DW$737, DW_AT_accessibility(DW_ACCESS_public)
    8498              
    8499              $C$DW$738       .dwtag  DW_TAG_member
    8500                      .dwattr $C$DW$738, DW_AT_type(*$C$DW$T$31)
    8501                      .dwattr $C$DW$738, DW_AT_name("Ki_Iq")
TMS320C2000 Assembler PC v15.12.3 Wed Nov 22 00:56:17 2017

Tools Copyright (c) 1996-2015 Texas Instruments Incorporated
C:\Users\wmj\AppData\Local\Temp\0070810                              PAGE  162

    8502                      .dwattr $C$DW$738, DW_AT_TI_symbol_name("_Ki_Iq")
    8503                      .dwattr $C$DW$738, DW_AT_data_member_location[DW_OP_plus_uconst 0xd2]
    8504                      .dwattr $C$DW$738, DW_AT_accessibility(DW_ACCESS_public)
    8505              
    8506              $C$DW$739       .dwtag  DW_TAG_member
    8507                      .dwattr $C$DW$739, DW_AT_type(*$C$DW$T$31)
    8508                      .dwattr $C$DW$739, DW_AT_name("Ki_spd")
    8509                      .dwattr $C$DW$739, DW_AT_TI_symbol_name("_Ki_spd")
    8510                      .dwattr $C$DW$739, DW_AT_data_member_location[DW_OP_plus_uconst 0xd4]
    8511                      .dwattr $C$DW$739, DW_AT_accessibility(DW_ACCESS_public)
    8512              
    8513              $C$DW$740       .dwtag  DW_TAG_member
    8514                      .dwattr $C$DW$740, DW_AT_type(*$C$DW$T$31)
    8515                      .dwattr $C$DW$740, DW_AT_name("Kd_Id")
    8516                      .dwattr $C$DW$740, DW_AT_TI_symbol_name("_Kd_Id")
    8517                      .dwattr $C$DW$740, DW_AT_data_member_location[DW_OP_plus_uconst 0xd6]
    8518                      .dwattr $C$DW$740, DW_AT_accessibility(DW_ACCESS_public)
    8519              
    8520              $C$DW$741       .dwtag  DW_TAG_member
    8521                      .dwattr $C$DW$741, DW_AT_type(*$C$DW$T$31)
    8522                      .dwattr $C$DW$741, DW_AT_name("Kd_Iq")
    8523                      .dwattr $C$DW$741, DW_AT_TI_symbol_name("_Kd_Iq")
    8524                      .dwattr $C$DW$741, DW_AT_data_member_location[DW_OP_plus_uconst 0xd8]
    8525                      .dwattr $C$DW$741, DW_AT_accessibility(DW_ACCESS_public)
    8526              
    8527              $C$DW$742       .dwtag  DW_TAG_member
    8528                      .dwattr $C$DW$742, DW_AT_type(*$C$DW$T$31)
    8529                      .dwattr $C$DW$742, DW_AT_name("Kd_spd")
    8530                      .dwattr $C$DW$742, DW_AT_TI_symbol_name("_Kd_spd")
    8531                      .dwattr $C$DW$742, DW_AT_data_member_location[DW_OP_plus_uconst 0xda]
    8532                      .dwattr $C$DW$742, DW_AT_accessibility(DW_ACCESS_public)
    8533              
    8534              $C$DW$743       .dwtag  DW_TAG_member
    8535                      .dwattr $C$DW$743, DW_AT_type(*$C$DW$T$31)
    8536                      .dwattr $C$DW$743, DW_AT_name("Ui_Id")
    8537                      .dwattr $C$DW$743, DW_AT_TI_symbol_name("_Ui_Id")
    8538                      .dwattr $C$DW$743, DW_AT_data_member_location[DW_OP_plus_uconst 0xdc]
    8539                      .dwattr $C$DW$743, DW_AT_accessibility(DW_ACCESS_public)
    8540              
    8541              $C$DW$744       .dwtag  DW_TAG_member
    8542                      .dwattr $C$DW$744, DW_AT_type(*$C$DW$T$31)
    8543                      .dwattr $C$DW$744, DW_AT_name("Ui_Iq")
    8544                      .dwattr $C$DW$744, DW_AT_TI_symbol_name("_Ui_Iq")
    8545                      .dwattr $C$DW$744, DW_AT_data_member_location[DW_OP_plus_uconst 0xde]
    8546                      .dwattr $C$DW$744, DW_AT_accessibility(DW_ACCESS_public)
    8547              
    8548              $C$DW$745       .dwtag  DW_TAG_member
    8549                      .dwattr $C$DW$745, DW_AT_type(*$C$DW$T$31)
    8550                      .dwattr $C$DW$745, DW_AT_name("Ui_spd")
    8551                      .dwattr $C$DW$745, DW_AT_TI_symbol_name("_Ui_spd")
    8552                      .dwattr $C$DW$745, DW_AT_data_member_location[DW_OP_plus_uconst 0xe0]
    8553                      .dwattr $C$DW$745, DW_AT_accessibility(DW_ACCESS_public)
    8554              
    8555              $C$DW$746       .dwtag  DW_TAG_member
    8556                      .dwattr $C$DW$746, DW_AT_type(*$C$DW$T$32)
TMS320C2000 Assembler PC v15.12.3 Wed Nov 22 00:56:17 2017

Tools Copyright (c) 1996-2015 Texas Instruments Incorporated
C:\Users\wmj\AppData\Local\Temp\0070810                              PAGE  163

    8557                      .dwattr $C$DW$746, DW_AT_name("Idq_ref")
    8558                      .dwattr $C$DW$746, DW_AT_TI_symbol_name("_Idq_ref")
    8559                      .dwattr $C$DW$746, DW_AT_data_member_location[DW_OP_plus_uconst 0xe2]
    8560                      .dwattr $C$DW$746, DW_AT_accessibility(DW_ACCESS_public)
    8561              
    8562              $C$DW$747       .dwtag  DW_TAG_member
    8563                      .dwattr $C$DW$747, DW_AT_type(*$C$DW$T$31)
    8564                      .dwattr $C$DW$747, DW_AT_name("IdRated")
    8565                      .dwattr $C$DW$747, DW_AT_TI_symbol_name("_IdRated")
    8566                      .dwattr $C$DW$747, DW_AT_data_member_location[DW_OP_plus_uconst 0xe6]
    8567                      .dwattr $C$DW$747, DW_AT_accessibility(DW_ACCESS_public)
    8568              
    8569              $C$DW$748       .dwtag  DW_TAG_member
    8570                      .dwattr $C$DW$748, DW_AT_type(*$C$DW$T$31)
    8571                      .dwattr $C$DW$748, DW_AT_name("spd_ref")
    8572                      .dwattr $C$DW$748, DW_AT_TI_symbol_name("_spd_ref")
    8573                      .dwattr $C$DW$748, DW_AT_data_member_location[DW_OP_plus_uconst 0xe8]
    8574                      .dwattr $C$DW$748, DW_AT_accessibility(DW_ACCESS_public)
    8575              
    8576              $C$DW$749       .dwtag  DW_TAG_member
    8577                      .dwattr $C$DW$749, DW_AT_type(*$C$DW$T$31)
    8578                      .dwattr $C$DW$749, DW_AT_name("spd_max")
    8579                      .dwattr $C$DW$749, DW_AT_TI_symbol_name("_spd_max")
    8580                      .dwattr $C$DW$749, DW_AT_data_member_location[DW_OP_plus_uconst 0xea]
    8581                      .dwattr $C$DW$749, DW_AT_accessibility(DW_ACCESS_public)
    8582              
    8583              $C$DW$750       .dwtag  DW_TAG_member
    8584                      .dwattr $C$DW$750, DW_AT_type(*$C$DW$T$69)
    8585                      .dwattr $C$DW$750, DW_AT_name("counter_current")
    8586                      .dwattr $C$DW$750, DW_AT_TI_symbol_name("_counter_current")
    8587                      .dwattr $C$DW$750, DW_AT_data_member_location[DW_OP_plus_uconst 0xec]
    8588                      .dwattr $C$DW$750, DW_AT_accessibility(DW_ACCESS_public)
    8589              
    8590              $C$DW$751       .dwtag  DW_TAG_member
    8591                      .dwattr $C$DW$751, DW_AT_type(*$C$DW$T$69)
    8592                      .dwattr $C$DW$751, DW_AT_name("counter_isr")
    8593                      .dwattr $C$DW$751, DW_AT_TI_symbol_name("_counter_isr")
    8594                      .dwattr $C$DW$751, DW_AT_data_member_location[DW_OP_plus_uconst 0xed]
    8595                      .dwattr $C$DW$751, DW_AT_accessibility(DW_ACCESS_public)
    8596              
    8597              $C$DW$752       .dwtag  DW_TAG_member
    8598                      .dwattr $C$DW$752, DW_AT_type(*$C$DW$T$69)
    8599                      .dwattr $C$DW$752, DW_AT_name("counter_speed")
    8600                      .dwattr $C$DW$752, DW_AT_TI_symbol_name("_counter_speed")
    8601                      .dwattr $C$DW$752, DW_AT_data_member_location[DW_OP_plus_uconst 0xee]
    8602                      .dwattr $C$DW$752, DW_AT_accessibility(DW_ACCESS_public)
    8603              
    8604              $C$DW$753       .dwtag  DW_TAG_member
    8605                      .dwattr $C$DW$753, DW_AT_type(*$C$DW$T$69)
    8606                      .dwattr $C$DW$753, DW_AT_name("counter_traj")
    8607                      .dwattr $C$DW$753, DW_AT_TI_symbol_name("_counter_traj")
    8608                      .dwattr $C$DW$753, DW_AT_data_member_location[DW_OP_plus_uconst 0xef]
    8609                      .dwattr $C$DW$753, DW_AT_accessibility(DW_ACCESS_public)
    8610              
    8611              $C$DW$754       .dwtag  DW_TAG_member
TMS320C2000 Assembler PC v15.12.3 Wed Nov 22 00:56:17 2017

Tools Copyright (c) 1996-2015 Texas Instruments Incorporated
C:\Users\wmj\AppData\Local\Temp\0070810                              PAGE  164

    8612                      .dwattr $C$DW$754, DW_AT_type(*$C$DW$T$33)
    8613                      .dwattr $C$DW$754, DW_AT_name("flag_enableCtrl")
    8614                      .dwattr $C$DW$754, DW_AT_TI_symbol_name("_flag_enableCtrl")
    8615                      .dwattr $C$DW$754, DW_AT_data_member_location[DW_OP_plus_uconst 0xf0]
    8616                      .dwattr $C$DW$754, DW_AT_accessibility(DW_ACCESS_public)
    8617              
    8618              $C$DW$755       .dwtag  DW_TAG_member
    8619                      .dwattr $C$DW$755, DW_AT_type(*$C$DW$T$33)
    8620                      .dwattr $C$DW$755, DW_AT_name("flag_enableDcBusComp")
    8621                      .dwattr $C$DW$755, DW_AT_TI_symbol_name("_flag_enableDcBusComp")
    8622                      .dwattr $C$DW$755, DW_AT_data_member_location[DW_OP_plus_uconst 0xf1]
    8623                      .dwattr $C$DW$755, DW_AT_accessibility(DW_ACCESS_public)
    8624              
    8625              $C$DW$756       .dwtag  DW_TAG_member
    8626                      .dwattr $C$DW$756, DW_AT_type(*$C$DW$T$33)
    8627                      .dwattr $C$DW$756, DW_AT_name("flag_enablePowerWarp")
    8628                      .dwattr $C$DW$756, DW_AT_TI_symbol_name("_flag_enablePowerWarp")
    8629                      .dwattr $C$DW$756, DW_AT_data_member_location[DW_OP_plus_uconst 0xf2]
    8630                      .dwattr $C$DW$756, DW_AT_accessibility(DW_ACCESS_public)
    8631              
    8632              $C$DW$757       .dwtag  DW_TAG_member
    8633                      .dwattr $C$DW$757, DW_AT_type(*$C$DW$T$33)
    8634                      .dwattr $C$DW$757, DW_AT_name("flag_enableOffset")
    8635                      .dwattr $C$DW$757, DW_AT_TI_symbol_name("_flag_enableOffset")
    8636                      .dwattr $C$DW$757, DW_AT_data_member_location[DW_OP_plus_uconst 0xf3]
    8637                      .dwattr $C$DW$757, DW_AT_accessibility(DW_ACCESS_public)
    8638              
    8639              $C$DW$758       .dwtag  DW_TAG_member
    8640                      .dwattr $C$DW$758, DW_AT_type(*$C$DW$T$33)
    8641                      .dwattr $C$DW$758, DW_AT_name("flag_enableSpeedCtrl")
    8642                      .dwattr $C$DW$758, DW_AT_TI_symbol_name("_flag_enableSpeedCtrl")
    8643                      .dwattr $C$DW$758, DW_AT_data_member_location[DW_OP_plus_uconst 0xf4]
    8644                      .dwattr $C$DW$758, DW_AT_accessibility(DW_ACCESS_public)
    8645              
    8646              $C$DW$759       .dwtag  DW_TAG_member
    8647                      .dwattr $C$DW$759, DW_AT_type(*$C$DW$T$33)
    8648                      .dwattr $C$DW$759, DW_AT_name("flag_enableUserMotorParams")
    8649                      .dwattr $C$DW$759, DW_AT_TI_symbol_name("_flag_enableUserMotorParams")
    8650                      .dwattr $C$DW$759, DW_AT_data_member_location[DW_OP_plus_uconst 0xf5]
    8651                      .dwattr $C$DW$759, DW_AT_accessibility(DW_ACCESS_public)
    8652              
    8653              $C$DW$760       .dwtag  DW_TAG_member
    8654                      .dwattr $C$DW$760, DW_AT_type(*$C$DW$T$33)
    8655                      .dwattr $C$DW$760, DW_AT_name("flag_enableCurrentCtrl")
    8656                      .dwattr $C$DW$760, DW_AT_TI_symbol_name("_flag_enableCurrentCtrl")
    8657                      .dwattr $C$DW$760, DW_AT_data_member_location[DW_OP_plus_uconst 0xf6]
    8658                      .dwattr $C$DW$760, DW_AT_accessibility(DW_ACCESS_public)
    8659              
    8660              $C$DW$761       .dwtag  DW_TAG_member
    8661                      .dwattr $C$DW$761, DW_AT_type(*$C$DW$T$31)
    8662                      .dwattr $C$DW$761, DW_AT_name("spd_outMaxRatio_pu")
    8663                      .dwattr $C$DW$761, DW_AT_TI_symbol_name("_spd_outMaxRatio_pu")
    8664                      .dwattr $C$DW$761, DW_AT_data_member_location[DW_OP_plus_uconst 0xf8]
    8665                      .dwattr $C$DW$761, DW_AT_accessibility(DW_ACCESS_public)
    8666              
TMS320C2000 Assembler PC v15.12.3 Wed Nov 22 00:56:17 2017

Tools Copyright (c) 1996-2015 Texas Instruments Incorporated
C:\Users\wmj\AppData\Local\Temp\0070810                              PAGE  165

    8667              $C$DW$762       .dwtag  DW_TAG_member
    8668                      .dwattr $C$DW$762, DW_AT_type(*$C$DW$T$31)
    8669                      .dwattr $C$DW$762, DW_AT_name("enc_Angle")
    8670                      .dwattr $C$DW$762, DW_AT_TI_symbol_name("_enc_Angle")
    8671                      .dwattr $C$DW$762, DW_AT_data_member_location[DW_OP_plus_uconst 0xfa]
    8672                      .dwattr $C$DW$762, DW_AT_accessibility(DW_ACCESS_public)
    8673              
    8674              $C$DW$763       .dwtag  DW_TAG_member
    8675                      .dwattr $C$DW$763, DW_AT_type(*$C$DW$T$33)
    8676                      .dwattr $C$DW$763, DW_AT_name("flag_enableEncAngle")
    8677                      .dwattr $C$DW$763, DW_AT_TI_symbol_name("_flag_enableEncAngle")
    8678                      .dwattr $C$DW$763, DW_AT_data_member_location[DW_OP_plus_uconst 0xfc]
    8679                      .dwattr $C$DW$763, DW_AT_accessibility(DW_ACCESS_public)
    8680              
    8681              $C$DW$764       .dwtag  DW_TAG_member
    8682                      .dwattr $C$DW$764, DW_AT_type(*$C$DW$T$72)
    8683                      .dwattr $C$DW$764, DW_AT_name("brakeHandle")
    8684                      .dwattr $C$DW$764, DW_AT_TI_symbol_name("_brakeHandle")
    8685                      .dwattr $C$DW$764, DW_AT_data_member_location[DW_OP_plus_uconst 0xfe]
    8686                      .dwattr $C$DW$764, DW_AT_accessibility(DW_ACCESS_public)
    8687              
    8688              $C$DW$765       .dwtag  DW_TAG_member
    8689                      .dwattr $C$DW$765, DW_AT_type(*$C$DW$T$73)
    8690                      .dwattr $C$DW$765, DW_AT_name("brake")
    8691                      .dwattr $C$DW$765, DW_AT_TI_symbol_name("_brake")
    8692                      .dwattr $C$DW$765, DW_AT_data_member_location[DW_OP_plus_uconst 0x100]
    8693                      .dwattr $C$DW$765, DW_AT_accessibility(DW_ACCESS_public)
    8694              
    8695                      .dwendtag $C$DW$T$74
    8696              
    8697              $C$DW$T$188     .dwtag  DW_TAG_typedef
    8698                      .dwattr $C$DW$T$188, DW_AT_name("CTRL_Obj")
    8699                      .dwattr $C$DW$T$188, DW_AT_type(*$C$DW$T$74)
    8700                      .dwattr $C$DW$T$188, DW_AT_language(DW_LANG_C)
    8701              
    8702              $C$DW$T$169     .dwtag  DW_TAG_pointer_type
    8703                      .dwattr $C$DW$T$169, DW_AT_type(*$C$DW$T$74)
    8704                      .dwattr $C$DW$T$169, DW_AT_address_class(0x20)
    8705              
    8706              $C$DW$T$170     .dwtag  DW_TAG_typedef
    8707                      .dwattr $C$DW$T$170, DW_AT_name("CTRL_Handle")
    8708                      .dwattr $C$DW$T$170, DW_AT_type(*$C$DW$T$169)
    8709                      .dwattr $C$DW$T$170, DW_AT_language(DW_LANG_C)
    8710              
    8711              $C$DW$766       .dwtag  DW_TAG_TI_far_type
    8712                      .dwattr $C$DW$766, DW_AT_type(*$C$DW$T$170)
    8713              
    8714              $C$DW$T$189     .dwtag  DW_TAG_const_type
    8715                      .dwattr $C$DW$T$189, DW_AT_type(*$C$DW$766)
    8716              
    8717              
    8718              $C$DW$T$77      .dwtag  DW_TAG_structure_type
    8719                      .dwattr $C$DW$T$77, DW_AT_name("_CTRL_Version_")
    8720                      .dwattr $C$DW$T$77, DW_AT_byte_size(0x04)
    8721              $C$DW$767       .dwtag  DW_TAG_member
TMS320C2000 Assembler PC v15.12.3 Wed Nov 22 00:56:17 2017

Tools Copyright (c) 1996-2015 Texas Instruments Incorporated
C:\Users\wmj\AppData\Local\Temp\0070810                              PAGE  166

    8722                      .dwattr $C$DW$767, DW_AT_type(*$C$DW$T$22)
    8723                      .dwattr $C$DW$767, DW_AT_name("rsvd")
    8724                      .dwattr $C$DW$767, DW_AT_TI_symbol_name("_rsvd")
    8725                      .dwattr $C$DW$767, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    8726                      .dwattr $C$DW$767, DW_AT_accessibility(DW_ACCESS_public)
    8727              
    8728              $C$DW$768       .dwtag  DW_TAG_member
    8729                      .dwattr $C$DW$768, DW_AT_type(*$C$DW$T$76)
    8730                      .dwattr $C$DW$768, DW_AT_name("targetProc")
    8731                      .dwattr $C$DW$768, DW_AT_TI_symbol_name("_targetProc")
    8732                      .dwattr $C$DW$768, DW_AT_data_member_location[DW_OP_plus_uconst 0x1]
    8733                      .dwattr $C$DW$768, DW_AT_accessibility(DW_ACCESS_public)
    8734              
    8735              $C$DW$769       .dwtag  DW_TAG_member
    8736                      .dwattr $C$DW$769, DW_AT_type(*$C$DW$T$22)
    8737                      .dwattr $C$DW$769, DW_AT_name("major")
    8738                      .dwattr $C$DW$769, DW_AT_TI_symbol_name("_major")
    8739                      .dwattr $C$DW$769, DW_AT_data_member_location[DW_OP_plus_uconst 0x2]
    8740                      .dwattr $C$DW$769, DW_AT_accessibility(DW_ACCESS_public)
    8741              
    8742              $C$DW$770       .dwtag  DW_TAG_member
    8743                      .dwattr $C$DW$770, DW_AT_type(*$C$DW$T$22)
    8744                      .dwattr $C$DW$770, DW_AT_name("minor")
    8745                      .dwattr $C$DW$770, DW_AT_TI_symbol_name("_minor")
    8746                      .dwattr $C$DW$770, DW_AT_data_member_location[DW_OP_plus_uconst 0x3]
    8747                      .dwattr $C$DW$770, DW_AT_accessibility(DW_ACCESS_public)
    8748              
    8749                      .dwendtag $C$DW$T$77
    8750              
    8751              $C$DW$T$40      .dwtag  DW_TAG_typedef
    8752                      .dwattr $C$DW$T$40, DW_AT_name("CTRL_Version")
    8753                      .dwattr $C$DW$T$40, DW_AT_type(*$C$DW$T$77)
    8754                      .dwattr $C$DW$T$40, DW_AT_language(DW_LANG_C)
    8755              
    8756              
    8757              $C$DW$T$19      .dwtag  DW_TAG_structure_type
    8758                      .dwattr $C$DW$T$19, DW_AT_name("_EST_Obj_")
    8759                      .dwattr $C$DW$T$19, DW_AT_declaration
    8760                      .dwendtag $C$DW$T$19
    8761              
    8762              $C$DW$T$48      .dwtag  DW_TAG_pointer_type
    8763                      .dwattr $C$DW$T$48, DW_AT_type(*$C$DW$T$19)
    8764                      .dwattr $C$DW$T$48, DW_AT_address_class(0x20)
    8765              
    8766              $C$DW$T$49      .dwtag  DW_TAG_typedef
    8767                      .dwattr $C$DW$T$49, DW_AT_name("EST_Handle")
    8768                      .dwattr $C$DW$T$49, DW_AT_type(*$C$DW$T$48)
    8769                      .dwattr $C$DW$T$49, DW_AT_language(DW_LANG_C)
    8770              
    8771              
    8772              $C$DW$T$78      .dwtag  DW_TAG_structure_type
    8773                      .dwattr $C$DW$T$78, DW_AT_name("_FILTER_FO_")
    8774                      .dwattr $C$DW$T$78, DW_AT_byte_size(0x0a)
    8775              $C$DW$771       .dwtag  DW_TAG_member
    8776                      .dwattr $C$DW$771, DW_AT_type(*$C$DW$T$31)
TMS320C2000 Assembler PC v15.12.3 Wed Nov 22 00:56:17 2017

Tools Copyright (c) 1996-2015 Texas Instruments Incorporated
C:\Users\wmj\AppData\Local\Temp\0070810                              PAGE  167

    8777                      .dwattr $C$DW$771, DW_AT_name("a1")
    8778                      .dwattr $C$DW$771, DW_AT_TI_symbol_name("_a1")
    8779                      .dwattr $C$DW$771, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    8780                      .dwattr $C$DW$771, DW_AT_accessibility(DW_ACCESS_public)
    8781              
    8782              $C$DW$772       .dwtag  DW_TAG_member
    8783                      .dwattr $C$DW$772, DW_AT_type(*$C$DW$T$31)
    8784                      .dwattr $C$DW$772, DW_AT_name("b0")
    8785                      .dwattr $C$DW$772, DW_AT_TI_symbol_name("_b0")
    8786                      .dwattr $C$DW$772, DW_AT_data_member_location[DW_OP_plus_uconst 0x2]
    8787                      .dwattr $C$DW$772, DW_AT_accessibility(DW_ACCESS_public)
    8788              
    8789              $C$DW$773       .dwtag  DW_TAG_member
    8790                      .dwattr $C$DW$773, DW_AT_type(*$C$DW$T$31)
    8791                      .dwattr $C$DW$773, DW_AT_name("b1")
    8792                      .dwattr $C$DW$773, DW_AT_TI_symbol_name("_b1")
    8793                      .dwattr $C$DW$773, DW_AT_data_member_location[DW_OP_plus_uconst 0x4]
    8794                      .dwattr $C$DW$773, DW_AT_accessibility(DW_ACCESS_public)
    8795              
    8796              $C$DW$774       .dwtag  DW_TAG_member
    8797                      .dwattr $C$DW$774, DW_AT_type(*$C$DW$T$31)
    8798                      .dwattr $C$DW$774, DW_AT_name("x1")
    8799                      .dwattr $C$DW$774, DW_AT_TI_symbol_name("_x1")
    8800                      .dwattr $C$DW$774, DW_AT_data_member_location[DW_OP_plus_uconst 0x6]
    8801                      .dwattr $C$DW$774, DW_AT_accessibility(DW_ACCESS_public)
    8802              
    8803              $C$DW$775       .dwtag  DW_TAG_member
    8804                      .dwattr $C$DW$775, DW_AT_type(*$C$DW$T$31)
    8805                      .dwattr $C$DW$775, DW_AT_name("y1")
    8806                      .dwattr $C$DW$775, DW_AT_TI_symbol_name("_y1")
    8807                      .dwattr $C$DW$775, DW_AT_data_member_location[DW_OP_plus_uconst 0x8]
    8808                      .dwattr $C$DW$775, DW_AT_accessibility(DW_ACCESS_public)
    8809              
    8810                      .dwendtag $C$DW$T$78
    8811              
    8812              $C$DW$T$134     .dwtag  DW_TAG_typedef
    8813                      .dwattr $C$DW$T$134, DW_AT_name("FILTER_FO_Obj")
    8814                      .dwattr $C$DW$T$134, DW_AT_type(*$C$DW$T$78)
    8815                      .dwattr $C$DW$T$134, DW_AT_language(DW_LANG_C)
    8816              
    8817              $C$DW$T$191     .dwtag  DW_TAG_pointer_type
    8818                      .dwattr $C$DW$T$191, DW_AT_type(*$C$DW$T$134)
    8819                      .dwattr $C$DW$T$191, DW_AT_address_class(0x20)
    8820              
    8821              
    8822              $C$DW$T$20      .dwtag  DW_TAG_structure_type
    8823                      .dwattr $C$DW$T$20, DW_AT_name("_FILTER_FO_Obj_")
    8824                      .dwattr $C$DW$T$20, DW_AT_declaration
    8825                      .dwendtag $C$DW$T$20
    8826              
    8827              $C$DW$T$135     .dwtag  DW_TAG_pointer_type
    8828                      .dwattr $C$DW$T$135, DW_AT_type(*$C$DW$T$20)
    8829                      .dwattr $C$DW$T$135, DW_AT_address_class(0x20)
    8830              
    8831              $C$DW$T$136     .dwtag  DW_TAG_typedef
TMS320C2000 Assembler PC v15.12.3 Wed Nov 22 00:56:17 2017

Tools Copyright (c) 1996-2015 Texas Instruments Incorporated
C:\Users\wmj\AppData\Local\Temp\0070810                              PAGE  168

    8832                      .dwattr $C$DW$T$136, DW_AT_name("FILTER_FO_Handle")
    8833                      .dwattr $C$DW$T$136, DW_AT_type(*$C$DW$T$135)
    8834                      .dwattr $C$DW$T$136, DW_AT_language(DW_LANG_C)
    8835              
    8836              
    8837              $C$DW$T$79      .dwtag  DW_TAG_structure_type
    8838                      .dwattr $C$DW$T$79, DW_AT_name("_FLASH_Obj_")
    8839                      .dwattr $C$DW$T$79, DW_AT_byte_size(0x08)
    8840              $C$DW$776       .dwtag  DW_TAG_member
    8841                      .dwattr $C$DW$776, DW_AT_type(*$C$DW$T$23)
    8842                      .dwattr $C$DW$776, DW_AT_name("FOPT")
    8843                      .dwattr $C$DW$776, DW_AT_TI_symbol_name("_FOPT")
    8844                      .dwattr $C$DW$776, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    8845                      .dwattr $C$DW$776, DW_AT_accessibility(DW_ACCESS_public)
    8846              
    8847              $C$DW$777       .dwtag  DW_TAG_member
    8848                      .dwattr $C$DW$777, DW_AT_type(*$C$DW$T$23)
    8849                      .dwattr $C$DW$777, DW_AT_name("rsvd_1")
    8850                      .dwattr $C$DW$777, DW_AT_TI_symbol_name("_rsvd_1")
    8851                      .dwattr $C$DW$777, DW_AT_data_member_location[DW_OP_plus_uconst 0x1]
    8852                      .dwattr $C$DW$777, DW_AT_accessibility(DW_ACCESS_public)
    8853              
    8854              $C$DW$778       .dwtag  DW_TAG_member
    8855                      .dwattr $C$DW$778, DW_AT_type(*$C$DW$T$23)
    8856                      .dwattr $C$DW$778, DW_AT_name("FPWR")
    8857                      .dwattr $C$DW$778, DW_AT_TI_symbol_name("_FPWR")
    8858                      .dwattr $C$DW$778, DW_AT_data_member_location[DW_OP_plus_uconst 0x2]
    8859                      .dwattr $C$DW$778, DW_AT_accessibility(DW_ACCESS_public)
    8860              
    8861              $C$DW$779       .dwtag  DW_TAG_member
    8862                      .dwattr $C$DW$779, DW_AT_type(*$C$DW$T$23)
    8863                      .dwattr $C$DW$779, DW_AT_name("FSTATUS")
    8864                      .dwattr $C$DW$779, DW_AT_TI_symbol_name("_FSTATUS")
    8865                      .dwattr $C$DW$779, DW_AT_data_member_location[DW_OP_plus_uconst 0x3]
    8866                      .dwattr $C$DW$779, DW_AT_accessibility(DW_ACCESS_public)
    8867              
    8868              $C$DW$780       .dwtag  DW_TAG_member
    8869                      .dwattr $C$DW$780, DW_AT_type(*$C$DW$T$23)
    8870                      .dwattr $C$DW$780, DW_AT_name("FSTDBYWAIT")
    8871                      .dwattr $C$DW$780, DW_AT_TI_symbol_name("_FSTDBYWAIT")
    8872                      .dwattr $C$DW$780, DW_AT_data_member_location[DW_OP_plus_uconst 0x4]
    8873                      .dwattr $C$DW$780, DW_AT_accessibility(DW_ACCESS_public)
    8874              
    8875              $C$DW$781       .dwtag  DW_TAG_member
    8876                      .dwattr $C$DW$781, DW_AT_type(*$C$DW$T$23)
    8877                      .dwattr $C$DW$781, DW_AT_name("FACTIVEWAIT")
    8878                      .dwattr $C$DW$781, DW_AT_TI_symbol_name("_FACTIVEWAIT")
    8879                      .dwattr $C$DW$781, DW_AT_data_member_location[DW_OP_plus_uconst 0x5]
    8880                      .dwattr $C$DW$781, DW_AT_accessibility(DW_ACCESS_public)
    8881              
    8882              $C$DW$782       .dwtag  DW_TAG_member
    8883                      .dwattr $C$DW$782, DW_AT_type(*$C$DW$T$23)
    8884                      .dwattr $C$DW$782, DW_AT_name("FBANKWAIT")
    8885                      .dwattr $C$DW$782, DW_AT_TI_symbol_name("_FBANKWAIT")
    8886                      .dwattr $C$DW$782, DW_AT_data_member_location[DW_OP_plus_uconst 0x6]
TMS320C2000 Assembler PC v15.12.3 Wed Nov 22 00:56:17 2017

Tools Copyright (c) 1996-2015 Texas Instruments Incorporated
C:\Users\wmj\AppData\Local\Temp\0070810                              PAGE  169

    8887                      .dwattr $C$DW$782, DW_AT_accessibility(DW_ACCESS_public)
    8888              
    8889              $C$DW$783       .dwtag  DW_TAG_member
    8890                      .dwattr $C$DW$783, DW_AT_type(*$C$DW$T$23)
    8891                      .dwattr $C$DW$783, DW_AT_name("FOTPWAIT")
    8892                      .dwattr $C$DW$783, DW_AT_TI_symbol_name("_FOTPWAIT")
    8893                      .dwattr $C$DW$783, DW_AT_data_member_location[DW_OP_plus_uconst 0x7]
    8894                      .dwattr $C$DW$783, DW_AT_accessibility(DW_ACCESS_public)
    8895              
    8896                      .dwendtag $C$DW$T$79
    8897              
    8898              $C$DW$T$92      .dwtag  DW_TAG_pointer_type
    8899                      .dwattr $C$DW$T$92, DW_AT_type(*$C$DW$T$79)
    8900                      .dwattr $C$DW$T$92, DW_AT_address_class(0x20)
    8901              
    8902              $C$DW$T$93      .dwtag  DW_TAG_typedef
    8903                      .dwattr $C$DW$T$93, DW_AT_name("FLASH_Handle")
    8904                      .dwattr $C$DW$T$93, DW_AT_type(*$C$DW$T$92)
    8905                      .dwattr $C$DW$T$93, DW_AT_language(DW_LANG_C)
    8906              
    8907              
    8908              $C$DW$T$83      .dwtag  DW_TAG_structure_type
    8909                      .dwattr $C$DW$T$83, DW_AT_name("_GPIO_Obj_")
    8910                      .dwattr $C$DW$T$83, DW_AT_byte_size(0x6a)
    8911              $C$DW$784       .dwtag  DW_TAG_member
    8912                      .dwattr $C$DW$784, DW_AT_type(*$C$DW$T$80)
    8913                      .dwattr $C$DW$784, DW_AT_name("GPACTRL")
    8914                      .dwattr $C$DW$784, DW_AT_TI_symbol_name("_GPACTRL")
    8915                      .dwattr $C$DW$784, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    8916                      .dwattr $C$DW$784, DW_AT_accessibility(DW_ACCESS_public)
    8917              
    8918              $C$DW$785       .dwtag  DW_TAG_member
    8919                      .dwattr $C$DW$785, DW_AT_type(*$C$DW$T$80)
    8920                      .dwattr $C$DW$785, DW_AT_name("GPAQSEL1")
    8921                      .dwattr $C$DW$785, DW_AT_TI_symbol_name("_GPAQSEL1")
    8922                      .dwattr $C$DW$785, DW_AT_data_member_location[DW_OP_plus_uconst 0x2]
    8923                      .dwattr $C$DW$785, DW_AT_accessibility(DW_ACCESS_public)
    8924              
    8925              $C$DW$786       .dwtag  DW_TAG_member
    8926                      .dwattr $C$DW$786, DW_AT_type(*$C$DW$T$80)
    8927                      .dwattr $C$DW$786, DW_AT_name("GPAQSEL2")
    8928                      .dwattr $C$DW$786, DW_AT_TI_symbol_name("_GPAQSEL2")
    8929                      .dwattr $C$DW$786, DW_AT_data_member_location[DW_OP_plus_uconst 0x4]
    8930                      .dwattr $C$DW$786, DW_AT_accessibility(DW_ACCESS_public)
    8931              
    8932              $C$DW$787       .dwtag  DW_TAG_member
    8933                      .dwattr $C$DW$787, DW_AT_type(*$C$DW$T$80)
    8934                      .dwattr $C$DW$787, DW_AT_name("GPAMUX1")
    8935                      .dwattr $C$DW$787, DW_AT_TI_symbol_name("_GPAMUX1")
    8936                      .dwattr $C$DW$787, DW_AT_data_member_location[DW_OP_plus_uconst 0x6]
    8937                      .dwattr $C$DW$787, DW_AT_accessibility(DW_ACCESS_public)
    8938              
    8939              $C$DW$788       .dwtag  DW_TAG_member
    8940                      .dwattr $C$DW$788, DW_AT_type(*$C$DW$T$80)
    8941                      .dwattr $C$DW$788, DW_AT_name("GPAMUX2")
TMS320C2000 Assembler PC v15.12.3 Wed Nov 22 00:56:17 2017

Tools Copyright (c) 1996-2015 Texas Instruments Incorporated
C:\Users\wmj\AppData\Local\Temp\0070810                              PAGE  170

    8942                      .dwattr $C$DW$788, DW_AT_TI_symbol_name("_GPAMUX2")
    8943                      .dwattr $C$DW$788, DW_AT_data_member_location[DW_OP_plus_uconst 0x8]
    8944                      .dwattr $C$DW$788, DW_AT_accessibility(DW_ACCESS_public)
    8945              
    8946              $C$DW$789       .dwtag  DW_TAG_member
    8947                      .dwattr $C$DW$789, DW_AT_type(*$C$DW$T$80)
    8948                      .dwattr $C$DW$789, DW_AT_name("GPADIR")
    8949                      .dwattr $C$DW$789, DW_AT_TI_symbol_name("_GPADIR")
    8950                      .dwattr $C$DW$789, DW_AT_data_member_location[DW_OP_plus_uconst 0xa]
    8951                      .dwattr $C$DW$789, DW_AT_accessibility(DW_ACCESS_public)
    8952              
