TMS320C2000 Assembler PC v6.2.5 Thu Nov 23 20:51:18 2017

Tools Copyright (c) 1996-2014 Texas Instruments Incorporated
C:\Users\wmj\AppData\Local\Temp\0289211                              PAGE    1

       1              ;***************************************************************
       2              ;* TMS320C2000 C/C++ Codegen                         PC v6.2.5 *
       3              ;* Date/Time created: Thu Nov 23 20:51:17 2017                 *
       4              ;***************************************************************
       5                      .compiler_opts --float_support=softlib --hll_source=on --mem_model:code=flat --mem_model:data=large -
       6        0002  FP      .set    XAR2
       7              
       8              $C$DW$CU        .dwtag  DW_TAG_compile_unit
       9                      .dwattr $C$DW$CU, DW_AT_name("D:/BM1000_v1.1/sw/modules/ctrl/src/32b/ctrl.c")
      10                      .dwattr $C$DW$CU, DW_AT_producer("TMS320C2000 C/C++ Codegen PC v6.2.5 Copyright (c) 1996-2014 Texas I
      11                      .dwattr $C$DW$CU, DW_AT_TI_version(0x01)
      12                      .dwattr $C$DW$CU, DW_AT_comp_dir("D:\BM1000_v1.1\sw\solutions\instaspin_foc\boards\hvkit_rev1p1\f28x\
      13              
      14              ;**************************************************************
      15              ;* FUNCTION SYNONYMS                                          *

    6610              $C$DW$618       .dwtag  DW_TAG_enumerator, DW_AT_name("USER_ErrorCode_estFreq_Hz_High"), DW_AT_const_value(0x
    6611              $C$DW$619       .dwtag  DW_TAG_enumerator, DW_AT_name("USER_ErrorCode_estFreq_Hz_Low"), DW_AT_const_value(0x6
    6612              $C$DW$620       .dwtag  DW_TAG_enumerator, DW_AT_name("USER_ErrorCode_RoverL_estFreq_Hz_High"), DW_AT_const_v
    6613              $C$DW$621       .dwtag  DW_TAG_enumerator, DW_AT_name("USER_ErrorCode_RoverL_estFreq_Hz_Low"), DW_AT_const_va
    6614              $C$DW$622       .dwtag  DW_TAG_enumerator, DW_AT_name("USER_ErrorCode_trajFreq_Hz_High"), DW_AT_const_value(0
    6615              $C$DW$623       .dwtag  DW_TAG_enumerator, DW_AT_name("USER_ErrorCode_trajFreq_Hz_Low"), DW_AT_const_value(0x
    6616              $C$DW$624       .dwtag  DW_TAG_enumerator, DW_AT_name("USER_ErrorCode_ctrlPeriod_sec_High"), DW_AT_const_valu
    6617              $C$DW$625       .dwtag  DW_TAG_enumerator, DW_AT_name("USER_ErrorCode_ctrlPeriod_sec_Low"), DW_AT_const_value
    6618              $C$DW$626       .dwtag  DW_TAG_enumerator, DW_AT_name("USER_ErrorCode_maxNegativeIdCurrent_a_High"), DW_AT_co
    6619              $C$DW$627       .dwtag  DW_TAG_enumerator, DW_AT_name("USER_ErrorCode_maxNegativeIdCurrent_a_Low"), DW_AT_con
    6620              $C$DW$628       .dwtag  DW_TAG_enumerator, DW_AT_name("USER_numErrorCodes"), DW_AT_const_value(0x6a)
TMS320C2000 Assembler PC v6.2.5 Thu Nov 23 20:51:18 2017

Tools Copyright (c) 1996-2014 Texas Instruments Incorporated
C:\Users\wmj\AppData\Local\Temp\0289211                              PAGE  128

    6621                      .dwendtag $C$DW$T$164
    6622              
    6623              $C$DW$T$165     .dwtag  DW_TAG_typedef, DW_AT_name("USER_ErrorCode_e")
    6624                      .dwattr $C$DW$T$165, DW_AT_type(*$C$DW$T$164)
    6625                      .dwattr $C$DW$T$165, DW_AT_language(DW_LANG_C)
    6626              
    6627              $C$DW$T$174     .dwtag  DW_TAG_enumeration_type
    6628                      .dwattr $C$DW$T$174, DW_AT_byte_size(0x01)
    6629              $C$DW$629       .dwtag  DW_TAG_enumerator, DW_AT_name("EST_State_Error"), DW_AT_const_value(0x00)
    6630              $C$DW$630       .dwtag  DW_TAG_enumerator, DW_AT_name("EST_State_Idle"), DW_AT_const_value(0x01)
    6631              $C$DW$631       .dwtag  DW_TAG_enumerator, DW_AT_name("EST_State_RoverL"), DW_AT_const_value(0x02)
    6632              $C$DW$632       .dwtag  DW_TAG_enumerator, DW_AT_name("EST_State_Rs"), DW_AT_const_value(0x03)
    6633              $C$DW$633       .dwtag  DW_TAG_enumerator, DW_AT_name("EST_State_RampUp"), DW_AT_const_value(0x04)
    6634              $C$DW$634       .dwtag  DW_TAG_enumerator, DW_AT_name("EST_State_IdRated"), DW_AT_const_value(0x05)
    6635              $C$DW$635       .dwtag  DW_TAG_enumerator, DW_AT_name("EST_State_RatedFlux_OL"), DW_AT_const_value(0x06)
    6636              $C$DW$636       .dwtag  DW_TAG_enumerator, DW_AT_name("EST_State_RatedFlux"), DW_AT_const_value(0x07)
    6637              $C$DW$637       .dwtag  DW_TAG_enumerator, DW_AT_name("EST_State_RampDown"), DW_AT_const_value(0x08)
    6638              $C$DW$638       .dwtag  DW_TAG_enumerator, DW_AT_name("EST_State_LockRotor"), DW_AT_const_value(0x09)
    6639              $C$DW$639       .dwtag  DW_TAG_enumerator, DW_AT_name("EST_State_Ls"), DW_AT_const_value(0x0a)
    6640              $C$DW$640       .dwtag  DW_TAG_enumerator, DW_AT_name("EST_State_Rr"), DW_AT_const_value(0x0b)
    6641              $C$DW$641       .dwtag  DW_TAG_enumerator, DW_AT_name("EST_State_MotorIdentified"), DW_AT_const_value(0x0c)
    6642              $C$DW$642       .dwtag  DW_TAG_enumerator, DW_AT_name("EST_State_OnLine"), DW_AT_const_value(0x0d)
    6643              $C$DW$643       .dwtag  DW_TAG_enumerator, DW_AT_name("EST_numStates"), DW_AT_const_value(0x0e)
    6644                      .dwendtag $C$DW$T$174
    6645              
    6646              $C$DW$T$175     .dwtag  DW_TAG_typedef, DW_AT_name("EST_State_e")
    6647                      .dwattr $C$DW$T$175, DW_AT_type(*$C$DW$T$174)
    6648                      .dwattr $C$DW$T$175, DW_AT_language(DW_LANG_C)
    6649              
    6650              $C$DW$T$179     .dwtag  DW_TAG_enumeration_type
    6651                      .dwattr $C$DW$T$179, DW_AT_byte_size(0x01)
    6652              $C$DW$644       .dwtag  DW_TAG_enumerator, DW_AT_name("CTRL_Type_PID_spd"), DW_AT_const_value(0x00)
    6653              $C$DW$645       .dwtag  DW_TAG_enumerator, DW_AT_name("CTRL_Type_PID_Id"), DW_AT_const_value(0x01)
    6654              $C$DW$646       .dwtag  DW_TAG_enumerator, DW_AT_name("CTRL_Type_PID_Iq"), DW_AT_const_value(0x02)
    6655                      .dwendtag $C$DW$T$179
    6656              
    6657              $C$DW$T$180     .dwtag  DW_TAG_typedef, DW_AT_name("CTRL_Type_e")
    6658                      .dwattr $C$DW$T$180, DW_AT_type(*$C$DW$T$179)
    6659                      .dwattr $C$DW$T$180, DW_AT_language(DW_LANG_C)
    6660              $C$DW$647       .dwtag  DW_TAG_TI_far_type
    6661                      .dwattr $C$DW$647, DW_AT_type(*$C$DW$T$180)
    6662              $C$DW$T$181     .dwtag  DW_TAG_const_type
    6663                      .dwattr $C$DW$T$181, DW_AT_type(*$C$DW$647)
    6664              
    6665              $C$DW$T$30      .dwtag  DW_TAG_structure_type
    6666                      .dwattr $C$DW$T$30, DW_AT_name("_ADC_Obj_")
    6667                      .dwattr $C$DW$T$30, DW_AT_byte_size(0x6650)
    6668              $C$DW$648       .dwtag  DW_TAG_member
    6669                      .dwattr $C$DW$648, DW_AT_type(*$C$DW$T$24)
    6670                      .dwattr $C$DW$648, DW_AT_name("ADCRESULT")
    6671                      .dwattr $C$DW$648, DW_AT_TI_symbol_name("_ADCRESULT")
    6672                      .dwattr $C$DW$648, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    6673                      .dwattr $C$DW$648, DW_AT_accessibility(DW_ACCESS_public)
    6674              $C$DW$649       .dwtag  DW_TAG_member
    6675                      .dwattr $C$DW$649, DW_AT_type(*$C$DW$T$25)
TMS320C2000 Assembler PC v6.2.5 Thu Nov 23 20:51:18 2017

Tools Copyright (c) 1996-2014 Texas Instruments Incorporated
C:\Users\wmj\AppData\Local\Temp\0289211                              PAGE  129

    6676                      .dwattr $C$DW$649, DW_AT_name("resvd_1")
    6677                      .dwattr $C$DW$649, DW_AT_TI_symbol_name("_resvd_1")
    6678                      .dwattr $C$DW$649, DW_AT_data_member_location[DW_OP_plus_uconst 0x10]
    6679                      .dwattr $C$DW$649, DW_AT_accessibility(DW_ACCESS_public)
    6680              $C$DW$650       .dwtag  DW_TAG_member
    6681                      .dwattr $C$DW$650, DW_AT_type(*$C$DW$T$23)
    6682                      .dwattr $C$DW$650, DW_AT_name("ADCCTL1")
    6683                      .dwattr $C$DW$650, DW_AT_TI_symbol_name("_ADCCTL1")
    6684                      .dwattr $C$DW$650, DW_AT_data_member_location[DW_OP_plus_uconst 0x6600]
    6685                      .dwattr $C$DW$650, DW_AT_accessibility(DW_ACCESS_public)
    6686              $C$DW$651       .dwtag  DW_TAG_member
    6687                      .dwattr $C$DW$651, DW_AT_type(*$C$DW$T$23)
    6688                      .dwattr $C$DW$651, DW_AT_name("ADCCTL2")
    6689                      .dwattr $C$DW$651, DW_AT_TI_symbol_name("_ADCCTL2")
    6690                      .dwattr $C$DW$651, DW_AT_data_member_location[DW_OP_plus_uconst 0x6601]
    6691                      .dwattr $C$DW$651, DW_AT_accessibility(DW_ACCESS_public)
    6692              $C$DW$652       .dwtag  DW_TAG_member
    6693                      .dwattr $C$DW$652, DW_AT_type(*$C$DW$T$26)
    6694                      .dwattr $C$DW$652, DW_AT_name("rsvd_2")
    6695                      .dwattr $C$DW$652, DW_AT_TI_symbol_name("_rsvd_2")
    6696                      .dwattr $C$DW$652, DW_AT_data_member_location[DW_OP_plus_uconst 0x6602]
    6697                      .dwattr $C$DW$652, DW_AT_accessibility(DW_ACCESS_public)
    6698              $C$DW$653       .dwtag  DW_TAG_member
    6699                      .dwattr $C$DW$653, DW_AT_type(*$C$DW$T$23)
    6700                      .dwattr $C$DW$653, DW_AT_name("ADCINTFLG")
    6701                      .dwattr $C$DW$653, DW_AT_TI_symbol_name("_ADCINTFLG")
    6702                      .dwattr $C$DW$653, DW_AT_data_member_location[DW_OP_plus_uconst 0x6604]
    6703                      .dwattr $C$DW$653, DW_AT_accessibility(DW_ACCESS_public)
    6704              $C$DW$654       .dwtag  DW_TAG_member
    6705                      .dwattr $C$DW$654, DW_AT_type(*$C$DW$T$23)
    6706                      .dwattr $C$DW$654, DW_AT_name("ADCINTFLGCLR")
    6707                      .dwattr $C$DW$654, DW_AT_TI_symbol_name("_ADCINTFLGCLR")
    6708                      .dwattr $C$DW$654, DW_AT_data_member_location[DW_OP_plus_uconst 0x6605]
    6709                      .dwattr $C$DW$654, DW_AT_accessibility(DW_ACCESS_public)
    6710              $C$DW$655       .dwtag  DW_TAG_member
    6711                      .dwattr $C$DW$655, DW_AT_type(*$C$DW$T$23)
    6712                      .dwattr $C$DW$655, DW_AT_name("ADCINTOVF")
    6713                      .dwattr $C$DW$655, DW_AT_TI_symbol_name("_ADCINTOVF")
    6714                      .dwattr $C$DW$655, DW_AT_data_member_location[DW_OP_plus_uconst 0x6606]
    6715                      .dwattr $C$DW$655, DW_AT_accessibility(DW_ACCESS_public)
    6716              $C$DW$656       .dwtag  DW_TAG_member
    6717                      .dwattr $C$DW$656, DW_AT_type(*$C$DW$T$23)
    6718                      .dwattr $C$DW$656, DW_AT_name("ADCINTOVFCLR")
    6719                      .dwattr $C$DW$656, DW_AT_TI_symbol_name("_ADCINTOVFCLR")
    6720                      .dwattr $C$DW$656, DW_AT_data_member_location[DW_OP_plus_uconst 0x6607]
    6721                      .dwattr $C$DW$656, DW_AT_accessibility(DW_ACCESS_public)
    6722              $C$DW$657       .dwtag  DW_TAG_member
    6723                      .dwattr $C$DW$657, DW_AT_type(*$C$DW$T$27)
    6724                      .dwattr $C$DW$657, DW_AT_name("INTSELxNy")
    6725                      .dwattr $C$DW$657, DW_AT_TI_symbol_name("_INTSELxNy")
    6726                      .dwattr $C$DW$657, DW_AT_data_member_location[DW_OP_plus_uconst 0x6608]
    6727                      .dwattr $C$DW$657, DW_AT_accessibility(DW_ACCESS_public)
    6728              $C$DW$658       .dwtag  DW_TAG_member
    6729                      .dwattr $C$DW$658, DW_AT_type(*$C$DW$T$28)
    6730                      .dwattr $C$DW$658, DW_AT_name("rsvd_3")
TMS320C2000 Assembler PC v6.2.5 Thu Nov 23 20:51:18 2017

Tools Copyright (c) 1996-2014 Texas Instruments Incorporated
C:\Users\wmj\AppData\Local\Temp\0289211                              PAGE  130

    6731                      .dwattr $C$DW$658, DW_AT_TI_symbol_name("_rsvd_3")
    6732                      .dwattr $C$DW$658, DW_AT_data_member_location[DW_OP_plus_uconst 0x660d]
    6733                      .dwattr $C$DW$658, DW_AT_accessibility(DW_ACCESS_public)
    6734              $C$DW$659       .dwtag  DW_TAG_member
    6735                      .dwattr $C$DW$659, DW_AT_type(*$C$DW$T$23)
    6736                      .dwattr $C$DW$659, DW_AT_name("SOCPRICTRL")
    6737                      .dwattr $C$DW$659, DW_AT_TI_symbol_name("_SOCPRICTRL")
    6738                      .dwattr $C$DW$659, DW_AT_data_member_location[DW_OP_plus_uconst 0x6610]
    6739                      .dwattr $C$DW$659, DW_AT_accessibility(DW_ACCESS_public)
    6740              $C$DW$660       .dwtag  DW_TAG_member
    6741                      .dwattr $C$DW$660, DW_AT_type(*$C$DW$T$23)
    6742                      .dwattr $C$DW$660, DW_AT_name("rsvd_4")
    6743                      .dwattr $C$DW$660, DW_AT_TI_symbol_name("_rsvd_4")
    6744                      .dwattr $C$DW$660, DW_AT_data_member_location[DW_OP_plus_uconst 0x6611]
    6745                      .dwattr $C$DW$660, DW_AT_accessibility(DW_ACCESS_public)
    6746              $C$DW$661       .dwtag  DW_TAG_member
    6747                      .dwattr $C$DW$661, DW_AT_type(*$C$DW$T$23)
    6748                      .dwattr $C$DW$661, DW_AT_name("ADCSAMPLEMODE")
    6749                      .dwattr $C$DW$661, DW_AT_TI_symbol_name("_ADCSAMPLEMODE")
    6750                      .dwattr $C$DW$661, DW_AT_data_member_location[DW_OP_plus_uconst 0x6612]
    6751                      .dwattr $C$DW$661, DW_AT_accessibility(DW_ACCESS_public)
    6752              $C$DW$662       .dwtag  DW_TAG_member
    6753                      .dwattr $C$DW$662, DW_AT_type(*$C$DW$T$23)
    6754                      .dwattr $C$DW$662, DW_AT_name("rsvd_5")
    6755                      .dwattr $C$DW$662, DW_AT_TI_symbol_name("_rsvd_5")
    6756                      .dwattr $C$DW$662, DW_AT_data_member_location[DW_OP_plus_uconst 0x6613]
    6757                      .dwattr $C$DW$662, DW_AT_accessibility(DW_ACCESS_public)
    6758              $C$DW$663       .dwtag  DW_TAG_member
    6759                      .dwattr $C$DW$663, DW_AT_type(*$C$DW$T$23)
    6760                      .dwattr $C$DW$663, DW_AT_name("ADCINTSOCSEL1")
    6761                      .dwattr $C$DW$663, DW_AT_TI_symbol_name("_ADCINTSOCSEL1")
    6762                      .dwattr $C$DW$663, DW_AT_data_member_location[DW_OP_plus_uconst 0x6614]
    6763                      .dwattr $C$DW$663, DW_AT_accessibility(DW_ACCESS_public)
    6764              $C$DW$664       .dwtag  DW_TAG_member
    6765                      .dwattr $C$DW$664, DW_AT_type(*$C$DW$T$23)
    6766                      .dwattr $C$DW$664, DW_AT_name("ADCINTSOCSEL2")
    6767                      .dwattr $C$DW$664, DW_AT_TI_symbol_name("_ADCINTSOCSEL2")
    6768                      .dwattr $C$DW$664, DW_AT_data_member_location[DW_OP_plus_uconst 0x6615]
    6769                      .dwattr $C$DW$664, DW_AT_accessibility(DW_ACCESS_public)
    6770              $C$DW$665       .dwtag  DW_TAG_member
    6771                      .dwattr $C$DW$665, DW_AT_type(*$C$DW$T$26)
    6772                      .dwattr $C$DW$665, DW_AT_name("rsvd_6")
    6773                      .dwattr $C$DW$665, DW_AT_TI_symbol_name("_rsvd_6")
    6774                      .dwattr $C$DW$665, DW_AT_data_member_location[DW_OP_plus_uconst 0x6616]
    6775                      .dwattr $C$DW$665, DW_AT_accessibility(DW_ACCESS_public)
    6776              $C$DW$666       .dwtag  DW_TAG_member
    6777                      .dwattr $C$DW$666, DW_AT_type(*$C$DW$T$23)
    6778                      .dwattr $C$DW$666, DW_AT_name("ADCSOCFLG1")
    6779                      .dwattr $C$DW$666, DW_AT_TI_symbol_name("_ADCSOCFLG1")
    6780                      .dwattr $C$DW$666, DW_AT_data_member_location[DW_OP_plus_uconst 0x6618]
    6781                      .dwattr $C$DW$666, DW_AT_accessibility(DW_ACCESS_public)
    6782              $C$DW$667       .dwtag  DW_TAG_member
    6783                      .dwattr $C$DW$667, DW_AT_type(*$C$DW$T$23)
    6784                      .dwattr $C$DW$667, DW_AT_name("rsvd_7")
    6785                      .dwattr $C$DW$667, DW_AT_TI_symbol_name("_rsvd_7")
TMS320C2000 Assembler PC v6.2.5 Thu Nov 23 20:51:18 2017

Tools Copyright (c) 1996-2014 Texas Instruments Incorporated
C:\Users\wmj\AppData\Local\Temp\0289211                              PAGE  131

    6786                      .dwattr $C$DW$667, DW_AT_data_member_location[DW_OP_plus_uconst 0x6619]
    6787                      .dwattr $C$DW$667, DW_AT_accessibility(DW_ACCESS_public)
    6788              $C$DW$668       .dwtag  DW_TAG_member
    6789                      .dwattr $C$DW$668, DW_AT_type(*$C$DW$T$23)
    6790                      .dwattr $C$DW$668, DW_AT_name("ADCSOCFRC1")
    6791                      .dwattr $C$DW$668, DW_AT_TI_symbol_name("_ADCSOCFRC1")
    6792                      .dwattr $C$DW$668, DW_AT_data_member_location[DW_OP_plus_uconst 0x661a]
    6793                      .dwattr $C$DW$668, DW_AT_accessibility(DW_ACCESS_public)
    6794              $C$DW$669       .dwtag  DW_TAG_member
    6795                      .dwattr $C$DW$669, DW_AT_type(*$C$DW$T$23)
    6796                      .dwattr $C$DW$669, DW_AT_name("rsvd_8")
    6797                      .dwattr $C$DW$669, DW_AT_TI_symbol_name("_rsvd_8")
    6798                      .dwattr $C$DW$669, DW_AT_data_member_location[DW_OP_plus_uconst 0x661b]
    6799                      .dwattr $C$DW$669, DW_AT_accessibility(DW_ACCESS_public)
    6800              $C$DW$670       .dwtag  DW_TAG_member
    6801                      .dwattr $C$DW$670, DW_AT_type(*$C$DW$T$23)
    6802                      .dwattr $C$DW$670, DW_AT_name("ADCSOCOVF1")
    6803                      .dwattr $C$DW$670, DW_AT_TI_symbol_name("_ADCSOCOVF1")
    6804                      .dwattr $C$DW$670, DW_AT_data_member_location[DW_OP_plus_uconst 0x661c]
    6805                      .dwattr $C$DW$670, DW_AT_accessibility(DW_ACCESS_public)
    6806              $C$DW$671       .dwtag  DW_TAG_member
    6807                      .dwattr $C$DW$671, DW_AT_type(*$C$DW$T$23)
    6808                      .dwattr $C$DW$671, DW_AT_name("rsvd_9")
    6809                      .dwattr $C$DW$671, DW_AT_TI_symbol_name("_rsvd_9")
    6810                      .dwattr $C$DW$671, DW_AT_data_member_location[DW_OP_plus_uconst 0x661d]
    6811                      .dwattr $C$DW$671, DW_AT_accessibility(DW_ACCESS_public)
    6812              $C$DW$672       .dwtag  DW_TAG_member
    6813                      .dwattr $C$DW$672, DW_AT_type(*$C$DW$T$23)
    6814                      .dwattr $C$DW$672, DW_AT_name("ADCSOCOVFCLR1")
    6815                      .dwattr $C$DW$672, DW_AT_TI_symbol_name("_ADCSOCOVFCLR1")
    6816                      .dwattr $C$DW$672, DW_AT_data_member_location[DW_OP_plus_uconst 0x661e]
    6817                      .dwattr $C$DW$672, DW_AT_accessibility(DW_ACCESS_public)
    6818              $C$DW$673       .dwtag  DW_TAG_member
    6819                      .dwattr $C$DW$673, DW_AT_type(*$C$DW$T$23)
    6820                      .dwattr $C$DW$673, DW_AT_name("rsvd_10")
    6821                      .dwattr $C$DW$673, DW_AT_TI_symbol_name("_rsvd_10")
    6822                      .dwattr $C$DW$673, DW_AT_data_member_location[DW_OP_plus_uconst 0x661f]
    6823                      .dwattr $C$DW$673, DW_AT_accessibility(DW_ACCESS_public)
    6824              $C$DW$674       .dwtag  DW_TAG_member
    6825                      .dwattr $C$DW$674, DW_AT_type(*$C$DW$T$24)
    6826                      .dwattr $C$DW$674, DW_AT_name("ADCSOCxCTL")
    6827                      .dwattr $C$DW$674, DW_AT_TI_symbol_name("_ADCSOCxCTL")
    6828                      .dwattr $C$DW$674, DW_AT_data_member_location[DW_OP_plus_uconst 0x6620]
    6829                      .dwattr $C$DW$674, DW_AT_accessibility(DW_ACCESS_public)
    6830              $C$DW$675       .dwtag  DW_TAG_member
    6831                      .dwattr $C$DW$675, DW_AT_type(*$C$DW$T$24)
    6832                      .dwattr $C$DW$675, DW_AT_name("rsvd_11")
    6833                      .dwattr $C$DW$675, DW_AT_TI_symbol_name("_rsvd_11")
    6834                      .dwattr $C$DW$675, DW_AT_data_member_location[DW_OP_plus_uconst 0x6630]
    6835                      .dwattr $C$DW$675, DW_AT_accessibility(DW_ACCESS_public)
    6836              $C$DW$676       .dwtag  DW_TAG_member
    6837                      .dwattr $C$DW$676, DW_AT_type(*$C$DW$T$23)
    6838                      .dwattr $C$DW$676, DW_AT_name("ADCREFTRIM")
    6839                      .dwattr $C$DW$676, DW_AT_TI_symbol_name("_ADCREFTRIM")
    6840                      .dwattr $C$DW$676, DW_AT_data_member_location[DW_OP_plus_uconst 0x6640]
TMS320C2000 Assembler PC v6.2.5 Thu Nov 23 20:51:18 2017

Tools Copyright (c) 1996-2014 Texas Instruments Incorporated
C:\Users\wmj\AppData\Local\Temp\0289211                              PAGE  132

    6841                      .dwattr $C$DW$676, DW_AT_accessibility(DW_ACCESS_public)
    6842              $C$DW$677       .dwtag  DW_TAG_member
    6843                      .dwattr $C$DW$677, DW_AT_type(*$C$DW$T$23)
    6844                      .dwattr $C$DW$677, DW_AT_name("ADCOFFTRIM")
    6845                      .dwattr $C$DW$677, DW_AT_TI_symbol_name("_ADCOFFTRIM")
    6846                      .dwattr $C$DW$677, DW_AT_data_member_location[DW_OP_plus_uconst 0x6641]
    6847                      .dwattr $C$DW$677, DW_AT_accessibility(DW_ACCESS_public)
    6848              $C$DW$678       .dwtag  DW_TAG_member
    6849                      .dwattr $C$DW$678, DW_AT_type(*$C$DW$T$29)
    6850                      .dwattr $C$DW$678, DW_AT_name("resvd_12")
    6851                      .dwattr $C$DW$678, DW_AT_TI_symbol_name("_resvd_12")
    6852                      .dwattr $C$DW$678, DW_AT_data_member_location[DW_OP_plus_uconst 0x6642]
    6853                      .dwattr $C$DW$678, DW_AT_accessibility(DW_ACCESS_public)
    6854              $C$DW$679       .dwtag  DW_TAG_member
    6855                      .dwattr $C$DW$679, DW_AT_type(*$C$DW$T$23)
    6856                      .dwattr $C$DW$679, DW_AT_name("ADCREV")
    6857                      .dwattr $C$DW$679, DW_AT_TI_symbol_name("_ADCREV")
    6858                      .dwattr $C$DW$679, DW_AT_data_member_location[DW_OP_plus_uconst 0x664f]
    6859                      .dwattr $C$DW$679, DW_AT_accessibility(DW_ACCESS_public)
    6860                      .dwendtag $C$DW$T$30
    6861              
    6862              $C$DW$T$86      .dwtag  DW_TAG_pointer_type
    6863                      .dwattr $C$DW$T$86, DW_AT_type(*$C$DW$T$30)
    6864                      .dwattr $C$DW$T$86, DW_AT_address_class(0x16)
    6865              $C$DW$T$87      .dwtag  DW_TAG_typedef, DW_AT_name("ADC_Handle")
    6866                      .dwattr $C$DW$T$87, DW_AT_type(*$C$DW$T$86)
    6867                      .dwattr $C$DW$T$87, DW_AT_language(DW_LANG_C)
    6868              
    6869              $C$DW$T$34      .dwtag  DW_TAG_structure_type
    6870                      .dwattr $C$DW$T$34, DW_AT_name("_BRAKE_Obj_")
    6871                      .dwattr $C$DW$T$34, DW_AT_byte_size(0x08)
    6872              $C$DW$680       .dwtag  DW_TAG_member
    6873                      .dwattr $C$DW$680, DW_AT_type(*$C$DW$T$31)
    6874                      .dwattr $C$DW$680, DW_AT_name("angle_pu")
    6875                      .dwattr $C$DW$680, DW_AT_TI_symbol_name("_angle_pu")
    6876                      .dwattr $C$DW$680, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    6877                      .dwattr $C$DW$680, DW_AT_accessibility(DW_ACCESS_public)
    6878              $C$DW$681       .dwtag  DW_TAG_member
    6879                      .dwattr $C$DW$681, DW_AT_type(*$C$DW$T$32)
    6880                      .dwattr $C$DW$681, DW_AT_name("Idq_brake")
    6881                      .dwattr $C$DW$681, DW_AT_TI_symbol_name("_Idq_brake")
    6882                      .dwattr $C$DW$681, DW_AT_data_member_location[DW_OP_plus_uconst 0x2]
    6883                      .dwattr $C$DW$681, DW_AT_accessibility(DW_ACCESS_public)
    6884              $C$DW$682       .dwtag  DW_TAG_member
    6885                      .dwattr $C$DW$682, DW_AT_type(*$C$DW$T$33)
    6886                      .dwattr $C$DW$682, DW_AT_name("brake_enable")
    6887                      .dwattr $C$DW$682, DW_AT_TI_symbol_name("_brake_enable")
    6888                      .dwattr $C$DW$682, DW_AT_data_member_location[DW_OP_plus_uconst 0x6]
    6889                      .dwattr $C$DW$682, DW_AT_accessibility(DW_ACCESS_public)
    6890                      .dwendtag $C$DW$T$34
    6891              
    6892              $C$DW$T$73      .dwtag  DW_TAG_typedef, DW_AT_name("BRAKE_Obj")
    6893                      .dwattr $C$DW$T$73, DW_AT_type(*$C$DW$T$34)
    6894                      .dwattr $C$DW$T$73, DW_AT_language(DW_LANG_C)
    6895              $C$DW$T$71      .dwtag  DW_TAG_pointer_type
TMS320C2000 Assembler PC v6.2.5 Thu Nov 23 20:51:18 2017

Tools Copyright (c) 1996-2014 Texas Instruments Incorporated
C:\Users\wmj\AppData\Local\Temp\0289211                              PAGE  133

    6896                      .dwattr $C$DW$T$71, DW_AT_type(*$C$DW$T$34)
    6897                      .dwattr $C$DW$T$71, DW_AT_address_class(0x16)
    6898              $C$DW$T$72      .dwtag  DW_TAG_typedef, DW_AT_name("BRAKE_Handle")
    6899                      .dwattr $C$DW$T$72, DW_AT_type(*$C$DW$T$71)
    6900                      .dwattr $C$DW$T$72, DW_AT_language(DW_LANG_C)
    6901              
    6902              $C$DW$T$36      .dwtag  DW_TAG_structure_type
    6903                      .dwattr $C$DW$T$36, DW_AT_name("_CLARKE_Obj_")
    6904                      .dwattr $C$DW$T$36, DW_AT_byte_size(0x06)
    6905              $C$DW$683       .dwtag  DW_TAG_member
    6906                      .dwattr $C$DW$683, DW_AT_type(*$C$DW$T$31)
    6907                      .dwattr $C$DW$683, DW_AT_name("alpha_sf")
    6908                      .dwattr $C$DW$683, DW_AT_TI_symbol_name("_alpha_sf")
    6909                      .dwattr $C$DW$683, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    6910                      .dwattr $C$DW$683, DW_AT_accessibility(DW_ACCESS_public)
    6911              $C$DW$684       .dwtag  DW_TAG_member
    6912                      .dwattr $C$DW$684, DW_AT_type(*$C$DW$T$31)
    6913                      .dwattr $C$DW$684, DW_AT_name("beta_sf")
    6914                      .dwattr $C$DW$684, DW_AT_TI_symbol_name("_beta_sf")
    6915                      .dwattr $C$DW$684, DW_AT_data_member_location[DW_OP_plus_uconst 0x2]
    6916                      .dwattr $C$DW$684, DW_AT_accessibility(DW_ACCESS_public)
    6917              $C$DW$685       .dwtag  DW_TAG_member
    6918                      .dwattr $C$DW$685, DW_AT_type(*$C$DW$T$35)
    6919                      .dwattr $C$DW$685, DW_AT_name("numSensors")
    6920                      .dwattr $C$DW$685, DW_AT_TI_symbol_name("_numSensors")
    6921                      .dwattr $C$DW$685, DW_AT_data_member_location[DW_OP_plus_uconst 0x4]
    6922                      .dwattr $C$DW$685, DW_AT_accessibility(DW_ACCESS_public)
    6923                      .dwendtag $C$DW$T$36
    6924              
    6925              $C$DW$T$47      .dwtag  DW_TAG_typedef, DW_AT_name("CLARKE_Obj")
    6926                      .dwattr $C$DW$T$47, DW_AT_type(*$C$DW$T$36)
    6927                      .dwattr $C$DW$T$47, DW_AT_language(DW_LANG_C)
    6928              $C$DW$T$187     .dwtag  DW_TAG_pointer_type
    6929                      .dwattr $C$DW$T$187, DW_AT_type(*$C$DW$T$47)
    6930                      .dwattr $C$DW$T$187, DW_AT_address_class(0x16)
    6931              $C$DW$T$45      .dwtag  DW_TAG_pointer_type
    6932                      .dwattr $C$DW$T$45, DW_AT_type(*$C$DW$T$36)
    6933                      .dwattr $C$DW$T$45, DW_AT_address_class(0x16)
    6934              $C$DW$T$46      .dwtag  DW_TAG_typedef, DW_AT_name("CLARKE_Handle")
    6935                      .dwattr $C$DW$T$46, DW_AT_type(*$C$DW$T$45)
    6936                      .dwattr $C$DW$T$46, DW_AT_language(DW_LANG_C)
    6937              
    6938              $C$DW$T$38      .dwtag  DW_TAG_structure_type
    6939                      .dwattr $C$DW$T$38, DW_AT_name("_CLK_Obj_")
    6940                      .dwattr $C$DW$T$38, DW_AT_byte_size(0x11)
    6941              $C$DW$686       .dwtag  DW_TAG_member
    6942                      .dwattr $C$DW$686, DW_AT_type(*$C$DW$T$23)
    6943                      .dwattr $C$DW$686, DW_AT_name("XCLK")
    6944                      .dwattr $C$DW$686, DW_AT_TI_symbol_name("_XCLK")
    6945                      .dwattr $C$DW$686, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    6946                      .dwattr $C$DW$686, DW_AT_accessibility(DW_ACCESS_public)
    6947              $C$DW$687       .dwtag  DW_TAG_member
    6948                      .dwattr $C$DW$687, DW_AT_type(*$C$DW$T$23)
    6949                      .dwattr $C$DW$687, DW_AT_name("rsvd_1")
    6950                      .dwattr $C$DW$687, DW_AT_TI_symbol_name("_rsvd_1")
TMS320C2000 Assembler PC v6.2.5 Thu Nov 23 20:51:18 2017

Tools Copyright (c) 1996-2014 Texas Instruments Incorporated
C:\Users\wmj\AppData\Local\Temp\0289211                              PAGE  134

    6951                      .dwattr $C$DW$687, DW_AT_data_member_location[DW_OP_plus_uconst 0x1]
    6952                      .dwattr $C$DW$687, DW_AT_accessibility(DW_ACCESS_public)
    6953              $C$DW$688       .dwtag  DW_TAG_member
    6954                      .dwattr $C$DW$688, DW_AT_type(*$C$DW$T$23)
    6955                      .dwattr $C$DW$688, DW_AT_name("CLKCTL")
    6956                      .dwattr $C$DW$688, DW_AT_TI_symbol_name("_CLKCTL")
    6957                      .dwattr $C$DW$688, DW_AT_data_member_location[DW_OP_plus_uconst 0x2]
    6958                      .dwattr $C$DW$688, DW_AT_accessibility(DW_ACCESS_public)
    6959              $C$DW$689       .dwtag  DW_TAG_member
    6960                      .dwattr $C$DW$689, DW_AT_type(*$C$DW$T$37)
    6961                      .dwattr $C$DW$689, DW_AT_name("rsvd_2")
    6962                      .dwattr $C$DW$689, DW_AT_TI_symbol_name("_rsvd_2")
    6963                      .dwattr $C$DW$689, DW_AT_data_member_location[DW_OP_plus_uconst 0x3]
    6964                      .dwattr $C$DW$689, DW_AT_accessibility(DW_ACCESS_public)
    6965              $C$DW$690       .dwtag  DW_TAG_member
    6966                      .dwattr $C$DW$690, DW_AT_type(*$C$DW$T$23)
    6967                      .dwattr $C$DW$690, DW_AT_name("LOSPCP")
    6968                      .dwattr $C$DW$690, DW_AT_TI_symbol_name("_LOSPCP")
    6969                      .dwattr $C$DW$690, DW_AT_data_member_location[DW_OP_plus_uconst 0xb]
    6970                      .dwattr $C$DW$690, DW_AT_accessibility(DW_ACCESS_public)
    6971              $C$DW$691       .dwtag  DW_TAG_member
    6972                      .dwattr $C$DW$691, DW_AT_type(*$C$DW$T$23)
    6973                      .dwattr $C$DW$691, DW_AT_name("PCLKCR0")
    6974                      .dwattr $C$DW$691, DW_AT_TI_symbol_name("_PCLKCR0")
    6975                      .dwattr $C$DW$691, DW_AT_data_member_location[DW_OP_plus_uconst 0xc]
    6976                      .dwattr $C$DW$691, DW_AT_accessibility(DW_ACCESS_public)
    6977              $C$DW$692       .dwtag  DW_TAG_member
    6978                      .dwattr $C$DW$692, DW_AT_type(*$C$DW$T$23)
    6979                      .dwattr $C$DW$692, DW_AT_name("PCLKCR1")
    6980                      .dwattr $C$DW$692, DW_AT_TI_symbol_name("_PCLKCR1")
    6981                      .dwattr $C$DW$692, DW_AT_data_member_location[DW_OP_plus_uconst 0xd]
    6982                      .dwattr $C$DW$692, DW_AT_accessibility(DW_ACCESS_public)
    6983              $C$DW$693       .dwtag  DW_TAG_member
    6984                      .dwattr $C$DW$693, DW_AT_type(*$C$DW$T$26)
    6985                      .dwattr $C$DW$693, DW_AT_name("rsvd_3")
    6986                      .dwattr $C$DW$693, DW_AT_TI_symbol_name("_rsvd_3")
    6987                      .dwattr $C$DW$693, DW_AT_data_member_location[DW_OP_plus_uconst 0xe]
    6988                      .dwattr $C$DW$693, DW_AT_accessibility(DW_ACCESS_public)
    6989              $C$DW$694       .dwtag  DW_TAG_member
    6990                      .dwattr $C$DW$694, DW_AT_type(*$C$DW$T$23)
    6991                      .dwattr $C$DW$694, DW_AT_name("PCLKCR3")
    6992                      .dwattr $C$DW$694, DW_AT_TI_symbol_name("_PCLKCR3")
    6993                      .dwattr $C$DW$694, DW_AT_data_member_location[DW_OP_plus_uconst 0x10]
    6994                      .dwattr $C$DW$694, DW_AT_accessibility(DW_ACCESS_public)
    6995                      .dwendtag $C$DW$T$38
    6996              
    6997              $C$DW$T$88      .dwtag  DW_TAG_pointer_type
    6998                      .dwattr $C$DW$T$88, DW_AT_type(*$C$DW$T$38)
    6999                      .dwattr $C$DW$T$88, DW_AT_address_class(0x16)
    7000              $C$DW$T$89      .dwtag  DW_TAG_typedef, DW_AT_name("CLK_Handle")
    7001                      .dwattr $C$DW$T$89, DW_AT_type(*$C$DW$T$88)
    7002                      .dwattr $C$DW$T$89, DW_AT_language(DW_LANG_C)
    7003              
    7004              $C$DW$T$39      .dwtag  DW_TAG_structure_type
    7005                      .dwattr $C$DW$T$39, DW_AT_name("_CPU_Obj_")
TMS320C2000 Assembler PC v6.2.5 Thu Nov 23 20:51:18 2017

Tools Copyright (c) 1996-2014 Texas Instruments Incorporated
C:\Users\wmj\AppData\Local\Temp\0289211                              PAGE  135

    7006                      .dwattr $C$DW$T$39, DW_AT_byte_size(0x01)
    7007              $C$DW$695       .dwtag  DW_TAG_member
    7008                      .dwattr $C$DW$695, DW_AT_type(*$C$DW$T$35)
    7009                      .dwattr $C$DW$695, DW_AT_name("tmp")
    7010                      .dwattr $C$DW$695, DW_AT_TI_symbol_name("_tmp")
    7011                      .dwattr $C$DW$695, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    7012                      .dwattr $C$DW$695, DW_AT_accessibility(DW_ACCESS_public)
    7013                      .dwendtag $C$DW$T$39
    7014              
    7015              $C$DW$T$90      .dwtag  DW_TAG_pointer_type
    7016                      .dwattr $C$DW$T$90, DW_AT_type(*$C$DW$T$39)
    7017                      .dwattr $C$DW$T$90, DW_AT_address_class(0x16)
    7018              $C$DW$T$91      .dwtag  DW_TAG_typedef, DW_AT_name("CPU_Handle")
    7019                      .dwattr $C$DW$T$91, DW_AT_type(*$C$DW$T$90)
    7020                      .dwattr $C$DW$T$91, DW_AT_language(DW_LANG_C)
    7021              
    7022              $C$DW$T$74      .dwtag  DW_TAG_structure_type
    7023                      .dwattr $C$DW$T$74, DW_AT_name("_CTRL_Obj_")
    7024                      .dwattr $C$DW$T$74, DW_AT_byte_size(0x10a)
    7025              $C$DW$696       .dwtag  DW_TAG_member
    7026                      .dwattr $C$DW$696, DW_AT_type(*$C$DW$T$40)
    7027                      .dwattr $C$DW$696, DW_AT_name("version")
    7028                      .dwattr $C$DW$696, DW_AT_TI_symbol_name("_version")
    7029                      .dwattr $C$DW$696, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    7030                      .dwattr $C$DW$696, DW_AT_accessibility(DW_ACCESS_public)
    7031              $C$DW$697       .dwtag  DW_TAG_member
    7032                      .dwattr $C$DW$697, DW_AT_type(*$C$DW$T$42)
    7033                      .dwattr $C$DW$697, DW_AT_name("state")
    7034                      .dwattr $C$DW$697, DW_AT_TI_symbol_name("_state")
    7035                      .dwattr $C$DW$697, DW_AT_data_member_location[DW_OP_plus_uconst 0x4]
    7036                      .dwattr $C$DW$697, DW_AT_accessibility(DW_ACCESS_public)
    7037              $C$DW$698       .dwtag  DW_TAG_member
    7038                      .dwattr $C$DW$698, DW_AT_type(*$C$DW$T$42)
    7039                      .dwattr $C$DW$698, DW_AT_name("prevState")
    7040                      .dwattr $C$DW$698, DW_AT_TI_symbol_name("_prevState")
    7041                      .dwattr $C$DW$698, DW_AT_data_member_location[DW_OP_plus_uconst 0x5]
    7042                      .dwattr $C$DW$698, DW_AT_accessibility(DW_ACCESS_public)
    7043              $C$DW$699       .dwtag  DW_TAG_member
    7044                      .dwattr $C$DW$699, DW_AT_type(*$C$DW$T$44)
    7045                      .dwattr $C$DW$699, DW_AT_name("errorCode")
    7046                      .dwattr $C$DW$699, DW_AT_TI_symbol_name("_errorCode")
    7047                      .dwattr $C$DW$699, DW_AT_data_member_location[DW_OP_plus_uconst 0x6]
    7048                      .dwattr $C$DW$699, DW_AT_accessibility(DW_ACCESS_public)
    7049              $C$DW$700       .dwtag  DW_TAG_member
    7050                      .dwattr $C$DW$700, DW_AT_type(*$C$DW$T$46)
    7051                      .dwattr $C$DW$700, DW_AT_name("clarkeHandle_I")
    7052                      .dwattr $C$DW$700, DW_AT_TI_symbol_name("_clarkeHandle_I")
    7053                      .dwattr $C$DW$700, DW_AT_data_member_location[DW_OP_plus_uconst 0x8]
    7054                      .dwattr $C$DW$700, DW_AT_accessibility(DW_ACCESS_public)
    7055              $C$DW$701       .dwtag  DW_TAG_member
    7056                      .dwattr $C$DW$701, DW_AT_type(*$C$DW$T$47)
    7057                      .dwattr $C$DW$701, DW_AT_name("clarke_I")
    7058                      .dwattr $C$DW$701, DW_AT_TI_symbol_name("_clarke_I")
    7059                      .dwattr $C$DW$701, DW_AT_data_member_location[DW_OP_plus_uconst 0xa]
    7060                      .dwattr $C$DW$701, DW_AT_accessibility(DW_ACCESS_public)
TMS320C2000 Assembler PC v6.2.5 Thu Nov 23 20:51:18 2017

Tools Copyright (c) 1996-2014 Texas Instruments Incorporated
C:\Users\wmj\AppData\Local\Temp\0289211                              PAGE  136

    7061              $C$DW$702       .dwtag  DW_TAG_member
    7062                      .dwattr $C$DW$702, DW_AT_type(*$C$DW$T$46)
    7063                      .dwattr $C$DW$702, DW_AT_name("clarkeHandle_V")
    7064                      .dwattr $C$DW$702, DW_AT_TI_symbol_name("_clarkeHandle_V")
    7065                      .dwattr $C$DW$702, DW_AT_data_member_location[DW_OP_plus_uconst 0x10]
    7066                      .dwattr $C$DW$702, DW_AT_accessibility(DW_ACCESS_public)
    7067              $C$DW$703       .dwtag  DW_TAG_member
    7068                      .dwattr $C$DW$703, DW_AT_type(*$C$DW$T$47)
    7069                      .dwattr $C$DW$703, DW_AT_name("clarke_V")
    7070                      .dwattr $C$DW$703, DW_AT_TI_symbol_name("_clarke_V")
    7071                      .dwattr $C$DW$703, DW_AT_data_member_location[DW_OP_plus_uconst 0x12]
    7072                      .dwattr $C$DW$703, DW_AT_accessibility(DW_ACCESS_public)
    7073              $C$DW$704       .dwtag  DW_TAG_member
    7074                      .dwattr $C$DW$704, DW_AT_type(*$C$DW$T$49)
    7075                      .dwattr $C$DW$704, DW_AT_name("estHandle")
    7076                      .dwattr $C$DW$704, DW_AT_TI_symbol_name("_estHandle")
    7077                      .dwattr $C$DW$704, DW_AT_data_member_location[DW_OP_plus_uconst 0x18]
    7078                      .dwattr $C$DW$704, DW_AT_accessibility(DW_ACCESS_public)
    7079              $C$DW$705       .dwtag  DW_TAG_member
    7080                      .dwattr $C$DW$705, DW_AT_type(*$C$DW$T$51)
    7081                      .dwattr $C$DW$705, DW_AT_name("parkHandle")
    7082                      .dwattr $C$DW$705, DW_AT_TI_symbol_name("_parkHandle")
    7083                      .dwattr $C$DW$705, DW_AT_data_member_location[DW_OP_plus_uconst 0x1a]
    7084                      .dwattr $C$DW$705, DW_AT_accessibility(DW_ACCESS_public)
    7085              $C$DW$706       .dwtag  DW_TAG_member
    7086                      .dwattr $C$DW$706, DW_AT_type(*$C$DW$T$52)
    7087                      .dwattr $C$DW$706, DW_AT_name("park")
    7088                      .dwattr $C$DW$706, DW_AT_TI_symbol_name("_park")
    7089                      .dwattr $C$DW$706, DW_AT_data_member_location[DW_OP_plus_uconst 0x1c]
    7090                      .dwattr $C$DW$706, DW_AT_accessibility(DW_ACCESS_public)
    7091              $C$DW$707       .dwtag  DW_TAG_member
    7092                      .dwattr $C$DW$707, DW_AT_type(*$C$DW$T$54)
    7093                      .dwattr $C$DW$707, DW_AT_name("pidHandle_Id")
    7094                      .dwattr $C$DW$707, DW_AT_TI_symbol_name("_pidHandle_Id")
    7095                      .dwattr $C$DW$707, DW_AT_data_member_location[DW_OP_plus_uconst 0x20]
    7096                      .dwattr $C$DW$707, DW_AT_accessibility(DW_ACCESS_public)
    7097              $C$DW$708       .dwtag  DW_TAG_member
    7098                      .dwattr $C$DW$708, DW_AT_type(*$C$DW$T$55)
    7099                      .dwattr $C$DW$708, DW_AT_name("pid_Id")
    7100                      .dwattr $C$DW$708, DW_AT_TI_symbol_name("_pid_Id")
    7101                      .dwattr $C$DW$708, DW_AT_data_member_location[DW_OP_plus_uconst 0x22]
    7102                      .dwattr $C$DW$708, DW_AT_accessibility(DW_ACCESS_public)
    7103              $C$DW$709       .dwtag  DW_TAG_member
    7104                      .dwattr $C$DW$709, DW_AT_type(*$C$DW$T$54)
    7105                      .dwattr $C$DW$709, DW_AT_name("pidHandle_Iq")
    7106                      .dwattr $C$DW$709, DW_AT_TI_symbol_name("_pidHandle_Iq")
    7107                      .dwattr $C$DW$709, DW_AT_data_member_location[DW_OP_plus_uconst 0x32]
    7108                      .dwattr $C$DW$709, DW_AT_accessibility(DW_ACCESS_public)
    7109              $C$DW$710       .dwtag  DW_TAG_member
    7110                      .dwattr $C$DW$710, DW_AT_type(*$C$DW$T$55)
    7111                      .dwattr $C$DW$710, DW_AT_name("pid_Iq")
    7112                      .dwattr $C$DW$710, DW_AT_TI_symbol_name("_pid_Iq")
    7113                      .dwattr $C$DW$710, DW_AT_data_member_location[DW_OP_plus_uconst 0x34]
    7114                      .dwattr $C$DW$710, DW_AT_accessibility(DW_ACCESS_public)
    7115              $C$DW$711       .dwtag  DW_TAG_member
TMS320C2000 Assembler PC v6.2.5 Thu Nov 23 20:51:18 2017

Tools Copyright (c) 1996-2014 Texas Instruments Incorporated
C:\Users\wmj\AppData\Local\Temp\0289211                              PAGE  137

    7116                      .dwattr $C$DW$711, DW_AT_type(*$C$DW$T$54)
    7117                      .dwattr $C$DW$711, DW_AT_name("pidHandle_spd")
    7118                      .dwattr $C$DW$711, DW_AT_TI_symbol_name("_pidHandle_spd")
    7119                      .dwattr $C$DW$711, DW_AT_data_member_location[DW_OP_plus_uconst 0x44]
    7120                      .dwattr $C$DW$711, DW_AT_accessibility(DW_ACCESS_public)
    7121              $C$DW$712       .dwtag  DW_TAG_member
    7122                      .dwattr $C$DW$712, DW_AT_type(*$C$DW$T$55)
    7123                      .dwattr $C$DW$712, DW_AT_name("pid_spd")
    7124                      .dwattr $C$DW$712, DW_AT_TI_symbol_name("_pid_spd")
    7125                      .dwattr $C$DW$712, DW_AT_data_member_location[DW_OP_plus_uconst 0x46]
    7126                      .dwattr $C$DW$712, DW_AT_accessibility(DW_ACCESS_public)
    7127              $C$DW$713       .dwtag  DW_TAG_member
    7128                      .dwattr $C$DW$713, DW_AT_type(*$C$DW$T$57)
    7129                      .dwattr $C$DW$713, DW_AT_name("iparkHandle")
    7130                      .dwattr $C$DW$713, DW_AT_TI_symbol_name("_iparkHandle")
    7131                      .dwattr $C$DW$713, DW_AT_data_member_location[DW_OP_plus_uconst 0x56]
    7132                      .dwattr $C$DW$713, DW_AT_accessibility(DW_ACCESS_public)
    7133              $C$DW$714       .dwtag  DW_TAG_member
    7134                      .dwattr $C$DW$714, DW_AT_type(*$C$DW$T$58)
    7135                      .dwattr $C$DW$714, DW_AT_name("ipark")
    7136                      .dwattr $C$DW$714, DW_AT_TI_symbol_name("_ipark")
    7137                      .dwattr $C$DW$714, DW_AT_data_member_location[DW_OP_plus_uconst 0x58]
    7138                      .dwattr $C$DW$714, DW_AT_accessibility(DW_ACCESS_public)
    7139              $C$DW$715       .dwtag  DW_TAG_member
    7140                      .dwattr $C$DW$715, DW_AT_type(*$C$DW$T$60)
    7141                      .dwattr $C$DW$715, DW_AT_name("svgenHandle")
    7142                      .dwattr $C$DW$715, DW_AT_TI_symbol_name("_svgenHandle")
    7143                      .dwattr $C$DW$715, DW_AT_data_member_location[DW_OP_plus_uconst 0x5c]
    7144                      .dwattr $C$DW$715, DW_AT_accessibility(DW_ACCESS_public)
    7145              $C$DW$716       .dwtag  DW_TAG_member
    7146                      .dwattr $C$DW$716, DW_AT_type(*$C$DW$T$61)
    7147                      .dwattr $C$DW$716, DW_AT_name("svgen")
    7148                      .dwattr $C$DW$716, DW_AT_TI_symbol_name("_svgen")
    7149                      .dwattr $C$DW$716, DW_AT_data_member_location[DW_OP_plus_uconst 0x5e]
    7150                      .dwattr $C$DW$716, DW_AT_accessibility(DW_ACCESS_public)
    7151              $C$DW$717       .dwtag  DW_TAG_member
    7152                      .dwattr $C$DW$717, DW_AT_type(*$C$DW$T$63)
    7153                      .dwattr $C$DW$717, DW_AT_name("trajHandle_Id")
    7154                      .dwattr $C$DW$717, DW_AT_TI_symbol_name("_trajHandle_Id")
    7155                      .dwattr $C$DW$717, DW_AT_data_member_location[DW_OP_plus_uconst 0x60]
    7156                      .dwattr $C$DW$717, DW_AT_accessibility(DW_ACCESS_public)
    7157              $C$DW$718       .dwtag  DW_TAG_member
    7158                      .dwattr $C$DW$718, DW_AT_type(*$C$DW$T$64)
    7159                      .dwattr $C$DW$718, DW_AT_name("traj_Id")
    7160                      .dwattr $C$DW$718, DW_AT_TI_symbol_name("_traj_Id")
    7161                      .dwattr $C$DW$718, DW_AT_data_member_location[DW_OP_plus_uconst 0x62]
    7162                      .dwattr $C$DW$718, DW_AT_accessibility(DW_ACCESS_public)
    7163              $C$DW$719       .dwtag  DW_TAG_member
    7164                      .dwattr $C$DW$719, DW_AT_type(*$C$DW$T$63)
    7165                      .dwattr $C$DW$719, DW_AT_name("trajHandle_spd")
    7166                      .dwattr $C$DW$719, DW_AT_TI_symbol_name("_trajHandle_spd")
    7167                      .dwattr $C$DW$719, DW_AT_data_member_location[DW_OP_plus_uconst 0x6c]
    7168                      .dwattr $C$DW$719, DW_AT_accessibility(DW_ACCESS_public)
    7169              $C$DW$720       .dwtag  DW_TAG_member
    7170                      .dwattr $C$DW$720, DW_AT_type(*$C$DW$T$64)
TMS320C2000 Assembler PC v6.2.5 Thu Nov 23 20:51:18 2017

Tools Copyright (c) 1996-2014 Texas Instruments Incorporated
C:\Users\wmj\AppData\Local\Temp\0289211                              PAGE  138

    7171                      .dwattr $C$DW$720, DW_AT_name("traj_spd")
    7172                      .dwattr $C$DW$720, DW_AT_TI_symbol_name("_traj_spd")
    7173                      .dwattr $C$DW$720, DW_AT_data_member_location[DW_OP_plus_uconst 0x6e]
    7174                      .dwattr $C$DW$720, DW_AT_accessibility(DW_ACCESS_public)
    7175              $C$DW$721       .dwtag  DW_TAG_member
    7176                      .dwattr $C$DW$721, DW_AT_type(*$C$DW$T$63)
    7177                      .dwattr $C$DW$721, DW_AT_name("trajHandle_spdMax")
    7178                      .dwattr $C$DW$721, DW_AT_TI_symbol_name("_trajHandle_spdMax")
    7179                      .dwattr $C$DW$721, DW_AT_data_member_location[DW_OP_plus_uconst 0x78]
    7180                      .dwattr $C$DW$721, DW_AT_accessibility(DW_ACCESS_public)
    7181              $C$DW$722       .dwtag  DW_TAG_member
    7182                      .dwattr $C$DW$722, DW_AT_type(*$C$DW$T$64)
    7183                      .dwattr $C$DW$722, DW_AT_name("traj_spdMax")
    7184                      .dwattr $C$DW$722, DW_AT_TI_symbol_name("_traj_spdMax")
    7185                      .dwattr $C$DW$722, DW_AT_data_member_location[DW_OP_plus_uconst 0x7a]
    7186                      .dwattr $C$DW$722, DW_AT_accessibility(DW_ACCESS_public)
    7187              $C$DW$723       .dwtag  DW_TAG_member
    7188                      .dwattr $C$DW$723, DW_AT_type(*$C$DW$T$65)
    7189                      .dwattr $C$DW$723, DW_AT_name("motorParams")
    7190                      .dwattr $C$DW$723, DW_AT_TI_symbol_name("_motorParams")
    7191                      .dwattr $C$DW$723, DW_AT_data_member_location[DW_OP_plus_uconst 0x84]
    7192                      .dwattr $C$DW$723, DW_AT_accessibility(DW_ACCESS_public)
    7193              $C$DW$724       .dwtag  DW_TAG_member
    7194                      .dwattr $C$DW$724, DW_AT_type(*$C$DW$T$68)
    7195                      .dwattr $C$DW$724, DW_AT_name("waitTimes")
    7196                      .dwattr $C$DW$724, DW_AT_TI_symbol_name("_waitTimes")
    7197                      .dwattr $C$DW$724, DW_AT_data_member_location[DW_OP_plus_uconst 0x92]
    7198                      .dwattr $C$DW$724, DW_AT_accessibility(DW_ACCESS_public)
    7199              $C$DW$725       .dwtag  DW_TAG_member
    7200                      .dwattr $C$DW$725, DW_AT_type(*$C$DW$T$67)
    7201                      .dwattr $C$DW$725, DW_AT_name("counter_state")
    7202                      .dwattr $C$DW$725, DW_AT_TI_symbol_name("_counter_state")
    7203                      .dwattr $C$DW$725, DW_AT_data_member_location[DW_OP_plus_uconst 0x9a]
    7204                      .dwattr $C$DW$725, DW_AT_accessibility(DW_ACCESS_public)
    7205              $C$DW$726       .dwtag  DW_TAG_member
    7206                      .dwattr $C$DW$726, DW_AT_type(*$C$DW$T$69)
    7207                      .dwattr $C$DW$726, DW_AT_name("numIsrTicksPerCtrlTick")
    7208                      .dwattr $C$DW$726, DW_AT_TI_symbol_name("_numIsrTicksPerCtrlTick")
    7209                      .dwattr $C$DW$726, DW_AT_data_member_location[DW_OP_plus_uconst 0x9c]
    7210                      .dwattr $C$DW$726, DW_AT_accessibility(DW_ACCESS_public)
    7211              $C$DW$727       .dwtag  DW_TAG_member
    7212                      .dwattr $C$DW$727, DW_AT_type(*$C$DW$T$69)
    7213                      .dwattr $C$DW$727, DW_AT_name("numCtrlTicksPerCurrentTick")
    7214                      .dwattr $C$DW$727, DW_AT_TI_symbol_name("_numCtrlTicksPerCurrentTick")
    7215                      .dwattr $C$DW$727, DW_AT_data_member_location[DW_OP_plus_uconst 0x9d]
    7216                      .dwattr $C$DW$727, DW_AT_accessibility(DW_ACCESS_public)
    7217              $C$DW$728       .dwtag  DW_TAG_member
    7218                      .dwattr $C$DW$728, DW_AT_type(*$C$DW$T$69)
    7219                      .dwattr $C$DW$728, DW_AT_name("numCtrlTicksPerSpeedTick")
    7220                      .dwattr $C$DW$728, DW_AT_TI_symbol_name("_numCtrlTicksPerSpeedTick")
    7221                      .dwattr $C$DW$728, DW_AT_data_member_location[DW_OP_plus_uconst 0x9e]
    7222                      .dwattr $C$DW$728, DW_AT_accessibility(DW_ACCESS_public)
    7223              $C$DW$729       .dwtag  DW_TAG_member
    7224                      .dwattr $C$DW$729, DW_AT_type(*$C$DW$T$69)
    7225                      .dwattr $C$DW$729, DW_AT_name("numCtrlTicksPerTrajTick")
TMS320C2000 Assembler PC v6.2.5 Thu Nov 23 20:51:18 2017

Tools Copyright (c) 1996-2014 Texas Instruments Incorporated
C:\Users\wmj\AppData\Local\Temp\0289211                              PAGE  139

    7226                      .dwattr $C$DW$729, DW_AT_TI_symbol_name("_numCtrlTicksPerTrajTick")
    7227                      .dwattr $C$DW$729, DW_AT_data_member_location[DW_OP_plus_uconst 0x9f]
    7228                      .dwattr $C$DW$729, DW_AT_accessibility(DW_ACCESS_public)
    7229              $C$DW$730       .dwtag  DW_TAG_member
    7230                      .dwattr $C$DW$730, DW_AT_type(*$C$DW$T$67)
    7231                      .dwattr $C$DW$730, DW_AT_name("ctrlFreq_Hz")
    7232                      .dwattr $C$DW$730, DW_AT_TI_symbol_name("_ctrlFreq_Hz")
    7233                      .dwattr $C$DW$730, DW_AT_data_member_location[DW_OP_plus_uconst 0xa0]
    7234                      .dwattr $C$DW$730, DW_AT_accessibility(DW_ACCESS_public)
    7235              $C$DW$731       .dwtag  DW_TAG_member
    7236                      .dwattr $C$DW$731, DW_AT_type(*$C$DW$T$67)
    7237                      .dwattr $C$DW$731, DW_AT_name("trajFreq_Hz")
    7238                      .dwattr $C$DW$731, DW_AT_TI_symbol_name("_trajFreq_Hz")
    7239                      .dwattr $C$DW$731, DW_AT_data_member_location[DW_OP_plus_uconst 0xa2]
    7240                      .dwattr $C$DW$731, DW_AT_accessibility(DW_ACCESS_public)
    7241              $C$DW$732       .dwtag  DW_TAG_member
    7242                      .dwattr $C$DW$732, DW_AT_type(*$C$DW$T$31)
    7243                      .dwattr $C$DW$732, DW_AT_name("trajPeriod_sec")
    7244                      .dwattr $C$DW$732, DW_AT_TI_symbol_name("_trajPeriod_sec")
    7245                      .dwattr $C$DW$732, DW_AT_data_member_location[DW_OP_plus_uconst 0xa4]
    7246                      .dwattr $C$DW$732, DW_AT_accessibility(DW_ACCESS_public)
    7247              $C$DW$733       .dwtag  DW_TAG_member
    7248                      .dwattr $C$DW$733, DW_AT_type(*$C$DW$T$70)
    7249                      .dwattr $C$DW$733, DW_AT_name("ctrlPeriod_sec")
    7250                      .dwattr $C$DW$733, DW_AT_TI_symbol_name("_ctrlPeriod_sec")
    7251                      .dwattr $C$DW$733, DW_AT_data_member_location[DW_OP_plus_uconst 0xa6]
    7252                      .dwattr $C$DW$733, DW_AT_accessibility(DW_ACCESS_public)
    7253              $C$DW$734       .dwtag  DW_TAG_member
    7254                      .dwattr $C$DW$734, DW_AT_type(*$C$DW$T$31)
    7255                      .dwattr $C$DW$734, DW_AT_name("maxVsMag_pu")
    7256                      .dwattr $C$DW$734, DW_AT_TI_symbol_name("_maxVsMag_pu")
    7257                      .dwattr $C$DW$734, DW_AT_data_member_location[DW_OP_plus_uconst 0xa8]
    7258                      .dwattr $C$DW$734, DW_AT_accessibility(DW_ACCESS_public)
    7259              $C$DW$735       .dwtag  DW_TAG_member
    7260                      .dwattr $C$DW$735, DW_AT_type(*$C$DW$T$32)
    7261                      .dwattr $C$DW$735, DW_AT_name("Iab_in")
    7262                      .dwattr $C$DW$735, DW_AT_TI_symbol_name("_Iab_in")
    7263                      .dwattr $C$DW$735, DW_AT_data_member_location[DW_OP_plus_uconst 0xaa]
    7264                      .dwattr $C$DW$735, DW_AT_accessibility(DW_ACCESS_public)
    7265              $C$DW$736       .dwtag  DW_TAG_member
    7266                      .dwattr $C$DW$736, DW_AT_type(*$C$DW$T$32)
    7267                      .dwattr $C$DW$736, DW_AT_name("Iab_filt")
    7268                      .dwattr $C$DW$736, DW_AT_TI_symbol_name("_Iab_filt")
    7269                      .dwattr $C$DW$736, DW_AT_data_member_location[DW_OP_plus_uconst 0xae]
    7270                      .dwattr $C$DW$736, DW_AT_accessibility(DW_ACCESS_public)
    7271              $C$DW$737       .dwtag  DW_TAG_member
    7272                      .dwattr $C$DW$737, DW_AT_type(*$C$DW$T$32)
    7273                      .dwattr $C$DW$737, DW_AT_name("Idq_in")
    7274                      .dwattr $C$DW$737, DW_AT_TI_symbol_name("_Idq_in")
    7275                      .dwattr $C$DW$737, DW_AT_data_member_location[DW_OP_plus_uconst 0xb2]
    7276                      .dwattr $C$DW$737, DW_AT_accessibility(DW_ACCESS_public)
    7277              $C$DW$738       .dwtag  DW_TAG_member
    7278                      .dwattr $C$DW$738, DW_AT_type(*$C$DW$T$32)
    7279                      .dwattr $C$DW$738, DW_AT_name("Vab_in")
    7280                      .dwattr $C$DW$738, DW_AT_TI_symbol_name("_Vab_in")
TMS320C2000 Assembler PC v6.2.5 Thu Nov 23 20:51:18 2017

Tools Copyright (c) 1996-2014 Texas Instruments Incorporated
C:\Users\wmj\AppData\Local\Temp\0289211                              PAGE  140

    7281                      .dwattr $C$DW$738, DW_AT_data_member_location[DW_OP_plus_uconst 0xb6]
    7282                      .dwattr $C$DW$738, DW_AT_accessibility(DW_ACCESS_public)
    7283              $C$DW$739       .dwtag  DW_TAG_member
    7284                      .dwattr $C$DW$739, DW_AT_type(*$C$DW$T$31)
    7285                      .dwattr $C$DW$739, DW_AT_name("spd_out")
    7286                      .dwattr $C$DW$739, DW_AT_TI_symbol_name("_spd_out")
    7287                      .dwattr $C$DW$739, DW_AT_data_member_location[DW_OP_plus_uconst 0xba]
    7288                      .dwattr $C$DW$739, DW_AT_accessibility(DW_ACCESS_public)
    7289              $C$DW$740       .dwtag  DW_TAG_member
    7290                      .dwattr $C$DW$740, DW_AT_type(*$C$DW$T$32)
    7291                      .dwattr $C$DW$740, DW_AT_name("Vab_out")
    7292                      .dwattr $C$DW$740, DW_AT_TI_symbol_name("_Vab_out")
    7293                      .dwattr $C$DW$740, DW_AT_data_member_location[DW_OP_plus_uconst 0xbc]
    7294                      .dwattr $C$DW$740, DW_AT_accessibility(DW_ACCESS_public)
    7295              $C$DW$741       .dwtag  DW_TAG_member
    7296                      .dwattr $C$DW$741, DW_AT_type(*$C$DW$T$32)
    7297                      .dwattr $C$DW$741, DW_AT_name("Vdq_out")
    7298                      .dwattr $C$DW$741, DW_AT_TI_symbol_name("_Vdq_out")
    7299                      .dwattr $C$DW$741, DW_AT_data_member_location[DW_OP_plus_uconst 0xc0]
    7300                      .dwattr $C$DW$741, DW_AT_accessibility(DW_ACCESS_public)
    7301              $C$DW$742       .dwtag  DW_TAG_member
    7302                      .dwattr $C$DW$742, DW_AT_type(*$C$DW$T$70)
    7303                      .dwattr $C$DW$742, DW_AT_name("Rhf")
    7304                      .dwattr $C$DW$742, DW_AT_TI_symbol_name("_Rhf")
    7305                      .dwattr $C$DW$742, DW_AT_data_member_location[DW_OP_plus_uconst 0xc4]
    7306                      .dwattr $C$DW$742, DW_AT_accessibility(DW_ACCESS_public)
    7307              $C$DW$743       .dwtag  DW_TAG_member
    7308                      .dwattr $C$DW$743, DW_AT_type(*$C$DW$T$70)
    7309                      .dwattr $C$DW$743, DW_AT_name("Lhf")
    7310                      .dwattr $C$DW$743, DW_AT_TI_symbol_name("_Lhf")
    7311                      .dwattr $C$DW$743, DW_AT_data_member_location[DW_OP_plus_uconst 0xc6]
    7312                      .dwattr $C$DW$743, DW_AT_accessibility(DW_ACCESS_public)
    7313              $C$DW$744       .dwtag  DW_TAG_member
    7314                      .dwattr $C$DW$744, DW_AT_type(*$C$DW$T$70)
    7315                      .dwattr $C$DW$744, DW_AT_name("RoverL")
    7316                      .dwattr $C$DW$744, DW_AT_TI_symbol_name("_RoverL")
    7317                      .dwattr $C$DW$744, DW_AT_data_member_location[DW_OP_plus_uconst 0xc8]
    7318                      .dwattr $C$DW$744, DW_AT_accessibility(DW_ACCESS_public)
    7319              $C$DW$745       .dwtag  DW_TAG_member
    7320                      .dwattr $C$DW$745, DW_AT_type(*$C$DW$T$31)
    7321                      .dwattr $C$DW$745, DW_AT_name("Kp_Id")
    7322                      .dwattr $C$DW$745, DW_AT_TI_symbol_name("_Kp_Id")
    7323                      .dwattr $C$DW$745, DW_AT_data_member_location[DW_OP_plus_uconst 0xca]
    7324                      .dwattr $C$DW$745, DW_AT_accessibility(DW_ACCESS_public)
    7325              $C$DW$746       .dwtag  DW_TAG_member
    7326                      .dwattr $C$DW$746, DW_AT_type(*$C$DW$T$31)
    7327                      .dwattr $C$DW$746, DW_AT_name("Kp_Iq")
    7328                      .dwattr $C$DW$746, DW_AT_TI_symbol_name("_Kp_Iq")
    7329                      .dwattr $C$DW$746, DW_AT_data_member_location[DW_OP_plus_uconst 0xcc]
    7330                      .dwattr $C$DW$746, DW_AT_accessibility(DW_ACCESS_public)
    7331              $C$DW$747       .dwtag  DW_TAG_member
    7332                      .dwattr $C$DW$747, DW_AT_type(*$C$DW$T$31)
    7333                      .dwattr $C$DW$747, DW_AT_name("Kp_spd")
    7334                      .dwattr $C$DW$747, DW_AT_TI_symbol_name("_Kp_spd")
    7335                      .dwattr $C$DW$747, DW_AT_data_member_location[DW_OP_plus_uconst 0xce]
TMS320C2000 Assembler PC v6.2.5 Thu Nov 23 20:51:18 2017

Tools Copyright (c) 1996-2014 Texas Instruments Incorporated
C:\Users\wmj\AppData\Local\Temp\0289211                              PAGE  141

    7336                      .dwattr $C$DW$747, DW_AT_accessibility(DW_ACCESS_public)
    7337              $C$DW$748       .dwtag  DW_TAG_member
    7338                      .dwattr $C$DW$748, DW_AT_type(*$C$DW$T$31)
    7339                      .dwattr $C$DW$748, DW_AT_name("Ki_Id")
    7340                      .dwattr $C$DW$748, DW_AT_TI_symbol_name("_Ki_Id")
    7341                      .dwattr $C$DW$748, DW_AT_data_member_location[DW_OP_plus_uconst 0xd0]
    7342                      .dwattr $C$DW$748, DW_AT_accessibility(DW_ACCESS_public)
    7343              $C$DW$749       .dwtag  DW_TAG_member
    7344                      .dwattr $C$DW$749, DW_AT_type(*$C$DW$T$31)
    7345                      .dwattr $C$DW$749, DW_AT_name("Ki_Iq")
    7346                      .dwattr $C$DW$749, DW_AT_TI_symbol_name("_Ki_Iq")
    7347                      .dwattr $C$DW$749, DW_AT_data_member_location[DW_OP_plus_uconst 0xd2]
    7348                      .dwattr $C$DW$749, DW_AT_accessibility(DW_ACCESS_public)
    7349              $C$DW$750       .dwtag  DW_TAG_member
    7350                      .dwattr $C$DW$750, DW_AT_type(*$C$DW$T$31)
    7351                      .dwattr $C$DW$750, DW_AT_name("Ki_spd")
    7352                      .dwattr $C$DW$750, DW_AT_TI_symbol_name("_Ki_spd")
    7353                      .dwattr $C$DW$750, DW_AT_data_member_location[DW_OP_plus_uconst 0xd4]
    7354                      .dwattr $C$DW$750, DW_AT_accessibility(DW_ACCESS_public)
    7355              $C$DW$751       .dwtag  DW_TAG_member
    7356                      .dwattr $C$DW$751, DW_AT_type(*$C$DW$T$31)
    7357                      .dwattr $C$DW$751, DW_AT_name("Kd_Id")
    7358                      .dwattr $C$DW$751, DW_AT_TI_symbol_name("_Kd_Id")
    7359                      .dwattr $C$DW$751, DW_AT_data_member_location[DW_OP_plus_uconst 0xd6]
    7360                      .dwattr $C$DW$751, DW_AT_accessibility(DW_ACCESS_public)
    7361              $C$DW$752       .dwtag  DW_TAG_member
    7362                      .dwattr $C$DW$752, DW_AT_type(*$C$DW$T$31)
    7363                      .dwattr $C$DW$752, DW_AT_name("Kd_Iq")
    7364                      .dwattr $C$DW$752, DW_AT_TI_symbol_name("_Kd_Iq")
    7365                      .dwattr $C$DW$752, DW_AT_data_member_location[DW_OP_plus_uconst 0xd8]
    7366                      .dwattr $C$DW$752, DW_AT_accessibility(DW_ACCESS_public)
    7367              $C$DW$753       .dwtag  DW_TAG_member
    7368                      .dwattr $C$DW$753, DW_AT_type(*$C$DW$T$31)
    7369                      .dwattr $C$DW$753, DW_AT_name("Kd_spd")
    7370                      .dwattr $C$DW$753, DW_AT_TI_symbol_name("_Kd_spd")
    7371                      .dwattr $C$DW$753, DW_AT_data_member_location[DW_OP_plus_uconst 0xda]
    7372                      .dwattr $C$DW$753, DW_AT_accessibility(DW_ACCESS_public)
    7373              $C$DW$754       .dwtag  DW_TAG_member
    7374                      .dwattr $C$DW$754, DW_AT_type(*$C$DW$T$31)
    7375                      .dwattr $C$DW$754, DW_AT_name("Ui_Id")
    7376                      .dwattr $C$DW$754, DW_AT_TI_symbol_name("_Ui_Id")
    7377                      .dwattr $C$DW$754, DW_AT_data_member_location[DW_OP_plus_uconst 0xdc]
    7378                      .dwattr $C$DW$754, DW_AT_accessibility(DW_ACCESS_public)
    7379              $C$DW$755       .dwtag  DW_TAG_member
    7380                      .dwattr $C$DW$755, DW_AT_type(*$C$DW$T$31)
    7381                      .dwattr $C$DW$755, DW_AT_name("Ui_Iq")
    7382                      .dwattr $C$DW$755, DW_AT_TI_symbol_name("_Ui_Iq")
    7383                      .dwattr $C$DW$755, DW_AT_data_member_location[DW_OP_plus_uconst 0xde]
    7384                      .dwattr $C$DW$755, DW_AT_accessibility(DW_ACCESS_public)
    7385              $C$DW$756       .dwtag  DW_TAG_member
    7386                      .dwattr $C$DW$756, DW_AT_type(*$C$DW$T$31)
    7387                      .dwattr $C$DW$756, DW_AT_name("Ui_spd")
    7388                      .dwattr $C$DW$756, DW_AT_TI_symbol_name("_Ui_spd")
    7389                      .dwattr $C$DW$756, DW_AT_data_member_location[DW_OP_plus_uconst 0xe0]
    7390                      .dwattr $C$DW$756, DW_AT_accessibility(DW_ACCESS_public)
TMS320C2000 Assembler PC v6.2.5 Thu Nov 23 20:51:18 2017

Tools Copyright (c) 1996-2014 Texas Instruments Incorporated
C:\Users\wmj\AppData\Local\Temp\0289211                              PAGE  142

    7391              $C$DW$757       .dwtag  DW_TAG_member
    7392                      .dwattr $C$DW$757, DW_AT_type(*$C$DW$T$32)
    7393                      .dwattr $C$DW$757, DW_AT_name("Idq_ref")
    7394                      .dwattr $C$DW$757, DW_AT_TI_symbol_name("_Idq_ref")
    7395                      .dwattr $C$DW$757, DW_AT_data_member_location[DW_OP_plus_uconst 0xe2]
    7396                      .dwattr $C$DW$757, DW_AT_accessibility(DW_ACCESS_public)
    7397              $C$DW$758       .dwtag  DW_TAG_member
    7398                      .dwattr $C$DW$758, DW_AT_type(*$C$DW$T$31)
    7399                      .dwattr $C$DW$758, DW_AT_name("IdRated")
    7400                      .dwattr $C$DW$758, DW_AT_TI_symbol_name("_IdRated")
    7401                      .dwattr $C$DW$758, DW_AT_data_member_location[DW_OP_plus_uconst 0xe6]
    7402                      .dwattr $C$DW$758, DW_AT_accessibility(DW_ACCESS_public)
    7403              $C$DW$759       .dwtag  DW_TAG_member
    7404                      .dwattr $C$DW$759, DW_AT_type(*$C$DW$T$31)
    7405                      .dwattr $C$DW$759, DW_AT_name("spd_ref")
    7406                      .dwattr $C$DW$759, DW_AT_TI_symbol_name("_spd_ref")
    7407                      .dwattr $C$DW$759, DW_AT_data_member_location[DW_OP_plus_uconst 0xe8]
    7408                      .dwattr $C$DW$759, DW_AT_accessibility(DW_ACCESS_public)
    7409              $C$DW$760       .dwtag  DW_TAG_member
    7410                      .dwattr $C$DW$760, DW_AT_type(*$C$DW$T$31)
    7411                      .dwattr $C$DW$760, DW_AT_name("spd_max")
    7412                      .dwattr $C$DW$760, DW_AT_TI_symbol_name("_spd_max")
    7413                      .dwattr $C$DW$760, DW_AT_data_member_location[DW_OP_plus_uconst 0xea]
    7414                      .dwattr $C$DW$760, DW_AT_accessibility(DW_ACCESS_public)
    7415              $C$DW$761       .dwtag  DW_TAG_member
    7416                      .dwattr $C$DW$761, DW_AT_type(*$C$DW$T$69)
    7417                      .dwattr $C$DW$761, DW_AT_name("counter_current")
    7418                      .dwattr $C$DW$761, DW_AT_TI_symbol_name("_counter_current")
    7419                      .dwattr $C$DW$761, DW_AT_data_member_location[DW_OP_plus_uconst 0xec]
    7420                      .dwattr $C$DW$761, DW_AT_accessibility(DW_ACCESS_public)
    7421              $C$DW$762       .dwtag  DW_TAG_member
    7422                      .dwattr $C$DW$762, DW_AT_type(*$C$DW$T$69)
    7423                      .dwattr $C$DW$762, DW_AT_name("counter_isr")
    7424                      .dwattr $C$DW$762, DW_AT_TI_symbol_name("_counter_isr")
    7425                      .dwattr $C$DW$762, DW_AT_data_member_location[DW_OP_plus_uconst 0xed]
    7426                      .dwattr $C$DW$762, DW_AT_accessibility(DW_ACCESS_public)
    7427              $C$DW$763       .dwtag  DW_TAG_member
    7428                      .dwattr $C$DW$763, DW_AT_type(*$C$DW$T$69)
    7429                      .dwattr $C$DW$763, DW_AT_name("counter_speed")
    7430                      .dwattr $C$DW$763, DW_AT_TI_symbol_name("_counter_speed")
    7431                      .dwattr $C$DW$763, DW_AT_data_member_location[DW_OP_plus_uconst 0xee]
    7432                      .dwattr $C$DW$763, DW_AT_accessibility(DW_ACCESS_public)
    7433              $C$DW$764       .dwtag  DW_TAG_member
    7434                      .dwattr $C$DW$764, DW_AT_type(*$C$DW$T$69)
    7435                      .dwattr $C$DW$764, DW_AT_name("counter_traj")
    7436                      .dwattr $C$DW$764, DW_AT_TI_symbol_name("_counter_traj")
    7437                      .dwattr $C$DW$764, DW_AT_data_member_location[DW_OP_plus_uconst 0xef]
    7438                      .dwattr $C$DW$764, DW_AT_accessibility(DW_ACCESS_public)
    7439              $C$DW$765       .dwtag  DW_TAG_member
    7440                      .dwattr $C$DW$765, DW_AT_type(*$C$DW$T$33)
    7441                      .dwattr $C$DW$765, DW_AT_name("flag_enableCtrl")
    7442                      .dwattr $C$DW$765, DW_AT_TI_symbol_name("_flag_enableCtrl")
    7443                      .dwattr $C$DW$765, DW_AT_data_member_location[DW_OP_plus_uconst 0xf0]
    7444                      .dwattr $C$DW$765, DW_AT_accessibility(DW_ACCESS_public)
    7445              $C$DW$766       .dwtag  DW_TAG_member
TMS320C2000 Assembler PC v6.2.5 Thu Nov 23 20:51:18 2017

Tools Copyright (c) 1996-2014 Texas Instruments Incorporated
C:\Users\wmj\AppData\Local\Temp\0289211                              PAGE  143

    7446                      .dwattr $C$DW$766, DW_AT_type(*$C$DW$T$33)
    7447                      .dwattr $C$DW$766, DW_AT_name("flag_enableDcBusComp")
    7448                      .dwattr $C$DW$766, DW_AT_TI_symbol_name("_flag_enableDcBusComp")
    7449                      .dwattr $C$DW$766, DW_AT_data_member_location[DW_OP_plus_uconst 0xf1]
    7450                      .dwattr $C$DW$766, DW_AT_accessibility(DW_ACCESS_public)
    7451              $C$DW$767       .dwtag  DW_TAG_member
    7452                      .dwattr $C$DW$767, DW_AT_type(*$C$DW$T$33)
    7453                      .dwattr $C$DW$767, DW_AT_name("flag_enablePowerWarp")
    7454                      .dwattr $C$DW$767, DW_AT_TI_symbol_name("_flag_enablePowerWarp")
    7455                      .dwattr $C$DW$767, DW_AT_data_member_location[DW_OP_plus_uconst 0xf2]
    7456                      .dwattr $C$DW$767, DW_AT_accessibility(DW_ACCESS_public)
    7457              $C$DW$768       .dwtag  DW_TAG_member
    7458                      .dwattr $C$DW$768, DW_AT_type(*$C$DW$T$33)
    7459                      .dwattr $C$DW$768, DW_AT_name("flag_enableOffset")
    7460                      .dwattr $C$DW$768, DW_AT_TI_symbol_name("_flag_enableOffset")
    7461                      .dwattr $C$DW$768, DW_AT_data_member_location[DW_OP_plus_uconst 0xf3]
    7462                      .dwattr $C$DW$768, DW_AT_accessibility(DW_ACCESS_public)
    7463              $C$DW$769       .dwtag  DW_TAG_member
    7464                      .dwattr $C$DW$769, DW_AT_type(*$C$DW$T$33)
    7465                      .dwattr $C$DW$769, DW_AT_name("flag_enableSpeedCtrl")
    7466                      .dwattr $C$DW$769, DW_AT_TI_symbol_name("_flag_enableSpeedCtrl")
    7467                      .dwattr $C$DW$769, DW_AT_data_member_location[DW_OP_plus_uconst 0xf4]
    7468                      .dwattr $C$DW$769, DW_AT_accessibility(DW_ACCESS_public)
    7469              $C$DW$770       .dwtag  DW_TAG_member
    7470                      .dwattr $C$DW$770, DW_AT_type(*$C$DW$T$33)
    7471                      .dwattr $C$DW$770, DW_AT_name("flag_enableUserMotorParams")
    7472                      .dwattr $C$DW$770, DW_AT_TI_symbol_name("_flag_enableUserMotorParams")
    7473                      .dwattr $C$DW$770, DW_AT_data_member_location[DW_OP_plus_uconst 0xf5]
    7474                      .dwattr $C$DW$770, DW_AT_accessibility(DW_ACCESS_public)
    7475              $C$DW$771       .dwtag  DW_TAG_member
    7476                      .dwattr $C$DW$771, DW_AT_type(*$C$DW$T$33)
    7477                      .dwattr $C$DW$771, DW_AT_name("flag_enableCurrentCtrl")
    7478                      .dwattr $C$DW$771, DW_AT_TI_symbol_name("_flag_enableCurrentCtrl")
    7479                      .dwattr $C$DW$771, DW_AT_data_member_location[DW_OP_plus_uconst 0xf6]
    7480                      .dwattr $C$DW$771, DW_AT_accessibility(DW_ACCESS_public)
    7481              $C$DW$772       .dwtag  DW_TAG_member
    7482                      .dwattr $C$DW$772, DW_AT_type(*$C$DW$T$31)
    7483                      .dwattr $C$DW$772, DW_AT_name("spd_outMaxRatio_pu")
    7484                      .dwattr $C$DW$772, DW_AT_TI_symbol_name("_spd_outMaxRatio_pu")
    7485                      .dwattr $C$DW$772, DW_AT_data_member_location[DW_OP_plus_uconst 0xf8]
    7486                      .dwattr $C$DW$772, DW_AT_accessibility(DW_ACCESS_public)
    7487              $C$DW$773       .dwtag  DW_TAG_member
    7488                      .dwattr $C$DW$773, DW_AT_type(*$C$DW$T$31)
    7489                      .dwattr $C$DW$773, DW_AT_name("enc_Angle")
    7490                      .dwattr $C$DW$773, DW_AT_TI_symbol_name("_enc_Angle")
    7491                      .dwattr $C$DW$773, DW_AT_data_member_location[DW_OP_plus_uconst 0xfa]
    7492                      .dwattr $C$DW$773, DW_AT_accessibility(DW_ACCESS_public)
    7493              $C$DW$774       .dwtag  DW_TAG_member
    7494                      .dwattr $C$DW$774, DW_AT_type(*$C$DW$T$33)
    7495                      .dwattr $C$DW$774, DW_AT_name("flag_enableEncAngle")
    7496                      .dwattr $C$DW$774, DW_AT_TI_symbol_name("_flag_enableEncAngle")
    7497                      .dwattr $C$DW$774, DW_AT_data_member_location[DW_OP_plus_uconst 0xfc]
    7498                      .dwattr $C$DW$774, DW_AT_accessibility(DW_ACCESS_public)
    7499              $C$DW$775       .dwtag  DW_TAG_member
    7500                      .dwattr $C$DW$775, DW_AT_type(*$C$DW$T$72)
TMS320C2000 Assembler PC v6.2.5 Thu Nov 23 20:51:18 2017

Tools Copyright (c) 1996-2014 Texas Instruments Incorporated
C:\Users\wmj\AppData\Local\Temp\0289211                              PAGE  144

    7501                      .dwattr $C$DW$775, DW_AT_name("brakeHandle")
    7502                      .dwattr $C$DW$775, DW_AT_TI_symbol_name("_brakeHandle")
    7503                      .dwattr $C$DW$775, DW_AT_data_member_location[DW_OP_plus_uconst 0xfe]
    7504                      .dwattr $C$DW$775, DW_AT_accessibility(DW_ACCESS_public)
    7505              $C$DW$776       .dwtag  DW_TAG_member
    7506                      .dwattr $C$DW$776, DW_AT_type(*$C$DW$T$73)
    7507                      .dwattr $C$DW$776, DW_AT_name("brake")
    7508                      .dwattr $C$DW$776, DW_AT_TI_symbol_name("_brake")
    7509                      .dwattr $C$DW$776, DW_AT_data_member_location[DW_OP_plus_uconst 0x100]
    7510                      .dwattr $C$DW$776, DW_AT_accessibility(DW_ACCESS_public)
    7511              $C$DW$777       .dwtag  DW_TAG_member
    7512                      .dwattr $C$DW$777, DW_AT_type(*$C$DW$T$31)
    7513                      .dwattr $C$DW$777, DW_AT_name("Freq_Hz_PerPwmPeriod")
    7514                      .dwattr $C$DW$777, DW_AT_TI_symbol_name("_Freq_Hz_PerPwmPeriod")
    7515                      .dwattr $C$DW$777, DW_AT_data_member_location[DW_OP_plus_uconst 0x108]
    7516                      .dwattr $C$DW$777, DW_AT_accessibility(DW_ACCESS_public)
    7517                      .dwendtag $C$DW$T$74
    7518              
    7519              $C$DW$T$188     .dwtag  DW_TAG_typedef, DW_AT_name("CTRL_Obj")
    7520                      .dwattr $C$DW$T$188, DW_AT_type(*$C$DW$T$74)
    7521                      .dwattr $C$DW$T$188, DW_AT_language(DW_LANG_C)
    7522              $C$DW$T$169     .dwtag  DW_TAG_pointer_type
    7523                      .dwattr $C$DW$T$169, DW_AT_type(*$C$DW$T$74)
    7524                      .dwattr $C$DW$T$169, DW_AT_address_class(0x16)
    7525              $C$DW$T$170     .dwtag  DW_TAG_typedef, DW_AT_name("CTRL_Handle")
    7526                      .dwattr $C$DW$T$170, DW_AT_type(*$C$DW$T$169)
    7527                      .dwattr $C$DW$T$170, DW_AT_language(DW_LANG_C)
    7528              $C$DW$778       .dwtag  DW_TAG_TI_far_type
    7529                      .dwattr $C$DW$778, DW_AT_type(*$C$DW$T$170)
    7530              $C$DW$T$189     .dwtag  DW_TAG_const_type
    7531                      .dwattr $C$DW$T$189, DW_AT_type(*$C$DW$778)
    7532              
    7533              $C$DW$T$77      .dwtag  DW_TAG_structure_type
    7534                      .dwattr $C$DW$T$77, DW_AT_name("_CTRL_Version_")
    7535                      .dwattr $C$DW$T$77, DW_AT_byte_size(0x04)
    7536              $C$DW$779       .dwtag  DW_TAG_member
    7537                      .dwattr $C$DW$779, DW_AT_type(*$C$DW$T$22)
    7538                      .dwattr $C$DW$779, DW_AT_name("rsvd")
    7539                      .dwattr $C$DW$779, DW_AT_TI_symbol_name("_rsvd")
    7540                      .dwattr $C$DW$779, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    7541                      .dwattr $C$DW$779, DW_AT_accessibility(DW_ACCESS_public)
    7542              $C$DW$780       .dwtag  DW_TAG_member
    7543                      .dwattr $C$DW$780, DW_AT_type(*$C$DW$T$76)
    7544                      .dwattr $C$DW$780, DW_AT_name("targetProc")
    7545                      .dwattr $C$DW$780, DW_AT_TI_symbol_name("_targetProc")
    7546                      .dwattr $C$DW$780, DW_AT_data_member_location[DW_OP_plus_uconst 0x1]
    7547                      .dwattr $C$DW$780, DW_AT_accessibility(DW_ACCESS_public)
    7548              $C$DW$781       .dwtag  DW_TAG_member
    7549                      .dwattr $C$DW$781, DW_AT_type(*$C$DW$T$22)
    7550                      .dwattr $C$DW$781, DW_AT_name("major")
    7551                      .dwattr $C$DW$781, DW_AT_TI_symbol_name("_major")
    7552                      .dwattr $C$DW$781, DW_AT_data_member_location[DW_OP_plus_uconst 0x2]
    7553                      .dwattr $C$DW$781, DW_AT_accessibility(DW_ACCESS_public)
    7554              $C$DW$782       .dwtag  DW_TAG_member
    7555                      .dwattr $C$DW$782, DW_AT_type(*$C$DW$T$22)
TMS320C2000 Assembler PC v6.2.5 Thu Nov 23 20:51:18 2017

Tools Copyright (c) 1996-2014 Texas Instruments Incorporated
C:\Users\wmj\AppData\Local\Temp\0289211                              PAGE  145

    7556                      .dwattr $C$DW$782, DW_AT_name("minor")
    7557                      .dwattr $C$DW$782, DW_AT_TI_symbol_name("_minor")
    7558                      .dwattr $C$DW$782, DW_AT_data_member_location[DW_OP_plus_uconst 0x3]
    7559                      .dwattr $C$DW$782, DW_AT_accessibility(DW_ACCESS_public)
    7560                      .dwendtag $C$DW$T$77
    7561              
    7562              $C$DW$T$40      .dwtag  DW_TAG_typedef, DW_AT_name("CTRL_Version")
    7563                      .dwattr $C$DW$T$40, DW_AT_type(*$C$DW$T$77)
    7564                      .dwattr $C$DW$T$40, DW_AT_language(DW_LANG_C)
    7565              
    7566              $C$DW$T$19      .dwtag  DW_TAG_structure_type
    7567                      .dwattr $C$DW$T$19, DW_AT_name("_EST_Obj_")
    7568                      .dwattr $C$DW$T$19, DW_AT_declaration
    7569                      .dwendtag $C$DW$T$19
    7570              
    7571              $C$DW$T$48      .dwtag  DW_TAG_pointer_type
    7572                      .dwattr $C$DW$T$48, DW_AT_type(*$C$DW$T$19)
    7573                      .dwattr $C$DW$T$48, DW_AT_address_class(0x16)
    7574              $C$DW$T$49      .dwtag  DW_TAG_typedef, DW_AT_name("EST_Handle")
    7575                      .dwattr $C$DW$T$49, DW_AT_type(*$C$DW$T$48)
    7576                      .dwattr $C$DW$T$49, DW_AT_language(DW_LANG_C)
    7577              
    7578              $C$DW$T$78      .dwtag  DW_TAG_structure_type
    7579                      .dwattr $C$DW$T$78, DW_AT_name("_FILTER_FO_")
    7580                      .dwattr $C$DW$T$78, DW_AT_byte_size(0x0a)
    7581              $C$DW$783       .dwtag  DW_TAG_member
    7582                      .dwattr $C$DW$783, DW_AT_type(*$C$DW$T$31)
    7583                      .dwattr $C$DW$783, DW_AT_name("a1")
    7584                      .dwattr $C$DW$783, DW_AT_TI_symbol_name("_a1")
    7585                      .dwattr $C$DW$783, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    7586                      .dwattr $C$DW$783, DW_AT_accessibility(DW_ACCESS_public)
    7587              $C$DW$784       .dwtag  DW_TAG_member
    7588                      .dwattr $C$DW$784, DW_AT_type(*$C$DW$T$31)
    7589                      .dwattr $C$DW$784, DW_AT_name("b0")
    7590                      .dwattr $C$DW$784, DW_AT_TI_symbol_name("_b0")
    7591                      .dwattr $C$DW$784, DW_AT_data_member_location[DW_OP_plus_uconst 0x2]
    7592                      .dwattr $C$DW$784, DW_AT_accessibility(DW_ACCESS_public)
    7593              $C$DW$785       .dwtag  DW_TAG_member
    7594                      .dwattr $C$DW$785, DW_AT_type(*$C$DW$T$31)
    7595                      .dwattr $C$DW$785, DW_AT_name("b1")
    7596                      .dwattr $C$DW$785, DW_AT_TI_symbol_name("_b1")
    7597                      .dwattr $C$DW$785, DW_AT_data_member_location[DW_OP_plus_uconst 0x4]
    7598                      .dwattr $C$DW$785, DW_AT_accessibility(DW_ACCESS_public)
    7599              $C$DW$786       .dwtag  DW_TAG_member
    7600                      .dwattr $C$DW$786, DW_AT_type(*$C$DW$T$31)
    7601                      .dwattr $C$DW$786, DW_AT_name("x1")
    7602                      .dwattr $C$DW$786, DW_AT_TI_symbol_name("_x1")
    7603                      .dwattr $C$DW$786, DW_AT_data_member_location[DW_OP_plus_uconst 0x6]
    7604                      .dwattr $C$DW$786, DW_AT_accessibility(DW_ACCESS_public)
    7605              $C$DW$787       .dwtag  DW_TAG_member
    7606                      .dwattr $C$DW$787, DW_AT_type(*$C$DW$T$31)
    7607                      .dwattr $C$DW$787, DW_AT_name("y1")
    7608                      .dwattr $C$DW$787, DW_AT_TI_symbol_name("_y1")
    7609                      .dwattr $C$DW$787, DW_AT_data_member_location[DW_OP_plus_uconst 0x8]
    7610                      .dwattr $C$DW$787, DW_AT_accessibility(DW_ACCESS_public)
TMS320C2000 Assembler PC v6.2.5 Thu Nov 23 20:51:18 2017

Tools Copyright (c) 1996-2014 Texas Instruments Incorporated
C:\Users\wmj\AppData\Local\Temp\0289211                              PAGE  146

    7611                      .dwendtag $C$DW$T$78
    7612              
    7613              $C$DW$T$134     .dwtag  DW_TAG_typedef, DW_AT_name("FILTER_FO_Obj")
    7614                      .dwattr $C$DW$T$134, DW_AT_type(*$C$DW$T$78)
    7615                      .dwattr $C$DW$T$134, DW_AT_language(DW_LANG_C)
    7616              $C$DW$T$191     .dwtag  DW_TAG_pointer_type
    7617                      .dwattr $C$DW$T$191, DW_AT_type(*$C$DW$T$134)
    7618                      .dwattr $C$DW$T$191, DW_AT_address_class(0x16)
    7619              
    7620              $C$DW$T$20      .dwtag  DW_TAG_structure_type
    7621                      .dwattr $C$DW$T$20, DW_AT_name("_FILTER_FO_Obj_")
    7622                      .dwattr $C$DW$T$20, DW_AT_declaration
    7623                      .dwendtag $C$DW$T$20
    7624              
    7625              $C$DW$T$135     .dwtag  DW_TAG_pointer_type
    7626                      .dwattr $C$DW$T$135, DW_AT_type(*$C$DW$T$20)
    7627                      .dwattr $C$DW$T$135, DW_AT_address_class(0x16)
    7628              $C$DW$T$136     .dwtag  DW_TAG_typedef, DW_AT_name("FILTER_FO_Handle")
    7629                      .dwattr $C$DW$T$136, DW_AT_type(*$C$DW$T$135)
    7630                      .dwattr $C$DW$T$136, DW_AT_language(DW_LANG_C)
    7631              
    7632              $C$DW$T$79      .dwtag  DW_TAG_structure_type
    7633                      .dwattr $C$DW$T$79, DW_AT_name("_FLASH_Obj_")
    7634                      .dwattr $C$DW$T$79, DW_AT_byte_size(0x08)
    7635              $C$DW$788       .dwtag  DW_TAG_member
    7636                      .dwattr $C$DW$788, DW_AT_type(*$C$DW$T$23)
    7637                      .dwattr $C$DW$788, DW_AT_name("FOPT")
    7638                      .dwattr $C$DW$788, DW_AT_TI_symbol_name("_FOPT")
    7639                      .dwattr $C$DW$788, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    7640                      .dwattr $C$DW$788, DW_AT_accessibility(DW_ACCESS_public)
    7641              $C$DW$789       .dwtag  DW_TAG_member
    7642                      .dwattr $C$DW$789, DW_AT_type(*$C$DW$T$23)
    7643                      .dwattr $C$DW$789, DW_AT_name("rsvd_1")
    7644                      .dwattr $C$DW$789, DW_AT_TI_symbol_name("_rsvd_1")
    7645                      .dwattr $C$DW$789, DW_AT_data_member_location[DW_OP_plus_uconst 0x1]
    7646                      .dwattr $C$DW$789, DW_AT_accessibility(DW_ACCESS_public)
    7647              $C$DW$790       .dwtag  DW_TAG_member
    7648                      .dwattr $C$DW$790, DW_AT_type(*$C$DW$T$23)
    7649                      .dwattr $C$DW$790, DW_AT_name("FPWR")
    7650                      .dwattr $C$DW$790, DW_AT_TI_symbol_name("_FPWR")
    7651                      .dwattr $C$DW$790, DW_AT_data_member_location[DW_OP_plus_uconst 0x2]
    7652                      .dwattr $C$DW$790, DW_AT_accessibility(DW_ACCESS_public)
    7653              $C$DW$791       .dwtag  DW_TAG_member
    7654                      .dwattr $C$DW$791, DW_AT_type(*$C$DW$T$23)
    7655                      .dwattr $C$DW$791, DW_AT_name("FSTATUS")
    7656                      .dwattr $C$DW$791, DW_AT_TI_symbol_name("_FSTATUS")
    7657                      .dwattr $C$DW$791, DW_AT_data_member_location[DW_OP_plus_uconst 0x3]
    7658                      .dwattr $C$DW$791, DW_AT_accessibility(DW_ACCESS_public)
    7659              $C$DW$792       .dwtag  DW_TAG_member
    7660                      .dwattr $C$DW$792, DW_AT_type(*$C$DW$T$23)
    7661                      .dwattr $C$DW$792, DW_AT_name("FSTDBYWAIT")
    7662                      .dwattr $C$DW$792, DW_AT_TI_symbol_name("_FSTDBYWAIT")
    7663                      .dwattr $C$DW$792, DW_AT_data_member_location[DW_OP_plus_uconst 0x4]
    7664                      .dwattr $C$DW$792, DW_AT_accessibility(DW_ACCESS_public)
    7665              $C$DW$793       .dwtag  DW_TAG_member
TMS320C2000 Assembler PC v6.2.5 Thu Nov 23 20:51:18 2017

Tools Copyright (c) 1996-2014 Texas Instruments Incorporated
C:\Users\wmj\AppData\Local\Temp\0289211                              PAGE  147

    7666                      .dwattr $C$DW$793, DW_AT_type(*$C$DW$T$23)
    7667                      .dwattr $C$DW$793, DW_AT_name("FACTIVEWAIT")
    7668                      .dwattr $C$DW$793, DW_AT_TI_symbol_name("_FACTIVEWAIT")
    7669                      .dwattr $C$DW$793, DW_AT_data_member_location[DW_OP_plus_uconst 0x5]
    7670                      .dwattr $C$DW$793, DW_AT_accessibility(DW_ACCESS_public)
    7671              $C$DW$794       .dwtag  DW_TAG_member
    7672                      .dwattr $C$DW$794, DW_AT_type(*$C$DW$T$23)
    7673                      .dwattr $C$DW$794, DW_AT_name("FBANKWAIT")
    7674                      .dwattr $C$DW$794, DW_AT_TI_symbol_name("_FBANKWAIT")
    7675                      .dwattr $C$DW$794, DW_AT_data_member_location[DW_OP_plus_uconst 0x6]
    7676                      .dwattr $C$DW$794, DW_AT_accessibility(DW_ACCESS_public)
    7677              $C$DW$795       .dwtag  DW_TAG_member
    7678                      .dwattr $C$DW$795, DW_AT_type(*$C$DW$T$23)
    7679                      .dwattr $C$DW$795, DW_AT_name("FOTPWAIT")
    7680                      .dwattr $C$DW$795, DW_AT_TI_symbol_name("_FOTPWAIT")
    7681                      .dwattr $C$DW$795, DW_AT_data_member_location[DW_OP_plus_uconst 0x7]
    7682                      .dwattr $C$DW$795, DW_AT_accessibility(DW_ACCESS_public)
    7683                      .dwendtag $C$DW$T$79
    7684              
    7685              $C$DW$T$92      .dwtag  DW_TAG_pointer_type
    7686                      .dwattr $C$DW$T$92, DW_AT_type(*$C$DW$T$79)
    7687                      .dwattr $C$DW$T$92, DW_AT_address_class(0x16)
    7688              $C$DW$T$93      .dwtag  DW_TAG_typedef, DW_AT_name("FLASH_Handle")
    7689                      .dwattr $C$DW$T$93, DW_AT_type(*$C$DW$T$92)
    7690                      .dwattr $C$DW$T$93, DW_AT_language(DW_LANG_C)
    7691              
    7692              $C$DW$T$83      .dwtag  DW_TAG_structure_type
    7693                      .dwattr $C$DW$T$83, DW_AT_name("_GPIO_Obj_")
    7694                      .dwattr $C$DW$T$83, DW_AT_byte_size(0x6a)
    7695              $C$DW$796       .dwtag  DW_TAG_member
    7696                      .dwattr $C$DW$796, DW_AT_type(*$C$DW$T$80)
    7697                      .dwattr $C$DW$796, DW_AT_name("GPACTRL")
    7698                      .dwattr $C$DW$796, DW_AT_TI_symbol_name("_GPACTRL")
    7699                      .dwattr $C$DW$796, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    7700                      .dwattr $C$DW$796, DW_AT_accessibility(DW_ACCESS_public)
    7701              $C$DW$797       .dwtag  DW_TAG_member
    7702                      .dwattr $C$DW$797, DW_AT_type(*$C$DW$T$80)
    7703                      .dwattr $C$DW$797, DW_AT_name("GPAQSEL1")
    7704                      .dwattr $C$DW$797, DW_AT_TI_symbol_name("_GPAQSEL1")
    7705                      .dwattr $C$DW$797, DW_AT_data_member_location[DW_OP_plus_uconst 0x2]
    7706                      .dwattr $C$DW$797, DW_AT_accessibility(DW_ACCESS_public)
    7707              $C$DW$798       .dwtag  DW_TAG_member
    7708                      .dwattr $C$DW$798, DW_AT_type(*$C$DW$T$80)
    7709                      .dwattr $C$DW$798, DW_AT_name("GPAQSEL2")
    7710                      .dwattr $C$DW$798, DW_AT_TI_symbol_name("_GPAQSEL2")
    7711                      .dwattr $C$DW$798, DW_AT_data_member_location[DW_OP_plus_uconst 0x4]
    7712                      .dwattr $C$DW$798, DW_AT_accessibility(DW_ACCESS_public)
    7713              $C$DW$799       .dwtag  DW_TAG_member
    7714                      .dwattr $C$DW$799, DW_AT_type(*$C$DW$T$80)
    7715                      .dwattr $C$DW$799, DW_AT_name("GPAMUX1")
    7716                      .dwattr $C$DW$799, DW_AT_TI_symbol_name("_GPAMUX1")
    7717                      .dwattr $C$DW$799, DW_AT_data_member_location[DW_OP_plus_uconst 0x6]
    7718                      .dwattr $C$DW$799, DW_AT_accessibility(DW_ACCESS_public)
    7719              $C$DW$800       .dwtag  DW_TAG_member
    7720                      .dwattr $C$DW$800, DW_AT_type(*$C$DW$T$80)
TMS320C2000 Assembler PC v6.2.5 Thu Nov 23 20:51:18 2017

Tools Copyright (c) 1996-2014 Texas Instruments Incorporated
C:\Users\wmj\AppData\Local\Temp\0289211                              PAGE  148

    7721                      .dwattr $C$DW$800, DW_AT_name("GPAMUX2")
    7722                      .dwattr $C$DW$800, DW_AT_TI_symbol_name("_GPAMUX2")
    7723                      .dwattr $C$DW$800, DW_AT_data_member_location[DW_OP_plus_uconst 0x8]
    7724                      .dwattr $C$DW$800, DW_AT_accessibility(DW_ACCESS_public)
    7725              $C$DW$801       .dwtag  DW_TAG_member
    7726                      .dwattr $C$DW$801, DW_AT_type(*$C$DW$T$80)
    7727                      .dwattr $C$DW$801, DW_AT_name("GPADIR")
    7728                      .dwattr $C$DW$801, DW_AT_TI_symbol_name("_GPADIR")
    7729                      .dwattr $C$DW$801, DW_AT_data_member_location[DW_OP_plus_uconst 0xa]
    7730                      .dwattr $C$DW$801, DW_AT_accessibility(DW_ACCESS_public)
    7731              $C$DW$802       .dwtag  DW_TAG_member
    7732                      .dwattr $C$DW$802, DW_AT_type(*$C$DW$T$80)
    7733                      .dwattr $C$DW$802, DW_AT_name("GPAPUD")
    7734                      .dwattr $C$DW$802, DW_AT_TI_symbol_name("_GPAPUD")
    7735                      .dwattr $C$DW$802, DW_AT_data_member_location[DW_OP_plus_uconst 0xc]
    7736                      .dwattr $C$DW$802, DW_AT_accessibility(DW_ACCESS_public)
    7737              $C$DW$803       .dwtag  DW_TAG_member
    7738                      .dwattr $C$DW$803, DW_AT_type(*$C$DW$T$26)
    7739                      .dwattr $C$DW$803, DW_AT_name("rsvd_1")
    7740                      .dwattr $C$DW$803, DW_AT_TI_symbol_name("_rsvd_1")
    7741                      .dwattr $C$DW$803, DW_AT_data_member_location[DW_OP_plus_uconst 0xe]
    7742                      .dwattr $C$DW$803, DW_AT_accessibility(DW_ACCESS_public)
    7743              $C$DW$804       .dwtag  DW_TAG_member
    7744                      .dwattr $C$DW$804, DW_AT_type(*$C$DW$T$80)
    7745                      .dwattr $C$DW$804, DW_AT_name("GPBCTRL")
    7746                      .dwattr $C$DW$804, DW_AT_TI_symbol_name("_GPBCTRL")
    7747                      .dwattr $C$DW$804, DW_AT_data_member_location[DW_OP_plus_uconst 0x10]
    7748                      .dwattr $C$DW$804, DW_AT_accessibility(DW_ACCESS_public)
    7749              $C$DW$805       .dwtag  DW_TAG_member
    7750                      .dwattr $C$DW$805, DW_AT_type(*$C$DW$T$80)
    7751                      .dwattr $C$DW$805, DW_AT_name("GPBQSEL1")
    7752                      .dwattr $C$DW$805, DW_AT_TI_symbol_name("_GPBQSEL1")
    7753                      .dwattr $C$DW$805, DW_AT_data_member_location[DW_OP_plus_uconst 0x12]
    7754                      .dwattr $C$DW$805, DW_AT_accessibility(DW_ACCESS_public)
    7755              $C$DW$806       .dwtag  DW_TAG_member
    7756                      .dwattr $C$DW$806, DW_AT_type(*$C$DW$T$26)
    7757                      .dwattr $C$DW$806, DW_AT_name("rsvd_2")
    7758                      .dwattr $C$DW$806, DW_AT_TI_symbol_name("_rsvd_2")
    7759                      .dwattr $C$DW$806, DW_AT_data_member_location[DW_OP_plus_uconst 0x14]
    7760                      .dwattr $C$DW$806, DW_AT_accessibility(DW_ACCESS_public)
    7761              $C$DW$807       .dwtag  DW_TAG_member
    7762                      .dwattr $C$DW$807, DW_AT_type(*$C$DW$T$80)
    7763                      .dwattr $C$DW$807, DW_AT_name("GPBMUX1")
    7764                      .dwattr $C$DW$807, DW_AT_TI_symbol_name("_GPBMUX1")
    7765                      .dwattr $C$DW$807, DW_AT_data_member_location[DW_OP_plus_uconst 0x16]
    7766                      .dwattr $C$DW$807, DW_AT_accessibility(DW_ACCESS_public)
    7767              $C$DW$808       .dwtag  DW_TAG_member
    7768                      .dwattr $C$DW$808, DW_AT_type(*$C$DW$T$26)
    7769                      .dwattr $C$DW$808, DW_AT_name("rsvd_3")
    7770                      .dwattr $C$DW$808, DW_AT_TI_symbol_name("_rsvd_3")
    7771                      .dwattr $C$DW$808, DW_AT_data_member_location[DW_OP_plus_uconst 0x18]
    7772                      .dwattr $C$DW$808, DW_AT_accessibility(DW_ACCESS_public)
    7773              $C$DW$809       .dwtag  DW_TAG_member
    7774                      .dwattr $C$DW$809, DW_AT_type(*$C$DW$T$80)
    7775                      .dwattr $C$DW$809, DW_AT_name("GPBDIR")
TMS320C2000 Assembler PC v6.2.5 Thu Nov 23 20:51:18 2017

Tools Copyright (c) 1996-2014 Texas Instruments Incorporated
C:\Users\wmj\AppData\Local\Temp\0289211                              PAGE  149

    7776                      .dwattr $C$DW$809, DW_AT_TI_symbol_name("_GPBDIR")
    7777                      .dwattr $C$DW$809, DW_AT_data_member_location[DW_OP_plus_uconst 0x1a]
    7778                      .dwattr $C$DW$809, DW_AT_accessibility(DW_ACCESS_public)
    7779              $C$DW$810       .dwtag  DW_TAG_member
    7780                      .dwattr $C$DW$810, DW_AT_type(*$C$DW$T$80)
    7781                      .dwattr $C$DW$810, DW_AT_name("GPBPUD")
    7782                      .dwattr $C$DW$810, DW_AT_TI_symbol_name("_GPBPUD")
    7783                      .dwattr $C$DW$810, DW_AT_data_member_location[DW_OP_plus_uconst 0x1c]
    7784                      .dwattr $C$DW$810, DW_AT_accessibility(DW_ACCESS_public)
    7785              $C$DW$811       .dwtag  DW_TAG_member
    7786                      .dwattr $C$DW$811, DW_AT_type(*$C$DW$T$81)
    7787                      .dwattr $C$DW$811, DW_AT_name("rsvd_4")
    7788                      .dwattr $C$DW$811, DW_AT_TI_symbol_name("_rsvd_4")
    7789                      .dwattr $C$DW$811, DW_AT_data_member_location[DW_OP_plus_uconst 0x1e]
    7790                      .dwattr $C$DW$811, DW_AT_accessibility(DW_ACCESS_public)
    7791              $C$DW$812       .dwtag  DW_TAG_member
    7792                      .dwattr $C$DW$812, DW_AT_type(*$C$DW$T$80)
    7793                      .dwattr $C$DW$812, DW_AT_name("AIOMUX1")
