TMS320C2000 Assembler PC v6.2.5 Wed Nov 22 14:48:16 2017

Tools Copyright (c) 1996-2014 Texas Instruments Incorporated
C:\Users\wmj\AppData\Local\Temp\1257612                              PAGE    1

       1              ;***************************************************************
       2              ;* TMS320C2000 C/C++ Codegen                         PC v6.2.5 *
       3              ;* Date/Time created: Wed Nov 22 14:48:15 2017                 *
       4              ;***************************************************************
       5                      .compiler_opts --float_support=softlib --hll_source=on --mem_model:code=flat --mem_model:data=large -
       6        0002  FP      .set    XAR2
       7              
       8              $C$DW$CU        .dwtag  DW_TAG_compile_unit
       9                      .dwattr $C$DW$CU, DW_AT_name("D:/BM1000_v1.1/sw/drivers/drvic/fsm.c")
      10                      .dwattr $C$DW$CU, DW_AT_producer("TMS320C2000 C/C++ Codegen PC v6.2.5 Copyright (c) 1996-2014 Texas I
      11                      .dwattr $C$DW$CU, DW_AT_TI_version(0x01)
      12                      .dwattr $C$DW$CU, DW_AT_comp_dir("D:\BM1000_v1.1\sw\solutions\instaspin_foc\boards\hvkit_rev1p1\f28x\
      13              
      14              $C$DW$1 .dwtag  DW_TAG_subprogram, DW_AT_name("usDelay")
      15                      .dwattr $C$DW$1, DW_AT_TI_symbol_name("_usDelay")
      16                      .dwattr $C$DW$1, DW_AT_declaration

    4498              $C$DW$489       .dwtag  DW_TAG_enumerator, DW_AT_name("GPIO_Number_0"), DW_AT_const_value(0x00)
    4499              $C$DW$490       .dwtag  DW_TAG_enumerator, DW_AT_name("GPIO_Number_1"), DW_AT_const_value(0x01)
    4500              $C$DW$491       .dwtag  DW_TAG_enumerator, DW_AT_name("GPIO_Number_2"), DW_AT_const_value(0x02)
    4501              $C$DW$492       .dwtag  DW_TAG_enumerator, DW_AT_name("GPIO_Number_3"), DW_AT_const_value(0x03)
    4502              $C$DW$493       .dwtag  DW_TAG_enumerator, DW_AT_name("GPIO_Number_4"), DW_AT_const_value(0x04)
    4503              $C$DW$494       .dwtag  DW_TAG_enumerator, DW_AT_name("GPIO_Number_5"), DW_AT_const_value(0x05)
    4504              $C$DW$495       .dwtag  DW_TAG_enumerator, DW_AT_name("GPIO_Number_6"), DW_AT_const_value(0x06)
    4505              $C$DW$496       .dwtag  DW_TAG_enumerator, DW_AT_name("GPIO_Number_7"), DW_AT_const_value(0x07)
    4506              $C$DW$497       .dwtag  DW_TAG_enumerator, DW_AT_name("GPIO_Rsvd_8"), DW_AT_const_value(0x08)
    4507              $C$DW$498       .dwtag  DW_TAG_enumerator, DW_AT_name("GPIO_Rsvd_9"), DW_AT_const_value(0x09)
    4508              $C$DW$499       .dwtag  DW_TAG_enumerator, DW_AT_name("GPIO_Rsvd_10"), DW_AT_const_value(0x0a)
    4509              $C$DW$500       .dwtag  DW_TAG_enumerator, DW_AT_name("GPIO_Rsvd_11"), DW_AT_const_value(0x0b)
    4510              $C$DW$501       .dwtag  DW_TAG_enumerator, DW_AT_name("GPIO_Number_12"), DW_AT_const_value(0x0c)
    4511              $C$DW$502       .dwtag  DW_TAG_enumerator, DW_AT_name("GPIO_Rsvd_13"), DW_AT_const_value(0x0d)
    4512              $C$DW$503       .dwtag  DW_TAG_enumerator, DW_AT_name("GPIO_Rsvd_14"), DW_AT_const_value(0x0e)
    4513              $C$DW$504       .dwtag  DW_TAG_enumerator, DW_AT_name("GPIO_Rsvd_15"), DW_AT_const_value(0x0f)
    4514              $C$DW$505       .dwtag  DW_TAG_enumerator, DW_AT_name("GPIO_Number_16"), DW_AT_const_value(0x10)
    4515              $C$DW$506       .dwtag  DW_TAG_enumerator, DW_AT_name("GPIO_Number_17"), DW_AT_const_value(0x11)
    4516              $C$DW$507       .dwtag  DW_TAG_enumerator, DW_AT_name("GPIO_Number_18"), DW_AT_const_value(0x12)
    4517              $C$DW$508       .dwtag  DW_TAG_enumerator, DW_AT_name("GPIO_Number_19"), DW_AT_const_value(0x13)
    4518              $C$DW$509       .dwtag  DW_TAG_enumerator, DW_AT_name("GPIO_Rsvd_20"), DW_AT_const_value(0x14)
    4519              $C$DW$510       .dwtag  DW_TAG_enumerator, DW_AT_name("GPIO_Rsvd_21"), DW_AT_const_value(0x15)
    4520              $C$DW$511       .dwtag  DW_TAG_enumerator, DW_AT_name("GPIO_Rsvd_22"), DW_AT_const_value(0x16)
    4521              $C$DW$512       .dwtag  DW_TAG_enumerator, DW_AT_name("GPIO_Rsvd_23"), DW_AT_const_value(0x17)
    4522              $C$DW$513       .dwtag  DW_TAG_enumerator, DW_AT_name("GPIO_Rsvd_24"), DW_AT_const_value(0x18)
    4523              $C$DW$514       .dwtag  DW_TAG_enumerator, DW_AT_name("GPIO_Rsvd_25"), DW_AT_const_value(0x19)
    4524              $C$DW$515       .dwtag  DW_TAG_enumerator, DW_AT_name("GPIO_Rsvd_26"), DW_AT_const_value(0x1a)
    4525              $C$DW$516       .dwtag  DW_TAG_enumerator, DW_AT_name("GPIO_Rsvd_27"), DW_AT_const_value(0x1b)
    4526              $C$DW$517       .dwtag  DW_TAG_enumerator, DW_AT_name("GPIO_Number_28"), DW_AT_const_value(0x1c)
    4527              $C$DW$518       .dwtag  DW_TAG_enumerator, DW_AT_name("GPIO_Number_29"), DW_AT_const_value(0x1d)
    4528              $C$DW$519       .dwtag  DW_TAG_enumerator, DW_AT_name("GPIO_Rsvd_30"), DW_AT_const_value(0x1e)
    4529              $C$DW$520       .dwtag  DW_TAG_enumerator, DW_AT_name("GPIO_Rsvd_31"), DW_AT_const_value(0x1f)
    4530              $C$DW$521       .dwtag  DW_TAG_enumerator, DW_AT_name("GPIO_Number_32"), DW_AT_const_value(0x20)
    4531              $C$DW$522       .dwtag  DW_TAG_enumerator, DW_AT_name("GPIO_Number_33"), DW_AT_const_value(0x21)
    4532              $C$DW$523       .dwtag  DW_TAG_enumerator, DW_AT_name("GPIO_Number_34"), DW_AT_const_value(0x22)
    4533              $C$DW$524       .dwtag  DW_TAG_enumerator, DW_AT_name("GPIO_Number_35"), DW_AT_const_value(0x23)
    4534              $C$DW$525       .dwtag  DW_TAG_enumerator, DW_AT_name("GPIO_Number_36"), DW_AT_const_value(0x24)
    4535              $C$DW$526       .dwtag  DW_TAG_enumerator, DW_AT_name("GPIO_Number_37"), DW_AT_const_value(0x25)
    4536              $C$DW$527       .dwtag  DW_TAG_enumerator, DW_AT_name("GPIO_Number_38"), DW_AT_const_value(0x26)
    4537              $C$DW$528       .dwtag  DW_TAG_enumerator, DW_AT_name("GPIO_numGpios"), DW_AT_const_value(0x27)
    4538                      .dwendtag $C$DW$T$164
    4539              
    4540              $C$DW$T$165     .dwtag  DW_TAG_typedef, DW_AT_name("GPIO_Number_e")
    4541                      .dwattr $C$DW$T$165, DW_AT_type(*$C$DW$T$164)
    4542                      .dwattr $C$DW$T$165, DW_AT_language(DW_LANG_C)
    4543              $C$DW$529       .dwtag  DW_TAG_TI_far_type
    4544                      .dwattr $C$DW$529, DW_AT_type(*$C$DW$T$165)
    4545              $C$DW$T$166     .dwtag  DW_TAG_const_type
    4546                      .dwattr $C$DW$T$166, DW_AT_type(*$C$DW$529)
    4547              
    4548              $C$DW$T$29      .dwtag  DW_TAG_structure_type
    4549                      .dwattr $C$DW$T$29, DW_AT_name("_ADC_Obj_")
TMS320C2000 Assembler PC v6.2.5 Wed Nov 22 14:48:16 2017

Tools Copyright (c) 1996-2014 Texas Instruments Incorporated
C:\Users\wmj\AppData\Local\Temp\1257612                              PAGE   88

    4550                      .dwattr $C$DW$T$29, DW_AT_byte_size(0x6650)
    4551              $C$DW$530       .dwtag  DW_TAG_member
    4552                      .dwattr $C$DW$530, DW_AT_type(*$C$DW$T$23)
    4553                      .dwattr $C$DW$530, DW_AT_name("ADCRESULT")
    4554                      .dwattr $C$DW$530, DW_AT_TI_symbol_name("_ADCRESULT")
    4555                      .dwattr $C$DW$530, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    4556                      .dwattr $C$DW$530, DW_AT_accessibility(DW_ACCESS_public)
    4557              $C$DW$531       .dwtag  DW_TAG_member
    4558                      .dwattr $C$DW$531, DW_AT_type(*$C$DW$T$24)
    4559                      .dwattr $C$DW$531, DW_AT_name("resvd_1")
    4560                      .dwattr $C$DW$531, DW_AT_TI_symbol_name("_resvd_1")
    4561                      .dwattr $C$DW$531, DW_AT_data_member_location[DW_OP_plus_uconst 0x10]
    4562                      .dwattr $C$DW$531, DW_AT_accessibility(DW_ACCESS_public)
    4563              $C$DW$532       .dwtag  DW_TAG_member
    4564                      .dwattr $C$DW$532, DW_AT_type(*$C$DW$T$22)
    4565                      .dwattr $C$DW$532, DW_AT_name("ADCCTL1")
    4566                      .dwattr $C$DW$532, DW_AT_TI_symbol_name("_ADCCTL1")
    4567                      .dwattr $C$DW$532, DW_AT_data_member_location[DW_OP_plus_uconst 0x6600]
    4568                      .dwattr $C$DW$532, DW_AT_accessibility(DW_ACCESS_public)
    4569              $C$DW$533       .dwtag  DW_TAG_member
    4570                      .dwattr $C$DW$533, DW_AT_type(*$C$DW$T$22)
    4571                      .dwattr $C$DW$533, DW_AT_name("ADCCTL2")
    4572                      .dwattr $C$DW$533, DW_AT_TI_symbol_name("_ADCCTL2")
    4573                      .dwattr $C$DW$533, DW_AT_data_member_location[DW_OP_plus_uconst 0x6601]
    4574                      .dwattr $C$DW$533, DW_AT_accessibility(DW_ACCESS_public)
    4575              $C$DW$534       .dwtag  DW_TAG_member
    4576                      .dwattr $C$DW$534, DW_AT_type(*$C$DW$T$25)
    4577                      .dwattr $C$DW$534, DW_AT_name("rsvd_2")
    4578                      .dwattr $C$DW$534, DW_AT_TI_symbol_name("_rsvd_2")
    4579                      .dwattr $C$DW$534, DW_AT_data_member_location[DW_OP_plus_uconst 0x6602]
    4580                      .dwattr $C$DW$534, DW_AT_accessibility(DW_ACCESS_public)
    4581              $C$DW$535       .dwtag  DW_TAG_member
    4582                      .dwattr $C$DW$535, DW_AT_type(*$C$DW$T$22)
    4583                      .dwattr $C$DW$535, DW_AT_name("ADCINTFLG")
    4584                      .dwattr $C$DW$535, DW_AT_TI_symbol_name("_ADCINTFLG")
    4585                      .dwattr $C$DW$535, DW_AT_data_member_location[DW_OP_plus_uconst 0x6604]
    4586                      .dwattr $C$DW$535, DW_AT_accessibility(DW_ACCESS_public)
    4587              $C$DW$536       .dwtag  DW_TAG_member
    4588                      .dwattr $C$DW$536, DW_AT_type(*$C$DW$T$22)
    4589                      .dwattr $C$DW$536, DW_AT_name("ADCINTFLGCLR")
    4590                      .dwattr $C$DW$536, DW_AT_TI_symbol_name("_ADCINTFLGCLR")
    4591                      .dwattr $C$DW$536, DW_AT_data_member_location[DW_OP_plus_uconst 0x6605]
    4592                      .dwattr $C$DW$536, DW_AT_accessibility(DW_ACCESS_public)
    4593              $C$DW$537       .dwtag  DW_TAG_member
    4594                      .dwattr $C$DW$537, DW_AT_type(*$C$DW$T$22)
    4595                      .dwattr $C$DW$537, DW_AT_name("ADCINTOVF")
    4596                      .dwattr $C$DW$537, DW_AT_TI_symbol_name("_ADCINTOVF")
    4597                      .dwattr $C$DW$537, DW_AT_data_member_location[DW_OP_plus_uconst 0x6606]
    4598                      .dwattr $C$DW$537, DW_AT_accessibility(DW_ACCESS_public)
    4599              $C$DW$538       .dwtag  DW_TAG_member
    4600                      .dwattr $C$DW$538, DW_AT_type(*$C$DW$T$22)
    4601                      .dwattr $C$DW$538, DW_AT_name("ADCINTOVFCLR")
    4602                      .dwattr $C$DW$538, DW_AT_TI_symbol_name("_ADCINTOVFCLR")
    4603                      .dwattr $C$DW$538, DW_AT_data_member_location[DW_OP_plus_uconst 0x6607]
    4604                      .dwattr $C$DW$538, DW_AT_accessibility(DW_ACCESS_public)
TMS320C2000 Assembler PC v6.2.5 Wed Nov 22 14:48:16 2017

Tools Copyright (c) 1996-2014 Texas Instruments Incorporated
C:\Users\wmj\AppData\Local\Temp\1257612                              PAGE   89

    4605              $C$DW$539       .dwtag  DW_TAG_member
    4606                      .dwattr $C$DW$539, DW_AT_type(*$C$DW$T$26)
    4607                      .dwattr $C$DW$539, DW_AT_name("INTSELxNy")
    4608                      .dwattr $C$DW$539, DW_AT_TI_symbol_name("_INTSELxNy")
    4609                      .dwattr $C$DW$539, DW_AT_data_member_location[DW_OP_plus_uconst 0x6608]
    4610                      .dwattr $C$DW$539, DW_AT_accessibility(DW_ACCESS_public)
    4611              $C$DW$540       .dwtag  DW_TAG_member
    4612                      .dwattr $C$DW$540, DW_AT_type(*$C$DW$T$27)
    4613                      .dwattr $C$DW$540, DW_AT_name("rsvd_3")
    4614                      .dwattr $C$DW$540, DW_AT_TI_symbol_name("_rsvd_3")
    4615                      .dwattr $C$DW$540, DW_AT_data_member_location[DW_OP_plus_uconst 0x660d]
    4616                      .dwattr $C$DW$540, DW_AT_accessibility(DW_ACCESS_public)
    4617              $C$DW$541       .dwtag  DW_TAG_member
    4618                      .dwattr $C$DW$541, DW_AT_type(*$C$DW$T$22)
    4619                      .dwattr $C$DW$541, DW_AT_name("SOCPRICTRL")
    4620                      .dwattr $C$DW$541, DW_AT_TI_symbol_name("_SOCPRICTRL")
    4621                      .dwattr $C$DW$541, DW_AT_data_member_location[DW_OP_plus_uconst 0x6610]
    4622                      .dwattr $C$DW$541, DW_AT_accessibility(DW_ACCESS_public)
    4623              $C$DW$542       .dwtag  DW_TAG_member
    4624                      .dwattr $C$DW$542, DW_AT_type(*$C$DW$T$22)
    4625                      .dwattr $C$DW$542, DW_AT_name("rsvd_4")
    4626                      .dwattr $C$DW$542, DW_AT_TI_symbol_name("_rsvd_4")
    4627                      .dwattr $C$DW$542, DW_AT_data_member_location[DW_OP_plus_uconst 0x6611]
    4628                      .dwattr $C$DW$542, DW_AT_accessibility(DW_ACCESS_public)
    4629              $C$DW$543       .dwtag  DW_TAG_member
    4630                      .dwattr $C$DW$543, DW_AT_type(*$C$DW$T$22)
    4631                      .dwattr $C$DW$543, DW_AT_name("ADCSAMPLEMODE")
    4632                      .dwattr $C$DW$543, DW_AT_TI_symbol_name("_ADCSAMPLEMODE")
    4633                      .dwattr $C$DW$543, DW_AT_data_member_location[DW_OP_plus_uconst 0x6612]
    4634                      .dwattr $C$DW$543, DW_AT_accessibility(DW_ACCESS_public)
    4635              $C$DW$544       .dwtag  DW_TAG_member
    4636                      .dwattr $C$DW$544, DW_AT_type(*$C$DW$T$22)
    4637                      .dwattr $C$DW$544, DW_AT_name("rsvd_5")
    4638                      .dwattr $C$DW$544, DW_AT_TI_symbol_name("_rsvd_5")
    4639                      .dwattr $C$DW$544, DW_AT_data_member_location[DW_OP_plus_uconst 0x6613]
    4640                      .dwattr $C$DW$544, DW_AT_accessibility(DW_ACCESS_public)
    4641              $C$DW$545       .dwtag  DW_TAG_member
    4642                      .dwattr $C$DW$545, DW_AT_type(*$C$DW$T$22)
    4643                      .dwattr $C$DW$545, DW_AT_name("ADCINTSOCSEL1")
    4644                      .dwattr $C$DW$545, DW_AT_TI_symbol_name("_ADCINTSOCSEL1")
    4645                      .dwattr $C$DW$545, DW_AT_data_member_location[DW_OP_plus_uconst 0x6614]
    4646                      .dwattr $C$DW$545, DW_AT_accessibility(DW_ACCESS_public)
    4647              $C$DW$546       .dwtag  DW_TAG_member
    4648                      .dwattr $C$DW$546, DW_AT_type(*$C$DW$T$22)
    4649                      .dwattr $C$DW$546, DW_AT_name("ADCINTSOCSEL2")
    4650                      .dwattr $C$DW$546, DW_AT_TI_symbol_name("_ADCINTSOCSEL2")
    4651                      .dwattr $C$DW$546, DW_AT_data_member_location[DW_OP_plus_uconst 0x6615]
    4652                      .dwattr $C$DW$546, DW_AT_accessibility(DW_ACCESS_public)
    4653              $C$DW$547       .dwtag  DW_TAG_member
    4654                      .dwattr $C$DW$547, DW_AT_type(*$C$DW$T$25)
    4655                      .dwattr $C$DW$547, DW_AT_name("rsvd_6")
    4656                      .dwattr $C$DW$547, DW_AT_TI_symbol_name("_rsvd_6")
    4657                      .dwattr $C$DW$547, DW_AT_data_member_location[DW_OP_plus_uconst 0x6616]
    4658                      .dwattr $C$DW$547, DW_AT_accessibility(DW_ACCESS_public)
    4659              $C$DW$548       .dwtag  DW_TAG_member
TMS320C2000 Assembler PC v6.2.5 Wed Nov 22 14:48:16 2017

Tools Copyright (c) 1996-2014 Texas Instruments Incorporated
C:\Users\wmj\AppData\Local\Temp\1257612                              PAGE   90

    4660                      .dwattr $C$DW$548, DW_AT_type(*$C$DW$T$22)
    4661                      .dwattr $C$DW$548, DW_AT_name("ADCSOCFLG1")
    4662                      .dwattr $C$DW$548, DW_AT_TI_symbol_name("_ADCSOCFLG1")
    4663                      .dwattr $C$DW$548, DW_AT_data_member_location[DW_OP_plus_uconst 0x6618]
    4664                      .dwattr $C$DW$548, DW_AT_accessibility(DW_ACCESS_public)
    4665              $C$DW$549       .dwtag  DW_TAG_member
    4666                      .dwattr $C$DW$549, DW_AT_type(*$C$DW$T$22)
    4667                      .dwattr $C$DW$549, DW_AT_name("rsvd_7")
    4668                      .dwattr $C$DW$549, DW_AT_TI_symbol_name("_rsvd_7")
    4669                      .dwattr $C$DW$549, DW_AT_data_member_location[DW_OP_plus_uconst 0x6619]
    4670                      .dwattr $C$DW$549, DW_AT_accessibility(DW_ACCESS_public)
    4671              $C$DW$550       .dwtag  DW_TAG_member
    4672                      .dwattr $C$DW$550, DW_AT_type(*$C$DW$T$22)
    4673                      .dwattr $C$DW$550, DW_AT_name("ADCSOCFRC1")
    4674                      .dwattr $C$DW$550, DW_AT_TI_symbol_name("_ADCSOCFRC1")
    4675                      .dwattr $C$DW$550, DW_AT_data_member_location[DW_OP_plus_uconst 0x661a]
    4676                      .dwattr $C$DW$550, DW_AT_accessibility(DW_ACCESS_public)
    4677              $C$DW$551       .dwtag  DW_TAG_member
    4678                      .dwattr $C$DW$551, DW_AT_type(*$C$DW$T$22)
    4679                      .dwattr $C$DW$551, DW_AT_name("rsvd_8")
    4680                      .dwattr $C$DW$551, DW_AT_TI_symbol_name("_rsvd_8")
    4681                      .dwattr $C$DW$551, DW_AT_data_member_location[DW_OP_plus_uconst 0x661b]
    4682                      .dwattr $C$DW$551, DW_AT_accessibility(DW_ACCESS_public)
    4683              $C$DW$552       .dwtag  DW_TAG_member
    4684                      .dwattr $C$DW$552, DW_AT_type(*$C$DW$T$22)
    4685                      .dwattr $C$DW$552, DW_AT_name("ADCSOCOVF1")
    4686                      .dwattr $C$DW$552, DW_AT_TI_symbol_name("_ADCSOCOVF1")
    4687                      .dwattr $C$DW$552, DW_AT_data_member_location[DW_OP_plus_uconst 0x661c]
    4688                      .dwattr $C$DW$552, DW_AT_accessibility(DW_ACCESS_public)
    4689              $C$DW$553       .dwtag  DW_TAG_member
    4690                      .dwattr $C$DW$553, DW_AT_type(*$C$DW$T$22)
    4691                      .dwattr $C$DW$553, DW_AT_name("rsvd_9")
    4692                      .dwattr $C$DW$553, DW_AT_TI_symbol_name("_rsvd_9")
    4693                      .dwattr $C$DW$553, DW_AT_data_member_location[DW_OP_plus_uconst 0x661d]
    4694                      .dwattr $C$DW$553, DW_AT_accessibility(DW_ACCESS_public)
    4695              $C$DW$554       .dwtag  DW_TAG_member
    4696                      .dwattr $C$DW$554, DW_AT_type(*$C$DW$T$22)
    4697                      .dwattr $C$DW$554, DW_AT_name("ADCSOCOVFCLR1")
    4698                      .dwattr $C$DW$554, DW_AT_TI_symbol_name("_ADCSOCOVFCLR1")
    4699                      .dwattr $C$DW$554, DW_AT_data_member_location[DW_OP_plus_uconst 0x661e]
    4700                      .dwattr $C$DW$554, DW_AT_accessibility(DW_ACCESS_public)
    4701              $C$DW$555       .dwtag  DW_TAG_member
    4702                      .dwattr $C$DW$555, DW_AT_type(*$C$DW$T$22)
    4703                      .dwattr $C$DW$555, DW_AT_name("rsvd_10")
    4704                      .dwattr $C$DW$555, DW_AT_TI_symbol_name("_rsvd_10")
    4705                      .dwattr $C$DW$555, DW_AT_data_member_location[DW_OP_plus_uconst 0x661f]
    4706                      .dwattr $C$DW$555, DW_AT_accessibility(DW_ACCESS_public)
    4707              $C$DW$556       .dwtag  DW_TAG_member
    4708                      .dwattr $C$DW$556, DW_AT_type(*$C$DW$T$23)
    4709                      .dwattr $C$DW$556, DW_AT_name("ADCSOCxCTL")
    4710                      .dwattr $C$DW$556, DW_AT_TI_symbol_name("_ADCSOCxCTL")
    4711                      .dwattr $C$DW$556, DW_AT_data_member_location[DW_OP_plus_uconst 0x6620]
    4712                      .dwattr $C$DW$556, DW_AT_accessibility(DW_ACCESS_public)
    4713              $C$DW$557       .dwtag  DW_TAG_member
    4714                      .dwattr $C$DW$557, DW_AT_type(*$C$DW$T$23)
TMS320C2000 Assembler PC v6.2.5 Wed Nov 22 14:48:16 2017

Tools Copyright (c) 1996-2014 Texas Instruments Incorporated
C:\Users\wmj\AppData\Local\Temp\1257612                              PAGE   91

    4715                      .dwattr $C$DW$557, DW_AT_name("rsvd_11")
    4716                      .dwattr $C$DW$557, DW_AT_TI_symbol_name("_rsvd_11")
    4717                      .dwattr $C$DW$557, DW_AT_data_member_location[DW_OP_plus_uconst 0x6630]
    4718                      .dwattr $C$DW$557, DW_AT_accessibility(DW_ACCESS_public)
    4719              $C$DW$558       .dwtag  DW_TAG_member
    4720                      .dwattr $C$DW$558, DW_AT_type(*$C$DW$T$22)
    4721                      .dwattr $C$DW$558, DW_AT_name("ADCREFTRIM")
    4722                      .dwattr $C$DW$558, DW_AT_TI_symbol_name("_ADCREFTRIM")
    4723                      .dwattr $C$DW$558, DW_AT_data_member_location[DW_OP_plus_uconst 0x6640]
    4724                      .dwattr $C$DW$558, DW_AT_accessibility(DW_ACCESS_public)
    4725              $C$DW$559       .dwtag  DW_TAG_member
    4726                      .dwattr $C$DW$559, DW_AT_type(*$C$DW$T$22)
    4727                      .dwattr $C$DW$559, DW_AT_name("ADCOFFTRIM")
    4728                      .dwattr $C$DW$559, DW_AT_TI_symbol_name("_ADCOFFTRIM")
    4729                      .dwattr $C$DW$559, DW_AT_data_member_location[DW_OP_plus_uconst 0x6641]
    4730                      .dwattr $C$DW$559, DW_AT_accessibility(DW_ACCESS_public)
    4731              $C$DW$560       .dwtag  DW_TAG_member
    4732                      .dwattr $C$DW$560, DW_AT_type(*$C$DW$T$28)
    4733                      .dwattr $C$DW$560, DW_AT_name("resvd_12")
    4734                      .dwattr $C$DW$560, DW_AT_TI_symbol_name("_resvd_12")
    4735                      .dwattr $C$DW$560, DW_AT_data_member_location[DW_OP_plus_uconst 0x6642]
    4736                      .dwattr $C$DW$560, DW_AT_accessibility(DW_ACCESS_public)
    4737              $C$DW$561       .dwtag  DW_TAG_member
    4738                      .dwattr $C$DW$561, DW_AT_type(*$C$DW$T$22)
    4739                      .dwattr $C$DW$561, DW_AT_name("ADCREV")
    4740                      .dwattr $C$DW$561, DW_AT_TI_symbol_name("_ADCREV")
    4741                      .dwattr $C$DW$561, DW_AT_data_member_location[DW_OP_plus_uconst 0x664f]
    4742                      .dwattr $C$DW$561, DW_AT_accessibility(DW_ACCESS_public)
    4743                      .dwendtag $C$DW$T$29
    4744              
    4745              $C$DW$T$80      .dwtag  DW_TAG_pointer_type
    4746                      .dwattr $C$DW$T$80, DW_AT_type(*$C$DW$T$29)
    4747                      .dwattr $C$DW$T$80, DW_AT_address_class(0x16)
    4748              $C$DW$T$81      .dwtag  DW_TAG_typedef, DW_AT_name("ADC_Handle")
    4749                      .dwattr $C$DW$T$81, DW_AT_type(*$C$DW$T$80)
    4750                      .dwattr $C$DW$T$81, DW_AT_language(DW_LANG_C)
    4751              
    4752              $C$DW$T$31      .dwtag  DW_TAG_structure_type
    4753                      .dwattr $C$DW$T$31, DW_AT_name("_CLK_Obj_")
    4754                      .dwattr $C$DW$T$31, DW_AT_byte_size(0x11)
    4755              $C$DW$562       .dwtag  DW_TAG_member
    4756                      .dwattr $C$DW$562, DW_AT_type(*$C$DW$T$22)
    4757                      .dwattr $C$DW$562, DW_AT_name("XCLK")
    4758                      .dwattr $C$DW$562, DW_AT_TI_symbol_name("_XCLK")
    4759                      .dwattr $C$DW$562, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    4760                      .dwattr $C$DW$562, DW_AT_accessibility(DW_ACCESS_public)
    4761              $C$DW$563       .dwtag  DW_TAG_member
    4762                      .dwattr $C$DW$563, DW_AT_type(*$C$DW$T$22)
    4763                      .dwattr $C$DW$563, DW_AT_name("rsvd_1")
    4764                      .dwattr $C$DW$563, DW_AT_TI_symbol_name("_rsvd_1")
    4765                      .dwattr $C$DW$563, DW_AT_data_member_location[DW_OP_plus_uconst 0x1]
    4766                      .dwattr $C$DW$563, DW_AT_accessibility(DW_ACCESS_public)
    4767              $C$DW$564       .dwtag  DW_TAG_member
    4768                      .dwattr $C$DW$564, DW_AT_type(*$C$DW$T$22)
    4769                      .dwattr $C$DW$564, DW_AT_name("CLKCTL")
TMS320C2000 Assembler PC v6.2.5 Wed Nov 22 14:48:16 2017

Tools Copyright (c) 1996-2014 Texas Instruments Incorporated
C:\Users\wmj\AppData\Local\Temp\1257612                              PAGE   92

    4770                      .dwattr $C$DW$564, DW_AT_TI_symbol_name("_CLKCTL")
    4771                      .dwattr $C$DW$564, DW_AT_data_member_location[DW_OP_plus_uconst 0x2]
    4772                      .dwattr $C$DW$564, DW_AT_accessibility(DW_ACCESS_public)
    4773              $C$DW$565       .dwtag  DW_TAG_member
    4774                      .dwattr $C$DW$565, DW_AT_type(*$C$DW$T$30)
    4775                      .dwattr $C$DW$565, DW_AT_name("rsvd_2")
    4776                      .dwattr $C$DW$565, DW_AT_TI_symbol_name("_rsvd_2")
    4777                      .dwattr $C$DW$565, DW_AT_data_member_location[DW_OP_plus_uconst 0x3]
    4778                      .dwattr $C$DW$565, DW_AT_accessibility(DW_ACCESS_public)
    4779              $C$DW$566       .dwtag  DW_TAG_member
    4780                      .dwattr $C$DW$566, DW_AT_type(*$C$DW$T$22)
    4781                      .dwattr $C$DW$566, DW_AT_name("LOSPCP")
    4782                      .dwattr $C$DW$566, DW_AT_TI_symbol_name("_LOSPCP")
    4783                      .dwattr $C$DW$566, DW_AT_data_member_location[DW_OP_plus_uconst 0xb]
    4784                      .dwattr $C$DW$566, DW_AT_accessibility(DW_ACCESS_public)
    4785              $C$DW$567       .dwtag  DW_TAG_member
    4786                      .dwattr $C$DW$567, DW_AT_type(*$C$DW$T$22)
    4787                      .dwattr $C$DW$567, DW_AT_name("PCLKCR0")
    4788                      .dwattr $C$DW$567, DW_AT_TI_symbol_name("_PCLKCR0")
    4789                      .dwattr $C$DW$567, DW_AT_data_member_location[DW_OP_plus_uconst 0xc]
    4790                      .dwattr $C$DW$567, DW_AT_accessibility(DW_ACCESS_public)
    4791              $C$DW$568       .dwtag  DW_TAG_member
    4792                      .dwattr $C$DW$568, DW_AT_type(*$C$DW$T$22)
    4793                      .dwattr $C$DW$568, DW_AT_name("PCLKCR1")
    4794                      .dwattr $C$DW$568, DW_AT_TI_symbol_name("_PCLKCR1")
    4795                      .dwattr $C$DW$568, DW_AT_data_member_location[DW_OP_plus_uconst 0xd]
    4796                      .dwattr $C$DW$568, DW_AT_accessibility(DW_ACCESS_public)
    4797              $C$DW$569       .dwtag  DW_TAG_member
    4798                      .dwattr $C$DW$569, DW_AT_type(*$C$DW$T$25)
    4799                      .dwattr $C$DW$569, DW_AT_name("rsvd_3")
    4800                      .dwattr $C$DW$569, DW_AT_TI_symbol_name("_rsvd_3")
    4801                      .dwattr $C$DW$569, DW_AT_data_member_location[DW_OP_plus_uconst 0xe]
    4802                      .dwattr $C$DW$569, DW_AT_accessibility(DW_ACCESS_public)
    4803              $C$DW$570       .dwtag  DW_TAG_member
    4804                      .dwattr $C$DW$570, DW_AT_type(*$C$DW$T$22)
    4805                      .dwattr $C$DW$570, DW_AT_name("PCLKCR3")
    4806                      .dwattr $C$DW$570, DW_AT_TI_symbol_name("_PCLKCR3")
    4807                      .dwattr $C$DW$570, DW_AT_data_member_location[DW_OP_plus_uconst 0x10]
    4808                      .dwattr $C$DW$570, DW_AT_accessibility(DW_ACCESS_public)
    4809                      .dwendtag $C$DW$T$31
    4810              
    4811              $C$DW$T$82      .dwtag  DW_TAG_pointer_type
    4812                      .dwattr $C$DW$T$82, DW_AT_type(*$C$DW$T$31)
    4813                      .dwattr $C$DW$T$82, DW_AT_address_class(0x16)
    4814              $C$DW$T$83      .dwtag  DW_TAG_typedef, DW_AT_name("CLK_Handle")
    4815                      .dwattr $C$DW$T$83, DW_AT_type(*$C$DW$T$82)
    4816                      .dwattr $C$DW$T$83, DW_AT_language(DW_LANG_C)
    4817              
    4818              $C$DW$T$33      .dwtag  DW_TAG_structure_type
    4819                      .dwattr $C$DW$T$33, DW_AT_name("_CPU_Obj_")
    4820                      .dwattr $C$DW$T$33, DW_AT_byte_size(0x01)
    4821              $C$DW$571       .dwtag  DW_TAG_member
    4822                      .dwattr $C$DW$571, DW_AT_type(*$C$DW$T$32)
    4823                      .dwattr $C$DW$571, DW_AT_name("tmp")
    4824                      .dwattr $C$DW$571, DW_AT_TI_symbol_name("_tmp")
TMS320C2000 Assembler PC v6.2.5 Wed Nov 22 14:48:16 2017

Tools Copyright (c) 1996-2014 Texas Instruments Incorporated
C:\Users\wmj\AppData\Local\Temp\1257612                              PAGE   93

    4825                      .dwattr $C$DW$571, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    4826                      .dwattr $C$DW$571, DW_AT_accessibility(DW_ACCESS_public)
    4827                      .dwendtag $C$DW$T$33
    4828              
    4829              $C$DW$T$84      .dwtag  DW_TAG_pointer_type
    4830                      .dwattr $C$DW$T$84, DW_AT_type(*$C$DW$T$33)
    4831                      .dwattr $C$DW$T$84, DW_AT_address_class(0x16)
    4832              $C$DW$T$85      .dwtag  DW_TAG_typedef, DW_AT_name("CPU_Handle")
    4833                      .dwattr $C$DW$T$85, DW_AT_type(*$C$DW$T$84)
    4834                      .dwattr $C$DW$T$85, DW_AT_language(DW_LANG_C)
    4835              
    4836              $C$DW$T$36      .dwtag  DW_TAG_structure_type
    4837                      .dwattr $C$DW$T$36, DW_AT_name("_CTRL_Version_")
    4838                      .dwattr $C$DW$T$36, DW_AT_byte_size(0x04)
    4839              $C$DW$572       .dwtag  DW_TAG_member
    4840                      .dwattr $C$DW$572, DW_AT_type(*$C$DW$T$21)
    4841                      .dwattr $C$DW$572, DW_AT_name("rsvd")
    4842                      .dwattr $C$DW$572, DW_AT_TI_symbol_name("_rsvd")
    4843                      .dwattr $C$DW$572, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    4844                      .dwattr $C$DW$572, DW_AT_accessibility(DW_ACCESS_public)
    4845              $C$DW$573       .dwtag  DW_TAG_member
    4846                      .dwattr $C$DW$573, DW_AT_type(*$C$DW$T$35)
    4847                      .dwattr $C$DW$573, DW_AT_name("targetProc")
    4848                      .dwattr $C$DW$573, DW_AT_TI_symbol_name("_targetProc")
    4849                      .dwattr $C$DW$573, DW_AT_data_member_location[DW_OP_plus_uconst 0x1]
    4850                      .dwattr $C$DW$573, DW_AT_accessibility(DW_ACCESS_public)
    4851              $C$DW$574       .dwtag  DW_TAG_member
    4852                      .dwattr $C$DW$574, DW_AT_type(*$C$DW$T$21)
    4853                      .dwattr $C$DW$574, DW_AT_name("major")
    4854                      .dwattr $C$DW$574, DW_AT_TI_symbol_name("_major")
    4855                      .dwattr $C$DW$574, DW_AT_data_member_location[DW_OP_plus_uconst 0x2]
    4856                      .dwattr $C$DW$574, DW_AT_accessibility(DW_ACCESS_public)
    4857              $C$DW$575       .dwtag  DW_TAG_member
    4858                      .dwattr $C$DW$575, DW_AT_type(*$C$DW$T$21)
    4859                      .dwattr $C$DW$575, DW_AT_name("minor")
    4860                      .dwattr $C$DW$575, DW_AT_TI_symbol_name("_minor")
    4861                      .dwattr $C$DW$575, DW_AT_data_member_location[DW_OP_plus_uconst 0x3]
    4862                      .dwattr $C$DW$575, DW_AT_accessibility(DW_ACCESS_public)
    4863                      .dwendtag $C$DW$T$36
    4864              
    4865              $C$DW$T$127     .dwtag  DW_TAG_typedef, DW_AT_name("CTRL_Version")
    4866                      .dwattr $C$DW$T$127, DW_AT_type(*$C$DW$T$36)
    4867                      .dwattr $C$DW$T$127, DW_AT_language(DW_LANG_C)
    4868              
    4869              $C$DW$T$38      .dwtag  DW_TAG_structure_type
    4870                      .dwattr $C$DW$T$38, DW_AT_name("_FILTER_FO_")
    4871                      .dwattr $C$DW$T$38, DW_AT_byte_size(0x0a)
    4872              $C$DW$576       .dwtag  DW_TAG_member
    4873                      .dwattr $C$DW$576, DW_AT_type(*$C$DW$T$37)
    4874                      .dwattr $C$DW$576, DW_AT_name("a1")
    4875                      .dwattr $C$DW$576, DW_AT_TI_symbol_name("_a1")
    4876                      .dwattr $C$DW$576, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    4877                      .dwattr $C$DW$576, DW_AT_accessibility(DW_ACCESS_public)
    4878              $C$DW$577       .dwtag  DW_TAG_member
    4879                      .dwattr $C$DW$577, DW_AT_type(*$C$DW$T$37)
TMS320C2000 Assembler PC v6.2.5 Wed Nov 22 14:48:16 2017

Tools Copyright (c) 1996-2014 Texas Instruments Incorporated
C:\Users\wmj\AppData\Local\Temp\1257612                              PAGE   94

    4880                      .dwattr $C$DW$577, DW_AT_name("b0")
    4881                      .dwattr $C$DW$577, DW_AT_TI_symbol_name("_b0")
    4882                      .dwattr $C$DW$577, DW_AT_data_member_location[DW_OP_plus_uconst 0x2]
    4883                      .dwattr $C$DW$577, DW_AT_accessibility(DW_ACCESS_public)
    4884              $C$DW$578       .dwtag  DW_TAG_member
    4885                      .dwattr $C$DW$578, DW_AT_type(*$C$DW$T$37)
    4886                      .dwattr $C$DW$578, DW_AT_name("b1")
    4887                      .dwattr $C$DW$578, DW_AT_TI_symbol_name("_b1")
    4888                      .dwattr $C$DW$578, DW_AT_data_member_location[DW_OP_plus_uconst 0x4]
    4889                      .dwattr $C$DW$578, DW_AT_accessibility(DW_ACCESS_public)
    4890              $C$DW$579       .dwtag  DW_TAG_member
    4891                      .dwattr $C$DW$579, DW_AT_type(*$C$DW$T$37)
    4892                      .dwattr $C$DW$579, DW_AT_name("x1")
    4893                      .dwattr $C$DW$579, DW_AT_TI_symbol_name("_x1")
    4894                      .dwattr $C$DW$579, DW_AT_data_member_location[DW_OP_plus_uconst 0x6]
    4895                      .dwattr $C$DW$579, DW_AT_accessibility(DW_ACCESS_public)
    4896              $C$DW$580       .dwtag  DW_TAG_member
    4897                      .dwattr $C$DW$580, DW_AT_type(*$C$DW$T$37)
    4898                      .dwattr $C$DW$580, DW_AT_name("y1")
    4899                      .dwattr $C$DW$580, DW_AT_TI_symbol_name("_y1")
    4900                      .dwattr $C$DW$580, DW_AT_data_member_location[DW_OP_plus_uconst 0x8]
    4901                      .dwattr $C$DW$580, DW_AT_accessibility(DW_ACCESS_public)
    4902                      .dwendtag $C$DW$T$38
    4903              
    4904              $C$DW$T$131     .dwtag  DW_TAG_typedef, DW_AT_name("FILTER_FO_Obj")
    4905                      .dwattr $C$DW$T$131, DW_AT_type(*$C$DW$T$38)
    4906                      .dwattr $C$DW$T$131, DW_AT_language(DW_LANG_C)
    4907              
    4908              $C$DW$T$19      .dwtag  DW_TAG_structure_type
    4909                      .dwattr $C$DW$T$19, DW_AT_name("_FILTER_FO_Obj_")
    4910                      .dwattr $C$DW$T$19, DW_AT_declaration
    4911                      .dwendtag $C$DW$T$19
    4912              
    4913              $C$DW$T$132     .dwtag  DW_TAG_pointer_type
    4914                      .dwattr $C$DW$T$132, DW_AT_type(*$C$DW$T$19)
    4915                      .dwattr $C$DW$T$132, DW_AT_address_class(0x16)
    4916              $C$DW$T$133     .dwtag  DW_TAG_typedef, DW_AT_name("FILTER_FO_Handle")
    4917                      .dwattr $C$DW$T$133, DW_AT_type(*$C$DW$T$132)
    4918                      .dwattr $C$DW$T$133, DW_AT_language(DW_LANG_C)
    4919              
    4920              $C$DW$T$39      .dwtag  DW_TAG_structure_type
    4921                      .dwattr $C$DW$T$39, DW_AT_name("_FLASH_Obj_")
    4922                      .dwattr $C$DW$T$39, DW_AT_byte_size(0x08)
    4923              $C$DW$581       .dwtag  DW_TAG_member
    4924                      .dwattr $C$DW$581, DW_AT_type(*$C$DW$T$22)
    4925                      .dwattr $C$DW$581, DW_AT_name("FOPT")
    4926                      .dwattr $C$DW$581, DW_AT_TI_symbol_name("_FOPT")
    4927                      .dwattr $C$DW$581, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    4928                      .dwattr $C$DW$581, DW_AT_accessibility(DW_ACCESS_public)
    4929              $C$DW$582       .dwtag  DW_TAG_member
    4930                      .dwattr $C$DW$582, DW_AT_type(*$C$DW$T$22)
    4931                      .dwattr $C$DW$582, DW_AT_name("rsvd_1")
    4932                      .dwattr $C$DW$582, DW_AT_TI_symbol_name("_rsvd_1")
    4933                      .dwattr $C$DW$582, DW_AT_data_member_location[DW_OP_plus_uconst 0x1]
    4934                      .dwattr $C$DW$582, DW_AT_accessibility(DW_ACCESS_public)
TMS320C2000 Assembler PC v6.2.5 Wed Nov 22 14:48:16 2017

Tools Copyright (c) 1996-2014 Texas Instruments Incorporated
C:\Users\wmj\AppData\Local\Temp\1257612                              PAGE   95

    4935              $C$DW$583       .dwtag  DW_TAG_member
    4936                      .dwattr $C$DW$583, DW_AT_type(*$C$DW$T$22)
    4937                      .dwattr $C$DW$583, DW_AT_name("FPWR")
    4938                      .dwattr $C$DW$583, DW_AT_TI_symbol_name("_FPWR")
    4939                      .dwattr $C$DW$583, DW_AT_data_member_location[DW_OP_plus_uconst 0x2]
    4940                      .dwattr $C$DW$583, DW_AT_accessibility(DW_ACCESS_public)
    4941              $C$DW$584       .dwtag  DW_TAG_member
    4942                      .dwattr $C$DW$584, DW_AT_type(*$C$DW$T$22)
    4943                      .dwattr $C$DW$584, DW_AT_name("FSTATUS")
    4944                      .dwattr $C$DW$584, DW_AT_TI_symbol_name("_FSTATUS")
    4945                      .dwattr $C$DW$584, DW_AT_data_member_location[DW_OP_plus_uconst 0x3]
    4946                      .dwattr $C$DW$584, DW_AT_accessibility(DW_ACCESS_public)
    4947              $C$DW$585       .dwtag  DW_TAG_member
    4948                      .dwattr $C$DW$585, DW_AT_type(*$C$DW$T$22)
    4949                      .dwattr $C$DW$585, DW_AT_name("FSTDBYWAIT")
    4950                      .dwattr $C$DW$585, DW_AT_TI_symbol_name("_FSTDBYWAIT")
    4951                      .dwattr $C$DW$585, DW_AT_data_member_location[DW_OP_plus_uconst 0x4]
    4952                      .dwattr $C$DW$585, DW_AT_accessibility(DW_ACCESS_public)
    4953              $C$DW$586       .dwtag  DW_TAG_member
    4954                      .dwattr $C$DW$586, DW_AT_type(*$C$DW$T$22)
    4955                      .dwattr $C$DW$586, DW_AT_name("FACTIVEWAIT")
    4956                      .dwattr $C$DW$586, DW_AT_TI_symbol_name("_FACTIVEWAIT")
    4957                      .dwattr $C$DW$586, DW_AT_data_member_location[DW_OP_plus_uconst 0x5]
    4958                      .dwattr $C$DW$586, DW_AT_accessibility(DW_ACCESS_public)
    4959              $C$DW$587       .dwtag  DW_TAG_member
    4960                      .dwattr $C$DW$587, DW_AT_type(*$C$DW$T$22)
    4961                      .dwattr $C$DW$587, DW_AT_name("FBANKWAIT")
    4962                      .dwattr $C$DW$587, DW_AT_TI_symbol_name("_FBANKWAIT")
    4963                      .dwattr $C$DW$587, DW_AT_data_member_location[DW_OP_plus_uconst 0x6]
    4964                      .dwattr $C$DW$587, DW_AT_accessibility(DW_ACCESS_public)
    4965              $C$DW$588       .dwtag  DW_TAG_member
    4966                      .dwattr $C$DW$588, DW_AT_type(*$C$DW$T$22)
    4967                      .dwattr $C$DW$588, DW_AT_name("FOTPWAIT")
    4968                      .dwattr $C$DW$588, DW_AT_TI_symbol_name("_FOTPWAIT")
    4969                      .dwattr $C$DW$588, DW_AT_data_member_location[DW_OP_plus_uconst 0x7]
    4970                      .dwattr $C$DW$588, DW_AT_accessibility(DW_ACCESS_public)
    4971                      .dwendtag $C$DW$T$39
    4972              
    4973              $C$DW$T$86      .dwtag  DW_TAG_pointer_type
    4974                      .dwattr $C$DW$T$86, DW_AT_type(*$C$DW$T$39)
    4975                      .dwattr $C$DW$T$86, DW_AT_address_class(0x16)
    4976              $C$DW$T$87      .dwtag  DW_TAG_typedef, DW_AT_name("FLASH_Handle")
    4977                      .dwattr $C$DW$T$87, DW_AT_type(*$C$DW$T$86)
    4978                      .dwattr $C$DW$T$87, DW_AT_language(DW_LANG_C)
    4979              
    4980              $C$DW$T$60      .dwtag  DW_TAG_structure_type
    4981                      .dwattr $C$DW$T$60, DW_AT_name("_FSM_Obj_")
    4982                      .dwattr $C$DW$T$60, DW_AT_byte_size(0x26)
    4983              $C$DW$589       .dwtag  DW_TAG_member
    4984                      .dwattr $C$DW$589, DW_AT_type(*$C$DW$T$41)
    4985                      .dwattr $C$DW$589, DW_AT_name("motorHandle")
    4986                      .dwattr $C$DW$589, DW_AT_TI_symbol_name("_motorHandle")
    4987                      .dwattr $C$DW$589, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    4988                      .dwattr $C$DW$589, DW_AT_accessibility(DW_ACCESS_public)
    4989              $C$DW$590       .dwtag  DW_TAG_member
TMS320C2000 Assembler PC v6.2.5 Wed Nov 22 14:48:16 2017

Tools Copyright (c) 1996-2014 Texas Instruments Incorporated
C:\Users\wmj\AppData\Local\Temp\1257612                              PAGE   96

    4990                      .dwattr $C$DW$590, DW_AT_type(*$C$DW$T$43)
    4991                      .dwattr $C$DW$590, DW_AT_name("halHandle")
    4992                      .dwattr $C$DW$590, DW_AT_TI_symbol_name("_halHandle")
    4993                      .dwattr $C$DW$590, DW_AT_data_member_location[DW_OP_plus_uconst 0x2]
    4994                      .dwattr $C$DW$590, DW_AT_accessibility(DW_ACCESS_public)
    4995              $C$DW$591       .dwtag  DW_TAG_member
    4996                      .dwattr $C$DW$591, DW_AT_type(*$C$DW$T$45)
    4997                      .dwattr $C$DW$591, DW_AT_name("StBoxHandle")
    4998                      .dwattr $C$DW$591, DW_AT_TI_symbol_name("_StBoxHandle")
    4999                      .dwattr $C$DW$591, DW_AT_data_member_location[DW_OP_plus_uconst 0x4]
    5000                      .dwattr $C$DW$591, DW_AT_accessibility(DW_ACCESS_public)
    5001              $C$DW$592       .dwtag  DW_TAG_member
    5002                      .dwattr $C$DW$592, DW_AT_type(*$C$DW$T$47)
    5003                      .dwattr $C$DW$592, DW_AT_name("FSM_State")
    5004                      .dwattr $C$DW$592, DW_AT_TI_symbol_name("_FSM_State")
    5005                      .dwattr $C$DW$592, DW_AT_data_member_location[DW_OP_plus_uconst 0x6]
    5006                      .dwattr $C$DW$592, DW_AT_accessibility(DW_ACCESS_public)
    5007              $C$DW$593       .dwtag  DW_TAG_member
    5008                      .dwattr $C$DW$593, DW_AT_type(*$C$DW$T$47)
    5009                      .dwattr $C$DW$593, DW_AT_name("FSM_CurState")
    5010                      .dwattr $C$DW$593, DW_AT_TI_symbol_name("_FSM_CurState")
    5011                      .dwattr $C$DW$593, DW_AT_data_member_location[DW_OP_plus_uconst 0x7]
    5012                      .dwattr $C$DW$593, DW_AT_accessibility(DW_ACCESS_public)
    5013              $C$DW$594       .dwtag  DW_TAG_member
    5014                      .dwattr $C$DW$594, DW_AT_type(*$C$DW$T$49)
    5015                      .dwattr $C$DW$594, DW_AT_name("FSM_Trans")
    5016                      .dwattr $C$DW$594, DW_AT_TI_symbol_name("_FSM_Trans")
    5017                      .dwattr $C$DW$594, DW_AT_data_member_location[DW_OP_plus_uconst 0x8]
    5018                      .dwattr $C$DW$594, DW_AT_accessibility(DW_ACCESS_public)
    5019              $C$DW$595       .dwtag  DW_TAG_member
    5020                      .dwattr $C$DW$595, DW_AT_type(*$C$DW$T$51)
    5021                      .dwattr $C$DW$595, DW_AT_name("FSM_Event")
    5022                      .dwattr $C$DW$595, DW_AT_TI_symbol_name("_FSM_Event")
    5023                      .dwattr $C$DW$595, DW_AT_data_member_location[DW_OP_plus_uconst 0x9]
    5024                      .dwattr $C$DW$595, DW_AT_accessibility(DW_ACCESS_public)
    5025              $C$DW$596       .dwtag  DW_TAG_member
    5026                      .dwattr $C$DW$596, DW_AT_type(*$C$DW$T$53)
    5027                      .dwattr $C$DW$596, DW_AT_name("FSM_StMode")
    5028                      .dwattr $C$DW$596, DW_AT_TI_symbol_name("_FSM_StMode")
    5029                      .dwattr $C$DW$596, DW_AT_data_member_location[DW_OP_plus_uconst 0xa]
    5030                      .dwattr $C$DW$596, DW_AT_accessibility(DW_ACCESS_public)
    5031              $C$DW$597       .dwtag  DW_TAG_member
    5032                      .dwattr $C$DW$597, DW_AT_type(*$C$DW$T$21)
    5033                      .dwattr $C$DW$597, DW_AT_name("FSM_ErrFlg")
    5034                      .dwattr $C$DW$597, DW_AT_TI_symbol_name("_FSM_ErrFlg")
    5035                      .dwattr $C$DW$597, DW_AT_data_member_location[DW_OP_plus_uconst 0xb]
    5036                      .dwattr $C$DW$597, DW_AT_accessibility(DW_ACCESS_public)
    5037              $C$DW$598       .dwtag  DW_TAG_member
    5038                      .dwattr $C$DW$598, DW_AT_type(*$C$DW$T$21)
    5039                      .dwattr $C$DW$598, DW_AT_name("FSM_ErrMask")
    5040                      .dwattr $C$DW$598, DW_AT_TI_symbol_name("_FSM_ErrMask")
    5041                      .dwattr $C$DW$598, DW_AT_data_member_location[DW_OP_plus_uconst 0xc]
    5042                      .dwattr $C$DW$598, DW_AT_accessibility(DW_ACCESS_public)
    5043              $C$DW$599       .dwtag  DW_TAG_member
    5044                      .dwattr $C$DW$599, DW_AT_type(*$C$DW$T$21)
TMS320C2000 Assembler PC v6.2.5 Wed Nov 22 14:48:16 2017

Tools Copyright (c) 1996-2014 Texas Instruments Incorporated
C:\Users\wmj\AppData\Local\Temp\1257612                              PAGE   97

    5045                      .dwattr $C$DW$599, DW_AT_name("FSM_runTime")
    5046                      .dwattr $C$DW$599, DW_AT_TI_symbol_name("_FSM_runTime")
    5047                      .dwattr $C$DW$599, DW_AT_data_member_location[DW_OP_plus_uconst 0xd]
    5048                      .dwattr $C$DW$599, DW_AT_accessibility(DW_ACCESS_public)
    5049              $C$DW$600       .dwtag  DW_TAG_member
    5050                      .dwattr $C$DW$600, DW_AT_type(*$C$DW$T$21)
    5051                      .dwattr $C$DW$600, DW_AT_name("FSM_485Cmd")
    5052                      .dwattr $C$DW$600, DW_AT_TI_symbol_name("_FSM_485Cmd")
    5053                      .dwattr $C$DW$600, DW_AT_data_member_location[DW_OP_plus_uconst 0xe]
    5054                      .dwattr $C$DW$600, DW_AT_accessibility(DW_ACCESS_public)
    5055              $C$DW$601       .dwtag  DW_TAG_member
    5056                      .dwattr $C$DW$601, DW_AT_type(*$C$DW$T$47)
    5057                      .dwattr $C$DW$601, DW_AT_name("FSM_485EditState")
    5058                      .dwattr $C$DW$601, DW_AT_TI_symbol_name("_FSM_485EditState")
    5059                      .dwattr $C$DW$601, DW_AT_data_member_location[DW_OP_plus_uconst 0xf]
    5060                      .dwattr $C$DW$601, DW_AT_accessibility(DW_ACCESS_public)
    5061              $C$DW$602       .dwtag  DW_TAG_member
    5062                      .dwattr $C$DW$602, DW_AT_type(*$C$DW$T$55)
    5063                      .dwattr $C$DW$602, DW_AT_name("FSM_485EditOpt")
    5064                      .dwattr $C$DW$602, DW_AT_TI_symbol_name("_FSM_485EditOpt")
    5065                      .dwattr $C$DW$602, DW_AT_data_member_location[DW_OP_plus_uconst 0x10]
    5066                      .dwattr $C$DW$602, DW_AT_accessibility(DW_ACCESS_public)
    5067              $C$DW$603       .dwtag  DW_TAG_member
    5068                      .dwattr $C$DW$603, DW_AT_type(*$C$DW$T$21)
    5069                      .dwattr $C$DW$603, DW_AT_name("FSM_485RefSpeed")
    5070                      .dwattr $C$DW$603, DW_AT_TI_symbol_name("_FSM_485RefSpeed")
    5071                      .dwattr $C$DW$603, DW_AT_data_member_location[DW_OP_plus_uconst 0x11]
    5072                      .dwattr $C$DW$603, DW_AT_accessibility(DW_ACCESS_public)
    5073              $C$DW$604       .dwtag  DW_TAG_member
    5074                      .dwattr $C$DW$604, DW_AT_type(*$C$DW$T$37)
    5075                      .dwattr $C$DW$604, DW_AT_name("MaxTorque_Nm")
    5076                      .dwattr $C$DW$604, DW_AT_TI_symbol_name("_MaxTorque_Nm")
    5077                      .dwattr $C$DW$604, DW_AT_data_member_location[DW_OP_plus_uconst 0x12]
    5078                      .dwattr $C$DW$604, DW_AT_accessibility(DW_ACCESS_public)
    5079              $C$DW$605       .dwtag  DW_TAG_member
    5080                      .dwattr $C$DW$605, DW_AT_type(*$C$DW$T$57)
    5081                      .dwattr $C$DW$605, DW_AT_name("FSM_CheckCond")
    5082                      .dwattr $C$DW$605, DW_AT_TI_symbol_name("_FSM_CheckCond")
    5083                      .dwattr $C$DW$605, DW_AT_data_member_location[DW_OP_plus_uconst 0x14]
    5084                      .dwattr $C$DW$605, DW_AT_accessibility(DW_ACCESS_public)
    5085              $C$DW$606       .dwtag  DW_TAG_member
    5086                      .dwattr $C$DW$606, DW_AT_type(*$C$DW$T$21)
    5087                      .dwattr $C$DW$606, DW_AT_name("FSM_CondValue")
    5088                      .dwattr $C$DW$606, DW_AT_TI_symbol_name("_FSM_CondValue")
    5089                      .dwattr $C$DW$606, DW_AT_data_member_location[DW_OP_plus_uconst 0x15]
    5090                      .dwattr $C$DW$606, DW_AT_accessibility(DW_ACCESS_public)
    5091              $C$DW$607       .dwtag  DW_TAG_member
    5092                      .dwattr $C$DW$607, DW_AT_type(*$C$DW$T$58)
    5093                      .dwattr $C$DW$607, DW_AT_name("OldAbsPos")
    5094                      .dwattr $C$DW$607, DW_AT_TI_symbol_name("_OldAbsPos")
    5095                      .dwattr $C$DW$607, DW_AT_data_member_location[DW_OP_plus_uconst 0x16]
    5096                      .dwattr $C$DW$607, DW_AT_accessibility(DW_ACCESS_public)
    5097              $C$DW$608       .dwtag  DW_TAG_member
    5098                      .dwattr $C$DW$608, DW_AT_type(*$C$DW$T$58)
    5099                      .dwattr $C$DW$608, DW_AT_name("NewAbsPos")
TMS320C2000 Assembler PC v6.2.5 Wed Nov 22 14:48:16 2017

Tools Copyright (c) 1996-2014 Texas Instruments Incorporated
C:\Users\wmj\AppData\Local\Temp\1257612                              PAGE   98

    5100                      .dwattr $C$DW$608, DW_AT_TI_symbol_name("_NewAbsPos")
    5101                      .dwattr $C$DW$608, DW_AT_data_member_location[DW_OP_plus_uconst 0x1a]
    5102                      .dwattr $C$DW$608, DW_AT_accessibility(DW_ACCESS_public)
    5103              $C$DW$609       .dwtag  DW_TAG_member
    5104                      .dwattr $C$DW$609, DW_AT_type(*$C$DW$T$59)
    5105                      .dwattr $C$DW$609, DW_AT_name("Flag_485StartMotor")
    5106                      .dwattr $C$DW$609, DW_AT_TI_symbol_name("_Flag_485StartMotor")
    5107                      .dwattr $C$DW$609, DW_AT_data_member_location[DW_OP_plus_uconst 0x1e]
    5108                      .dwattr $C$DW$609, DW_AT_accessibility(DW_ACCESS_public)
    5109              $C$DW$610       .dwtag  DW_TAG_member
    5110                      .dwattr $C$DW$610, DW_AT_type(*$C$DW$T$59)
    5111                      .dwattr $C$DW$610, DW_AT_name("Flag_MaxTimeLimit")
    5112                      .dwattr $C$DW$610, DW_AT_TI_symbol_name("_Flag_MaxTimeLimit")
    5113                      .dwattr $C$DW$610, DW_AT_data_member_location[DW_OP_plus_uconst 0x1f]
    5114                      .dwattr $C$DW$610, DW_AT_accessibility(DW_ACCESS_public)
    5115              $C$DW$611       .dwtag  DW_TAG_member
    5116                      .dwattr $C$DW$611, DW_AT_type(*$C$DW$T$59)
    5117                      .dwattr $C$DW$611, DW_AT_name("runTime_Enable")
    5118                      .dwattr $C$DW$611, DW_AT_TI_symbol_name("_runTime_Enable")
    5119                      .dwattr $C$DW$611, DW_AT_data_member_location[DW_OP_plus_uconst 0x20]
    5120                      .dwattr $C$DW$611, DW_AT_accessibility(DW_ACCESS_public)
    5121              $C$DW$612       .dwtag  DW_TAG_member
    5122                      .dwattr $C$DW$612, DW_AT_type(*$C$DW$T$59)
    5123                      .dwattr $C$DW$612, DW_AT_name("Flag_StallEnable")
    5124                      .dwattr $C$DW$612, DW_AT_TI_symbol_name("_Flag_StallEnable")
    5125                      .dwattr $C$DW$612, DW_AT_data_member_location[DW_OP_plus_uconst 0x21]
    5126                      .dwattr $C$DW$612, DW_AT_accessibility(DW_ACCESS_public)
    5127              $C$DW$613       .dwtag  DW_TAG_member
    5128                      .dwattr $C$DW$613, DW_AT_type(*$C$DW$T$59)
    5129                      .dwattr $C$DW$613, DW_AT_name("Flag_ReportState")
    5130                      .dwattr $C$DW$613, DW_AT_TI_symbol_name("_Flag_ReportState")
    5131                      .dwattr $C$DW$613, DW_AT_data_member_location[DW_OP_plus_uconst 0x22]
    5132                      .dwattr $C$DW$613, DW_AT_accessibility(DW_ACCESS_public)
    5133              $C$DW$614       .dwtag  DW_TAG_member
    5134                      .dwattr $C$DW$614, DW_AT_type(*$C$DW$T$59)
    5135                      .dwattr $C$DW$614, DW_AT_name("Flag_RunMode")
    5136                      .dwattr $C$DW$614, DW_AT_TI_symbol_name("_Flag_RunMode")
    5137                      .dwattr $C$DW$614, DW_AT_data_member_location[DW_OP_plus_uconst 0x23]
    5138                      .dwattr $C$DW$614, DW_AT_accessibility(DW_ACCESS_public)
    5139              $C$DW$615       .dwtag  DW_TAG_member
    5140                      .dwattr $C$DW$615, DW_AT_type(*$C$DW$T$59)
    5141                      .dwattr $C$DW$615, DW_AT_name("Flag_DcBrake")
    5142                      .dwattr $C$DW$615, DW_AT_TI_symbol_name("_Flag_DcBrake")
    5143                      .dwattr $C$DW$615, DW_AT_data_member_location[DW_OP_plus_uconst 0x24]
    5144                      .dwattr $C$DW$615, DW_AT_accessibility(DW_ACCESS_public)
    5145                      .dwendtag $C$DW$T$60
    5146              
    5147              $C$DW$T$167     .dwtag  DW_TAG_typedef, DW_AT_name("FSM_Obj")
    5148                      .dwattr $C$DW$T$167, DW_AT_type(*$C$DW$T$60)
    5149                      .dwattr $C$DW$T$167, DW_AT_language(DW_LANG_C)
    5150              $C$DW$T$168     .dwtag  DW_TAG_pointer_type
    5151                      .dwattr $C$DW$T$168, DW_AT_type(*$C$DW$T$60)
    5152                      .dwattr $C$DW$T$168, DW_AT_address_class(0x16)
    5153              $C$DW$T$169     .dwtag  DW_TAG_typedef, DW_AT_name("FSM_Handle")
    5154                      .dwattr $C$DW$T$169, DW_AT_type(*$C$DW$T$168)
TMS320C2000 Assembler PC v6.2.5 Wed Nov 22 14:48:16 2017

Tools Copyright (c) 1996-2014 Texas Instruments Incorporated
C:\Users\wmj\AppData\Local\Temp\1257612                              PAGE   99

    5155                      .dwattr $C$DW$T$169, DW_AT_language(DW_LANG_C)
    5156              $C$DW$616       .dwtag  DW_TAG_TI_far_type
    5157                      .dwattr $C$DW$616, DW_AT_type(*$C$DW$T$169)
    5158              $C$DW$T$170     .dwtag  DW_TAG_const_type
    5159                      .dwattr $C$DW$T$170, DW_AT_type(*$C$DW$616)
    5160              
    5161              $C$DW$T$62      .dwtag  DW_TAG_structure_type
    5162                      .dwattr $C$DW$T$62, DW_AT_name("_FSM_Position_t_")
    5163                      .dwattr $C$DW$T$62, DW_AT_byte_size(0x04)
    5164              $C$DW$617       .dwtag  DW_TAG_member
    5165                      .dwattr $C$DW$617, DW_AT_type(*$C$DW$T$61)
    5166                      .dwattr $C$DW$617, DW_AT_name("PosInt_MRev")
    5167                      .dwattr $C$DW$617, DW_AT_TI_symbol_name("_PosInt_MRev")
    5168                      .dwattr $C$DW$617, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    5169                      .dwattr $C$DW$617, DW_AT_accessibility(DW_ACCESS_public)
    5170              $C$DW$618       .dwtag  DW_TAG_member
    5171                      .dwattr $C$DW$618, DW_AT_type(*$C$DW$T$37)
    5172                      .dwattr $C$DW$618, DW_AT_name("PosFrac_MRev")
    5173                      .dwattr $C$DW$618, DW_AT_TI_symbol_name("_PosFrac_MRev")
    5174                      .dwattr $C$DW$618, DW_AT_data_member_location[DW_OP_plus_uconst 0x2]
    5175                      .dwattr $C$DW$618, DW_AT_accessibility(DW_ACCESS_public)
    5176                      .dwendtag $C$DW$T$62
    5177              
    5178              $C$DW$T$58      .dwtag  DW_TAG_typedef, DW_AT_name("FSM_Position_t")
    5179                      .dwattr $C$DW$T$58, DW_AT_type(*$C$DW$T$62)
    5180                      .dwattr $C$DW$T$58, DW_AT_language(DW_LANG_C)
    5181              
    5182              $C$DW$T$71      .dwtag  DW_TAG_structure_type
    5183                      .dwattr $C$DW$T$71, DW_AT_name("_FSM_StatePool_t_")
    5184                      .dwattr $C$DW$T$71, DW_AT_byte_size(0x4b)
    5185              $C$DW$619       .dwtag  DW_TAG_member
    5186                      .dwattr $C$DW$619, DW_AT_type(*$C$DW$T$64)
    5187                      .dwattr $C$DW$619, DW_AT_name("FSM_RefSpeed")
    5188                      .dwattr $C$DW$619, DW_AT_TI_symbol_name("_FSM_RefSpeed")
    5189                      .dwattr $C$DW$619, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    5190                      .dwattr $C$DW$619, DW_AT_accessibility(DW_ACCESS_public)
    5191              $C$DW$620       .dwtag  DW_TAG_member
    5192                      .dwattr $C$DW$620, DW_AT_type(*$C$DW$T$65)
    5193                      .dwattr $C$DW$620, DW_AT_name("FSM_CondValue")
    5194                      .dwattr $C$DW$620, DW_AT_TI_symbol_name("_FSM_CondValue")
    5195                      .dwattr $C$DW$620, DW_AT_data_member_location[DW_OP_plus_uconst 0xf]
    5196                      .dwattr $C$DW$620, DW_AT_accessibility(DW_ACCESS_public)
    5197              $C$DW$621       .dwtag  DW_TAG_member
    5198                      .dwattr $C$DW$621, DW_AT_type(*$C$DW$T$66)
    5199                      .dwattr $C$DW$621, DW_AT_name("FSM_Condition")
    5200                      .dwattr $C$DW$621, DW_AT_TI_symbol_name("_FSM_Condition")
    5201                      .dwattr $C$DW$621, DW_AT_data_member_location[DW_OP_plus_uconst 0x1e]
    5202                      .dwattr $C$DW$621, DW_AT_accessibility(DW_ACCESS_public)
    5203              $C$DW$622       .dwtag  DW_TAG_member
    5204                      .dwattr $C$DW$622, DW_AT_type(*$C$DW$T$69)
    5205                      .dwattr $C$DW$622, DW_AT_name("FSM_RunAction")
    5206                      .dwattr $C$DW$622, DW_AT_TI_symbol_name("_FSM_RunAction")
    5207                      .dwattr $C$DW$622, DW_AT_data_member_location[DW_OP_plus_uconst 0x2d]
    5208                      .dwattr $C$DW$622, DW_AT_accessibility(DW_ACCESS_public)
    5209              $C$DW$623       .dwtag  DW_TAG_member
TMS320C2000 Assembler PC v6.2.5 Wed Nov 22 14:48:16 2017

Tools Copyright (c) 1996-2014 Texas Instruments Incorporated
C:\Users\wmj\AppData\Local\Temp\1257612                              PAGE  100

    5210                      .dwattr $C$DW$623, DW_AT_type(*$C$DW$T$70)
    5211                      .dwattr $C$DW$623, DW_AT_name("FSM_NextState")
    5212                      .dwattr $C$DW$623, DW_AT_TI_symbol_name("_FSM_NextState")
    5213                      .dwattr $C$DW$623, DW_AT_data_member_location[DW_OP_plus_uconst 0x3c]
    5214                      .dwattr $C$DW$623, DW_AT_accessibility(DW_ACCESS_public)
    5215                      .dwendtag $C$DW$T$71
    5216              
    5217              $C$DW$T$176     .dwtag  DW_TAG_typedef, DW_AT_name("FSM_StatePool_t")
    5218                      .dwattr $C$DW$T$176, DW_AT_type(*$C$DW$T$71)
    5219                      .dwattr $C$DW$T$176, DW_AT_language(DW_LANG_C)
    5220              $C$DW$T$44      .dwtag  DW_TAG_pointer_type
    5221                      .dwattr $C$DW$T$44, DW_AT_type(*$C$DW$T$71)
    5222                      .dwattr $C$DW$T$44, DW_AT_address_class(0x16)
    5223              $C$DW$T$45      .dwtag  DW_TAG_typedef, DW_AT_name("StPool_Handle")
    5224                      .dwattr $C$DW$T$45, DW_AT_type(*$C$DW$T$44)
    5225                      .dwattr $C$DW$T$45, DW_AT_language(DW_LANG_C)
    5226              
    5227              $C$DW$T$72      .dwtag  DW_TAG_structure_type
    5228                      .dwattr $C$DW$T$72, DW_AT_name("_FSM_Vars_t_")
    5229                      .dwattr $C$DW$T$72, DW_AT_byte_size(0x06)
    5230              $C$DW$624       .dwtag  DW_TAG_member
    5231                      .dwattr $C$DW$624, DW_AT_type(*$C$DW$T$16)
    5232                      .dwattr $C$DW$624, DW_AT_name("FSM_RefSpeed")
    5233                      .dwattr $C$DW$624, DW_AT_TI_symbol_name("_FSM_RefSpeed")
    5234                      .dwattr $C$DW$624, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    5235                      .dwattr $C$DW$624, DW_AT_accessibility(DW_ACCESS_public)
    5236              $C$DW$625       .dwtag  DW_TAG_member
    5237                      .dwattr $C$DW$625, DW_AT_type(*$C$DW$T$21)
    5238                      .dwattr $C$DW$625, DW_AT_name("FSM_CondValue")
    5239                      .dwattr $C$DW$625, DW_AT_TI_symbol_name("_FSM_CondValue")
    5240                      .dwattr $C$DW$625, DW_AT_data_member_location[DW_OP_plus_uconst 0x2]
    5241                      .dwattr $C$DW$625, DW_AT_accessibility(DW_ACCESS_public)
    5242              $C$DW$626       .dwtag  DW_TAG_member
    5243                      .dwattr $C$DW$626, DW_AT_type(*$C$DW$T$57)
    5244                      .dwattr $C$DW$626, DW_AT_name("FSM_Condition")
    5245                      .dwattr $C$DW$626, DW_AT_TI_symbol_name("_FSM_Condition")
    5246                      .dwattr $C$DW$626, DW_AT_data_member_location[DW_OP_plus_uconst 0x3]
    5247                      .dwattr $C$DW$626, DW_AT_accessibility(DW_ACCESS_public)
    5248              $C$DW$627       .dwtag  DW_TAG_member
    5249                      .dwattr $C$DW$627, DW_AT_type(*$C$DW$T$68)
    5250                      .dwattr $C$DW$627, DW_AT_name("FSM_RunAction")
    5251                      .dwattr $C$DW$627, DW_AT_TI_symbol_name("_FSM_RunAction")
    5252                      .dwattr $C$DW$627, DW_AT_data_member_location[DW_OP_plus_uconst 0x4]
    5253                      .dwattr $C$DW$627, DW_AT_accessibility(DW_ACCESS_public)
    5254              $C$DW$628       .dwtag  DW_TAG_member
    5255                      .dwattr $C$DW$628, DW_AT_type(*$C$DW$T$47)
    5256                      .dwattr $C$DW$628, DW_AT_name("FSM_NextState")
    5257                      .dwattr $C$DW$628, DW_AT_TI_symbol_name("_FSM_NextState")
    5258                      .dwattr $C$DW$628, DW_AT_data_member_location[DW_OP_plus_uconst 0x5]
    5259                      .dwattr $C$DW$628, DW_AT_accessibility(DW_ACCESS_public)
    5260                      .dwendtag $C$DW$T$72
    5261              
    5262              $C$DW$T$177     .dwtag  DW_TAG_typedef, DW_AT_name("FSM_Vars_t")
    5263                      .dwattr $C$DW$T$177, DW_AT_type(*$C$DW$T$72)
    5264                      .dwattr $C$DW$T$177, DW_AT_language(DW_LANG_C)
TMS320C2000 Assembler PC v6.2.5 Wed Nov 22 14:48:16 2017

Tools Copyright (c) 1996-2014 Texas Instruments Incorporated
C:\Users\wmj\AppData\Local\Temp\1257612                              PAGE  101

    5265              $C$DW$629       .dwtag  DW_TAG_TI_far_type
    5266                      .dwattr $C$DW$629, DW_AT_type(*$C$DW$T$177)
    5267              $C$DW$T$178     .dwtag  DW_TAG_const_type
    5268                      .dwattr $C$DW$T$178, DW_AT_type(*$C$DW$629)
    5269              $C$DW$T$179     .dwtag  DW_TAG_pointer_type
    5270                      .dwattr $C$DW$T$179, DW_AT_type(*$C$DW$T$178)
    5271                      .dwattr $C$DW$T$179, DW_AT_address_class(0x16)
    5272              $C$DW$630       .dwtag  DW_TAG_TI_far_type
    5273                      .dwattr $C$DW$630, DW_AT_type(*$C$DW$T$179)
    5274              $C$DW$T$180     .dwtag  DW_TAG_const_type
    5275                      .dwattr $C$DW$T$180, DW_AT_type(*$C$DW$630)
    5276              
    5277              $C$DW$T$181     .dwtag  DW_TAG_array_type
    5278                      .dwattr $C$DW$T$181, DW_AT_type(*$C$DW$T$178)
    5279                      .dwattr $C$DW$T$181, DW_AT_language(DW_LANG_C)
    5280                      .dwattr $C$DW$T$181, DW_AT_byte_size(0x5a)
    5281              $C$DW$631       .dwtag  DW_TAG_subrange_type
    5282                      .dwattr $C$DW$631, DW_AT_upper_bound(0x0e)
    5283                      .dwendtag $C$DW$T$181
    5284              
    5285              
    5286              $C$DW$T$182     .dwtag  DW_TAG_array_type
    5287                      .dwattr $C$DW$T$182, DW_AT_type(*$C$DW$T$178)
    5288                      .dwattr $C$DW$T$182, DW_AT_language(DW_LANG_C)
    5289                      .dwattr $C$DW$T$182, DW_AT_byte_size(0x30)
    5290              $C$DW$632       .dwtag  DW_TAG_subrange_type
    5291                      .dwattr $C$DW$632, DW_AT_upper_bound(0x07)
    5292                      .dwendtag $C$DW$T$182
    5293              
    5294              
    5295              $C$DW$T$77      .dwtag  DW_TAG_structure_type
    5296                      .dwattr $C$DW$T$77, DW_AT_name("_GPIO_Obj_")
    5297                      .dwattr $C$DW$T$77, DW_AT_byte_size(0x6a)
    5298              $C$DW$633       .dwtag  DW_TAG_member
    5299                      .dwattr $C$DW$633, DW_AT_type(*$C$DW$T$74)
    5300                      .dwattr $C$DW$633, DW_AT_name("GPACTRL")
    5301                      .dwattr $C$DW$633, DW_AT_TI_symbol_name("_GPACTRL")
    5302                      .dwattr $C$DW$633, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    5303                      .dwattr $C$DW$633, DW_AT_accessibility(DW_ACCESS_public)
    5304              $C$DW$634       .dwtag  DW_TAG_member
    5305                      .dwattr $C$DW$634, DW_AT_type(*$C$DW$T$74)
    5306                      .dwattr $C$DW$634, DW_AT_name("GPAQSEL1")
    5307                      .dwattr $C$DW$634, DW_AT_TI_symbol_name("_GPAQSEL1")
    5308                      .dwattr $C$DW$634, DW_AT_data_member_location[DW_OP_plus_uconst 0x2]
    5309                      .dwattr $C$DW$634, DW_AT_accessibility(DW_ACCESS_public)
    5310              $C$DW$635       .dwtag  DW_TAG_member
    5311                      .dwattr $C$DW$635, DW_AT_type(*$C$DW$T$74)
    5312                      .dwattr $C$DW$635, DW_AT_name("GPAQSEL2")
    5313                      .dwattr $C$DW$635, DW_AT_TI_symbol_name("_GPAQSEL2")
    5314                      .dwattr $C$DW$635, DW_AT_data_member_location[DW_OP_plus_uconst 0x4]
    5315                      .dwattr $C$DW$635, DW_AT_accessibility(DW_ACCESS_public)
    5316              $C$DW$636       .dwtag  DW_TAG_member
    5317                      .dwattr $C$DW$636, DW_AT_type(*$C$DW$T$74)
    5318                      .dwattr $C$DW$636, DW_AT_name("GPAMUX1")
    5319                      .dwattr $C$DW$636, DW_AT_TI_symbol_name("_GPAMUX1")
TMS320C2000 Assembler PC v6.2.5 Wed Nov 22 14:48:16 2017

Tools Copyright (c) 1996-2014 Texas Instruments Incorporated
C:\Users\wmj\AppData\Local\Temp\1257612                              PAGE  102

    5320                      .dwattr $C$DW$636, DW_AT_data_member_location[DW_OP_plus_uconst 0x6]
    5321                      .dwattr $C$DW$636, DW_AT_accessibility(DW_ACCESS_public)
    5322              $C$DW$637       .dwtag  DW_TAG_member
    5323                      .dwattr $C$DW$637, DW_AT_type(*$C$DW$T$74)
    5324                      .dwattr $C$DW$637, DW_AT_name("GPAMUX2")
    5325                      .dwattr $C$DW$637, DW_AT_TI_symbol_name("_GPAMUX2")
    5326                      .dwattr $C$DW$637, DW_AT_data_member_location[DW_OP_plus_uconst 0x8]
    5327                      .dwattr $C$DW$637, DW_AT_accessibility(DW_ACCESS_public)
    5328              $C$DW$638       .dwtag  DW_TAG_member
    5329                      .dwattr $C$DW$638, DW_AT_type(*$C$DW$T$74)
    5330                      .dwattr $C$DW$638, DW_AT_name("GPADIR")
    5331                      .dwattr $C$DW$638, DW_AT_TI_symbol_name("_GPADIR")
    5332                      .dwattr $C$DW$638, DW_AT_data_member_location[DW_OP_plus_uconst 0xa]
    5333                      .dwattr $C$DW$638, DW_AT_accessibility(DW_ACCESS_public)
    5334              $C$DW$639       .dwtag  DW_TAG_member
    5335                      .dwattr $C$DW$639, DW_AT_type(*$C$DW$T$74)
    5336                      .dwattr $C$DW$639, DW_AT_name("GPAPUD")
    5337                      .dwattr $C$DW$639, DW_AT_TI_symbol_name("_GPAPUD")
    5338                      .dwattr $C$DW$639, DW_AT_data_member_location[DW_OP_plus_uconst 0xc]
    5339                      .dwattr $C$DW$639, DW_AT_accessibility(DW_ACCESS_public)
    5340              $C$DW$640       .dwtag  DW_TAG_member
    5341                      .dwattr $C$DW$640, DW_AT_type(*$C$DW$T$25)
    5342                      .dwattr $C$DW$640, DW_AT_name("rsvd_1")
    5343                      .dwattr $C$DW$640, DW_AT_TI_symbol_name("_rsvd_1")
    5344                      .dwattr $C$DW$640, DW_AT_data_member_location[DW_OP_plus_uconst 0xe]
    5345                      .dwattr $C$DW$640, DW_AT_accessibility(DW_ACCESS_public)
    5346              $C$DW$641       .dwtag  DW_TAG_member
    5347                      .dwattr $C$DW$641, DW_AT_type(*$C$DW$T$74)
    5348                      .dwattr $C$DW$641, DW_AT_name("GPBCTRL")
    5349                      .dwattr $C$DW$641, DW_AT_TI_symbol_name("_GPBCTRL")
    5350                      .dwattr $C$DW$641, DW_AT_data_member_location[DW_OP_plus_uconst 0x10]
    5351                      .dwattr $C$DW$641, DW_AT_accessibility(DW_ACCESS_public)
    5352              $C$DW$642       .dwtag  DW_TAG_member
    5353                      .dwattr $C$DW$642, DW_AT_type(*$C$DW$T$74)
    5354                      .dwattr $C$DW$642, DW_AT_name("GPBQSEL1")
    5355                      .dwattr $C$DW$642, DW_AT_TI_symbol_name("_GPBQSEL1")
    5356                      .dwattr $C$DW$642, DW_AT_data_member_location[DW_OP_plus_uconst 0x12]
    5357                      .dwattr $C$DW$642, DW_AT_accessibility(DW_ACCESS_public)
    5358              $C$DW$643       .dwtag  DW_TAG_member
    5359                      .dwattr $C$DW$643, DW_AT_type(*$C$DW$T$25)
    5360                      .dwattr $C$DW$643, DW_AT_name("rsvd_2")
    5361                      .dwattr $C$DW$643, DW_AT_TI_symbol_name("_rsvd_2")
    5362                      .dwattr $C$DW$643, DW_AT_data_member_location[DW_OP_plus_uconst 0x14]
    5363                      .dwattr $C$DW$643, DW_AT_accessibility(DW_ACCESS_public)
    5364              $C$DW$644       .dwtag  DW_TAG_member
    5365                      .dwattr $C$DW$644, DW_AT_type(*$C$DW$T$74)
    5366                      .dwattr $C$DW$644, DW_AT_name("GPBMUX1")
    5367                      .dwattr $C$DW$644, DW_AT_TI_symbol_name("_GPBMUX1")
    5368                      .dwattr $C$DW$644, DW_AT_data_member_location[DW_OP_plus_uconst 0x16]
    5369                      .dwattr $C$DW$644, DW_AT_accessibility(DW_ACCESS_public)
    5370              $C$DW$645       .dwtag  DW_TAG_member
    5371                      .dwattr $C$DW$645, DW_AT_type(*$C$DW$T$25)
    5372                      .dwattr $C$DW$645, DW_AT_name("rsvd_3")
    5373                      .dwattr $C$DW$645, DW_AT_TI_symbol_name("_rsvd_3")
    5374                      .dwattr $C$DW$645, DW_AT_data_member_location[DW_OP_plus_uconst 0x18]
TMS320C2000 Assembler PC v6.2.5 Wed Nov 22 14:48:16 2017

Tools Copyright (c) 1996-2014 Texas Instruments Incorporated
C:\Users\wmj\AppData\Local\Temp\1257612                              PAGE  103

    5375                      .dwattr $C$DW$645, DW_AT_accessibility(DW_ACCESS_public)
    5376              $C$DW$646       .dwtag  DW_TAG_member
    5377                      .dwattr $C$DW$646, DW_AT_type(*$C$DW$T$74)
    5378                      .dwattr $C$DW$646, DW_AT_name("GPBDIR")
    5379                      .dwattr $C$DW$646, DW_AT_TI_symbol_name("_GPBDIR")
    5380                      .dwattr $C$DW$646, DW_AT_data_member_location[DW_OP_plus_uconst 0x1a]
    5381                      .dwattr $C$DW$646, DW_AT_accessibility(DW_ACCESS_public)
    5382              $C$DW$647       .dwtag  DW_TAG_member
    5383                      .dwattr $C$DW$647, DW_AT_type(*$C$DW$T$74)
    5384                      .dwattr $C$DW$647, DW_AT_name("GPBPUD")
    5385                      .dwattr $C$DW$647, DW_AT_TI_symbol_name("_GPBPUD")
    5386                      .dwattr $C$DW$647, DW_AT_data_member_location[DW_OP_plus_uconst 0x1c]
    5387                      .dwattr $C$DW$647, DW_AT_accessibility(DW_ACCESS_public)
    5388              $C$DW$648       .dwtag  DW_TAG_member
    5389                      .dwattr $C$DW$648, DW_AT_type(*$C$DW$T$75)
    5390                      .dwattr $C$DW$648, DW_AT_name("rsvd_4")
    5391                      .dwattr $C$DW$648, DW_AT_TI_symbol_name("_rsvd_4")
    5392                      .dwattr $C$DW$648, DW_AT_data_member_location[DW_OP_plus_uconst 0x1e]
    5393                      .dwattr $C$DW$648, DW_AT_accessibility(DW_ACCESS_public)
    5394              $C$DW$649       .dwtag  DW_TAG_member
    5395                      .dwattr $C$DW$649, DW_AT_type(*$C$DW$T$74)
    5396                      .dwattr $C$DW$649, DW_AT_name("AIOMUX1")
    5397                      .dwattr $C$DW$649, DW_AT_TI_symbol_name("_AIOMUX1")
    5398                      .dwattr $C$DW$649, DW_AT_data_member_location[DW_OP_plus_uconst 0x36]
    5399                      .dwattr $C$DW$649, DW_AT_accessibility(DW_ACCESS_public)
    5400              $C$DW$650       .dwtag  DW_TAG_member
    5401                      .dwattr $C$DW$650, DW_AT_type(*$C$DW$T$25)
    5402                      .dwattr $C$DW$650, DW_AT_name("rsvd_5")
    5403                      .dwattr $C$DW$650, DW_AT_TI_symbol_name("_rsvd_5")
    5404                      .dwattr $C$DW$650, DW_AT_data_member_location[DW_OP_plus_uconst 0x38]
    5405                      .dwattr $C$DW$650, DW_AT_accessibility(DW_ACCESS_public)
    5406              $C$DW$651       .dwtag  DW_TAG_member
    5407                      .dwattr $C$DW$651, DW_AT_type(*$C$DW$T$74)
    5408                      .dwattr $C$DW$651, DW_AT_name("AIODIR")
    5409                      .dwattr $C$DW$651, DW_AT_TI_symbol_name("_AIODIR")
    5410                      .dwattr $C$DW$651, DW_AT_data_member_location[DW_OP_plus_uconst 0x3a]
    5411                      .dwattr $C$DW$651, DW_AT_accessibility(DW_ACCESS_public)
    5412              $C$DW$652       .dwtag  DW_TAG_member
    5413                      .dwattr $C$DW$652, DW_AT_type(*$C$DW$T$76)
    5414                      .dwattr $C$DW$652, DW_AT_name("rsvd_6")
    5415                      .dwattr $C$DW$652, DW_AT_TI_symbol_name("_rsvd_6")
    5416                      .dwattr $C$DW$652, DW_AT_data_member_location[DW_OP_plus_uconst 0x3c]
    5417                      .dwattr $C$DW$652, DW_AT_accessibility(DW_ACCESS_public)
    5418              $C$DW$653       .dwtag  DW_TAG_member
    5419                      .dwattr $C$DW$653, DW_AT_type(*$C$DW$T$74)
    5420                      .dwattr $C$DW$653, DW_AT_name("GPADAT")
    5421                      .dwattr $C$DW$653, DW_AT_TI_symbol_name("_GPADAT")
    5422                      .dwattr $C$DW$653, DW_AT_data_member_location[DW_OP_plus_uconst 0x40]
    5423                      .dwattr $C$DW$653, DW_AT_accessibility(DW_ACCESS_public)
    5424              $C$DW$654       .dwtag  DW_TAG_member
    5425                      .dwattr $C$DW$654, DW_AT_type(*$C$DW$T$74)
    5426                      .dwattr $C$DW$654, DW_AT_name("GPASET")
    5427                      .dwattr $C$DW$654, DW_AT_TI_symbol_name("_GPASET")
    5428                      .dwattr $C$DW$654, DW_AT_data_member_location[DW_OP_plus_uconst 0x42]
    5429                      .dwattr $C$DW$654, DW_AT_accessibility(DW_ACCESS_public)
TMS320C2000 Assembler PC v6.2.5 Wed Nov 22 14:48:16 2017

Tools Copyright (c) 1996-2014 Texas Instruments Incorporated
C:\Users\wmj\AppData\Local\Temp\1257612                              PAGE  104

    5430              $C$DW$655       .dwtag  DW_TAG_member
    5431                      .dwattr $C$DW$655, DW_AT_type(*$C$DW$T$74)
    5432                      .dwattr $C$DW$655, DW_AT_name("GPACLEAR")
    5433                      .dwattr $C$DW$655, DW_AT_TI_symbol_name("_GPACLEAR")
    5434                      .dwattr $C$DW$655, DW_AT_data_member_location[DW_OP_plus_uconst 0x44]
    5435                      .dwattr $C$DW$655, DW_AT_accessibility(DW_ACCESS_public)
    5436              $C$DW$656       .dwtag  DW_TAG_member
    5437                      .dwattr $C$DW$656, DW_AT_type(*$C$DW$T$74)
    5438                      .dwattr $C$DW$656, DW_AT_name("GPATOGGLE")
    5439                      .dwattr $C$DW$656, DW_AT_TI_symbol_name("_GPATOGGLE")
    5440                      .dwattr $C$DW$656, DW_AT_data_member_location[DW_OP_plus_uconst 0x46]
    5441                      .dwattr $C$DW$656, DW_AT_accessibility(DW_ACCESS_public)
    5442              $C$DW$657       .dwtag  DW_TAG_member
    5443                      .dwattr $C$DW$657, DW_AT_type(*$C$DW$T$74)
    5444                      .dwattr $C$DW$657, DW_AT_name("GPBDAT")
    5445                      .dwattr $C$DW$657, DW_AT_TI_symbol_name("_GPBDAT")
    5446                      .dwattr $C$DW$657, DW_AT_data_member_location[DW_OP_plus_uconst 0x48]
    5447                      .dwattr $C$DW$657, DW_AT_accessibility(DW_ACCESS_public)
    5448              $C$DW$658       .dwtag  DW_TAG_member
    5449                      .dwattr $C$DW$658, DW_AT_type(*$C$DW$T$74)
    5450                      .dwattr $C$DW$658, DW_AT_name("GPBSET")
    5451                      .dwattr $C$DW$658, DW_AT_TI_symbol_name("_GPBSET")
    5452                      .dwattr $C$DW$658, DW_AT_data_member_location[DW_OP_plus_uconst 0x4a]
    5453                      .dwattr $C$DW$658, DW_AT_accessibility(DW_ACCESS_public)
    5454              $C$DW$659       .dwtag  DW_TAG_member
    5455                      .dwattr $C$DW$659, DW_AT_type(*$C$DW$T$74)
    5456                      .dwattr $C$DW$659, DW_AT_name("GPBCLEAR")
    5457                      .dwattr $C$DW$659, DW_AT_TI_symbol_name("_GPBCLEAR")
    5458                      .dwattr $C$DW$659, DW_AT_data_member_location[DW_OP_plus_uconst 0x4c]
    5459                      .dwattr $C$DW$659, DW_AT_accessibility(DW_ACCESS_public)
    5460              $C$DW$660       .dwtag  DW_TAG_member
    5461                      .dwattr $C$DW$660, DW_AT_type(*$C$DW$T$74)
    5462                      .dwattr $C$DW$660, DW_AT_name("GPBTOGGLE")
    5463                      .dwattr $C$DW$660, DW_AT_TI_symbol_name("_GPBTOGGLE")
    5464                      .dwattr $C$DW$660, DW_AT_data_member_location[DW_OP_plus_uconst 0x4e]
    5465                      .dwattr $C$DW$660, DW_AT_accessibility(DW_ACCESS_public)
    5466              $C$DW$661       .dwtag  DW_TAG_member
    5467                      .dwattr $C$DW$661, DW_AT_type(*$C$DW$T$30)
    5468                      .dwattr $C$DW$661, DW_AT_name("rsvd_7")
    5469                      .dwattr $C$DW$661, DW_AT_TI_symbol_name("_rsvd_7")
    5470                      .dwattr $C$DW$661, DW_AT_data_member_location[DW_OP_plus_uconst 0x50]
    5471                      .dwattr $C$DW$661, DW_AT_accessibility(DW_ACCESS_public)
    5472              $C$DW$662       .dwtag  DW_TAG_member
    5473                      .dwattr $C$DW$662, DW_AT_type(*$C$DW$T$74)
    5474                      .dwattr $C$DW$662, DW_AT_name("AIODAT")
    5475                      .dwattr $C$DW$662, DW_AT_TI_symbol_name("_AIODAT")
    5476                      .dwattr $C$DW$662, DW_AT_data_member_location[DW_OP_plus_uconst 0x58]
    5477                      .dwattr $C$DW$662, DW_AT_accessibility(DW_ACCESS_public)
    5478              $C$DW$663       .dwtag  DW_TAG_member
    5479                      .dwattr $C$DW$663, DW_AT_type(*$C$DW$T$74)
    5480                      .dwattr $C$DW$663, DW_AT_name("AIOSET")
    5481                      .dwattr $C$DW$663, DW_AT_TI_symbol_name("_AIOSET")
    5482                      .dwattr $C$DW$663, DW_AT_data_member_location[DW_OP_plus_uconst 0x5a]
    5483                      .dwattr $C$DW$663, DW_AT_accessibility(DW_ACCESS_public)
    5484              $C$DW$664       .dwtag  DW_TAG_member
TMS320C2000 Assembler PC v6.2.5 Wed Nov 22 14:48:16 2017

Tools Copyright (c) 1996-2014 Texas Instruments Incorporated
C:\Users\wmj\AppData\Local\Temp\1257612                              PAGE  105

    5485                      .dwattr $C$DW$664, DW_AT_type(*$C$DW$T$74)
    5486                      .dwattr $C$DW$664, DW_AT_name("AIOCLEAR")
    5487                      .dwattr $C$DW$664, DW_AT_TI_symbol_name("_AIOCLEAR")
    5488                      .dwattr $C$DW$664, DW_AT_data_member_location[DW_OP_plus_uconst 0x5c]
    5489                      .dwattr $C$DW$664, DW_AT_accessibility(DW_ACCESS_public)
    5490              $C$DW$665       .dwtag  DW_TAG_member
    5491                      .dwattr $C$DW$665, DW_AT_type(*$C$DW$T$74)
    5492                      .dwattr $C$DW$665, DW_AT_name("AIOTOGGLE")
    5493                      .dwattr $C$DW$665, DW_AT_TI_symbol_name("_AIOTOGGLE")
    5494                      .dwattr $C$DW$665, DW_AT_data_member_location[DW_OP_plus_uconst 0x5e]
    5495                      .dwattr $C$DW$665, DW_AT_accessibility(DW_ACCESS_public)
    5496              $C$DW$666       .dwtag  DW_TAG_member
    5497                      .dwattr $C$DW$666, DW_AT_type(*$C$DW$T$27)
    5498                      .dwattr $C$DW$666, DW_AT_name("GPIOXINTnSEL")
    5499                      .dwattr $C$DW$666, DW_AT_TI_symbol_name("_GPIOXINTnSEL")
    5500                      .dwattr $C$DW$666, DW_AT_data_member_location[DW_OP_plus_uconst 0x60]
    5501                      .dwattr $C$DW$666, DW_AT_accessibility(DW_ACCESS_public)
    5502              $C$DW$667       .dwtag  DW_TAG_member
    5503                      .dwattr $C$DW$667, DW_AT_type(*$C$DW$T$26)
    5504                      .dwattr $C$DW$667, DW_AT_name("rsvd_8")
    5505                      .dwattr $C$DW$667, DW_AT_TI_symbol_name("_rsvd_8")
    5506                      .dwattr $C$DW$667, DW_AT_data_member_location[DW_OP_plus_uconst 0x63]
    5507                      .dwattr $C$DW$667, DW_AT_accessibility(DW_ACCESS_public)
    5508              $C$DW$668       .dwtag  DW_TAG_member
    5509                      .dwattr $C$DW$668, DW_AT_type(*$C$DW$T$74)
    5510                      .dwattr $C$DW$668, DW_AT_name("GPIOLPMSEL")
    5511                      .dwattr $C$DW$668, DW_AT_TI_symbol_name("_GPIOLPMSEL")
    5512                      .dwattr $C$DW$668, DW_AT_data_member_location[DW_OP_plus_uconst 0x68]
    5513                      .dwattr $C$DW$668, DW_AT_accessibility(DW_ACCESS_public)
    5514                      .dwendtag $C$DW$T$77
    5515              
    5516              $C$DW$T$88      .dwtag  DW_TAG_pointer_type
    5517                      .dwattr $C$DW$T$88, DW_AT_type(*$C$DW$T$77)
    5518                      .dwattr $C$DW$T$88, DW_AT_address_class(0x16)
    5519              $C$DW$T$89      .dwtag  DW_TAG_typedef, DW_AT_name("GPIO_Handle")
    5520                      .dwattr $C$DW$T$89, DW_AT_type(*$C$DW$T$88)
    5521                      .dwattr $C$DW$T$89, DW_AT_language(DW_LANG_C)
    5522              
    5523              $C$DW$T$79      .dwtag  DW_TAG_structure_type
    5524                      .dwattr $C$DW$T$79, DW_AT_name("_HAL_AdcData_t_")
    5525                      .dwattr $C$DW$T$79, DW_AT_byte_size(0x16)
    5526              $C$DW$669       .dwtag  DW_TAG_member
    5527                      .dwattr $C$DW$669, DW_AT_type(*$C$DW$T$78)
    5528                      .dwattr $C$DW$669, DW_AT_name("I")
    5529                      .dwattr $C$DW$669, DW_AT_TI_symbol_name("_I")
    5530                      .dwattr $C$DW$669, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    5531                      .dwattr $C$DW$669, DW_AT_accessibility(DW_ACCESS_public)
    5532              $C$DW$670       .dwtag  DW_TAG_member
    5533                      .dwattr $C$DW$670, DW_AT_type(*$C$DW$T$78)
    5534                      .dwattr $C$DW$670, DW_AT_name("V")
    5535                      .dwattr $C$DW$670, DW_AT_TI_symbol_name("_V")
    5536                      .dwattr $C$DW$670, DW_AT_data_member_location[DW_OP_plus_uconst 0x6]
    5537                      .dwattr $C$DW$670, DW_AT_accessibility(DW_ACCESS_public)
    5538              $C$DW$671       .dwtag  DW_TAG_member
    5539                      .dwattr $C$DW$671, DW_AT_type(*$C$DW$T$37)
TMS320C2000 Assembler PC v6.2.5 Wed Nov 22 14:48:16 2017

Tools Copyright (c) 1996-2014 Texas Instruments Incorporated
C:\Users\wmj\AppData\Local\Temp\1257612                              PAGE  106

    5540                      .dwattr $C$DW$671, DW_AT_name("dcBus")
    5541                      .dwattr $C$DW$671, DW_AT_TI_symbol_name("_dcBus")
    5542                      .dwattr $C$DW$671, DW_AT_data_member_location[DW_OP_plus_uconst 0xc]
    5543                      .dwattr $C$DW$671, DW_AT_accessibility(DW_ACCESS_public)
    5544              $C$DW$672       .dwtag  DW_TAG_member
    5545                      .dwattr $C$DW$672, DW_AT_type(*$C$DW$T$37)
    5546                      .dwattr $C$DW$672, DW_AT_name("analogSensor1")
    5547                      .dwattr $C$DW$672, DW_AT_TI_symbol_name("_analogSensor1")
    5548                      .dwattr $C$DW$672, DW_AT_data_member_location[DW_OP_plus_uconst 0xe]
    5549                      .dwattr $C$DW$672, DW_AT_accessibility(DW_ACCESS_public)
    5550              $C$DW$673       .dwtag  DW_TAG_member
    5551                      .dwattr $C$DW$673, DW_AT_type(*$C$DW$T$37)
    5552                      .dwattr $C$DW$673, DW_AT_name("analogSensor2")
    5553                      .dwattr $C$DW$673, DW_AT_TI_symbol_name("_analogSensor2")
    5554                      .dwattr $C$DW$673, DW_AT_data_member_location[DW_OP_plus_uconst 0x10]
    5555                      .dwattr $C$DW$673, DW_AT_accessibility(DW_ACCESS_public)
    5556              $C$DW$674       .dwtag  DW_TAG_member
    5557                      .dwattr $C$DW$674, DW_AT_type(*$C$DW$T$37)
    5558                      .dwattr $C$DW$674, DW_AT_name("igbtNTC")
    5559                      .dwattr $C$DW$674, DW_AT_TI_symbol_name("_igbtNTC")
    5560                      .dwattr $C$DW$674, DW_AT_data_member_location[DW_OP_plus_uconst 0x12]
    5561                      .dwattr $C$DW$674, DW_AT_accessibility(DW_ACCESS_public)
    5562              $C$DW$675       .dwtag  DW_TAG_member
    5563                      .dwattr $C$DW$675, DW_AT_type(*$C$DW$T$37)
    5564                      .dwattr $C$DW$675, DW_AT_name("boardAddr")
    5565                      .dwattr $C$DW$675, DW_AT_TI_symbol_name("_boardAddr")
    5566                      .dwattr $C$DW$675, DW_AT_data_member_location[DW_OP_plus_uconst 0x14]
    5567                      .dwattr $C$DW$675, DW_AT_accessibility(DW_ACCESS_public)
    5568                      .dwendtag $C$DW$T$79
    5569              
    5570              $C$DW$T$115     .dwtag  DW_TAG_typedef, DW_AT_name("HAL_AdcData_t")
    5571                      .dwattr $C$DW$T$115, DW_AT_type(*$C$DW$T$79)
    5572                      .dwattr $C$DW$T$115, DW_AT_language(DW_LANG_C)
    5573              
    5574              $C$DW$T$118     .dwtag  DW_TAG_structure_type
    5575                      .dwattr $C$DW$T$118, DW_AT_name("_HAL_Obj_")
    5576                      .dwattr $C$DW$T$118, DW_AT_byte_size(0xb4)
    5577              $C$DW$676       .dwtag  DW_TAG_member
    5578                      .dwattr $C$DW$676, DW_AT_type(*$C$DW$T$81)
    5579                      .dwattr $C$DW$676, DW_AT_name("adcHandle")
    5580                      .dwattr $C$DW$676, DW_AT_TI_symbol_name("_adcHandle")
    5581                      .dwattr $C$DW$676, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    5582                      .dwattr $C$DW$676, DW_AT_accessibility(DW_ACCESS_public)
    5583              $C$DW$677       .dwtag  DW_TAG_member
    5584                      .dwattr $C$DW$677, DW_AT_type(*$C$DW$T$83)
    5585                      .dwattr $C$DW$677, DW_AT_name("clkHandle")
    5586                      .dwattr $C$DW$677, DW_AT_TI_symbol_name("_clkHandle")
    5587                      .dwattr $C$DW$677, DW_AT_data_member_location[DW_OP_plus_uconst 0x2]
    5588                      .dwattr $C$DW$677, DW_AT_accessibility(DW_ACCESS_public)
    5589              $C$DW$678       .dwtag  DW_TAG_member
    5590                      .dwattr $C$DW$678, DW_AT_type(*$C$DW$T$85)
    5591                      .dwattr $C$DW$678, DW_AT_name("cpuHandle")
    5592                      .dwattr $C$DW$678, DW_AT_TI_symbol_name("_cpuHandle")
    5593                      .dwattr $C$DW$678, DW_AT_data_member_location[DW_OP_plus_uconst 0x4]
    5594                      .dwattr $C$DW$678, DW_AT_accessibility(DW_ACCESS_public)
TMS320C2000 Assembler PC v6.2.5 Wed Nov 22 14:48:16 2017

Tools Copyright (c) 1996-2014 Texas Instruments Incorporated
C:\Users\wmj\AppData\Local\Temp\1257612                              PAGE  107

    5595              $C$DW$679       .dwtag  DW_TAG_member
    5596                      .dwattr $C$DW$679, DW_AT_type(*$C$DW$T$87)
    5597                      .dwattr $C$DW$679, DW_AT_name("flashHandle")
    5598                      .dwattr $C$DW$679, DW_AT_TI_symbol_name("_flashHandle")
    5599                      .dwattr $C$DW$679, DW_AT_data_member_location[DW_OP_plus_uconst 0x6]
    5600                      .dwattr $C$DW$679, DW_AT_accessibility(DW_ACCESS_public)
    5601              $C$DW$680       .dwtag  DW_TAG_member
    5602                      .dwattr $C$DW$680, DW_AT_type(*$C$DW$T$89)
    5603                      .dwattr $C$DW$680, DW_AT_name("gpioHandle")
    5604                      .dwattr $C$DW$680, DW_AT_TI_symbol_name("_gpioHandle")
    5605                      .dwattr $C$DW$680, DW_AT_data_member_location[DW_OP_plus_uconst 0x8]
    5606                      .dwattr $C$DW$680, DW_AT_accessibility(DW_ACCESS_public)
    5607              $C$DW$681       .dwtag  DW_TAG_member
    5608                      .dwattr $C$DW$681, DW_AT_type(*$C$DW$T$92)
    5609                      .dwattr $C$DW$681, DW_AT_name("offsetHandle_I")
    5610                      .dwattr $C$DW$681, DW_AT_TI_symbol_name("_offsetHandle_I")
    5611                      .dwattr $C$DW$681, DW_AT_data_member_location[DW_OP_plus_uconst 0xa]
    5612                      .dwattr $C$DW$681, DW_AT_accessibility(DW_ACCESS_public)
    5613              $C$DW$682       .dwtag  DW_TAG_member
    5614                      .dwattr $C$DW$682, DW_AT_type(*$C$DW$T$94)
    5615                      .dwattr $C$DW$682, DW_AT_name("offset_I")
    5616                      .dwattr $C$DW$682, DW_AT_TI_symbol_name("_offset_I")
    5617                      .dwattr $C$DW$682, DW_AT_data_member_location[DW_OP_plus_uconst 0x10]
    5618                      .dwattr $C$DW$682, DW_AT_accessibility(DW_ACCESS_public)
    5619              $C$DW$683       .dwtag  DW_TAG_member
    5620                      .dwattr $C$DW$683, DW_AT_type(*$C$DW$T$92)
    5621                      .dwattr $C$DW$683, DW_AT_name("offsetHandle_V")
    5622                      .dwattr $C$DW$683, DW_AT_TI_symbol_name("_offsetHandle_V")
    5623                      .dwattr $C$DW$683, DW_AT_data_member_location[DW_OP_plus_uconst 0x40]
    5624                      .dwattr $C$DW$683, DW_AT_accessibility(DW_ACCESS_public)
    5625              $C$DW$684       .dwtag  DW_TAG_member
    5626                      .dwattr $C$DW$684, DW_AT_type(*$C$DW$T$94)
    5627                      .dwattr $C$DW$684, DW_AT_name("offset_V")
    5628                      .dwattr $C$DW$684, DW_AT_TI_symbol_name("_offset_V")
    5629                      .dwattr $C$DW$684, DW_AT_data_member_location[DW_OP_plus_uconst 0x46]
    5630                      .dwattr $C$DW$684, DW_AT_accessibility(DW_ACCESS_public)
    5631              $C$DW$685       .dwtag  DW_TAG_member
    5632                      .dwattr $C$DW$685, DW_AT_type(*$C$DW$T$96)
    5633                      .dwattr $C$DW$685, DW_AT_name("oscHandle")
    5634                      .dwattr $C$DW$685, DW_AT_TI_symbol_name("_oscHandle")
    5635                      .dwattr $C$DW$685, DW_AT_data_member_location[DW_OP_plus_uconst 0x76]
    5636                      .dwattr $C$DW$685, DW_AT_accessibility(DW_ACCESS_public)
    5637              $C$DW$686       .dwtag  DW_TAG_member
    5638                      .dwattr $C$DW$686, DW_AT_type(*$C$DW$T$98)
    5639                      .dwattr $C$DW$686, DW_AT_name("pieHandle")
    5640                      .dwattr $C$DW$686, DW_AT_TI_symbol_name("_pieHandle")
    5641                      .dwattr $C$DW$686, DW_AT_data_member_location[DW_OP_plus_uconst 0x78]
    5642                      .dwattr $C$DW$686, DW_AT_accessibility(DW_ACCESS_public)
    5643              $C$DW$687       .dwtag  DW_TAG_member
    5644                      .dwattr $C$DW$687, DW_AT_type(*$C$DW$T$100)
    5645                      .dwattr $C$DW$687, DW_AT_name("pllHandle")
    5646                      .dwattr $C$DW$687, DW_AT_TI_symbol_name("_pllHandle")
    5647                      .dwattr $C$DW$687, DW_AT_data_member_location[DW_OP_plus_uconst 0x7a]
    5648                      .dwattr $C$DW$687, DW_AT_accessibility(DW_ACCESS_public)
    5649              $C$DW$688       .dwtag  DW_TAG_member
TMS320C2000 Assembler PC v6.2.5 Wed Nov 22 14:48:16 2017

Tools Copyright (c) 1996-2014 Texas Instruments Incorporated
C:\Users\wmj\AppData\Local\Temp\1257612                              PAGE  108

    5650                      .dwattr $C$DW$688, DW_AT_type(*$C$DW$T$103)
    5651                      .dwattr $C$DW$688, DW_AT_name("pwmHandle")
    5652                      .dwattr $C$DW$688, DW_AT_TI_symbol_name("_pwmHandle")
    5653                      .dwattr $C$DW$688, DW_AT_data_member_location[DW_OP_plus_uconst 0x7c]
    5654                      .dwattr $C$DW$688, DW_AT_accessibility(DW_ACCESS_public)
    5655              $C$DW$689       .dwtag  DW_TAG_member
    5656                      .dwattr $C$DW$689, DW_AT_type(*$C$DW$T$103)
    5657                      .dwattr $C$DW$689, DW_AT_name("pwmDacHandle")
    5658                      .dwattr $C$DW$689, DW_AT_TI_symbol_name("_pwmDacHandle")
    5659                      .dwattr $C$DW$689, DW_AT_data_member_location[DW_OP_plus_uconst 0x82]
    5660                      .dwattr $C$DW$689, DW_AT_accessibility(DW_ACCESS_public)
    5661              $C$DW$690       .dwtag  DW_TAG_member
    5662                      .dwattr $C$DW$690, DW_AT_type(*$C$DW$T$105)
    5663                      .dwattr $C$DW$690, DW_AT_name("pwrHandle")
    5664                      .dwattr $C$DW$690, DW_AT_TI_symbol_name("_pwrHandle")
    5665                      .dwattr $C$DW$690, DW_AT_data_member_location[DW_OP_plus_uconst 0x88]
    5666                      .dwattr $C$DW$690, DW_AT_accessibility(DW_ACCESS_public)
    5667              $C$DW$691       .dwtag  DW_TAG_member
    5668                      .dwattr $C$DW$691, DW_AT_type(*$C$DW$T$108)
    5669                      .dwattr $C$DW$691, DW_AT_name("timerHandle")
    5670                      .dwattr $C$DW$691, DW_AT_TI_symbol_name("_timerHandle")
    5671                      .dwattr $C$DW$691, DW_AT_data_member_location[DW_OP_plus_uconst 0x8a]
    5672                      .dwattr $C$DW$691, DW_AT_accessibility(DW_ACCESS_public)
    5673              $C$DW$692       .dwtag  DW_TAG_member
    5674                      .dwattr $C$DW$692, DW_AT_type(*$C$DW$T$110)
    5675                      .dwattr $C$DW$692, DW_AT_name("spiAHandle")
    5676                      .dwattr $C$DW$692, DW_AT_TI_symbol_name("_spiAHandle")
    5677                      .dwattr $C$DW$692, DW_AT_data_member_location[DW_OP_plus_uconst 0x90]
    5678                      .dwattr $C$DW$692, DW_AT_accessibility(DW_ACCESS_public)
    5679              $C$DW$693       .dwtag  DW_TAG_member
    5680                      .dwattr $C$DW$693, DW_AT_type(*$C$DW$T$112)
    5681                      .dwattr $C$DW$693, DW_AT_name("wdogHandle")
    5682                      .dwattr $C$DW$693, DW_AT_TI_symbol_name("_wdogHandle")
    5683                      .dwattr $C$DW$693, DW_AT_data_member_location[DW_OP_plus_uconst 0x92]
    5684                      .dwattr $C$DW$693, DW_AT_accessibility(DW_ACCESS_public)
    5685              $C$DW$694       .dwtag  DW_TAG_member
    5686                      .dwattr $C$DW$694, DW_AT_type(*$C$DW$T$114)
    5687                      .dwattr $C$DW$694, DW_AT_name("sciHandle")
    5688                      .dwattr $C$DW$694, DW_AT_TI_symbol_name("_sciHandle")
    5689                      .dwattr $C$DW$694, DW_AT_data_member_location[DW_OP_plus_uconst 0x94]
    5690                      .dwattr $C$DW$694, DW_AT_accessibility(DW_ACCESS_public)
    5691              $C$DW$695       .dwtag  DW_TAG_member
    5692                      .dwattr $C$DW$695, DW_AT_type(*$C$DW$T$115)
    5693                      .dwattr $C$DW$695, DW_AT_name("adcBias")
    5694                      .dwattr $C$DW$695, DW_AT_TI_symbol_name("_adcBias")
    5695                      .dwattr $C$DW$695, DW_AT_data_member_location[DW_OP_plus_uconst 0x96]
    5696                      .dwattr $C$DW$695, DW_AT_accessibility(DW_ACCESS_public)
    5697              $C$DW$696       .dwtag  DW_TAG_member
    5698                      .dwattr $C$DW$696, DW_AT_type(*$C$DW$T$37)
    5699                      .dwattr $C$DW$696, DW_AT_name("current_sf")
    5700                      .dwattr $C$DW$696, DW_AT_TI_symbol_name("_current_sf")
    5701                      .dwattr $C$DW$696, DW_AT_data_member_location[DW_OP_plus_uconst 0xac]
    5702                      .dwattr $C$DW$696, DW_AT_accessibility(DW_ACCESS_public)
