TMS320C2000 Assembler PC v6.2.5 Thu Nov 23 20:50:59 2017

Tools Copyright (c) 1996-2014 Texas Instruments Incorporated
C:\Users\wmj\AppData\Local\Temp\0203211                              PAGE    1

       1              ;***************************************************************
       2              ;* TMS320C2000 C/C++ Codegen                         PC v6.2.5 *
       3              ;* Date/Time created: Thu Nov 23 20:50:59 2017                 *
       4              ;***************************************************************
       5                      .compiler_opts --float_support=softlib --hll_source=on --mem_model:code=flat --mem_model:data=large -
       6        0002  FP      .set    XAR2
       7              
       8              $C$DW$CU        .dwtag  DW_TAG_compile_unit
       9                      .dwattr $C$DW$CU, DW_AT_name("D:/BM1000_v1.1/sw/drivers/drvic/fsm.c")
      10                      .dwattr $C$DW$CU, DW_AT_producer("TMS320C2000 C/C++ Codegen PC v6.2.5 Copyright (c) 1996-2014 Texas I
      11                      .dwattr $C$DW$CU, DW_AT_TI_version(0x01)
      12                      .dwattr $C$DW$CU, DW_AT_comp_dir("D:\BM1000_v1.1\sw\solutions\instaspin_foc\boards\hvkit_rev1p1\f28x\
      13              
      14              $C$DW$1 .dwtag  DW_TAG_subprogram, DW_AT_name("usDelay")
      15                      .dwattr $C$DW$1, DW_AT_TI_symbol_name("_usDelay")
      16                      .dwattr $C$DW$1, DW_AT_declaration

    4376              $C$DW$479       .dwtag  DW_TAG_enumerator, DW_AT_name("GPIO_Number_0"), DW_AT_const_value(0x00)
    4377              $C$DW$480       .dwtag  DW_TAG_enumerator, DW_AT_name("GPIO_Number_1"), DW_AT_const_value(0x01)
    4378              $C$DW$481       .dwtag  DW_TAG_enumerator, DW_AT_name("GPIO_Number_2"), DW_AT_const_value(0x02)
    4379              $C$DW$482       .dwtag  DW_TAG_enumerator, DW_AT_name("GPIO_Number_3"), DW_AT_const_value(0x03)
    4380              $C$DW$483       .dwtag  DW_TAG_enumerator, DW_AT_name("GPIO_Number_4"), DW_AT_const_value(0x04)
    4381              $C$DW$484       .dwtag  DW_TAG_enumerator, DW_AT_name("GPIO_Number_5"), DW_AT_const_value(0x05)
    4382              $C$DW$485       .dwtag  DW_TAG_enumerator, DW_AT_name("GPIO_Number_6"), DW_AT_const_value(0x06)
    4383              $C$DW$486       .dwtag  DW_TAG_enumerator, DW_AT_name("GPIO_Number_7"), DW_AT_const_value(0x07)
    4384              $C$DW$487       .dwtag  DW_TAG_enumerator, DW_AT_name("GPIO_Rsvd_8"), DW_AT_const_value(0x08)
    4385              $C$DW$488       .dwtag  DW_TAG_enumerator, DW_AT_name("GPIO_Rsvd_9"), DW_AT_const_value(0x09)
    4386              $C$DW$489       .dwtag  DW_TAG_enumerator, DW_AT_name("GPIO_Rsvd_10"), DW_AT_const_value(0x0a)
TMS320C2000 Assembler PC v6.2.5 Thu Nov 23 20:50:59 2017

Tools Copyright (c) 1996-2014 Texas Instruments Incorporated
C:\Users\wmj\AppData\Local\Temp\0203211                              PAGE   85

    4387              $C$DW$490       .dwtag  DW_TAG_enumerator, DW_AT_name("GPIO_Rsvd_11"), DW_AT_const_value(0x0b)
    4388              $C$DW$491       .dwtag  DW_TAG_enumerator, DW_AT_name("GPIO_Number_12"), DW_AT_const_value(0x0c)
    4389              $C$DW$492       .dwtag  DW_TAG_enumerator, DW_AT_name("GPIO_Rsvd_13"), DW_AT_const_value(0x0d)
    4390              $C$DW$493       .dwtag  DW_TAG_enumerator, DW_AT_name("GPIO_Rsvd_14"), DW_AT_const_value(0x0e)
    4391              $C$DW$494       .dwtag  DW_TAG_enumerator, DW_AT_name("GPIO_Rsvd_15"), DW_AT_const_value(0x0f)
    4392              $C$DW$495       .dwtag  DW_TAG_enumerator, DW_AT_name("GPIO_Number_16"), DW_AT_const_value(0x10)
    4393              $C$DW$496       .dwtag  DW_TAG_enumerator, DW_AT_name("GPIO_Number_17"), DW_AT_const_value(0x11)
    4394              $C$DW$497       .dwtag  DW_TAG_enumerator, DW_AT_name("GPIO_Number_18"), DW_AT_const_value(0x12)
    4395              $C$DW$498       .dwtag  DW_TAG_enumerator, DW_AT_name("GPIO_Number_19"), DW_AT_const_value(0x13)
    4396              $C$DW$499       .dwtag  DW_TAG_enumerator, DW_AT_name("GPIO_Rsvd_20"), DW_AT_const_value(0x14)
    4397              $C$DW$500       .dwtag  DW_TAG_enumerator, DW_AT_name("GPIO_Rsvd_21"), DW_AT_const_value(0x15)
    4398              $C$DW$501       .dwtag  DW_TAG_enumerator, DW_AT_name("GPIO_Rsvd_22"), DW_AT_const_value(0x16)
    4399              $C$DW$502       .dwtag  DW_TAG_enumerator, DW_AT_name("GPIO_Rsvd_23"), DW_AT_const_value(0x17)
    4400              $C$DW$503       .dwtag  DW_TAG_enumerator, DW_AT_name("GPIO_Rsvd_24"), DW_AT_const_value(0x18)
    4401              $C$DW$504       .dwtag  DW_TAG_enumerator, DW_AT_name("GPIO_Rsvd_25"), DW_AT_const_value(0x19)
    4402              $C$DW$505       .dwtag  DW_TAG_enumerator, DW_AT_name("GPIO_Rsvd_26"), DW_AT_const_value(0x1a)
    4403              $C$DW$506       .dwtag  DW_TAG_enumerator, DW_AT_name("GPIO_Rsvd_27"), DW_AT_const_value(0x1b)
    4404              $C$DW$507       .dwtag  DW_TAG_enumerator, DW_AT_name("GPIO_Number_28"), DW_AT_const_value(0x1c)
    4405              $C$DW$508       .dwtag  DW_TAG_enumerator, DW_AT_name("GPIO_Number_29"), DW_AT_const_value(0x1d)
    4406              $C$DW$509       .dwtag  DW_TAG_enumerator, DW_AT_name("GPIO_Rsvd_30"), DW_AT_const_value(0x1e)
    4407              $C$DW$510       .dwtag  DW_TAG_enumerator, DW_AT_name("GPIO_Rsvd_31"), DW_AT_const_value(0x1f)
    4408              $C$DW$511       .dwtag  DW_TAG_enumerator, DW_AT_name("GPIO_Number_32"), DW_AT_const_value(0x20)
    4409              $C$DW$512       .dwtag  DW_TAG_enumerator, DW_AT_name("GPIO_Number_33"), DW_AT_const_value(0x21)
    4410              $C$DW$513       .dwtag  DW_TAG_enumerator, DW_AT_name("GPIO_Number_34"), DW_AT_const_value(0x22)
    4411              $C$DW$514       .dwtag  DW_TAG_enumerator, DW_AT_name("GPIO_Number_35"), DW_AT_const_value(0x23)
    4412              $C$DW$515       .dwtag  DW_TAG_enumerator, DW_AT_name("GPIO_Number_36"), DW_AT_const_value(0x24)
    4413              $C$DW$516       .dwtag  DW_TAG_enumerator, DW_AT_name("GPIO_Number_37"), DW_AT_const_value(0x25)
    4414              $C$DW$517       .dwtag  DW_TAG_enumerator, DW_AT_name("GPIO_Number_38"), DW_AT_const_value(0x26)
    4415              $C$DW$518       .dwtag  DW_TAG_enumerator, DW_AT_name("GPIO_numGpios"), DW_AT_const_value(0x27)
    4416                      .dwendtag $C$DW$T$164
    4417              
    4418              $C$DW$T$165     .dwtag  DW_TAG_typedef, DW_AT_name("GPIO_Number_e")
    4419                      .dwattr $C$DW$T$165, DW_AT_type(*$C$DW$T$164)
    4420                      .dwattr $C$DW$T$165, DW_AT_language(DW_LANG_C)
    4421              $C$DW$519       .dwtag  DW_TAG_TI_far_type
    4422                      .dwattr $C$DW$519, DW_AT_type(*$C$DW$T$165)
    4423              $C$DW$T$166     .dwtag  DW_TAG_const_type
    4424                      .dwattr $C$DW$T$166, DW_AT_type(*$C$DW$519)
    4425              
    4426              $C$DW$T$29      .dwtag  DW_TAG_structure_type
    4427                      .dwattr $C$DW$T$29, DW_AT_name("_ADC_Obj_")
    4428                      .dwattr $C$DW$T$29, DW_AT_byte_size(0x6650)
    4429              $C$DW$520       .dwtag  DW_TAG_member
    4430                      .dwattr $C$DW$520, DW_AT_type(*$C$DW$T$23)
    4431                      .dwattr $C$DW$520, DW_AT_name("ADCRESULT")
    4432                      .dwattr $C$DW$520, DW_AT_TI_symbol_name("_ADCRESULT")
    4433                      .dwattr $C$DW$520, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    4434                      .dwattr $C$DW$520, DW_AT_accessibility(DW_ACCESS_public)
    4435              $C$DW$521       .dwtag  DW_TAG_member
    4436                      .dwattr $C$DW$521, DW_AT_type(*$C$DW$T$24)
    4437                      .dwattr $C$DW$521, DW_AT_name("resvd_1")
    4438                      .dwattr $C$DW$521, DW_AT_TI_symbol_name("_resvd_1")
    4439                      .dwattr $C$DW$521, DW_AT_data_member_location[DW_OP_plus_uconst 0x10]
    4440                      .dwattr $C$DW$521, DW_AT_accessibility(DW_ACCESS_public)
    4441              $C$DW$522       .dwtag  DW_TAG_member
TMS320C2000 Assembler PC v6.2.5 Thu Nov 23 20:50:59 2017

Tools Copyright (c) 1996-2014 Texas Instruments Incorporated
C:\Users\wmj\AppData\Local\Temp\0203211                              PAGE   86

    4442                      .dwattr $C$DW$522, DW_AT_type(*$C$DW$T$22)
    4443                      .dwattr $C$DW$522, DW_AT_name("ADCCTL1")
    4444                      .dwattr $C$DW$522, DW_AT_TI_symbol_name("_ADCCTL1")
    4445                      .dwattr $C$DW$522, DW_AT_data_member_location[DW_OP_plus_uconst 0x6600]
    4446                      .dwattr $C$DW$522, DW_AT_accessibility(DW_ACCESS_public)
    4447              $C$DW$523       .dwtag  DW_TAG_member
    4448                      .dwattr $C$DW$523, DW_AT_type(*$C$DW$T$22)
    4449                      .dwattr $C$DW$523, DW_AT_name("ADCCTL2")
    4450                      .dwattr $C$DW$523, DW_AT_TI_symbol_name("_ADCCTL2")
    4451                      .dwattr $C$DW$523, DW_AT_data_member_location[DW_OP_plus_uconst 0x6601]
    4452                      .dwattr $C$DW$523, DW_AT_accessibility(DW_ACCESS_public)
    4453              $C$DW$524       .dwtag  DW_TAG_member
    4454                      .dwattr $C$DW$524, DW_AT_type(*$C$DW$T$25)
    4455                      .dwattr $C$DW$524, DW_AT_name("rsvd_2")
    4456                      .dwattr $C$DW$524, DW_AT_TI_symbol_name("_rsvd_2")
    4457                      .dwattr $C$DW$524, DW_AT_data_member_location[DW_OP_plus_uconst 0x6602]
    4458                      .dwattr $C$DW$524, DW_AT_accessibility(DW_ACCESS_public)
    4459              $C$DW$525       .dwtag  DW_TAG_member
    4460                      .dwattr $C$DW$525, DW_AT_type(*$C$DW$T$22)
    4461                      .dwattr $C$DW$525, DW_AT_name("ADCINTFLG")
    4462                      .dwattr $C$DW$525, DW_AT_TI_symbol_name("_ADCINTFLG")
    4463                      .dwattr $C$DW$525, DW_AT_data_member_location[DW_OP_plus_uconst 0x6604]
    4464                      .dwattr $C$DW$525, DW_AT_accessibility(DW_ACCESS_public)
    4465              $C$DW$526       .dwtag  DW_TAG_member
    4466                      .dwattr $C$DW$526, DW_AT_type(*$C$DW$T$22)
    4467                      .dwattr $C$DW$526, DW_AT_name("ADCINTFLGCLR")
    4468                      .dwattr $C$DW$526, DW_AT_TI_symbol_name("_ADCINTFLGCLR")
    4469                      .dwattr $C$DW$526, DW_AT_data_member_location[DW_OP_plus_uconst 0x6605]
    4470                      .dwattr $C$DW$526, DW_AT_accessibility(DW_ACCESS_public)
    4471              $C$DW$527       .dwtag  DW_TAG_member
    4472                      .dwattr $C$DW$527, DW_AT_type(*$C$DW$T$22)
    4473                      .dwattr $C$DW$527, DW_AT_name("ADCINTOVF")
    4474                      .dwattr $C$DW$527, DW_AT_TI_symbol_name("_ADCINTOVF")
    4475                      .dwattr $C$DW$527, DW_AT_data_member_location[DW_OP_plus_uconst 0x6606]
    4476                      .dwattr $C$DW$527, DW_AT_accessibility(DW_ACCESS_public)
    4477              $C$DW$528       .dwtag  DW_TAG_member
    4478                      .dwattr $C$DW$528, DW_AT_type(*$C$DW$T$22)
    4479                      .dwattr $C$DW$528, DW_AT_name("ADCINTOVFCLR")
    4480                      .dwattr $C$DW$528, DW_AT_TI_symbol_name("_ADCINTOVFCLR")
    4481                      .dwattr $C$DW$528, DW_AT_data_member_location[DW_OP_plus_uconst 0x6607]
    4482                      .dwattr $C$DW$528, DW_AT_accessibility(DW_ACCESS_public)
    4483              $C$DW$529       .dwtag  DW_TAG_member
    4484                      .dwattr $C$DW$529, DW_AT_type(*$C$DW$T$26)
    4485                      .dwattr $C$DW$529, DW_AT_name("INTSELxNy")
    4486                      .dwattr $C$DW$529, DW_AT_TI_symbol_name("_INTSELxNy")
    4487                      .dwattr $C$DW$529, DW_AT_data_member_location[DW_OP_plus_uconst 0x6608]
    4488                      .dwattr $C$DW$529, DW_AT_accessibility(DW_ACCESS_public)
    4489              $C$DW$530       .dwtag  DW_TAG_member
    4490                      .dwattr $C$DW$530, DW_AT_type(*$C$DW$T$27)
    4491                      .dwattr $C$DW$530, DW_AT_name("rsvd_3")
    4492                      .dwattr $C$DW$530, DW_AT_TI_symbol_name("_rsvd_3")
    4493                      .dwattr $C$DW$530, DW_AT_data_member_location[DW_OP_plus_uconst 0x660d]
    4494                      .dwattr $C$DW$530, DW_AT_accessibility(DW_ACCESS_public)
    4495              $C$DW$531       .dwtag  DW_TAG_member
    4496                      .dwattr $C$DW$531, DW_AT_type(*$C$DW$T$22)
TMS320C2000 Assembler PC v6.2.5 Thu Nov 23 20:50:59 2017

Tools Copyright (c) 1996-2014 Texas Instruments Incorporated
C:\Users\wmj\AppData\Local\Temp\0203211                              PAGE   87

    4497                      .dwattr $C$DW$531, DW_AT_name("SOCPRICTRL")
    4498                      .dwattr $C$DW$531, DW_AT_TI_symbol_name("_SOCPRICTRL")
    4499                      .dwattr $C$DW$531, DW_AT_data_member_location[DW_OP_plus_uconst 0x6610]
    4500                      .dwattr $C$DW$531, DW_AT_accessibility(DW_ACCESS_public)
    4501              $C$DW$532       .dwtag  DW_TAG_member
    4502                      .dwattr $C$DW$532, DW_AT_type(*$C$DW$T$22)
    4503                      .dwattr $C$DW$532, DW_AT_name("rsvd_4")
    4504                      .dwattr $C$DW$532, DW_AT_TI_symbol_name("_rsvd_4")
    4505                      .dwattr $C$DW$532, DW_AT_data_member_location[DW_OP_plus_uconst 0x6611]
    4506                      .dwattr $C$DW$532, DW_AT_accessibility(DW_ACCESS_public)
    4507              $C$DW$533       .dwtag  DW_TAG_member
    4508                      .dwattr $C$DW$533, DW_AT_type(*$C$DW$T$22)
    4509                      .dwattr $C$DW$533, DW_AT_name("ADCSAMPLEMODE")
    4510                      .dwattr $C$DW$533, DW_AT_TI_symbol_name("_ADCSAMPLEMODE")
    4511                      .dwattr $C$DW$533, DW_AT_data_member_location[DW_OP_plus_uconst 0x6612]
    4512                      .dwattr $C$DW$533, DW_AT_accessibility(DW_ACCESS_public)
    4513              $C$DW$534       .dwtag  DW_TAG_member
    4514                      .dwattr $C$DW$534, DW_AT_type(*$C$DW$T$22)
    4515                      .dwattr $C$DW$534, DW_AT_name("rsvd_5")
    4516                      .dwattr $C$DW$534, DW_AT_TI_symbol_name("_rsvd_5")
    4517                      .dwattr $C$DW$534, DW_AT_data_member_location[DW_OP_plus_uconst 0x6613]
    4518                      .dwattr $C$DW$534, DW_AT_accessibility(DW_ACCESS_public)
    4519              $C$DW$535       .dwtag  DW_TAG_member
    4520                      .dwattr $C$DW$535, DW_AT_type(*$C$DW$T$22)
    4521                      .dwattr $C$DW$535, DW_AT_name("ADCINTSOCSEL1")
    4522                      .dwattr $C$DW$535, DW_AT_TI_symbol_name("_ADCINTSOCSEL1")
    4523                      .dwattr $C$DW$535, DW_AT_data_member_location[DW_OP_plus_uconst 0x6614]
    4524                      .dwattr $C$DW$535, DW_AT_accessibility(DW_ACCESS_public)
    4525              $C$DW$536       .dwtag  DW_TAG_member
    4526                      .dwattr $C$DW$536, DW_AT_type(*$C$DW$T$22)
    4527                      .dwattr $C$DW$536, DW_AT_name("ADCINTSOCSEL2")
    4528                      .dwattr $C$DW$536, DW_AT_TI_symbol_name("_ADCINTSOCSEL2")
    4529                      .dwattr $C$DW$536, DW_AT_data_member_location[DW_OP_plus_uconst 0x6615]
    4530                      .dwattr $C$DW$536, DW_AT_accessibility(DW_ACCESS_public)
    4531              $C$DW$537       .dwtag  DW_TAG_member
    4532                      .dwattr $C$DW$537, DW_AT_type(*$C$DW$T$25)
    4533                      .dwattr $C$DW$537, DW_AT_name("rsvd_6")
    4534                      .dwattr $C$DW$537, DW_AT_TI_symbol_name("_rsvd_6")
    4535                      .dwattr $C$DW$537, DW_AT_data_member_location[DW_OP_plus_uconst 0x6616]
    4536                      .dwattr $C$DW$537, DW_AT_accessibility(DW_ACCESS_public)
    4537              $C$DW$538       .dwtag  DW_TAG_member
    4538                      .dwattr $C$DW$538, DW_AT_type(*$C$DW$T$22)
    4539                      .dwattr $C$DW$538, DW_AT_name("ADCSOCFLG1")
    4540                      .dwattr $C$DW$538, DW_AT_TI_symbol_name("_ADCSOCFLG1")
    4541                      .dwattr $C$DW$538, DW_AT_data_member_location[DW_OP_plus_uconst 0x6618]
    4542                      .dwattr $C$DW$538, DW_AT_accessibility(DW_ACCESS_public)
    4543              $C$DW$539       .dwtag  DW_TAG_member
    4544                      .dwattr $C$DW$539, DW_AT_type(*$C$DW$T$22)
    4545                      .dwattr $C$DW$539, DW_AT_name("rsvd_7")
    4546                      .dwattr $C$DW$539, DW_AT_TI_symbol_name("_rsvd_7")
    4547                      .dwattr $C$DW$539, DW_AT_data_member_location[DW_OP_plus_uconst 0x6619]
    4548                      .dwattr $C$DW$539, DW_AT_accessibility(DW_ACCESS_public)
    4549              $C$DW$540       .dwtag  DW_TAG_member
    4550                      .dwattr $C$DW$540, DW_AT_type(*$C$DW$T$22)
    4551                      .dwattr $C$DW$540, DW_AT_name("ADCSOCFRC1")
TMS320C2000 Assembler PC v6.2.5 Thu Nov 23 20:50:59 2017

Tools Copyright (c) 1996-2014 Texas Instruments Incorporated
C:\Users\wmj\AppData\Local\Temp\0203211                              PAGE   88

    4552                      .dwattr $C$DW$540, DW_AT_TI_symbol_name("_ADCSOCFRC1")
    4553                      .dwattr $C$DW$540, DW_AT_data_member_location[DW_OP_plus_uconst 0x661a]
    4554                      .dwattr $C$DW$540, DW_AT_accessibility(DW_ACCESS_public)
    4555              $C$DW$541       .dwtag  DW_TAG_member
    4556                      .dwattr $C$DW$541, DW_AT_type(*$C$DW$T$22)
    4557                      .dwattr $C$DW$541, DW_AT_name("rsvd_8")
    4558                      .dwattr $C$DW$541, DW_AT_TI_symbol_name("_rsvd_8")
    4559                      .dwattr $C$DW$541, DW_AT_data_member_location[DW_OP_plus_uconst 0x661b]
    4560                      .dwattr $C$DW$541, DW_AT_accessibility(DW_ACCESS_public)
    4561              $C$DW$542       .dwtag  DW_TAG_member
    4562                      .dwattr $C$DW$542, DW_AT_type(*$C$DW$T$22)
    4563                      .dwattr $C$DW$542, DW_AT_name("ADCSOCOVF1")
    4564                      .dwattr $C$DW$542, DW_AT_TI_symbol_name("_ADCSOCOVF1")
    4565                      .dwattr $C$DW$542, DW_AT_data_member_location[DW_OP_plus_uconst 0x661c]
    4566                      .dwattr $C$DW$542, DW_AT_accessibility(DW_ACCESS_public)
    4567              $C$DW$543       .dwtag  DW_TAG_member
    4568                      .dwattr $C$DW$543, DW_AT_type(*$C$DW$T$22)
    4569                      .dwattr $C$DW$543, DW_AT_name("rsvd_9")
    4570                      .dwattr $C$DW$543, DW_AT_TI_symbol_name("_rsvd_9")
    4571                      .dwattr $C$DW$543, DW_AT_data_member_location[DW_OP_plus_uconst 0x661d]
    4572                      .dwattr $C$DW$543, DW_AT_accessibility(DW_ACCESS_public)
    4573              $C$DW$544       .dwtag  DW_TAG_member
    4574                      .dwattr $C$DW$544, DW_AT_type(*$C$DW$T$22)
    4575                      .dwattr $C$DW$544, DW_AT_name("ADCSOCOVFCLR1")
    4576                      .dwattr $C$DW$544, DW_AT_TI_symbol_name("_ADCSOCOVFCLR1")
    4577                      .dwattr $C$DW$544, DW_AT_data_member_location[DW_OP_plus_uconst 0x661e]
    4578                      .dwattr $C$DW$544, DW_AT_accessibility(DW_ACCESS_public)
    4579              $C$DW$545       .dwtag  DW_TAG_member
    4580                      .dwattr $C$DW$545, DW_AT_type(*$C$DW$T$22)
    4581                      .dwattr $C$DW$545, DW_AT_name("rsvd_10")
    4582                      .dwattr $C$DW$545, DW_AT_TI_symbol_name("_rsvd_10")
    4583                      .dwattr $C$DW$545, DW_AT_data_member_location[DW_OP_plus_uconst 0x661f]
    4584                      .dwattr $C$DW$545, DW_AT_accessibility(DW_ACCESS_public)
    4585              $C$DW$546       .dwtag  DW_TAG_member
    4586                      .dwattr $C$DW$546, DW_AT_type(*$C$DW$T$23)
    4587                      .dwattr $C$DW$546, DW_AT_name("ADCSOCxCTL")
    4588                      .dwattr $C$DW$546, DW_AT_TI_symbol_name("_ADCSOCxCTL")
    4589                      .dwattr $C$DW$546, DW_AT_data_member_location[DW_OP_plus_uconst 0x6620]
    4590                      .dwattr $C$DW$546, DW_AT_accessibility(DW_ACCESS_public)
    4591              $C$DW$547       .dwtag  DW_TAG_member
    4592                      .dwattr $C$DW$547, DW_AT_type(*$C$DW$T$23)
    4593                      .dwattr $C$DW$547, DW_AT_name("rsvd_11")
    4594                      .dwattr $C$DW$547, DW_AT_TI_symbol_name("_rsvd_11")
    4595                      .dwattr $C$DW$547, DW_AT_data_member_location[DW_OP_plus_uconst 0x6630]
    4596                      .dwattr $C$DW$547, DW_AT_accessibility(DW_ACCESS_public)
    4597              $C$DW$548       .dwtag  DW_TAG_member
    4598                      .dwattr $C$DW$548, DW_AT_type(*$C$DW$T$22)
    4599                      .dwattr $C$DW$548, DW_AT_name("ADCREFTRIM")
    4600                      .dwattr $C$DW$548, DW_AT_TI_symbol_name("_ADCREFTRIM")
    4601                      .dwattr $C$DW$548, DW_AT_data_member_location[DW_OP_plus_uconst 0x6640]
    4602                      .dwattr $C$DW$548, DW_AT_accessibility(DW_ACCESS_public)
    4603              $C$DW$549       .dwtag  DW_TAG_member
    4604                      .dwattr $C$DW$549, DW_AT_type(*$C$DW$T$22)
    4605                      .dwattr $C$DW$549, DW_AT_name("ADCOFFTRIM")
    4606                      .dwattr $C$DW$549, DW_AT_TI_symbol_name("_ADCOFFTRIM")
TMS320C2000 Assembler PC v6.2.5 Thu Nov 23 20:50:59 2017

Tools Copyright (c) 1996-2014 Texas Instruments Incorporated
C:\Users\wmj\AppData\Local\Temp\0203211                              PAGE   89

    4607                      .dwattr $C$DW$549, DW_AT_data_member_location[DW_OP_plus_uconst 0x6641]
    4608                      .dwattr $C$DW$549, DW_AT_accessibility(DW_ACCESS_public)
    4609              $C$DW$550       .dwtag  DW_TAG_member
    4610                      .dwattr $C$DW$550, DW_AT_type(*$C$DW$T$28)
    4611                      .dwattr $C$DW$550, DW_AT_name("resvd_12")
    4612                      .dwattr $C$DW$550, DW_AT_TI_symbol_name("_resvd_12")
    4613                      .dwattr $C$DW$550, DW_AT_data_member_location[DW_OP_plus_uconst 0x6642]
    4614                      .dwattr $C$DW$550, DW_AT_accessibility(DW_ACCESS_public)
    4615              $C$DW$551       .dwtag  DW_TAG_member
    4616                      .dwattr $C$DW$551, DW_AT_type(*$C$DW$T$22)
    4617                      .dwattr $C$DW$551, DW_AT_name("ADCREV")
    4618                      .dwattr $C$DW$551, DW_AT_TI_symbol_name("_ADCREV")
    4619                      .dwattr $C$DW$551, DW_AT_data_member_location[DW_OP_plus_uconst 0x664f]
    4620                      .dwattr $C$DW$551, DW_AT_accessibility(DW_ACCESS_public)
    4621                      .dwendtag $C$DW$T$29
    4622              
    4623              $C$DW$T$80      .dwtag  DW_TAG_pointer_type
    4624                      .dwattr $C$DW$T$80, DW_AT_type(*$C$DW$T$29)
    4625                      .dwattr $C$DW$T$80, DW_AT_address_class(0x16)
    4626              $C$DW$T$81      .dwtag  DW_TAG_typedef, DW_AT_name("ADC_Handle")
    4627                      .dwattr $C$DW$T$81, DW_AT_type(*$C$DW$T$80)
    4628                      .dwattr $C$DW$T$81, DW_AT_language(DW_LANG_C)
    4629              
    4630              $C$DW$T$31      .dwtag  DW_TAG_structure_type
    4631                      .dwattr $C$DW$T$31, DW_AT_name("_CLK_Obj_")
    4632                      .dwattr $C$DW$T$31, DW_AT_byte_size(0x11)
    4633              $C$DW$552       .dwtag  DW_TAG_member
    4634                      .dwattr $C$DW$552, DW_AT_type(*$C$DW$T$22)
    4635                      .dwattr $C$DW$552, DW_AT_name("XCLK")
    4636                      .dwattr $C$DW$552, DW_AT_TI_symbol_name("_XCLK")
    4637                      .dwattr $C$DW$552, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    4638                      .dwattr $C$DW$552, DW_AT_accessibility(DW_ACCESS_public)
    4639              $C$DW$553       .dwtag  DW_TAG_member
    4640                      .dwattr $C$DW$553, DW_AT_type(*$C$DW$T$22)
    4641                      .dwattr $C$DW$553, DW_AT_name("rsvd_1")
    4642                      .dwattr $C$DW$553, DW_AT_TI_symbol_name("_rsvd_1")
    4643                      .dwattr $C$DW$553, DW_AT_data_member_location[DW_OP_plus_uconst 0x1]
    4644                      .dwattr $C$DW$553, DW_AT_accessibility(DW_ACCESS_public)
    4645              $C$DW$554       .dwtag  DW_TAG_member
    4646                      .dwattr $C$DW$554, DW_AT_type(*$C$DW$T$22)
    4647                      .dwattr $C$DW$554, DW_AT_name("CLKCTL")
    4648                      .dwattr $C$DW$554, DW_AT_TI_symbol_name("_CLKCTL")
    4649                      .dwattr $C$DW$554, DW_AT_data_member_location[DW_OP_plus_uconst 0x2]
    4650                      .dwattr $C$DW$554, DW_AT_accessibility(DW_ACCESS_public)
    4651              $C$DW$555       .dwtag  DW_TAG_member
    4652                      .dwattr $C$DW$555, DW_AT_type(*$C$DW$T$30)
    4653                      .dwattr $C$DW$555, DW_AT_name("rsvd_2")
    4654                      .dwattr $C$DW$555, DW_AT_TI_symbol_name("_rsvd_2")
    4655                      .dwattr $C$DW$555, DW_AT_data_member_location[DW_OP_plus_uconst 0x3]
    4656                      .dwattr $C$DW$555, DW_AT_accessibility(DW_ACCESS_public)
    4657              $C$DW$556       .dwtag  DW_TAG_member
    4658                      .dwattr $C$DW$556, DW_AT_type(*$C$DW$T$22)
    4659                      .dwattr $C$DW$556, DW_AT_name("LOSPCP")
    4660                      .dwattr $C$DW$556, DW_AT_TI_symbol_name("_LOSPCP")
    4661                      .dwattr $C$DW$556, DW_AT_data_member_location[DW_OP_plus_uconst 0xb]
TMS320C2000 Assembler PC v6.2.5 Thu Nov 23 20:50:59 2017

Tools Copyright (c) 1996-2014 Texas Instruments Incorporated
C:\Users\wmj\AppData\Local\Temp\0203211                              PAGE   90

    4662                      .dwattr $C$DW$556, DW_AT_accessibility(DW_ACCESS_public)
    4663              $C$DW$557       .dwtag  DW_TAG_member
    4664                      .dwattr $C$DW$557, DW_AT_type(*$C$DW$T$22)
    4665                      .dwattr $C$DW$557, DW_AT_name("PCLKCR0")
    4666                      .dwattr $C$DW$557, DW_AT_TI_symbol_name("_PCLKCR0")
    4667                      .dwattr $C$DW$557, DW_AT_data_member_location[DW_OP_plus_uconst 0xc]
    4668                      .dwattr $C$DW$557, DW_AT_accessibility(DW_ACCESS_public)
    4669              $C$DW$558       .dwtag  DW_TAG_member
    4670                      .dwattr $C$DW$558, DW_AT_type(*$C$DW$T$22)
    4671                      .dwattr $C$DW$558, DW_AT_name("PCLKCR1")
    4672                      .dwattr $C$DW$558, DW_AT_TI_symbol_name("_PCLKCR1")
    4673                      .dwattr $C$DW$558, DW_AT_data_member_location[DW_OP_plus_uconst 0xd]
    4674                      .dwattr $C$DW$558, DW_AT_accessibility(DW_ACCESS_public)
    4675              $C$DW$559       .dwtag  DW_TAG_member
    4676                      .dwattr $C$DW$559, DW_AT_type(*$C$DW$T$25)
    4677                      .dwattr $C$DW$559, DW_AT_name("rsvd_3")
    4678                      .dwattr $C$DW$559, DW_AT_TI_symbol_name("_rsvd_3")
    4679                      .dwattr $C$DW$559, DW_AT_data_member_location[DW_OP_plus_uconst 0xe]
    4680                      .dwattr $C$DW$559, DW_AT_accessibility(DW_ACCESS_public)
    4681              $C$DW$560       .dwtag  DW_TAG_member
    4682                      .dwattr $C$DW$560, DW_AT_type(*$C$DW$T$22)
    4683                      .dwattr $C$DW$560, DW_AT_name("PCLKCR3")
    4684                      .dwattr $C$DW$560, DW_AT_TI_symbol_name("_PCLKCR3")
    4685                      .dwattr $C$DW$560, DW_AT_data_member_location[DW_OP_plus_uconst 0x10]
    4686                      .dwattr $C$DW$560, DW_AT_accessibility(DW_ACCESS_public)
    4687                      .dwendtag $C$DW$T$31
    4688              
    4689              $C$DW$T$82      .dwtag  DW_TAG_pointer_type
    4690                      .dwattr $C$DW$T$82, DW_AT_type(*$C$DW$T$31)
    4691                      .dwattr $C$DW$T$82, DW_AT_address_class(0x16)
    4692              $C$DW$T$83      .dwtag  DW_TAG_typedef, DW_AT_name("CLK_Handle")
    4693                      .dwattr $C$DW$T$83, DW_AT_type(*$C$DW$T$82)
    4694                      .dwattr $C$DW$T$83, DW_AT_language(DW_LANG_C)
    4695              
    4696              $C$DW$T$33      .dwtag  DW_TAG_structure_type
    4697                      .dwattr $C$DW$T$33, DW_AT_name("_CPU_Obj_")
    4698                      .dwattr $C$DW$T$33, DW_AT_byte_size(0x01)
    4699              $C$DW$561       .dwtag  DW_TAG_member
    4700                      .dwattr $C$DW$561, DW_AT_type(*$C$DW$T$32)
    4701                      .dwattr $C$DW$561, DW_AT_name("tmp")
    4702                      .dwattr $C$DW$561, DW_AT_TI_symbol_name("_tmp")
    4703                      .dwattr $C$DW$561, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    4704                      .dwattr $C$DW$561, DW_AT_accessibility(DW_ACCESS_public)
    4705                      .dwendtag $C$DW$T$33
    4706              
    4707              $C$DW$T$84      .dwtag  DW_TAG_pointer_type
    4708                      .dwattr $C$DW$T$84, DW_AT_type(*$C$DW$T$33)
    4709                      .dwattr $C$DW$T$84, DW_AT_address_class(0x16)
    4710              $C$DW$T$85      .dwtag  DW_TAG_typedef, DW_AT_name("CPU_Handle")
    4711                      .dwattr $C$DW$T$85, DW_AT_type(*$C$DW$T$84)
    4712                      .dwattr $C$DW$T$85, DW_AT_language(DW_LANG_C)
    4713              
    4714              $C$DW$T$36      .dwtag  DW_TAG_structure_type
    4715                      .dwattr $C$DW$T$36, DW_AT_name("_CTRL_Version_")
    4716                      .dwattr $C$DW$T$36, DW_AT_byte_size(0x04)
TMS320C2000 Assembler PC v6.2.5 Thu Nov 23 20:50:59 2017

Tools Copyright (c) 1996-2014 Texas Instruments Incorporated
C:\Users\wmj\AppData\Local\Temp\0203211                              PAGE   91

    4717              $C$DW$562       .dwtag  DW_TAG_member
    4718                      .dwattr $C$DW$562, DW_AT_type(*$C$DW$T$21)
    4719                      .dwattr $C$DW$562, DW_AT_name("rsvd")
    4720                      .dwattr $C$DW$562, DW_AT_TI_symbol_name("_rsvd")
    4721                      .dwattr $C$DW$562, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    4722                      .dwattr $C$DW$562, DW_AT_accessibility(DW_ACCESS_public)
    4723              $C$DW$563       .dwtag  DW_TAG_member
    4724                      .dwattr $C$DW$563, DW_AT_type(*$C$DW$T$35)
    4725                      .dwattr $C$DW$563, DW_AT_name("targetProc")
    4726                      .dwattr $C$DW$563, DW_AT_TI_symbol_name("_targetProc")
    4727                      .dwattr $C$DW$563, DW_AT_data_member_location[DW_OP_plus_uconst 0x1]
    4728                      .dwattr $C$DW$563, DW_AT_accessibility(DW_ACCESS_public)
    4729              $C$DW$564       .dwtag  DW_TAG_member
    4730                      .dwattr $C$DW$564, DW_AT_type(*$C$DW$T$21)
    4731                      .dwattr $C$DW$564, DW_AT_name("major")
    4732                      .dwattr $C$DW$564, DW_AT_TI_symbol_name("_major")
    4733                      .dwattr $C$DW$564, DW_AT_data_member_location[DW_OP_plus_uconst 0x2]
    4734                      .dwattr $C$DW$564, DW_AT_accessibility(DW_ACCESS_public)
    4735              $C$DW$565       .dwtag  DW_TAG_member
    4736                      .dwattr $C$DW$565, DW_AT_type(*$C$DW$T$21)
    4737                      .dwattr $C$DW$565, DW_AT_name("minor")
    4738                      .dwattr $C$DW$565, DW_AT_TI_symbol_name("_minor")
    4739                      .dwattr $C$DW$565, DW_AT_data_member_location[DW_OP_plus_uconst 0x3]
    4740                      .dwattr $C$DW$565, DW_AT_accessibility(DW_ACCESS_public)
    4741                      .dwendtag $C$DW$T$36
    4742              
    4743              $C$DW$T$127     .dwtag  DW_TAG_typedef, DW_AT_name("CTRL_Version")
    4744                      .dwattr $C$DW$T$127, DW_AT_type(*$C$DW$T$36)
    4745                      .dwattr $C$DW$T$127, DW_AT_language(DW_LANG_C)
    4746              
    4747              $C$DW$T$38      .dwtag  DW_TAG_structure_type
    4748                      .dwattr $C$DW$T$38, DW_AT_name("_FILTER_FO_")
    4749                      .dwattr $C$DW$T$38, DW_AT_byte_size(0x0a)
    4750              $C$DW$566       .dwtag  DW_TAG_member
    4751                      .dwattr $C$DW$566, DW_AT_type(*$C$DW$T$37)
    4752                      .dwattr $C$DW$566, DW_AT_name("a1")
    4753                      .dwattr $C$DW$566, DW_AT_TI_symbol_name("_a1")
    4754                      .dwattr $C$DW$566, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    4755                      .dwattr $C$DW$566, DW_AT_accessibility(DW_ACCESS_public)
    4756              $C$DW$567       .dwtag  DW_TAG_member
    4757                      .dwattr $C$DW$567, DW_AT_type(*$C$DW$T$37)
    4758                      .dwattr $C$DW$567, DW_AT_name("b0")
    4759                      .dwattr $C$DW$567, DW_AT_TI_symbol_name("_b0")
    4760                      .dwattr $C$DW$567, DW_AT_data_member_location[DW_OP_plus_uconst 0x2]
    4761                      .dwattr $C$DW$567, DW_AT_accessibility(DW_ACCESS_public)
    4762              $C$DW$568       .dwtag  DW_TAG_member
    4763                      .dwattr $C$DW$568, DW_AT_type(*$C$DW$T$37)
    4764                      .dwattr $C$DW$568, DW_AT_name("b1")
    4765                      .dwattr $C$DW$568, DW_AT_TI_symbol_name("_b1")
    4766                      .dwattr $C$DW$568, DW_AT_data_member_location[DW_OP_plus_uconst 0x4]
    4767                      .dwattr $C$DW$568, DW_AT_accessibility(DW_ACCESS_public)
    4768              $C$DW$569       .dwtag  DW_TAG_member
    4769                      .dwattr $C$DW$569, DW_AT_type(*$C$DW$T$37)
    4770                      .dwattr $C$DW$569, DW_AT_name("x1")
    4771                      .dwattr $C$DW$569, DW_AT_TI_symbol_name("_x1")
TMS320C2000 Assembler PC v6.2.5 Thu Nov 23 20:50:59 2017

Tools Copyright (c) 1996-2014 Texas Instruments Incorporated
C:\Users\wmj\AppData\Local\Temp\0203211                              PAGE   92

    4772                      .dwattr $C$DW$569, DW_AT_data_member_location[DW_OP_plus_uconst 0x6]
    4773                      .dwattr $C$DW$569, DW_AT_accessibility(DW_ACCESS_public)
    4774              $C$DW$570       .dwtag  DW_TAG_member
    4775                      .dwattr $C$DW$570, DW_AT_type(*$C$DW$T$37)
    4776                      .dwattr $C$DW$570, DW_AT_name("y1")
    4777                      .dwattr $C$DW$570, DW_AT_TI_symbol_name("_y1")
    4778                      .dwattr $C$DW$570, DW_AT_data_member_location[DW_OP_plus_uconst 0x8]
    4779                      .dwattr $C$DW$570, DW_AT_accessibility(DW_ACCESS_public)
    4780                      .dwendtag $C$DW$T$38
    4781              
    4782              $C$DW$T$131     .dwtag  DW_TAG_typedef, DW_AT_name("FILTER_FO_Obj")
    4783                      .dwattr $C$DW$T$131, DW_AT_type(*$C$DW$T$38)
    4784                      .dwattr $C$DW$T$131, DW_AT_language(DW_LANG_C)
    4785              
    4786              $C$DW$T$19      .dwtag  DW_TAG_structure_type
    4787                      .dwattr $C$DW$T$19, DW_AT_name("_FILTER_FO_Obj_")
    4788                      .dwattr $C$DW$T$19, DW_AT_declaration
    4789                      .dwendtag $C$DW$T$19
    4790              
    4791              $C$DW$T$132     .dwtag  DW_TAG_pointer_type
    4792                      .dwattr $C$DW$T$132, DW_AT_type(*$C$DW$T$19)
    4793                      .dwattr $C$DW$T$132, DW_AT_address_class(0x16)
    4794              $C$DW$T$133     .dwtag  DW_TAG_typedef, DW_AT_name("FILTER_FO_Handle")
    4795                      .dwattr $C$DW$T$133, DW_AT_type(*$C$DW$T$132)
    4796                      .dwattr $C$DW$T$133, DW_AT_language(DW_LANG_C)
    4797              
    4798              $C$DW$T$39      .dwtag  DW_TAG_structure_type
    4799                      .dwattr $C$DW$T$39, DW_AT_name("_FLASH_Obj_")
    4800                      .dwattr $C$DW$T$39, DW_AT_byte_size(0x08)
    4801              $C$DW$571       .dwtag  DW_TAG_member
    4802                      .dwattr $C$DW$571, DW_AT_type(*$C$DW$T$22)
    4803                      .dwattr $C$DW$571, DW_AT_name("FOPT")
    4804                      .dwattr $C$DW$571, DW_AT_TI_symbol_name("_FOPT")
    4805                      .dwattr $C$DW$571, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    4806                      .dwattr $C$DW$571, DW_AT_accessibility(DW_ACCESS_public)
    4807              $C$DW$572       .dwtag  DW_TAG_member
    4808                      .dwattr $C$DW$572, DW_AT_type(*$C$DW$T$22)
    4809                      .dwattr $C$DW$572, DW_AT_name("rsvd_1")
    4810                      .dwattr $C$DW$572, DW_AT_TI_symbol_name("_rsvd_1")
    4811                      .dwattr $C$DW$572, DW_AT_data_member_location[DW_OP_plus_uconst 0x1]
    4812                      .dwattr $C$DW$572, DW_AT_accessibility(DW_ACCESS_public)
    4813              $C$DW$573       .dwtag  DW_TAG_member
    4814                      .dwattr $C$DW$573, DW_AT_type(*$C$DW$T$22)
    4815                      .dwattr $C$DW$573, DW_AT_name("FPWR")
    4816                      .dwattr $C$DW$573, DW_AT_TI_symbol_name("_FPWR")
    4817                      .dwattr $C$DW$573, DW_AT_data_member_location[DW_OP_plus_uconst 0x2]
    4818                      .dwattr $C$DW$573, DW_AT_accessibility(DW_ACCESS_public)
    4819              $C$DW$574       .dwtag  DW_TAG_member
    4820                      .dwattr $C$DW$574, DW_AT_type(*$C$DW$T$22)
    4821                      .dwattr $C$DW$574, DW_AT_name("FSTATUS")
    4822                      .dwattr $C$DW$574, DW_AT_TI_symbol_name("_FSTATUS")
    4823                      .dwattr $C$DW$574, DW_AT_data_member_location[DW_OP_plus_uconst 0x3]
    4824                      .dwattr $C$DW$574, DW_AT_accessibility(DW_ACCESS_public)
    4825              $C$DW$575       .dwtag  DW_TAG_member
    4826                      .dwattr $C$DW$575, DW_AT_type(*$C$DW$T$22)
TMS320C2000 Assembler PC v6.2.5 Thu Nov 23 20:50:59 2017

Tools Copyright (c) 1996-2014 Texas Instruments Incorporated
C:\Users\wmj\AppData\Local\Temp\0203211                              PAGE   93

    4827                      .dwattr $C$DW$575, DW_AT_name("FSTDBYWAIT")
    4828                      .dwattr $C$DW$575, DW_AT_TI_symbol_name("_FSTDBYWAIT")
    4829                      .dwattr $C$DW$575, DW_AT_data_member_location[DW_OP_plus_uconst 0x4]
    4830                      .dwattr $C$DW$575, DW_AT_accessibility(DW_ACCESS_public)
    4831              $C$DW$576       .dwtag  DW_TAG_member
    4832                      .dwattr $C$DW$576, DW_AT_type(*$C$DW$T$22)
    4833                      .dwattr $C$DW$576, DW_AT_name("FACTIVEWAIT")
    4834                      .dwattr $C$DW$576, DW_AT_TI_symbol_name("_FACTIVEWAIT")
    4835                      .dwattr $C$DW$576, DW_AT_data_member_location[DW_OP_plus_uconst 0x5]
    4836                      .dwattr $C$DW$576, DW_AT_accessibility(DW_ACCESS_public)
    4837              $C$DW$577       .dwtag  DW_TAG_member
    4838                      .dwattr $C$DW$577, DW_AT_type(*$C$DW$T$22)
    4839                      .dwattr $C$DW$577, DW_AT_name("FBANKWAIT")
    4840                      .dwattr $C$DW$577, DW_AT_TI_symbol_name("_FBANKWAIT")
    4841                      .dwattr $C$DW$577, DW_AT_data_member_location[DW_OP_plus_uconst 0x6]
    4842                      .dwattr $C$DW$577, DW_AT_accessibility(DW_ACCESS_public)
    4843              $C$DW$578       .dwtag  DW_TAG_member
    4844                      .dwattr $C$DW$578, DW_AT_type(*$C$DW$T$22)
    4845                      .dwattr $C$DW$578, DW_AT_name("FOTPWAIT")
    4846                      .dwattr $C$DW$578, DW_AT_TI_symbol_name("_FOTPWAIT")
    4847                      .dwattr $C$DW$578, DW_AT_data_member_location[DW_OP_plus_uconst 0x7]
    4848                      .dwattr $C$DW$578, DW_AT_accessibility(DW_ACCESS_public)
    4849                      .dwendtag $C$DW$T$39
    4850              
    4851              $C$DW$T$86      .dwtag  DW_TAG_pointer_type
    4852                      .dwattr $C$DW$T$86, DW_AT_type(*$C$DW$T$39)
    4853                      .dwattr $C$DW$T$86, DW_AT_address_class(0x16)
    4854              $C$DW$T$87      .dwtag  DW_TAG_typedef, DW_AT_name("FLASH_Handle")
    4855                      .dwattr $C$DW$T$87, DW_AT_type(*$C$DW$T$86)
    4856                      .dwattr $C$DW$T$87, DW_AT_language(DW_LANG_C)
    4857              
    4858              $C$DW$T$60      .dwtag  DW_TAG_structure_type
    4859                      .dwattr $C$DW$T$60, DW_AT_name("_FSM_Obj_")
    4860                      .dwattr $C$DW$T$60, DW_AT_byte_size(0x26)
    4861              $C$DW$579       .dwtag  DW_TAG_member
    4862                      .dwattr $C$DW$579, DW_AT_type(*$C$DW$T$41)
    4863                      .dwattr $C$DW$579, DW_AT_name("motorHandle")
    4864                      .dwattr $C$DW$579, DW_AT_TI_symbol_name("_motorHandle")
    4865                      .dwattr $C$DW$579, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    4866                      .dwattr $C$DW$579, DW_AT_accessibility(DW_ACCESS_public)
    4867              $C$DW$580       .dwtag  DW_TAG_member
    4868                      .dwattr $C$DW$580, DW_AT_type(*$C$DW$T$43)
    4869                      .dwattr $C$DW$580, DW_AT_name("halHandle")
    4870                      .dwattr $C$DW$580, DW_AT_TI_symbol_name("_halHandle")
    4871                      .dwattr $C$DW$580, DW_AT_data_member_location[DW_OP_plus_uconst 0x2]
    4872                      .dwattr $C$DW$580, DW_AT_accessibility(DW_ACCESS_public)
    4873              $C$DW$581       .dwtag  DW_TAG_member
    4874                      .dwattr $C$DW$581, DW_AT_type(*$C$DW$T$45)
    4875                      .dwattr $C$DW$581, DW_AT_name("StBoxHandle")
    4876                      .dwattr $C$DW$581, DW_AT_TI_symbol_name("_StBoxHandle")
    4877                      .dwattr $C$DW$581, DW_AT_data_member_location[DW_OP_plus_uconst 0x4]
    4878                      .dwattr $C$DW$581, DW_AT_accessibility(DW_ACCESS_public)
    4879              $C$DW$582       .dwtag  DW_TAG_member
    4880                      .dwattr $C$DW$582, DW_AT_type(*$C$DW$T$47)
    4881                      .dwattr $C$DW$582, DW_AT_name("FSM_State")
TMS320C2000 Assembler PC v6.2.5 Thu Nov 23 20:50:59 2017

Tools Copyright (c) 1996-2014 Texas Instruments Incorporated
C:\Users\wmj\AppData\Local\Temp\0203211                              PAGE   94

    4882                      .dwattr $C$DW$582, DW_AT_TI_symbol_name("_FSM_State")
    4883                      .dwattr $C$DW$582, DW_AT_data_member_location[DW_OP_plus_uconst 0x6]
    4884                      .dwattr $C$DW$582, DW_AT_accessibility(DW_ACCESS_public)
    4885              $C$DW$583       .dwtag  DW_TAG_member
    4886                      .dwattr $C$DW$583, DW_AT_type(*$C$DW$T$47)
    4887                      .dwattr $C$DW$583, DW_AT_name("FSM_CurState")
    4888                      .dwattr $C$DW$583, DW_AT_TI_symbol_name("_FSM_CurState")
    4889                      .dwattr $C$DW$583, DW_AT_data_member_location[DW_OP_plus_uconst 0x7]
    4890                      .dwattr $C$DW$583, DW_AT_accessibility(DW_ACCESS_public)
    4891              $C$DW$584       .dwtag  DW_TAG_member
    4892                      .dwattr $C$DW$584, DW_AT_type(*$C$DW$T$49)
    4893                      .dwattr $C$DW$584, DW_AT_name("FSM_Trans")
    4894                      .dwattr $C$DW$584, DW_AT_TI_symbol_name("_FSM_Trans")
    4895                      .dwattr $C$DW$584, DW_AT_data_member_location[DW_OP_plus_uconst 0x8]
    4896                      .dwattr $C$DW$584, DW_AT_accessibility(DW_ACCESS_public)
    4897              $C$DW$585       .dwtag  DW_TAG_member
    4898                      .dwattr $C$DW$585, DW_AT_type(*$C$DW$T$51)
    4899                      .dwattr $C$DW$585, DW_AT_name("FSM_Event")
    4900                      .dwattr $C$DW$585, DW_AT_TI_symbol_name("_FSM_Event")
    4901                      .dwattr $C$DW$585, DW_AT_data_member_location[DW_OP_plus_uconst 0x9]
    4902                      .dwattr $C$DW$585, DW_AT_accessibility(DW_ACCESS_public)
    4903              $C$DW$586       .dwtag  DW_TAG_member
    4904                      .dwattr $C$DW$586, DW_AT_type(*$C$DW$T$53)
    4905                      .dwattr $C$DW$586, DW_AT_name("FSM_StMode")
    4906                      .dwattr $C$DW$586, DW_AT_TI_symbol_name("_FSM_StMode")
    4907                      .dwattr $C$DW$586, DW_AT_data_member_location[DW_OP_plus_uconst 0xa]
    4908                      .dwattr $C$DW$586, DW_AT_accessibility(DW_ACCESS_public)
    4909              $C$DW$587       .dwtag  DW_TAG_member
    4910                      .dwattr $C$DW$587, DW_AT_type(*$C$DW$T$21)
    4911                      .dwattr $C$DW$587, DW_AT_name("FSM_ErrFlg")
    4912                      .dwattr $C$DW$587, DW_AT_TI_symbol_name("_FSM_ErrFlg")
    4913                      .dwattr $C$DW$587, DW_AT_data_member_location[DW_OP_plus_uconst 0xb]
    4914                      .dwattr $C$DW$587, DW_AT_accessibility(DW_ACCESS_public)
    4915              $C$DW$588       .dwtag  DW_TAG_member
    4916                      .dwattr $C$DW$588, DW_AT_type(*$C$DW$T$21)
    4917                      .dwattr $C$DW$588, DW_AT_name("FSM_ErrMask")
    4918                      .dwattr $C$DW$588, DW_AT_TI_symbol_name("_FSM_ErrMask")
    4919                      .dwattr $C$DW$588, DW_AT_data_member_location[DW_OP_plus_uconst 0xc]
    4920                      .dwattr $C$DW$588, DW_AT_accessibility(DW_ACCESS_public)
    4921              $C$DW$589       .dwtag  DW_TAG_member
    4922                      .dwattr $C$DW$589, DW_AT_type(*$C$DW$T$21)
    4923                      .dwattr $C$DW$589, DW_AT_name("FSM_runTime")
    4924                      .dwattr $C$DW$589, DW_AT_TI_symbol_name("_FSM_runTime")
    4925                      .dwattr $C$DW$589, DW_AT_data_member_location[DW_OP_plus_uconst 0xd]
    4926                      .dwattr $C$DW$589, DW_AT_accessibility(DW_ACCESS_public)
    4927              $C$DW$590       .dwtag  DW_TAG_member
    4928                      .dwattr $C$DW$590, DW_AT_type(*$C$DW$T$21)
    4929                      .dwattr $C$DW$590, DW_AT_name("FSM_485Cmd")
    4930                      .dwattr $C$DW$590, DW_AT_TI_symbol_name("_FSM_485Cmd")
    4931                      .dwattr $C$DW$590, DW_AT_data_member_location[DW_OP_plus_uconst 0xe]
    4932                      .dwattr $C$DW$590, DW_AT_accessibility(DW_ACCESS_public)
    4933              $C$DW$591       .dwtag  DW_TAG_member
    4934                      .dwattr $C$DW$591, DW_AT_type(*$C$DW$T$47)
    4935                      .dwattr $C$DW$591, DW_AT_name("FSM_485EditState")
    4936                      .dwattr $C$DW$591, DW_AT_TI_symbol_name("_FSM_485EditState")
TMS320C2000 Assembler PC v6.2.5 Thu Nov 23 20:50:59 2017

Tools Copyright (c) 1996-2014 Texas Instruments Incorporated
C:\Users\wmj\AppData\Local\Temp\0203211                              PAGE   95

    4937                      .dwattr $C$DW$591, DW_AT_data_member_location[DW_OP_plus_uconst 0xf]
    4938                      .dwattr $C$DW$591, DW_AT_accessibility(DW_ACCESS_public)
    4939              $C$DW$592       .dwtag  DW_TAG_member
    4940                      .dwattr $C$DW$592, DW_AT_type(*$C$DW$T$55)
    4941                      .dwattr $C$DW$592, DW_AT_name("FSM_485EditOpt")
    4942                      .dwattr $C$DW$592, DW_AT_TI_symbol_name("_FSM_485EditOpt")
    4943                      .dwattr $C$DW$592, DW_AT_data_member_location[DW_OP_plus_uconst 0x10]
    4944                      .dwattr $C$DW$592, DW_AT_accessibility(DW_ACCESS_public)
    4945              $C$DW$593       .dwtag  DW_TAG_member
    4946                      .dwattr $C$DW$593, DW_AT_type(*$C$DW$T$21)
    4947                      .dwattr $C$DW$593, DW_AT_name("FSM_485RefSpeed")
    4948                      .dwattr $C$DW$593, DW_AT_TI_symbol_name("_FSM_485RefSpeed")
    4949                      .dwattr $C$DW$593, DW_AT_data_member_location[DW_OP_plus_uconst 0x11]
    4950                      .dwattr $C$DW$593, DW_AT_accessibility(DW_ACCESS_public)
    4951              $C$DW$594       .dwtag  DW_TAG_member
    4952                      .dwattr $C$DW$594, DW_AT_type(*$C$DW$T$37)
    4953                      .dwattr $C$DW$594, DW_AT_name("MaxTorque_Nm")
    4954                      .dwattr $C$DW$594, DW_AT_TI_symbol_name("_MaxTorque_Nm")
    4955                      .dwattr $C$DW$594, DW_AT_data_member_location[DW_OP_plus_uconst 0x12]
    4956                      .dwattr $C$DW$594, DW_AT_accessibility(DW_ACCESS_public)
    4957              $C$DW$595       .dwtag  DW_TAG_member
    4958                      .dwattr $C$DW$595, DW_AT_type(*$C$DW$T$57)
    4959                      .dwattr $C$DW$595, DW_AT_name("FSM_CheckCond")
    4960                      .dwattr $C$DW$595, DW_AT_TI_symbol_name("_FSM_CheckCond")
    4961                      .dwattr $C$DW$595, DW_AT_data_member_location[DW_OP_plus_uconst 0x14]
    4962                      .dwattr $C$DW$595, DW_AT_accessibility(DW_ACCESS_public)
    4963              $C$DW$596       .dwtag  DW_TAG_member
    4964                      .dwattr $C$DW$596, DW_AT_type(*$C$DW$T$21)
    4965                      .dwattr $C$DW$596, DW_AT_name("FSM_CondValue")
    4966                      .dwattr $C$DW$596, DW_AT_TI_symbol_name("_FSM_CondValue")
    4967                      .dwattr $C$DW$596, DW_AT_data_member_location[DW_OP_plus_uconst 0x15]
    4968                      .dwattr $C$DW$596, DW_AT_accessibility(DW_ACCESS_public)
    4969              $C$DW$597       .dwtag  DW_TAG_member
    4970                      .dwattr $C$DW$597, DW_AT_type(*$C$DW$T$58)
    4971                      .dwattr $C$DW$597, DW_AT_name("OldAbsPos")
    4972                      .dwattr $C$DW$597, DW_AT_TI_symbol_name("_OldAbsPos")
    4973                      .dwattr $C$DW$597, DW_AT_data_member_location[DW_OP_plus_uconst 0x16]
    4974                      .dwattr $C$DW$597, DW_AT_accessibility(DW_ACCESS_public)
    4975              $C$DW$598       .dwtag  DW_TAG_member
    4976                      .dwattr $C$DW$598, DW_AT_type(*$C$DW$T$58)
    4977                      .dwattr $C$DW$598, DW_AT_name("NewAbsPos")
    4978                      .dwattr $C$DW$598, DW_AT_TI_symbol_name("_NewAbsPos")
    4979                      .dwattr $C$DW$598, DW_AT_data_member_location[DW_OP_plus_uconst 0x1a]
    4980                      .dwattr $C$DW$598, DW_AT_accessibility(DW_ACCESS_public)
    4981              $C$DW$599       .dwtag  DW_TAG_member
    4982                      .dwattr $C$DW$599, DW_AT_type(*$C$DW$T$59)
    4983                      .dwattr $C$DW$599, DW_AT_name("Flag_485StartMotor")
    4984                      .dwattr $C$DW$599, DW_AT_TI_symbol_name("_Flag_485StartMotor")
    4985                      .dwattr $C$DW$599, DW_AT_data_member_location[DW_OP_plus_uconst 0x1e]
    4986                      .dwattr $C$DW$599, DW_AT_accessibility(DW_ACCESS_public)
    4987              $C$DW$600       .dwtag  DW_TAG_member
    4988                      .dwattr $C$DW$600, DW_AT_type(*$C$DW$T$59)
    4989                      .dwattr $C$DW$600, DW_AT_name("Flag_MaxTimeLimit")
    4990                      .dwattr $C$DW$600, DW_AT_TI_symbol_name("_Flag_MaxTimeLimit")
    4991                      .dwattr $C$DW$600, DW_AT_data_member_location[DW_OP_plus_uconst 0x1f]
TMS320C2000 Assembler PC v6.2.5 Thu Nov 23 20:50:59 2017

Tools Copyright (c) 1996-2014 Texas Instruments Incorporated
C:\Users\wmj\AppData\Local\Temp\0203211                              PAGE   96

    4992                      .dwattr $C$DW$600, DW_AT_accessibility(DW_ACCESS_public)
    4993              $C$DW$601       .dwtag  DW_TAG_member
    4994                      .dwattr $C$DW$601, DW_AT_type(*$C$DW$T$59)
    4995                      .dwattr $C$DW$601, DW_AT_name("runTime_Enable")
    4996                      .dwattr $C$DW$601, DW_AT_TI_symbol_name("_runTime_Enable")
    4997                      .dwattr $C$DW$601, DW_AT_data_member_location[DW_OP_plus_uconst 0x20]
    4998                      .dwattr $C$DW$601, DW_AT_accessibility(DW_ACCESS_public)
    4999              $C$DW$602       .dwtag  DW_TAG_member
    5000                      .dwattr $C$DW$602, DW_AT_type(*$C$DW$T$59)
    5001                      .dwattr $C$DW$602, DW_AT_name("Flag_StallEnable")
    5002                      .dwattr $C$DW$602, DW_AT_TI_symbol_name("_Flag_StallEnable")
    5003                      .dwattr $C$DW$602, DW_AT_data_member_location[DW_OP_plus_uconst 0x21]
    5004                      .dwattr $C$DW$602, DW_AT_accessibility(DW_ACCESS_public)
    5005              $C$DW$603       .dwtag  DW_TAG_member
    5006                      .dwattr $C$DW$603, DW_AT_type(*$C$DW$T$59)
    5007                      .dwattr $C$DW$603, DW_AT_name("Flag_ReportState")
    5008                      .dwattr $C$DW$603, DW_AT_TI_symbol_name("_Flag_ReportState")
    5009                      .dwattr $C$DW$603, DW_AT_data_member_location[DW_OP_plus_uconst 0x22]
    5010                      .dwattr $C$DW$603, DW_AT_accessibility(DW_ACCESS_public)
    5011              $C$DW$604       .dwtag  DW_TAG_member
    5012                      .dwattr $C$DW$604, DW_AT_type(*$C$DW$T$59)
    5013                      .dwattr $C$DW$604, DW_AT_name("Flag_RunMode")
    5014                      .dwattr $C$DW$604, DW_AT_TI_symbol_name("_Flag_RunMode")
    5015                      .dwattr $C$DW$604, DW_AT_data_member_location[DW_OP_plus_uconst 0x23]
    5016                      .dwattr $C$DW$604, DW_AT_accessibility(DW_ACCESS_public)
    5017              $C$DW$605       .dwtag  DW_TAG_member
    5018                      .dwattr $C$DW$605, DW_AT_type(*$C$DW$T$59)
    5019                      .dwattr $C$DW$605, DW_AT_name("Flag_DcBrake")
    5020                      .dwattr $C$DW$605, DW_AT_TI_symbol_name("_Flag_DcBrake")
    5021                      .dwattr $C$DW$605, DW_AT_data_member_location[DW_OP_plus_uconst 0x24]
    5022                      .dwattr $C$DW$605, DW_AT_accessibility(DW_ACCESS_public)
    5023                      .dwendtag $C$DW$T$60
    5024              
    5025              $C$DW$T$167     .dwtag  DW_TAG_typedef, DW_AT_name("FSM_Obj")
    5026                      .dwattr $C$DW$T$167, DW_AT_type(*$C$DW$T$60)
    5027                      .dwattr $C$DW$T$167, DW_AT_language(DW_LANG_C)
    5028              $C$DW$T$168     .dwtag  DW_TAG_pointer_type
    5029                      .dwattr $C$DW$T$168, DW_AT_type(*$C$DW$T$60)
    5030                      .dwattr $C$DW$T$168, DW_AT_address_class(0x16)
    5031              $C$DW$T$169     .dwtag  DW_TAG_typedef, DW_AT_name("FSM_Handle")
    5032                      .dwattr $C$DW$T$169, DW_AT_type(*$C$DW$T$168)
    5033                      .dwattr $C$DW$T$169, DW_AT_language(DW_LANG_C)
    5034              $C$DW$606       .dwtag  DW_TAG_TI_far_type
    5035                      .dwattr $C$DW$606, DW_AT_type(*$C$DW$T$169)
    5036              $C$DW$T$170     .dwtag  DW_TAG_const_type
    5037                      .dwattr $C$DW$T$170, DW_AT_type(*$C$DW$606)
    5038              
    5039              $C$DW$T$62      .dwtag  DW_TAG_structure_type
    5040                      .dwattr $C$DW$T$62, DW_AT_name("_FSM_Position_t_")
    5041                      .dwattr $C$DW$T$62, DW_AT_byte_size(0x04)
    5042              $C$DW$607       .dwtag  DW_TAG_member
    5043                      .dwattr $C$DW$607, DW_AT_type(*$C$DW$T$61)
    5044                      .dwattr $C$DW$607, DW_AT_name("PosInt_MRev")
    5045                      .dwattr $C$DW$607, DW_AT_TI_symbol_name("_PosInt_MRev")
    5046                      .dwattr $C$DW$607, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
TMS320C2000 Assembler PC v6.2.5 Thu Nov 23 20:50:59 2017

Tools Copyright (c) 1996-2014 Texas Instruments Incorporated
C:\Users\wmj\AppData\Local\Temp\0203211                              PAGE   97

    5047                      .dwattr $C$DW$607, DW_AT_accessibility(DW_ACCESS_public)
    5048              $C$DW$608       .dwtag  DW_TAG_member
    5049                      .dwattr $C$DW$608, DW_AT_type(*$C$DW$T$37)
    5050                      .dwattr $C$DW$608, DW_AT_name("PosFrac_MRev")
    5051                      .dwattr $C$DW$608, DW_AT_TI_symbol_name("_PosFrac_MRev")
    5052                      .dwattr $C$DW$608, DW_AT_data_member_location[DW_OP_plus_uconst 0x2]
    5053                      .dwattr $C$DW$608, DW_AT_accessibility(DW_ACCESS_public)
    5054                      .dwendtag $C$DW$T$62
    5055              
    5056              $C$DW$T$58      .dwtag  DW_TAG_typedef, DW_AT_name("FSM_Position_t")
    5057                      .dwattr $C$DW$T$58, DW_AT_type(*$C$DW$T$62)
    5058                      .dwattr $C$DW$T$58, DW_AT_language(DW_LANG_C)
    5059              
    5060              $C$DW$T$71      .dwtag  DW_TAG_structure_type
    5061                      .dwattr $C$DW$T$71, DW_AT_name("_FSM_StatePool_t_")
    5062                      .dwattr $C$DW$T$71, DW_AT_byte_size(0x4b)
    5063              $C$DW$609       .dwtag  DW_TAG_member
    5064                      .dwattr $C$DW$609, DW_AT_type(*$C$DW$T$64)
    5065                      .dwattr $C$DW$609, DW_AT_name("FSM_RefSpeed")
    5066                      .dwattr $C$DW$609, DW_AT_TI_symbol_name("_FSM_RefSpeed")
    5067                      .dwattr $C$DW$609, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    5068                      .dwattr $C$DW$609, DW_AT_accessibility(DW_ACCESS_public)
    5069              $C$DW$610       .dwtag  DW_TAG_member
    5070                      .dwattr $C$DW$610, DW_AT_type(*$C$DW$T$65)
    5071                      .dwattr $C$DW$610, DW_AT_name("FSM_CondValue")
    5072                      .dwattr $C$DW$610, DW_AT_TI_symbol_name("_FSM_CondValue")
    5073                      .dwattr $C$DW$610, DW_AT_data_member_location[DW_OP_plus_uconst 0xf]
    5074                      .dwattr $C$DW$610, DW_AT_accessibility(DW_ACCESS_public)
    5075              $C$DW$611       .dwtag  DW_TAG_member
    5076                      .dwattr $C$DW$611, DW_AT_type(*$C$DW$T$66)
    5077                      .dwattr $C$DW$611, DW_AT_name("FSM_Condition")
    5078                      .dwattr $C$DW$611, DW_AT_TI_symbol_name("_FSM_Condition")
    5079                      .dwattr $C$DW$611, DW_AT_data_member_location[DW_OP_plus_uconst 0x1e]
    5080                      .dwattr $C$DW$611, DW_AT_accessibility(DW_ACCESS_public)
    5081              $C$DW$612       .dwtag  DW_TAG_member
    5082                      .dwattr $C$DW$612, DW_AT_type(*$C$DW$T$69)
    5083                      .dwattr $C$DW$612, DW_AT_name("FSM_RunAction")
    5084                      .dwattr $C$DW$612, DW_AT_TI_symbol_name("_FSM_RunAction")
    5085                      .dwattr $C$DW$612, DW_AT_data_member_location[DW_OP_plus_uconst 0x2d]
    5086                      .dwattr $C$DW$612, DW_AT_accessibility(DW_ACCESS_public)
    5087              $C$DW$613       .dwtag  DW_TAG_member
    5088                      .dwattr $C$DW$613, DW_AT_type(*$C$DW$T$70)
    5089                      .dwattr $C$DW$613, DW_AT_name("FSM_NextState")
    5090                      .dwattr $C$DW$613, DW_AT_TI_symbol_name("_FSM_NextState")
    5091                      .dwattr $C$DW$613, DW_AT_data_member_location[DW_OP_plus_uconst 0x3c]
    5092                      .dwattr $C$DW$613, DW_AT_accessibility(DW_ACCESS_public)
    5093                      .dwendtag $C$DW$T$71
    5094              
    5095              $C$DW$T$176     .dwtag  DW_TAG_typedef, DW_AT_name("FSM_StatePool_t")
    5096                      .dwattr $C$DW$T$176, DW_AT_type(*$C$DW$T$71)
    5097                      .dwattr $C$DW$T$176, DW_AT_language(DW_LANG_C)
    5098              $C$DW$T$44      .dwtag  DW_TAG_pointer_type
    5099                      .dwattr $C$DW$T$44, DW_AT_type(*$C$DW$T$71)
    5100                      .dwattr $C$DW$T$44, DW_AT_address_class(0x16)
    5101              $C$DW$T$45      .dwtag  DW_TAG_typedef, DW_AT_name("StPool_Handle")
TMS320C2000 Assembler PC v6.2.5 Thu Nov 23 20:50:59 2017

Tools Copyright (c) 1996-2014 Texas Instruments Incorporated
C:\Users\wmj\AppData\Local\Temp\0203211                              PAGE   98

    5102                      .dwattr $C$DW$T$45, DW_AT_type(*$C$DW$T$44)
    5103                      .dwattr $C$DW$T$45, DW_AT_language(DW_LANG_C)
    5104              
    5105              $C$DW$T$72      .dwtag  DW_TAG_structure_type
    5106                      .dwattr $C$DW$T$72, DW_AT_name("_FSM_Vars_t_")
    5107                      .dwattr $C$DW$T$72, DW_AT_byte_size(0x06)
    5108              $C$DW$614       .dwtag  DW_TAG_member
    5109                      .dwattr $C$DW$614, DW_AT_type(*$C$DW$T$16)
    5110                      .dwattr $C$DW$614, DW_AT_name("FSM_RefSpeed")
    5111                      .dwattr $C$DW$614, DW_AT_TI_symbol_name("_FSM_RefSpeed")
    5112                      .dwattr $C$DW$614, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    5113                      .dwattr $C$DW$614, DW_AT_accessibility(DW_ACCESS_public)
    5114              $C$DW$615       .dwtag  DW_TAG_member
    5115                      .dwattr $C$DW$615, DW_AT_type(*$C$DW$T$21)
    5116                      .dwattr $C$DW$615, DW_AT_name("FSM_CondValue")
    5117                      .dwattr $C$DW$615, DW_AT_TI_symbol_name("_FSM_CondValue")
    5118                      .dwattr $C$DW$615, DW_AT_data_member_location[DW_OP_plus_uconst 0x2]
    5119                      .dwattr $C$DW$615, DW_AT_accessibility(DW_ACCESS_public)
    5120              $C$DW$616       .dwtag  DW_TAG_member
    5121                      .dwattr $C$DW$616, DW_AT_type(*$C$DW$T$57)
    5122                      .dwattr $C$DW$616, DW_AT_name("FSM_Condition")
    5123                      .dwattr $C$DW$616, DW_AT_TI_symbol_name("_FSM_Condition")
    5124                      .dwattr $C$DW$616, DW_AT_data_member_location[DW_OP_plus_uconst 0x3]
    5125                      .dwattr $C$DW$616, DW_AT_accessibility(DW_ACCESS_public)
    5126              $C$DW$617       .dwtag  DW_TAG_member
    5127                      .dwattr $C$DW$617, DW_AT_type(*$C$DW$T$68)
    5128                      .dwattr $C$DW$617, DW_AT_name("FSM_RunAction")
    5129                      .dwattr $C$DW$617, DW_AT_TI_symbol_name("_FSM_RunAction")
    5130                      .dwattr $C$DW$617, DW_AT_data_member_location[DW_OP_plus_uconst 0x4]
    5131                      .dwattr $C$DW$617, DW_AT_accessibility(DW_ACCESS_public)
    5132              $C$DW$618       .dwtag  DW_TAG_member
    5133                      .dwattr $C$DW$618, DW_AT_type(*$C$DW$T$47)
    5134                      .dwattr $C$DW$618, DW_AT_name("FSM_NextState")
    5135                      .dwattr $C$DW$618, DW_AT_TI_symbol_name("_FSM_NextState")
    5136                      .dwattr $C$DW$618, DW_AT_data_member_location[DW_OP_plus_uconst 0x5]
    5137                      .dwattr $C$DW$618, DW_AT_accessibility(DW_ACCESS_public)
    5138                      .dwendtag $C$DW$T$72
    5139              
    5140              $C$DW$T$177     .dwtag  DW_TAG_typedef, DW_AT_name("FSM_Vars_t")
    5141                      .dwattr $C$DW$T$177, DW_AT_type(*$C$DW$T$72)
    5142                      .dwattr $C$DW$T$177, DW_AT_language(DW_LANG_C)
    5143              $C$DW$619       .dwtag  DW_TAG_TI_far_type
    5144                      .dwattr $C$DW$619, DW_AT_type(*$C$DW$T$177)
    5145              $C$DW$T$178     .dwtag  DW_TAG_const_type
    5146                      .dwattr $C$DW$T$178, DW_AT_type(*$C$DW$619)
    5147              $C$DW$T$179     .dwtag  DW_TAG_pointer_type
    5148                      .dwattr $C$DW$T$179, DW_AT_type(*$C$DW$T$178)
    5149                      .dwattr $C$DW$T$179, DW_AT_address_class(0x16)
    5150              $C$DW$620       .dwtag  DW_TAG_TI_far_type
    5151                      .dwattr $C$DW$620, DW_AT_type(*$C$DW$T$179)
    5152              $C$DW$T$180     .dwtag  DW_TAG_const_type
    5153                      .dwattr $C$DW$T$180, DW_AT_type(*$C$DW$620)
    5154              
    5155              $C$DW$T$181     .dwtag  DW_TAG_array_type
    5156                      .dwattr $C$DW$T$181, DW_AT_type(*$C$DW$T$178)
TMS320C2000 Assembler PC v6.2.5 Thu Nov 23 20:50:59 2017

Tools Copyright (c) 1996-2014 Texas Instruments Incorporated
C:\Users\wmj\AppData\Local\Temp\0203211                              PAGE   99

    5157                      .dwattr $C$DW$T$181, DW_AT_language(DW_LANG_C)
    5158                      .dwattr $C$DW$T$181, DW_AT_byte_size(0x5a)
    5159              $C$DW$621       .dwtag  DW_TAG_subrange_type
    5160                      .dwattr $C$DW$621, DW_AT_upper_bound(0x0e)
    5161                      .dwendtag $C$DW$T$181
    5162              
    5163              
    5164              $C$DW$T$182     .dwtag  DW_TAG_array_type
    5165                      .dwattr $C$DW$T$182, DW_AT_type(*$C$DW$T$178)
    5166                      .dwattr $C$DW$T$182, DW_AT_language(DW_LANG_C)
    5167                      .dwattr $C$DW$T$182, DW_AT_byte_size(0x30)
    5168              $C$DW$622       .dwtag  DW_TAG_subrange_type
    5169                      .dwattr $C$DW$622, DW_AT_upper_bound(0x07)
    5170                      .dwendtag $C$DW$T$182
    5171              
    5172              
    5173              $C$DW$T$77      .dwtag  DW_TAG_structure_type
    5174                      .dwattr $C$DW$T$77, DW_AT_name("_GPIO_Obj_")
    5175                      .dwattr $C$DW$T$77, DW_AT_byte_size(0x6a)
    5176              $C$DW$623       .dwtag  DW_TAG_member
    5177                      .dwattr $C$DW$623, DW_AT_type(*$C$DW$T$74)
    5178                      .dwattr $C$DW$623, DW_AT_name("GPACTRL")
    5179                      .dwattr $C$DW$623, DW_AT_TI_symbol_name("_GPACTRL")
    5180                      .dwattr $C$DW$623, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    5181                      .dwattr $C$DW$623, DW_AT_accessibility(DW_ACCESS_public)
    5182              $C$DW$624       .dwtag  DW_TAG_member
    5183                      .dwattr $C$DW$624, DW_AT_type(*$C$DW$T$74)
    5184                      .dwattr $C$DW$624, DW_AT_name("GPAQSEL1")
    5185                      .dwattr $C$DW$624, DW_AT_TI_symbol_name("_GPAQSEL1")
    5186                      .dwattr $C$DW$624, DW_AT_data_member_location[DW_OP_plus_uconst 0x2]
    5187                      .dwattr $C$DW$624, DW_AT_accessibility(DW_ACCESS_public)
    5188              $C$DW$625       .dwtag  DW_TAG_member
    5189                      .dwattr $C$DW$625, DW_AT_type(*$C$DW$T$74)
    5190                      .dwattr $C$DW$625, DW_AT_name("GPAQSEL2")
    5191                      .dwattr $C$DW$625, DW_AT_TI_symbol_name("_GPAQSEL2")
    5192                      .dwattr $C$DW$625, DW_AT_data_member_location[DW_OP_plus_uconst 0x4]
    5193                      .dwattr $C$DW$625, DW_AT_accessibility(DW_ACCESS_public)
    5194              $C$DW$626       .dwtag  DW_TAG_member
    5195                      .dwattr $C$DW$626, DW_AT_type(*$C$DW$T$74)
    5196                      .dwattr $C$DW$626, DW_AT_name("GPAMUX1")
    5197                      .dwattr $C$DW$626, DW_AT_TI_symbol_name("_GPAMUX1")
    5198                      .dwattr $C$DW$626, DW_AT_data_member_location[DW_OP_plus_uconst 0x6]
    5199                      .dwattr $C$DW$626, DW_AT_accessibility(DW_ACCESS_public)
    5200              $C$DW$627       .dwtag  DW_TAG_member
    5201                      .dwattr $C$DW$627, DW_AT_type(*$C$DW$T$74)
    5202                      .dwattr $C$DW$627, DW_AT_name("GPAMUX2")
    5203                      .dwattr $C$DW$627, DW_AT_TI_symbol_name("_GPAMUX2")
    5204                      .dwattr $C$DW$627, DW_AT_data_member_location[DW_OP_plus_uconst 0x8]
    5205                      .dwattr $C$DW$627, DW_AT_accessibility(DW_ACCESS_public)
    5206              $C$DW$628       .dwtag  DW_TAG_member
    5207                      .dwattr $C$DW$628, DW_AT_type(*$C$DW$T$74)
    5208                      .dwattr $C$DW$628, DW_AT_name("GPADIR")
    5209                      .dwattr $C$DW$628, DW_AT_TI_symbol_name("_GPADIR")
    5210                      .dwattr $C$DW$628, DW_AT_data_member_location[DW_OP_plus_uconst 0xa]
    5211                      .dwattr $C$DW$628, DW_AT_accessibility(DW_ACCESS_public)
TMS320C2000 Assembler PC v6.2.5 Thu Nov 23 20:50:59 2017

Tools Copyright (c) 1996-2014 Texas Instruments Incorporated
C:\Users\wmj\AppData\Local\Temp\0203211                              PAGE  100

    5212              $C$DW$629       .dwtag  DW_TAG_member
    5213                      .dwattr $C$DW$629, DW_AT_type(*$C$DW$T$74)
    5214                      .dwattr $C$DW$629, DW_AT_name("GPAPUD")
    5215                      .dwattr $C$DW$629, DW_AT_TI_symbol_name("_GPAPUD")
    5216                      .dwattr $C$DW$629, DW_AT_data_member_location[DW_OP_plus_uconst 0xc]
    5217                      .dwattr $C$DW$629, DW_AT_accessibility(DW_ACCESS_public)
    5218              $C$DW$630       .dwtag  DW_TAG_member
    5219                      .dwattr $C$DW$630, DW_AT_type(*$C$DW$T$25)
    5220                      .dwattr $C$DW$630, DW_AT_name("rsvd_1")
    5221                      .dwattr $C$DW$630, DW_AT_TI_symbol_name("_rsvd_1")
    5222                      .dwattr $C$DW$630, DW_AT_data_member_location[DW_OP_plus_uconst 0xe]
    5223                      .dwattr $C$DW$630, DW_AT_accessibility(DW_ACCESS_public)
    5224              $C$DW$631       .dwtag  DW_TAG_member
    5225                      .dwattr $C$DW$631, DW_AT_type(*$C$DW$T$74)
    5226                      .dwattr $C$DW$631, DW_AT_name("GPBCTRL")
    5227                      .dwattr $C$DW$631, DW_AT_TI_symbol_name("_GPBCTRL")
    5228                      .dwattr $C$DW$631, DW_AT_data_member_location[DW_OP_plus_uconst 0x10]
    5229                      .dwattr $C$DW$631, DW_AT_accessibility(DW_ACCESS_public)
    5230              $C$DW$632       .dwtag  DW_TAG_member
    5231                      .dwattr $C$DW$632, DW_AT_type(*$C$DW$T$74)
    5232                      .dwattr $C$DW$632, DW_AT_name("GPBQSEL1")
    5233                      .dwattr $C$DW$632, DW_AT_TI_symbol_name("_GPBQSEL1")
    5234                      .dwattr $C$DW$632, DW_AT_data_member_location[DW_OP_plus_uconst 0x12]
    5235                      .dwattr $C$DW$632, DW_AT_accessibility(DW_ACCESS_public)
    5236              $C$DW$633       .dwtag  DW_TAG_member
    5237                      .dwattr $C$DW$633, DW_AT_type(*$C$DW$T$25)
    5238                      .dwattr $C$DW$633, DW_AT_name("rsvd_2")
    5239                      .dwattr $C$DW$633, DW_AT_TI_symbol_name("_rsvd_2")
    5240                      .dwattr $C$DW$633, DW_AT_data_member_location[DW_OP_plus_uconst 0x14]
    5241                      .dwattr $C$DW$633, DW_AT_accessibility(DW_ACCESS_public)
    5242              $C$DW$634       .dwtag  DW_TAG_member
    5243                      .dwattr $C$DW$634, DW_AT_type(*$C$DW$T$74)
    5244                      .dwattr $C$DW$634, DW_AT_name("GPBMUX1")
    5245                      .dwattr $C$DW$634, DW_AT_TI_symbol_name("_GPBMUX1")
    5246                      .dwattr $C$DW$634, DW_AT_data_member_location[DW_OP_plus_uconst 0x16]
    5247                      .dwattr $C$DW$634, DW_AT_accessibility(DW_ACCESS_public)
    5248              $C$DW$635       .dwtag  DW_TAG_member
    5249                      .dwattr $C$DW$635, DW_AT_type(*$C$DW$T$25)
    5250                      .dwattr $C$DW$635, DW_AT_name("rsvd_3")
    5251                      .dwattr $C$DW$635, DW_AT_TI_symbol_name("_rsvd_3")
    5252                      .dwattr $C$DW$635, DW_AT_data_member_location[DW_OP_plus_uconst 0x18]
    5253                      .dwattr $C$DW$635, DW_AT_accessibility(DW_ACCESS_public)
    5254              $C$DW$636       .dwtag  DW_TAG_member
    5255                      .dwattr $C$DW$636, DW_AT_type(*$C$DW$T$74)
    5256                      .dwattr $C$DW$636, DW_AT_name("GPBDIR")
    5257                      .dwattr $C$DW$636, DW_AT_TI_symbol_name("_GPBDIR")
    5258                      .dwattr $C$DW$636, DW_AT_data_member_location[DW_OP_plus_uconst 0x1a]
    5259                      .dwattr $C$DW$636, DW_AT_accessibility(DW_ACCESS_public)
    5260              $C$DW$637       .dwtag  DW_TAG_member
    5261                      .dwattr $C$DW$637, DW_AT_type(*$C$DW$T$74)
    5262                      .dwattr $C$DW$637, DW_AT_name("GPBPUD")
    5263                      .dwattr $C$DW$637, DW_AT_TI_symbol_name("_GPBPUD")
    5264                      .dwattr $C$DW$637, DW_AT_data_member_location[DW_OP_plus_uconst 0x1c]
    5265                      .dwattr $C$DW$637, DW_AT_accessibility(DW_ACCESS_public)
    5266              $C$DW$638       .dwtag  DW_TAG_member
TMS320C2000 Assembler PC v6.2.5 Thu Nov 23 20:50:59 2017

Tools Copyright (c) 1996-2014 Texas Instruments Incorporated
C:\Users\wmj\AppData\Local\Temp\0203211                              PAGE  101

    5267                      .dwattr $C$DW$638, DW_AT_type(*$C$DW$T$75)
    5268                      .dwattr $C$DW$638, DW_AT_name("rsvd_4")
    5269                      .dwattr $C$DW$638, DW_AT_TI_symbol_name("_rsvd_4")
    5270                      .dwattr $C$DW$638, DW_AT_data_member_location[DW_OP_plus_uconst 0x1e]
    5271                      .dwattr $C$DW$638, DW_AT_accessibility(DW_ACCESS_public)
    5272              $C$DW$639       .dwtag  DW_TAG_member
    5273                      .dwattr $C$DW$639, DW_AT_type(*$C$DW$T$74)
    5274                      .dwattr $C$DW$639, DW_AT_name("AIOMUX1")
    5275                      .dwattr $C$DW$639, DW_AT_TI_symbol_name("_AIOMUX1")
    5276                      .dwattr $C$DW$639, DW_AT_data_member_location[DW_OP_plus_uconst 0x36]
    5277                      .dwattr $C$DW$639, DW_AT_accessibility(DW_ACCESS_public)
    5278              $C$DW$640       .dwtag  DW_TAG_member
    5279                      .dwattr $C$DW$640, DW_AT_type(*$C$DW$T$25)
    5280                      .dwattr $C$DW$640, DW_AT_name("rsvd_5")
    5281                      .dwattr $C$DW$640, DW_AT_TI_symbol_name("_rsvd_5")
    5282                      .dwattr $C$DW$640, DW_AT_data_member_location[DW_OP_plus_uconst 0x38]
    5283                      .dwattr $C$DW$640, DW_AT_accessibility(DW_ACCESS_public)
    5284              $C$DW$641       .dwtag  DW_TAG_member
    5285                      .dwattr $C$DW$641, DW_AT_type(*$C$DW$T$74)
    5286                      .dwattr $C$DW$641, DW_AT_name("AIODIR")
    5287                      .dwattr $C$DW$641, DW_AT_TI_symbol_name("_AIODIR")
    5288                      .dwattr $C$DW$641, DW_AT_data_member_location[DW_OP_plus_uconst 0x3a]
    5289                      .dwattr $C$DW$641, DW_AT_accessibility(DW_ACCESS_public)
    5290              $C$DW$642       .dwtag  DW_TAG_member
    5291                      .dwattr $C$DW$642, DW_AT_type(*$C$DW$T$76)
    5292                      .dwattr $C$DW$642, DW_AT_name("rsvd_6")
    5293                      .dwattr $C$DW$642, DW_AT_TI_symbol_name("_rsvd_6")
    5294                      .dwattr $C$DW$642, DW_AT_data_member_location[DW_OP_plus_uconst 0x3c]
    5295                      .dwattr $C$DW$642, DW_AT_accessibility(DW_ACCESS_public)
    5296              $C$DW$643       .dwtag  DW_TAG_member
    5297                      .dwattr $C$DW$643, DW_AT_type(*$C$DW$T$74)
    5298                      .dwattr $C$DW$643, DW_AT_name("GPADAT")
    5299                      .dwattr $C$DW$643, DW_AT_TI_symbol_name("_GPADAT")
    5300                      .dwattr $C$DW$643, DW_AT_data_member_location[DW_OP_plus_uconst 0x40]
    5301                      .dwattr $C$DW$643, DW_AT_accessibility(DW_ACCESS_public)
    5302              $C$DW$644       .dwtag  DW_TAG_member
    5303                      .dwattr $C$DW$644, DW_AT_type(*$C$DW$T$74)
    5304                      .dwattr $C$DW$644, DW_AT_name("GPASET")
    5305                      .dwattr $C$DW$644, DW_AT_TI_symbol_name("_GPASET")
    5306                      .dwattr $C$DW$644, DW_AT_data_member_location[DW_OP_plus_uconst 0x42]
    5307                      .dwattr $C$DW$644, DW_AT_accessibility(DW_ACCESS_public)
    5308              $C$DW$645       .dwtag  DW_TAG_member
    5309                      .dwattr $C$DW$645, DW_AT_type(*$C$DW$T$74)
    5310                      .dwattr $C$DW$645, DW_AT_name("GPACLEAR")
    5311                      .dwattr $C$DW$645, DW_AT_TI_symbol_name("_GPACLEAR")
    5312                      .dwattr $C$DW$645, DW_AT_data_member_location[DW_OP_plus_uconst 0x44]
    5313                      .dwattr $C$DW$645, DW_AT_accessibility(DW_ACCESS_public)
    5314              $C$DW$646       .dwtag  DW_TAG_member
    5315                      .dwattr $C$DW$646, DW_AT_type(*$C$DW$T$74)
    5316                      .dwattr $C$DW$646, DW_AT_name("GPATOGGLE")
    5317                      .dwattr $C$DW$646, DW_AT_TI_symbol_name("_GPATOGGLE")
    5318                      .dwattr $C$DW$646, DW_AT_data_member_location[DW_OP_plus_uconst 0x46]
    5319                      .dwattr $C$DW$646, DW_AT_accessibility(DW_ACCESS_public)
    5320              $C$DW$647       .dwtag  DW_TAG_member
    5321                      .dwattr $C$DW$647, DW_AT_type(*$C$DW$T$74)
TMS320C2000 Assembler PC v6.2.5 Thu Nov 23 20:50:59 2017

Tools Copyright (c) 1996-2014 Texas Instruments Incorporated
C:\Users\wmj\AppData\Local\Temp\0203211                              PAGE  102

    5322                      .dwattr $C$DW$647, DW_AT_name("GPBDAT")
    5323                      .dwattr $C$DW$647, DW_AT_TI_symbol_name("_GPBDAT")
    5324                      .dwattr $C$DW$647, DW_AT_data_member_location[DW_OP_plus_uconst 0x48]
    5325                      .dwattr $C$DW$647, DW_AT_accessibility(DW_ACCESS_public)
    5326              $C$DW$648       .dwtag  DW_TAG_member
    5327                      .dwattr $C$DW$648, DW_AT_type(*$C$DW$T$74)
    5328                      .dwattr $C$DW$648, DW_AT_name("GPBSET")
    5329                      .dwattr $C$DW$648, DW_AT_TI_symbol_name("_GPBSET")
    5330                      .dwattr $C$DW$648, DW_AT_data_member_location[DW_OP_plus_uconst 0x4a]
    5331                      .dwattr $C$DW$648, DW_AT_accessibility(DW_ACCESS_public)
    5332              $C$DW$649       .dwtag  DW_TAG_member
    5333                      .dwattr $C$DW$649, DW_AT_type(*$C$DW$T$74)
    5334                      .dwattr $C$DW$649, DW_AT_name("GPBCLEAR")
    5335                      .dwattr $C$DW$649, DW_AT_TI_symbol_name("_GPBCLEAR")
    5336                      .dwattr $C$DW$649, DW_AT_data_member_location[DW_OP_plus_uconst 0x4c]
    5337                      .dwattr $C$DW$649, DW_AT_accessibility(DW_ACCESS_public)
    5338              $C$DW$650       .dwtag  DW_TAG_member
    5339                      .dwattr $C$DW$650, DW_AT_type(*$C$DW$T$74)
    5340                      .dwattr $C$DW$650, DW_AT_name("GPBTOGGLE")
    5341                      .dwattr $C$DW$650, DW_AT_TI_symbol_name("_GPBTOGGLE")
    5342                      .dwattr $C$DW$650, DW_AT_data_member_location[DW_OP_plus_uconst 0x4e]
    5343                      .dwattr $C$DW$650, DW_AT_accessibility(DW_ACCESS_public)
    5344              $C$DW$651       .dwtag  DW_TAG_member
    5345                      .dwattr $C$DW$651, DW_AT_type(*$C$DW$T$30)
    5346                      .dwattr $C$DW$651, DW_AT_name("rsvd_7")
    5347                      .dwattr $C$DW$651, DW_AT_TI_symbol_name("_rsvd_7")
    5348                      .dwattr $C$DW$651, DW_AT_data_member_location[DW_OP_plus_uconst 0x50]
    5349                      .dwattr $C$DW$651, DW_AT_accessibility(DW_ACCESS_public)
    5350              $C$DW$652       .dwtag  DW_TAG_member
    5351                      .dwattr $C$DW$652, DW_AT_type(*$C$DW$T$74)
    5352                      .dwattr $C$DW$652, DW_AT_name("AIODAT")
    5353                      .dwattr $C$DW$652, DW_AT_TI_symbol_name("_AIODAT")
    5354                      .dwattr $C$DW$652, DW_AT_data_member_location[DW_OP_plus_uconst 0x58]
    5355                      .dwattr $C$DW$652, DW_AT_accessibility(DW_ACCESS_public)
    5356              $C$DW$653       .dwtag  DW_TAG_member
    5357                      .dwattr $C$DW$653, DW_AT_type(*$C$DW$T$74)
    5358                      .dwattr $C$DW$653, DW_AT_name("AIOSET")
    5359                      .dwattr $C$DW$653, DW_AT_TI_symbol_name("_AIOSET")
    5360                      .dwattr $C$DW$653, DW_AT_data_member_location[DW_OP_plus_uconst 0x5a]
    5361                      .dwattr $C$DW$653, DW_AT_accessibility(DW_ACCESS_public)
    5362              $C$DW$654       .dwtag  DW_TAG_member
    5363                      .dwattr $C$DW$654, DW_AT_type(*$C$DW$T$74)
    5364                      .dwattr $C$DW$654, DW_AT_name("AIOCLEAR")
    5365                      .dwattr $C$DW$654, DW_AT_TI_symbol_name("_AIOCLEAR")
    5366                      .dwattr $C$DW$654, DW_AT_data_member_location[DW_OP_plus_uconst 0x5c]
    5367                      .dwattr $C$DW$654, DW_AT_accessibility(DW_ACCESS_public)
    5368              $C$DW$655       .dwtag  DW_TAG_member
    5369                      .dwattr $C$DW$655, DW_AT_type(*$C$DW$T$74)
    5370                      .dwattr $C$DW$655, DW_AT_name("AIOTOGGLE")
    5371                      .dwattr $C$DW$655, DW_AT_TI_symbol_name("_AIOTOGGLE")
    5372                      .dwattr $C$DW$655, DW_AT_data_member_location[DW_OP_plus_uconst 0x5e]
    5373                      .dwattr $C$DW$655, DW_AT_accessibility(DW_ACCESS_public)
    5374              $C$DW$656       .dwtag  DW_TAG_member
    5375                      .dwattr $C$DW$656, DW_AT_type(*$C$DW$T$27)
    5376                      .dwattr $C$DW$656, DW_AT_name("GPIOXINTnSEL")
TMS320C2000 Assembler PC v6.2.5 Thu Nov 23 20:50:59 2017

Tools Copyright (c) 1996-2014 Texas Instruments Incorporated
C:\Users\wmj\AppData\Local\Temp\0203211                              PAGE  103

    5377                      .dwattr $C$DW$656, DW_AT_TI_symbol_name("_GPIOXINTnSEL")
    5378                      .dwattr $C$DW$656, DW_AT_data_member_location[DW_OP_plus_uconst 0x60]
    5379                      .dwattr $C$DW$656, DW_AT_accessibility(DW_ACCESS_public)
    5380              $C$DW$657       .dwtag  DW_TAG_member
    5381                      .dwattr $C$DW$657, DW_AT_type(*$C$DW$T$26)
    5382                      .dwattr $C$DW$657, DW_AT_name("rsvd_8")
    5383                      .dwattr $C$DW$657, DW_AT_TI_symbol_name("_rsvd_8")
    5384                      .dwattr $C$DW$657, DW_AT_data_member_location[DW_OP_plus_uconst 0x63]
    5385                      .dwattr $C$DW$657, DW_AT_accessibility(DW_ACCESS_public)
    5386              $C$DW$658       .dwtag  DW_TAG_member
    5387                      .dwattr $C$DW$658, DW_AT_type(*$C$DW$T$74)
    5388                      .dwattr $C$DW$658, DW_AT_name("GPIOLPMSEL")
    5389                      .dwattr $C$DW$658, DW_AT_TI_symbol_name("_GPIOLPMSEL")
    5390                      .dwattr $C$DW$658, DW_AT_data_member_location[DW_OP_plus_uconst 0x68]
    5391                      .dwattr $C$DW$658, DW_AT_accessibility(DW_ACCESS_public)
    5392                      .dwendtag $C$DW$T$77
    5393              
    5394              $C$DW$T$88      .dwtag  DW_TAG_pointer_type
    5395                      .dwattr $C$DW$T$88, DW_AT_type(*$C$DW$T$77)
    5396                      .dwattr $C$DW$T$88, DW_AT_address_class(0x16)
    5397              $C$DW$T$89      .dwtag  DW_TAG_typedef, DW_AT_name("GPIO_Handle")
    5398                      .dwattr $C$DW$T$89, DW_AT_type(*$C$DW$T$88)
    5399                      .dwattr $C$DW$T$89, DW_AT_language(DW_LANG_C)
    5400              
    5401              $C$DW$T$79      .dwtag  DW_TAG_structure_type
    5402                      .dwattr $C$DW$T$79, DW_AT_name("_HAL_AdcData_t_")
    5403                      .dwattr $C$DW$T$79, DW_AT_byte_size(0x16)
    5404              $C$DW$659       .dwtag  DW_TAG_member
    5405                      .dwattr $C$DW$659, DW_AT_type(*$C$DW$T$78)
    5406                      .dwattr $C$DW$659, DW_AT_name("I")
    5407                      .dwattr $C$DW$659, DW_AT_TI_symbol_name("_I")
    5408                      .dwattr $C$DW$659, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    5409                      .dwattr $C$DW$659, DW_AT_accessibility(DW_ACCESS_public)
    5410              $C$DW$660       .dwtag  DW_TAG_member
    5411                      .dwattr $C$DW$660, DW_AT_type(*$C$DW$T$78)
    5412                      .dwattr $C$DW$660, DW_AT_name("V")
    5413                      .dwattr $C$DW$660, DW_AT_TI_symbol_name("_V")
    5414                      .dwattr $C$DW$660, DW_AT_data_member_location[DW_OP_plus_uconst 0x6]
    5415                      .dwattr $C$DW$660, DW_AT_accessibility(DW_ACCESS_public)
    5416              $C$DW$661       .dwtag  DW_TAG_member
    5417                      .dwattr $C$DW$661, DW_AT_type(*$C$DW$T$37)
    5418                      .dwattr $C$DW$661, DW_AT_name("dcBus")
    5419                      .dwattr $C$DW$661, DW_AT_TI_symbol_name("_dcBus")
    5420                      .dwattr $C$DW$661, DW_AT_data_member_location[DW_OP_plus_uconst 0xc]
    5421                      .dwattr $C$DW$661, DW_AT_accessibility(DW_ACCESS_public)
    5422              $C$DW$662       .dwtag  DW_TAG_member
    5423                      .dwattr $C$DW$662, DW_AT_type(*$C$DW$T$37)
    5424                      .dwattr $C$DW$662, DW_AT_name("analogSensor1")
    5425                      .dwattr $C$DW$662, DW_AT_TI_symbol_name("_analogSensor1")
    5426                      .dwattr $C$DW$662, DW_AT_data_member_location[DW_OP_plus_uconst 0xe]
    5427                      .dwattr $C$DW$662, DW_AT_accessibility(DW_ACCESS_public)
    5428              $C$DW$663       .dwtag  DW_TAG_member
    5429                      .dwattr $C$DW$663, DW_AT_type(*$C$DW$T$37)
    5430                      .dwattr $C$DW$663, DW_AT_name("analogSensor2")
    5431                      .dwattr $C$DW$663, DW_AT_TI_symbol_name("_analogSensor2")
TMS320C2000 Assembler PC v6.2.5 Thu Nov 23 20:50:59 2017

Tools Copyright (c) 1996-2014 Texas Instruments Incorporated
C:\Users\wmj\AppData\Local\Temp\0203211                              PAGE  104

    5432                      .dwattr $C$DW$663, DW_AT_data_member_location[DW_OP_plus_uconst 0x10]
    5433                      .dwattr $C$DW$663, DW_AT_accessibility(DW_ACCESS_public)
    5434              $C$DW$664       .dwtag  DW_TAG_member
    5435                      .dwattr $C$DW$664, DW_AT_type(*$C$DW$T$37)
    5436                      .dwattr $C$DW$664, DW_AT_name("igbtNTC")
    5437                      .dwattr $C$DW$664, DW_AT_TI_symbol_name("_igbtNTC")
    5438                      .dwattr $C$DW$664, DW_AT_data_member_location[DW_OP_plus_uconst 0x12]
    5439                      .dwattr $C$DW$664, DW_AT_accessibility(DW_ACCESS_public)
    5440              $C$DW$665       .dwtag  DW_TAG_member
    5441                      .dwattr $C$DW$665, DW_AT_type(*$C$DW$T$37)
    5442                      .dwattr $C$DW$665, DW_AT_name("boardAddr")
    5443                      .dwattr $C$DW$665, DW_AT_TI_symbol_name("_boardAddr")
    5444                      .dwattr $C$DW$665, DW_AT_data_member_location[DW_OP_plus_uconst 0x14]
    5445                      .dwattr $C$DW$665, DW_AT_accessibility(DW_ACCESS_public)
    5446                      .dwendtag $C$DW$T$79
    5447              
    5448              $C$DW$T$115     .dwtag  DW_TAG_typedef, DW_AT_name("HAL_AdcData_t")
    5449                      .dwattr $C$DW$T$115, DW_AT_type(*$C$DW$T$79)
    5450                      .dwattr $C$DW$T$115, DW_AT_language(DW_LANG_C)
    5451              
    5452              $C$DW$T$118     .dwtag  DW_TAG_structure_type
    5453                      .dwattr $C$DW$T$118, DW_AT_name("_HAL_Obj_")
    5454                      .dwattr $C$DW$T$118, DW_AT_byte_size(0xb4)
    5455              $C$DW$666       .dwtag  DW_TAG_member
    5456                      .dwattr $C$DW$666, DW_AT_type(*$C$DW$T$81)
    5457                      .dwattr $C$DW$666, DW_AT_name("adcHandle")
    5458                      .dwattr $C$DW$666, DW_AT_TI_symbol_name("_adcHandle")
    5459                      .dwattr $C$DW$666, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    5460                      .dwattr $C$DW$666, DW_AT_accessibility(DW_ACCESS_public)
    5461              $C$DW$667       .dwtag  DW_TAG_member
    5462                      .dwattr $C$DW$667, DW_AT_type(*$C$DW$T$83)
    5463                      .dwattr $C$DW$667, DW_AT_name("clkHandle")
    5464                      .dwattr $C$DW$667, DW_AT_TI_symbol_name("_clkHandle")
    5465                      .dwattr $C$DW$667, DW_AT_data_member_location[DW_OP_plus_uconst 0x2]
    5466                      .dwattr $C$DW$667, DW_AT_accessibility(DW_ACCESS_public)
    5467              $C$DW$668       .dwtag  DW_TAG_member
    5468                      .dwattr $C$DW$668, DW_AT_type(*$C$DW$T$85)
    5469                      .dwattr $C$DW$668, DW_AT_name("cpuHandle")
    5470                      .dwattr $C$DW$668, DW_AT_TI_symbol_name("_cpuHandle")
    5471                      .dwattr $C$DW$668, DW_AT_data_member_location[DW_OP_plus_uconst 0x4]
    5472                      .dwattr $C$DW$668, DW_AT_accessibility(DW_ACCESS_public)
    5473              $C$DW$669       .dwtag  DW_TAG_member
    5474                      .dwattr $C$DW$669, DW_AT_type(*$C$DW$T$87)
    5475                      .dwattr $C$DW$669, DW_AT_name("flashHandle")
    5476                      .dwattr $C$DW$669, DW_AT_TI_symbol_name("_flashHandle")
    5477                      .dwattr $C$DW$669, DW_AT_data_member_location[DW_OP_plus_uconst 0x6]
    5478                      .dwattr $C$DW$669, DW_AT_accessibility(DW_ACCESS_public)
    5479              $C$DW$670       .dwtag  DW_TAG_member
    5480                      .dwattr $C$DW$670, DW_AT_type(*$C$DW$T$89)
    5481                      .dwattr $C$DW$670, DW_AT_name("gpioHandle")
    5482                      .dwattr $C$DW$670, DW_AT_TI_symbol_name("_gpioHandle")
    5483                      .dwattr $C$DW$670, DW_AT_data_member_location[DW_OP_plus_uconst 0x8]
    5484                      .dwattr $C$DW$670, DW_AT_accessibility(DW_ACCESS_public)
    5485              $C$DW$671       .dwtag  DW_TAG_member
    5486                      .dwattr $C$DW$671, DW_AT_type(*$C$DW$T$92)
TMS320C2000 Assembler PC v6.2.5 Thu Nov 23 20:50:59 2017

Tools Copyright (c) 1996-2014 Texas Instruments Incorporated
C:\Users\wmj\AppData\Local\Temp\0203211                              PAGE  105

    5487                      .dwattr $C$DW$671, DW_AT_name("offsetHandle_I")
    5488                      .dwattr $C$DW$671, DW_AT_TI_symbol_name("_offsetHandle_I")
    5489                      .dwattr $C$DW$671, DW_AT_data_member_location[DW_OP_plus_uconst 0xa]
    5490                      .dwattr $C$DW$671, DW_AT_accessibility(DW_ACCESS_public)
    5491              $C$DW$672       .dwtag  DW_TAG_member
    5492                      .dwattr $C$DW$672, DW_AT_type(*$C$DW$T$94)
    5493                      .dwattr $C$DW$672, DW_AT_name("offset_I")
    5494                      .dwattr $C$DW$672, DW_AT_TI_symbol_name("_offset_I")
    5495                      .dwattr $C$DW$672, DW_AT_data_member_location[DW_OP_plus_uconst 0x10]
    5496                      .dwattr $C$DW$672, DW_AT_accessibility(DW_ACCESS_public)
    5497              $C$DW$673       .dwtag  DW_TAG_member
    5498                      .dwattr $C$DW$673, DW_AT_type(*$C$DW$T$92)
    5499                      .dwattr $C$DW$673, DW_AT_name("offsetHandle_V")
    5500                      .dwattr $C$DW$673, DW_AT_TI_symbol_name("_offsetHandle_V")
    5501                      .dwattr $C$DW$673, DW_AT_data_member_location[DW_OP_plus_uconst 0x40]
    5502                      .dwattr $C$DW$673, DW_AT_accessibility(DW_ACCESS_public)
    5503              $C$DW$674       .dwtag  DW_TAG_member
    5504                      .dwattr $C$DW$674, DW_AT_type(*$C$DW$T$94)
    5505                      .dwattr $C$DW$674, DW_AT_name("offset_V")
    5506                      .dwattr $C$DW$674, DW_AT_TI_symbol_name("_offset_V")
    5507                      .dwattr $C$DW$674, DW_AT_data_member_location[DW_OP_plus_uconst 0x46]
    5508                      .dwattr $C$DW$674, DW_AT_accessibility(DW_ACCESS_public)
    5509              $C$DW$675       .dwtag  DW_TAG_member
    5510                      .dwattr $C$DW$675, DW_AT_type(*$C$DW$T$96)
    5511                      .dwattr $C$DW$675, DW_AT_name("oscHandle")
    5512                      .dwattr $C$DW$675, DW_AT_TI_symbol_name("_oscHandle")
    5513                      .dwattr $C$DW$675, DW_AT_data_member_location[DW_OP_plus_uconst 0x76]
    5514                      .dwattr $C$DW$675, DW_AT_accessibility(DW_ACCESS_public)
    5515              $C$DW$676       .dwtag  DW_TAG_member
    5516                      .dwattr $C$DW$676, DW_AT_type(*$C$DW$T$98)
    5517                      .dwattr $C$DW$676, DW_AT_name("pieHandle")
    5518                      .dwattr $C$DW$676, DW_AT_TI_symbol_name("_pieHandle")
    5519                      .dwattr $C$DW$676, DW_AT_data_member_location[DW_OP_plus_uconst 0x78]
    5520                      .dwattr $C$DW$676, DW_AT_accessibility(DW_ACCESS_public)
    5521              $C$DW$677       .dwtag  DW_TAG_member
    5522                      .dwattr $C$DW$677, DW_AT_type(*$C$DW$T$100)
    5523                      .dwattr $C$DW$677, DW_AT_name("pllHandle")
    5524                      .dwattr $C$DW$677, DW_AT_TI_symbol_name("_pllHandle")
    5525                      .dwattr $C$DW$677, DW_AT_data_member_location[DW_OP_plus_uconst 0x7a]
    5526                      .dwattr $C$DW$677, DW_AT_accessibility(DW_ACCESS_public)
    5527              $C$DW$678       .dwtag  DW_TAG_member
    5528                      .dwattr $C$DW$678, DW_AT_type(*$C$DW$T$103)
    5529                      .dwattr $C$DW$678, DW_AT_name("pwmHandle")
    5530                      .dwattr $C$DW$678, DW_AT_TI_symbol_name("_pwmHandle")
    5531                      .dwattr $C$DW$678, DW_AT_data_member_location[DW_OP_plus_uconst 0x7c]
    5532                      .dwattr $C$DW$678, DW_AT_accessibility(DW_ACCESS_public)
    5533              $C$DW$679       .dwtag  DW_TAG_member
    5534                      .dwattr $C$DW$679, DW_AT_type(*$C$DW$T$103)
    5535                      .dwattr $C$DW$679, DW_AT_name("pwmDacHandle")
    5536                      .dwattr $C$DW$679, DW_AT_TI_symbol_name("_pwmDacHandle")
    5537                      .dwattr $C$DW$679, DW_AT_data_member_location[DW_OP_plus_uconst 0x82]
    5538                      .dwattr $C$DW$679, DW_AT_accessibility(DW_ACCESS_public)
    5539              $C$DW$680       .dwtag  DW_TAG_member
    5540                      .dwattr $C$DW$680, DW_AT_type(*$C$DW$T$105)
    5541                      .dwattr $C$DW$680, DW_AT_name("pwrHandle")
TMS320C2000 Assembler PC v6.2.5 Thu Nov 23 20:50:59 2017

Tools Copyright (c) 1996-2014 Texas Instruments Incorporated
C:\Users\wmj\AppData\Local\Temp\0203211                              PAGE  106

    5542                      .dwattr $C$DW$680, DW_AT_TI_symbol_name("_pwrHandle")
    5543                      .dwattr $C$DW$680, DW_AT_data_member_location[DW_OP_plus_uconst 0x88]
    5544                      .dwattr $C$DW$680, DW_AT_accessibility(DW_ACCESS_public)
    5545              $C$DW$681       .dwtag  DW_TAG_member
    5546                      .dwattr $C$DW$681, DW_AT_type(*$C$DW$T$108)
    5547                      .dwattr $C$DW$681, DW_AT_name("timerHandle")
    5548                      .dwattr $C$DW$681, DW_AT_TI_symbol_name("_timerHandle")
    5549                      .dwattr $C$DW$681, DW_AT_data_member_location[DW_OP_plus_uconst 0x8a]
    5550                      .dwattr $C$DW$681, DW_AT_accessibility(DW_ACCESS_public)
    5551              $C$DW$682       .dwtag  DW_TAG_member
    5552                      .dwattr $C$DW$682, DW_AT_type(*$C$DW$T$110)
    5553                      .dwattr $C$DW$682, DW_AT_name("spiAHandle")
    5554                      .dwattr $C$DW$682, DW_AT_TI_symbol_name("_spiAHandle")
    5555                      .dwattr $C$DW$682, DW_AT_data_member_location[DW_OP_plus_uconst 0x90]
    5556                      .dwattr $C$DW$682, DW_AT_accessibility(DW_ACCESS_public)
    5557              $C$DW$683       .dwtag  DW_TAG_member
    5558                      .dwattr $C$DW$683, DW_AT_type(*$C$DW$T$112)
    5559                      .dwattr $C$DW$683, DW_AT_name("wdogHandle")
    5560                      .dwattr $C$DW$683, DW_AT_TI_symbol_name("_wdogHandle")
    5561                      .dwattr $C$DW$683, DW_AT_data_member_location[DW_OP_plus_uconst 0x92]
    5562                      .dwattr $C$DW$683, DW_AT_accessibility(DW_ACCESS_public)
    5563              $C$DW$684       .dwtag  DW_TAG_member
    5564                      .dwattr $C$DW$684, DW_AT_type(*$C$DW$T$114)
    5565                      .dwattr $C$DW$684, DW_AT_name("sciHandle")
    5566                      .dwattr $C$DW$684, DW_AT_TI_symbol_name("_sciHandle")
    5567                      .dwattr $C$DW$684, DW_AT_data_member_location[DW_OP_plus_uconst 0x94]
    5568                      .dwattr $C$DW$684, DW_AT_accessibility(DW_ACCESS_public)
    5569              $C$DW$685       .dwtag  DW_TAG_member
    5570                      .dwattr $C$DW$685, DW_AT_type(*$C$DW$T$115)
    5571                      .dwattr $C$DW$685, DW_AT_name("adcBias")
    5572                      .dwattr $C$DW$685, DW_AT_TI_symbol_name("_adcBias")
    5573                      .dwattr $C$DW$685, DW_AT_data_member_location[DW_OP_plus_uconst 0x96]
    5574                      .dwattr $C$DW$685, DW_AT_accessibility(DW_ACCESS_public)
    5575              $C$DW$686       .dwtag  DW_TAG_member
    5576                      .dwattr $C$DW$686, DW_AT_type(*$C$DW$T$37)
    5577                      .dwattr $C$DW$686, DW_AT_name("current_sf")
    5578                      .dwattr $C$DW$686, DW_AT_TI_symbol_name("_current_sf")
