TMS320C2000 Assembler PC v15.12.3 Wed Nov 22 00:56:18 2017

Tools Copyright (c) 1996-2015 Texas Instruments Incorporated
C:\Users\wmj\AppData\Local\Temp\0313610                              PAGE    1

       1              ;***************************************************************
       2              ;* TMS320C2000 C/C++ Codegen                   PC v15.12.3.LTS *
       3              ;* Date/Time created: Wed Nov 22 00:56:18 2017                 *
       4              ;***************************************************************
       5                      .compiler_opts --abi=coffabi --float_support=softlib --hll_source=on --mem_model:code=flat --mem_mode
       6        0002  FP      .set    XAR2
       7              
       8              $C$DW$CU        .dwtag  DW_TAG_compile_unit
       9                      .dwattr $C$DW$CU, DW_AT_name("C:/Users/wmj/Desktop/BM1000_v1.1/sw/drivers/drvic/fsm.c")
      10                      .dwattr $C$DW$CU, DW_AT_producer("TI TMS320C2000 C/C++ Codegen PC v15.12.3.LTS Copyright (c) 1996-201
      11                      .dwattr $C$DW$CU, DW_AT_TI_version(0x01)
      12                      .dwattr $C$DW$CU, DW_AT_comp_dir("C:\Users\wmj\Desktop\BM1000_v1.1\sw\solutions\instaspin_foc\boards\
      13              
      14              $C$DW$1 .dwtag  DW_TAG_subprogram
      15                      .dwattr $C$DW$1, DW_AT_name("usDelay")
      16                      .dwattr $C$DW$1, DW_AT_TI_symbol_name("_usDelay")

    5664              
    5665              $C$DW$504       .dwtag  DW_TAG_enumerator
    5666                      .dwattr $C$DW$504, DW_AT_name("GPIO_Rsvd_21")
    5667                      .dwattr $C$DW$504, DW_AT_const_value(0x15)
    5668              
    5669              $C$DW$505       .dwtag  DW_TAG_enumerator
    5670                      .dwattr $C$DW$505, DW_AT_name("GPIO_Rsvd_22")
    5671                      .dwattr $C$DW$505, DW_AT_const_value(0x16)
    5672              
    5673              $C$DW$506       .dwtag  DW_TAG_enumerator
    5674                      .dwattr $C$DW$506, DW_AT_name("GPIO_Rsvd_23")
    5675                      .dwattr $C$DW$506, DW_AT_const_value(0x17)
    5676              
    5677              $C$DW$507       .dwtag  DW_TAG_enumerator
    5678                      .dwattr $C$DW$507, DW_AT_name("GPIO_Rsvd_24")
    5679                      .dwattr $C$DW$507, DW_AT_const_value(0x18)
    5680              
    5681              $C$DW$508       .dwtag  DW_TAG_enumerator
    5682                      .dwattr $C$DW$508, DW_AT_name("GPIO_Rsvd_25")
    5683                      .dwattr $C$DW$508, DW_AT_const_value(0x19)
    5684              
    5685              $C$DW$509       .dwtag  DW_TAG_enumerator
    5686                      .dwattr $C$DW$509, DW_AT_name("GPIO_Rsvd_26")
    5687                      .dwattr $C$DW$509, DW_AT_const_value(0x1a)
    5688              
    5689              $C$DW$510       .dwtag  DW_TAG_enumerator
    5690                      .dwattr $C$DW$510, DW_AT_name("GPIO_Rsvd_27")
    5691                      .dwattr $C$DW$510, DW_AT_const_value(0x1b)
    5692              
    5693              $C$DW$511       .dwtag  DW_TAG_enumerator
    5694                      .dwattr $C$DW$511, DW_AT_name("GPIO_Number_28")
    5695                      .dwattr $C$DW$511, DW_AT_const_value(0x1c)
    5696              
    5697              $C$DW$512       .dwtag  DW_TAG_enumerator
    5698                      .dwattr $C$DW$512, DW_AT_name("GPIO_Number_29")
    5699                      .dwattr $C$DW$512, DW_AT_const_value(0x1d)
    5700              
    5701              $C$DW$513       .dwtag  DW_TAG_enumerator
    5702                      .dwattr $C$DW$513, DW_AT_name("GPIO_Rsvd_30")
    5703                      .dwattr $C$DW$513, DW_AT_const_value(0x1e)
    5704              
    5705              $C$DW$514       .dwtag  DW_TAG_enumerator
    5706                      .dwattr $C$DW$514, DW_AT_name("GPIO_Rsvd_31")
    5707                      .dwattr $C$DW$514, DW_AT_const_value(0x1f)
    5708              
    5709              $C$DW$515       .dwtag  DW_TAG_enumerator
    5710                      .dwattr $C$DW$515, DW_AT_name("GPIO_Number_32")
    5711                      .dwattr $C$DW$515, DW_AT_const_value(0x20)
    5712              
    5713              $C$DW$516       .dwtag  DW_TAG_enumerator
    5714                      .dwattr $C$DW$516, DW_AT_name("GPIO_Number_33")
    5715                      .dwattr $C$DW$516, DW_AT_const_value(0x21)
    5716              
TMS320C2000 Assembler PC v15.12.3 Wed Nov 22 00:56:18 2017

Tools Copyright (c) 1996-2015 Texas Instruments Incorporated
C:\Users\wmj\AppData\Local\Temp\0313610                              PAGE  109

    5717              $C$DW$517       .dwtag  DW_TAG_enumerator
    5718                      .dwattr $C$DW$517, DW_AT_name("GPIO_Number_34")
    5719                      .dwattr $C$DW$517, DW_AT_const_value(0x22)
    5720              
    5721              $C$DW$518       .dwtag  DW_TAG_enumerator
    5722                      .dwattr $C$DW$518, DW_AT_name("GPIO_Number_35")
    5723                      .dwattr $C$DW$518, DW_AT_const_value(0x23)
    5724              
    5725              $C$DW$519       .dwtag  DW_TAG_enumerator
    5726                      .dwattr $C$DW$519, DW_AT_name("GPIO_Number_36")
    5727                      .dwattr $C$DW$519, DW_AT_const_value(0x24)
    5728              
    5729              $C$DW$520       .dwtag  DW_TAG_enumerator
    5730                      .dwattr $C$DW$520, DW_AT_name("GPIO_Number_37")
    5731                      .dwattr $C$DW$520, DW_AT_const_value(0x25)
    5732              
    5733              $C$DW$521       .dwtag  DW_TAG_enumerator
    5734                      .dwattr $C$DW$521, DW_AT_name("GPIO_Number_38")
    5735                      .dwattr $C$DW$521, DW_AT_const_value(0x26)
    5736              
    5737              $C$DW$522       .dwtag  DW_TAG_enumerator
    5738                      .dwattr $C$DW$522, DW_AT_name("GPIO_numGpios")
    5739                      .dwattr $C$DW$522, DW_AT_const_value(0x27)
    5740              
    5741                      .dwendtag $C$DW$T$161
    5742              
    5743              $C$DW$T$162     .dwtag  DW_TAG_typedef
    5744                      .dwattr $C$DW$T$162, DW_AT_name("GPIO_Number_e")
    5745                      .dwattr $C$DW$T$162, DW_AT_type(*$C$DW$T$161)
    5746                      .dwattr $C$DW$T$162, DW_AT_language(DW_LANG_C)
    5747              
    5748              $C$DW$523       .dwtag  DW_TAG_TI_far_type
    5749                      .dwattr $C$DW$523, DW_AT_type(*$C$DW$T$162)
    5750              
    5751              $C$DW$T$163     .dwtag  DW_TAG_const_type
    5752                      .dwattr $C$DW$T$163, DW_AT_type(*$C$DW$523)
    5753              
    5754              
    5755              $C$DW$T$29      .dwtag  DW_TAG_structure_type
    5756                      .dwattr $C$DW$T$29, DW_AT_name("_ADC_Obj_")
    5757                      .dwattr $C$DW$T$29, DW_AT_byte_size(0x6650)
    5758              $C$DW$524       .dwtag  DW_TAG_member
    5759                      .dwattr $C$DW$524, DW_AT_type(*$C$DW$T$23)
    5760                      .dwattr $C$DW$524, DW_AT_name("ADCRESULT")
    5761                      .dwattr $C$DW$524, DW_AT_TI_symbol_name("_ADCRESULT")
    5762                      .dwattr $C$DW$524, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    5763                      .dwattr $C$DW$524, DW_AT_accessibility(DW_ACCESS_public)
    5764              
    5765              $C$DW$525       .dwtag  DW_TAG_member
    5766                      .dwattr $C$DW$525, DW_AT_type(*$C$DW$T$24)
    5767                      .dwattr $C$DW$525, DW_AT_name("resvd_1")
    5768                      .dwattr $C$DW$525, DW_AT_TI_symbol_name("_resvd_1")
    5769                      .dwattr $C$DW$525, DW_AT_data_member_location[DW_OP_plus_uconst 0x10]
    5770                      .dwattr $C$DW$525, DW_AT_accessibility(DW_ACCESS_public)
    5771              
TMS320C2000 Assembler PC v15.12.3 Wed Nov 22 00:56:18 2017

Tools Copyright (c) 1996-2015 Texas Instruments Incorporated
C:\Users\wmj\AppData\Local\Temp\0313610                              PAGE  110

    5772              $C$DW$526       .dwtag  DW_TAG_member
    5773                      .dwattr $C$DW$526, DW_AT_type(*$C$DW$T$22)
    5774                      .dwattr $C$DW$526, DW_AT_name("ADCCTL1")
    5775                      .dwattr $C$DW$526, DW_AT_TI_symbol_name("_ADCCTL1")
    5776                      .dwattr $C$DW$526, DW_AT_data_member_location[DW_OP_plus_uconst 0x6600]
    5777                      .dwattr $C$DW$526, DW_AT_accessibility(DW_ACCESS_public)
    5778              
    5779              $C$DW$527       .dwtag  DW_TAG_member
    5780                      .dwattr $C$DW$527, DW_AT_type(*$C$DW$T$22)
    5781                      .dwattr $C$DW$527, DW_AT_name("ADCCTL2")
    5782                      .dwattr $C$DW$527, DW_AT_TI_symbol_name("_ADCCTL2")
    5783                      .dwattr $C$DW$527, DW_AT_data_member_location[DW_OP_plus_uconst 0x6601]
    5784                      .dwattr $C$DW$527, DW_AT_accessibility(DW_ACCESS_public)
    5785              
    5786              $C$DW$528       .dwtag  DW_TAG_member
    5787                      .dwattr $C$DW$528, DW_AT_type(*$C$DW$T$25)
    5788                      .dwattr $C$DW$528, DW_AT_name("rsvd_2")
    5789                      .dwattr $C$DW$528, DW_AT_TI_symbol_name("_rsvd_2")
    5790                      .dwattr $C$DW$528, DW_AT_data_member_location[DW_OP_plus_uconst 0x6602]
    5791                      .dwattr $C$DW$528, DW_AT_accessibility(DW_ACCESS_public)
    5792              
    5793              $C$DW$529       .dwtag  DW_TAG_member
    5794                      .dwattr $C$DW$529, DW_AT_type(*$C$DW$T$22)
    5795                      .dwattr $C$DW$529, DW_AT_name("ADCINTFLG")
    5796                      .dwattr $C$DW$529, DW_AT_TI_symbol_name("_ADCINTFLG")
    5797                      .dwattr $C$DW$529, DW_AT_data_member_location[DW_OP_plus_uconst 0x6604]
    5798                      .dwattr $C$DW$529, DW_AT_accessibility(DW_ACCESS_public)
    5799              
    5800              $C$DW$530       .dwtag  DW_TAG_member
    5801                      .dwattr $C$DW$530, DW_AT_type(*$C$DW$T$22)
    5802                      .dwattr $C$DW$530, DW_AT_name("ADCINTFLGCLR")
    5803                      .dwattr $C$DW$530, DW_AT_TI_symbol_name("_ADCINTFLGCLR")
    5804                      .dwattr $C$DW$530, DW_AT_data_member_location[DW_OP_plus_uconst 0x6605]
    5805                      .dwattr $C$DW$530, DW_AT_accessibility(DW_ACCESS_public)
    5806              
    5807              $C$DW$531       .dwtag  DW_TAG_member
    5808                      .dwattr $C$DW$531, DW_AT_type(*$C$DW$T$22)
    5809                      .dwattr $C$DW$531, DW_AT_name("ADCINTOVF")
    5810                      .dwattr $C$DW$531, DW_AT_TI_symbol_name("_ADCINTOVF")
    5811                      .dwattr $C$DW$531, DW_AT_data_member_location[DW_OP_plus_uconst 0x6606]
    5812                      .dwattr $C$DW$531, DW_AT_accessibility(DW_ACCESS_public)
    5813              
    5814              $C$DW$532       .dwtag  DW_TAG_member
    5815                      .dwattr $C$DW$532, DW_AT_type(*$C$DW$T$22)
    5816                      .dwattr $C$DW$532, DW_AT_name("ADCINTOVFCLR")
    5817                      .dwattr $C$DW$532, DW_AT_TI_symbol_name("_ADCINTOVFCLR")
    5818                      .dwattr $C$DW$532, DW_AT_data_member_location[DW_OP_plus_uconst 0x6607]
    5819                      .dwattr $C$DW$532, DW_AT_accessibility(DW_ACCESS_public)
    5820              
    5821              $C$DW$533       .dwtag  DW_TAG_member
    5822                      .dwattr $C$DW$533, DW_AT_type(*$C$DW$T$26)
    5823                      .dwattr $C$DW$533, DW_AT_name("INTSELxNy")
    5824                      .dwattr $C$DW$533, DW_AT_TI_symbol_name("_INTSELxNy")
    5825                      .dwattr $C$DW$533, DW_AT_data_member_location[DW_OP_plus_uconst 0x6608]
    5826                      .dwattr $C$DW$533, DW_AT_accessibility(DW_ACCESS_public)
TMS320C2000 Assembler PC v15.12.3 Wed Nov 22 00:56:18 2017

Tools Copyright (c) 1996-2015 Texas Instruments Incorporated
C:\Users\wmj\AppData\Local\Temp\0313610                              PAGE  111

    5827              
    5828              $C$DW$534       .dwtag  DW_TAG_member
    5829                      .dwattr $C$DW$534, DW_AT_type(*$C$DW$T$27)
    5830                      .dwattr $C$DW$534, DW_AT_name("rsvd_3")
    5831                      .dwattr $C$DW$534, DW_AT_TI_symbol_name("_rsvd_3")
    5832                      .dwattr $C$DW$534, DW_AT_data_member_location[DW_OP_plus_uconst 0x660d]
    5833                      .dwattr $C$DW$534, DW_AT_accessibility(DW_ACCESS_public)
    5834              
    5835              $C$DW$535       .dwtag  DW_TAG_member
    5836                      .dwattr $C$DW$535, DW_AT_type(*$C$DW$T$22)
    5837                      .dwattr $C$DW$535, DW_AT_name("SOCPRICTRL")
    5838                      .dwattr $C$DW$535, DW_AT_TI_symbol_name("_SOCPRICTRL")
    5839                      .dwattr $C$DW$535, DW_AT_data_member_location[DW_OP_plus_uconst 0x6610]
    5840                      .dwattr $C$DW$535, DW_AT_accessibility(DW_ACCESS_public)
    5841              
    5842              $C$DW$536       .dwtag  DW_TAG_member
    5843                      .dwattr $C$DW$536, DW_AT_type(*$C$DW$T$22)
    5844                      .dwattr $C$DW$536, DW_AT_name("rsvd_4")
    5845                      .dwattr $C$DW$536, DW_AT_TI_symbol_name("_rsvd_4")
    5846                      .dwattr $C$DW$536, DW_AT_data_member_location[DW_OP_plus_uconst 0x6611]
    5847                      .dwattr $C$DW$536, DW_AT_accessibility(DW_ACCESS_public)
    5848              
    5849              $C$DW$537       .dwtag  DW_TAG_member
    5850                      .dwattr $C$DW$537, DW_AT_type(*$C$DW$T$22)
    5851                      .dwattr $C$DW$537, DW_AT_name("ADCSAMPLEMODE")
    5852                      .dwattr $C$DW$537, DW_AT_TI_symbol_name("_ADCSAMPLEMODE")
    5853                      .dwattr $C$DW$537, DW_AT_data_member_location[DW_OP_plus_uconst 0x6612]
    5854                      .dwattr $C$DW$537, DW_AT_accessibility(DW_ACCESS_public)
    5855              
    5856              $C$DW$538       .dwtag  DW_TAG_member
    5857                      .dwattr $C$DW$538, DW_AT_type(*$C$DW$T$22)
    5858                      .dwattr $C$DW$538, DW_AT_name("rsvd_5")
    5859                      .dwattr $C$DW$538, DW_AT_TI_symbol_name("_rsvd_5")
    5860                      .dwattr $C$DW$538, DW_AT_data_member_location[DW_OP_plus_uconst 0x6613]
    5861                      .dwattr $C$DW$538, DW_AT_accessibility(DW_ACCESS_public)
    5862              
    5863              $C$DW$539       .dwtag  DW_TAG_member
    5864                      .dwattr $C$DW$539, DW_AT_type(*$C$DW$T$22)
    5865                      .dwattr $C$DW$539, DW_AT_name("ADCINTSOCSEL1")
    5866                      .dwattr $C$DW$539, DW_AT_TI_symbol_name("_ADCINTSOCSEL1")
    5867                      .dwattr $C$DW$539, DW_AT_data_member_location[DW_OP_plus_uconst 0x6614]
    5868                      .dwattr $C$DW$539, DW_AT_accessibility(DW_ACCESS_public)
    5869              
    5870              $C$DW$540       .dwtag  DW_TAG_member
    5871                      .dwattr $C$DW$540, DW_AT_type(*$C$DW$T$22)
    5872                      .dwattr $C$DW$540, DW_AT_name("ADCINTSOCSEL2")
    5873                      .dwattr $C$DW$540, DW_AT_TI_symbol_name("_ADCINTSOCSEL2")
    5874                      .dwattr $C$DW$540, DW_AT_data_member_location[DW_OP_plus_uconst 0x6615]
    5875                      .dwattr $C$DW$540, DW_AT_accessibility(DW_ACCESS_public)
    5876              
    5877              $C$DW$541       .dwtag  DW_TAG_member
    5878                      .dwattr $C$DW$541, DW_AT_type(*$C$DW$T$25)
    5879                      .dwattr $C$DW$541, DW_AT_name("rsvd_6")
    5880                      .dwattr $C$DW$541, DW_AT_TI_symbol_name("_rsvd_6")
    5881                      .dwattr $C$DW$541, DW_AT_data_member_location[DW_OP_plus_uconst 0x6616]
TMS320C2000 Assembler PC v15.12.3 Wed Nov 22 00:56:18 2017

Tools Copyright (c) 1996-2015 Texas Instruments Incorporated
C:\Users\wmj\AppData\Local\Temp\0313610                              PAGE  112

    5882                      .dwattr $C$DW$541, DW_AT_accessibility(DW_ACCESS_public)
    5883              
    5884              $C$DW$542       .dwtag  DW_TAG_member
    5885                      .dwattr $C$DW$542, DW_AT_type(*$C$DW$T$22)
    5886                      .dwattr $C$DW$542, DW_AT_name("ADCSOCFLG1")
    5887                      .dwattr $C$DW$542, DW_AT_TI_symbol_name("_ADCSOCFLG1")
    5888                      .dwattr $C$DW$542, DW_AT_data_member_location[DW_OP_plus_uconst 0x6618]
    5889                      .dwattr $C$DW$542, DW_AT_accessibility(DW_ACCESS_public)
    5890              
    5891              $C$DW$543       .dwtag  DW_TAG_member
    5892                      .dwattr $C$DW$543, DW_AT_type(*$C$DW$T$22)
    5893                      .dwattr $C$DW$543, DW_AT_name("rsvd_7")
    5894                      .dwattr $C$DW$543, DW_AT_TI_symbol_name("_rsvd_7")
    5895                      .dwattr $C$DW$543, DW_AT_data_member_location[DW_OP_plus_uconst 0x6619]
    5896                      .dwattr $C$DW$543, DW_AT_accessibility(DW_ACCESS_public)
    5897              
    5898              $C$DW$544       .dwtag  DW_TAG_member
    5899                      .dwattr $C$DW$544, DW_AT_type(*$C$DW$T$22)
    5900                      .dwattr $C$DW$544, DW_AT_name("ADCSOCFRC1")
    5901                      .dwattr $C$DW$544, DW_AT_TI_symbol_name("_ADCSOCFRC1")
    5902                      .dwattr $C$DW$544, DW_AT_data_member_location[DW_OP_plus_uconst 0x661a]
    5903                      .dwattr $C$DW$544, DW_AT_accessibility(DW_ACCESS_public)
    5904              
    5905              $C$DW$545       .dwtag  DW_TAG_member
    5906                      .dwattr $C$DW$545, DW_AT_type(*$C$DW$T$22)
    5907                      .dwattr $C$DW$545, DW_AT_name("rsvd_8")
    5908                      .dwattr $C$DW$545, DW_AT_TI_symbol_name("_rsvd_8")
    5909                      .dwattr $C$DW$545, DW_AT_data_member_location[DW_OP_plus_uconst 0x661b]
    5910                      .dwattr $C$DW$545, DW_AT_accessibility(DW_ACCESS_public)
    5911              
    5912              $C$DW$546       .dwtag  DW_TAG_member
    5913                      .dwattr $C$DW$546, DW_AT_type(*$C$DW$T$22)
    5914                      .dwattr $C$DW$546, DW_AT_name("ADCSOCOVF1")
    5915                      .dwattr $C$DW$546, DW_AT_TI_symbol_name("_ADCSOCOVF1")
    5916                      .dwattr $C$DW$546, DW_AT_data_member_location[DW_OP_plus_uconst 0x661c]
    5917                      .dwattr $C$DW$546, DW_AT_accessibility(DW_ACCESS_public)
    5918              
    5919              $C$DW$547       .dwtag  DW_TAG_member
    5920                      .dwattr $C$DW$547, DW_AT_type(*$C$DW$T$22)
    5921                      .dwattr $C$DW$547, DW_AT_name("rsvd_9")
    5922                      .dwattr $C$DW$547, DW_AT_TI_symbol_name("_rsvd_9")
    5923                      .dwattr $C$DW$547, DW_AT_data_member_location[DW_OP_plus_uconst 0x661d]
    5924                      .dwattr $C$DW$547, DW_AT_accessibility(DW_ACCESS_public)
    5925              
    5926              $C$DW$548       .dwtag  DW_TAG_member
    5927                      .dwattr $C$DW$548, DW_AT_type(*$C$DW$T$22)
    5928                      .dwattr $C$DW$548, DW_AT_name("ADCSOCOVFCLR1")
    5929                      .dwattr $C$DW$548, DW_AT_TI_symbol_name("_ADCSOCOVFCLR1")
    5930                      .dwattr $C$DW$548, DW_AT_data_member_location[DW_OP_plus_uconst 0x661e]
    5931                      .dwattr $C$DW$548, DW_AT_accessibility(DW_ACCESS_public)
    5932              
    5933              $C$DW$549       .dwtag  DW_TAG_member
    5934                      .dwattr $C$DW$549, DW_AT_type(*$C$DW$T$22)
    5935                      .dwattr $C$DW$549, DW_AT_name("rsvd_10")
    5936                      .dwattr $C$DW$549, DW_AT_TI_symbol_name("_rsvd_10")
TMS320C2000 Assembler PC v15.12.3 Wed Nov 22 00:56:18 2017

Tools Copyright (c) 1996-2015 Texas Instruments Incorporated
C:\Users\wmj\AppData\Local\Temp\0313610                              PAGE  113

    5937                      .dwattr $C$DW$549, DW_AT_data_member_location[DW_OP_plus_uconst 0x661f]
    5938                      .dwattr $C$DW$549, DW_AT_accessibility(DW_ACCESS_public)
    5939              
    5940              $C$DW$550       .dwtag  DW_TAG_member
    5941                      .dwattr $C$DW$550, DW_AT_type(*$C$DW$T$23)
    5942                      .dwattr $C$DW$550, DW_AT_name("ADCSOCxCTL")
    5943                      .dwattr $C$DW$550, DW_AT_TI_symbol_name("_ADCSOCxCTL")
    5944                      .dwattr $C$DW$550, DW_AT_data_member_location[DW_OP_plus_uconst 0x6620]
    5945                      .dwattr $C$DW$550, DW_AT_accessibility(DW_ACCESS_public)
    5946              
    5947              $C$DW$551       .dwtag  DW_TAG_member
    5948                      .dwattr $C$DW$551, DW_AT_type(*$C$DW$T$23)
    5949                      .dwattr $C$DW$551, DW_AT_name("rsvd_11")
    5950                      .dwattr $C$DW$551, DW_AT_TI_symbol_name("_rsvd_11")
    5951                      .dwattr $C$DW$551, DW_AT_data_member_location[DW_OP_plus_uconst 0x6630]
    5952                      .dwattr $C$DW$551, DW_AT_accessibility(DW_ACCESS_public)
    5953              
    5954              $C$DW$552       .dwtag  DW_TAG_member
    5955                      .dwattr $C$DW$552, DW_AT_type(*$C$DW$T$22)
    5956                      .dwattr $C$DW$552, DW_AT_name("ADCREFTRIM")
    5957                      .dwattr $C$DW$552, DW_AT_TI_symbol_name("_ADCREFTRIM")
    5958                      .dwattr $C$DW$552, DW_AT_data_member_location[DW_OP_plus_uconst 0x6640]
    5959                      .dwattr $C$DW$552, DW_AT_accessibility(DW_ACCESS_public)
    5960              
    5961              $C$DW$553       .dwtag  DW_TAG_member
    5962                      .dwattr $C$DW$553, DW_AT_type(*$C$DW$T$22)
    5963                      .dwattr $C$DW$553, DW_AT_name("ADCOFFTRIM")
    5964                      .dwattr $C$DW$553, DW_AT_TI_symbol_name("_ADCOFFTRIM")
    5965                      .dwattr $C$DW$553, DW_AT_data_member_location[DW_OP_plus_uconst 0x6641]
    5966                      .dwattr $C$DW$553, DW_AT_accessibility(DW_ACCESS_public)
    5967              
    5968              $C$DW$554       .dwtag  DW_TAG_member
    5969                      .dwattr $C$DW$554, DW_AT_type(*$C$DW$T$28)
    5970                      .dwattr $C$DW$554, DW_AT_name("resvd_12")
    5971                      .dwattr $C$DW$554, DW_AT_TI_symbol_name("_resvd_12")
    5972                      .dwattr $C$DW$554, DW_AT_data_member_location[DW_OP_plus_uconst 0x6642]
    5973                      .dwattr $C$DW$554, DW_AT_accessibility(DW_ACCESS_public)
    5974              
    5975              $C$DW$555       .dwtag  DW_TAG_member
    5976                      .dwattr $C$DW$555, DW_AT_type(*$C$DW$T$22)
    5977                      .dwattr $C$DW$555, DW_AT_name("ADCREV")
    5978                      .dwattr $C$DW$555, DW_AT_TI_symbol_name("_ADCREV")
    5979                      .dwattr $C$DW$555, DW_AT_data_member_location[DW_OP_plus_uconst 0x664f]
    5980                      .dwattr $C$DW$555, DW_AT_accessibility(DW_ACCESS_public)
    5981              
    5982                      .dwendtag $C$DW$T$29
    5983              
    5984              $C$DW$T$80      .dwtag  DW_TAG_pointer_type
    5985                      .dwattr $C$DW$T$80, DW_AT_type(*$C$DW$T$29)
    5986                      .dwattr $C$DW$T$80, DW_AT_address_class(0x20)
    5987              
    5988              $C$DW$T$81      .dwtag  DW_TAG_typedef
    5989                      .dwattr $C$DW$T$81, DW_AT_name("ADC_Handle")
    5990                      .dwattr $C$DW$T$81, DW_AT_type(*$C$DW$T$80)
    5991                      .dwattr $C$DW$T$81, DW_AT_language(DW_LANG_C)
TMS320C2000 Assembler PC v15.12.3 Wed Nov 22 00:56:18 2017

Tools Copyright (c) 1996-2015 Texas Instruments Incorporated
C:\Users\wmj\AppData\Local\Temp\0313610                              PAGE  114

    5992              
    5993              
    5994              $C$DW$T$31      .dwtag  DW_TAG_structure_type
    5995                      .dwattr $C$DW$T$31, DW_AT_name("_CLK_Obj_")
    5996                      .dwattr $C$DW$T$31, DW_AT_byte_size(0x11)
    5997              $C$DW$556       .dwtag  DW_TAG_member
    5998                      .dwattr $C$DW$556, DW_AT_type(*$C$DW$T$22)
    5999                      .dwattr $C$DW$556, DW_AT_name("XCLK")
    6000                      .dwattr $C$DW$556, DW_AT_TI_symbol_name("_XCLK")
    6001                      .dwattr $C$DW$556, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    6002                      .dwattr $C$DW$556, DW_AT_accessibility(DW_ACCESS_public)
    6003              
    6004              $C$DW$557       .dwtag  DW_TAG_member
    6005                      .dwattr $C$DW$557, DW_AT_type(*$C$DW$T$22)
    6006                      .dwattr $C$DW$557, DW_AT_name("rsvd_1")
    6007                      .dwattr $C$DW$557, DW_AT_TI_symbol_name("_rsvd_1")
    6008                      .dwattr $C$DW$557, DW_AT_data_member_location[DW_OP_plus_uconst 0x1]
    6009                      .dwattr $C$DW$557, DW_AT_accessibility(DW_ACCESS_public)
    6010              
    6011              $C$DW$558       .dwtag  DW_TAG_member
    6012                      .dwattr $C$DW$558, DW_AT_type(*$C$DW$T$22)
    6013                      .dwattr $C$DW$558, DW_AT_name("CLKCTL")
    6014                      .dwattr $C$DW$558, DW_AT_TI_symbol_name("_CLKCTL")
    6015                      .dwattr $C$DW$558, DW_AT_data_member_location[DW_OP_plus_uconst 0x2]
    6016                      .dwattr $C$DW$558, DW_AT_accessibility(DW_ACCESS_public)
    6017              
    6018              $C$DW$559       .dwtag  DW_TAG_member
    6019                      .dwattr $C$DW$559, DW_AT_type(*$C$DW$T$30)
    6020                      .dwattr $C$DW$559, DW_AT_name("rsvd_2")
    6021                      .dwattr $C$DW$559, DW_AT_TI_symbol_name("_rsvd_2")
    6022                      .dwattr $C$DW$559, DW_AT_data_member_location[DW_OP_plus_uconst 0x3]
    6023                      .dwattr $C$DW$559, DW_AT_accessibility(DW_ACCESS_public)
    6024              
    6025              $C$DW$560       .dwtag  DW_TAG_member
    6026                      .dwattr $C$DW$560, DW_AT_type(*$C$DW$T$22)
    6027                      .dwattr $C$DW$560, DW_AT_name("LOSPCP")
    6028                      .dwattr $C$DW$560, DW_AT_TI_symbol_name("_LOSPCP")
    6029                      .dwattr $C$DW$560, DW_AT_data_member_location[DW_OP_plus_uconst 0xb]
    6030                      .dwattr $C$DW$560, DW_AT_accessibility(DW_ACCESS_public)
    6031              
    6032              $C$DW$561       .dwtag  DW_TAG_member
    6033                      .dwattr $C$DW$561, DW_AT_type(*$C$DW$T$22)
    6034                      .dwattr $C$DW$561, DW_AT_name("PCLKCR0")
    6035                      .dwattr $C$DW$561, DW_AT_TI_symbol_name("_PCLKCR0")
    6036                      .dwattr $C$DW$561, DW_AT_data_member_location[DW_OP_plus_uconst 0xc]
    6037                      .dwattr $C$DW$561, DW_AT_accessibility(DW_ACCESS_public)
    6038              
    6039              $C$DW$562       .dwtag  DW_TAG_member
    6040                      .dwattr $C$DW$562, DW_AT_type(*$C$DW$T$22)
    6041                      .dwattr $C$DW$562, DW_AT_name("PCLKCR1")
    6042                      .dwattr $C$DW$562, DW_AT_TI_symbol_name("_PCLKCR1")
    6043                      .dwattr $C$DW$562, DW_AT_data_member_location[DW_OP_plus_uconst 0xd]
    6044                      .dwattr $C$DW$562, DW_AT_accessibility(DW_ACCESS_public)
    6045              
    6046              $C$DW$563       .dwtag  DW_TAG_member
TMS320C2000 Assembler PC v15.12.3 Wed Nov 22 00:56:18 2017

Tools Copyright (c) 1996-2015 Texas Instruments Incorporated
C:\Users\wmj\AppData\Local\Temp\0313610                              PAGE  115

    6047                      .dwattr $C$DW$563, DW_AT_type(*$C$DW$T$25)
    6048                      .dwattr $C$DW$563, DW_AT_name("rsvd_3")
    6049                      .dwattr $C$DW$563, DW_AT_TI_symbol_name("_rsvd_3")
    6050                      .dwattr $C$DW$563, DW_AT_data_member_location[DW_OP_plus_uconst 0xe]
    6051                      .dwattr $C$DW$563, DW_AT_accessibility(DW_ACCESS_public)
    6052              
    6053              $C$DW$564       .dwtag  DW_TAG_member
    6054                      .dwattr $C$DW$564, DW_AT_type(*$C$DW$T$22)
    6055                      .dwattr $C$DW$564, DW_AT_name("PCLKCR3")
    6056                      .dwattr $C$DW$564, DW_AT_TI_symbol_name("_PCLKCR3")
    6057                      .dwattr $C$DW$564, DW_AT_data_member_location[DW_OP_plus_uconst 0x10]
    6058                      .dwattr $C$DW$564, DW_AT_accessibility(DW_ACCESS_public)
    6059              
    6060                      .dwendtag $C$DW$T$31
    6061              
    6062              $C$DW$T$82      .dwtag  DW_TAG_pointer_type
    6063                      .dwattr $C$DW$T$82, DW_AT_type(*$C$DW$T$31)
    6064                      .dwattr $C$DW$T$82, DW_AT_address_class(0x20)
    6065              
    6066              $C$DW$T$83      .dwtag  DW_TAG_typedef
    6067                      .dwattr $C$DW$T$83, DW_AT_name("CLK_Handle")
    6068                      .dwattr $C$DW$T$83, DW_AT_type(*$C$DW$T$82)
    6069                      .dwattr $C$DW$T$83, DW_AT_language(DW_LANG_C)
    6070              
    6071              
    6072              $C$DW$T$33      .dwtag  DW_TAG_structure_type
    6073                      .dwattr $C$DW$T$33, DW_AT_name("_CPU_Obj_")
    6074                      .dwattr $C$DW$T$33, DW_AT_byte_size(0x01)
    6075              $C$DW$565       .dwtag  DW_TAG_member
    6076                      .dwattr $C$DW$565, DW_AT_type(*$C$DW$T$32)
    6077                      .dwattr $C$DW$565, DW_AT_name("tmp")
    6078                      .dwattr $C$DW$565, DW_AT_TI_symbol_name("_tmp")
    6079                      .dwattr $C$DW$565, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    6080                      .dwattr $C$DW$565, DW_AT_accessibility(DW_ACCESS_public)
    6081              
    6082                      .dwendtag $C$DW$T$33
    6083              
    6084              $C$DW$T$84      .dwtag  DW_TAG_pointer_type
    6085                      .dwattr $C$DW$T$84, DW_AT_type(*$C$DW$T$33)
    6086                      .dwattr $C$DW$T$84, DW_AT_address_class(0x20)
    6087              
    6088              $C$DW$T$85      .dwtag  DW_TAG_typedef
    6089                      .dwattr $C$DW$T$85, DW_AT_name("CPU_Handle")
    6090                      .dwattr $C$DW$T$85, DW_AT_type(*$C$DW$T$84)
    6091                      .dwattr $C$DW$T$85, DW_AT_language(DW_LANG_C)
    6092              
    6093              
    6094              $C$DW$T$36      .dwtag  DW_TAG_structure_type
    6095                      .dwattr $C$DW$T$36, DW_AT_name("_CTRL_Version_")
    6096                      .dwattr $C$DW$T$36, DW_AT_byte_size(0x04)
    6097              $C$DW$566       .dwtag  DW_TAG_member
    6098                      .dwattr $C$DW$566, DW_AT_type(*$C$DW$T$21)
    6099                      .dwattr $C$DW$566, DW_AT_name("rsvd")
    6100                      .dwattr $C$DW$566, DW_AT_TI_symbol_name("_rsvd")
    6101                      .dwattr $C$DW$566, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
TMS320C2000 Assembler PC v15.12.3 Wed Nov 22 00:56:18 2017

Tools Copyright (c) 1996-2015 Texas Instruments Incorporated
C:\Users\wmj\AppData\Local\Temp\0313610                              PAGE  116

    6102                      .dwattr $C$DW$566, DW_AT_accessibility(DW_ACCESS_public)
    6103              
    6104              $C$DW$567       .dwtag  DW_TAG_member
    6105                      .dwattr $C$DW$567, DW_AT_type(*$C$DW$T$35)
    6106                      .dwattr $C$DW$567, DW_AT_name("targetProc")
    6107                      .dwattr $C$DW$567, DW_AT_TI_symbol_name("_targetProc")
    6108                      .dwattr $C$DW$567, DW_AT_data_member_location[DW_OP_plus_uconst 0x1]
    6109                      .dwattr $C$DW$567, DW_AT_accessibility(DW_ACCESS_public)
    6110              
    6111              $C$DW$568       .dwtag  DW_TAG_member
    6112                      .dwattr $C$DW$568, DW_AT_type(*$C$DW$T$21)
    6113                      .dwattr $C$DW$568, DW_AT_name("major")
    6114                      .dwattr $C$DW$568, DW_AT_TI_symbol_name("_major")
    6115                      .dwattr $C$DW$568, DW_AT_data_member_location[DW_OP_plus_uconst 0x2]
    6116                      .dwattr $C$DW$568, DW_AT_accessibility(DW_ACCESS_public)
    6117              
    6118              $C$DW$569       .dwtag  DW_TAG_member
    6119                      .dwattr $C$DW$569, DW_AT_type(*$C$DW$T$21)
    6120                      .dwattr $C$DW$569, DW_AT_name("minor")
    6121                      .dwattr $C$DW$569, DW_AT_TI_symbol_name("_minor")
    6122                      .dwattr $C$DW$569, DW_AT_data_member_location[DW_OP_plus_uconst 0x3]
    6123                      .dwattr $C$DW$569, DW_AT_accessibility(DW_ACCESS_public)
    6124              
    6125                      .dwendtag $C$DW$T$36
    6126              
    6127              $C$DW$T$127     .dwtag  DW_TAG_typedef
    6128                      .dwattr $C$DW$T$127, DW_AT_name("CTRL_Version")
    6129                      .dwattr $C$DW$T$127, DW_AT_type(*$C$DW$T$36)
    6130                      .dwattr $C$DW$T$127, DW_AT_language(DW_LANG_C)
    6131              
    6132              
    6133              $C$DW$T$38      .dwtag  DW_TAG_structure_type
    6134                      .dwattr $C$DW$T$38, DW_AT_name("_FILTER_FO_")
    6135                      .dwattr $C$DW$T$38, DW_AT_byte_size(0x0a)
    6136              $C$DW$570       .dwtag  DW_TAG_member
    6137                      .dwattr $C$DW$570, DW_AT_type(*$C$DW$T$37)
    6138                      .dwattr $C$DW$570, DW_AT_name("a1")
    6139                      .dwattr $C$DW$570, DW_AT_TI_symbol_name("_a1")
    6140                      .dwattr $C$DW$570, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    6141                      .dwattr $C$DW$570, DW_AT_accessibility(DW_ACCESS_public)
    6142              
    6143              $C$DW$571       .dwtag  DW_TAG_member
    6144                      .dwattr $C$DW$571, DW_AT_type(*$C$DW$T$37)
    6145                      .dwattr $C$DW$571, DW_AT_name("b0")
    6146                      .dwattr $C$DW$571, DW_AT_TI_symbol_name("_b0")
    6147                      .dwattr $C$DW$571, DW_AT_data_member_location[DW_OP_plus_uconst 0x2]
    6148                      .dwattr $C$DW$571, DW_AT_accessibility(DW_ACCESS_public)
    6149              
    6150              $C$DW$572       .dwtag  DW_TAG_member
    6151                      .dwattr $C$DW$572, DW_AT_type(*$C$DW$T$37)
    6152                      .dwattr $C$DW$572, DW_AT_name("b1")
    6153                      .dwattr $C$DW$572, DW_AT_TI_symbol_name("_b1")
    6154                      .dwattr $C$DW$572, DW_AT_data_member_location[DW_OP_plus_uconst 0x4]
    6155                      .dwattr $C$DW$572, DW_AT_accessibility(DW_ACCESS_public)
    6156              
TMS320C2000 Assembler PC v15.12.3 Wed Nov 22 00:56:18 2017

Tools Copyright (c) 1996-2015 Texas Instruments Incorporated
C:\Users\wmj\AppData\Local\Temp\0313610                              PAGE  117

    6157              $C$DW$573       .dwtag  DW_TAG_member
    6158                      .dwattr $C$DW$573, DW_AT_type(*$C$DW$T$37)
    6159                      .dwattr $C$DW$573, DW_AT_name("x1")
    6160                      .dwattr $C$DW$573, DW_AT_TI_symbol_name("_x1")
    6161                      .dwattr $C$DW$573, DW_AT_data_member_location[DW_OP_plus_uconst 0x6]
    6162                      .dwattr $C$DW$573, DW_AT_accessibility(DW_ACCESS_public)
    6163              
    6164              $C$DW$574       .dwtag  DW_TAG_member
    6165                      .dwattr $C$DW$574, DW_AT_type(*$C$DW$T$37)
    6166                      .dwattr $C$DW$574, DW_AT_name("y1")
    6167                      .dwattr $C$DW$574, DW_AT_TI_symbol_name("_y1")
    6168                      .dwattr $C$DW$574, DW_AT_data_member_location[DW_OP_plus_uconst 0x8]
    6169                      .dwattr $C$DW$574, DW_AT_accessibility(DW_ACCESS_public)
    6170              
    6171                      .dwendtag $C$DW$T$38
    6172              
    6173              $C$DW$T$131     .dwtag  DW_TAG_typedef
    6174                      .dwattr $C$DW$T$131, DW_AT_name("FILTER_FO_Obj")
    6175                      .dwattr $C$DW$T$131, DW_AT_type(*$C$DW$T$38)
    6176                      .dwattr $C$DW$T$131, DW_AT_language(DW_LANG_C)
    6177              
    6178              
    6179              $C$DW$T$19      .dwtag  DW_TAG_structure_type
    6180                      .dwattr $C$DW$T$19, DW_AT_name("_FILTER_FO_Obj_")
    6181                      .dwattr $C$DW$T$19, DW_AT_declaration
    6182                      .dwendtag $C$DW$T$19
    6183              
    6184              $C$DW$T$132     .dwtag  DW_TAG_pointer_type
    6185                      .dwattr $C$DW$T$132, DW_AT_type(*$C$DW$T$19)
    6186                      .dwattr $C$DW$T$132, DW_AT_address_class(0x20)
    6187              
    6188              $C$DW$T$133     .dwtag  DW_TAG_typedef
    6189                      .dwattr $C$DW$T$133, DW_AT_name("FILTER_FO_Handle")
    6190                      .dwattr $C$DW$T$133, DW_AT_type(*$C$DW$T$132)
    6191                      .dwattr $C$DW$T$133, DW_AT_language(DW_LANG_C)
    6192              
    6193              
    6194              $C$DW$T$39      .dwtag  DW_TAG_structure_type
    6195                      .dwattr $C$DW$T$39, DW_AT_name("_FLASH_Obj_")
    6196                      .dwattr $C$DW$T$39, DW_AT_byte_size(0x08)
    6197              $C$DW$575       .dwtag  DW_TAG_member
    6198                      .dwattr $C$DW$575, DW_AT_type(*$C$DW$T$22)
    6199                      .dwattr $C$DW$575, DW_AT_name("FOPT")
    6200                      .dwattr $C$DW$575, DW_AT_TI_symbol_name("_FOPT")
    6201                      .dwattr $C$DW$575, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    6202                      .dwattr $C$DW$575, DW_AT_accessibility(DW_ACCESS_public)
    6203              
    6204              $C$DW$576       .dwtag  DW_TAG_member
    6205                      .dwattr $C$DW$576, DW_AT_type(*$C$DW$T$22)
    6206                      .dwattr $C$DW$576, DW_AT_name("rsvd_1")
    6207                      .dwattr $C$DW$576, DW_AT_TI_symbol_name("_rsvd_1")
    6208                      .dwattr $C$DW$576, DW_AT_data_member_location[DW_OP_plus_uconst 0x1]
    6209                      .dwattr $C$DW$576, DW_AT_accessibility(DW_ACCESS_public)
    6210              
    6211              $C$DW$577       .dwtag  DW_TAG_member
TMS320C2000 Assembler PC v15.12.3 Wed Nov 22 00:56:18 2017

Tools Copyright (c) 1996-2015 Texas Instruments Incorporated
C:\Users\wmj\AppData\Local\Temp\0313610                              PAGE  118

    6212                      .dwattr $C$DW$577, DW_AT_type(*$C$DW$T$22)
    6213                      .dwattr $C$DW$577, DW_AT_name("FPWR")
    6214                      .dwattr $C$DW$577, DW_AT_TI_symbol_name("_FPWR")
    6215                      .dwattr $C$DW$577, DW_AT_data_member_location[DW_OP_plus_uconst 0x2]
    6216                      .dwattr $C$DW$577, DW_AT_accessibility(DW_ACCESS_public)
    6217              
    6218              $C$DW$578       .dwtag  DW_TAG_member
    6219                      .dwattr $C$DW$578, DW_AT_type(*$C$DW$T$22)
    6220                      .dwattr $C$DW$578, DW_AT_name("FSTATUS")
    6221                      .dwattr $C$DW$578, DW_AT_TI_symbol_name("_FSTATUS")
    6222                      .dwattr $C$DW$578, DW_AT_data_member_location[DW_OP_plus_uconst 0x3]
    6223                      .dwattr $C$DW$578, DW_AT_accessibility(DW_ACCESS_public)
    6224              
    6225              $C$DW$579       .dwtag  DW_TAG_member
    6226                      .dwattr $C$DW$579, DW_AT_type(*$C$DW$T$22)
    6227                      .dwattr $C$DW$579, DW_AT_name("FSTDBYWAIT")
    6228                      .dwattr $C$DW$579, DW_AT_TI_symbol_name("_FSTDBYWAIT")
    6229                      .dwattr $C$DW$579, DW_AT_data_member_location[DW_OP_plus_uconst 0x4]
    6230                      .dwattr $C$DW$579, DW_AT_accessibility(DW_ACCESS_public)
    6231              
    6232              $C$DW$580       .dwtag  DW_TAG_member
    6233                      .dwattr $C$DW$580, DW_AT_type(*$C$DW$T$22)
    6234                      .dwattr $C$DW$580, DW_AT_name("FACTIVEWAIT")
    6235                      .dwattr $C$DW$580, DW_AT_TI_symbol_name("_FACTIVEWAIT")
    6236                      .dwattr $C$DW$580, DW_AT_data_member_location[DW_OP_plus_uconst 0x5]
    6237                      .dwattr $C$DW$580, DW_AT_accessibility(DW_ACCESS_public)
    6238              
    6239              $C$DW$581       .dwtag  DW_TAG_member
    6240                      .dwattr $C$DW$581, DW_AT_type(*$C$DW$T$22)
    6241                      .dwattr $C$DW$581, DW_AT_name("FBANKWAIT")
    6242                      .dwattr $C$DW$581, DW_AT_TI_symbol_name("_FBANKWAIT")
    6243                      .dwattr $C$DW$581, DW_AT_data_member_location[DW_OP_plus_uconst 0x6]
    6244                      .dwattr $C$DW$581, DW_AT_accessibility(DW_ACCESS_public)
    6245              
    6246              $C$DW$582       .dwtag  DW_TAG_member
    6247                      .dwattr $C$DW$582, DW_AT_type(*$C$DW$T$22)
    6248                      .dwattr $C$DW$582, DW_AT_name("FOTPWAIT")
    6249                      .dwattr $C$DW$582, DW_AT_TI_symbol_name("_FOTPWAIT")
    6250                      .dwattr $C$DW$582, DW_AT_data_member_location[DW_OP_plus_uconst 0x7]
    6251                      .dwattr $C$DW$582, DW_AT_accessibility(DW_ACCESS_public)
    6252              
    6253                      .dwendtag $C$DW$T$39
    6254              
    6255              $C$DW$T$86      .dwtag  DW_TAG_pointer_type
    6256                      .dwattr $C$DW$T$86, DW_AT_type(*$C$DW$T$39)
    6257                      .dwattr $C$DW$T$86, DW_AT_address_class(0x20)
    6258              
    6259              $C$DW$T$87      .dwtag  DW_TAG_typedef
    6260                      .dwattr $C$DW$T$87, DW_AT_name("FLASH_Handle")
    6261                      .dwattr $C$DW$T$87, DW_AT_type(*$C$DW$T$86)
    6262                      .dwattr $C$DW$T$87, DW_AT_language(DW_LANG_C)
    6263              
    6264              
    6265              $C$DW$T$60      .dwtag  DW_TAG_structure_type
    6266                      .dwattr $C$DW$T$60, DW_AT_name("_FSM_Obj_")
TMS320C2000 Assembler PC v15.12.3 Wed Nov 22 00:56:18 2017

Tools Copyright (c) 1996-2015 Texas Instruments Incorporated
C:\Users\wmj\AppData\Local\Temp\0313610                              PAGE  119

    6267                      .dwattr $C$DW$T$60, DW_AT_byte_size(0x26)
    6268              $C$DW$583       .dwtag  DW_TAG_member
    6269                      .dwattr $C$DW$583, DW_AT_type(*$C$DW$T$41)
    6270                      .dwattr $C$DW$583, DW_AT_name("motorHandle")
    6271                      .dwattr $C$DW$583, DW_AT_TI_symbol_name("_motorHandle")
    6272                      .dwattr $C$DW$583, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    6273                      .dwattr $C$DW$583, DW_AT_accessibility(DW_ACCESS_public)
    6274              
    6275              $C$DW$584       .dwtag  DW_TAG_member
    6276                      .dwattr $C$DW$584, DW_AT_type(*$C$DW$T$43)
    6277                      .dwattr $C$DW$584, DW_AT_name("halHandle")
    6278                      .dwattr $C$DW$584, DW_AT_TI_symbol_name("_halHandle")
    6279                      .dwattr $C$DW$584, DW_AT_data_member_location[DW_OP_plus_uconst 0x2]
    6280                      .dwattr $C$DW$584, DW_AT_accessibility(DW_ACCESS_public)
    6281              
    6282              $C$DW$585       .dwtag  DW_TAG_member
    6283                      .dwattr $C$DW$585, DW_AT_type(*$C$DW$T$45)
    6284                      .dwattr $C$DW$585, DW_AT_name("StBoxHandle")
    6285                      .dwattr $C$DW$585, DW_AT_TI_symbol_name("_StBoxHandle")
    6286                      .dwattr $C$DW$585, DW_AT_data_member_location[DW_OP_plus_uconst 0x4]
    6287                      .dwattr $C$DW$585, DW_AT_accessibility(DW_ACCESS_public)
    6288              
    6289              $C$DW$586       .dwtag  DW_TAG_member
    6290                      .dwattr $C$DW$586, DW_AT_type(*$C$DW$T$47)
    6291                      .dwattr $C$DW$586, DW_AT_name("FSM_State")
    6292                      .dwattr $C$DW$586, DW_AT_TI_symbol_name("_FSM_State")
    6293                      .dwattr $C$DW$586, DW_AT_data_member_location[DW_OP_plus_uconst 0x6]
    6294                      .dwattr $C$DW$586, DW_AT_accessibility(DW_ACCESS_public)
    6295              
    6296              $C$DW$587       .dwtag  DW_TAG_member
    6297                      .dwattr $C$DW$587, DW_AT_type(*$C$DW$T$47)
    6298                      .dwattr $C$DW$587, DW_AT_name("FSM_CurState")
    6299                      .dwattr $C$DW$587, DW_AT_TI_symbol_name("_FSM_CurState")
    6300                      .dwattr $C$DW$587, DW_AT_data_member_location[DW_OP_plus_uconst 0x7]
    6301                      .dwattr $C$DW$587, DW_AT_accessibility(DW_ACCESS_public)
    6302              
    6303              $C$DW$588       .dwtag  DW_TAG_member
    6304                      .dwattr $C$DW$588, DW_AT_type(*$C$DW$T$49)
    6305                      .dwattr $C$DW$588, DW_AT_name("FSM_Trans")
    6306                      .dwattr $C$DW$588, DW_AT_TI_symbol_name("_FSM_Trans")
    6307                      .dwattr $C$DW$588, DW_AT_data_member_location[DW_OP_plus_uconst 0x8]
    6308                      .dwattr $C$DW$588, DW_AT_accessibility(DW_ACCESS_public)
    6309              
    6310              $C$DW$589       .dwtag  DW_TAG_member
    6311                      .dwattr $C$DW$589, DW_AT_type(*$C$DW$T$51)
    6312                      .dwattr $C$DW$589, DW_AT_name("FSM_Event")
    6313                      .dwattr $C$DW$589, DW_AT_TI_symbol_name("_FSM_Event")
    6314                      .dwattr $C$DW$589, DW_AT_data_member_location[DW_OP_plus_uconst 0x9]
    6315                      .dwattr $C$DW$589, DW_AT_accessibility(DW_ACCESS_public)
    6316              
    6317              $C$DW$590       .dwtag  DW_TAG_member
    6318                      .dwattr $C$DW$590, DW_AT_type(*$C$DW$T$53)
    6319                      .dwattr $C$DW$590, DW_AT_name("FSM_StMode")
    6320                      .dwattr $C$DW$590, DW_AT_TI_symbol_name("_FSM_StMode")
    6321                      .dwattr $C$DW$590, DW_AT_data_member_location[DW_OP_plus_uconst 0xa]
TMS320C2000 Assembler PC v15.12.3 Wed Nov 22 00:56:18 2017

Tools Copyright (c) 1996-2015 Texas Instruments Incorporated
C:\Users\wmj\AppData\Local\Temp\0313610                              PAGE  120

    6322                      .dwattr $C$DW$590, DW_AT_accessibility(DW_ACCESS_public)
    6323              
    6324              $C$DW$591       .dwtag  DW_TAG_member
    6325                      .dwattr $C$DW$591, DW_AT_type(*$C$DW$T$21)
    6326                      .dwattr $C$DW$591, DW_AT_name("FSM_ErrFlg")
    6327                      .dwattr $C$DW$591, DW_AT_TI_symbol_name("_FSM_ErrFlg")
    6328                      .dwattr $C$DW$591, DW_AT_data_member_location[DW_OP_plus_uconst 0xb]
    6329                      .dwattr $C$DW$591, DW_AT_accessibility(DW_ACCESS_public)
    6330              
    6331              $C$DW$592       .dwtag  DW_TAG_member
    6332                      .dwattr $C$DW$592, DW_AT_type(*$C$DW$T$21)
    6333                      .dwattr $C$DW$592, DW_AT_name("FSM_ErrMask")
    6334                      .dwattr $C$DW$592, DW_AT_TI_symbol_name("_FSM_ErrMask")
    6335                      .dwattr $C$DW$592, DW_AT_data_member_location[DW_OP_plus_uconst 0xc]
    6336                      .dwattr $C$DW$592, DW_AT_accessibility(DW_ACCESS_public)
    6337              
    6338              $C$DW$593       .dwtag  DW_TAG_member
    6339                      .dwattr $C$DW$593, DW_AT_type(*$C$DW$T$21)
    6340                      .dwattr $C$DW$593, DW_AT_name("FSM_runTime")
    6341                      .dwattr $C$DW$593, DW_AT_TI_symbol_name("_FSM_runTime")
    6342                      .dwattr $C$DW$593, DW_AT_data_member_location[DW_OP_plus_uconst 0xd]
    6343                      .dwattr $C$DW$593, DW_AT_accessibility(DW_ACCESS_public)
    6344              
    6345              $C$DW$594       .dwtag  DW_TAG_member
    6346                      .dwattr $C$DW$594, DW_AT_type(*$C$DW$T$21)
    6347                      .dwattr $C$DW$594, DW_AT_name("FSM_485Cmd")
    6348                      .dwattr $C$DW$594, DW_AT_TI_symbol_name("_FSM_485Cmd")
    6349                      .dwattr $C$DW$594, DW_AT_data_member_location[DW_OP_plus_uconst 0xe]
    6350                      .dwattr $C$DW$594, DW_AT_accessibility(DW_ACCESS_public)
    6351              
    6352              $C$DW$595       .dwtag  DW_TAG_member
    6353                      .dwattr $C$DW$595, DW_AT_type(*$C$DW$T$47)
    6354                      .dwattr $C$DW$595, DW_AT_name("FSM_485EditState")
    6355                      .dwattr $C$DW$595, DW_AT_TI_symbol_name("_FSM_485EditState")
    6356                      .dwattr $C$DW$595, DW_AT_data_member_location[DW_OP_plus_uconst 0xf]
    6357                      .dwattr $C$DW$595, DW_AT_accessibility(DW_ACCESS_public)
    6358              
    6359              $C$DW$596       .dwtag  DW_TAG_member
    6360                      .dwattr $C$DW$596, DW_AT_type(*$C$DW$T$55)
    6361                      .dwattr $C$DW$596, DW_AT_name("FSM_485EditOpt")
    6362                      .dwattr $C$DW$596, DW_AT_TI_symbol_name("_FSM_485EditOpt")
    6363                      .dwattr $C$DW$596, DW_AT_data_member_location[DW_OP_plus_uconst 0x10]
    6364                      .dwattr $C$DW$596, DW_AT_accessibility(DW_ACCESS_public)
    6365              
    6366              $C$DW$597       .dwtag  DW_TAG_member
    6367                      .dwattr $C$DW$597, DW_AT_type(*$C$DW$T$21)
    6368                      .dwattr $C$DW$597, DW_AT_name("FSM_485RefSpeed")
    6369                      .dwattr $C$DW$597, DW_AT_TI_symbol_name("_FSM_485RefSpeed")
    6370                      .dwattr $C$DW$597, DW_AT_data_member_location[DW_OP_plus_uconst 0x11]
    6371                      .dwattr $C$DW$597, DW_AT_accessibility(DW_ACCESS_public)
    6372              
    6373              $C$DW$598       .dwtag  DW_TAG_member
    6374                      .dwattr $C$DW$598, DW_AT_type(*$C$DW$T$37)
    6375                      .dwattr $C$DW$598, DW_AT_name("MaxTorque_Nm")
    6376                      .dwattr $C$DW$598, DW_AT_TI_symbol_name("_MaxTorque_Nm")
TMS320C2000 Assembler PC v15.12.3 Wed Nov 22 00:56:18 2017

Tools Copyright (c) 1996-2015 Texas Instruments Incorporated
C:\Users\wmj\AppData\Local\Temp\0313610                              PAGE  121

    6377                      .dwattr $C$DW$598, DW_AT_data_member_location[DW_OP_plus_uconst 0x12]
    6378                      .dwattr $C$DW$598, DW_AT_accessibility(DW_ACCESS_public)
    6379              
    6380              $C$DW$599       .dwtag  DW_TAG_member
    6381                      .dwattr $C$DW$599, DW_AT_type(*$C$DW$T$57)
    6382                      .dwattr $C$DW$599, DW_AT_name("FSM_CheckCond")
    6383                      .dwattr $C$DW$599, DW_AT_TI_symbol_name("_FSM_CheckCond")
    6384                      .dwattr $C$DW$599, DW_AT_data_member_location[DW_OP_plus_uconst 0x14]
    6385                      .dwattr $C$DW$599, DW_AT_accessibility(DW_ACCESS_public)
    6386              
    6387              $C$DW$600       .dwtag  DW_TAG_member
    6388                      .dwattr $C$DW$600, DW_AT_type(*$C$DW$T$21)
    6389                      .dwattr $C$DW$600, DW_AT_name("FSM_CondValue")
    6390                      .dwattr $C$DW$600, DW_AT_TI_symbol_name("_FSM_CondValue")
    6391                      .dwattr $C$DW$600, DW_AT_data_member_location[DW_OP_plus_uconst 0x15]
    6392                      .dwattr $C$DW$600, DW_AT_accessibility(DW_ACCESS_public)
    6393              
    6394              $C$DW$601       .dwtag  DW_TAG_member
    6395                      .dwattr $C$DW$601, DW_AT_type(*$C$DW$T$58)
    6396                      .dwattr $C$DW$601, DW_AT_name("OldAbsPos")
    6397                      .dwattr $C$DW$601, DW_AT_TI_symbol_name("_OldAbsPos")
    6398                      .dwattr $C$DW$601, DW_AT_data_member_location[DW_OP_plus_uconst 0x16]
    6399                      .dwattr $C$DW$601, DW_AT_accessibility(DW_ACCESS_public)
    6400              
    6401              $C$DW$602       .dwtag  DW_TAG_member
    6402                      .dwattr $C$DW$602, DW_AT_type(*$C$DW$T$58)
    6403                      .dwattr $C$DW$602, DW_AT_name("NewAbsPos")
    6404                      .dwattr $C$DW$602, DW_AT_TI_symbol_name("_NewAbsPos")
    6405                      .dwattr $C$DW$602, DW_AT_data_member_location[DW_OP_plus_uconst 0x1a]
    6406                      .dwattr $C$DW$602, DW_AT_accessibility(DW_ACCESS_public)
    6407              
    6408              $C$DW$603       .dwtag  DW_TAG_member
    6409                      .dwattr $C$DW$603, DW_AT_type(*$C$DW$T$59)
    6410                      .dwattr $C$DW$603, DW_AT_name("Flag_485StartMotor")
    6411                      .dwattr $C$DW$603, DW_AT_TI_symbol_name("_Flag_485StartMotor")
    6412                      .dwattr $C$DW$603, DW_AT_data_member_location[DW_OP_plus_uconst 0x1e]
    6413                      .dwattr $C$DW$603, DW_AT_accessibility(DW_ACCESS_public)
    6414              
    6415              $C$DW$604       .dwtag  DW_TAG_member
    6416                      .dwattr $C$DW$604, DW_AT_type(*$C$DW$T$59)
    6417                      .dwattr $C$DW$604, DW_AT_name("Flag_MaxTimeLimit")
    6418                      .dwattr $C$DW$604, DW_AT_TI_symbol_name("_Flag_MaxTimeLimit")
    6419                      .dwattr $C$DW$604, DW_AT_data_member_location[DW_OP_plus_uconst 0x1f]
    6420                      .dwattr $C$DW$604, DW_AT_accessibility(DW_ACCESS_public)
    6421              
    6422              $C$DW$605       .dwtag  DW_TAG_member
    6423                      .dwattr $C$DW$605, DW_AT_type(*$C$DW$T$59)
    6424                      .dwattr $C$DW$605, DW_AT_name("runTime_Enable")
    6425                      .dwattr $C$DW$605, DW_AT_TI_symbol_name("_runTime_Enable")
    6426                      .dwattr $C$DW$605, DW_AT_data_member_location[DW_OP_plus_uconst 0x20]
    6427                      .dwattr $C$DW$605, DW_AT_accessibility(DW_ACCESS_public)
    6428              
    6429              $C$DW$606       .dwtag  DW_TAG_member
    6430                      .dwattr $C$DW$606, DW_AT_type(*$C$DW$T$59)
    6431                      .dwattr $C$DW$606, DW_AT_name("Flag_StallEnable")
TMS320C2000 Assembler PC v15.12.3 Wed Nov 22 00:56:18 2017

Tools Copyright (c) 1996-2015 Texas Instruments Incorporated
C:\Users\wmj\AppData\Local\Temp\0313610                              PAGE  122

    6432                      .dwattr $C$DW$606, DW_AT_TI_symbol_name("_Flag_StallEnable")
    6433                      .dwattr $C$DW$606, DW_AT_data_member_location[DW_OP_plus_uconst 0x21]
    6434                      .dwattr $C$DW$606, DW_AT_accessibility(DW_ACCESS_public)
    6435              
    6436              $C$DW$607       .dwtag  DW_TAG_member
    6437                      .dwattr $C$DW$607, DW_AT_type(*$C$DW$T$59)
    6438                      .dwattr $C$DW$607, DW_AT_name("Flag_ReportState")
    6439                      .dwattr $C$DW$607, DW_AT_TI_symbol_name("_Flag_ReportState")
    6440                      .dwattr $C$DW$607, DW_AT_data_member_location[DW_OP_plus_uconst 0x22]
    6441                      .dwattr $C$DW$607, DW_AT_accessibility(DW_ACCESS_public)
    6442              
    6443              $C$DW$608       .dwtag  DW_TAG_member
    6444                      .dwattr $C$DW$608, DW_AT_type(*$C$DW$T$59)
    6445                      .dwattr $C$DW$608, DW_AT_name("Flag_RunMode")
    6446                      .dwattr $C$DW$608, DW_AT_TI_symbol_name("_Flag_RunMode")
    6447                      .dwattr $C$DW$608, DW_AT_data_member_location[DW_OP_plus_uconst 0x23]
    6448                      .dwattr $C$DW$608, DW_AT_accessibility(DW_ACCESS_public)
    6449              
    6450              $C$DW$609       .dwtag  DW_TAG_member
    6451                      .dwattr $C$DW$609, DW_AT_type(*$C$DW$T$59)
    6452                      .dwattr $C$DW$609, DW_AT_name("Flag_DcBrake")
    6453                      .dwattr $C$DW$609, DW_AT_TI_symbol_name("_Flag_DcBrake")
    6454                      .dwattr $C$DW$609, DW_AT_data_member_location[DW_OP_plus_uconst 0x24]
    6455                      .dwattr $C$DW$609, DW_AT_accessibility(DW_ACCESS_public)
    6456              
    6457                      .dwendtag $C$DW$T$60
    6458              
    6459              $C$DW$T$164     .dwtag  DW_TAG_typedef
    6460                      .dwattr $C$DW$T$164, DW_AT_name("FSM_Obj")
    6461                      .dwattr $C$DW$T$164, DW_AT_type(*$C$DW$T$60)
    6462                      .dwattr $C$DW$T$164, DW_AT_language(DW_LANG_C)
    6463              
    6464              $C$DW$T$165     .dwtag  DW_TAG_pointer_type
    6465                      .dwattr $C$DW$T$165, DW_AT_type(*$C$DW$T$60)
    6466                      .dwattr $C$DW$T$165, DW_AT_address_class(0x20)
    6467              
    6468              $C$DW$T$166     .dwtag  DW_TAG_typedef
    6469                      .dwattr $C$DW$T$166, DW_AT_name("FSM_Handle")
    6470                      .dwattr $C$DW$T$166, DW_AT_type(*$C$DW$T$165)
    6471                      .dwattr $C$DW$T$166, DW_AT_language(DW_LANG_C)
    6472              
    6473              $C$DW$610       .dwtag  DW_TAG_TI_far_type
    6474                      .dwattr $C$DW$610, DW_AT_type(*$C$DW$T$166)
    6475              
    6476              $C$DW$T$167     .dwtag  DW_TAG_const_type
    6477                      .dwattr $C$DW$T$167, DW_AT_type(*$C$DW$610)
    6478              
    6479              
    6480              $C$DW$T$62      .dwtag  DW_TAG_structure_type
    6481                      .dwattr $C$DW$T$62, DW_AT_name("_FSM_Position_t_")
    6482                      .dwattr $C$DW$T$62, DW_AT_byte_size(0x04)
    6483              $C$DW$611       .dwtag  DW_TAG_member
    6484                      .dwattr $C$DW$611, DW_AT_type(*$C$DW$T$61)
    6485                      .dwattr $C$DW$611, DW_AT_name("PosInt_MRev")
    6486                      .dwattr $C$DW$611, DW_AT_TI_symbol_name("_PosInt_MRev")
TMS320C2000 Assembler PC v15.12.3 Wed Nov 22 00:56:18 2017

Tools Copyright (c) 1996-2015 Texas Instruments Incorporated
C:\Users\wmj\AppData\Local\Temp\0313610                              PAGE  123

    6487                      .dwattr $C$DW$611, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    6488                      .dwattr $C$DW$611, DW_AT_accessibility(DW_ACCESS_public)
    6489              
    6490              $C$DW$612       .dwtag  DW_TAG_member
    6491                      .dwattr $C$DW$612, DW_AT_type(*$C$DW$T$37)
    6492                      .dwattr $C$DW$612, DW_AT_name("PosFrac_MRev")
    6493                      .dwattr $C$DW$612, DW_AT_TI_symbol_name("_PosFrac_MRev")
    6494                      .dwattr $C$DW$612, DW_AT_data_member_location[DW_OP_plus_uconst 0x2]
    6495                      .dwattr $C$DW$612, DW_AT_accessibility(DW_ACCESS_public)
    6496              
    6497                      .dwendtag $C$DW$T$62
    6498              
    6499              $C$DW$T$58      .dwtag  DW_TAG_typedef
    6500                      .dwattr $C$DW$T$58, DW_AT_name("FSM_Position_t")
    6501                      .dwattr $C$DW$T$58, DW_AT_type(*$C$DW$T$62)
    6502                      .dwattr $C$DW$T$58, DW_AT_language(DW_LANG_C)
    6503              
    6504              
    6505              $C$DW$T$71      .dwtag  DW_TAG_structure_type
    6506                      .dwattr $C$DW$T$71, DW_AT_name("_FSM_StatePool_t_")
    6507                      .dwattr $C$DW$T$71, DW_AT_byte_size(0x4b)
    6508              $C$DW$613       .dwtag  DW_TAG_member
    6509                      .dwattr $C$DW$613, DW_AT_type(*$C$DW$T$64)
    6510                      .dwattr $C$DW$613, DW_AT_name("FSM_RefSpeed")
    6511                      .dwattr $C$DW$613, DW_AT_TI_symbol_name("_FSM_RefSpeed")
    6512                      .dwattr $C$DW$613, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    6513                      .dwattr $C$DW$613, DW_AT_accessibility(DW_ACCESS_public)
    6514              
    6515              $C$DW$614       .dwtag  DW_TAG_member
    6516                      .dwattr $C$DW$614, DW_AT_type(*$C$DW$T$65)
    6517                      .dwattr $C$DW$614, DW_AT_name("FSM_CondValue")
    6518                      .dwattr $C$DW$614, DW_AT_TI_symbol_name("_FSM_CondValue")
    6519                      .dwattr $C$DW$614, DW_AT_data_member_location[DW_OP_plus_uconst 0xf]
    6520                      .dwattr $C$DW$614, DW_AT_accessibility(DW_ACCESS_public)
    6521              
    6522              $C$DW$615       .dwtag  DW_TAG_member
    6523                      .dwattr $C$DW$615, DW_AT_type(*$C$DW$T$66)
    6524                      .dwattr $C$DW$615, DW_AT_name("FSM_Condition")
    6525                      .dwattr $C$DW$615, DW_AT_TI_symbol_name("_FSM_Condition")
    6526                      .dwattr $C$DW$615, DW_AT_data_member_location[DW_OP_plus_uconst 0x1e]
    6527                      .dwattr $C$DW$615, DW_AT_accessibility(DW_ACCESS_public)
    6528              
    6529              $C$DW$616       .dwtag  DW_TAG_member
    6530                      .dwattr $C$DW$616, DW_AT_type(*$C$DW$T$69)
    6531                      .dwattr $C$DW$616, DW_AT_name("FSM_RunAction")
    6532                      .dwattr $C$DW$616, DW_AT_TI_symbol_name("_FSM_RunAction")
    6533                      .dwattr $C$DW$616, DW_AT_data_member_location[DW_OP_plus_uconst 0x2d]
    6534                      .dwattr $C$DW$616, DW_AT_accessibility(DW_ACCESS_public)
    6535              
    6536              $C$DW$617       .dwtag  DW_TAG_member
    6537                      .dwattr $C$DW$617, DW_AT_type(*$C$DW$T$70)
    6538                      .dwattr $C$DW$617, DW_AT_name("FSM_NextState")
    6539                      .dwattr $C$DW$617, DW_AT_TI_symbol_name("_FSM_NextState")
    6540                      .dwattr $C$DW$617, DW_AT_data_member_location[DW_OP_plus_uconst 0x3c]
    6541                      .dwattr $C$DW$617, DW_AT_accessibility(DW_ACCESS_public)
TMS320C2000 Assembler PC v15.12.3 Wed Nov 22 00:56:18 2017

Tools Copyright (c) 1996-2015 Texas Instruments Incorporated
C:\Users\wmj\AppData\Local\Temp\0313610                              PAGE  124

    6542              
    6543                      .dwendtag $C$DW$T$71
    6544              
    6545              $C$DW$T$173     .dwtag  DW_TAG_typedef
    6546                      .dwattr $C$DW$T$173, DW_AT_name("FSM_StatePool_t")
    6547                      .dwattr $C$DW$T$173, DW_AT_type(*$C$DW$T$71)
    6548                      .dwattr $C$DW$T$173, DW_AT_language(DW_LANG_C)
    6549              
    6550              $C$DW$T$44      .dwtag  DW_TAG_pointer_type
    6551                      .dwattr $C$DW$T$44, DW_AT_type(*$C$DW$T$71)
    6552                      .dwattr $C$DW$T$44, DW_AT_address_class(0x20)
    6553              
    6554              $C$DW$T$45      .dwtag  DW_TAG_typedef
    6555                      .dwattr $C$DW$T$45, DW_AT_name("StPool_Handle")
    6556                      .dwattr $C$DW$T$45, DW_AT_type(*$C$DW$T$44)
    6557                      .dwattr $C$DW$T$45, DW_AT_language(DW_LANG_C)
    6558              
    6559              
    6560              $C$DW$T$72      .dwtag  DW_TAG_structure_type
    6561                      .dwattr $C$DW$T$72, DW_AT_name("_FSM_Vars_t_")
    6562                      .dwattr $C$DW$T$72, DW_AT_byte_size(0x06)
    6563              $C$DW$618       .dwtag  DW_TAG_member
    6564                      .dwattr $C$DW$618, DW_AT_type(*$C$DW$T$16)
    6565                      .dwattr $C$DW$618, DW_AT_name("FSM_RefSpeed")
    6566                      .dwattr $C$DW$618, DW_AT_TI_symbol_name("_FSM_RefSpeed")
    6567                      .dwattr $C$DW$618, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    6568                      .dwattr $C$DW$618, DW_AT_accessibility(DW_ACCESS_public)
    6569              
    6570              $C$DW$619       .dwtag  DW_TAG_member
    6571                      .dwattr $C$DW$619, DW_AT_type(*$C$DW$T$21)
    6572                      .dwattr $C$DW$619, DW_AT_name("FSM_CondValue")
    6573                      .dwattr $C$DW$619, DW_AT_TI_symbol_name("_FSM_CondValue")
    6574                      .dwattr $C$DW$619, DW_AT_data_member_location[DW_OP_plus_uconst 0x2]
    6575                      .dwattr $C$DW$619, DW_AT_accessibility(DW_ACCESS_public)
    6576              
    6577              $C$DW$620       .dwtag  DW_TAG_member
    6578                      .dwattr $C$DW$620, DW_AT_type(*$C$DW$T$57)
    6579                      .dwattr $C$DW$620, DW_AT_name("FSM_Condition")
    6580                      .dwattr $C$DW$620, DW_AT_TI_symbol_name("_FSM_Condition")
    6581                      .dwattr $C$DW$620, DW_AT_data_member_location[DW_OP_plus_uconst 0x3]
    6582                      .dwattr $C$DW$620, DW_AT_accessibility(DW_ACCESS_public)
    6583              
    6584              $C$DW$621       .dwtag  DW_TAG_member
    6585                      .dwattr $C$DW$621, DW_AT_type(*$C$DW$T$68)
    6586                      .dwattr $C$DW$621, DW_AT_name("FSM_RunAction")
    6587                      .dwattr $C$DW$621, DW_AT_TI_symbol_name("_FSM_RunAction")
    6588                      .dwattr $C$DW$621, DW_AT_data_member_location[DW_OP_plus_uconst 0x4]
    6589                      .dwattr $C$DW$621, DW_AT_accessibility(DW_ACCESS_public)
    6590              
    6591              $C$DW$622       .dwtag  DW_TAG_member
    6592                      .dwattr $C$DW$622, DW_AT_type(*$C$DW$T$47)
    6593                      .dwattr $C$DW$622, DW_AT_name("FSM_NextState")
    6594                      .dwattr $C$DW$622, DW_AT_TI_symbol_name("_FSM_NextState")
    6595                      .dwattr $C$DW$622, DW_AT_data_member_location[DW_OP_plus_uconst 0x5]
    6596                      .dwattr $C$DW$622, DW_AT_accessibility(DW_ACCESS_public)
TMS320C2000 Assembler PC v15.12.3 Wed Nov 22 00:56:18 2017

Tools Copyright (c) 1996-2015 Texas Instruments Incorporated
C:\Users\wmj\AppData\Local\Temp\0313610                              PAGE  125

    6597              
    6598                      .dwendtag $C$DW$T$72
    6599              
    6600              $C$DW$T$174     .dwtag  DW_TAG_typedef
    6601                      .dwattr $C$DW$T$174, DW_AT_name("FSM_Vars_t")
    6602                      .dwattr $C$DW$T$174, DW_AT_type(*$C$DW$T$72)
    6603                      .dwattr $C$DW$T$174, DW_AT_language(DW_LANG_C)
    6604              
    6605              $C$DW$623       .dwtag  DW_TAG_TI_far_type
    6606                      .dwattr $C$DW$623, DW_AT_type(*$C$DW$T$174)
    6607              
    6608              $C$DW$T$175     .dwtag  DW_TAG_const_type
    6609                      .dwattr $C$DW$T$175, DW_AT_type(*$C$DW$623)
    6610              
    6611              $C$DW$T$176     .dwtag  DW_TAG_pointer_type
    6612                      .dwattr $C$DW$T$176, DW_AT_type(*$C$DW$T$175)
    6613                      .dwattr $C$DW$T$176, DW_AT_address_class(0x20)
    6614              
    6615              $C$DW$624       .dwtag  DW_TAG_TI_far_type
    6616                      .dwattr $C$DW$624, DW_AT_type(*$C$DW$T$176)
    6617              
    6618              $C$DW$T$177     .dwtag  DW_TAG_const_type
    6619                      .dwattr $C$DW$T$177, DW_AT_type(*$C$DW$624)
    6620              
    6621              
    6622              $C$DW$T$178     .dwtag  DW_TAG_array_type
    6623                      .dwattr $C$DW$T$178, DW_AT_type(*$C$DW$T$175)
    6624                      .dwattr $C$DW$T$178, DW_AT_language(DW_LANG_C)
    6625                      .dwattr $C$DW$T$178, DW_AT_byte_size(0x5a)
    6626              $C$DW$625       .dwtag  DW_TAG_subrange_type
    6627                      .dwattr $C$DW$625, DW_AT_upper_bound(0x0e)
    6628              
    6629                      .dwendtag $C$DW$T$178
    6630              
    6631              
    6632              $C$DW$T$179     .dwtag  DW_TAG_array_type
    6633                      .dwattr $C$DW$T$179, DW_AT_type(*$C$DW$T$175)
    6634                      .dwattr $C$DW$T$179, DW_AT_language(DW_LANG_C)
    6635                      .dwattr $C$DW$T$179, DW_AT_byte_size(0x30)
    6636              $C$DW$626       .dwtag  DW_TAG_subrange_type
    6637                      .dwattr $C$DW$626, DW_AT_upper_bound(0x07)
    6638              
    6639                      .dwendtag $C$DW$T$179
    6640              
    6641              
    6642              $C$DW$T$77      .dwtag  DW_TAG_structure_type
    6643                      .dwattr $C$DW$T$77, DW_AT_name("_GPIO_Obj_")
    6644                      .dwattr $C$DW$T$77, DW_AT_byte_size(0x6a)
    6645              $C$DW$627       .dwtag  DW_TAG_member
    6646                      .dwattr $C$DW$627, DW_AT_type(*$C$DW$T$74)
    6647                      .dwattr $C$DW$627, DW_AT_name("GPACTRL")
    6648                      .dwattr $C$DW$627, DW_AT_TI_symbol_name("_GPACTRL")
    6649                      .dwattr $C$DW$627, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    6650                      .dwattr $C$DW$627, DW_AT_accessibility(DW_ACCESS_public)
    6651              
TMS320C2000 Assembler PC v15.12.3 Wed Nov 22 00:56:18 2017

Tools Copyright (c) 1996-2015 Texas Instruments Incorporated
C:\Users\wmj\AppData\Local\Temp\0313610                              PAGE  126

    6652              $C$DW$628       .dwtag  DW_TAG_member
    6653                      .dwattr $C$DW$628, DW_AT_type(*$C$DW$T$74)
    6654                      .dwattr $C$DW$628, DW_AT_name("GPAQSEL1")
    6655                      .dwattr $C$DW$628, DW_AT_TI_symbol_name("_GPAQSEL1")
    6656                      .dwattr $C$DW$628, DW_AT_data_member_location[DW_OP_plus_uconst 0x2]
    6657                      .dwattr $C$DW$628, DW_AT_accessibility(DW_ACCESS_public)
    6658              
    6659              $C$DW$629       .dwtag  DW_TAG_member
    6660                      .dwattr $C$DW$629, DW_AT_type(*$C$DW$T$74)
    6661                      .dwattr $C$DW$629, DW_AT_name("GPAQSEL2")
    6662                      .dwattr $C$DW$629, DW_AT_TI_symbol_name("_GPAQSEL2")
    6663                      .dwattr $C$DW$629, DW_AT_data_member_location[DW_OP_plus_uconst 0x4]
    6664                      .dwattr $C$DW$629, DW_AT_accessibility(DW_ACCESS_public)
    6665              
    6666              $C$DW$630       .dwtag  DW_TAG_member
    6667                      .dwattr $C$DW$630, DW_AT_type(*$C$DW$T$74)
    6668                      .dwattr $C$DW$630, DW_AT_name("GPAMUX1")
    6669                      .dwattr $C$DW$630, DW_AT_TI_symbol_name("_GPAMUX1")
    6670                      .dwattr $C$DW$630, DW_AT_data_member_location[DW_OP_plus_uconst 0x6]
    6671                      .dwattr $C$DW$630, DW_AT_accessibility(DW_ACCESS_public)
    6672              
    6673              $C$DW$631       .dwtag  DW_TAG_member
    6674                      .dwattr $C$DW$631, DW_AT_type(*$C$DW$T$74)
    6675                      .dwattr $C$DW$631, DW_AT_name("GPAMUX2")
    6676                      .dwattr $C$DW$631, DW_AT_TI_symbol_name("_GPAMUX2")
    6677                      .dwattr $C$DW$631, DW_AT_data_member_location[DW_OP_plus_uconst 0x8]
    6678                      .dwattr $C$DW$631, DW_AT_accessibility(DW_ACCESS_public)
    6679              
    6680              $C$DW$632       .dwtag  DW_TAG_member
    6681                      .dwattr $C$DW$632, DW_AT_type(*$C$DW$T$74)
    6682                      .dwattr $C$DW$632, DW_AT_name("GPADIR")
    6683                      .dwattr $C$DW$632, DW_AT_TI_symbol_name("_GPADIR")
    6684                      .dwattr $C$DW$632, DW_AT_data_member_location[DW_OP_plus_uconst 0xa]
    6685                      .dwattr $C$DW$632, DW_AT_accessibility(DW_ACCESS_public)
    6686              
    6687              $C$DW$633       .dwtag  DW_TAG_member
    6688                      .dwattr $C$DW$633, DW_AT_type(*$C$DW$T$74)
    6689                      .dwattr $C$DW$633, DW_AT_name("GPAPUD")
    6690                      .dwattr $C$DW$633, DW_AT_TI_symbol_name("_GPAPUD")
    6691                      .dwattr $C$DW$633, DW_AT_data_member_location[DW_OP_plus_uconst 0xc]
    6692                      .dwattr $C$DW$633, DW_AT_accessibility(DW_ACCESS_public)
    6693              
    6694              $C$DW$634       .dwtag  DW_TAG_member
    6695                      .dwattr $C$DW$634, DW_AT_type(*$C$DW$T$25)
    6696                      .dwattr $C$DW$634, DW_AT_name("rsvd_1")
    6697                      .dwattr $C$DW$634, DW_AT_TI_symbol_name("_rsvd_1")
    6698                      .dwattr $C$DW$634, DW_AT_data_member_location[DW_OP_plus_uconst 0xe]
    6699                      .dwattr $C$DW$634, DW_AT_accessibility(DW_ACCESS_public)
    6700              
    6701              $C$DW$635       .dwtag  DW_TAG_member
    6702                      .dwattr $C$DW$635, DW_AT_type(*$C$DW$T$74)
    6703                      .dwattr $C$DW$635, DW_AT_name("GPBCTRL")
    6704                      .dwattr $C$DW$635, DW_AT_TI_symbol_name("_GPBCTRL")
    6705                      .dwattr $C$DW$635, DW_AT_data_member_location[DW_OP_plus_uconst 0x10]
    6706                      .dwattr $C$DW$635, DW_AT_accessibility(DW_ACCESS_public)
TMS320C2000 Assembler PC v15.12.3 Wed Nov 22 00:56:18 2017

Tools Copyright (c) 1996-2015 Texas Instruments Incorporated
C:\Users\wmj\AppData\Local\Temp\0313610                              PAGE  127

    6707              
    6708              $C$DW$636       .dwtag  DW_TAG_member
    6709                      .dwattr $C$DW$636, DW_AT_type(*$C$DW$T$74)
    6710                      .dwattr $C$DW$636, DW_AT_name("GPBQSEL1")
    6711                      .dwattr $C$DW$636, DW_AT_TI_symbol_name("_GPBQSEL1")
    6712                      .dwattr $C$DW$636, DW_AT_data_member_location[DW_OP_plus_uconst 0x12]
    6713                      .dwattr $C$DW$636, DW_AT_accessibility(DW_ACCESS_public)
    6714              
    6715              $C$DW$637       .dwtag  DW_TAG_member
    6716                      .dwattr $C$DW$637, DW_AT_type(*$C$DW$T$25)
    6717                      .dwattr $C$DW$637, DW_AT_name("rsvd_2")
    6718                      .dwattr $C$DW$637, DW_AT_TI_symbol_name("_rsvd_2")
    6719                      .dwattr $C$DW$637, DW_AT_data_member_location[DW_OP_plus_uconst 0x14]
    6720                      .dwattr $C$DW$637, DW_AT_accessibility(DW_ACCESS_public)
    6721              
    6722              $C$DW$638       .dwtag  DW_TAG_member
    6723                      .dwattr $C$DW$638, DW_AT_type(*$C$DW$T$74)
    6724                      .dwattr $C$DW$638, DW_AT_name("GPBMUX1")
    6725                      .dwattr $C$DW$638, DW_AT_TI_symbol_name("_GPBMUX1")
    6726                      .dwattr $C$DW$638, DW_AT_data_member_location[DW_OP_plus_uconst 0x16]
    6727                      .dwattr $C$DW$638, DW_AT_accessibility(DW_ACCESS_public)
    6728              
    6729              $C$DW$639       .dwtag  DW_TAG_member
    6730                      .dwattr $C$DW$639, DW_AT_type(*$C$DW$T$25)
    6731                      .dwattr $C$DW$639, DW_AT_name("rsvd_3")
    6732                      .dwattr $C$DW$639, DW_AT_TI_symbol_name("_rsvd_3")
    6733                      .dwattr $C$DW$639, DW_AT_data_member_location[DW_OP_plus_uconst 0x18]
    6734                      .dwattr $C$DW$639, DW_AT_accessibility(DW_ACCESS_public)
    6735              
    6736              $C$DW$640       .dwtag  DW_TAG_member
    6737                      .dwattr $C$DW$640, DW_AT_type(*$C$DW$T$74)
    6738                      .dwattr $C$DW$640, DW_AT_name("GPBDIR")
    6739                      .dwattr $C$DW$640, DW_AT_TI_symbol_name("_GPBDIR")
    6740                      .dwattr $C$DW$640, DW_AT_data_member_location[DW_OP_plus_uconst 0x1a]
    6741                      .dwattr $C$DW$640, DW_AT_accessibility(DW_ACCESS_public)
    6742              
    6743              $C$DW$641       .dwtag  DW_TAG_member
    6744                      .dwattr $C$DW$641, DW_AT_type(*$C$DW$T$74)
    6745                      .dwattr $C$DW$641, DW_AT_name("GPBPUD")
    6746                      .dwattr $C$DW$641, DW_AT_TI_symbol_name("_GPBPUD")
    6747                      .dwattr $C$DW$641, DW_AT_data_member_location[DW_OP_plus_uconst 0x1c]
    6748                      .dwattr $C$DW$641, DW_AT_accessibility(DW_ACCESS_public)
    6749              
    6750              $C$DW$642       .dwtag  DW_TAG_member
    6751                      .dwattr $C$DW$642, DW_AT_type(*$C$DW$T$75)
    6752                      .dwattr $C$DW$642, DW_AT_name("rsvd_4")
    6753                      .dwattr $C$DW$642, DW_AT_TI_symbol_name("_rsvd_4")
    6754                      .dwattr $C$DW$642, DW_AT_data_member_location[DW_OP_plus_uconst 0x1e]
    6755                      .dwattr $C$DW$642, DW_AT_accessibility(DW_ACCESS_public)
    6756              
    6757              $C$DW$643       .dwtag  DW_TAG_member
    6758                      .dwattr $C$DW$643, DW_AT_type(*$C$DW$T$74)
    6759                      .dwattr $C$DW$643, DW_AT_name("AIOMUX1")
    6760                      .dwattr $C$DW$643, DW_AT_TI_symbol_name("_AIOMUX1")
    6761                      .dwattr $C$DW$643, DW_AT_data_member_location[DW_OP_plus_uconst 0x36]
TMS320C2000 Assembler PC v15.12.3 Wed Nov 22 00:56:18 2017

Tools Copyright (c) 1996-2015 Texas Instruments Incorporated
C:\Users\wmj\AppData\Local\Temp\0313610                              PAGE  128

    6762                      .dwattr $C$DW$643, DW_AT_accessibility(DW_ACCESS_public)
    6763              
    6764              $C$DW$644       .dwtag  DW_TAG_member
    6765                      .dwattr $C$DW$644, DW_AT_type(*$C$DW$T$25)
    6766                      .dwattr $C$DW$644, DW_AT_name("rsvd_5")
    6767                      .dwattr $C$DW$644, DW_AT_TI_symbol_name("_rsvd_5")
    6768                      .dwattr $C$DW$644, DW_AT_data_member_location[DW_OP_plus_uconst 0x38]
    6769                      .dwattr $C$DW$644, DW_AT_accessibility(DW_ACCESS_public)
    6770              
    6771              $C$DW$645       .dwtag  DW_TAG_member
    6772                      .dwattr $C$DW$645, DW_AT_type(*$C$DW$T$74)
    6773                      .dwattr $C$DW$645, DW_AT_name("AIODIR")
    6774                      .dwattr $C$DW$645, DW_AT_TI_symbol_name("_AIODIR")
    6775                      .dwattr $C$DW$645, DW_AT_data_member_location[DW_OP_plus_uconst 0x3a]
    6776                      .dwattr $C$DW$645, DW_AT_accessibility(DW_ACCESS_public)
    6777              
    6778              $C$DW$646       .dwtag  DW_TAG_member
    6779                      .dwattr $C$DW$646, DW_AT_type(*$C$DW$T$76)
    6780                      .dwattr $C$DW$646, DW_AT_name("rsvd_6")
    6781                      .dwattr $C$DW$646, DW_AT_TI_symbol_name("_rsvd_6")
    6782                      .dwattr $C$DW$646, DW_AT_data_member_location[DW_OP_plus_uconst 0x3c]
    6783                      .dwattr $C$DW$646, DW_AT_accessibility(DW_ACCESS_public)
    6784              
    6785              $C$DW$647       .dwtag  DW_TAG_member
    6786                      .dwattr $C$DW$647, DW_AT_type(*$C$DW$T$74)
    6787                      .dwattr $C$DW$647, DW_AT_name("GPADAT")
    6788                      .dwattr $C$DW$647, DW_AT_TI_symbol_name("_GPADAT")
    6789                      .dwattr $C$DW$647, DW_AT_data_member_location[DW_OP_plus_uconst 0x40]
    6790                      .dwattr $C$DW$647, DW_AT_accessibility(DW_ACCESS_public)
    6791              
    6792              $C$DW$648       .dwtag  DW_TAG_member
    6793                      .dwattr $C$DW$648, DW_AT_type(*$C$DW$T$74)
    6794                      .dwattr $C$DW$648, DW_AT_name("GPASET")
    6795                      .dwattr $C$DW$648, DW_AT_TI_symbol_name("_GPASET")
    6796                      .dwattr $C$DW$648, DW_AT_data_member_location[DW_OP_plus_uconst 0x42]
    6797                      .dwattr $C$DW$648, DW_AT_accessibility(DW_ACCESS_public)
    6798              
    6799              $C$DW$649       .dwtag  DW_TAG_member
    6800                      .dwattr $C$DW$649, DW_AT_type(*$C$DW$T$74)
    6801                      .dwattr $C$DW$649, DW_AT_name("GPACLEAR")
    6802                      .dwattr $C$DW$649, DW_AT_TI_symbol_name("_GPACLEAR")
    6803                      .dwattr $C$DW$649, DW_AT_data_member_location[DW_OP_plus_uconst 0x44]
    6804                      .dwattr $C$DW$649, DW_AT_accessibility(DW_ACCESS_public)
    6805              
    6806              $C$DW$650       .dwtag  DW_TAG_member
    6807                      .dwattr $C$DW$650, DW_AT_type(*$C$DW$T$74)
    6808                      .dwattr $C$DW$650, DW_AT_name("GPATOGGLE")
    6809                      .dwattr $C$DW$650, DW_AT_TI_symbol_name("_GPATOGGLE")
    6810                      .dwattr $C$DW$650, DW_AT_data_member_location[DW_OP_plus_uconst 0x46]
    6811                      .dwattr $C$DW$650, DW_AT_accessibility(DW_ACCESS_public)
    6812              
    6813              $C$DW$651       .dwtag  DW_TAG_member
    6814                      .dwattr $C$DW$651, DW_AT_type(*$C$DW$T$74)
    6815                      .dwattr $C$DW$651, DW_AT_name("GPBDAT")
    6816                      .dwattr $C$DW$651, DW_AT_TI_symbol_name("_GPBDAT")
TMS320C2000 Assembler PC v15.12.3 Wed Nov 22 00:56:18 2017

Tools Copyright (c) 1996-2015 Texas Instruments Incorporated
C:\Users\wmj\AppData\Local\Temp\0313610                              PAGE  129

    6817                      .dwattr $C$DW$651, DW_AT_data_member_location[DW_OP_plus_uconst 0x48]
    6818                      .dwattr $C$DW$651, DW_AT_accessibility(DW_ACCESS_public)
    6819              
    6820              $C$DW$652       .dwtag  DW_TAG_member
    6821                      .dwattr $C$DW$652, DW_AT_type(*$C$DW$T$74)
    6822                      .dwattr $C$DW$652, DW_AT_name("GPBSET")
    6823                      .dwattr $C$DW$652, DW_AT_TI_symbol_name("_GPBSET")
    6824                      .dwattr $C$DW$652, DW_AT_data_member_location[DW_OP_plus_uconst 0x4a]
    6825                      .dwattr $C$DW$652, DW_AT_accessibility(DW_ACCESS_public)
    6826              
    6827              $C$DW$653       .dwtag  DW_TAG_member
    6828                      .dwattr $C$DW$653, DW_AT_type(*$C$DW$T$74)
    6829                      .dwattr $C$DW$653, DW_AT_name("GPBCLEAR")
    6830                      .dwattr $C$DW$653, DW_AT_TI_symbol_name("_GPBCLEAR")
    6831                      .dwattr $C$DW$653, DW_AT_data_member_location[DW_OP_plus_uconst 0x4c]
    6832                      .dwattr $C$DW$653, DW_AT_accessibility(DW_ACCESS_public)
    6833              
    6834              $C$DW$654       .dwtag  DW_TAG_member
    6835                      .dwattr $C$DW$654, DW_AT_type(*$C$DW$T$74)
    6836                      .dwattr $C$DW$654, DW_AT_name("GPBTOGGLE")
    6837                      .dwattr $C$DW$654, DW_AT_TI_symbol_name("_GPBTOGGLE")
    6838                      .dwattr $C$DW$654, DW_AT_data_member_location[DW_OP_plus_uconst 0x4e]
    6839                      .dwattr $C$DW$654, DW_AT_accessibility(DW_ACCESS_public)
    6840              
    6841              $C$DW$655       .dwtag  DW_TAG_member
    6842                      .dwattr $C$DW$655, DW_AT_type(*$C$DW$T$30)
    6843                      .dwattr $C$DW$655, DW_AT_name("rsvd_7")
    6844                      .dwattr $C$DW$655, DW_AT_TI_symbol_name("_rsvd_7")
    6845                      .dwattr $C$DW$655, DW_AT_data_member_location[DW_OP_plus_uconst 0x50]
    6846                      .dwattr $C$DW$655, DW_AT_accessibility(DW_ACCESS_public)
    6847              
    6848              $C$DW$656       .dwtag  DW_TAG_member
    6849                      .dwattr $C$DW$656, DW_AT_type(*$C$DW$T$74)
    6850                      .dwattr $C$DW$656, DW_AT_name("AIODAT")
    6851                      .dwattr $C$DW$656, DW_AT_TI_symbol_name("_AIODAT")
    6852                      .dwattr $C$DW$656, DW_AT_data_member_location[DW_OP_plus_uconst 0x58]
    6853                      .dwattr $C$DW$656, DW_AT_accessibility(DW_ACCESS_public)
    6854              
    6855              $C$DW$657       .dwtag  DW_TAG_member
    6856                      .dwattr $C$DW$657, DW_AT_type(*$C$DW$T$74)
    6857                      .dwattr $C$DW$657, DW_AT_name("AIOSET")
    6858                      .dwattr $C$DW$657, DW_AT_TI_symbol_name("_AIOSET")
    6859                      .dwattr $C$DW$657, DW_AT_data_member_location[DW_OP_plus_uconst 0x5a]
    6860                      .dwattr $C$DW$657, DW_AT_accessibility(DW_ACCESS_public)
    6861              
    6862              $C$DW$658       .dwtag  DW_TAG_member
    6863                      .dwattr $C$DW$658, DW_AT_type(*$C$DW$T$74)
    6864                      .dwattr $C$DW$658, DW_AT_name("AIOCLEAR")
    6865                      .dwattr $C$DW$658, DW_AT_TI_symbol_name("_AIOCLEAR")
    6866                      .dwattr $C$DW$658, DW_AT_data_member_location[DW_OP_plus_uconst 0x5c]
    6867                      .dwattr $C$DW$658, DW_AT_accessibility(DW_ACCESS_public)
    6868              
    6869              $C$DW$659       .dwtag  DW_TAG_member
    6870                      .dwattr $C$DW$659, DW_AT_type(*$C$DW$T$74)
    6871                      .dwattr $C$DW$659, DW_AT_name("AIOTOGGLE")
TMS320C2000 Assembler PC v15.12.3 Wed Nov 22 00:56:18 2017

Tools Copyright (c) 1996-2015 Texas Instruments Incorporated
C:\Users\wmj\AppData\Local\Temp\0313610                              PAGE  130

    6872                      .dwattr $C$DW$659, DW_AT_TI_symbol_name("_AIOTOGGLE")
    6873                      .dwattr $C$DW$659, DW_AT_data_member_location[DW_OP_plus_uconst 0x5e]
    6874                      .dwattr $C$DW$659, DW_AT_accessibility(DW_ACCESS_public)
    6875              
    6876              $C$DW$660       .dwtag  DW_TAG_member
    6877                      .dwattr $C$DW$660, DW_AT_type(*$C$DW$T$27)
    6878                      .dwattr $C$DW$660, DW_AT_name("GPIOXINTnSEL")
    6879                      .dwattr $C$DW$660, DW_AT_TI_symbol_name("_GPIOXINTnSEL")
    6880                      .dwattr $C$DW$660, DW_AT_data_member_location[DW_OP_plus_uconst 0x60]
    6881                      .dwattr $C$DW$660, DW_AT_accessibility(DW_ACCESS_public)
    6882              
    6883              $C$DW$661       .dwtag  DW_TAG_member
    6884                      .dwattr $C$DW$661, DW_AT_type(*$C$DW$T$26)
    6885                      .dwattr $C$DW$661, DW_AT_name("rsvd_8")
    6886                      .dwattr $C$DW$661, DW_AT_TI_symbol_name("_rsvd_8")
    6887                      .dwattr $C$DW$661, DW_AT_data_member_location[DW_OP_plus_uconst 0x63]
    6888                      .dwattr $C$DW$661, DW_AT_accessibility(DW_ACCESS_public)
    6889              
    6890              $C$DW$662       .dwtag  DW_TAG_member
    6891                      .dwattr $C$DW$662, DW_AT_type(*$C$DW$T$74)
    6892                      .dwattr $C$DW$662, DW_AT_name("GPIOLPMSEL")
    6893                      .dwattr $C$DW$662, DW_AT_TI_symbol_name("_GPIOLPMSEL")
    6894                      .dwattr $C$DW$662, DW_AT_data_member_location[DW_OP_plus_uconst 0x68]
    6895                      .dwattr $C$DW$662, DW_AT_accessibility(DW_ACCESS_public)
    6896              
    6897                      .dwendtag $C$DW$T$77
    6898              
    6899              $C$DW$T$88      .dwtag  DW_TAG_pointer_type
    6900                      .dwattr $C$DW$T$88, DW_AT_type(*$C$DW$T$77)
    6901                      .dwattr $C$DW$T$88, DW_AT_address_class(0x20)
    6902              
    6903              $C$DW$T$89      .dwtag  DW_TAG_typedef
    6904                      .dwattr $C$DW$T$89, DW_AT_name("GPIO_Handle")
    6905                      .dwattr $C$DW$T$89, DW_AT_type(*$C$DW$T$88)
    6906                      .dwattr $C$DW$T$89, DW_AT_language(DW_LANG_C)
    6907              
    6908              
    6909              $C$DW$T$79      .dwtag  DW_TAG_structure_type
    6910                      .dwattr $C$DW$T$79, DW_AT_name("_HAL_AdcData_t_")
    6911                      .dwattr $C$DW$T$79, DW_AT_byte_size(0x16)
    6912              $C$DW$663       .dwtag  DW_TAG_member
    6913                      .dwattr $C$DW$663, DW_AT_type(*$C$DW$T$78)
    6914                      .dwattr $C$DW$663, DW_AT_name("I")
    6915                      .dwattr $C$DW$663, DW_AT_TI_symbol_name("_I")
    6916                      .dwattr $C$DW$663, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    6917                      .dwattr $C$DW$663, DW_AT_accessibility(DW_ACCESS_public)
    6918              
    6919              $C$DW$664       .dwtag  DW_TAG_member
    6920                      .dwattr $C$DW$664, DW_AT_type(*$C$DW$T$78)
    6921                      .dwattr $C$DW$664, DW_AT_name("V")
    6922                      .dwattr $C$DW$664, DW_AT_TI_symbol_name("_V")
    6923                      .dwattr $C$DW$664, DW_AT_data_member_location[DW_OP_plus_uconst 0x6]
    6924                      .dwattr $C$DW$664, DW_AT_accessibility(DW_ACCESS_public)
    6925              
    6926              $C$DW$665       .dwtag  DW_TAG_member
TMS320C2000 Assembler PC v15.12.3 Wed Nov 22 00:56:18 2017

Tools Copyright (c) 1996-2015 Texas Instruments Incorporated
C:\Users\wmj\AppData\Local\Temp\0313610                              PAGE  131

    6927                      .dwattr $C$DW$665, DW_AT_type(*$C$DW$T$37)
    6928                      .dwattr $C$DW$665, DW_AT_name("dcBus")
    6929                      .dwattr $C$DW$665, DW_AT_TI_symbol_name("_dcBus")
    6930                      .dwattr $C$DW$665, DW_AT_data_member_location[DW_OP_plus_uconst 0xc]
    6931                      .dwattr $C$DW$665, DW_AT_accessibility(DW_ACCESS_public)
    6932              
    6933              $C$DW$666       .dwtag  DW_TAG_member
    6934                      .dwattr $C$DW$666, DW_AT_type(*$C$DW$T$37)
    6935                      .dwattr $C$DW$666, DW_AT_name("analogSensor1")
    6936                      .dwattr $C$DW$666, DW_AT_TI_symbol_name("_analogSensor1")
    6937                      .dwattr $C$DW$666, DW_AT_data_member_location[DW_OP_plus_uconst 0xe]
    6938                      .dwattr $C$DW$666, DW_AT_accessibility(DW_ACCESS_public)
    6939              
    6940              $C$DW$667       .dwtag  DW_TAG_member
    6941                      .dwattr $C$DW$667, DW_AT_type(*$C$DW$T$37)
    6942                      .dwattr $C$DW$667, DW_AT_name("analogSensor2")
    6943                      .dwattr $C$DW$667, DW_AT_TI_symbol_name("_analogSensor2")
    6944                      .dwattr $C$DW$667, DW_AT_data_member_location[DW_OP_plus_uconst 0x10]
    6945                      .dwattr $C$DW$667, DW_AT_accessibility(DW_ACCESS_public)
    6946              
    6947              $C$DW$668       .dwtag  DW_TAG_member
    6948                      .dwattr $C$DW$668, DW_AT_type(*$C$DW$T$37)
    6949                      .dwattr $C$DW$668, DW_AT_name("igbtNTC")
    6950                      .dwattr $C$DW$668, DW_AT_TI_symbol_name("_igbtNTC")
    6951                      .dwattr $C$DW$668, DW_AT_data_member_location[DW_OP_plus_uconst 0x12]
    6952                      .dwattr $C$DW$668, DW_AT_accessibility(DW_ACCESS_public)
    6953              
    6954              $C$DW$669       .dwtag  DW_TAG_member
    6955                      .dwattr $C$DW$669, DW_AT_type(*$C$DW$T$37)
    6956                      .dwattr $C$DW$669, DW_AT_name("boardAddr")
    6957                      .dwattr $C$DW$669, DW_AT_TI_symbol_name("_boardAddr")
    6958                      .dwattr $C$DW$669, DW_AT_data_member_location[DW_OP_plus_uconst 0x14]
    6959                      .dwattr $C$DW$669, DW_AT_accessibility(DW_ACCESS_public)
    6960              
    6961                      .dwendtag $C$DW$T$79
    6962              
    6963              $C$DW$T$115     .dwtag  DW_TAG_typedef
    6964                      .dwattr $C$DW$T$115, DW_AT_name("HAL_AdcData_t")
    6965                      .dwattr $C$DW$T$115, DW_AT_type(*$C$DW$T$79)
    6966                      .dwattr $C$DW$T$115, DW_AT_language(DW_LANG_C)
    6967              
    6968              
    6969              $C$DW$T$118     .dwtag  DW_TAG_structure_type
    6970                      .dwattr $C$DW$T$118, DW_AT_name("_HAL_Obj_")
    6971                      .dwattr $C$DW$T$118, DW_AT_byte_size(0xb4)
    6972              $C$DW$670       .dwtag  DW_TAG_member
    6973                      .dwattr $C$DW$670, DW_AT_type(*$C$DW$T$81)
    6974                      .dwattr $C$DW$670, DW_AT_name("adcHandle")
    6975                      .dwattr $C$DW$670, DW_AT_TI_symbol_name("_adcHandle")
    6976                      .dwattr $C$DW$670, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    6977                      .dwattr $C$DW$670, DW_AT_accessibility(DW_ACCESS_public)
    6978              
    6979              $C$DW$671       .dwtag  DW_TAG_member
    6980                      .dwattr $C$DW$671, DW_AT_type(*$C$DW$T$83)
    6981                      .dwattr $C$DW$671, DW_AT_name("clkHandle")
TMS320C2000 Assembler PC v15.12.3 Wed Nov 22 00:56:18 2017

Tools Copyright (c) 1996-2015 Texas Instruments Incorporated
C:\Users\wmj\AppData\Local\Temp\0313610                              PAGE  132

    6982                      .dwattr $C$DW$671, DW_AT_TI_symbol_name("_clkHandle")
    6983                      .dwattr $C$DW$671, DW_AT_data_member_location[DW_OP_plus_uconst 0x2]
    6984                      .dwattr $C$DW$671, DW_AT_accessibility(DW_ACCESS_public)
    6985              
    6986              $C$DW$672       .dwtag  DW_TAG_member
    6987                      .dwattr $C$DW$672, DW_AT_type(*$C$DW$T$85)
    6988                      .dwattr $C$DW$672, DW_AT_name("cpuHandle")
    6989                      .dwattr $C$DW$672, DW_AT_TI_symbol_name("_cpuHandle")
    6990                      .dwattr $C$DW$672, DW_AT_data_member_location[DW_OP_plus_uconst 0x4]
    6991                      .dwattr $C$DW$672, DW_AT_accessibility(DW_ACCESS_public)
    6992              
    6993              $C$DW$673       .dwtag  DW_TAG_member
    6994                      .dwattr $C$DW$673, DW_AT_type(*$C$DW$T$87)
    6995                      .dwattr $C$DW$673, DW_AT_name("flashHandle")
    6996                      .dwattr $C$DW$673, DW_AT_TI_symbol_name("_flashHandle")
    6997                      .dwattr $C$DW$673, DW_AT_data_member_location[DW_OP_plus_uconst 0x6]
    6998                      .dwattr $C$DW$673, DW_AT_accessibility(DW_ACCESS_public)
    6999              
    7000              $C$DW$674       .dwtag  DW_TAG_member
    7001                      .dwattr $C$DW$674, DW_AT_type(*$C$DW$T$89)
    7002                      .dwattr $C$DW$674, DW_AT_name("gpioHandle")
    7003                      .dwattr $C$DW$674, DW_AT_TI_symbol_name("_gpioHandle")
    7004                      .dwattr $C$DW$674, DW_AT_data_member_location[DW_OP_plus_uconst 0x8]
    7005                      .dwattr $C$DW$674, DW_AT_accessibility(DW_ACCESS_public)
    7006              
    7007              $C$DW$675       .dwtag  DW_TAG_member
    7008                      .dwattr $C$DW$675, DW_AT_type(*$C$DW$T$92)
    7009                      .dwattr $C$DW$675, DW_AT_name("offsetHandle_I")
    7010                      .dwattr $C$DW$675, DW_AT_TI_symbol_name("_offsetHandle_I")
    7011                      .dwattr $C$DW$675, DW_AT_data_member_location[DW_OP_plus_uconst 0xa]
    7012                      .dwattr $C$DW$675, DW_AT_accessibility(DW_ACCESS_public)
    7013              
    7014              $C$DW$676       .dwtag  DW_TAG_member
    7015                      .dwattr $C$DW$676, DW_AT_type(*$C$DW$T$94)
    7016                      .dwattr $C$DW$676, DW_AT_name("offset_I")
    7017                      .dwattr $C$DW$676, DW_AT_TI_symbol_name("_offset_I")
    7018                      .dwattr $C$DW$676, DW_AT_data_member_location[DW_OP_plus_uconst 0x10]
    7019                      .dwattr $C$DW$676, DW_AT_accessibility(DW_ACCESS_public)
    7020              
    7021              $C$DW$677       .dwtag  DW_TAG_member
    7022                      .dwattr $C$DW$677, DW_AT_type(*$C$DW$T$92)
    7023                      .dwattr $C$DW$677, DW_AT_name("offsetHandle_V")
    7024                      .dwattr $C$DW$677, DW_AT_TI_symbol_name("_offsetHandle_V")
    7025                      .dwattr $C$DW$677, DW_AT_data_member_location[DW_OP_plus_uconst 0x40]
    7026                      .dwattr $C$DW$677, DW_AT_accessibility(DW_ACCESS_public)
    7027              
    7028              $C$DW$678       .dwtag  DW_TAG_member
    7029                      .dwattr $C$DW$678, DW_AT_type(*$C$DW$T$94)
    7030                      .dwattr $C$DW$678, DW_AT_name("offset_V")
    7031                      .dwattr $C$DW$678, DW_AT_TI_symbol_name("_offset_V")
    7032                      .dwattr $C$DW$678, DW_AT_data_member_location[DW_OP_plus_uconst 0x46]
    7033                      .dwattr $C$DW$678, DW_AT_accessibility(DW_ACCESS_public)
    7034              
    7035              $C$DW$679       .dwtag  DW_TAG_member
    7036                      .dwattr $C$DW$679, DW_AT_type(*$C$DW$T$96)
TMS320C2000 Assembler PC v15.12.3 Wed Nov 22 00:56:18 2017

Tools Copyright (c) 1996-2015 Texas Instruments Incorporated
