TMS320C2000 Assembler PC v6.2.5 Wed Nov 22 09:16:04 2017

Tools Copyright (c) 1996-2014 Texas Instruments Incorporated
C:\Users\wmj\AppData\Local\Temp\0657610                              PAGE    1

       1              ;***************************************************************
       2              ;* TMS320C2000 C/C++ Codegen                         PC v6.2.5 *
       3              ;* Date/Time created: Wed Nov 22 09:16:04 2017                 *
       4              ;***************************************************************
       5                      .compiler_opts --float_support=softlib --hll_source=on --mem_model:code=flat --mem_model:data=large -
       6        0002  FP      .set    XAR2
       7              
       8              $C$DW$CU        .dwtag  DW_TAG_compile_unit
       9                      .dwattr $C$DW$CU, DW_AT_name("D:/BM1000_v1.1/sw/modules/hal/boards/hvkit_rev1p1/f28x/f2802x/src/hal.c
      10                      .dwattr $C$DW$CU, DW_AT_producer("TMS320C2000 C/C++ Codegen PC v6.2.5 Copyright (c) 1996-2014 Texas I
      11                      .dwattr $C$DW$CU, DW_AT_TI_version(0x01)
      12                      .dwattr $C$DW$CU, DW_AT_comp_dir("D:\BM1000_v1.1\sw\solutions\instaspin_foc\boards\hvkit_rev1p1\f28x\
      13              
      14              $C$DW$1 .dwtag  DW_TAG_subprogram, DW_AT_name("TIMER_setEmulationMode")

    9737              $C$DW$1724      .dwtag  DW_TAG_enumerator, DW_AT_name("SCI_CharLength_4_Bits"), DW_AT_const_value(0x03)
    9738              $C$DW$1725      .dwtag  DW_TAG_enumerator, DW_AT_name("SCI_CharLength_5_Bits"), DW_AT_const_value(0x04)
    9739              $C$DW$1726      .dwtag  DW_TAG_enumerator, DW_AT_name("SCI_CharLength_6_Bits"), DW_AT_const_value(0x05)
    9740              $C$DW$1727      .dwtag  DW_TAG_enumerator, DW_AT_name("SCI_CharLength_7_Bits"), DW_AT_const_value(0x06)
    9741              $C$DW$1728      .dwtag  DW_TAG_enumerator, DW_AT_name("SCI_CharLength_8_Bits"), DW_AT_const_value(0x07)
    9742                      .dwendtag $C$DW$T$295
    9743              
    9744              $C$DW$T$296     .dwtag  DW_TAG_typedef, DW_AT_name("SCI_CharLength_e")
    9745                      .dwattr $C$DW$T$296, DW_AT_type(*$C$DW$T$295)
    9746                      .dwattr $C$DW$T$296, DW_AT_language(DW_LANG_C)
    9747              $C$DW$1729      .dwtag  DW_TAG_TI_far_type
    9748                      .dwattr $C$DW$1729, DW_AT_type(*$C$DW$T$296)
    9749              $C$DW$T$297     .dwtag  DW_TAG_const_type
    9750                      .dwattr $C$DW$T$297, DW_AT_type(*$C$DW$1729)
    9751              
    9752              $C$DW$T$298     .dwtag  DW_TAG_enumeration_type
    9753                      .dwattr $C$DW$T$298, DW_AT_byte_size(0x01)
    9754              $C$DW$1730      .dwtag  DW_TAG_enumerator, DW_AT_name("SCI_Mode_IdleLine"), DW_AT_const_value(0x00)
    9755              $C$DW$1731      .dwtag  DW_TAG_enumerator, DW_AT_name("SCI_Mode_AddressBit"), DW_AT_const_value(0x08)
TMS320C2000 Assembler PC v6.2.5 Wed Nov 22 09:16:04 2017

Tools Copyright (c) 1996-2014 Texas Instruments Incorporated
C:\Users\wmj\AppData\Local\Temp\0657610                              PAGE  188

    9756                      .dwendtag $C$DW$T$298
    9757              
    9758              $C$DW$T$299     .dwtag  DW_TAG_typedef, DW_AT_name("SCI_Mode_e")
    9759                      .dwattr $C$DW$T$299, DW_AT_type(*$C$DW$T$298)
    9760                      .dwattr $C$DW$T$299, DW_AT_language(DW_LANG_C)
    9761              $C$DW$1732      .dwtag  DW_TAG_TI_far_type
    9762                      .dwattr $C$DW$1732, DW_AT_type(*$C$DW$T$299)
    9763              $C$DW$T$300     .dwtag  DW_TAG_const_type
    9764                      .dwattr $C$DW$T$300, DW_AT_type(*$C$DW$1732)
    9765              
    9766              $C$DW$T$301     .dwtag  DW_TAG_enumeration_type
    9767                      .dwattr $C$DW$T$301, DW_AT_byte_size(0x01)
    9768              $C$DW$1733      .dwtag  DW_TAG_enumerator, DW_AT_name("SCI_NumStopBits_One"), DW_AT_const_value(0x00)
    9769              $C$DW$1734      .dwtag  DW_TAG_enumerator, DW_AT_name("SCI_NumStopBits_Two"), DW_AT_const_value(0x80)
    9770                      .dwendtag $C$DW$T$301
    9771              
    9772              $C$DW$T$302     .dwtag  DW_TAG_typedef, DW_AT_name("SCI_NumStopBits_e")
    9773                      .dwattr $C$DW$T$302, DW_AT_type(*$C$DW$T$301)
    9774                      .dwattr $C$DW$T$302, DW_AT_language(DW_LANG_C)
    9775              $C$DW$1735      .dwtag  DW_TAG_TI_far_type
    9776                      .dwattr $C$DW$1735, DW_AT_type(*$C$DW$T$302)
    9777              $C$DW$T$303     .dwtag  DW_TAG_const_type
    9778                      .dwattr $C$DW$T$303, DW_AT_type(*$C$DW$1735)
    9779              
    9780              $C$DW$T$304     .dwtag  DW_TAG_enumeration_type
    9781                      .dwattr $C$DW$T$304, DW_AT_byte_size(0x01)
    9782              $C$DW$1736      .dwtag  DW_TAG_enumerator, DW_AT_name("SCI_Parity_Odd"), DW_AT_const_value(0x00)
    9783              $C$DW$1737      .dwtag  DW_TAG_enumerator, DW_AT_name("SCI_Parity_Even"), DW_AT_const_value(0x40)
    9784                      .dwendtag $C$DW$T$304
    9785              
    9786              $C$DW$T$305     .dwtag  DW_TAG_typedef, DW_AT_name("SCI_Parity_e")
    9787                      .dwattr $C$DW$T$305, DW_AT_type(*$C$DW$T$304)
    9788                      .dwattr $C$DW$T$305, DW_AT_language(DW_LANG_C)
    9789              $C$DW$1738      .dwtag  DW_TAG_TI_far_type
    9790                      .dwattr $C$DW$1738, DW_AT_type(*$C$DW$T$305)
    9791              $C$DW$T$306     .dwtag  DW_TAG_const_type
    9792                      .dwattr $C$DW$T$306, DW_AT_type(*$C$DW$1738)
    9793              
    9794              $C$DW$T$307     .dwtag  DW_TAG_enumeration_type
    9795                      .dwattr $C$DW$T$307, DW_AT_byte_size(0x01)
    9796              $C$DW$1739      .dwtag  DW_TAG_enumerator, DW_AT_name("HAL_SensorType_Current"), DW_AT_const_value(0x00)
    9797              $C$DW$1740      .dwtag  DW_TAG_enumerator, DW_AT_name("HAL_SensorType_Voltage"), DW_AT_const_value(0x01)
    9798                      .dwendtag $C$DW$T$307
    9799              
    9800              $C$DW$T$308     .dwtag  DW_TAG_typedef, DW_AT_name("HAL_SensorType_e")
    9801                      .dwattr $C$DW$T$308, DW_AT_type(*$C$DW$T$307)
    9802                      .dwattr $C$DW$T$308, DW_AT_language(DW_LANG_C)
    9803              
    9804              $C$DW$T$29      .dwtag  DW_TAG_structure_type
    9805                      .dwattr $C$DW$T$29, DW_AT_name("_ADC_Obj_")
    9806                      .dwattr $C$DW$T$29, DW_AT_byte_size(0x6650)
    9807              $C$DW$1741      .dwtag  DW_TAG_member
    9808                      .dwattr $C$DW$1741, DW_AT_type(*$C$DW$T$23)
    9809                      .dwattr $C$DW$1741, DW_AT_name("ADCRESULT")
    9810                      .dwattr $C$DW$1741, DW_AT_TI_symbol_name("_ADCRESULT")
TMS320C2000 Assembler PC v6.2.5 Wed Nov 22 09:16:04 2017

Tools Copyright (c) 1996-2014 Texas Instruments Incorporated
C:\Users\wmj\AppData\Local\Temp\0657610                              PAGE  189

    9811                      .dwattr $C$DW$1741, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    9812                      .dwattr $C$DW$1741, DW_AT_accessibility(DW_ACCESS_public)
    9813              $C$DW$1742      .dwtag  DW_TAG_member
    9814                      .dwattr $C$DW$1742, DW_AT_type(*$C$DW$T$24)
    9815                      .dwattr $C$DW$1742, DW_AT_name("resvd_1")
    9816                      .dwattr $C$DW$1742, DW_AT_TI_symbol_name("_resvd_1")
    9817                      .dwattr $C$DW$1742, DW_AT_data_member_location[DW_OP_plus_uconst 0x10]
    9818                      .dwattr $C$DW$1742, DW_AT_accessibility(DW_ACCESS_public)
    9819              $C$DW$1743      .dwtag  DW_TAG_member
    9820                      .dwattr $C$DW$1743, DW_AT_type(*$C$DW$T$22)
    9821                      .dwattr $C$DW$1743, DW_AT_name("ADCCTL1")
    9822                      .dwattr $C$DW$1743, DW_AT_TI_symbol_name("_ADCCTL1")
    9823                      .dwattr $C$DW$1743, DW_AT_data_member_location[DW_OP_plus_uconst 0x6600]
    9824                      .dwattr $C$DW$1743, DW_AT_accessibility(DW_ACCESS_public)
    9825              $C$DW$1744      .dwtag  DW_TAG_member
    9826                      .dwattr $C$DW$1744, DW_AT_type(*$C$DW$T$22)
    9827                      .dwattr $C$DW$1744, DW_AT_name("ADCCTL2")
    9828                      .dwattr $C$DW$1744, DW_AT_TI_symbol_name("_ADCCTL2")
    9829                      .dwattr $C$DW$1744, DW_AT_data_member_location[DW_OP_plus_uconst 0x6601]
    9830                      .dwattr $C$DW$1744, DW_AT_accessibility(DW_ACCESS_public)
    9831              $C$DW$1745      .dwtag  DW_TAG_member
    9832                      .dwattr $C$DW$1745, DW_AT_type(*$C$DW$T$25)
    9833                      .dwattr $C$DW$1745, DW_AT_name("rsvd_2")
    9834                      .dwattr $C$DW$1745, DW_AT_TI_symbol_name("_rsvd_2")
    9835                      .dwattr $C$DW$1745, DW_AT_data_member_location[DW_OP_plus_uconst 0x6602]
    9836                      .dwattr $C$DW$1745, DW_AT_accessibility(DW_ACCESS_public)
    9837              $C$DW$1746      .dwtag  DW_TAG_member
    9838                      .dwattr $C$DW$1746, DW_AT_type(*$C$DW$T$22)
    9839                      .dwattr $C$DW$1746, DW_AT_name("ADCINTFLG")
    9840                      .dwattr $C$DW$1746, DW_AT_TI_symbol_name("_ADCINTFLG")
    9841                      .dwattr $C$DW$1746, DW_AT_data_member_location[DW_OP_plus_uconst 0x6604]
    9842                      .dwattr $C$DW$1746, DW_AT_accessibility(DW_ACCESS_public)
    9843              $C$DW$1747      .dwtag  DW_TAG_member
    9844                      .dwattr $C$DW$1747, DW_AT_type(*$C$DW$T$22)
    9845                      .dwattr $C$DW$1747, DW_AT_name("ADCINTFLGCLR")
    9846                      .dwattr $C$DW$1747, DW_AT_TI_symbol_name("_ADCINTFLGCLR")
    9847                      .dwattr $C$DW$1747, DW_AT_data_member_location[DW_OP_plus_uconst 0x6605]
    9848                      .dwattr $C$DW$1747, DW_AT_accessibility(DW_ACCESS_public)
    9849              $C$DW$1748      .dwtag  DW_TAG_member
    9850                      .dwattr $C$DW$1748, DW_AT_type(*$C$DW$T$22)
    9851                      .dwattr $C$DW$1748, DW_AT_name("ADCINTOVF")
    9852                      .dwattr $C$DW$1748, DW_AT_TI_symbol_name("_ADCINTOVF")
    9853                      .dwattr $C$DW$1748, DW_AT_data_member_location[DW_OP_plus_uconst 0x6606]
    9854                      .dwattr $C$DW$1748, DW_AT_accessibility(DW_ACCESS_public)
    9855              $C$DW$1749      .dwtag  DW_TAG_member
    9856                      .dwattr $C$DW$1749, DW_AT_type(*$C$DW$T$22)
    9857                      .dwattr $C$DW$1749, DW_AT_name("ADCINTOVFCLR")
    9858                      .dwattr $C$DW$1749, DW_AT_TI_symbol_name("_ADCINTOVFCLR")
    9859                      .dwattr $C$DW$1749, DW_AT_data_member_location[DW_OP_plus_uconst 0x6607]
    9860                      .dwattr $C$DW$1749, DW_AT_accessibility(DW_ACCESS_public)
    9861              $C$DW$1750      .dwtag  DW_TAG_member
    9862                      .dwattr $C$DW$1750, DW_AT_type(*$C$DW$T$26)
    9863                      .dwattr $C$DW$1750, DW_AT_name("INTSELxNy")
    9864                      .dwattr $C$DW$1750, DW_AT_TI_symbol_name("_INTSELxNy")
    9865                      .dwattr $C$DW$1750, DW_AT_data_member_location[DW_OP_plus_uconst 0x6608]
TMS320C2000 Assembler PC v6.2.5 Wed Nov 22 09:16:04 2017

Tools Copyright (c) 1996-2014 Texas Instruments Incorporated
C:\Users\wmj\AppData\Local\Temp\0657610                              PAGE  190

    9866                      .dwattr $C$DW$1750, DW_AT_accessibility(DW_ACCESS_public)
    9867              $C$DW$1751      .dwtag  DW_TAG_member
    9868                      .dwattr $C$DW$1751, DW_AT_type(*$C$DW$T$27)
    9869                      .dwattr $C$DW$1751, DW_AT_name("rsvd_3")
    9870                      .dwattr $C$DW$1751, DW_AT_TI_symbol_name("_rsvd_3")
    9871                      .dwattr $C$DW$1751, DW_AT_data_member_location[DW_OP_plus_uconst 0x660d]
    9872                      .dwattr $C$DW$1751, DW_AT_accessibility(DW_ACCESS_public)
    9873              $C$DW$1752      .dwtag  DW_TAG_member
    9874                      .dwattr $C$DW$1752, DW_AT_type(*$C$DW$T$22)
    9875                      .dwattr $C$DW$1752, DW_AT_name("SOCPRICTRL")
    9876                      .dwattr $C$DW$1752, DW_AT_TI_symbol_name("_SOCPRICTRL")
    9877                      .dwattr $C$DW$1752, DW_AT_data_member_location[DW_OP_plus_uconst 0x6610]
    9878                      .dwattr $C$DW$1752, DW_AT_accessibility(DW_ACCESS_public)
    9879              $C$DW$1753      .dwtag  DW_TAG_member
    9880                      .dwattr $C$DW$1753, DW_AT_type(*$C$DW$T$22)
    9881                      .dwattr $C$DW$1753, DW_AT_name("rsvd_4")
    9882                      .dwattr $C$DW$1753, DW_AT_TI_symbol_name("_rsvd_4")
    9883                      .dwattr $C$DW$1753, DW_AT_data_member_location[DW_OP_plus_uconst 0x6611]
    9884                      .dwattr $C$DW$1753, DW_AT_accessibility(DW_ACCESS_public)
    9885              $C$DW$1754      .dwtag  DW_TAG_member
    9886                      .dwattr $C$DW$1754, DW_AT_type(*$C$DW$T$22)
    9887                      .dwattr $C$DW$1754, DW_AT_name("ADCSAMPLEMODE")
    9888                      .dwattr $C$DW$1754, DW_AT_TI_symbol_name("_ADCSAMPLEMODE")
    9889                      .dwattr $C$DW$1754, DW_AT_data_member_location[DW_OP_plus_uconst 0x6612]
    9890                      .dwattr $C$DW$1754, DW_AT_accessibility(DW_ACCESS_public)
    9891              $C$DW$1755      .dwtag  DW_TAG_member
    9892                      .dwattr $C$DW$1755, DW_AT_type(*$C$DW$T$22)
    9893                      .dwattr $C$DW$1755, DW_AT_name("rsvd_5")
    9894                      .dwattr $C$DW$1755, DW_AT_TI_symbol_name("_rsvd_5")
    9895                      .dwattr $C$DW$1755, DW_AT_data_member_location[DW_OP_plus_uconst 0x6613]
    9896                      .dwattr $C$DW$1755, DW_AT_accessibility(DW_ACCESS_public)
    9897              $C$DW$1756      .dwtag  DW_TAG_member
    9898                      .dwattr $C$DW$1756, DW_AT_type(*$C$DW$T$22)
    9899                      .dwattr $C$DW$1756, DW_AT_name("ADCINTSOCSEL1")
    9900                      .dwattr $C$DW$1756, DW_AT_TI_symbol_name("_ADCINTSOCSEL1")
    9901                      .dwattr $C$DW$1756, DW_AT_data_member_location[DW_OP_plus_uconst 0x6614]
    9902                      .dwattr $C$DW$1756, DW_AT_accessibility(DW_ACCESS_public)
    9903              $C$DW$1757      .dwtag  DW_TAG_member
    9904                      .dwattr $C$DW$1757, DW_AT_type(*$C$DW$T$22)
    9905                      .dwattr $C$DW$1757, DW_AT_name("ADCINTSOCSEL2")
    9906                      .dwattr $C$DW$1757, DW_AT_TI_symbol_name("_ADCINTSOCSEL2")
    9907                      .dwattr $C$DW$1757, DW_AT_data_member_location[DW_OP_plus_uconst 0x6615]
    9908                      .dwattr $C$DW$1757, DW_AT_accessibility(DW_ACCESS_public)
    9909              $C$DW$1758      .dwtag  DW_TAG_member
    9910                      .dwattr $C$DW$1758, DW_AT_type(*$C$DW$T$25)
    9911                      .dwattr $C$DW$1758, DW_AT_name("rsvd_6")
    9912                      .dwattr $C$DW$1758, DW_AT_TI_symbol_name("_rsvd_6")
    9913                      .dwattr $C$DW$1758, DW_AT_data_member_location[DW_OP_plus_uconst 0x6616]
    9914                      .dwattr $C$DW$1758, DW_AT_accessibility(DW_ACCESS_public)
    9915              $C$DW$1759      .dwtag  DW_TAG_member
    9916                      .dwattr $C$DW$1759, DW_AT_type(*$C$DW$T$22)
    9917                      .dwattr $C$DW$1759, DW_AT_name("ADCSOCFLG1")
    9918                      .dwattr $C$DW$1759, DW_AT_TI_symbol_name("_ADCSOCFLG1")
    9919                      .dwattr $C$DW$1759, DW_AT_data_member_location[DW_OP_plus_uconst 0x6618]
    9920                      .dwattr $C$DW$1759, DW_AT_accessibility(DW_ACCESS_public)
TMS320C2000 Assembler PC v6.2.5 Wed Nov 22 09:16:04 2017

Tools Copyright (c) 1996-2014 Texas Instruments Incorporated
C:\Users\wmj\AppData\Local\Temp\0657610                              PAGE  191

    9921              $C$DW$1760      .dwtag  DW_TAG_member
    9922                      .dwattr $C$DW$1760, DW_AT_type(*$C$DW$T$22)
    9923                      .dwattr $C$DW$1760, DW_AT_name("rsvd_7")
    9924                      .dwattr $C$DW$1760, DW_AT_TI_symbol_name("_rsvd_7")
    9925                      .dwattr $C$DW$1760, DW_AT_data_member_location[DW_OP_plus_uconst 0x6619]
    9926                      .dwattr $C$DW$1760, DW_AT_accessibility(DW_ACCESS_public)
    9927              $C$DW$1761      .dwtag  DW_TAG_member
    9928                      .dwattr $C$DW$1761, DW_AT_type(*$C$DW$T$22)
    9929                      .dwattr $C$DW$1761, DW_AT_name("ADCSOCFRC1")
    9930                      .dwattr $C$DW$1761, DW_AT_TI_symbol_name("_ADCSOCFRC1")
    9931                      .dwattr $C$DW$1761, DW_AT_data_member_location[DW_OP_plus_uconst 0x661a]
    9932                      .dwattr $C$DW$1761, DW_AT_accessibility(DW_ACCESS_public)
    9933              $C$DW$1762      .dwtag  DW_TAG_member
    9934                      .dwattr $C$DW$1762, DW_AT_type(*$C$DW$T$22)
    9935                      .dwattr $C$DW$1762, DW_AT_name("rsvd_8")
    9936                      .dwattr $C$DW$1762, DW_AT_TI_symbol_name("_rsvd_8")
    9937                      .dwattr $C$DW$1762, DW_AT_data_member_location[DW_OP_plus_uconst 0x661b]
    9938                      .dwattr $C$DW$1762, DW_AT_accessibility(DW_ACCESS_public)
    9939              $C$DW$1763      .dwtag  DW_TAG_member
    9940                      .dwattr $C$DW$1763, DW_AT_type(*$C$DW$T$22)
    9941                      .dwattr $C$DW$1763, DW_AT_name("ADCSOCOVF1")
    9942                      .dwattr $C$DW$1763, DW_AT_TI_symbol_name("_ADCSOCOVF1")
    9943                      .dwattr $C$DW$1763, DW_AT_data_member_location[DW_OP_plus_uconst 0x661c]
    9944                      .dwattr $C$DW$1763, DW_AT_accessibility(DW_ACCESS_public)
    9945              $C$DW$1764      .dwtag  DW_TAG_member
    9946                      .dwattr $C$DW$1764, DW_AT_type(*$C$DW$T$22)
    9947                      .dwattr $C$DW$1764, DW_AT_name("rsvd_9")
    9948                      .dwattr $C$DW$1764, DW_AT_TI_symbol_name("_rsvd_9")
    9949                      .dwattr $C$DW$1764, DW_AT_data_member_location[DW_OP_plus_uconst 0x661d]
    9950                      .dwattr $C$DW$1764, DW_AT_accessibility(DW_ACCESS_public)
    9951              $C$DW$1765      .dwtag  DW_TAG_member
    9952                      .dwattr $C$DW$1765, DW_AT_type(*$C$DW$T$22)
    9953                      .dwattr $C$DW$1765, DW_AT_name("ADCSOCOVFCLR1")
    9954                      .dwattr $C$DW$1765, DW_AT_TI_symbol_name("_ADCSOCOVFCLR1")
    9955                      .dwattr $C$DW$1765, DW_AT_data_member_location[DW_OP_plus_uconst 0x661e]
    9956                      .dwattr $C$DW$1765, DW_AT_accessibility(DW_ACCESS_public)
    9957              $C$DW$1766      .dwtag  DW_TAG_member
    9958                      .dwattr $C$DW$1766, DW_AT_type(*$C$DW$T$22)
    9959                      .dwattr $C$DW$1766, DW_AT_name("rsvd_10")
    9960                      .dwattr $C$DW$1766, DW_AT_TI_symbol_name("_rsvd_10")
    9961                      .dwattr $C$DW$1766, DW_AT_data_member_location[DW_OP_plus_uconst 0x661f]
    9962                      .dwattr $C$DW$1766, DW_AT_accessibility(DW_ACCESS_public)
    9963              $C$DW$1767      .dwtag  DW_TAG_member
    9964                      .dwattr $C$DW$1767, DW_AT_type(*$C$DW$T$23)
    9965                      .dwattr $C$DW$1767, DW_AT_name("ADCSOCxCTL")
    9966                      .dwattr $C$DW$1767, DW_AT_TI_symbol_name("_ADCSOCxCTL")
    9967                      .dwattr $C$DW$1767, DW_AT_data_member_location[DW_OP_plus_uconst 0x6620]
    9968                      .dwattr $C$DW$1767, DW_AT_accessibility(DW_ACCESS_public)
    9969              $C$DW$1768      .dwtag  DW_TAG_member
    9970                      .dwattr $C$DW$1768, DW_AT_type(*$C$DW$T$23)
    9971                      .dwattr $C$DW$1768, DW_AT_name("rsvd_11")
    9972                      .dwattr $C$DW$1768, DW_AT_TI_symbol_name("_rsvd_11")
    9973                      .dwattr $C$DW$1768, DW_AT_data_member_location[DW_OP_plus_uconst 0x6630]
    9974                      .dwattr $C$DW$1768, DW_AT_accessibility(DW_ACCESS_public)
    9975              $C$DW$1769      .dwtag  DW_TAG_member
TMS320C2000 Assembler PC v6.2.5 Wed Nov 22 09:16:04 2017

Tools Copyright (c) 1996-2014 Texas Instruments Incorporated
C:\Users\wmj\AppData\Local\Temp\0657610                              PAGE  192

    9976                      .dwattr $C$DW$1769, DW_AT_type(*$C$DW$T$22)
    9977                      .dwattr $C$DW$1769, DW_AT_name("ADCREFTRIM")
    9978                      .dwattr $C$DW$1769, DW_AT_TI_symbol_name("_ADCREFTRIM")
    9979                      .dwattr $C$DW$1769, DW_AT_data_member_location[DW_OP_plus_uconst 0x6640]
    9980                      .dwattr $C$DW$1769, DW_AT_accessibility(DW_ACCESS_public)
    9981              $C$DW$1770      .dwtag  DW_TAG_member
    9982                      .dwattr $C$DW$1770, DW_AT_type(*$C$DW$T$22)
    9983                      .dwattr $C$DW$1770, DW_AT_name("ADCOFFTRIM")
    9984                      .dwattr $C$DW$1770, DW_AT_TI_symbol_name("_ADCOFFTRIM")
    9985                      .dwattr $C$DW$1770, DW_AT_data_member_location[DW_OP_plus_uconst 0x6641]
    9986                      .dwattr $C$DW$1770, DW_AT_accessibility(DW_ACCESS_public)
    9987              $C$DW$1771      .dwtag  DW_TAG_member
    9988                      .dwattr $C$DW$1771, DW_AT_type(*$C$DW$T$28)
    9989                      .dwattr $C$DW$1771, DW_AT_name("resvd_12")
    9990                      .dwattr $C$DW$1771, DW_AT_TI_symbol_name("_resvd_12")
    9991                      .dwattr $C$DW$1771, DW_AT_data_member_location[DW_OP_plus_uconst 0x6642]
    9992                      .dwattr $C$DW$1771, DW_AT_accessibility(DW_ACCESS_public)
    9993              $C$DW$1772      .dwtag  DW_TAG_member
    9994                      .dwattr $C$DW$1772, DW_AT_type(*$C$DW$T$22)
    9995                      .dwattr $C$DW$1772, DW_AT_name("ADCREV")
    9996                      .dwattr $C$DW$1772, DW_AT_TI_symbol_name("_ADCREV")
    9997                      .dwattr $C$DW$1772, DW_AT_data_member_location[DW_OP_plus_uconst 0x664f]
    9998                      .dwattr $C$DW$1772, DW_AT_accessibility(DW_ACCESS_public)
    9999                      .dwendtag $C$DW$T$29
   10000              
   10001              $C$DW$T$310     .dwtag  DW_TAG_typedef, DW_AT_name("ADC_Obj")
   10002                      .dwattr $C$DW$T$310, DW_AT_type(*$C$DW$T$29)
   10003                      .dwattr $C$DW$T$310, DW_AT_language(DW_LANG_C)
   10004              $C$DW$T$49      .dwtag  DW_TAG_pointer_type
   10005                      .dwattr $C$DW$T$49, DW_AT_type(*$C$DW$T$29)
   10006                      .dwattr $C$DW$T$49, DW_AT_address_class(0x16)
   10007              $C$DW$T$50      .dwtag  DW_TAG_typedef, DW_AT_name("ADC_Handle")
   10008                      .dwattr $C$DW$T$50, DW_AT_type(*$C$DW$T$49)
   10009                      .dwattr $C$DW$T$50, DW_AT_language(DW_LANG_C)
   10010              
   10011              $C$DW$T$31      .dwtag  DW_TAG_structure_type
   10012                      .dwattr $C$DW$T$31, DW_AT_name("_CLK_Obj_")
   10013                      .dwattr $C$DW$T$31, DW_AT_byte_size(0x11)
   10014              $C$DW$1773      .dwtag  DW_TAG_member
   10015                      .dwattr $C$DW$1773, DW_AT_type(*$C$DW$T$22)
   10016                      .dwattr $C$DW$1773, DW_AT_name("XCLK")
   10017                      .dwattr $C$DW$1773, DW_AT_TI_symbol_name("_XCLK")
   10018                      .dwattr $C$DW$1773, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
   10019                      .dwattr $C$DW$1773, DW_AT_accessibility(DW_ACCESS_public)
   10020              $C$DW$1774      .dwtag  DW_TAG_member
   10021                      .dwattr $C$DW$1774, DW_AT_type(*$C$DW$T$22)
   10022                      .dwattr $C$DW$1774, DW_AT_name("rsvd_1")
   10023                      .dwattr $C$DW$1774, DW_AT_TI_symbol_name("_rsvd_1")
   10024                      .dwattr $C$DW$1774, DW_AT_data_member_location[DW_OP_plus_uconst 0x1]
   10025                      .dwattr $C$DW$1774, DW_AT_accessibility(DW_ACCESS_public)
   10026              $C$DW$1775      .dwtag  DW_TAG_member
   10027                      .dwattr $C$DW$1775, DW_AT_type(*$C$DW$T$22)
   10028                      .dwattr $C$DW$1775, DW_AT_name("CLKCTL")
   10029                      .dwattr $C$DW$1775, DW_AT_TI_symbol_name("_CLKCTL")
   10030                      .dwattr $C$DW$1775, DW_AT_data_member_location[DW_OP_plus_uconst 0x2]
TMS320C2000 Assembler PC v6.2.5 Wed Nov 22 09:16:04 2017

Tools Copyright (c) 1996-2014 Texas Instruments Incorporated
C:\Users\wmj\AppData\Local\Temp\0657610                              PAGE  193

   10031                      .dwattr $C$DW$1775, DW_AT_accessibility(DW_ACCESS_public)
   10032              $C$DW$1776      .dwtag  DW_TAG_member
   10033                      .dwattr $C$DW$1776, DW_AT_type(*$C$DW$T$30)
   10034                      .dwattr $C$DW$1776, DW_AT_name("rsvd_2")
   10035                      .dwattr $C$DW$1776, DW_AT_TI_symbol_name("_rsvd_2")
   10036                      .dwattr $C$DW$1776, DW_AT_data_member_location[DW_OP_plus_uconst 0x3]
   10037                      .dwattr $C$DW$1776, DW_AT_accessibility(DW_ACCESS_public)
   10038              $C$DW$1777      .dwtag  DW_TAG_member
   10039                      .dwattr $C$DW$1777, DW_AT_type(*$C$DW$T$22)
   10040                      .dwattr $C$DW$1777, DW_AT_name("LOSPCP")
   10041                      .dwattr $C$DW$1777, DW_AT_TI_symbol_name("_LOSPCP")
   10042                      .dwattr $C$DW$1777, DW_AT_data_member_location[DW_OP_plus_uconst 0xb]
   10043                      .dwattr $C$DW$1777, DW_AT_accessibility(DW_ACCESS_public)
   10044              $C$DW$1778      .dwtag  DW_TAG_member
   10045                      .dwattr $C$DW$1778, DW_AT_type(*$C$DW$T$22)
   10046                      .dwattr $C$DW$1778, DW_AT_name("PCLKCR0")
   10047                      .dwattr $C$DW$1778, DW_AT_TI_symbol_name("_PCLKCR0")
   10048                      .dwattr $C$DW$1778, DW_AT_data_member_location[DW_OP_plus_uconst 0xc]
   10049                      .dwattr $C$DW$1778, DW_AT_accessibility(DW_ACCESS_public)
   10050              $C$DW$1779      .dwtag  DW_TAG_member
   10051                      .dwattr $C$DW$1779, DW_AT_type(*$C$DW$T$22)
   10052                      .dwattr $C$DW$1779, DW_AT_name("PCLKCR1")
   10053                      .dwattr $C$DW$1779, DW_AT_TI_symbol_name("_PCLKCR1")
   10054                      .dwattr $C$DW$1779, DW_AT_data_member_location[DW_OP_plus_uconst 0xd]
   10055                      .dwattr $C$DW$1779, DW_AT_accessibility(DW_ACCESS_public)
   10056              $C$DW$1780      .dwtag  DW_TAG_member
   10057                      .dwattr $C$DW$1780, DW_AT_type(*$C$DW$T$25)
   10058                      .dwattr $C$DW$1780, DW_AT_name("rsvd_3")
   10059                      .dwattr $C$DW$1780, DW_AT_TI_symbol_name("_rsvd_3")
   10060                      .dwattr $C$DW$1780, DW_AT_data_member_location[DW_OP_plus_uconst 0xe]
   10061                      .dwattr $C$DW$1780, DW_AT_accessibility(DW_ACCESS_public)
   10062              $C$DW$1781      .dwtag  DW_TAG_member
   10063                      .dwattr $C$DW$1781, DW_AT_type(*$C$DW$T$22)
   10064                      .dwattr $C$DW$1781, DW_AT_name("PCLKCR3")
   10065                      .dwattr $C$DW$1781, DW_AT_TI_symbol_name("_PCLKCR3")
   10066                      .dwattr $C$DW$1781, DW_AT_data_member_location[DW_OP_plus_uconst 0x10]
   10067                      .dwattr $C$DW$1781, DW_AT_accessibility(DW_ACCESS_public)
   10068                      .dwendtag $C$DW$T$31
   10069              
   10070              $C$DW$T$51      .dwtag  DW_TAG_pointer_type
   10071                      .dwattr $C$DW$T$51, DW_AT_type(*$C$DW$T$31)
   10072                      .dwattr $C$DW$T$51, DW_AT_address_class(0x16)
   10073              $C$DW$T$52      .dwtag  DW_TAG_typedef, DW_AT_name("CLK_Handle")
   10074                      .dwattr $C$DW$T$52, DW_AT_type(*$C$DW$T$51)
   10075                      .dwattr $C$DW$T$52, DW_AT_language(DW_LANG_C)
   10076              
   10077              $C$DW$T$33      .dwtag  DW_TAG_structure_type
   10078                      .dwattr $C$DW$T$33, DW_AT_name("_CPU_Obj_")
   10079                      .dwattr $C$DW$T$33, DW_AT_byte_size(0x01)
   10080              $C$DW$1782      .dwtag  DW_TAG_member
   10081                      .dwattr $C$DW$1782, DW_AT_type(*$C$DW$T$32)
   10082                      .dwattr $C$DW$1782, DW_AT_name("tmp")
   10083                      .dwattr $C$DW$1782, DW_AT_TI_symbol_name("_tmp")
   10084                      .dwattr $C$DW$1782, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
   10085                      .dwattr $C$DW$1782, DW_AT_accessibility(DW_ACCESS_public)
TMS320C2000 Assembler PC v6.2.5 Wed Nov 22 09:16:04 2017

Tools Copyright (c) 1996-2014 Texas Instruments Incorporated
C:\Users\wmj\AppData\Local\Temp\0657610                              PAGE  194

   10086                      .dwendtag $C$DW$T$33
   10087              
   10088              $C$DW$T$319     .dwtag  DW_TAG_typedef, DW_AT_name("CPU_Obj")
   10089                      .dwattr $C$DW$T$319, DW_AT_type(*$C$DW$T$33)
   10090                      .dwattr $C$DW$T$319, DW_AT_language(DW_LANG_C)
   10091              $C$DW$T$53      .dwtag  DW_TAG_pointer_type
   10092                      .dwattr $C$DW$T$53, DW_AT_type(*$C$DW$T$33)
   10093                      .dwattr $C$DW$T$53, DW_AT_address_class(0x16)
   10094              $C$DW$T$54      .dwtag  DW_TAG_typedef, DW_AT_name("CPU_Handle")
   10095                      .dwattr $C$DW$T$54, DW_AT_type(*$C$DW$T$53)
   10096                      .dwattr $C$DW$T$54, DW_AT_language(DW_LANG_C)
   10097              
   10098              $C$DW$T$35      .dwtag  DW_TAG_structure_type
   10099                      .dwattr $C$DW$T$35, DW_AT_name("_FILTER_FO_")
   10100                      .dwattr $C$DW$T$35, DW_AT_byte_size(0x0a)
   10101              $C$DW$1783      .dwtag  DW_TAG_member
   10102                      .dwattr $C$DW$1783, DW_AT_type(*$C$DW$T$34)
   10103                      .dwattr $C$DW$1783, DW_AT_name("a1")
   10104                      .dwattr $C$DW$1783, DW_AT_TI_symbol_name("_a1")
   10105                      .dwattr $C$DW$1783, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
   10106                      .dwattr $C$DW$1783, DW_AT_accessibility(DW_ACCESS_public)
   10107              $C$DW$1784      .dwtag  DW_TAG_member
   10108                      .dwattr $C$DW$1784, DW_AT_type(*$C$DW$T$34)
   10109                      .dwattr $C$DW$1784, DW_AT_name("b0")
   10110                      .dwattr $C$DW$1784, DW_AT_TI_symbol_name("_b0")
   10111                      .dwattr $C$DW$1784, DW_AT_data_member_location[DW_OP_plus_uconst 0x2]
   10112                      .dwattr $C$DW$1784, DW_AT_accessibility(DW_ACCESS_public)
   10113              $C$DW$1785      .dwtag  DW_TAG_member
   10114                      .dwattr $C$DW$1785, DW_AT_type(*$C$DW$T$34)
   10115                      .dwattr $C$DW$1785, DW_AT_name("b1")
   10116                      .dwattr $C$DW$1785, DW_AT_TI_symbol_name("_b1")
   10117                      .dwattr $C$DW$1785, DW_AT_data_member_location[DW_OP_plus_uconst 0x4]
   10118                      .dwattr $C$DW$1785, DW_AT_accessibility(DW_ACCESS_public)
   10119              $C$DW$1786      .dwtag  DW_TAG_member
   10120                      .dwattr $C$DW$1786, DW_AT_type(*$C$DW$T$34)
   10121                      .dwattr $C$DW$1786, DW_AT_name("x1")
   10122                      .dwattr $C$DW$1786, DW_AT_TI_symbol_name("_x1")
   10123                      .dwattr $C$DW$1786, DW_AT_data_member_location[DW_OP_plus_uconst 0x6]
   10124                      .dwattr $C$DW$1786, DW_AT_accessibility(DW_ACCESS_public)
   10125              $C$DW$1787      .dwtag  DW_TAG_member
   10126                      .dwattr $C$DW$1787, DW_AT_type(*$C$DW$T$34)
   10127                      .dwattr $C$DW$1787, DW_AT_name("y1")
   10128                      .dwattr $C$DW$1787, DW_AT_TI_symbol_name("_y1")
   10129                      .dwattr $C$DW$1787, DW_AT_data_member_location[DW_OP_plus_uconst 0x8]
   10130                      .dwattr $C$DW$1787, DW_AT_accessibility(DW_ACCESS_public)
   10131                      .dwendtag $C$DW$T$35
   10132              
   10133              $C$DW$T$90      .dwtag  DW_TAG_typedef, DW_AT_name("FILTER_FO_Obj")
   10134                      .dwattr $C$DW$T$90, DW_AT_type(*$C$DW$T$35)
   10135                      .dwattr $C$DW$T$90, DW_AT_language(DW_LANG_C)
   10136              
   10137              $C$DW$T$19      .dwtag  DW_TAG_structure_type
   10138                      .dwattr $C$DW$T$19, DW_AT_name("_FILTER_FO_Obj_")
   10139                      .dwattr $C$DW$T$19, DW_AT_declaration
   10140                      .dwendtag $C$DW$T$19
TMS320C2000 Assembler PC v6.2.5 Wed Nov 22 09:16:04 2017

Tools Copyright (c) 1996-2014 Texas Instruments Incorporated
C:\Users\wmj\AppData\Local\Temp\0657610                              PAGE  195

   10141              
   10142              $C$DW$T$91      .dwtag  DW_TAG_pointer_type
   10143                      .dwattr $C$DW$T$91, DW_AT_type(*$C$DW$T$19)
   10144                      .dwattr $C$DW$T$91, DW_AT_address_class(0x16)
   10145              $C$DW$T$92      .dwtag  DW_TAG_typedef, DW_AT_name("FILTER_FO_Handle")
   10146                      .dwattr $C$DW$T$92, DW_AT_type(*$C$DW$T$91)
   10147                      .dwattr $C$DW$T$92, DW_AT_language(DW_LANG_C)
   10148              
   10149              $C$DW$T$36      .dwtag  DW_TAG_structure_type
   10150                      .dwattr $C$DW$T$36, DW_AT_name("_FLASH_Obj_")
   10151                      .dwattr $C$DW$T$36, DW_AT_byte_size(0x08)
   10152              $C$DW$1788      .dwtag  DW_TAG_member
   10153                      .dwattr $C$DW$1788, DW_AT_type(*$C$DW$T$22)
   10154                      .dwattr $C$DW$1788, DW_AT_name("FOPT")
   10155                      .dwattr $C$DW$1788, DW_AT_TI_symbol_name("_FOPT")
   10156                      .dwattr $C$DW$1788, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
   10157                      .dwattr $C$DW$1788, DW_AT_accessibility(DW_ACCESS_public)
   10158              $C$DW$1789      .dwtag  DW_TAG_member
   10159                      .dwattr $C$DW$1789, DW_AT_type(*$C$DW$T$22)
   10160                      .dwattr $C$DW$1789, DW_AT_name("rsvd_1")
   10161                      .dwattr $C$DW$1789, DW_AT_TI_symbol_name("_rsvd_1")
   10162                      .dwattr $C$DW$1789, DW_AT_data_member_location[DW_OP_plus_uconst 0x1]
   10163                      .dwattr $C$DW$1789, DW_AT_accessibility(DW_ACCESS_public)
   10164              $C$DW$1790      .dwtag  DW_TAG_member
   10165                      .dwattr $C$DW$1790, DW_AT_type(*$C$DW$T$22)
   10166                      .dwattr $C$DW$1790, DW_AT_name("FPWR")
   10167                      .dwattr $C$DW$1790, DW_AT_TI_symbol_name("_FPWR")
   10168                      .dwattr $C$DW$1790, DW_AT_data_member_location[DW_OP_plus_uconst 0x2]
   10169                      .dwattr $C$DW$1790, DW_AT_accessibility(DW_ACCESS_public)
   10170              $C$DW$1791      .dwtag  DW_TAG_member
   10171                      .dwattr $C$DW$1791, DW_AT_type(*$C$DW$T$22)
   10172                      .dwattr $C$DW$1791, DW_AT_name("FSTATUS")
   10173                      .dwattr $C$DW$1791, DW_AT_TI_symbol_name("_FSTATUS")
   10174                      .dwattr $C$DW$1791, DW_AT_data_member_location[DW_OP_plus_uconst 0x3]
   10175                      .dwattr $C$DW$1791, DW_AT_accessibility(DW_ACCESS_public)
   10176              $C$DW$1792      .dwtag  DW_TAG_member
   10177                      .dwattr $C$DW$1792, DW_AT_type(*$C$DW$T$22)
   10178                      .dwattr $C$DW$1792, DW_AT_name("FSTDBYWAIT")
   10179                      .dwattr $C$DW$1792, DW_AT_TI_symbol_name("_FSTDBYWAIT")
   10180                      .dwattr $C$DW$1792, DW_AT_data_member_location[DW_OP_plus_uconst 0x4]
   10181                      .dwattr $C$DW$1792, DW_AT_accessibility(DW_ACCESS_public)
   10182              $C$DW$1793      .dwtag  DW_TAG_member
   10183                      .dwattr $C$DW$1793, DW_AT_type(*$C$DW$T$22)
   10184                      .dwattr $C$DW$1793, DW_AT_name("FACTIVEWAIT")
   10185                      .dwattr $C$DW$1793, DW_AT_TI_symbol_name("_FACTIVEWAIT")
   10186                      .dwattr $C$DW$1793, DW_AT_data_member_location[DW_OP_plus_uconst 0x5]
   10187                      .dwattr $C$DW$1793, DW_AT_accessibility(DW_ACCESS_public)
   10188              $C$DW$1794      .dwtag  DW_TAG_member
   10189                      .dwattr $C$DW$1794, DW_AT_type(*$C$DW$T$22)
   10190                      .dwattr $C$DW$1794, DW_AT_name("FBANKWAIT")
   10191                      .dwattr $C$DW$1794, DW_AT_TI_symbol_name("_FBANKWAIT")
   10192                      .dwattr $C$DW$1794, DW_AT_data_member_location[DW_OP_plus_uconst 0x6]
   10193                      .dwattr $C$DW$1794, DW_AT_accessibility(DW_ACCESS_public)
   10194              $C$DW$1795      .dwtag  DW_TAG_member
   10195                      .dwattr $C$DW$1795, DW_AT_type(*$C$DW$T$22)
TMS320C2000 Assembler PC v6.2.5 Wed Nov 22 09:16:04 2017

Tools Copyright (c) 1996-2014 Texas Instruments Incorporated
C:\Users\wmj\AppData\Local\Temp\0657610                              PAGE  196

   10196                      .dwattr $C$DW$1795, DW_AT_name("FOTPWAIT")
   10197                      .dwattr $C$DW$1795, DW_AT_TI_symbol_name("_FOTPWAIT")
   10198                      .dwattr $C$DW$1795, DW_AT_data_member_location[DW_OP_plus_uconst 0x7]
   10199                      .dwattr $C$DW$1795, DW_AT_accessibility(DW_ACCESS_public)
   10200                      .dwendtag $C$DW$T$36
   10201              
   10202              $C$DW$T$55      .dwtag  DW_TAG_pointer_type
   10203                      .dwattr $C$DW$T$55, DW_AT_type(*$C$DW$T$36)
   10204                      .dwattr $C$DW$T$55, DW_AT_address_class(0x16)
   10205              $C$DW$T$56      .dwtag  DW_TAG_typedef, DW_AT_name("FLASH_Handle")
   10206                      .dwattr $C$DW$T$56, DW_AT_type(*$C$DW$T$55)
   10207                      .dwattr $C$DW$T$56, DW_AT_language(DW_LANG_C)
   10208              
   10209              $C$DW$T$41      .dwtag  DW_TAG_structure_type
   10210                      .dwattr $C$DW$T$41, DW_AT_name("_GPIO_Obj_")
   10211                      .dwattr $C$DW$T$41, DW_AT_byte_size(0x6a)
   10212              $C$DW$1796      .dwtag  DW_TAG_member
   10213                      .dwattr $C$DW$1796, DW_AT_type(*$C$DW$T$38)
   10214                      .dwattr $C$DW$1796, DW_AT_name("GPACTRL")
   10215                      .dwattr $C$DW$1796, DW_AT_TI_symbol_name("_GPACTRL")
   10216                      .dwattr $C$DW$1796, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
   10217                      .dwattr $C$DW$1796, DW_AT_accessibility(DW_ACCESS_public)
   10218              $C$DW$1797      .dwtag  DW_TAG_member
   10219                      .dwattr $C$DW$1797, DW_AT_type(*$C$DW$T$38)
   10220                      .dwattr $C$DW$1797, DW_AT_name("GPAQSEL1")
   10221                      .dwattr $C$DW$1797, DW_AT_TI_symbol_name("_GPAQSEL1")
   10222                      .dwattr $C$DW$1797, DW_AT_data_member_location[DW_OP_plus_uconst 0x2]
   10223                      .dwattr $C$DW$1797, DW_AT_accessibility(DW_ACCESS_public)
   10224              $C$DW$1798      .dwtag  DW_TAG_member
   10225                      .dwattr $C$DW$1798, DW_AT_type(*$C$DW$T$38)
   10226                      .dwattr $C$DW$1798, DW_AT_name("GPAQSEL2")
   10227                      .dwattr $C$DW$1798, DW_AT_TI_symbol_name("_GPAQSEL2")
   10228                      .dwattr $C$DW$1798, DW_AT_data_member_location[DW_OP_plus_uconst 0x4]
   10229                      .dwattr $C$DW$1798, DW_AT_accessibility(DW_ACCESS_public)
   10230              $C$DW$1799      .dwtag  DW_TAG_member
   10231                      .dwattr $C$DW$1799, DW_AT_type(*$C$DW$T$38)
   10232                      .dwattr $C$DW$1799, DW_AT_name("GPAMUX1")
   10233                      .dwattr $C$DW$1799, DW_AT_TI_symbol_name("_GPAMUX1")
   10234                      .dwattr $C$DW$1799, DW_AT_data_member_location[DW_OP_plus_uconst 0x6]
   10235                      .dwattr $C$DW$1799, DW_AT_accessibility(DW_ACCESS_public)
   10236              $C$DW$1800      .dwtag  DW_TAG_member
   10237                      .dwattr $C$DW$1800, DW_AT_type(*$C$DW$T$38)
   10238                      .dwattr $C$DW$1800, DW_AT_name("GPAMUX2")
   10239                      .dwattr $C$DW$1800, DW_AT_TI_symbol_name("_GPAMUX2")
   10240                      .dwattr $C$DW$1800, DW_AT_data_member_location[DW_OP_plus_uconst 0x8]
   10241                      .dwattr $C$DW$1800, DW_AT_accessibility(DW_ACCESS_public)
   10242              $C$DW$1801      .dwtag  DW_TAG_member
   10243                      .dwattr $C$DW$1801, DW_AT_type(*$C$DW$T$38)
   10244                      .dwattr $C$DW$1801, DW_AT_name("GPADIR")
   10245                      .dwattr $C$DW$1801, DW_AT_TI_symbol_name("_GPADIR")
   10246                      .dwattr $C$DW$1801, DW_AT_data_member_location[DW_OP_plus_uconst 0xa]
   10247                      .dwattr $C$DW$1801, DW_AT_accessibility(DW_ACCESS_public)
   10248              $C$DW$1802      .dwtag  DW_TAG_member
   10249                      .dwattr $C$DW$1802, DW_AT_type(*$C$DW$T$38)
   10250                      .dwattr $C$DW$1802, DW_AT_name("GPAPUD")
TMS320C2000 Assembler PC v6.2.5 Wed Nov 22 09:16:04 2017

Tools Copyright (c) 1996-2014 Texas Instruments Incorporated
C:\Users\wmj\AppData\Local\Temp\0657610                              PAGE  197

   10251                      .dwattr $C$DW$1802, DW_AT_TI_symbol_name("_GPAPUD")
   10252                      .dwattr $C$DW$1802, DW_AT_data_member_location[DW_OP_plus_uconst 0xc]
   10253                      .dwattr $C$DW$1802, DW_AT_accessibility(DW_ACCESS_public)
   10254              $C$DW$1803      .dwtag  DW_TAG_member
   10255                      .dwattr $C$DW$1803, DW_AT_type(*$C$DW$T$25)
   10256                      .dwattr $C$DW$1803, DW_AT_name("rsvd_1")
   10257                      .dwattr $C$DW$1803, DW_AT_TI_symbol_name("_rsvd_1")
   10258                      .dwattr $C$DW$1803, DW_AT_data_member_location[DW_OP_plus_uconst 0xe]
   10259                      .dwattr $C$DW$1803, DW_AT_accessibility(DW_ACCESS_public)
   10260              $C$DW$1804      .dwtag  DW_TAG_member
   10261                      .dwattr $C$DW$1804, DW_AT_type(*$C$DW$T$38)
   10262                      .dwattr $C$DW$1804, DW_AT_name("GPBCTRL")
   10263                      .dwattr $C$DW$1804, DW_AT_TI_symbol_name("_GPBCTRL")
   10264                      .dwattr $C$DW$1804, DW_AT_data_member_location[DW_OP_plus_uconst 0x10]
   10265                      .dwattr $C$DW$1804, DW_AT_accessibility(DW_ACCESS_public)
   10266              $C$DW$1805      .dwtag  DW_TAG_member
   10267                      .dwattr $C$DW$1805, DW_AT_type(*$C$DW$T$38)
   10268                      .dwattr $C$DW$1805, DW_AT_name("GPBQSEL1")
   10269                      .dwattr $C$DW$1805, DW_AT_TI_symbol_name("_GPBQSEL1")
   10270                      .dwattr $C$DW$1805, DW_AT_data_member_location[DW_OP_plus_uconst 0x12]
   10271                      .dwattr $C$DW$1805, DW_AT_accessibility(DW_ACCESS_public)
   10272              $C$DW$1806      .dwtag  DW_TAG_member
   10273                      .dwattr $C$DW$1806, DW_AT_type(*$C$DW$T$25)
   10274                      .dwattr $C$DW$1806, DW_AT_name("rsvd_2")
   10275                      .dwattr $C$DW$1806, DW_AT_TI_symbol_name("_rsvd_2")
   10276                      .dwattr $C$DW$1806, DW_AT_data_member_location[DW_OP_plus_uconst 0x14]
   10277                      .dwattr $C$DW$1806, DW_AT_accessibility(DW_ACCESS_public)
   10278              $C$DW$1807      .dwtag  DW_TAG_member
   10279                      .dwattr $C$DW$1807, DW_AT_type(*$C$DW$T$38)
   10280                      .dwattr $C$DW$1807, DW_AT_name("GPBMUX1")
   10281                      .dwattr $C$DW$1807, DW_AT_TI_symbol_name("_GPBMUX1")
   10282                      .dwattr $C$DW$1807, DW_AT_data_member_location[DW_OP_plus_uconst 0x16]
   10283                      .dwattr $C$DW$1807, DW_AT_accessibility(DW_ACCESS_public)
   10284              $C$DW$1808      .dwtag  DW_TAG_member
   10285                      .dwattr $C$DW$1808, DW_AT_type(*$C$DW$T$25)
   10286                      .dwattr $C$DW$1808, DW_AT_name("rsvd_3")
   10287                      .dwattr $C$DW$1808, DW_AT_TI_symbol_name("_rsvd_3")
   10288                      .dwattr $C$DW$1808, DW_AT_data_member_location[DW_OP_plus_uconst 0x18]
   10289                      .dwattr $C$DW$1808, DW_AT_accessibility(DW_ACCESS_public)
   10290              $C$DW$1809      .dwtag  DW_TAG_member
   10291                      .dwattr $C$DW$1809, DW_AT_type(*$C$DW$T$38)
   10292                      .dwattr $C$DW$1809, DW_AT_name("GPBDIR")
   10293                      .dwattr $C$DW$1809, DW_AT_TI_symbol_name("_GPBDIR")
   10294                      .dwattr $C$DW$1809, DW_AT_data_member_location[DW_OP_plus_uconst 0x1a]
   10295                      .dwattr $C$DW$1809, DW_AT_accessibility(DW_ACCESS_public)
   10296              $C$DW$1810      .dwtag  DW_TAG_member
   10297                      .dwattr $C$DW$1810, DW_AT_type(*$C$DW$T$38)
   10298                      .dwattr $C$DW$1810, DW_AT_name("GPBPUD")
   10299                      .dwattr $C$DW$1810, DW_AT_TI_symbol_name("_GPBPUD")
   10300                      .dwattr $C$DW$1810, DW_AT_data_member_location[DW_OP_plus_uconst 0x1c]
   10301                      .dwattr $C$DW$1810, DW_AT_accessibility(DW_ACCESS_public)
   10302              $C$DW$1811      .dwtag  DW_TAG_member
   10303                      .dwattr $C$DW$1811, DW_AT_type(*$C$DW$T$39)
   10304                      .dwattr $C$DW$1811, DW_AT_name("rsvd_4")
   10305                      .dwattr $C$DW$1811, DW_AT_TI_symbol_name("_rsvd_4")
TMS320C2000 Assembler PC v6.2.5 Wed Nov 22 09:16:04 2017

Tools Copyright (c) 1996-2014 Texas Instruments Incorporated
C:\Users\wmj\AppData\Local\Temp\0657610                              PAGE  198

   10306                      .dwattr $C$DW$1811, DW_AT_data_member_location[DW_OP_plus_uconst 0x1e]
   10307                      .dwattr $C$DW$1811, DW_AT_accessibility(DW_ACCESS_public)
   10308              $C$DW$1812      .dwtag  DW_TAG_member
   10309                      .dwattr $C$DW$1812, DW_AT_type(*$C$DW$T$38)
   10310                      .dwattr $C$DW$1812, DW_AT_name("AIOMUX1")
   10311                      .dwattr $C$DW$1812, DW_AT_TI_symbol_name("_AIOMUX1")
   10312                      .dwattr $C$DW$1812, DW_AT_data_member_location[DW_OP_plus_uconst 0x36]
   10313                      .dwattr $C$DW$1812, DW_AT_accessibility(DW_ACCESS_public)
   10314              $C$DW$1813      .dwtag  DW_TAG_member
   10315                      .dwattr $C$DW$1813, DW_AT_type(*$C$DW$T$25)
   10316                      .dwattr $C$DW$1813, DW_AT_name("rsvd_5")
   10317                      .dwattr $C$DW$1813, DW_AT_TI_symbol_name("_rsvd_5")
   10318                      .dwattr $C$DW$1813, DW_AT_data_member_location[DW_OP_plus_uconst 0x38]
   10319                      .dwattr $C$DW$1813, DW_AT_accessibility(DW_ACCESS_public)
   10320              $C$DW$1814      .dwtag  DW_TAG_member
   10321                      .dwattr $C$DW$1814, DW_AT_type(*$C$DW$T$38)
   10322                      .dwattr $C$DW$1814, DW_AT_name("AIODIR")
   10323                      .dwattr $C$DW$1814, DW_AT_TI_symbol_name("_AIODIR")
   10324                      .dwattr $C$DW$1814, DW_AT_data_member_location[DW_OP_plus_uconst 0x3a]
   10325                      .dwattr $C$DW$1814, DW_AT_accessibility(DW_ACCESS_public)
   10326              $C$DW$1815      .dwtag  DW_TAG_member
   10327                      .dwattr $C$DW$1815, DW_AT_type(*$C$DW$T$40)
   10328                      .dwattr $C$DW$1815, DW_AT_name("rsvd_6")
   10329                      .dwattr $C$DW$1815, DW_AT_TI_symbol_name("_rsvd_6")
   10330                      .dwattr $C$DW$1815, DW_AT_data_member_location[DW_OP_plus_uconst 0x3c]
   10331                      .dwattr $C$DW$1815, DW_AT_accessibility(DW_ACCESS_public)
   10332              $C$DW$1816      .dwtag  DW_TAG_member
   10333                      .dwattr $C$DW$1816, DW_AT_type(*$C$DW$T$38)
   10334                      .dwattr $C$DW$1816, DW_AT_name("GPADAT")
   10335                      .dwattr $C$DW$1816, DW_AT_TI_symbol_name("_GPADAT")
   10336                      .dwattr $C$DW$1816, DW_AT_data_member_location[DW_OP_plus_uconst 0x40]
   10337                      .dwattr $C$DW$1816, DW_AT_accessibility(DW_ACCESS_public)
   10338              $C$DW$1817      .dwtag  DW_TAG_member
   10339                      .dwattr $C$DW$1817, DW_AT_type(*$C$DW$T$38)
   10340                      .dwattr $C$DW$1817, DW_AT_name("GPASET")
   10341                      .dwattr $C$DW$1817, DW_AT_TI_symbol_name("_GPASET")
   10342                      .dwattr $C$DW$1817, DW_AT_data_member_location[DW_OP_plus_uconst 0x42]
   10343                      .dwattr $C$DW$1817, DW_AT_accessibility(DW_ACCESS_public)
   10344              $C$DW$1818      .dwtag  DW_TAG_member
   10345                      .dwattr $C$DW$1818, DW_AT_type(*$C$DW$T$38)
   10346                      .dwattr $C$DW$1818, DW_AT_name("GPACLEAR")
   10347                      .dwattr $C$DW$1818, DW_AT_TI_symbol_name("_GPACLEAR")
   10348                      .dwattr $C$DW$1818, DW_AT_data_member_location[DW_OP_plus_uconst 0x44]
   10349                      .dwattr $C$DW$1818, DW_AT_accessibility(DW_ACCESS_public)
   10350              $C$DW$1819      .dwtag  DW_TAG_member
   10351                      .dwattr $C$DW$1819, DW_AT_type(*$C$DW$T$38)
   10352                      .dwattr $C$DW$1819, DW_AT_name("GPATOGGLE")
   10353                      .dwattr $C$DW$1819, DW_AT_TI_symbol_name("_GPATOGGLE")
   10354                      .dwattr $C$DW$1819, DW_AT_data_member_location[DW_OP_plus_uconst 0x46]
   10355                      .dwattr $C$DW$1819, DW_AT_accessibility(DW_ACCESS_public)
   10356              $C$DW$1820      .dwtag  DW_TAG_member
   10357                      .dwattr $C$DW$1820, DW_AT_type(*$C$DW$T$38)
   10358                      .dwattr $C$DW$1820, DW_AT_name("GPBDAT")
   10359                      .dwattr $C$DW$1820, DW_AT_TI_symbol_name("_GPBDAT")
   10360                      .dwattr $C$DW$1820, DW_AT_data_member_location[DW_OP_plus_uconst 0x48]
TMS320C2000 Assembler PC v6.2.5 Wed Nov 22 09:16:04 2017

Tools Copyright (c) 1996-2014 Texas Instruments Incorporated
C:\Users\wmj\AppData\Local\Temp\0657610                              PAGE  199

   10361                      .dwattr $C$DW$1820, DW_AT_accessibility(DW_ACCESS_public)
   10362              $C$DW$1821      .dwtag  DW_TAG_member
   10363                      .dwattr $C$DW$1821, DW_AT_type(*$C$DW$T$38)
   10364                      .dwattr $C$DW$1821, DW_AT_name("GPBSET")
   10365                      .dwattr $C$DW$1821, DW_AT_TI_symbol_name("_GPBSET")
   10366                      .dwattr $C$DW$1821, DW_AT_data_member_location[DW_OP_plus_uconst 0x4a]
   10367                      .dwattr $C$DW$1821, DW_AT_accessibility(DW_ACCESS_public)
   10368              $C$DW$1822      .dwtag  DW_TAG_member
   10369                      .dwattr $C$DW$1822, DW_AT_type(*$C$DW$T$38)
   10370                      .dwattr $C$DW$1822, DW_AT_name("GPBCLEAR")
   10371                      .dwattr $C$DW$1822, DW_AT_TI_symbol_name("_GPBCLEAR")
   10372                      .dwattr $C$DW$1822, DW_AT_data_member_location[DW_OP_plus_uconst 0x4c]
   10373                      .dwattr $C$DW$1822, DW_AT_accessibility(DW_ACCESS_public)
   10374              $C$DW$1823      .dwtag  DW_TAG_member
   10375                      .dwattr $C$DW$1823, DW_AT_type(*$C$DW$T$38)
   10376                      .dwattr $C$DW$1823, DW_AT_name("GPBTOGGLE")
   10377                      .dwattr $C$DW$1823, DW_AT_TI_symbol_name("_GPBTOGGLE")
   10378                      .dwattr $C$DW$1823, DW_AT_data_member_location[DW_OP_plus_uconst 0x4e]
   10379                      .dwattr $C$DW$1823, DW_AT_accessibility(DW_ACCESS_public)
   10380              $C$DW$1824      .dwtag  DW_TAG_member
   10381                      .dwattr $C$DW$1824, DW_AT_type(*$C$DW$T$30)
   10382                      .dwattr $C$DW$1824, DW_AT_name("rsvd_7")
   10383                      .dwattr $C$DW$1824, DW_AT_TI_symbol_name("_rsvd_7")
   10384                      .dwattr $C$DW$1824, DW_AT_data_member_location[DW_OP_plus_uconst 0x50]
   10385                      .dwattr $C$DW$1824, DW_AT_accessibility(DW_ACCESS_public)
   10386              $C$DW$1825      .dwtag  DW_TAG_member
   10387                      .dwattr $C$DW$1825, DW_AT_type(*$C$DW$T$38)
   10388                      .dwattr $C$DW$1825, DW_AT_name("AIODAT")
   10389                      .dwattr $C$DW$1825, DW_AT_TI_symbol_name("_AIODAT")
   10390                      .dwattr $C$DW$1825, DW_AT_data_member_location[DW_OP_plus_uconst 0x58]
   10391                      .dwattr $C$DW$1825, DW_AT_accessibility(DW_ACCESS_public)
   10392              $C$DW$1826      .dwtag  DW_TAG_member
   10393                      .dwattr $C$DW$1826, DW_AT_type(*$C$DW$T$38)
   10394                      .dwattr $C$DW$1826, DW_AT_name("AIOSET")
   10395                      .dwattr $C$DW$1826, DW_AT_TI_symbol_name("_AIOSET")
   10396                      .dwattr $C$DW$1826, DW_AT_data_member_location[DW_OP_plus_uconst 0x5a]
   10397                      .dwattr $C$DW$1826, DW_AT_accessibility(DW_ACCESS_public)
   10398              $C$DW$1827      .dwtag  DW_TAG_member
   10399                      .dwattr $C$DW$1827, DW_AT_type(*$C$DW$T$38)
   10400                      .dwattr $C$DW$1827, DW_AT_name("AIOCLEAR")
   10401                      .dwattr $C$DW$1827, DW_AT_TI_symbol_name("_AIOCLEAR")
   10402                      .dwattr $C$DW$1827, DW_AT_data_member_location[DW_OP_plus_uconst 0x5c]
   10403                      .dwattr $C$DW$1827, DW_AT_accessibility(DW_ACCESS_public)
   10404              $C$DW$1828      .dwtag  DW_TAG_member
   10405                      .dwattr $C$DW$1828, DW_AT_type(*$C$DW$T$38)
   10406                      .dwattr $C$DW$1828, DW_AT_name("AIOTOGGLE")
   10407                      .dwattr $C$DW$1828, DW_AT_TI_symbol_name("_AIOTOGGLE")
   10408                      .dwattr $C$DW$1828, DW_AT_data_member_location[DW_OP_plus_uconst 0x5e]
   10409                      .dwattr $C$DW$1828, DW_AT_accessibility(DW_ACCESS_public)
   10410              $C$DW$1829      .dwtag  DW_TAG_member
   10411                      .dwattr $C$DW$1829, DW_AT_type(*$C$DW$T$27)
   10412                      .dwattr $C$DW$1829, DW_AT_name("GPIOXINTnSEL")
   10413                      .dwattr $C$DW$1829, DW_AT_TI_symbol_name("_GPIOXINTnSEL")
   10414                      .dwattr $C$DW$1829, DW_AT_data_member_location[DW_OP_plus_uconst 0x60]
   10415                      .dwattr $C$DW$1829, DW_AT_accessibility(DW_ACCESS_public)
TMS320C2000 Assembler PC v6.2.5 Wed Nov 22 09:16:04 2017

Tools Copyright (c) 1996-2014 Texas Instruments Incorporated
C:\Users\wmj\AppData\Local\Temp\0657610                              PAGE  200

   10416              $C$DW$1830      .dwtag  DW_TAG_member
   10417                      .dwattr $C$DW$1830, DW_AT_type(*$C$DW$T$26)
   10418                      .dwattr $C$DW$1830, DW_AT_name("rsvd_8")
   10419                      .dwattr $C$DW$1830, DW_AT_TI_symbol_name("_rsvd_8")
   10420                      .dwattr $C$DW$1830, DW_AT_data_member_location[DW_OP_plus_uconst 0x63]
   10421                      .dwattr $C$DW$1830, DW_AT_accessibility(DW_ACCESS_public)
   10422              $C$DW$1831      .dwtag  DW_TAG_member
   10423                      .dwattr $C$DW$1831, DW_AT_type(*$C$DW$T$38)
   10424                      .dwattr $C$DW$1831, DW_AT_name("GPIOLPMSEL")
   10425                      .dwattr $C$DW$1831, DW_AT_TI_symbol_name("_GPIOLPMSEL")
   10426                      .dwattr $C$DW$1831, DW_AT_data_member_location[DW_OP_plus_uconst 0x68]
   10427                      .dwattr $C$DW$1831, DW_AT_accessibility(DW_ACCESS_public)
   10428                      .dwendtag $C$DW$T$41
   10429              
   10430              $C$DW$T$57      .dwtag  DW_TAG_pointer_type
   10431                      .dwattr $C$DW$T$57, DW_AT_type(*$C$DW$T$41)
   10432                      .dwattr $C$DW$T$57, DW_AT_address_class(0x16)
   10433              $C$DW$T$58      .dwtag  DW_TAG_typedef, DW_AT_name("GPIO_Handle")
   10434                      .dwattr $C$DW$T$58, DW_AT_type(*$C$DW$T$57)
   10435                      .dwattr $C$DW$T$58, DW_AT_language(DW_LANG_C)
   10436              
   10437              $C$DW$T$43      .dwtag  DW_TAG_structure_type
   10438                      .dwattr $C$DW$T$43, DW_AT_name("_HAL_AdcData_t_")
   10439                      .dwattr $C$DW$T$43, DW_AT_byte_size(0x16)
   10440              $C$DW$1832      .dwtag  DW_TAG_member
   10441                      .dwattr $C$DW$1832, DW_AT_type(*$C$DW$T$42)
   10442                      .dwattr $C$DW$1832, DW_AT_name("I")
   10443                      .dwattr $C$DW$1832, DW_AT_TI_symbol_name("_I")
   10444                      .dwattr $C$DW$1832, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
   10445                      .dwattr $C$DW$1832, DW_AT_accessibility(DW_ACCESS_public)
   10446              $C$DW$1833      .dwtag  DW_TAG_member
   10447                      .dwattr $C$DW$1833, DW_AT_type(*$C$DW$T$42)
   10448                      .dwattr $C$DW$1833, DW_AT_name("V")
   10449                      .dwattr $C$DW$1833, DW_AT_TI_symbol_name("_V")
   10450                      .dwattr $C$DW$1833, DW_AT_data_member_location[DW_OP_plus_uconst 0x6]
   10451                      .dwattr $C$DW$1833, DW_AT_accessibility(DW_ACCESS_public)
   10452              $C$DW$1834      .dwtag  DW_TAG_member
   10453                      .dwattr $C$DW$1834, DW_AT_type(*$C$DW$T$34)
   10454                      .dwattr $C$DW$1834, DW_AT_name("dcBus")
   10455                      .dwattr $C$DW$1834, DW_AT_TI_symbol_name("_dcBus")
   10456                      .dwattr $C$DW$1834, DW_AT_data_member_location[DW_OP_plus_uconst 0xc]
   10457                      .dwattr $C$DW$1834, DW_AT_accessibility(DW_ACCESS_public)
   10458              $C$DW$1835      .dwtag  DW_TAG_member
   10459                      .dwattr $C$DW$1835, DW_AT_type(*$C$DW$T$34)
   10460                      .dwattr $C$DW$1835, DW_AT_name("analogSensor1")
   10461                      .dwattr $C$DW$1835, DW_AT_TI_symbol_name("_analogSensor1")
   10462                      .dwattr $C$DW$1835, DW_AT_data_member_location[DW_OP_plus_uconst 0xe]
   10463                      .dwattr $C$DW$1835, DW_AT_accessibility(DW_ACCESS_public)
   10464              $C$DW$1836      .dwtag  DW_TAG_member
   10465                      .dwattr $C$DW$1836, DW_AT_type(*$C$DW$T$34)
   10466                      .dwattr $C$DW$1836, DW_AT_name("analogSensor2")
   10467                      .dwattr $C$DW$1836, DW_AT_TI_symbol_name("_analogSensor2")
   10468                      .dwattr $C$DW$1836, DW_AT_data_member_location[DW_OP_plus_uconst 0x10]
   10469                      .dwattr $C$DW$1836, DW_AT_accessibility(DW_ACCESS_public)
   10470              $C$DW$1837      .dwtag  DW_TAG_member
TMS320C2000 Assembler PC v6.2.5 Wed Nov 22 09:16:04 2017

Tools Copyright (c) 1996-2014 Texas Instruments Incorporated
C:\Users\wmj\AppData\Local\Temp\0657610                              PAGE  201

   10471                      .dwattr $C$DW$1837, DW_AT_type(*$C$DW$T$34)
   10472                      .dwattr $C$DW$1837, DW_AT_name("igbtNTC")
   10473                      .dwattr $C$DW$1837, DW_AT_TI_symbol_name("_igbtNTC")
   10474                      .dwattr $C$DW$1837, DW_AT_data_member_location[DW_OP_plus_uconst 0x12]
   10475                      .dwattr $C$DW$1837, DW_AT_accessibility(DW_ACCESS_public)
   10476              $C$DW$1838      .dwtag  DW_TAG_member
   10477                      .dwattr $C$DW$1838, DW_AT_type(*$C$DW$T$34)
   10478                      .dwattr $C$DW$1838, DW_AT_name("boardAddr")
   10479                      .dwattr $C$DW$1838, DW_AT_TI_symbol_name("_boardAddr")
   10480                      .dwattr $C$DW$1838, DW_AT_data_member_location[DW_OP_plus_uconst 0x14]
   10481                      .dwattr $C$DW$1838, DW_AT_accessibility(DW_ACCESS_public)
   10482                      .dwendtag $C$DW$T$43
   10483              
   10484              $C$DW$T$84      .dwtag  DW_TAG_typedef, DW_AT_name("HAL_AdcData_t")
   10485                      .dwattr $C$DW$T$84, DW_AT_type(*$C$DW$T$43)
   10486                      .dwattr $C$DW$T$84, DW_AT_language(DW_LANG_C)
   10487              
   10488              $C$DW$T$48      .dwtag  DW_TAG_structure_type
   10489                      .dwattr $C$DW$T$48, DW_AT_name("_HAL_DacData_t_")
   10490                      .dwattr $C$DW$T$48, DW_AT_byte_size(0x22)
   10491              $C$DW$1839      .dwtag  DW_TAG_member
   10492                      .dwattr $C$DW$1839, DW_AT_type(*$C$DW$T$21)
   10493                      .dwattr $C$DW$1839, DW_AT_name("PeriodMax")
   10494                      .dwattr $C$DW$1839, DW_AT_TI_symbol_name("_PeriodMax")
   10495                      .dwattr $C$DW$1839, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
   10496                      .dwattr $C$DW$1839, DW_AT_accessibility(DW_ACCESS_public)
   10497              $C$DW$1840      .dwtag  DW_TAG_member
   10498                      .dwattr $C$DW$1840, DW_AT_type(*$C$DW$T$46)
   10499                      .dwattr $C$DW$1840, DW_AT_name("ptrData")
   10500                      .dwattr $C$DW$1840, DW_AT_TI_symbol_name("_ptrData")
   10501                      .dwattr $C$DW$1840, DW_AT_data_member_location[DW_OP_plus_uconst 0x2]
   10502                      .dwattr $C$DW$1840, DW_AT_accessibility(DW_ACCESS_public)
   10503              $C$DW$1841      .dwtag  DW_TAG_member
   10504                      .dwattr $C$DW$1841, DW_AT_type(*$C$DW$T$47)
   10505                      .dwattr $C$DW$1841, DW_AT_name("value")
   10506                      .dwattr $C$DW$1841, DW_AT_TI_symbol_name("_value")
   10507                      .dwattr $C$DW$1841, DW_AT_data_member_location[DW_OP_plus_uconst 0xa]
   10508                      .dwattr $C$DW$1841, DW_AT_accessibility(DW_ACCESS_public)
   10509              $C$DW$1842      .dwtag  DW_TAG_member
   10510                      .dwattr $C$DW$1842, DW_AT_type(*$C$DW$T$47)
   10511                      .dwattr $C$DW$1842, DW_AT_name("offset")
   10512                      .dwattr $C$DW$1842, DW_AT_TI_symbol_name("_offset")
   10513                      .dwattr $C$DW$1842, DW_AT_data_member_location[DW_OP_plus_uconst 0x12]
   10514                      .dwattr $C$DW$1842, DW_AT_accessibility(DW_ACCESS_public)
   10515              $C$DW$1843      .dwtag  DW_TAG_member
   10516                      .dwattr $C$DW$1843, DW_AT_type(*$C$DW$T$47)
   10517                      .dwattr $C$DW$1843, DW_AT_name("gain")
   10518                      .dwattr $C$DW$1843, DW_AT_TI_symbol_name("_gain")
   10519                      .dwattr $C$DW$1843, DW_AT_data_member_location[DW_OP_plus_uconst 0x1a]
   10520                      .dwattr $C$DW$1843, DW_AT_accessibility(DW_ACCESS_public)
   10521                      .dwendtag $C$DW$T$48
   10522              
   10523              $C$DW$T$329     .dwtag  DW_TAG_typedef, DW_AT_name("HAL_DacData_t")
   10524                      .dwattr $C$DW$T$329, DW_AT_type(*$C$DW$T$48)
   10525                      .dwattr $C$DW$T$329, DW_AT_language(DW_LANG_C)
TMS320C2000 Assembler PC v6.2.5 Wed Nov 22 09:16:04 2017

Tools Copyright (c) 1996-2014 Texas Instruments Incorporated
C:\Users\wmj\AppData\Local\Temp\0657610                              PAGE  202

   10526              $C$DW$T$330     .dwtag  DW_TAG_pointer_type
   10527                      .dwattr $C$DW$T$330, DW_AT_type(*$C$DW$T$329)
   10528                      .dwattr $C$DW$T$330, DW_AT_address_class(0x16)
   10529              $C$DW$1844      .dwtag  DW_TAG_TI_far_type
   10530                      .dwattr $C$DW$1844, DW_AT_type(*$C$DW$T$330)
   10531              $C$DW$T$331     .dwtag  DW_TAG_const_type
   10532                      .dwattr $C$DW$T$331, DW_AT_type(*$C$DW$1844)
   10533              
   10534              $C$DW$T$87      .dwtag  DW_TAG_structure_type
   10535                      .dwattr $C$DW$T$87, DW_AT_name("_HAL_Obj_")
   10536                      .dwattr $C$DW$T$87, DW_AT_byte_size(0xb4)
   10537              $C$DW$1845      .dwtag  DW_TAG_member
   10538                      .dwattr $C$DW$1845, DW_AT_type(*$C$DW$T$50)
   10539                      .dwattr $C$DW$1845, DW_AT_name("adcHandle")
   10540                      .dwattr $C$DW$1845, DW_AT_TI_symbol_name("_adcHandle")
   10541                      .dwattr $C$DW$1845, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
   10542                      .dwattr $C$DW$1845, DW_AT_accessibility(DW_ACCESS_public)
   10543              $C$DW$1846      .dwtag  DW_TAG_member
   10544                      .dwattr $C$DW$1846, DW_AT_type(*$C$DW$T$52)
   10545                      .dwattr $C$DW$1846, DW_AT_name("clkHandle")
   10546                      .dwattr $C$DW$1846, DW_AT_TI_symbol_name("_clkHandle")
   10547                      .dwattr $C$DW$1846, DW_AT_data_member_location[DW_OP_plus_uconst 0x2]
   10548                      .dwattr $C$DW$1846, DW_AT_accessibility(DW_ACCESS_public)
   10549              $C$DW$1847      .dwtag  DW_TAG_member
   10550                      .dwattr $C$DW$1847, DW_AT_type(*$C$DW$T$54)
   10551                      .dwattr $C$DW$1847, DW_AT_name("cpuHandle")
   10552                      .dwattr $C$DW$1847, DW_AT_TI_symbol_name("_cpuHandle")
   10553                      .dwattr $C$DW$1847, DW_AT_data_member_location[DW_OP_plus_uconst 0x4]
   10554                      .dwattr $C$DW$1847, DW_AT_accessibility(DW_ACCESS_public)
   10555              $C$DW$1848      .dwtag  DW_TAG_member
   10556                      .dwattr $C$DW$1848, DW_AT_type(*$C$DW$T$56)
   10557                      .dwattr $C$DW$1848, DW_AT_name("flashHandle")
   10558                      .dwattr $C$DW$1848, DW_AT_TI_symbol_name("_flashHandle")
   10559                      .dwattr $C$DW$1848, DW_AT_data_member_location[DW_OP_plus_uconst 0x6]
   10560                      .dwattr $C$DW$1848, DW_AT_accessibility(DW_ACCESS_public)
   10561              $C$DW$1849      .dwtag  DW_TAG_member
   10562                      .dwattr $C$DW$1849, DW_AT_type(*$C$DW$T$58)
   10563                      .dwattr $C$DW$1849, DW_AT_name("gpioHandle")
   10564                      .dwattr $C$DW$1849, DW_AT_TI_symbol_name("_gpioHandle")
   10565                      .dwattr $C$DW$1849, DW_AT_data_member_location[DW_OP_plus_uconst 0x8]
   10566                      .dwattr $C$DW$1849, DW_AT_accessibility(DW_ACCESS_public)
   10567              $C$DW$1850      .dwtag  DW_TAG_member
   10568                      .dwattr $C$DW$1850, DW_AT_type(*$C$DW$T$61)
   10569                      .dwattr $C$DW$1850, DW_AT_name("offsetHandle_I")
   10570                      .dwattr $C$DW$1850, DW_AT_TI_symbol_name("_offsetHandle_I")
   10571                      .dwattr $C$DW$1850, DW_AT_data_member_location[DW_OP_plus_uconst 0xa]
   10572                      .dwattr $C$DW$1850, DW_AT_accessibility(DW_ACCESS_public)
   10573              $C$DW$1851      .dwtag  DW_TAG_member
   10574                      .dwattr $C$DW$1851, DW_AT_type(*$C$DW$T$63)
   10575                      .dwattr $C$DW$1851, DW_AT_name("offset_I")
   10576                      .dwattr $C$DW$1851, DW_AT_TI_symbol_name("_offset_I")
   10577                      .dwattr $C$DW$1851, DW_AT_data_member_location[DW_OP_plus_uconst 0x10]
   10578                      .dwattr $C$DW$1851, DW_AT_accessibility(DW_ACCESS_public)
   10579              $C$DW$1852      .dwtag  DW_TAG_member
   10580                      .dwattr $C$DW$1852, DW_AT_type(*$C$DW$T$61)
TMS320C2000 Assembler PC v6.2.5 Wed Nov 22 09:16:04 2017

Tools Copyright (c) 1996-2014 Texas Instruments Incorporated
C:\Users\wmj\AppData\Local\Temp\0657610                              PAGE  203

   10581                      .dwattr $C$DW$1852, DW_AT_name("offsetHandle_V")
   10582                      .dwattr $C$DW$1852, DW_AT_TI_symbol_name("_offsetHandle_V")
   10583                      .dwattr $C$DW$1852, DW_AT_data_member_location[DW_OP_plus_uconst 0x40]
   10584                      .dwattr $C$DW$1852, DW_AT_accessibility(DW_ACCESS_public)
   10585              $C$DW$1853      .dwtag  DW_TAG_member
   10586                      .dwattr $C$DW$1853, DW_AT_type(*$C$DW$T$63)
   10587                      .dwattr $C$DW$1853, DW_AT_name("offset_V")
   10588                      .dwattr $C$DW$1853, DW_AT_TI_symbol_name("_offset_V")
   10589                      .dwattr $C$DW$1853, DW_AT_data_member_location[DW_OP_plus_uconst 0x46]
   10590                      .dwattr $C$DW$1853, DW_AT_accessibility(DW_ACCESS_public)
   10591              $C$DW$1854      .dwtag  DW_TAG_member
   10592                      .dwattr $C$DW$1854, DW_AT_type(*$C$DW$T$65)
   10593                      .dwattr $C$DW$1854, DW_AT_name("oscHandle")
   10594                      .dwattr $C$DW$1854, DW_AT_TI_symbol_name("_oscHandle")
   10595                      .dwattr $C$DW$1854, DW_AT_data_member_location[DW_OP_plus_uconst 0x76]
   10596                      .dwattr $C$DW$1854, DW_AT_accessibility(DW_ACCESS_public)
   10597              $C$DW$1855      .dwtag  DW_TAG_member
   10598                      .dwattr $C$DW$1855, DW_AT_type(*$C$DW$T$67)
   10599                      .dwattr $C$DW$1855, DW_AT_name("pieHandle")
   10600                      .dwattr $C$DW$1855, DW_AT_TI_symbol_name("_pieHandle")
   10601                      .dwattr $C$DW$1855, DW_AT_data_member_location[DW_OP_plus_uconst 0x78]
   10602                      .dwattr $C$DW$1855, DW_AT_accessibility(DW_ACCESS_public)
   10603              $C$DW$1856      .dwtag  DW_TAG_member
   10604                      .dwattr $C$DW$1856, DW_AT_type(*$C$DW$T$69)
   10605                      .dwattr $C$DW$1856, DW_AT_name("pllHandle")
   10606                      .dwattr $C$DW$1856, DW_AT_TI_symbol_name("_pllHandle")
   10607                      .dwattr $C$DW$1856, DW_AT_data_member_location[DW_OP_plus_uconst 0x7a]
   10608                      .dwattr $C$DW$1856, DW_AT_accessibility(DW_ACCESS_public)
   10609              $C$DW$1857      .dwtag  DW_TAG_member
   10610                      .dwattr $C$DW$1857, DW_AT_type(*$C$DW$T$72)
   10611                      .dwattr $C$DW$1857, DW_AT_name("pwmHandle")
   10612                      .dwattr $C$DW$1857, DW_AT_TI_symbol_name("_pwmHandle")
   10613                      .dwattr $C$DW$1857, DW_AT_data_member_location[DW_OP_plus_uconst 0x7c]
   10614                      .dwattr $C$DW$1857, DW_AT_accessibility(DW_ACCESS_public)
   10615              $C$DW$1858      .dwtag  DW_TAG_member
   10616                      .dwattr $C$DW$1858, DW_AT_type(*$C$DW$T$72)
   10617                      .dwattr $C$DW$1858, DW_AT_name("pwmDacHandle")
   10618                      .dwattr $C$DW$1858, DW_AT_TI_symbol_name("_pwmDacHandle")
   10619                      .dwattr $C$DW$1858, DW_AT_data_member_location[DW_OP_plus_uconst 0x82]
   10620                      .dwattr $C$DW$1858, DW_AT_accessibility(DW_ACCESS_public)
   10621              $C$DW$1859      .dwtag  DW_TAG_member
   10622                      .dwattr $C$DW$1859, DW_AT_type(*$C$DW$T$74)
   10623                      .dwattr $C$DW$1859, DW_AT_name("pwrHandle")
   10624                      .dwattr $C$DW$1859, DW_AT_TI_symbol_name("_pwrHandle")
   10625                      .dwattr $C$DW$1859, DW_AT_data_member_location[DW_OP_plus_uconst 0x88]
   10626                      .dwattr $C$DW$1859, DW_AT_accessibility(DW_ACCESS_public)
   10627              $C$DW$1860      .dwtag  DW_TAG_member
   10628                      .dwattr $C$DW$1860, DW_AT_type(*$C$DW$T$77)
   10629                      .dwattr $C$DW$1860, DW_AT_name("timerHandle")
   10630                      .dwattr $C$DW$1860, DW_AT_TI_symbol_name("_timerHandle")
   10631                      .dwattr $C$DW$1860, DW_AT_data_member_location[DW_OP_plus_uconst 0x8a]
   10632                      .dwattr $C$DW$1860, DW_AT_accessibility(DW_ACCESS_public)
   10633              $C$DW$1861      .dwtag  DW_TAG_member
   10634                      .dwattr $C$DW$1861, DW_AT_type(*$C$DW$T$79)
   10635                      .dwattr $C$DW$1861, DW_AT_name("spiAHandle")
TMS320C2000 Assembler PC v6.2.5 Wed Nov 22 09:16:04 2017

Tools Copyright (c) 1996-2014 Texas Instruments Incorporated
C:\Users\wmj\AppData\Local\Temp\0657610                              PAGE  204

   10636                      .dwattr $C$DW$1861, DW_AT_TI_symbol_name("_spiAHandle")
   10637                      .dwattr $C$DW$1861, DW_AT_data_member_location[DW_OP_plus_uconst 0x90]
   10638                      .dwattr $C$DW$1861, DW_AT_accessibility(DW_ACCESS_public)
   10639              $C$DW$1862      .dwtag  DW_TAG_member
   10640                      .dwattr $C$DW$1862, DW_AT_type(*$C$DW$T$81)
   10641                      .dwattr $C$DW$1862, DW_AT_name("wdogHandle")
   10642                      .dwattr $C$DW$1862, DW_AT_TI_symbol_name("_wdogHandle")
   10643                      .dwattr $C$DW$1862, DW_AT_data_member_location[DW_OP_plus_uconst 0x92]
   10644                      .dwattr $C$DW$1862, DW_AT_accessibility(DW_ACCESS_public)
   10645              $C$DW$1863      .dwtag  DW_TAG_member
   10646                      .dwattr $C$DW$1863, DW_AT_type(*$C$DW$T$83)
   10647                      .dwattr $C$DW$1863, DW_AT_name("sciHandle")
   10648                      .dwattr $C$DW$1863, DW_AT_TI_symbol_name("_sciHandle")
   10649                      .dwattr $C$DW$1863, DW_AT_data_member_location[DW_OP_plus_uconst 0x94]
   10650                      .dwattr $C$DW$1863, DW_AT_accessibility(DW_ACCESS_public)
   10651              $C$DW$1864      .dwtag  DW_TAG_member
   10652                      .dwattr $C$DW$1864, DW_AT_type(*$C$DW$T$84)
   10653                      .dwattr $C$DW$1864, DW_AT_name("adcBias")
   10654                      .dwattr $C$DW$1864, DW_AT_TI_symbol_name("_adcBias")
   10655                      .dwattr $C$DW$1864, DW_AT_data_member_location[DW_OP_plus_uconst 0x96]
   10656                      .dwattr $C$DW$1864, DW_AT_accessibility(DW_ACCESS_public)
   10657              $C$DW$1865      .dwtag  DW_TAG_member
   10658                      .dwattr $C$DW$1865, DW_AT_type(*$C$DW$T$34)
   10659                      .dwattr $C$DW$1865, DW_AT_name("current_sf")
   10660                      .dwattr $C$DW$1865, DW_AT_TI_symbol_name("_current_sf")
   10661                      .dwattr $C$DW$1865, DW_AT_data_member_location[DW_OP_plus_uconst 0xac]
   10662                      .dwattr $C$DW$1865, DW_AT_accessibility(DW_ACCESS_public)
   10663              $C$DW$1866      .dwtag  DW_TAG_member
   10664                      .dwattr $C$DW$1866, DW_AT_type(*$C$DW$T$34)
   10665                      .dwattr $C$DW$1866, DW_AT_name("voltage_sf")
   10666                      .dwattr $C$DW$1866, DW_AT_TI_symbol_name("_voltage_sf")
   10667                      .dwattr $C$DW$1866, DW_AT_data_member_location[DW_OP_plus_uconst 0xae]
   10668                      .dwattr $C$DW$1866, DW_AT_accessibility(DW_ACCESS_public)
   10669              $C$DW$1867      .dwtag  DW_TAG_member
   10670                      .dwattr $C$DW$1867, DW_AT_type(*$C$DW$T$32)
   10671                      .dwattr $C$DW$1867, DW_AT_name("numCurrentSensors")
   10672                      .dwattr $C$DW$1867, DW_AT_TI_symbol_name("_numCurrentSensors")
   10673                      .dwattr $C$DW$1867, DW_AT_data_member_location[DW_OP_plus_uconst 0xb0]
   10674                      .dwattr $C$DW$1867, DW_AT_accessibility(DW_ACCESS_public)
   10675              $C$DW$1868      .dwtag  DW_TAG_member
   10676                      .dwattr $C$DW$1868, DW_AT_type(*$C$DW$T$32)
   10677                      .dwattr $C$DW$1868, DW_AT_name("numVoltageSensors")
   10678                      .dwattr $C$DW$1868, DW_AT_TI_symbol_name("_numVoltageSensors")
   10679                      .dwattr $C$DW$1868, DW_AT_data_member_location[DW_OP_plus_uconst 0xb1]
   10680                      .dwattr $C$DW$1868, DW_AT_accessibility(DW_ACCESS_public)
   10681              $C$DW$1869      .dwtag  DW_TAG_member
   10682                      .dwattr $C$DW$1869, DW_AT_type(*$C$DW$T$86)
   10683                      .dwattr $C$DW$1869, DW_AT_name("boardAddress")
   10684                      .dwattr $C$DW$1869, DW_AT_TI_symbol_name("_boardAddress")
   10685                      .dwattr $C$DW$1869, DW_AT_data_member_location[DW_OP_plus_uconst 0xb2]
   10686                      .dwattr $C$DW$1869, DW_AT_accessibility(DW_ACCESS_public)
   10687                      .dwendtag $C$DW$T$87
   10688              
   10689              $C$DW$T$334     .dwtag  DW_TAG_typedef, DW_AT_name("HAL_Obj")
   10690                      .dwattr $C$DW$T$334, DW_AT_type(*$C$DW$T$87)
TMS320C2000 Assembler PC v6.2.5 Wed Nov 22 09:16:04 2017

Tools Copyright (c) 1996-2014 Texas Instruments Incorporated
C:\Users\wmj\AppData\Local\Temp\0657610                              PAGE  205

   10691                      .dwattr $C$DW$T$334, DW_AT_language(DW_LANG_C)
   10692              $C$DW$T$335     .dwtag  DW_TAG_pointer_type
   10693                      .dwattr $C$DW$T$335, DW_AT_type(*$C$DW$T$334)
   10694                      .dwattr $C$DW$T$335, DW_AT_address_class(0x16)
   10695              $C$DW$T$336     .dwtag  DW_TAG_pointer_type
   10696                      .dwattr $C$DW$T$336, DW_AT_type(*$C$DW$T$87)
   10697                      .dwattr $C$DW$T$336, DW_AT_address_class(0x16)
   10698              $C$DW$T$337     .dwtag  DW_TAG_typedef, DW_AT_name("HAL_Handle")
   10699                      .dwattr $C$DW$T$337, DW_AT_type(*$C$DW$T$336)
   10700                      .dwattr $C$DW$T$337, DW_AT_language(DW_LANG_C)
   10701              $C$DW$1870      .dwtag  DW_TAG_TI_far_type
   10702                      .dwattr $C$DW$1870, DW_AT_type(*$C$DW$T$337)
   10703              $C$DW$T$338     .dwtag  DW_TAG_const_type
   10704                      .dwattr $C$DW$T$338, DW_AT_type(*$C$DW$1870)
   10705              
   10706              $C$DW$T$89      .dwtag  DW_TAG_structure_type
   10707                      .dwattr $C$DW$T$89, DW_AT_name("_MATH_vec3_")
   10708                      .dwattr $C$DW$T$89, DW_AT_byte_size(0x06)
   10709              $C$DW$1871      .dwtag  DW_TAG_member
   10710                      .dwattr $C$DW$1871, DW_AT_type(*$C$DW$T$88)
   10711                      .dwattr $C$DW$1871, DW_AT_name("value")
   10712                      .dwattr $C$DW$1871, DW_AT_TI_symbol_name("_value")
   10713                      .dwattr $C$DW$1871, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
   10714                      .dwattr $C$DW$1871, DW_AT_accessibility(DW_ACCESS_public)
   10715                      .dwendtag $C$DW$T$89
   10716              
   10717              $C$DW$T$42      .dwtag  DW_TAG_typedef, DW_AT_name("MATH_vec3")
   10718                      .dwattr $C$DW$T$42, DW_AT_type(*$C$DW$T$89)
   10719                      .dwattr $C$DW$T$42, DW_AT_language(DW_LANG_C)
   10720              
   10721              $C$DW$T$93      .dwtag  DW_TAG_structure_type
   10722                      .dwattr $C$DW$T$93, DW_AT_name("_OFFSET_")
   10723                      .dwattr $C$DW$T$93, DW_AT_byte_size(0x10)
   10724              $C$DW$1872      .dwtag  DW_TAG_member
   10725                      .dwattr $C$DW$1872, DW_AT_type(*$C$DW$T$34)
   10726                      .dwattr $C$DW$1872, DW_AT_name("value")
   10727                      .dwattr $C$DW$1872, DW_AT_TI_symbol_name("_value")
   10728                      .dwattr $C$DW$1872, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
   10729                      .dwattr $C$DW$1872, DW_AT_accessibility(DW_ACCESS_public)
   10730              $C$DW$1873      .dwtag  DW_TAG_member
   10731                      .dwattr $C$DW$1873, DW_AT_type(*$C$DW$T$34)
   10732                      .dwattr $C$DW$1873, DW_AT_name("bias")
   10733                      .dwattr $C$DW$1873, DW_AT_TI_symbol_name("_bias")
   10734                      .dwattr $C$DW$1873, DW_AT_data_member_location[DW_OP_plus_uconst 0x2]
   10735                      .dwattr $C$DW$1873, DW_AT_accessibility(DW_ACCESS_public)
   10736              $C$DW$1874      .dwtag  DW_TAG_member
   10737                      .dwattr $C$DW$1874, DW_AT_type(*$C$DW$T$90)
   10738                      .dwattr $C$DW$1874, DW_AT_name("filter")
   10739                      .dwattr $C$DW$1874, DW_AT_TI_symbol_name("_filter")
   10740                      .dwattr $C$DW$1874, DW_AT_data_member_location[DW_OP_plus_uconst 0x4]
   10741                      .dwattr $C$DW$1874, DW_AT_accessibility(DW_ACCESS_public)
   10742              $C$DW$1875      .dwtag  DW_TAG_member
   10743                      .dwattr $C$DW$1875, DW_AT_type(*$C$DW$T$92)
   10744                      .dwattr $C$DW$1875, DW_AT_name("filterHandle")
   10745                      .dwattr $C$DW$1875, DW_AT_TI_symbol_name("_filterHandle")
TMS320C2000 Assembler PC v6.2.5 Wed Nov 22 09:16:04 2017

Tools Copyright (c) 1996-2014 Texas Instruments Incorporated
C:\Users\wmj\AppData\Local\Temp\0657610                              PAGE  206

   10746                      .dwattr $C$DW$1875, DW_AT_data_member_location[DW_OP_plus_uconst 0xe]
   10747                      .dwattr $C$DW$1875, DW_AT_accessibility(DW_ACCESS_public)
   10748                      .dwendtag $C$DW$T$93
   10749              
   10750              $C$DW$T$62      .dwtag  DW_TAG_typedef, DW_AT_name("OFFSET_Obj")
   10751                      .dwattr $C$DW$T$62, DW_AT_type(*$C$DW$T$93)
   10752                      .dwattr $C$DW$T$62, DW_AT_language(DW_LANG_C)
   10753              
   10754              $C$DW$T$63      .dwtag  DW_TAG_array_type
   10755                      .dwattr $C$DW$T$63, DW_AT_type(*$C$DW$T$62)
   10756                      .dwattr $C$DW$T$63, DW_AT_language(DW_LANG_C)
   10757                      .dwattr $C$DW$T$63, DW_AT_byte_size(0x30)
   10758              $C$DW$1876      .dwtag  DW_TAG_subrange_type
   10759                      .dwattr $C$DW$1876, DW_AT_upper_bound(0x02)
   10760                      .dwendtag $C$DW$T$63
   10761              
   10762              
   10763              $C$DW$T$20      .dwtag  DW_TAG_structure_type
   10764                      .dwattr $C$DW$T$20, DW_AT_name("_OFFSET_Obj_")
   10765                      .dwattr $C$DW$T$20, DW_AT_declaration
   10766                      .dwendtag $C$DW$T$20
   10767              
   10768              $C$DW$T$59      .dwtag  DW_TAG_pointer_type
   10769                      .dwattr $C$DW$T$59, DW_AT_type(*$C$DW$T$20)
   10770                      .dwattr $C$DW$T$59, DW_AT_address_class(0x16)
   10771              $C$DW$T$60      .dwtag  DW_TAG_typedef, DW_AT_name("OFFSET_Handle")
   10772                      .dwattr $C$DW$T$60, DW_AT_type(*$C$DW$T$59)
   10773                      .dwattr $C$DW$T$60, DW_AT_language(DW_LANG_C)
   10774              
   10775              $C$DW$T$61      .dwtag  DW_TAG_array_type
   10776                      .dwattr $C$DW$T$61, DW_AT_type(*$C$DW$T$60)
   10777                      .dwattr $C$DW$T$61, DW_AT_language(DW_LANG_C)
   10778                      .dwattr $C$DW$T$61, DW_AT_byte_size(0x06)
   10779              $C$DW$1877      .dwtag  DW_TAG_subrange_type
   10780                      .dwattr $C$DW$1877, DW_AT_upper_bound(0x02)
   10781                      .dwendtag $C$DW$T$61
   10782              
   10783              
   10784              $C$DW$T$94      .dwtag  DW_TAG_structure_type
   10785                      .dwattr $C$DW$T$94, DW_AT_name("_OSC_Obj_")
   10786                      .dwattr $C$DW$T$94, DW_AT_byte_size(0x03)
   10787              $C$DW$1878      .dwtag  DW_TAG_member
   10788                      .dwattr $C$DW$1878, DW_AT_type(*$C$DW$T$22)
   10789                      .dwattr $C$DW$1878, DW_AT_name("INTOSC1TRIM")
   10790                      .dwattr $C$DW$1878, DW_AT_TI_symbol_name("_INTOSC1TRIM")
   10791                      .dwattr $C$DW$1878, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
   10792                      .dwattr $C$DW$1878, DW_AT_accessibility(DW_ACCESS_public)
   10793              $C$DW$1879      .dwtag  DW_TAG_member
   10794                      .dwattr $C$DW$1879, DW_AT_type(*$C$DW$T$22)
   10795                      .dwattr $C$DW$1879, DW_AT_name("rsvd_1")
   10796                      .dwattr $C$DW$1879, DW_AT_TI_symbol_name("_rsvd_1")
   10797                      .dwattr $C$DW$1879, DW_AT_data_member_location[DW_OP_plus_uconst 0x1]
   10798                      .dwattr $C$DW$1879, DW_AT_accessibility(DW_ACCESS_public)
   10799              $C$DW$1880      .dwtag  DW_TAG_member
   10800                      .dwattr $C$DW$1880, DW_AT_type(*$C$DW$T$22)
TMS320C2000 Assembler PC v6.2.5 Wed Nov 22 09:16:04 2017

Tools Copyright (c) 1996-2014 Texas Instruments Incorporated
C:\Users\wmj\AppData\Local\Temp\0657610                              PAGE  207

   10801                      .dwattr $C$DW$1880, DW_AT_name("INTOSC2TRIM")
   10802                      .dwattr $C$DW$1880, DW_AT_TI_symbol_name("_INTOSC2TRIM")
   10803                      .dwattr $C$DW$1880, DW_AT_data_member_location[DW_OP_plus_uconst 0x2]
   10804                      .dwattr $C$DW$1880, DW_AT_accessibility(DW_ACCESS_public)
   10805                      .dwendtag $C$DW$T$94
   10806              
   10807              $C$DW$T$64      .dwtag  DW_TAG_pointer_type
   10808                      .dwattr $C$DW$T$64, DW_AT_type(*$C$DW$T$94)
   10809                      .dwattr $C$DW$T$64, DW_AT_address_class(0x16)
   10810              $C$DW$T$65      .dwtag  DW_TAG_typedef, DW_AT_name("OSC_Handle")
   10811                      .dwattr $C$DW$T$65, DW_AT_type(*$C$DW$T$64)
   10812                      .dwattr $C$DW$T$65, DW_AT_language(DW_LANG_C)
   10813              
   10814              $C$DW$T$95      .dwtag  DW_TAG_structure_type
   10815                      .dwattr $C$DW$T$95, DW_AT_name("_PIE_IERIFR_t")
   10816                      .dwattr $C$DW$T$95, DW_AT_byte_size(0x02)
   10817              $C$DW$1881      .dwtag  DW_TAG_member
   10818                      .dwattr $C$DW$1881, DW_AT_type(*$C$DW$T$22)
   10819                      .dwattr $C$DW$1881, DW_AT_name("IER")
   10820                      .dwattr $C$DW$1881, DW_AT_TI_symbol_name("_IER")
   10821                      .dwattr $C$DW$1881, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
   10822                      .dwattr $C$DW$1881, DW_AT_accessibility(DW_ACCESS_public)
   10823              $C$DW$1882      .dwtag  DW_TAG_member
   10824                      .dwattr $C$DW$1882, DW_AT_type(*$C$DW$T$22)
   10825                      .dwattr $C$DW$1882, DW_AT_name("IFR")
   10826                      .dwattr $C$DW$1882, DW_AT_TI_symbol_name("_IFR")
   10827                      .dwattr $C$DW$1882, DW_AT_data_member_location[DW_OP_plus_uconst 0x1]
   10828                      .dwattr $C$DW$1882, DW_AT_accessibility(DW_ACCESS_public)
   10829                      .dwendtag $C$DW$T$95
   10830              
   10831              $C$DW$T$96      .dwtag  DW_TAG_typedef, DW_AT_name("PIE_IERIFR_t")
   10832                      .dwattr $C$DW$T$96, DW_AT_type(*$C$DW$T$95)
   10833                      .dwattr $C$DW$T$96, DW_AT_language(DW_LANG_C)
   10834              $C$DW$1883      .dwtag  DW_TAG_TI_far_type
   10835                      .dwattr $C$DW$1883, DW_AT_type(*$C$DW$T$96)
   10836              $C$DW$T$97      .dwtag  DW_TAG_volatile_type
   10837                      .dwattr $C$DW$T$97, DW_AT_type(*$C$DW$1883)
   10838              
   10839              $C$DW$T$98      .dwtag  DW_TAG_array_type
   10840                      .dwattr $C$DW$T$98, DW_AT_type(*$C$DW$T$97)
   10841                      .dwattr $C$DW$T$98, DW_AT_language(DW_LANG_C)
   10842                      .dwattr $C$DW$T$98, DW_AT_byte_size(0x18)
   10843              $C$DW$1884      .dwtag  DW_TAG_subrange_type
   10844                      .dwattr $C$DW$1884, DW_AT_upper_bound(0x0b)
   10845                      .dwendtag $C$DW$T$98
   10846              
   10847              
   10848              $C$DW$T$105     .dwtag  DW_TAG_structure_type
   10849                      .dwattr $C$DW$T$105, DW_AT_name("_PIE_Obj_")
   10850                      .dwattr $C$DW$T$105, DW_AT_byte_size(0x639c)
   10851              $C$DW$1885      .dwtag  DW_TAG_member
   10852                      .dwattr $C$DW$1885, DW_AT_type(*$C$DW$T$22)
   10853                      .dwattr $C$DW$1885, DW_AT_name("PIECTRL")
   10854                      .dwattr $C$DW$1885, DW_AT_TI_symbol_name("_PIECTRL")
   10855                      .dwattr $C$DW$1885, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
TMS320C2000 Assembler PC v6.2.5 Wed Nov 22 09:16:04 2017

Tools Copyright (c) 1996-2014 Texas Instruments Incorporated
C:\Users\wmj\AppData\Local\Temp\0657610                              PAGE  208

   10856                      .dwattr $C$DW$1885, DW_AT_accessibility(DW_ACCESS_public)
   10857              $C$DW$1886      .dwtag  DW_TAG_member
   10858                      .dwattr $C$DW$1886, DW_AT_type(*$C$DW$T$22)
   10859                      .dwattr $C$DW$1886, DW_AT_name("PIEACK")
   10860                      .dwattr $C$DW$1886, DW_AT_TI_symbol_name("_PIEACK")
   10861                      .dwattr $C$DW$1886, DW_AT_data_member_location[DW_OP_plus_uconst 0x1]
   10862                      .dwattr $C$DW$1886, DW_AT_accessibility(DW_ACCESS_public)
   10863              $C$DW$1887      .dwtag  DW_TAG_member
   10864                      .dwattr $C$DW$1887, DW_AT_type(*$C$DW$T$98)
   10865                      .dwattr $C$DW$1887, DW_AT_name("PIEIER_PIEIFR")
   10866                      .dwattr $C$DW$1887, DW_AT_TI_symbol_name("_PIEIER_PIEIFR")
   10867                      .dwattr $C$DW$1887, DW_AT_data_member_location[DW_OP_plus_uconst 0x2]
   10868                      .dwattr $C$DW$1887, DW_AT_accessibility(DW_ACCESS_public)
   10869              $C$DW$1888      .dwtag  DW_TAG_member
   10870                      .dwattr $C$DW$1888, DW_AT_type(*$C$DW$T$99)
   10871                      .dwattr $C$DW$1888, DW_AT_name("rsvd_1")
   10872                      .dwattr $C$DW$1888, DW_AT_TI_symbol_name("_rsvd_1")
   10873                      .dwattr $C$DW$1888, DW_AT_data_member_location[DW_OP_plus_uconst 0x1a]
   10874                      .dwattr $C$DW$1888, DW_AT_accessibility(DW_ACCESS_public)
   10875              $C$DW$1889      .dwtag  DW_TAG_member
   10876                      .dwattr $C$DW$1889, DW_AT_type(*$C$DW$T$103)
   10877                      .dwattr $C$DW$1889, DW_AT_name("Reset")
   10878                      .dwattr $C$DW$1889, DW_AT_TI_symbol_name("_Reset")
   10879                      .dwattr $C$DW$1889, DW_AT_data_member_location[DW_OP_plus_uconst 0x20]
   10880                      .dwattr $C$DW$1889, DW_AT_accessibility(DW_ACCESS_public)
   10881              $C$DW$1890      .dwtag  DW_TAG_member
   10882                      .dwattr $C$DW$1890, DW_AT_type(*$C$DW$T$103)
   10883                      .dwattr $C$DW$1890, DW_AT_name("INT1")
   10884                      .dwattr $C$DW$1890, DW_AT_TI_symbol_name("_INT1")
   10885                      .dwattr $C$DW$1890, DW_AT_data_member_location[DW_OP_plus_uconst 0x22]
   10886                      .dwattr $C$DW$1890, DW_AT_accessibility(DW_ACCESS_public)
   10887              $C$DW$1891      .dwtag  DW_TAG_member
   10888                      .dwattr $C$DW$1891, DW_AT_type(*$C$DW$T$103)
   10889                      .dwattr $C$DW$1891, DW_AT_name("INT2")
   10890                      .dwattr $C$DW$1891, DW_AT_TI_symbol_name("_INT2")
   10891                      .dwattr $C$DW$1891, DW_AT_data_member_location[DW_OP_plus_uconst 0x24]
   10892                      .dwattr $C$DW$1891, DW_AT_accessibility(DW_ACCESS_public)
   10893              $C$DW$1892      .dwtag  DW_TAG_member
   10894                      .dwattr $C$DW$1892, DW_AT_type(*$C$DW$T$103)
   10895                      .dwattr $C$DW$1892, DW_AT_name("INT3")
   10896                      .dwattr $C$DW$1892, DW_AT_TI_symbol_name("_INT3")
   10897                      .dwattr $C$DW$1892, DW_AT_data_member_location[DW_OP_plus_uconst 0x26]
   10898                      .dwattr $C$DW$1892, DW_AT_accessibility(DW_ACCESS_public)
   10899              $C$DW$1893      .dwtag  DW_TAG_member
   10900                      .dwattr $C$DW$1893, DW_AT_type(*$C$DW$T$103)
   10901                      .dwattr $C$DW$1893, DW_AT_name("INT4")
   10902                      .dwattr $C$DW$1893, DW_AT_TI_symbol_name("_INT4")
   10903                      .dwattr $C$DW$1893, DW_AT_data_member_location[DW_OP_plus_uconst 0x28]
   10904                      .dwattr $C$DW$1893, DW_AT_accessibility(DW_ACCESS_public)
   10905              $C$DW$1894      .dwtag  DW_TAG_member
   10906                      .dwattr $C$DW$1894, DW_AT_type(*$C$DW$T$103)
   10907                      .dwattr $C$DW$1894, DW_AT_name("INT5")
   10908                      .dwattr $C$DW$1894, DW_AT_TI_symbol_name("_INT5")
   10909                      .dwattr $C$DW$1894, DW_AT_data_member_location[DW_OP_plus_uconst 0x2a]
   10910                      .dwattr $C$DW$1894, DW_AT_accessibility(DW_ACCESS_public)
TMS320C2000 Assembler PC v6.2.5 Wed Nov 22 09:16:04 2017

Tools Copyright (c) 1996-2014 Texas Instruments Incorporated
C:\Users\wmj\AppData\Local\Temp\0657610                              PAGE  209

   10911              $C$DW$1895      .dwtag  DW_TAG_member
   10912                      .dwattr $C$DW$1895, DW_AT_type(*$C$DW$T$103)
   10913                      .dwattr $C$DW$1895, DW_AT_name("INT6")
   10914                      .dwattr $C$DW$1895, DW_AT_TI_symbol_name("_INT6")
   10915                      .dwattr $C$DW$1895, DW_AT_data_member_location[DW_OP_plus_uconst 0x2c]
   10916                      .dwattr $C$DW$1895, DW_AT_accessibility(DW_ACCESS_public)
   10917              $C$DW$1896      .dwtag  DW_TAG_member
   10918                      .dwattr $C$DW$1896, DW_AT_type(*$C$DW$T$103)
   10919                      .dwattr $C$DW$1896, DW_AT_name("INT7")
   10920                      .dwattr $C$DW$1896, DW_AT_TI_symbol_name("_INT7")
   10921                      .dwattr $C$DW$1896, DW_AT_data_member_location[DW_OP_plus_uconst 0x2e]
   10922                      .dwattr $C$DW$1896, DW_AT_accessibility(DW_ACCESS_public)
   10923              $C$DW$1897      .dwtag  DW_TAG_member
   10924                      .dwattr $C$DW$1897, DW_AT_type(*$C$DW$T$103)
   10925                      .dwattr $C$DW$1897, DW_AT_name("INT8")
   10926                      .dwattr $C$DW$1897, DW_AT_TI_symbol_name("_INT8")
   10927                      .dwattr $C$DW$1897, DW_AT_data_member_location[DW_OP_plus_uconst 0x30]
   10928                      .dwattr $C$DW$1897, DW_AT_accessibility(DW_ACCESS_public)
   10929              $C$DW$1898      .dwtag  DW_TAG_member
   10930                      .dwattr $C$DW$1898, DW_AT_type(*$C$DW$T$103)
   10931                      .dwattr $C$DW$1898, DW_AT_name("INT9")
   10932                      .dwattr $C$DW$1898, DW_AT_TI_symbol_name("_INT9")
   10933                      .dwattr $C$DW$1898, DW_AT_data_member_location[DW_OP_plus_uconst 0x32]
   10934                      .dwattr $C$DW$1898, DW_AT_accessibility(DW_ACCESS_public)
   10935              $C$DW$1899      .dwtag  DW_TAG_member
   10936                      .dwattr $C$DW$1899, DW_AT_type(*$C$DW$T$103)
   10937                      .dwattr $C$DW$1899, DW_AT_name("INT10")
   10938                      .dwattr $C$DW$1899, DW_AT_TI_symbol_name("_INT10")
   10939                      .dwattr $C$DW$1899, DW_AT_data_member_location[DW_OP_plus_uconst 0x34]
   10940                      .dwattr $C$DW$1899, DW_AT_accessibility(DW_ACCESS_public)
   10941              $C$DW$1900      .dwtag  DW_TAG_member
   10942                      .dwattr $C$DW$1900, DW_AT_type(*$C$DW$T$103)
   10943                      .dwattr $C$DW$1900, DW_AT_name("INT11")
   10944                      .dwattr $C$DW$1900, DW_AT_TI_symbol_name("_INT11")
   10945                      .dwattr $C$DW$1900, DW_AT_data_member_location[DW_OP_plus_uconst 0x36]
   10946                      .dwattr $C$DW$1900, DW_AT_accessibility(DW_ACCESS_public)
   10947              $C$DW$1901      .dwtag  DW_TAG_member
