TMS320C2000 Assembler PC v15.12.3 Wed Nov 22 00:56:22 2017

Tools Copyright (c) 1996-2015 Texas Instruments Incorporated
C:\Users\wmj\AppData\Local\Temp\1725610                              PAGE    1

       1              ;***************************************************************
       2              ;* TMS320C2000 C/C++ Codegen                   PC v15.12.3.LTS *
       3              ;* Date/Time created: Wed Nov 22 00:56:21 2017                 *
       4              ;***************************************************************
       5                      .compiler_opts --abi=coffabi --float_support=softlib --hll_source=on --mem_model:code=flat --mem_mode
       6        0002  FP      .set    XAR2
       7              
       8              $C$DW$CU        .dwtag  DW_TAG_compile_unit
       9                      .dwattr $C$DW$CU, DW_AT_name("C:/Users/wmj/Desktop/BM1000_v1.1/sw/modules/hal/boards/hvkit_rev1p1/f28
      10                      .dwattr $C$DW$CU, DW_AT_producer("TI TMS320C2000 C/C++ Codegen PC v15.12.3.LTS Copyright (c) 1996-201
      11                      .dwattr $C$DW$CU, DW_AT_TI_version(0x01)
      12                      .dwattr $C$DW$CU, DW_AT_comp_dir("C:\Users\wmj\Desktop\BM1000_v1.1\sw\solutions\instaspin_foc\boards\
      13              
      14              $C$DW$1 .dwtag  DW_TAG_subprogram
      15                      .dwattr $C$DW$1, DW_AT_name("TIMER_setEmulationMode")

   13055                      .dwattr $C$DW$1720, DW_AT_name("SCI_Mode_IdleLine")
   13056                      .dwattr $C$DW$1720, DW_AT_const_value(0x00)
TMS320C2000 Assembler PC v15.12.3 Wed Nov 22 00:56:22 2017

Tools Copyright (c) 1996-2015 Texas Instruments Incorporated
C:\Users\wmj\AppData\Local\Temp\1725610                              PAGE  248

   13057              
   13058              $C$DW$1721      .dwtag  DW_TAG_enumerator
   13059                      .dwattr $C$DW$1721, DW_AT_name("SCI_Mode_AddressBit")
   13060                      .dwattr $C$DW$1721, DW_AT_const_value(0x08)
   13061              
   13062                      .dwendtag $C$DW$T$298
   13063              
   13064              $C$DW$T$299     .dwtag  DW_TAG_typedef
   13065                      .dwattr $C$DW$T$299, DW_AT_name("SCI_Mode_e")
   13066                      .dwattr $C$DW$T$299, DW_AT_type(*$C$DW$T$298)
   13067                      .dwattr $C$DW$T$299, DW_AT_language(DW_LANG_C)
   13068              
   13069              $C$DW$1722      .dwtag  DW_TAG_TI_far_type
   13070                      .dwattr $C$DW$1722, DW_AT_type(*$C$DW$T$299)
   13071              
   13072              $C$DW$T$300     .dwtag  DW_TAG_const_type
   13073                      .dwattr $C$DW$T$300, DW_AT_type(*$C$DW$1722)
   13074              
   13075              
   13076              $C$DW$T$301     .dwtag  DW_TAG_enumeration_type
   13077                      .dwattr $C$DW$T$301, DW_AT_byte_size(0x01)
   13078              $C$DW$1723      .dwtag  DW_TAG_enumerator
   13079                      .dwattr $C$DW$1723, DW_AT_name("SCI_NumStopBits_One")
   13080                      .dwattr $C$DW$1723, DW_AT_const_value(0x00)
   13081              
   13082              $C$DW$1724      .dwtag  DW_TAG_enumerator
   13083                      .dwattr $C$DW$1724, DW_AT_name("SCI_NumStopBits_Two")
   13084                      .dwattr $C$DW$1724, DW_AT_const_value(0x80)
   13085              
   13086                      .dwendtag $C$DW$T$301
   13087              
   13088              $C$DW$T$302     .dwtag  DW_TAG_typedef
   13089                      .dwattr $C$DW$T$302, DW_AT_name("SCI_NumStopBits_e")
   13090                      .dwattr $C$DW$T$302, DW_AT_type(*$C$DW$T$301)
   13091                      .dwattr $C$DW$T$302, DW_AT_language(DW_LANG_C)
   13092              
   13093              $C$DW$1725      .dwtag  DW_TAG_TI_far_type
   13094                      .dwattr $C$DW$1725, DW_AT_type(*$C$DW$T$302)
   13095              
   13096              $C$DW$T$303     .dwtag  DW_TAG_const_type
   13097                      .dwattr $C$DW$T$303, DW_AT_type(*$C$DW$1725)
   13098              
   13099              
   13100              $C$DW$T$304     .dwtag  DW_TAG_enumeration_type
   13101                      .dwattr $C$DW$T$304, DW_AT_byte_size(0x01)
   13102              $C$DW$1726      .dwtag  DW_TAG_enumerator
   13103                      .dwattr $C$DW$1726, DW_AT_name("SCI_Parity_Odd")
   13104                      .dwattr $C$DW$1726, DW_AT_const_value(0x00)
   13105              
   13106              $C$DW$1727      .dwtag  DW_TAG_enumerator
   13107                      .dwattr $C$DW$1727, DW_AT_name("SCI_Parity_Even")
   13108                      .dwattr $C$DW$1727, DW_AT_const_value(0x40)
   13109              
   13110                      .dwendtag $C$DW$T$304
   13111              
TMS320C2000 Assembler PC v15.12.3 Wed Nov 22 00:56:22 2017

Tools Copyright (c) 1996-2015 Texas Instruments Incorporated
C:\Users\wmj\AppData\Local\Temp\1725610                              PAGE  249

   13112              $C$DW$T$305     .dwtag  DW_TAG_typedef
   13113                      .dwattr $C$DW$T$305, DW_AT_name("SCI_Parity_e")
   13114                      .dwattr $C$DW$T$305, DW_AT_type(*$C$DW$T$304)
   13115                      .dwattr $C$DW$T$305, DW_AT_language(DW_LANG_C)
   13116              
   13117              $C$DW$1728      .dwtag  DW_TAG_TI_far_type
   13118                      .dwattr $C$DW$1728, DW_AT_type(*$C$DW$T$305)
   13119              
   13120              $C$DW$T$306     .dwtag  DW_TAG_const_type
   13121                      .dwattr $C$DW$T$306, DW_AT_type(*$C$DW$1728)
   13122              
   13123              
   13124              $C$DW$T$307     .dwtag  DW_TAG_enumeration_type
   13125                      .dwattr $C$DW$T$307, DW_AT_byte_size(0x01)
   13126              $C$DW$1729      .dwtag  DW_TAG_enumerator
   13127                      .dwattr $C$DW$1729, DW_AT_name("HAL_SensorType_Current")
   13128                      .dwattr $C$DW$1729, DW_AT_const_value(0x00)
   13129              
   13130              $C$DW$1730      .dwtag  DW_TAG_enumerator
   13131                      .dwattr $C$DW$1730, DW_AT_name("HAL_SensorType_Voltage")
   13132                      .dwattr $C$DW$1730, DW_AT_const_value(0x01)
   13133              
   13134                      .dwendtag $C$DW$T$307
   13135              
   13136              $C$DW$T$308     .dwtag  DW_TAG_typedef
   13137                      .dwattr $C$DW$T$308, DW_AT_name("HAL_SensorType_e")
   13138                      .dwattr $C$DW$T$308, DW_AT_type(*$C$DW$T$307)
   13139                      .dwattr $C$DW$T$308, DW_AT_language(DW_LANG_C)
   13140              
   13141              
   13142              $C$DW$T$29      .dwtag  DW_TAG_structure_type
   13143                      .dwattr $C$DW$T$29, DW_AT_name("_ADC_Obj_")
   13144                      .dwattr $C$DW$T$29, DW_AT_byte_size(0x6650)
   13145              $C$DW$1731      .dwtag  DW_TAG_member
   13146                      .dwattr $C$DW$1731, DW_AT_type(*$C$DW$T$23)
   13147                      .dwattr $C$DW$1731, DW_AT_name("ADCRESULT")
   13148                      .dwattr $C$DW$1731, DW_AT_TI_symbol_name("_ADCRESULT")
   13149                      .dwattr $C$DW$1731, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
   13150                      .dwattr $C$DW$1731, DW_AT_accessibility(DW_ACCESS_public)
   13151              
   13152              $C$DW$1732      .dwtag  DW_TAG_member
   13153                      .dwattr $C$DW$1732, DW_AT_type(*$C$DW$T$24)
   13154                      .dwattr $C$DW$1732, DW_AT_name("resvd_1")
   13155                      .dwattr $C$DW$1732, DW_AT_TI_symbol_name("_resvd_1")
   13156                      .dwattr $C$DW$1732, DW_AT_data_member_location[DW_OP_plus_uconst 0x10]
   13157                      .dwattr $C$DW$1732, DW_AT_accessibility(DW_ACCESS_public)
   13158              
   13159              $C$DW$1733      .dwtag  DW_TAG_member
   13160                      .dwattr $C$DW$1733, DW_AT_type(*$C$DW$T$22)
   13161                      .dwattr $C$DW$1733, DW_AT_name("ADCCTL1")
   13162                      .dwattr $C$DW$1733, DW_AT_TI_symbol_name("_ADCCTL1")
   13163                      .dwattr $C$DW$1733, DW_AT_data_member_location[DW_OP_plus_uconst 0x6600]
   13164                      .dwattr $C$DW$1733, DW_AT_accessibility(DW_ACCESS_public)
   13165              
   13166              $C$DW$1734      .dwtag  DW_TAG_member
TMS320C2000 Assembler PC v15.12.3 Wed Nov 22 00:56:22 2017

Tools Copyright (c) 1996-2015 Texas Instruments Incorporated
C:\Users\wmj\AppData\Local\Temp\1725610                              PAGE  250

   13167                      .dwattr $C$DW$1734, DW_AT_type(*$C$DW$T$22)
   13168                      .dwattr $C$DW$1734, DW_AT_name("ADCCTL2")
   13169                      .dwattr $C$DW$1734, DW_AT_TI_symbol_name("_ADCCTL2")
   13170                      .dwattr $C$DW$1734, DW_AT_data_member_location[DW_OP_plus_uconst 0x6601]
   13171                      .dwattr $C$DW$1734, DW_AT_accessibility(DW_ACCESS_public)
   13172              
   13173              $C$DW$1735      .dwtag  DW_TAG_member
   13174                      .dwattr $C$DW$1735, DW_AT_type(*$C$DW$T$25)
   13175                      .dwattr $C$DW$1735, DW_AT_name("rsvd_2")
   13176                      .dwattr $C$DW$1735, DW_AT_TI_symbol_name("_rsvd_2")
   13177                      .dwattr $C$DW$1735, DW_AT_data_member_location[DW_OP_plus_uconst 0x6602]
   13178                      .dwattr $C$DW$1735, DW_AT_accessibility(DW_ACCESS_public)
   13179              
   13180              $C$DW$1736      .dwtag  DW_TAG_member
   13181                      .dwattr $C$DW$1736, DW_AT_type(*$C$DW$T$22)
   13182                      .dwattr $C$DW$1736, DW_AT_name("ADCINTFLG")
   13183                      .dwattr $C$DW$1736, DW_AT_TI_symbol_name("_ADCINTFLG")
   13184                      .dwattr $C$DW$1736, DW_AT_data_member_location[DW_OP_plus_uconst 0x6604]
   13185                      .dwattr $C$DW$1736, DW_AT_accessibility(DW_ACCESS_public)
   13186              
   13187              $C$DW$1737      .dwtag  DW_TAG_member
   13188                      .dwattr $C$DW$1737, DW_AT_type(*$C$DW$T$22)
   13189                      .dwattr $C$DW$1737, DW_AT_name("ADCINTFLGCLR")
   13190                      .dwattr $C$DW$1737, DW_AT_TI_symbol_name("_ADCINTFLGCLR")
   13191                      .dwattr $C$DW$1737, DW_AT_data_member_location[DW_OP_plus_uconst 0x6605]
   13192                      .dwattr $C$DW$1737, DW_AT_accessibility(DW_ACCESS_public)
   13193              
   13194              $C$DW$1738      .dwtag  DW_TAG_member
   13195                      .dwattr $C$DW$1738, DW_AT_type(*$C$DW$T$22)
   13196                      .dwattr $C$DW$1738, DW_AT_name("ADCINTOVF")
   13197                      .dwattr $C$DW$1738, DW_AT_TI_symbol_name("_ADCINTOVF")
   13198                      .dwattr $C$DW$1738, DW_AT_data_member_location[DW_OP_plus_uconst 0x6606]
   13199                      .dwattr $C$DW$1738, DW_AT_accessibility(DW_ACCESS_public)
   13200              
   13201              $C$DW$1739      .dwtag  DW_TAG_member
   13202                      .dwattr $C$DW$1739, DW_AT_type(*$C$DW$T$22)
   13203                      .dwattr $C$DW$1739, DW_AT_name("ADCINTOVFCLR")
   13204                      .dwattr $C$DW$1739, DW_AT_TI_symbol_name("_ADCINTOVFCLR")
   13205                      .dwattr $C$DW$1739, DW_AT_data_member_location[DW_OP_plus_uconst 0x6607]
   13206                      .dwattr $C$DW$1739, DW_AT_accessibility(DW_ACCESS_public)
   13207              
   13208              $C$DW$1740      .dwtag  DW_TAG_member
   13209                      .dwattr $C$DW$1740, DW_AT_type(*$C$DW$T$26)
   13210                      .dwattr $C$DW$1740, DW_AT_name("INTSELxNy")
   13211                      .dwattr $C$DW$1740, DW_AT_TI_symbol_name("_INTSELxNy")
   13212                      .dwattr $C$DW$1740, DW_AT_data_member_location[DW_OP_plus_uconst 0x6608]
   13213                      .dwattr $C$DW$1740, DW_AT_accessibility(DW_ACCESS_public)
   13214              
   13215              $C$DW$1741      .dwtag  DW_TAG_member
   13216                      .dwattr $C$DW$1741, DW_AT_type(*$C$DW$T$27)
   13217                      .dwattr $C$DW$1741, DW_AT_name("rsvd_3")
   13218                      .dwattr $C$DW$1741, DW_AT_TI_symbol_name("_rsvd_3")
   13219                      .dwattr $C$DW$1741, DW_AT_data_member_location[DW_OP_plus_uconst 0x660d]
   13220                      .dwattr $C$DW$1741, DW_AT_accessibility(DW_ACCESS_public)
   13221              
TMS320C2000 Assembler PC v15.12.3 Wed Nov 22 00:56:22 2017

Tools Copyright (c) 1996-2015 Texas Instruments Incorporated
C:\Users\wmj\AppData\Local\Temp\1725610                              PAGE  251

   13222              $C$DW$1742      .dwtag  DW_TAG_member
   13223                      .dwattr $C$DW$1742, DW_AT_type(*$C$DW$T$22)
   13224                      .dwattr $C$DW$1742, DW_AT_name("SOCPRICTRL")
   13225                      .dwattr $C$DW$1742, DW_AT_TI_symbol_name("_SOCPRICTRL")
   13226                      .dwattr $C$DW$1742, DW_AT_data_member_location[DW_OP_plus_uconst 0x6610]
   13227                      .dwattr $C$DW$1742, DW_AT_accessibility(DW_ACCESS_public)
   13228              
   13229              $C$DW$1743      .dwtag  DW_TAG_member
   13230                      .dwattr $C$DW$1743, DW_AT_type(*$C$DW$T$22)
   13231                      .dwattr $C$DW$1743, DW_AT_name("rsvd_4")
   13232                      .dwattr $C$DW$1743, DW_AT_TI_symbol_name("_rsvd_4")
   13233                      .dwattr $C$DW$1743, DW_AT_data_member_location[DW_OP_plus_uconst 0x6611]
   13234                      .dwattr $C$DW$1743, DW_AT_accessibility(DW_ACCESS_public)
   13235              
   13236              $C$DW$1744      .dwtag  DW_TAG_member
   13237                      .dwattr $C$DW$1744, DW_AT_type(*$C$DW$T$22)
   13238                      .dwattr $C$DW$1744, DW_AT_name("ADCSAMPLEMODE")
   13239                      .dwattr $C$DW$1744, DW_AT_TI_symbol_name("_ADCSAMPLEMODE")
   13240                      .dwattr $C$DW$1744, DW_AT_data_member_location[DW_OP_plus_uconst 0x6612]
   13241                      .dwattr $C$DW$1744, DW_AT_accessibility(DW_ACCESS_public)
   13242              
   13243              $C$DW$1745      .dwtag  DW_TAG_member
   13244                      .dwattr $C$DW$1745, DW_AT_type(*$C$DW$T$22)
   13245                      .dwattr $C$DW$1745, DW_AT_name("rsvd_5")
   13246                      .dwattr $C$DW$1745, DW_AT_TI_symbol_name("_rsvd_5")
   13247                      .dwattr $C$DW$1745, DW_AT_data_member_location[DW_OP_plus_uconst 0x6613]
   13248                      .dwattr $C$DW$1745, DW_AT_accessibility(DW_ACCESS_public)
   13249              
   13250              $C$DW$1746      .dwtag  DW_TAG_member
   13251                      .dwattr $C$DW$1746, DW_AT_type(*$C$DW$T$22)
   13252                      .dwattr $C$DW$1746, DW_AT_name("ADCINTSOCSEL1")
   13253                      .dwattr $C$DW$1746, DW_AT_TI_symbol_name("_ADCINTSOCSEL1")
   13254                      .dwattr $C$DW$1746, DW_AT_data_member_location[DW_OP_plus_uconst 0x6614]
   13255                      .dwattr $C$DW$1746, DW_AT_accessibility(DW_ACCESS_public)
   13256              
   13257              $C$DW$1747      .dwtag  DW_TAG_member
   13258                      .dwattr $C$DW$1747, DW_AT_type(*$C$DW$T$22)
   13259                      .dwattr $C$DW$1747, DW_AT_name("ADCINTSOCSEL2")
   13260                      .dwattr $C$DW$1747, DW_AT_TI_symbol_name("_ADCINTSOCSEL2")
   13261                      .dwattr $C$DW$1747, DW_AT_data_member_location[DW_OP_plus_uconst 0x6615]
   13262                      .dwattr $C$DW$1747, DW_AT_accessibility(DW_ACCESS_public)
   13263              
   13264              $C$DW$1748      .dwtag  DW_TAG_member
   13265                      .dwattr $C$DW$1748, DW_AT_type(*$C$DW$T$25)
   13266                      .dwattr $C$DW$1748, DW_AT_name("rsvd_6")
   13267                      .dwattr $C$DW$1748, DW_AT_TI_symbol_name("_rsvd_6")
   13268                      .dwattr $C$DW$1748, DW_AT_data_member_location[DW_OP_plus_uconst 0x6616]
   13269                      .dwattr $C$DW$1748, DW_AT_accessibility(DW_ACCESS_public)
   13270              
   13271              $C$DW$1749      .dwtag  DW_TAG_member
   13272                      .dwattr $C$DW$1749, DW_AT_type(*$C$DW$T$22)
   13273                      .dwattr $C$DW$1749, DW_AT_name("ADCSOCFLG1")
   13274                      .dwattr $C$DW$1749, DW_AT_TI_symbol_name("_ADCSOCFLG1")
   13275                      .dwattr $C$DW$1749, DW_AT_data_member_location[DW_OP_plus_uconst 0x6618]
   13276                      .dwattr $C$DW$1749, DW_AT_accessibility(DW_ACCESS_public)
TMS320C2000 Assembler PC v15.12.3 Wed Nov 22 00:56:22 2017

Tools Copyright (c) 1996-2015 Texas Instruments Incorporated
C:\Users\wmj\AppData\Local\Temp\1725610                              PAGE  252

   13277              
   13278              $C$DW$1750      .dwtag  DW_TAG_member
   13279                      .dwattr $C$DW$1750, DW_AT_type(*$C$DW$T$22)
   13280                      .dwattr $C$DW$1750, DW_AT_name("rsvd_7")
   13281                      .dwattr $C$DW$1750, DW_AT_TI_symbol_name("_rsvd_7")
   13282                      .dwattr $C$DW$1750, DW_AT_data_member_location[DW_OP_plus_uconst 0x6619]
   13283                      .dwattr $C$DW$1750, DW_AT_accessibility(DW_ACCESS_public)
   13284              
   13285              $C$DW$1751      .dwtag  DW_TAG_member
   13286                      .dwattr $C$DW$1751, DW_AT_type(*$C$DW$T$22)
   13287                      .dwattr $C$DW$1751, DW_AT_name("ADCSOCFRC1")
   13288                      .dwattr $C$DW$1751, DW_AT_TI_symbol_name("_ADCSOCFRC1")
   13289                      .dwattr $C$DW$1751, DW_AT_data_member_location[DW_OP_plus_uconst 0x661a]
   13290                      .dwattr $C$DW$1751, DW_AT_accessibility(DW_ACCESS_public)
   13291              
   13292              $C$DW$1752      .dwtag  DW_TAG_member
   13293                      .dwattr $C$DW$1752, DW_AT_type(*$C$DW$T$22)
   13294                      .dwattr $C$DW$1752, DW_AT_name("rsvd_8")
   13295                      .dwattr $C$DW$1752, DW_AT_TI_symbol_name("_rsvd_8")
   13296                      .dwattr $C$DW$1752, DW_AT_data_member_location[DW_OP_plus_uconst 0x661b]
   13297                      .dwattr $C$DW$1752, DW_AT_accessibility(DW_ACCESS_public)
   13298              
   13299              $C$DW$1753      .dwtag  DW_TAG_member
   13300                      .dwattr $C$DW$1753, DW_AT_type(*$C$DW$T$22)
   13301                      .dwattr $C$DW$1753, DW_AT_name("ADCSOCOVF1")
   13302                      .dwattr $C$DW$1753, DW_AT_TI_symbol_name("_ADCSOCOVF1")
   13303                      .dwattr $C$DW$1753, DW_AT_data_member_location[DW_OP_plus_uconst 0x661c]
   13304                      .dwattr $C$DW$1753, DW_AT_accessibility(DW_ACCESS_public)
   13305              
   13306              $C$DW$1754      .dwtag  DW_TAG_member
   13307                      .dwattr $C$DW$1754, DW_AT_type(*$C$DW$T$22)
   13308                      .dwattr $C$DW$1754, DW_AT_name("rsvd_9")
   13309                      .dwattr $C$DW$1754, DW_AT_TI_symbol_name("_rsvd_9")
   13310                      .dwattr $C$DW$1754, DW_AT_data_member_location[DW_OP_plus_uconst 0x661d]
   13311                      .dwattr $C$DW$1754, DW_AT_accessibility(DW_ACCESS_public)
   13312              
   13313              $C$DW$1755      .dwtag  DW_TAG_member
   13314                      .dwattr $C$DW$1755, DW_AT_type(*$C$DW$T$22)
   13315                      .dwattr $C$DW$1755, DW_AT_name("ADCSOCOVFCLR1")
   13316                      .dwattr $C$DW$1755, DW_AT_TI_symbol_name("_ADCSOCOVFCLR1")
   13317                      .dwattr $C$DW$1755, DW_AT_data_member_location[DW_OP_plus_uconst 0x661e]
   13318                      .dwattr $C$DW$1755, DW_AT_accessibility(DW_ACCESS_public)
   13319              
   13320              $C$DW$1756      .dwtag  DW_TAG_member
   13321                      .dwattr $C$DW$1756, DW_AT_type(*$C$DW$T$22)
   13322                      .dwattr $C$DW$1756, DW_AT_name("rsvd_10")
   13323                      .dwattr $C$DW$1756, DW_AT_TI_symbol_name("_rsvd_10")
   13324                      .dwattr $C$DW$1756, DW_AT_data_member_location[DW_OP_plus_uconst 0x661f]
   13325                      .dwattr $C$DW$1756, DW_AT_accessibility(DW_ACCESS_public)
   13326              
   13327              $C$DW$1757      .dwtag  DW_TAG_member
   13328                      .dwattr $C$DW$1757, DW_AT_type(*$C$DW$T$23)
   13329                      .dwattr $C$DW$1757, DW_AT_name("ADCSOCxCTL")
   13330                      .dwattr $C$DW$1757, DW_AT_TI_symbol_name("_ADCSOCxCTL")
   13331                      .dwattr $C$DW$1757, DW_AT_data_member_location[DW_OP_plus_uconst 0x6620]
TMS320C2000 Assembler PC v15.12.3 Wed Nov 22 00:56:22 2017

Tools Copyright (c) 1996-2015 Texas Instruments Incorporated
C:\Users\wmj\AppData\Local\Temp\1725610                              PAGE  253

   13332                      .dwattr $C$DW$1757, DW_AT_accessibility(DW_ACCESS_public)
   13333              
   13334              $C$DW$1758      .dwtag  DW_TAG_member
   13335                      .dwattr $C$DW$1758, DW_AT_type(*$C$DW$T$23)
   13336                      .dwattr $C$DW$1758, DW_AT_name("rsvd_11")
   13337                      .dwattr $C$DW$1758, DW_AT_TI_symbol_name("_rsvd_11")
   13338                      .dwattr $C$DW$1758, DW_AT_data_member_location[DW_OP_plus_uconst 0x6630]
   13339                      .dwattr $C$DW$1758, DW_AT_accessibility(DW_ACCESS_public)
   13340              
   13341              $C$DW$1759      .dwtag  DW_TAG_member
   13342                      .dwattr $C$DW$1759, DW_AT_type(*$C$DW$T$22)
   13343                      .dwattr $C$DW$1759, DW_AT_name("ADCREFTRIM")
   13344                      .dwattr $C$DW$1759, DW_AT_TI_symbol_name("_ADCREFTRIM")
   13345                      .dwattr $C$DW$1759, DW_AT_data_member_location[DW_OP_plus_uconst 0x6640]
   13346                      .dwattr $C$DW$1759, DW_AT_accessibility(DW_ACCESS_public)
   13347              
   13348              $C$DW$1760      .dwtag  DW_TAG_member
   13349                      .dwattr $C$DW$1760, DW_AT_type(*$C$DW$T$22)
   13350                      .dwattr $C$DW$1760, DW_AT_name("ADCOFFTRIM")
   13351                      .dwattr $C$DW$1760, DW_AT_TI_symbol_name("_ADCOFFTRIM")
   13352                      .dwattr $C$DW$1760, DW_AT_data_member_location[DW_OP_plus_uconst 0x6641]
   13353                      .dwattr $C$DW$1760, DW_AT_accessibility(DW_ACCESS_public)
   13354              
   13355              $C$DW$1761      .dwtag  DW_TAG_member
   13356                      .dwattr $C$DW$1761, DW_AT_type(*$C$DW$T$28)
   13357                      .dwattr $C$DW$1761, DW_AT_name("resvd_12")
   13358                      .dwattr $C$DW$1761, DW_AT_TI_symbol_name("_resvd_12")
   13359                      .dwattr $C$DW$1761, DW_AT_data_member_location[DW_OP_plus_uconst 0x6642]
   13360                      .dwattr $C$DW$1761, DW_AT_accessibility(DW_ACCESS_public)
   13361              
   13362              $C$DW$1762      .dwtag  DW_TAG_member
   13363                      .dwattr $C$DW$1762, DW_AT_type(*$C$DW$T$22)
   13364                      .dwattr $C$DW$1762, DW_AT_name("ADCREV")
   13365                      .dwattr $C$DW$1762, DW_AT_TI_symbol_name("_ADCREV")
   13366                      .dwattr $C$DW$1762, DW_AT_data_member_location[DW_OP_plus_uconst 0x664f]
   13367                      .dwattr $C$DW$1762, DW_AT_accessibility(DW_ACCESS_public)
   13368              
   13369                      .dwendtag $C$DW$T$29
   13370              
   13371              $C$DW$T$310     .dwtag  DW_TAG_typedef
   13372                      .dwattr $C$DW$T$310, DW_AT_name("ADC_Obj")
   13373                      .dwattr $C$DW$T$310, DW_AT_type(*$C$DW$T$29)
   13374                      .dwattr $C$DW$T$310, DW_AT_language(DW_LANG_C)
   13375              
   13376              $C$DW$T$49      .dwtag  DW_TAG_pointer_type
   13377                      .dwattr $C$DW$T$49, DW_AT_type(*$C$DW$T$29)
   13378                      .dwattr $C$DW$T$49, DW_AT_address_class(0x20)
   13379              
   13380              $C$DW$T$50      .dwtag  DW_TAG_typedef
   13381                      .dwattr $C$DW$T$50, DW_AT_name("ADC_Handle")
   13382                      .dwattr $C$DW$T$50, DW_AT_type(*$C$DW$T$49)
   13383                      .dwattr $C$DW$T$50, DW_AT_language(DW_LANG_C)
   13384              
   13385              
   13386              $C$DW$T$31      .dwtag  DW_TAG_structure_type
TMS320C2000 Assembler PC v15.12.3 Wed Nov 22 00:56:22 2017

Tools Copyright (c) 1996-2015 Texas Instruments Incorporated
C:\Users\wmj\AppData\Local\Temp\1725610                              PAGE  254

   13387                      .dwattr $C$DW$T$31, DW_AT_name("_CLK_Obj_")
   13388                      .dwattr $C$DW$T$31, DW_AT_byte_size(0x11)
   13389              $C$DW$1763      .dwtag  DW_TAG_member
   13390                      .dwattr $C$DW$1763, DW_AT_type(*$C$DW$T$22)
   13391                      .dwattr $C$DW$1763, DW_AT_name("XCLK")
   13392                      .dwattr $C$DW$1763, DW_AT_TI_symbol_name("_XCLK")
   13393                      .dwattr $C$DW$1763, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
   13394                      .dwattr $C$DW$1763, DW_AT_accessibility(DW_ACCESS_public)
   13395              
   13396              $C$DW$1764      .dwtag  DW_TAG_member
   13397                      .dwattr $C$DW$1764, DW_AT_type(*$C$DW$T$22)
   13398                      .dwattr $C$DW$1764, DW_AT_name("rsvd_1")
   13399                      .dwattr $C$DW$1764, DW_AT_TI_symbol_name("_rsvd_1")
   13400                      .dwattr $C$DW$1764, DW_AT_data_member_location[DW_OP_plus_uconst 0x1]
   13401                      .dwattr $C$DW$1764, DW_AT_accessibility(DW_ACCESS_public)
   13402              
   13403              $C$DW$1765      .dwtag  DW_TAG_member
   13404                      .dwattr $C$DW$1765, DW_AT_type(*$C$DW$T$22)
   13405                      .dwattr $C$DW$1765, DW_AT_name("CLKCTL")
   13406                      .dwattr $C$DW$1765, DW_AT_TI_symbol_name("_CLKCTL")
   13407                      .dwattr $C$DW$1765, DW_AT_data_member_location[DW_OP_plus_uconst 0x2]
   13408                      .dwattr $C$DW$1765, DW_AT_accessibility(DW_ACCESS_public)
   13409              
   13410              $C$DW$1766      .dwtag  DW_TAG_member
   13411                      .dwattr $C$DW$1766, DW_AT_type(*$C$DW$T$30)
   13412                      .dwattr $C$DW$1766, DW_AT_name("rsvd_2")
   13413                      .dwattr $C$DW$1766, DW_AT_TI_symbol_name("_rsvd_2")
   13414                      .dwattr $C$DW$1766, DW_AT_data_member_location[DW_OP_plus_uconst 0x3]
   13415                      .dwattr $C$DW$1766, DW_AT_accessibility(DW_ACCESS_public)
   13416              
   13417              $C$DW$1767      .dwtag  DW_TAG_member
   13418                      .dwattr $C$DW$1767, DW_AT_type(*$C$DW$T$22)
   13419                      .dwattr $C$DW$1767, DW_AT_name("LOSPCP")
   13420                      .dwattr $C$DW$1767, DW_AT_TI_symbol_name("_LOSPCP")
   13421                      .dwattr $C$DW$1767, DW_AT_data_member_location[DW_OP_plus_uconst 0xb]
   13422                      .dwattr $C$DW$1767, DW_AT_accessibility(DW_ACCESS_public)
   13423              
   13424              $C$DW$1768      .dwtag  DW_TAG_member
   13425                      .dwattr $C$DW$1768, DW_AT_type(*$C$DW$T$22)
   13426                      .dwattr $C$DW$1768, DW_AT_name("PCLKCR0")
   13427                      .dwattr $C$DW$1768, DW_AT_TI_symbol_name("_PCLKCR0")
   13428                      .dwattr $C$DW$1768, DW_AT_data_member_location[DW_OP_plus_uconst 0xc]
   13429                      .dwattr $C$DW$1768, DW_AT_accessibility(DW_ACCESS_public)
   13430              
   13431              $C$DW$1769      .dwtag  DW_TAG_member
   13432                      .dwattr $C$DW$1769, DW_AT_type(*$C$DW$T$22)
   13433                      .dwattr $C$DW$1769, DW_AT_name("PCLKCR1")
   13434                      .dwattr $C$DW$1769, DW_AT_TI_symbol_name("_PCLKCR1")
   13435                      .dwattr $C$DW$1769, DW_AT_data_member_location[DW_OP_plus_uconst 0xd]
   13436                      .dwattr $C$DW$1769, DW_AT_accessibility(DW_ACCESS_public)
   13437              
   13438              $C$DW$1770      .dwtag  DW_TAG_member
   13439                      .dwattr $C$DW$1770, DW_AT_type(*$C$DW$T$25)
   13440                      .dwattr $C$DW$1770, DW_AT_name("rsvd_3")
   13441                      .dwattr $C$DW$1770, DW_AT_TI_symbol_name("_rsvd_3")
TMS320C2000 Assembler PC v15.12.3 Wed Nov 22 00:56:22 2017

Tools Copyright (c) 1996-2015 Texas Instruments Incorporated
C:\Users\wmj\AppData\Local\Temp\1725610                              PAGE  255

   13442                      .dwattr $C$DW$1770, DW_AT_data_member_location[DW_OP_plus_uconst 0xe]
   13443                      .dwattr $C$DW$1770, DW_AT_accessibility(DW_ACCESS_public)
   13444              
   13445              $C$DW$1771      .dwtag  DW_TAG_member
   13446                      .dwattr $C$DW$1771, DW_AT_type(*$C$DW$T$22)
   13447                      .dwattr $C$DW$1771, DW_AT_name("PCLKCR3")
   13448                      .dwattr $C$DW$1771, DW_AT_TI_symbol_name("_PCLKCR3")
   13449                      .dwattr $C$DW$1771, DW_AT_data_member_location[DW_OP_plus_uconst 0x10]
   13450                      .dwattr $C$DW$1771, DW_AT_accessibility(DW_ACCESS_public)
   13451              
   13452                      .dwendtag $C$DW$T$31
   13453              
   13454              $C$DW$T$51      .dwtag  DW_TAG_pointer_type
   13455                      .dwattr $C$DW$T$51, DW_AT_type(*$C$DW$T$31)
   13456                      .dwattr $C$DW$T$51, DW_AT_address_class(0x20)
   13457              
   13458              $C$DW$T$52      .dwtag  DW_TAG_typedef
   13459                      .dwattr $C$DW$T$52, DW_AT_name("CLK_Handle")
   13460                      .dwattr $C$DW$T$52, DW_AT_type(*$C$DW$T$51)
   13461                      .dwattr $C$DW$T$52, DW_AT_language(DW_LANG_C)
   13462              
   13463              
   13464              $C$DW$T$33      .dwtag  DW_TAG_structure_type
   13465                      .dwattr $C$DW$T$33, DW_AT_name("_CPU_Obj_")
   13466                      .dwattr $C$DW$T$33, DW_AT_byte_size(0x01)
   13467              $C$DW$1772      .dwtag  DW_TAG_member
   13468                      .dwattr $C$DW$1772, DW_AT_type(*$C$DW$T$32)
   13469                      .dwattr $C$DW$1772, DW_AT_name("tmp")
   13470                      .dwattr $C$DW$1772, DW_AT_TI_symbol_name("_tmp")
   13471                      .dwattr $C$DW$1772, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
   13472                      .dwattr $C$DW$1772, DW_AT_accessibility(DW_ACCESS_public)
   13473              
   13474                      .dwendtag $C$DW$T$33
   13475              
   13476              $C$DW$T$319     .dwtag  DW_TAG_typedef
   13477                      .dwattr $C$DW$T$319, DW_AT_name("CPU_Obj")
   13478                      .dwattr $C$DW$T$319, DW_AT_type(*$C$DW$T$33)
   13479                      .dwattr $C$DW$T$319, DW_AT_language(DW_LANG_C)
   13480              
   13481              $C$DW$T$53      .dwtag  DW_TAG_pointer_type
   13482                      .dwattr $C$DW$T$53, DW_AT_type(*$C$DW$T$33)
   13483                      .dwattr $C$DW$T$53, DW_AT_address_class(0x20)
   13484              
   13485              $C$DW$T$54      .dwtag  DW_TAG_typedef
   13486                      .dwattr $C$DW$T$54, DW_AT_name("CPU_Handle")
   13487                      .dwattr $C$DW$T$54, DW_AT_type(*$C$DW$T$53)
   13488                      .dwattr $C$DW$T$54, DW_AT_language(DW_LANG_C)
   13489              
   13490              
   13491              $C$DW$T$35      .dwtag  DW_TAG_structure_type
   13492                      .dwattr $C$DW$T$35, DW_AT_name("_FILTER_FO_")
   13493                      .dwattr $C$DW$T$35, DW_AT_byte_size(0x0a)
   13494              $C$DW$1773      .dwtag  DW_TAG_member
   13495                      .dwattr $C$DW$1773, DW_AT_type(*$C$DW$T$34)
   13496                      .dwattr $C$DW$1773, DW_AT_name("a1")
TMS320C2000 Assembler PC v15.12.3 Wed Nov 22 00:56:22 2017

Tools Copyright (c) 1996-2015 Texas Instruments Incorporated
C:\Users\wmj\AppData\Local\Temp\1725610                              PAGE  256

   13497                      .dwattr $C$DW$1773, DW_AT_TI_symbol_name("_a1")
   13498                      .dwattr $C$DW$1773, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
   13499                      .dwattr $C$DW$1773, DW_AT_accessibility(DW_ACCESS_public)
   13500              
   13501              $C$DW$1774      .dwtag  DW_TAG_member
   13502                      .dwattr $C$DW$1774, DW_AT_type(*$C$DW$T$34)
   13503                      .dwattr $C$DW$1774, DW_AT_name("b0")
   13504                      .dwattr $C$DW$1774, DW_AT_TI_symbol_name("_b0")
   13505                      .dwattr $C$DW$1774, DW_AT_data_member_location[DW_OP_plus_uconst 0x2]
   13506                      .dwattr $C$DW$1774, DW_AT_accessibility(DW_ACCESS_public)
   13507              
   13508              $C$DW$1775      .dwtag  DW_TAG_member
   13509                      .dwattr $C$DW$1775, DW_AT_type(*$C$DW$T$34)
   13510                      .dwattr $C$DW$1775, DW_AT_name("b1")
   13511                      .dwattr $C$DW$1775, DW_AT_TI_symbol_name("_b1")
   13512                      .dwattr $C$DW$1775, DW_AT_data_member_location[DW_OP_plus_uconst 0x4]
   13513                      .dwattr $C$DW$1775, DW_AT_accessibility(DW_ACCESS_public)
   13514              
   13515              $C$DW$1776      .dwtag  DW_TAG_member
   13516                      .dwattr $C$DW$1776, DW_AT_type(*$C$DW$T$34)
   13517                      .dwattr $C$DW$1776, DW_AT_name("x1")
   13518                      .dwattr $C$DW$1776, DW_AT_TI_symbol_name("_x1")
   13519                      .dwattr $C$DW$1776, DW_AT_data_member_location[DW_OP_plus_uconst 0x6]
   13520                      .dwattr $C$DW$1776, DW_AT_accessibility(DW_ACCESS_public)
   13521              
   13522              $C$DW$1777      .dwtag  DW_TAG_member
   13523                      .dwattr $C$DW$1777, DW_AT_type(*$C$DW$T$34)
   13524                      .dwattr $C$DW$1777, DW_AT_name("y1")
   13525                      .dwattr $C$DW$1777, DW_AT_TI_symbol_name("_y1")
   13526                      .dwattr $C$DW$1777, DW_AT_data_member_location[DW_OP_plus_uconst 0x8]
   13527                      .dwattr $C$DW$1777, DW_AT_accessibility(DW_ACCESS_public)
   13528              
   13529                      .dwendtag $C$DW$T$35
   13530              
   13531              $C$DW$T$90      .dwtag  DW_TAG_typedef
   13532                      .dwattr $C$DW$T$90, DW_AT_name("FILTER_FO_Obj")
   13533                      .dwattr $C$DW$T$90, DW_AT_type(*$C$DW$T$35)
   13534                      .dwattr $C$DW$T$90, DW_AT_language(DW_LANG_C)
   13535              
   13536              
   13537              $C$DW$T$19      .dwtag  DW_TAG_structure_type
   13538                      .dwattr $C$DW$T$19, DW_AT_name("_FILTER_FO_Obj_")
   13539                      .dwattr $C$DW$T$19, DW_AT_declaration
   13540                      .dwendtag $C$DW$T$19
   13541              
   13542              $C$DW$T$91      .dwtag  DW_TAG_pointer_type
   13543                      .dwattr $C$DW$T$91, DW_AT_type(*$C$DW$T$19)
   13544                      .dwattr $C$DW$T$91, DW_AT_address_class(0x20)
   13545              
   13546              $C$DW$T$92      .dwtag  DW_TAG_typedef
   13547                      .dwattr $C$DW$T$92, DW_AT_name("FILTER_FO_Handle")
   13548                      .dwattr $C$DW$T$92, DW_AT_type(*$C$DW$T$91)
   13549                      .dwattr $C$DW$T$92, DW_AT_language(DW_LANG_C)
   13550              
   13551              
TMS320C2000 Assembler PC v15.12.3 Wed Nov 22 00:56:22 2017

Tools Copyright (c) 1996-2015 Texas Instruments Incorporated
C:\Users\wmj\AppData\Local\Temp\1725610                              PAGE  257

   13552              $C$DW$T$36      .dwtag  DW_TAG_structure_type
   13553                      .dwattr $C$DW$T$36, DW_AT_name("_FLASH_Obj_")
   13554                      .dwattr $C$DW$T$36, DW_AT_byte_size(0x08)
   13555              $C$DW$1778      .dwtag  DW_TAG_member
   13556                      .dwattr $C$DW$1778, DW_AT_type(*$C$DW$T$22)
   13557                      .dwattr $C$DW$1778, DW_AT_name("FOPT")
   13558                      .dwattr $C$DW$1778, DW_AT_TI_symbol_name("_FOPT")
   13559                      .dwattr $C$DW$1778, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
   13560                      .dwattr $C$DW$1778, DW_AT_accessibility(DW_ACCESS_public)
   13561              
   13562              $C$DW$1779      .dwtag  DW_TAG_member
   13563                      .dwattr $C$DW$1779, DW_AT_type(*$C$DW$T$22)
   13564                      .dwattr $C$DW$1779, DW_AT_name("rsvd_1")
   13565                      .dwattr $C$DW$1779, DW_AT_TI_symbol_name("_rsvd_1")
   13566                      .dwattr $C$DW$1779, DW_AT_data_member_location[DW_OP_plus_uconst 0x1]
   13567                      .dwattr $C$DW$1779, DW_AT_accessibility(DW_ACCESS_public)
   13568              
   13569              $C$DW$1780      .dwtag  DW_TAG_member
   13570                      .dwattr $C$DW$1780, DW_AT_type(*$C$DW$T$22)
   13571                      .dwattr $C$DW$1780, DW_AT_name("FPWR")
   13572                      .dwattr $C$DW$1780, DW_AT_TI_symbol_name("_FPWR")
   13573                      .dwattr $C$DW$1780, DW_AT_data_member_location[DW_OP_plus_uconst 0x2]
   13574                      .dwattr $C$DW$1780, DW_AT_accessibility(DW_ACCESS_public)
   13575              
   13576              $C$DW$1781      .dwtag  DW_TAG_member
   13577                      .dwattr $C$DW$1781, DW_AT_type(*$C$DW$T$22)
   13578                      .dwattr $C$DW$1781, DW_AT_name("FSTATUS")
   13579                      .dwattr $C$DW$1781, DW_AT_TI_symbol_name("_FSTATUS")
   13580                      .dwattr $C$DW$1781, DW_AT_data_member_location[DW_OP_plus_uconst 0x3]
   13581                      .dwattr $C$DW$1781, DW_AT_accessibility(DW_ACCESS_public)
   13582              
   13583              $C$DW$1782      .dwtag  DW_TAG_member
   13584                      .dwattr $C$DW$1782, DW_AT_type(*$C$DW$T$22)
   13585                      .dwattr $C$DW$1782, DW_AT_name("FSTDBYWAIT")
   13586                      .dwattr $C$DW$1782, DW_AT_TI_symbol_name("_FSTDBYWAIT")
   13587                      .dwattr $C$DW$1782, DW_AT_data_member_location[DW_OP_plus_uconst 0x4]
   13588                      .dwattr $C$DW$1782, DW_AT_accessibility(DW_ACCESS_public)
   13589              
   13590              $C$DW$1783      .dwtag  DW_TAG_member
   13591                      .dwattr $C$DW$1783, DW_AT_type(*$C$DW$T$22)
   13592                      .dwattr $C$DW$1783, DW_AT_name("FACTIVEWAIT")
   13593                      .dwattr $C$DW$1783, DW_AT_TI_symbol_name("_FACTIVEWAIT")
   13594                      .dwattr $C$DW$1783, DW_AT_data_member_location[DW_OP_plus_uconst 0x5]
   13595                      .dwattr $C$DW$1783, DW_AT_accessibility(DW_ACCESS_public)
   13596              
   13597              $C$DW$1784      .dwtag  DW_TAG_member
   13598                      .dwattr $C$DW$1784, DW_AT_type(*$C$DW$T$22)
   13599                      .dwattr $C$DW$1784, DW_AT_name("FBANKWAIT")
   13600                      .dwattr $C$DW$1784, DW_AT_TI_symbol_name("_FBANKWAIT")
   13601                      .dwattr $C$DW$1784, DW_AT_data_member_location[DW_OP_plus_uconst 0x6]
   13602                      .dwattr $C$DW$1784, DW_AT_accessibility(DW_ACCESS_public)
   13603              
   13604              $C$DW$1785      .dwtag  DW_TAG_member
   13605                      .dwattr $C$DW$1785, DW_AT_type(*$C$DW$T$22)
   13606                      .dwattr $C$DW$1785, DW_AT_name("FOTPWAIT")
TMS320C2000 Assembler PC v15.12.3 Wed Nov 22 00:56:22 2017

Tools Copyright (c) 1996-2015 Texas Instruments Incorporated
C:\Users\wmj\AppData\Local\Temp\1725610                              PAGE  258

   13607                      .dwattr $C$DW$1785, DW_AT_TI_symbol_name("_FOTPWAIT")
   13608                      .dwattr $C$DW$1785, DW_AT_data_member_location[DW_OP_plus_uconst 0x7]
   13609                      .dwattr $C$DW$1785, DW_AT_accessibility(DW_ACCESS_public)
   13610              
   13611                      .dwendtag $C$DW$T$36
   13612              
   13613              $C$DW$T$55      .dwtag  DW_TAG_pointer_type
   13614                      .dwattr $C$DW$T$55, DW_AT_type(*$C$DW$T$36)
   13615                      .dwattr $C$DW$T$55, DW_AT_address_class(0x20)
   13616              
   13617              $C$DW$T$56      .dwtag  DW_TAG_typedef
   13618                      .dwattr $C$DW$T$56, DW_AT_name("FLASH_Handle")
   13619                      .dwattr $C$DW$T$56, DW_AT_type(*$C$DW$T$55)
   13620                      .dwattr $C$DW$T$56, DW_AT_language(DW_LANG_C)
   13621              
   13622              
   13623              $C$DW$T$41      .dwtag  DW_TAG_structure_type
   13624                      .dwattr $C$DW$T$41, DW_AT_name("_GPIO_Obj_")
   13625                      .dwattr $C$DW$T$41, DW_AT_byte_size(0x6a)
   13626              $C$DW$1786      .dwtag  DW_TAG_member
   13627                      .dwattr $C$DW$1786, DW_AT_type(*$C$DW$T$38)
   13628                      .dwattr $C$DW$1786, DW_AT_name("GPACTRL")
   13629                      .dwattr $C$DW$1786, DW_AT_TI_symbol_name("_GPACTRL")
   13630                      .dwattr $C$DW$1786, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
   13631                      .dwattr $C$DW$1786, DW_AT_accessibility(DW_ACCESS_public)
   13632              
   13633              $C$DW$1787      .dwtag  DW_TAG_member
   13634                      .dwattr $C$DW$1787, DW_AT_type(*$C$DW$T$38)
   13635                      .dwattr $C$DW$1787, DW_AT_name("GPAQSEL1")
   13636                      .dwattr $C$DW$1787, DW_AT_TI_symbol_name("_GPAQSEL1")
   13637                      .dwattr $C$DW$1787, DW_AT_data_member_location[DW_OP_plus_uconst 0x2]
   13638                      .dwattr $C$DW$1787, DW_AT_accessibility(DW_ACCESS_public)
   13639              
   13640              $C$DW$1788      .dwtag  DW_TAG_member
   13641                      .dwattr $C$DW$1788, DW_AT_type(*$C$DW$T$38)
   13642                      .dwattr $C$DW$1788, DW_AT_name("GPAQSEL2")
   13643                      .dwattr $C$DW$1788, DW_AT_TI_symbol_name("_GPAQSEL2")
   13644                      .dwattr $C$DW$1788, DW_AT_data_member_location[DW_OP_plus_uconst 0x4]
   13645                      .dwattr $C$DW$1788, DW_AT_accessibility(DW_ACCESS_public)
   13646              
   13647              $C$DW$1789      .dwtag  DW_TAG_member
   13648                      .dwattr $C$DW$1789, DW_AT_type(*$C$DW$T$38)
   13649                      .dwattr $C$DW$1789, DW_AT_name("GPAMUX1")
   13650                      .dwattr $C$DW$1789, DW_AT_TI_symbol_name("_GPAMUX1")
   13651                      .dwattr $C$DW$1789, DW_AT_data_member_location[DW_OP_plus_uconst 0x6]
   13652                      .dwattr $C$DW$1789, DW_AT_accessibility(DW_ACCESS_public)
   13653              
   13654              $C$DW$1790      .dwtag  DW_TAG_member
   13655                      .dwattr $C$DW$1790, DW_AT_type(*$C$DW$T$38)
   13656                      .dwattr $C$DW$1790, DW_AT_name("GPAMUX2")
   13657                      .dwattr $C$DW$1790, DW_AT_TI_symbol_name("_GPAMUX2")
   13658                      .dwattr $C$DW$1790, DW_AT_data_member_location[DW_OP_plus_uconst 0x8]
   13659                      .dwattr $C$DW$1790, DW_AT_accessibility(DW_ACCESS_public)
   13660              
   13661              $C$DW$1791      .dwtag  DW_TAG_member
TMS320C2000 Assembler PC v15.12.3 Wed Nov 22 00:56:22 2017

Tools Copyright (c) 1996-2015 Texas Instruments Incorporated
C:\Users\wmj\AppData\Local\Temp\1725610                              PAGE  259

   13662                      .dwattr $C$DW$1791, DW_AT_type(*$C$DW$T$38)
   13663                      .dwattr $C$DW$1791, DW_AT_name("GPADIR")
   13664                      .dwattr $C$DW$1791, DW_AT_TI_symbol_name("_GPADIR")
   13665                      .dwattr $C$DW$1791, DW_AT_data_member_location[DW_OP_plus_uconst 0xa]
   13666                      .dwattr $C$DW$1791, DW_AT_accessibility(DW_ACCESS_public)
   13667              
   13668              $C$DW$1792      .dwtag  DW_TAG_member
   13669                      .dwattr $C$DW$1792, DW_AT_type(*$C$DW$T$38)
   13670                      .dwattr $C$DW$1792, DW_AT_name("GPAPUD")
   13671                      .dwattr $C$DW$1792, DW_AT_TI_symbol_name("_GPAPUD")
   13672                      .dwattr $C$DW$1792, DW_AT_data_member_location[DW_OP_plus_uconst 0xc]
   13673                      .dwattr $C$DW$1792, DW_AT_accessibility(DW_ACCESS_public)
   13674              
   13675              $C$DW$1793      .dwtag  DW_TAG_member
   13676                      .dwattr $C$DW$1793, DW_AT_type(*$C$DW$T$25)
   13677                      .dwattr $C$DW$1793, DW_AT_name("rsvd_1")
   13678                      .dwattr $C$DW$1793, DW_AT_TI_symbol_name("_rsvd_1")
   13679                      .dwattr $C$DW$1793, DW_AT_data_member_location[DW_OP_plus_uconst 0xe]
   13680                      .dwattr $C$DW$1793, DW_AT_accessibility(DW_ACCESS_public)
   13681              
   13682              $C$DW$1794      .dwtag  DW_TAG_member
   13683                      .dwattr $C$DW$1794, DW_AT_type(*$C$DW$T$38)
   13684                      .dwattr $C$DW$1794, DW_AT_name("GPBCTRL")
   13685                      .dwattr $C$DW$1794, DW_AT_TI_symbol_name("_GPBCTRL")
   13686                      .dwattr $C$DW$1794, DW_AT_data_member_location[DW_OP_plus_uconst 0x10]
   13687                      .dwattr $C$DW$1794, DW_AT_accessibility(DW_ACCESS_public)
   13688              
   13689              $C$DW$1795      .dwtag  DW_TAG_member
   13690                      .dwattr $C$DW$1795, DW_AT_type(*$C$DW$T$38)
   13691                      .dwattr $C$DW$1795, DW_AT_name("GPBQSEL1")
   13692                      .dwattr $C$DW$1795, DW_AT_TI_symbol_name("_GPBQSEL1")
   13693                      .dwattr $C$DW$1795, DW_AT_data_member_location[DW_OP_plus_uconst 0x12]
   13694                      .dwattr $C$DW$1795, DW_AT_accessibility(DW_ACCESS_public)
   13695              
   13696              $C$DW$1796      .dwtag  DW_TAG_member
   13697                      .dwattr $C$DW$1796, DW_AT_type(*$C$DW$T$25)
   13698                      .dwattr $C$DW$1796, DW_AT_name("rsvd_2")
   13699                      .dwattr $C$DW$1796, DW_AT_TI_symbol_name("_rsvd_2")
   13700                      .dwattr $C$DW$1796, DW_AT_data_member_location[DW_OP_plus_uconst 0x14]
   13701                      .dwattr $C$DW$1796, DW_AT_accessibility(DW_ACCESS_public)
   13702              
   13703              $C$DW$1797      .dwtag  DW_TAG_member
   13704                      .dwattr $C$DW$1797, DW_AT_type(*$C$DW$T$38)
   13705                      .dwattr $C$DW$1797, DW_AT_name("GPBMUX1")
   13706                      .dwattr $C$DW$1797, DW_AT_TI_symbol_name("_GPBMUX1")
   13707                      .dwattr $C$DW$1797, DW_AT_data_member_location[DW_OP_plus_uconst 0x16]
   13708                      .dwattr $C$DW$1797, DW_AT_accessibility(DW_ACCESS_public)
   13709              
   13710              $C$DW$1798      .dwtag  DW_TAG_member
   13711                      .dwattr $C$DW$1798, DW_AT_type(*$C$DW$T$25)
   13712                      .dwattr $C$DW$1798, DW_AT_name("rsvd_3")
   13713                      .dwattr $C$DW$1798, DW_AT_TI_symbol_name("_rsvd_3")
   13714                      .dwattr $C$DW$1798, DW_AT_data_member_location[DW_OP_plus_uconst 0x18]
   13715                      .dwattr $C$DW$1798, DW_AT_accessibility(DW_ACCESS_public)
   13716              
TMS320C2000 Assembler PC v15.12.3 Wed Nov 22 00:56:22 2017

Tools Copyright (c) 1996-2015 Texas Instruments Incorporated
C:\Users\wmj\AppData\Local\Temp\1725610                              PAGE  260

   13717              $C$DW$1799      .dwtag  DW_TAG_member
   13718                      .dwattr $C$DW$1799, DW_AT_type(*$C$DW$T$38)
   13719                      .dwattr $C$DW$1799, DW_AT_name("GPBDIR")
   13720                      .dwattr $C$DW$1799, DW_AT_TI_symbol_name("_GPBDIR")
   13721                      .dwattr $C$DW$1799, DW_AT_data_member_location[DW_OP_plus_uconst 0x1a]
   13722                      .dwattr $C$DW$1799, DW_AT_accessibility(DW_ACCESS_public)
   13723              
   13724              $C$DW$1800      .dwtag  DW_TAG_member
   13725                      .dwattr $C$DW$1800, DW_AT_type(*$C$DW$T$38)
   13726                      .dwattr $C$DW$1800, DW_AT_name("GPBPUD")
   13727                      .dwattr $C$DW$1800, DW_AT_TI_symbol_name("_GPBPUD")
   13728                      .dwattr $C$DW$1800, DW_AT_data_member_location[DW_OP_plus_uconst 0x1c]
   13729                      .dwattr $C$DW$1800, DW_AT_accessibility(DW_ACCESS_public)
   13730              
   13731              $C$DW$1801      .dwtag  DW_TAG_member
   13732                      .dwattr $C$DW$1801, DW_AT_type(*$C$DW$T$39)
   13733                      .dwattr $C$DW$1801, DW_AT_name("rsvd_4")
   13734                      .dwattr $C$DW$1801, DW_AT_TI_symbol_name("_rsvd_4")
   13735                      .dwattr $C$DW$1801, DW_AT_data_member_location[DW_OP_plus_uconst 0x1e]
   13736                      .dwattr $C$DW$1801, DW_AT_accessibility(DW_ACCESS_public)
   13737              
   13738              $C$DW$1802      .dwtag  DW_TAG_member
   13739                      .dwattr $C$DW$1802, DW_AT_type(*$C$DW$T$38)
   13740                      .dwattr $C$DW$1802, DW_AT_name("AIOMUX1")
   13741                      .dwattr $C$DW$1802, DW_AT_TI_symbol_name("_AIOMUX1")
   13742                      .dwattr $C$DW$1802, DW_AT_data_member_location[DW_OP_plus_uconst 0x36]
   13743                      .dwattr $C$DW$1802, DW_AT_accessibility(DW_ACCESS_public)
   13744              
   13745              $C$DW$1803      .dwtag  DW_TAG_member
   13746                      .dwattr $C$DW$1803, DW_AT_type(*$C$DW$T$25)
   13747                      .dwattr $C$DW$1803, DW_AT_name("rsvd_5")
   13748                      .dwattr $C$DW$1803, DW_AT_TI_symbol_name("_rsvd_5")
   13749                      .dwattr $C$DW$1803, DW_AT_data_member_location[DW_OP_plus_uconst 0x38]
   13750                      .dwattr $C$DW$1803, DW_AT_accessibility(DW_ACCESS_public)
   13751              
   13752              $C$DW$1804      .dwtag  DW_TAG_member
   13753                      .dwattr $C$DW$1804, DW_AT_type(*$C$DW$T$38)
   13754                      .dwattr $C$DW$1804, DW_AT_name("AIODIR")
   13755                      .dwattr $C$DW$1804, DW_AT_TI_symbol_name("_AIODIR")
   13756                      .dwattr $C$DW$1804, DW_AT_data_member_location[DW_OP_plus_uconst 0x3a]
   13757                      .dwattr $C$DW$1804, DW_AT_accessibility(DW_ACCESS_public)
   13758              
   13759              $C$DW$1805      .dwtag  DW_TAG_member
   13760                      .dwattr $C$DW$1805, DW_AT_type(*$C$DW$T$40)
   13761                      .dwattr $C$DW$1805, DW_AT_name("rsvd_6")
   13762                      .dwattr $C$DW$1805, DW_AT_TI_symbol_name("_rsvd_6")
   13763                      .dwattr $C$DW$1805, DW_AT_data_member_location[DW_OP_plus_uconst 0x3c]
   13764                      .dwattr $C$DW$1805, DW_AT_accessibility(DW_ACCESS_public)
   13765              
   13766              $C$DW$1806      .dwtag  DW_TAG_member
   13767                      .dwattr $C$DW$1806, DW_AT_type(*$C$DW$T$38)
   13768                      .dwattr $C$DW$1806, DW_AT_name("GPADAT")
   13769                      .dwattr $C$DW$1806, DW_AT_TI_symbol_name("_GPADAT")
   13770                      .dwattr $C$DW$1806, DW_AT_data_member_location[DW_OP_plus_uconst 0x40]
   13771                      .dwattr $C$DW$1806, DW_AT_accessibility(DW_ACCESS_public)
TMS320C2000 Assembler PC v15.12.3 Wed Nov 22 00:56:22 2017

Tools Copyright (c) 1996-2015 Texas Instruments Incorporated
C:\Users\wmj\AppData\Local\Temp\1725610                              PAGE  261

   13772              
   13773              $C$DW$1807      .dwtag  DW_TAG_member
   13774                      .dwattr $C$DW$1807, DW_AT_type(*$C$DW$T$38)
   13775                      .dwattr $C$DW$1807, DW_AT_name("GPASET")
   13776                      .dwattr $C$DW$1807, DW_AT_TI_symbol_name("_GPASET")
   13777                      .dwattr $C$DW$1807, DW_AT_data_member_location[DW_OP_plus_uconst 0x42]
   13778                      .dwattr $C$DW$1807, DW_AT_accessibility(DW_ACCESS_public)
   13779              
   13780              $C$DW$1808      .dwtag  DW_TAG_member
   13781                      .dwattr $C$DW$1808, DW_AT_type(*$C$DW$T$38)
   13782                      .dwattr $C$DW$1808, DW_AT_name("GPACLEAR")
   13783                      .dwattr $C$DW$1808, DW_AT_TI_symbol_name("_GPACLEAR")
   13784                      .dwattr $C$DW$1808, DW_AT_data_member_location[DW_OP_plus_uconst 0x44]
   13785                      .dwattr $C$DW$1808, DW_AT_accessibility(DW_ACCESS_public)
   13786              
   13787              $C$DW$1809      .dwtag  DW_TAG_member
   13788                      .dwattr $C$DW$1809, DW_AT_type(*$C$DW$T$38)
   13789                      .dwattr $C$DW$1809, DW_AT_name("GPATOGGLE")
   13790                      .dwattr $C$DW$1809, DW_AT_TI_symbol_name("_GPATOGGLE")
   13791                      .dwattr $C$DW$1809, DW_AT_data_member_location[DW_OP_plus_uconst 0x46]
   13792                      .dwattr $C$DW$1809, DW_AT_accessibility(DW_ACCESS_public)
   13793              
   13794              $C$DW$1810      .dwtag  DW_TAG_member
   13795                      .dwattr $C$DW$1810, DW_AT_type(*$C$DW$T$38)
   13796                      .dwattr $C$DW$1810, DW_AT_name("GPBDAT")
   13797                      .dwattr $C$DW$1810, DW_AT_TI_symbol_name("_GPBDAT")
   13798                      .dwattr $C$DW$1810, DW_AT_data_member_location[DW_OP_plus_uconst 0x48]
   13799                      .dwattr $C$DW$1810, DW_AT_accessibility(DW_ACCESS_public)
   13800              
   13801              $C$DW$1811      .dwtag  DW_TAG_member
   13802                      .dwattr $C$DW$1811, DW_AT_type(*$C$DW$T$38)
   13803                      .dwattr $C$DW$1811, DW_AT_name("GPBSET")
   13804                      .dwattr $C$DW$1811, DW_AT_TI_symbol_name("_GPBSET")
   13805                      .dwattr $C$DW$1811, DW_AT_data_member_location[DW_OP_plus_uconst 0x4a]
   13806                      .dwattr $C$DW$1811, DW_AT_accessibility(DW_ACCESS_public)
   13807              
   13808              $C$DW$1812      .dwtag  DW_TAG_member
   13809                      .dwattr $C$DW$1812, DW_AT_type(*$C$DW$T$38)
   13810                      .dwattr $C$DW$1812, DW_AT_name("GPBCLEAR")
   13811                      .dwattr $C$DW$1812, DW_AT_TI_symbol_name("_GPBCLEAR")
   13812                      .dwattr $C$DW$1812, DW_AT_data_member_location[DW_OP_plus_uconst 0x4c]
   13813                      .dwattr $C$DW$1812, DW_AT_accessibility(DW_ACCESS_public)
   13814              
   13815              $C$DW$1813      .dwtag  DW_TAG_member
   13816                      .dwattr $C$DW$1813, DW_AT_type(*$C$DW$T$38)
   13817                      .dwattr $C$DW$1813, DW_AT_name("GPBTOGGLE")
   13818                      .dwattr $C$DW$1813, DW_AT_TI_symbol_name("_GPBTOGGLE")
   13819                      .dwattr $C$DW$1813, DW_AT_data_member_location[DW_OP_plus_uconst 0x4e]
   13820                      .dwattr $C$DW$1813, DW_AT_accessibility(DW_ACCESS_public)
   13821              
   13822              $C$DW$1814      .dwtag  DW_TAG_member
   13823                      .dwattr $C$DW$1814, DW_AT_type(*$C$DW$T$30)
   13824                      .dwattr $C$DW$1814, DW_AT_name("rsvd_7")
   13825                      .dwattr $C$DW$1814, DW_AT_TI_symbol_name("_rsvd_7")
   13826                      .dwattr $C$DW$1814, DW_AT_data_member_location[DW_OP_plus_uconst 0x50]
TMS320C2000 Assembler PC v15.12.3 Wed Nov 22 00:56:22 2017

Tools Copyright (c) 1996-2015 Texas Instruments Incorporated
C:\Users\wmj\AppData\Local\Temp\1725610                              PAGE  262

   13827                      .dwattr $C$DW$1814, DW_AT_accessibility(DW_ACCESS_public)
   13828              
   13829              $C$DW$1815      .dwtag  DW_TAG_member
   13830                      .dwattr $C$DW$1815, DW_AT_type(*$C$DW$T$38)
   13831                      .dwattr $C$DW$1815, DW_AT_name("AIODAT")
   13832                      .dwattr $C$DW$1815, DW_AT_TI_symbol_name("_AIODAT")
   13833                      .dwattr $C$DW$1815, DW_AT_data_member_location[DW_OP_plus_uconst 0x58]
   13834                      .dwattr $C$DW$1815, DW_AT_accessibility(DW_ACCESS_public)
   13835              
   13836              $C$DW$1816      .dwtag  DW_TAG_member
   13837                      .dwattr $C$DW$1816, DW_AT_type(*$C$DW$T$38)
   13838                      .dwattr $C$DW$1816, DW_AT_name("AIOSET")
   13839                      .dwattr $C$DW$1816, DW_AT_TI_symbol_name("_AIOSET")
   13840                      .dwattr $C$DW$1816, DW_AT_data_member_location[DW_OP_plus_uconst 0x5a]
   13841                      .dwattr $C$DW$1816, DW_AT_accessibility(DW_ACCESS_public)
   13842              
   13843              $C$DW$1817      .dwtag  DW_TAG_member
   13844                      .dwattr $C$DW$1817, DW_AT_type(*$C$DW$T$38)
   13845                      .dwattr $C$DW$1817, DW_AT_name("AIOCLEAR")
   13846                      .dwattr $C$DW$1817, DW_AT_TI_symbol_name("_AIOCLEAR")
   13847                      .dwattr $C$DW$1817, DW_AT_data_member_location[DW_OP_plus_uconst 0x5c]
   13848                      .dwattr $C$DW$1817, DW_AT_accessibility(DW_ACCESS_public)
   13849              
   13850              $C$DW$1818      .dwtag  DW_TAG_member
   13851                      .dwattr $C$DW$1818, DW_AT_type(*$C$DW$T$38)
   13852                      .dwattr $C$DW$1818, DW_AT_name("AIOTOGGLE")
   13853                      .dwattr $C$DW$1818, DW_AT_TI_symbol_name("_AIOTOGGLE")
   13854                      .dwattr $C$DW$1818, DW_AT_data_member_location[DW_OP_plus_uconst 0x5e]
   13855                      .dwattr $C$DW$1818, DW_AT_accessibility(DW_ACCESS_public)
   13856              
   13857              $C$DW$1819      .dwtag  DW_TAG_member
   13858                      .dwattr $C$DW$1819, DW_AT_type(*$C$DW$T$27)
   13859                      .dwattr $C$DW$1819, DW_AT_name("GPIOXINTnSEL")
   13860                      .dwattr $C$DW$1819, DW_AT_TI_symbol_name("_GPIOXINTnSEL")
   13861                      .dwattr $C$DW$1819, DW_AT_data_member_location[DW_OP_plus_uconst 0x60]
   13862                      .dwattr $C$DW$1819, DW_AT_accessibility(DW_ACCESS_public)
   13863              
   13864              $C$DW$1820      .dwtag  DW_TAG_member
   13865                      .dwattr $C$DW$1820, DW_AT_type(*$C$DW$T$26)
   13866                      .dwattr $C$DW$1820, DW_AT_name("rsvd_8")
   13867                      .dwattr $C$DW$1820, DW_AT_TI_symbol_name("_rsvd_8")
   13868                      .dwattr $C$DW$1820, DW_AT_data_member_location[DW_OP_plus_uconst 0x63]
   13869                      .dwattr $C$DW$1820, DW_AT_accessibility(DW_ACCESS_public)
   13870              
   13871              $C$DW$1821      .dwtag  DW_TAG_member
   13872                      .dwattr $C$DW$1821, DW_AT_type(*$C$DW$T$38)
   13873                      .dwattr $C$DW$1821, DW_AT_name("GPIOLPMSEL")
   13874                      .dwattr $C$DW$1821, DW_AT_TI_symbol_name("_GPIOLPMSEL")
   13875                      .dwattr $C$DW$1821, DW_AT_data_member_location[DW_OP_plus_uconst 0x68]
   13876                      .dwattr $C$DW$1821, DW_AT_accessibility(DW_ACCESS_public)
   13877              
   13878                      .dwendtag $C$DW$T$41
   13879              
   13880              $C$DW$T$57      .dwtag  DW_TAG_pointer_type
   13881                      .dwattr $C$DW$T$57, DW_AT_type(*$C$DW$T$41)
TMS320C2000 Assembler PC v15.12.3 Wed Nov 22 00:56:22 2017

Tools Copyright (c) 1996-2015 Texas Instruments Incorporated
C:\Users\wmj\AppData\Local\Temp\1725610                              PAGE  263

   13882                      .dwattr $C$DW$T$57, DW_AT_address_class(0x20)
   13883              
   13884              $C$DW$T$58      .dwtag  DW_TAG_typedef
   13885                      .dwattr $C$DW$T$58, DW_AT_name("GPIO_Handle")
   13886                      .dwattr $C$DW$T$58, DW_AT_type(*$C$DW$T$57)
   13887                      .dwattr $C$DW$T$58, DW_AT_language(DW_LANG_C)
   13888              
   13889              
   13890              $C$DW$T$43      .dwtag  DW_TAG_structure_type
   13891                      .dwattr $C$DW$T$43, DW_AT_name("_HAL_AdcData_t_")
   13892                      .dwattr $C$DW$T$43, DW_AT_byte_size(0x16)
   13893              $C$DW$1822      .dwtag  DW_TAG_member
   13894                      .dwattr $C$DW$1822, DW_AT_type(*$C$DW$T$42)
   13895                      .dwattr $C$DW$1822, DW_AT_name("I")
   13896                      .dwattr $C$DW$1822, DW_AT_TI_symbol_name("_I")
   13897                      .dwattr $C$DW$1822, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
   13898                      .dwattr $C$DW$1822, DW_AT_accessibility(DW_ACCESS_public)
   13899              
   13900              $C$DW$1823      .dwtag  DW_TAG_member
   13901                      .dwattr $C$DW$1823, DW_AT_type(*$C$DW$T$42)
   13902                      .dwattr $C$DW$1823, DW_AT_name("V")
   13903                      .dwattr $C$DW$1823, DW_AT_TI_symbol_name("_V")
   13904                      .dwattr $C$DW$1823, DW_AT_data_member_location[DW_OP_plus_uconst 0x6]
   13905                      .dwattr $C$DW$1823, DW_AT_accessibility(DW_ACCESS_public)
   13906              
   13907              $C$DW$1824      .dwtag  DW_TAG_member
   13908                      .dwattr $C$DW$1824, DW_AT_type(*$C$DW$T$34)
   13909                      .dwattr $C$DW$1824, DW_AT_name("dcBus")
   13910                      .dwattr $C$DW$1824, DW_AT_TI_symbol_name("_dcBus")
   13911                      .dwattr $C$DW$1824, DW_AT_data_member_location[DW_OP_plus_uconst 0xc]
   13912                      .dwattr $C$DW$1824, DW_AT_accessibility(DW_ACCESS_public)
   13913              
   13914              $C$DW$1825      .dwtag  DW_TAG_member
   13915                      .dwattr $C$DW$1825, DW_AT_type(*$C$DW$T$34)
   13916                      .dwattr $C$DW$1825, DW_AT_name("analogSensor1")
   13917                      .dwattr $C$DW$1825, DW_AT_TI_symbol_name("_analogSensor1")
   13918                      .dwattr $C$DW$1825, DW_AT_data_member_location[DW_OP_plus_uconst 0xe]
   13919                      .dwattr $C$DW$1825, DW_AT_accessibility(DW_ACCESS_public)
   13920              
   13921              $C$DW$1826      .dwtag  DW_TAG_member
   13922                      .dwattr $C$DW$1826, DW_AT_type(*$C$DW$T$34)
   13923                      .dwattr $C$DW$1826, DW_AT_name("analogSensor2")
   13924                      .dwattr $C$DW$1826, DW_AT_TI_symbol_name("_analogSensor2")
   13925                      .dwattr $C$DW$1826, DW_AT_data_member_location[DW_OP_plus_uconst 0x10]
   13926                      .dwattr $C$DW$1826, DW_AT_accessibility(DW_ACCESS_public)
   13927              
   13928              $C$DW$1827      .dwtag  DW_TAG_member
   13929                      .dwattr $C$DW$1827, DW_AT_type(*$C$DW$T$34)
   13930                      .dwattr $C$DW$1827, DW_AT_name("igbtNTC")
   13931                      .dwattr $C$DW$1827, DW_AT_TI_symbol_name("_igbtNTC")
   13932                      .dwattr $C$DW$1827, DW_AT_data_member_location[DW_OP_plus_uconst 0x12]
   13933                      .dwattr $C$DW$1827, DW_AT_accessibility(DW_ACCESS_public)
   13934              
   13935              $C$DW$1828      .dwtag  DW_TAG_member
   13936                      .dwattr $C$DW$1828, DW_AT_type(*$C$DW$T$34)
TMS320C2000 Assembler PC v15.12.3 Wed Nov 22 00:56:22 2017

Tools Copyright (c) 1996-2015 Texas Instruments Incorporated
C:\Users\wmj\AppData\Local\Temp\1725610                              PAGE  264

   13937                      .dwattr $C$DW$1828, DW_AT_name("boardAddr")
   13938                      .dwattr $C$DW$1828, DW_AT_TI_symbol_name("_boardAddr")
   13939                      .dwattr $C$DW$1828, DW_AT_data_member_location[DW_OP_plus_uconst 0x14]
   13940                      .dwattr $C$DW$1828, DW_AT_accessibility(DW_ACCESS_public)
   13941              
   13942                      .dwendtag $C$DW$T$43
   13943              
   13944              $C$DW$T$84      .dwtag  DW_TAG_typedef
   13945                      .dwattr $C$DW$T$84, DW_AT_name("HAL_AdcData_t")
   13946                      .dwattr $C$DW$T$84, DW_AT_type(*$C$DW$T$43)
   13947                      .dwattr $C$DW$T$84, DW_AT_language(DW_LANG_C)
   13948              
   13949              
   13950              $C$DW$T$48      .dwtag  DW_TAG_structure_type
   13951                      .dwattr $C$DW$T$48, DW_AT_name("_HAL_DacData_t_")
   13952                      .dwattr $C$DW$T$48, DW_AT_byte_size(0x22)
   13953              $C$DW$1829      .dwtag  DW_TAG_member
   13954                      .dwattr $C$DW$1829, DW_AT_type(*$C$DW$T$21)
   13955                      .dwattr $C$DW$1829, DW_AT_name("PeriodMax")
   13956                      .dwattr $C$DW$1829, DW_AT_TI_symbol_name("_PeriodMax")
   13957                      .dwattr $C$DW$1829, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
   13958                      .dwattr $C$DW$1829, DW_AT_accessibility(DW_ACCESS_public)
   13959              
   13960              $C$DW$1830      .dwtag  DW_TAG_member
   13961                      .dwattr $C$DW$1830, DW_AT_type(*$C$DW$T$46)
   13962                      .dwattr $C$DW$1830, DW_AT_name("ptrData")
   13963                      .dwattr $C$DW$1830, DW_AT_TI_symbol_name("_ptrData")
   13964                      .dwattr $C$DW$1830, DW_AT_data_member_location[DW_OP_plus_uconst 0x2]
   13965                      .dwattr $C$DW$1830, DW_AT_accessibility(DW_ACCESS_public)
   13966              
   13967              $C$DW$1831      .dwtag  DW_TAG_member
   13968                      .dwattr $C$DW$1831, DW_AT_type(*$C$DW$T$47)
   13969                      .dwattr $C$DW$1831, DW_AT_name("value")
   13970                      .dwattr $C$DW$1831, DW_AT_TI_symbol_name("_value")
   13971                      .dwattr $C$DW$1831, DW_AT_data_member_location[DW_OP_plus_uconst 0xa]
   13972                      .dwattr $C$DW$1831, DW_AT_accessibility(DW_ACCESS_public)
   13973              
   13974              $C$DW$1832      .dwtag  DW_TAG_member
   13975                      .dwattr $C$DW$1832, DW_AT_type(*$C$DW$T$47)
   13976                      .dwattr $C$DW$1832, DW_AT_name("offset")
   13977                      .dwattr $C$DW$1832, DW_AT_TI_symbol_name("_offset")
   13978                      .dwattr $C$DW$1832, DW_AT_data_member_location[DW_OP_plus_uconst 0x12]
   13979                      .dwattr $C$DW$1832, DW_AT_accessibility(DW_ACCESS_public)
   13980              
   13981              $C$DW$1833      .dwtag  DW_TAG_member
   13982                      .dwattr $C$DW$1833, DW_AT_type(*$C$DW$T$47)
   13983                      .dwattr $C$DW$1833, DW_AT_name("gain")
   13984                      .dwattr $C$DW$1833, DW_AT_TI_symbol_name("_gain")
   13985                      .dwattr $C$DW$1833, DW_AT_data_member_location[DW_OP_plus_uconst 0x1a]
   13986                      .dwattr $C$DW$1833, DW_AT_accessibility(DW_ACCESS_public)
   13987              
   13988                      .dwendtag $C$DW$T$48
   13989              
   13990              $C$DW$T$329     .dwtag  DW_TAG_typedef
   13991                      .dwattr $C$DW$T$329, DW_AT_name("HAL_DacData_t")
TMS320C2000 Assembler PC v15.12.3 Wed Nov 22 00:56:22 2017

Tools Copyright (c) 1996-2015 Texas Instruments Incorporated
C:\Users\wmj\AppData\Local\Temp\1725610                              PAGE  265

   13992                      .dwattr $C$DW$T$329, DW_AT_type(*$C$DW$T$48)
   13993                      .dwattr $C$DW$T$329, DW_AT_language(DW_LANG_C)
   13994              
   13995              $C$DW$T$330     .dwtag  DW_TAG_pointer_type
   13996                      .dwattr $C$DW$T$330, DW_AT_type(*$C$DW$T$329)
   13997                      .dwattr $C$DW$T$330, DW_AT_address_class(0x20)
   13998              
   13999              $C$DW$1834      .dwtag  DW_TAG_TI_far_type
   14000                      .dwattr $C$DW$1834, DW_AT_type(*$C$DW$T$330)
   14001              
   14002              $C$DW$T$331     .dwtag  DW_TAG_const_type
   14003                      .dwattr $C$DW$T$331, DW_AT_type(*$C$DW$1834)
   14004              
   14005              
   14006              $C$DW$T$87      .dwtag  DW_TAG_structure_type
   14007                      .dwattr $C$DW$T$87, DW_AT_name("_HAL_Obj_")
   14008                      .dwattr $C$DW$T$87, DW_AT_byte_size(0xb4)
   14009              $C$DW$1835      .dwtag  DW_TAG_member
   14010                      .dwattr $C$DW$1835, DW_AT_type(*$C$DW$T$50)
   14011                      .dwattr $C$DW$1835, DW_AT_name("adcHandle")
   14012                      .dwattr $C$DW$1835, DW_AT_TI_symbol_name("_adcHandle")
   14013                      .dwattr $C$DW$1835, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
   14014                      .dwattr $C$DW$1835, DW_AT_accessibility(DW_ACCESS_public)
   14015              
   14016              $C$DW$1836      .dwtag  DW_TAG_member
   14017                      .dwattr $C$DW$1836, DW_AT_type(*$C$DW$T$52)
   14018                      .dwattr $C$DW$1836, DW_AT_name("clkHandle")
   14019                      .dwattr $C$DW$1836, DW_AT_TI_symbol_name("_clkHandle")
   14020                      .dwattr $C$DW$1836, DW_AT_data_member_location[DW_OP_plus_uconst 0x2]
   14021                      .dwattr $C$DW$1836, DW_AT_accessibility(DW_ACCESS_public)
   14022              
   14023              $C$DW$1837      .dwtag  DW_TAG_member
   14024                      .dwattr $C$DW$1837, DW_AT_type(*$C$DW$T$54)
   14025                      .dwattr $C$DW$1837, DW_AT_name("cpuHandle")
   14026                      .dwattr $C$DW$1837, DW_AT_TI_symbol_name("_cpuHandle")
   14027                      .dwattr $C$DW$1837, DW_AT_data_member_location[DW_OP_plus_uconst 0x4]
   14028                      .dwattr $C$DW$1837, DW_AT_accessibility(DW_ACCESS_public)
   14029              
   14030              $C$DW$1838      .dwtag  DW_TAG_member
   14031                      .dwattr $C$DW$1838, DW_AT_type(*$C$DW$T$56)
   14032                      .dwattr $C$DW$1838, DW_AT_name("flashHandle")
   14033                      .dwattr $C$DW$1838, DW_AT_TI_symbol_name("_flashHandle")
   14034                      .dwattr $C$DW$1838, DW_AT_data_member_location[DW_OP_plus_uconst 0x6]
   14035                      .dwattr $C$DW$1838, DW_AT_accessibility(DW_ACCESS_public)
   14036              
   14037              $C$DW$1839      .dwtag  DW_TAG_member
   14038                      .dwattr $C$DW$1839, DW_AT_type(*$C$DW$T$58)
   14039                      .dwattr $C$DW$1839, DW_AT_name("gpioHandle")
   14040                      .dwattr $C$DW$1839, DW_AT_TI_symbol_name("_gpioHandle")
   14041                      .dwattr $C$DW$1839, DW_AT_data_member_location[DW_OP_plus_uconst 0x8]
   14042                      .dwattr $C$DW$1839, DW_AT_accessibility(DW_ACCESS_public)
   14043              
   14044              $C$DW$1840      .dwtag  DW_TAG_member
   14045                      .dwattr $C$DW$1840, DW_AT_type(*$C$DW$T$61)
   14046                      .dwattr $C$DW$1840, DW_AT_name("offsetHandle_I")
TMS320C2000 Assembler PC v15.12.3 Wed Nov 22 00:56:22 2017

Tools Copyright (c) 1996-2015 Texas Instruments Incorporated
C:\Users\wmj\AppData\Local\Temp\1725610                              PAGE  266

   14047                      .dwattr $C$DW$1840, DW_AT_TI_symbol_name("_offsetHandle_I")
   14048                      .dwattr $C$DW$1840, DW_AT_data_member_location[DW_OP_plus_uconst 0xa]
   14049                      .dwattr $C$DW$1840, DW_AT_accessibility(DW_ACCESS_public)
   14050              
   14051              $C$DW$1841      .dwtag  DW_TAG_member
   14052                      .dwattr $C$DW$1841, DW_AT_type(*$C$DW$T$63)
   14053                      .dwattr $C$DW$1841, DW_AT_name("offset_I")
   14054                      .dwattr $C$DW$1841, DW_AT_TI_symbol_name("_offset_I")
   14055                      .dwattr $C$DW$1841, DW_AT_data_member_location[DW_OP_plus_uconst 0x10]
   14056                      .dwattr $C$DW$1841, DW_AT_accessibility(DW_ACCESS_public)
   14057              
   14058              $C$DW$1842      .dwtag  DW_TAG_member
   14059                      .dwattr $C$DW$1842, DW_AT_type(*$C$DW$T$61)
   14060                      .dwattr $C$DW$1842, DW_AT_name("offsetHandle_V")
   14061                      .dwattr $C$DW$1842, DW_AT_TI_symbol_name("_offsetHandle_V")
   14062                      .dwattr $C$DW$1842, DW_AT_data_member_location[DW_OP_plus_uconst 0x40]
   14063                      .dwattr $C$DW$1842, DW_AT_accessibility(DW_ACCESS_public)
   14064              
   14065              $C$DW$1843      .dwtag  DW_TAG_member
   14066                      .dwattr $C$DW$1843, DW_AT_type(*$C$DW$T$63)
   14067                      .dwattr $C$DW$1843, DW_AT_name("offset_V")
   14068                      .dwattr $C$DW$1843, DW_AT_TI_symbol_name("_offset_V")
   14069                      .dwattr $C$DW$1843, DW_AT_data_member_location[DW_OP_plus_uconst 0x46]
   14070                      .dwattr $C$DW$1843, DW_AT_accessibility(DW_ACCESS_public)
   14071              
   14072              $C$DW$1844      .dwtag  DW_TAG_member
   14073                      .dwattr $C$DW$1844, DW_AT_type(*$C$DW$T$65)
   14074                      .dwattr $C$DW$1844, DW_AT_name("oscHandle")
   14075                      .dwattr $C$DW$1844, DW_AT_TI_symbol_name("_oscHandle")
   14076                      .dwattr $C$DW$1844, DW_AT_data_member_location[DW_OP_plus_uconst 0x76]
   14077                      .dwattr $C$DW$1844, DW_AT_accessibility(DW_ACCESS_public)
   14078              
   14079              $C$DW$1845      .dwtag  DW_TAG_member
   14080                      .dwattr $C$DW$1845, DW_AT_type(*$C$DW$T$67)
   14081                      .dwattr $C$DW$1845, DW_AT_name("pieHandle")
   14082                      .dwattr $C$DW$1845, DW_AT_TI_symbol_name("_pieHandle")
   14083                      .dwattr $C$DW$1845, DW_AT_data_member_location[DW_OP_plus_uconst 0x78]
   14084                      .dwattr $C$DW$1845, DW_AT_accessibility(DW_ACCESS_public)
   14085              
   14086              $C$DW$1846      .dwtag  DW_TAG_member
   14087                      .dwattr $C$DW$1846, DW_AT_type(*$C$DW$T$69)
   14088                      .dwattr $C$DW$1846, DW_AT_name("pllHandle")
   14089                      .dwattr $C$DW$1846, DW_AT_TI_symbol_name("_pllHandle")
   14090                      .dwattr $C$DW$1846, DW_AT_data_member_location[DW_OP_plus_uconst 0x7a]
   14091                      .dwattr $C$DW$1846, DW_AT_accessibility(DW_ACCESS_public)
   14092              
   14093              $C$DW$1847      .dwtag  DW_TAG_member
   14094                      .dwattr $C$DW$1847, DW_AT_type(*$C$DW$T$72)
   14095                      .dwattr $C$DW$1847, DW_AT_name("pwmHandle")
   14096                      .dwattr $C$DW$1847, DW_AT_TI_symbol_name("_pwmHandle")
   14097                      .dwattr $C$DW$1847, DW_AT_data_member_location[DW_OP_plus_uconst 0x7c]
   14098                      .dwattr $C$DW$1847, DW_AT_accessibility(DW_ACCESS_public)
   14099              
   14100              $C$DW$1848      .dwtag  DW_TAG_member
   14101                      .dwattr $C$DW$1848, DW_AT_type(*$C$DW$T$72)
TMS320C2000 Assembler PC v15.12.3 Wed Nov 22 00:56:22 2017

Tools Copyright (c) 1996-2015 Texas Instruments Incorporated
C:\Users\wmj\AppData\Local\Temp\1725610                              PAGE  267

   14102                      .dwattr $C$DW$1848, DW_AT_name("pwmDacHandle")
   14103                      .dwattr $C$DW$1848, DW_AT_TI_symbol_name("_pwmDacHandle")
   14104                      .dwattr $C$DW$1848, DW_AT_data_member_location[DW_OP_plus_uconst 0x82]
   14105                      .dwattr $C$DW$1848, DW_AT_accessibility(DW_ACCESS_public)
   14106              
   14107              $C$DW$1849      .dwtag  DW_TAG_member
   14108                      .dwattr $C$DW$1849, DW_AT_type(*$C$DW$T$74)
   14109                      .dwattr $C$DW$1849, DW_AT_name("pwrHandle")
   14110                      .dwattr $C$DW$1849, DW_AT_TI_symbol_name("_pwrHandle")
   14111                      .dwattr $C$DW$1849, DW_AT_data_member_location[DW_OP_plus_uconst 0x88]
   14112                      .dwattr $C$DW$1849, DW_AT_accessibility(DW_ACCESS_public)
   14113              
   14114              $C$DW$1850      .dwtag  DW_TAG_member
   14115                      .dwattr $C$DW$1850, DW_AT_type(*$C$DW$T$77)
   14116                      .dwattr $C$DW$1850, DW_AT_name("timerHandle")
   14117                      .dwattr $C$DW$1850, DW_AT_TI_symbol_name("_timerHandle")
   14118                      .dwattr $C$DW$1850, DW_AT_data_member_location[DW_OP_plus_uconst 0x8a]
   14119                      .dwattr $C$DW$1850, DW_AT_accessibility(DW_ACCESS_public)
   14120              
   14121              $C$DW$1851      .dwtag  DW_TAG_member
   14122                      .dwattr $C$DW$1851, DW_AT_type(*$C$DW$T$79)
   14123                      .dwattr $C$DW$1851, DW_AT_name("spiAHandle")
   14124                      .dwattr $C$DW$1851, DW_AT_TI_symbol_name("_spiAHandle")
   14125                      .dwattr $C$DW$1851, DW_AT_data_member_location[DW_OP_plus_uconst 0x90]
   14126                      .dwattr $C$DW$1851, DW_AT_accessibility(DW_ACCESS_public)
   14127              
   14128              $C$DW$1852      .dwtag  DW_TAG_member
   14129                      .dwattr $C$DW$1852, DW_AT_type(*$C$DW$T$81)
   14130                      .dwattr $C$DW$1852, DW_AT_name("wdogHandle")
   14131                      .dwattr $C$DW$1852, DW_AT_TI_symbol_name("_wdogHandle")
   14132                      .dwattr $C$DW$1852, DW_AT_data_member_location[DW_OP_plus_uconst 0x92]
   14133                      .dwattr $C$DW$1852, DW_AT_accessibility(DW_ACCESS_public)
   14134              
   14135              $C$DW$1853      .dwtag  DW_TAG_member
   14136                      .dwattr $C$DW$1853, DW_AT_type(*$C$DW$T$83)
   14137                      .dwattr $C$DW$1853, DW_AT_name("sciHandle")
   14138                      .dwattr $C$DW$1853, DW_AT_TI_symbol_name("_sciHandle")
   14139                      .dwattr $C$DW$1853, DW_AT_data_member_location[DW_OP_plus_uconst 0x94]
   14140                      .dwattr $C$DW$1853, DW_AT_accessibility(DW_ACCESS_public)
   14141              
   14142              $C$DW$1854      .dwtag  DW_TAG_member
   14143                      .dwattr $C$DW$1854, DW_AT_type(*$C$DW$T$84)
   14144                      .dwattr $C$DW$1854, DW_AT_name("adcBias")
   14145                      .dwattr $C$DW$1854, DW_AT_TI_symbol_name("_adcBias")
   14146                      .dwattr $C$DW$1854, DW_AT_data_member_location[DW_OP_plus_uconst 0x96]
   14147                      .dwattr $C$DW$1854, DW_AT_accessibility(DW_ACCESS_public)
   14148              
   14149              $C$DW$1855      .dwtag  DW_TAG_member
   14150                      .dwattr $C$DW$1855, DW_AT_type(*$C$DW$T$34)
   14151                      .dwattr $C$DW$1855, DW_AT_name("current_sf")
   14152                      .dwattr $C$DW$1855, DW_AT_TI_symbol_name("_current_sf")
   14153                      .dwattr $C$DW$1855, DW_AT_data_member_location[DW_OP_plus_uconst 0xac]
   14154                      .dwattr $C$DW$1855, DW_AT_accessibility(DW_ACCESS_public)
   14155              
   14156              $C$DW$1856      .dwtag  DW_TAG_member
TMS320C2000 Assembler PC v15.12.3 Wed Nov 22 00:56:22 2017

Tools Copyright (c) 1996-2015 Texas Instruments Incorporated
C:\Users\wmj\AppData\Local\Temp\1725610                              PAGE  268

   14157                      .dwattr $C$DW$1856, DW_AT_type(*$C$DW$T$34)
   14158                      .dwattr $C$DW$1856, DW_AT_name("voltage_sf")
   14159                      .dwattr $C$DW$1856, DW_AT_TI_symbol_name("_voltage_sf")
   14160                      .dwattr $C$DW$1856, DW_AT_data_member_location[DW_OP_plus_uconst 0xae]
   14161                      .dwattr $C$DW$1856, DW_AT_accessibility(DW_ACCESS_public)
   14162              
   14163              $C$DW$1857      .dwtag  DW_TAG_member
   14164                      .dwattr $C$DW$1857, DW_AT_type(*$C$DW$T$32)
   14165                      .dwattr $C$DW$1857, DW_AT_name("numCurrentSensors")
   14166                      .dwattr $C$DW$1857, DW_AT_TI_symbol_name("_numCurrentSensors")
   14167                      .dwattr $C$DW$1857, DW_AT_data_member_location[DW_OP_plus_uconst 0xb0]
   14168                      .dwattr $C$DW$1857, DW_AT_accessibility(DW_ACCESS_public)
   14169              
   14170              $C$DW$1858      .dwtag  DW_TAG_member
   14171                      .dwattr $C$DW$1858, DW_AT_type(*$C$DW$T$32)
   14172                      .dwattr $C$DW$1858, DW_AT_name("numVoltageSensors")
   14173                      .dwattr $C$DW$1858, DW_AT_TI_symbol_name("_numVoltageSensors")
   14174                      .dwattr $C$DW$1858, DW_AT_data_member_location[DW_OP_plus_uconst 0xb1]
   14175                      .dwattr $C$DW$1858, DW_AT_accessibility(DW_ACCESS_public)
   14176              
   14177              $C$DW$1859      .dwtag  DW_TAG_member
   14178                      .dwattr $C$DW$1859, DW_AT_type(*$C$DW$T$86)
   14179                      .dwattr $C$DW$1859, DW_AT_name("boardAddress")
   14180                      .dwattr $C$DW$1859, DW_AT_TI_symbol_name("_boardAddress")
   14181                      .dwattr $C$DW$1859, DW_AT_data_member_location[DW_OP_plus_uconst 0xb2]
   14182                      .dwattr $C$DW$1859, DW_AT_accessibility(DW_ACCESS_public)
   14183              
   14184                      .dwendtag $C$DW$T$87
   14185              
   14186              $C$DW$T$334     .dwtag  DW_TAG_typedef
   14187                      .dwattr $C$DW$T$334, DW_AT_name("HAL_Obj")
   14188                      .dwattr $C$DW$T$334, DW_AT_type(*$C$DW$T$87)
   14189                      .dwattr $C$DW$T$334, DW_AT_language(DW_LANG_C)
   14190              
   14191              $C$DW$T$335     .dwtag  DW_TAG_pointer_type
   14192                      .dwattr $C$DW$T$335, DW_AT_type(*$C$DW$T$334)
   14193                      .dwattr $C$DW$T$335, DW_AT_address_class(0x20)
   14194              
   14195              $C$DW$T$336     .dwtag  DW_TAG_pointer_type
   14196                      .dwattr $C$DW$T$336, DW_AT_type(*$C$DW$T$87)
   14197                      .dwattr $C$DW$T$336, DW_AT_address_class(0x20)
   14198              
   14199              $C$DW$T$337     .dwtag  DW_TAG_typedef
   14200                      .dwattr $C$DW$T$337, DW_AT_name("HAL_Handle")
   14201                      .dwattr $C$DW$T$337, DW_AT_type(*$C$DW$T$336)
   14202                      .dwattr $C$DW$T$337, DW_AT_language(DW_LANG_C)
   14203              
   14204              $C$DW$1860      .dwtag  DW_TAG_TI_far_type
   14205                      .dwattr $C$DW$1860, DW_AT_type(*$C$DW$T$337)
   14206              
   14207              $C$DW$T$338     .dwtag  DW_TAG_const_type
   14208                      .dwattr $C$DW$T$338, DW_AT_type(*$C$DW$1860)
   14209              
   14210              
   14211              $C$DW$T$89      .dwtag  DW_TAG_structure_type
TMS320C2000 Assembler PC v15.12.3 Wed Nov 22 00:56:22 2017

Tools Copyright (c) 1996-2015 Texas Instruments Incorporated
C:\Users\wmj\AppData\Local\Temp\1725610                              PAGE  269

   14212                      .dwattr $C$DW$T$89, DW_AT_name("_MATH_vec3_")
   14213                      .dwattr $C$DW$T$89, DW_AT_byte_size(0x06)
   14214              $C$DW$1861      .dwtag  DW_TAG_member
   14215                      .dwattr $C$DW$1861, DW_AT_type(*$C$DW$T$88)
   14216                      .dwattr $C$DW$1861, DW_AT_name("value")
   14217                      .dwattr $C$DW$1861, DW_AT_TI_symbol_name("_value")
   14218                      .dwattr $C$DW$1861, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
   14219                      .dwattr $C$DW$1861, DW_AT_accessibility(DW_ACCESS_public)
   14220              
   14221                      .dwendtag $C$DW$T$89
   14222              
   14223              $C$DW$T$42      .dwtag  DW_TAG_typedef
   14224                      .dwattr $C$DW$T$42, DW_AT_name("MATH_vec3")
   14225                      .dwattr $C$DW$T$42, DW_AT_type(*$C$DW$T$89)
   14226                      .dwattr $C$DW$T$42, DW_AT_language(DW_LANG_C)
   14227              
   14228              
   14229              $C$DW$T$93      .dwtag  DW_TAG_structure_type
   14230                      .dwattr $C$DW$T$93, DW_AT_name("_OFFSET_")
   14231                      .dwattr $C$DW$T$93, DW_AT_byte_size(0x10)
   14232              $C$DW$1862      .dwtag  DW_TAG_member
   14233                      .dwattr $C$DW$1862, DW_AT_type(*$C$DW$T$34)
   14234                      .dwattr $C$DW$1862, DW_AT_name("value")
   14235                      .dwattr $C$DW$1862, DW_AT_TI_symbol_name("_value")
   14236                      .dwattr $C$DW$1862, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
   14237                      .dwattr $C$DW$1862, DW_AT_accessibility(DW_ACCESS_public)
   14238              
   14239              $C$DW$1863      .dwtag  DW_TAG_member
   14240                      .dwattr $C$DW$1863, DW_AT_type(*$C$DW$T$34)
   14241                      .dwattr $C$DW$1863, DW_AT_name("bias")
   14242                      .dwattr $C$DW$1863, DW_AT_TI_symbol_name("_bias")
   14243                      .dwattr $C$DW$1863, DW_AT_data_member_location[DW_OP_plus_uconst 0x2]
   14244                      .dwattr $C$DW$1863, DW_AT_accessibility(DW_ACCESS_public)
   14245              
   14246              $C$DW$1864      .dwtag  DW_TAG_member
   14247                      .dwattr $C$DW$1864, DW_AT_type(*$C$DW$T$90)
   14248                      .dwattr $C$DW$1864, DW_AT_name("filter")
   14249                      .dwattr $C$DW$1864, DW_AT_TI_symbol_name("_filter")
   14250                      .dwattr $C$DW$1864, DW_AT_data_member_location[DW_OP_plus_uconst 0x4]
   14251                      .dwattr $C$DW$1864, DW_AT_accessibility(DW_ACCESS_public)
   14252              
   14253              $C$DW$1865      .dwtag  DW_TAG_member
   14254                      .dwattr $C$DW$1865, DW_AT_type(*$C$DW$T$92)
   14255                      .dwattr $C$DW$1865, DW_AT_name("filterHandle")
   14256                      .dwattr $C$DW$1865, DW_AT_TI_symbol_name("_filterHandle")
   14257                      .dwattr $C$DW$1865, DW_AT_data_member_location[DW_OP_plus_uconst 0xe]
   14258                      .dwattr $C$DW$1865, DW_AT_accessibility(DW_ACCESS_public)
   14259              
   14260                      .dwendtag $C$DW$T$93
   14261              
   14262              $C$DW$T$62      .dwtag  DW_TAG_typedef
   14263                      .dwattr $C$DW$T$62, DW_AT_name("OFFSET_Obj")
   14264                      .dwattr $C$DW$T$62, DW_AT_type(*$C$DW$T$93)
   14265                      .dwattr $C$DW$T$62, DW_AT_language(DW_LANG_C)
   14266              
TMS320C2000 Assembler PC v15.12.3 Wed Nov 22 00:56:22 2017

Tools Copyright (c) 1996-2015 Texas Instruments Incorporated
C:\Users\wmj\AppData\Local\Temp\1725610                              PAGE  270

   14267              
   14268              $C$DW$T$63      .dwtag  DW_TAG_array_type
   14269                      .dwattr $C$DW$T$63, DW_AT_type(*$C$DW$T$62)
   14270                      .dwattr $C$DW$T$63, DW_AT_language(DW_LANG_C)
   14271                      .dwattr $C$DW$T$63, DW_AT_byte_size(0x30)
   14272              $C$DW$1866      .dwtag  DW_TAG_subrange_type
   14273                      .dwattr $C$DW$1866, DW_AT_upper_bound(0x02)
   14274              
   14275                      .dwendtag $C$DW$T$63
   14276              
   14277              
   14278              $C$DW$T$20      .dwtag  DW_TAG_structure_type
   14279                      .dwattr $C$DW$T$20, DW_AT_name("_OFFSET_Obj_")
   14280                      .dwattr $C$DW$T$20, DW_AT_declaration
   14281                      .dwendtag $C$DW$T$20
   14282              
   14283              $C$DW$T$59      .dwtag  DW_TAG_pointer_type
   14284                      .dwattr $C$DW$T$59, DW_AT_type(*$C$DW$T$20)
   14285                      .dwattr $C$DW$T$59, DW_AT_address_class(0x20)
   14286              
   14287              $C$DW$T$60      .dwtag  DW_TAG_typedef
   14288                      .dwattr $C$DW$T$60, DW_AT_name("OFFSET_Handle")
   14289                      .dwattr $C$DW$T$60, DW_AT_type(*$C$DW$T$59)
   14290                      .dwattr $C$DW$T$60, DW_AT_language(DW_LANG_C)
   14291              
   14292              
   14293              $C$DW$T$61      .dwtag  DW_TAG_array_type
   14294                      .dwattr $C$DW$T$61, DW_AT_type(*$C$DW$T$60)
   14295                      .dwattr $C$DW$T$61, DW_AT_language(DW_LANG_C)
   14296                      .dwattr $C$DW$T$61, DW_AT_byte_size(0x06)
   14297              $C$DW$1867      .dwtag  DW_TAG_subrange_type
   14298                      .dwattr $C$DW$1867, DW_AT_upper_bound(0x02)
   14299              
   14300                      .dwendtag $C$DW$T$61
   14301              
   14302              
   14303              $C$DW$T$94      .dwtag  DW_TAG_structure_type
   14304                      .dwattr $C$DW$T$94, DW_AT_name("_OSC_Obj_")
   14305                      .dwattr $C$DW$T$94, DW_AT_byte_size(0x03)
   14306              $C$DW$1868      .dwtag  DW_TAG_member
   14307                      .dwattr $C$DW$1868, DW_AT_type(*$C$DW$T$22)
   14308                      .dwattr $C$DW$1868, DW_AT_name("INTOSC1TRIM")
   14309                      .dwattr $C$DW$1868, DW_AT_TI_symbol_name("_INTOSC1TRIM")
   14310                      .dwattr $C$DW$1868, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
   14311                      .dwattr $C$DW$1868, DW_AT_accessibility(DW_ACCESS_public)
   14312              
   14313              $C$DW$1869      .dwtag  DW_TAG_member
   14314                      .dwattr $C$DW$1869, DW_AT_type(*$C$DW$T$22)
   14315                      .dwattr $C$DW$1869, DW_AT_name("rsvd_1")
   14316                      .dwattr $C$DW$1869, DW_AT_TI_symbol_name("_rsvd_1")
   14317                      .dwattr $C$DW$1869, DW_AT_data_member_location[DW_OP_plus_uconst 0x1]
   14318                      .dwattr $C$DW$1869, DW_AT_accessibility(DW_ACCESS_public)
   14319              
   14320              $C$DW$1870      .dwtag  DW_TAG_member
   14321                      .dwattr $C$DW$1870, DW_AT_type(*$C$DW$T$22)
TMS320C2000 Assembler PC v15.12.3 Wed Nov 22 00:56:22 2017

Tools Copyright (c) 1996-2015 Texas Instruments Incorporated
C:\Users\wmj\AppData\Local\Temp\1725610                              PAGE  271

   14322                      .dwattr $C$DW$1870, DW_AT_name("INTOSC2TRIM")
   14323                      .dwattr $C$DW$1870, DW_AT_TI_symbol_name("_INTOSC2TRIM")
   14324                      .dwattr $C$DW$1870, DW_AT_data_member_location[DW_OP_plus_uconst 0x2]
   14325                      .dwattr $C$DW$1870, DW_AT_accessibility(DW_ACCESS_public)
   14326              
   14327                      .dwendtag $C$DW$T$94
   14328              
   14329              $C$DW$T$64      .dwtag  DW_TAG_pointer_type
   14330                      .dwattr $C$DW$T$64, DW_AT_type(*$C$DW$T$94)
   14331                      .dwattr $C$DW$T$64, DW_AT_address_class(0x20)
   14332              
   14333              $C$DW$T$65      .dwtag  DW_TAG_typedef
   14334                      .dwattr $C$DW$T$65, DW_AT_name("OSC_Handle")
   14335                      .dwattr $C$DW$T$65, DW_AT_type(*$C$DW$T$64)
   14336                      .dwattr $C$DW$T$65, DW_AT_language(DW_LANG_C)
   14337              
   14338              
   14339              $C$DW$T$95      .dwtag  DW_TAG_structure_type
   14340                      .dwattr $C$DW$T$95, DW_AT_name("_PIE_IERIFR_t")
   14341                      .dwattr $C$DW$T$95, DW_AT_byte_size(0x02)
   14342              $C$DW$1871      .dwtag  DW_TAG_member
   14343                      .dwattr $C$DW$1871, DW_AT_type(*$C$DW$T$22)
   14344                      .dwattr $C$DW$1871, DW_AT_name("IER")
   14345                      .dwattr $C$DW$1871, DW_AT_TI_symbol_name("_IER")
   14346                      .dwattr $C$DW$1871, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
   14347                      .dwattr $C$DW$1871, DW_AT_accessibility(DW_ACCESS_public)
   14348              
   14349              $C$DW$1872      .dwtag  DW_TAG_member
   14350                      .dwattr $C$DW$1872, DW_AT_type(*$C$DW$T$22)
   14351                      .dwattr $C$DW$1872, DW_AT_name("IFR")
   14352                      .dwattr $C$DW$1872, DW_AT_TI_symbol_name("_IFR")
   14353                      .dwattr $C$DW$1872, DW_AT_data_member_location[DW_OP_plus_uconst 0x1]
   14354                      .dwattr $C$DW$1872, DW_AT_accessibility(DW_ACCESS_public)
   14355              
   14356                      .dwendtag $C$DW$T$95
   14357              
   14358              $C$DW$T$96      .dwtag  DW_TAG_typedef
   14359                      .dwattr $C$DW$T$96, DW_AT_name("PIE_IERIFR_t")
   14360                      .dwattr $C$DW$T$96, DW_AT_type(*$C$DW$T$95)
   14361                      .dwattr $C$DW$T$96, DW_AT_language(DW_LANG_C)
   14362              
   14363              $C$DW$1873      .dwtag  DW_TAG_TI_far_type
   14364                      .dwattr $C$DW$1873, DW_AT_type(*$C$DW$T$96)
   14365              
   14366              $C$DW$T$97      .dwtag  DW_TAG_volatile_type
   14367                      .dwattr $C$DW$T$97, DW_AT_type(*$C$DW$1873)
   14368              
   14369              
   14370              $C$DW$T$98      .dwtag  DW_TAG_array_type
   14371                      .dwattr $C$DW$T$98, DW_AT_type(*$C$DW$T$97)
   14372                      .dwattr $C$DW$T$98, DW_AT_language(DW_LANG_C)
   14373                      .dwattr $C$DW$T$98, DW_AT_byte_size(0x18)
   14374              $C$DW$1874      .dwtag  DW_TAG_subrange_type
   14375                      .dwattr $C$DW$1874, DW_AT_upper_bound(0x0b)
   14376              
TMS320C2000 Assembler PC v15.12.3 Wed Nov 22 00:56:22 2017

Tools Copyright (c) 1996-2015 Texas Instruments Incorporated
C:\Users\wmj\AppData\Local\Temp\1725610                              PAGE  272

   14377                      .dwendtag $C$DW$T$98
   14378              
   14379              
   14380              $C$DW$T$105     .dwtag  DW_TAG_structure_type
   14381                      .dwattr $C$DW$T$105, DW_AT_name("_PIE_Obj_")
   14382                      .dwattr $C$DW$T$105, DW_AT_byte_size(0x639c)
   14383              $C$DW$1875      .dwtag  DW_TAG_member
   14384                      .dwattr $C$DW$1875, DW_AT_type(*$C$DW$T$22)
   14385                      .dwattr $C$DW$1875, DW_AT_name("PIECTRL")
   14386                      .dwattr $C$DW$1875, DW_AT_TI_symbol_name("_PIECTRL")
   14387                      .dwattr $C$DW$1875, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
   14388                      .dwattr $C$DW$1875, DW_AT_accessibility(DW_ACCESS_public)
   14389              
   14390              $C$DW$1876      .dwtag  DW_TAG_member
   14391                      .dwattr $C$DW$1876, DW_AT_type(*$C$DW$T$22)
   14392                      .dwattr $C$DW$1876, DW_AT_name("PIEACK")
   14393                      .dwattr $C$DW$1876, DW_AT_TI_symbol_name("_PIEACK")
   14394                      .dwattr $C$DW$1876, DW_AT_data_member_location[DW_OP_plus_uconst 0x1]
   14395                      .dwattr $C$DW$1876, DW_AT_accessibility(DW_ACCESS_public)
   14396              
   14397              $C$DW$1877      .dwtag  DW_TAG_member
   14398                      .dwattr $C$DW$1877, DW_AT_type(*$C$DW$T$98)
   14399                      .dwattr $C$DW$1877, DW_AT_name("PIEIER_PIEIFR")
   14400                      .dwattr $C$DW$1877, DW_AT_TI_symbol_name("_PIEIER_PIEIFR")
   14401                      .dwattr $C$DW$1877, DW_AT_data_member_location[DW_OP_plus_uconst 0x2]
   14402                      .dwattr $C$DW$1877, DW_AT_accessibility(DW_ACCESS_public)
   14403              
   14404              $C$DW$1878      .dwtag  DW_TAG_member
   14405                      .dwattr $C$DW$1878, DW_AT_type(*$C$DW$T$99)
   14406                      .dwattr $C$DW$1878, DW_AT_name("rsvd_1")
   14407                      .dwattr $C$DW$1878, DW_AT_TI_symbol_name("_rsvd_1")
   14408                      .dwattr $C$DW$1878, DW_AT_data_member_location[DW_OP_plus_uconst 0x1a]
