TMS320C2000 Assembler PC v6.2.5 Thu Nov 16 14:38:59 2017

Tools Copyright (c) 1996-2014 Texas Instruments Incorporated
C:\Users\wmj\AppData\Local\Temp\4237210                              PAGE    1

       1              ;***************************************************************
       2              ;* TMS320C2000 C/C++ Codegen                         PC v6.2.5 *
       3              ;* Date/Time created: Thu Nov 16 14:38:59 2017                 *
       4              ;***************************************************************
       5                      .compiler_opts --float_support=softlib --hll_source=on --mem_model:code=flat --mem_model:data=large -
       6        0002  FP      .set    XAR2
       7              
       8              $C$DW$CU        .dwtag  DW_TAG_compile_unit
       9                      .dwattr $C$DW$CU, DW_AT_name("D:/BM1000/sw/drivers/i2c/src/32b/f28x/f2802x/i2c.c")
      10                      .dwattr $C$DW$CU, DW_AT_producer("TMS320C2000 C/C++ Codegen PC v6.2.5 Copyright (c) 1996-2014 Texas I
      11                      .dwattr $C$DW$CU, DW_AT_TI_version(0x01)
      12                      .dwattr $C$DW$CU, DW_AT_comp_dir("D:\BM1000\sw\solutions\instaspin_foc\boards\hvkit_rev1p1\f28x\f2802
      13              ;       C:\ti\ccsv6\tools\compiler\c2000_6.2.5\bin\opt2000.exe C:\\Users\\wmj\\AppData\\Local\\Temp\\423722 C

    1891              $C$DW$197       .dwtag  DW_TAG_enumerator, DW_AT_name("I2C_Status_Rx_Full"), DW_AT_const_value(0x800)
    1892              $C$DW$198       .dwtag  DW_TAG_enumerator, DW_AT_name("I2C_Status_Busy"), DW_AT_const_value(0x1000)
    1893              $C$DW$199       .dwtag  DW_TAG_enumerator, DW_AT_name("I2C_Status_NACK_Sent"), DW_AT_const_value(0x2000)
    1894              $C$DW$200       .dwtag  DW_TAG_enumerator, DW_AT_name("I2C_Status_Slave_Dir"), DW_AT_const_value(0x4000)
    1895                      .dwendtag $C$DW$T$33
    1896              
    1897              $C$DW$T$34      .dwtag  DW_TAG_typedef, DW_AT_name("I2C_Status_e")
    1898                      .dwattr $C$DW$T$34, DW_AT_type(*$C$DW$T$33)
    1899                      .dwattr $C$DW$T$34, DW_AT_language(DW_LANG_C)
    1900              
    1901              $C$DW$T$38      .dwtag  DW_TAG_enumeration_type
    1902                      .dwattr $C$DW$T$38, DW_AT_byte_size(0x01)
    1903              $C$DW$201       .dwtag  DW_TAG_enumerator, DW_AT_name("I2C_Control_Stop"), DW_AT_const_value(0xc00)
    1904              $C$DW$202       .dwtag  DW_TAG_enumerator, DW_AT_name("I2C_Control_Single_TX"), DW_AT_const_value(0x2e00)
    1905              $C$DW$203       .dwtag  DW_TAG_enumerator, DW_AT_name("I2C_Control_Single_RX"), DW_AT_const_value(0x2c00)
    1906              $C$DW$204       .dwtag  DW_TAG_enumerator, DW_AT_name("I2C_Control_Burst_TX_Start"), DW_AT_const_value(0x2600
    1907              $C$DW$205       .dwtag  DW_TAG_enumerator, DW_AT_name("I2C_Control_Burst_TX_Stop"), DW_AT_const_value(0xe00)
    1908              $C$DW$206       .dwtag  DW_TAG_enumerator, DW_AT_name("I2C_Control_Burst_RX_Start"), DW_AT_const_value(0x2400
    1909              $C$DW$207       .dwtag  DW_TAG_enumerator, DW_AT_name("I2C_Control_Burst_RX_Stop"), DW_AT_const_value(0xc00)
    1910                      .dwendtag $C$DW$T$38
    1911              
    1912              $C$DW$T$39      .dwtag  DW_TAG_typedef, DW_AT_name("I2C_Control_e")
    1913                      .dwattr $C$DW$T$39, DW_AT_type(*$C$DW$T$38)
    1914                      .dwattr $C$DW$T$39, DW_AT_language(DW_LANG_C)
    1915              $C$DW$208       .dwtag  DW_TAG_TI_far_type
    1916                      .dwattr $C$DW$208, DW_AT_type(*$C$DW$T$39)
    1917              $C$DW$T$40      .dwtag  DW_TAG_const_type
    1918                      .dwattr $C$DW$T$40, DW_AT_type(*$C$DW$208)
    1919              
    1920              $C$DW$T$41      .dwtag  DW_TAG_enumeration_type
    1921                      .dwattr $C$DW$T$41, DW_AT_byte_size(0x01)
    1922              $C$DW$209       .dwtag  DW_TAG_enumerator, DW_AT_name("I2C_BitCount_1_Bit"), DW_AT_const_value(0x01)
    1923              $C$DW$210       .dwtag  DW_TAG_enumerator, DW_AT_name("I2C_BitCount_2_Bits"), DW_AT_const_value(0x02)
    1924              $C$DW$211       .dwtag  DW_TAG_enumerator, DW_AT_name("I2C_BitCount_3_Bits"), DW_AT_const_value(0x03)
    1925              $C$DW$212       .dwtag  DW_TAG_enumerator, DW_AT_name("I2C_BitCount_4_Bits"), DW_AT_const_value(0x04)
    1926              $C$DW$213       .dwtag  DW_TAG_enumerator, DW_AT_name("I2C_BitCount_5_Bits"), DW_AT_const_value(0x05)
    1927              $C$DW$214       .dwtag  DW_TAG_enumerator, DW_AT_name("I2C_BitCount_6_Bits"), DW_AT_const_value(0x06)
    1928              $C$DW$215       .dwtag  DW_TAG_enumerator, DW_AT_name("I2C_BitCount_7_Bits"), DW_AT_const_value(0x07)
    1929              $C$DW$216       .dwtag  DW_TAG_enumerator, DW_AT_name("I2C_BitCount_8_Bits"), DW_AT_const_value(0x00)
    1930                      .dwendtag $C$DW$T$41
    1931              
    1932              $C$DW$T$42      .dwtag  DW_TAG_typedef, DW_AT_name("I2C_BitCount_e")
    1933                      .dwattr $C$DW$T$42, DW_AT_type(*$C$DW$T$41)
    1934                      .dwattr $C$DW$T$42, DW_AT_language(DW_LANG_C)
    1935              $C$DW$217       .dwtag  DW_TAG_TI_far_type
    1936                      .dwattr $C$DW$217, DW_AT_type(*$C$DW$T$42)
    1937              $C$DW$T$43      .dwtag  DW_TAG_const_type
    1938                      .dwattr $C$DW$T$43, DW_AT_type(*$C$DW$217)
TMS320C2000 Assembler PC v6.2.5 Thu Nov 16 14:38:59 2017

Tools Copyright (c) 1996-2014 Texas Instruments Incorporated
C:\Users\wmj\AppData\Local\Temp\4237210                              PAGE   37

    1939              
    1940              $C$DW$T$19      .dwtag  DW_TAG_structure_type
    1941                      .dwattr $C$DW$T$19, DW_AT_name("I2C_Obj")
    1942                      .dwattr $C$DW$T$19, DW_AT_declaration
    1943                      .dwendtag $C$DW$T$19
    1944              
    1945              $C$DW$T$29      .dwtag  DW_TAG_pointer_type
    1946                      .dwattr $C$DW$T$29, DW_AT_type(*$C$DW$T$19)
    1947                      .dwattr $C$DW$T$29, DW_AT_address_class(0x16)
    1948              $C$DW$T$30      .dwtag  DW_TAG_typedef, DW_AT_name("I2C_Handle")
    1949                      .dwattr $C$DW$T$30, DW_AT_type(*$C$DW$T$29)
    1950                      .dwattr $C$DW$T$30, DW_AT_language(DW_LANG_C)
    1951              $C$DW$218       .dwtag  DW_TAG_TI_far_type
    1952                      .dwattr $C$DW$218, DW_AT_type(*$C$DW$T$30)
    1953              $C$DW$T$44      .dwtag  DW_TAG_const_type
    1954                      .dwattr $C$DW$T$44, DW_AT_type(*$C$DW$218)
    1955              
    1956              $C$DW$T$23      .dwtag  DW_TAG_structure_type
    1957                      .dwattr $C$DW$T$23, DW_AT_name("_I2C_Obj_")
    1958                      .dwattr $C$DW$T$23, DW_AT_byte_size(0x22)
    1959              $C$DW$219       .dwtag  DW_TAG_member
    1960                      .dwattr $C$DW$219, DW_AT_type(*$C$DW$T$21)
    1961                      .dwattr $C$DW$219, DW_AT_name("I2COAR")
    1962                      .dwattr $C$DW$219, DW_AT_TI_symbol_name("_I2COAR")
    1963                      .dwattr $C$DW$219, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    1964                      .dwattr $C$DW$219, DW_AT_accessibility(DW_ACCESS_public)
    1965              $C$DW$220       .dwtag  DW_TAG_member
    1966                      .dwattr $C$DW$220, DW_AT_type(*$C$DW$T$21)
    1967                      .dwattr $C$DW$220, DW_AT_name("I2CIER")
    1968                      .dwattr $C$DW$220, DW_AT_TI_symbol_name("_I2CIER")
    1969                      .dwattr $C$DW$220, DW_AT_data_member_location[DW_OP_plus_uconst 0x1]
    1970                      .dwattr $C$DW$220, DW_AT_accessibility(DW_ACCESS_public)
    1971              $C$DW$221       .dwtag  DW_TAG_member
    1972                      .dwattr $C$DW$221, DW_AT_type(*$C$DW$T$21)
    1973                      .dwattr $C$DW$221, DW_AT_name("I2CSTR")
    1974                      .dwattr $C$DW$221, DW_AT_TI_symbol_name("_I2CSTR")
    1975                      .dwattr $C$DW$221, DW_AT_data_member_location[DW_OP_plus_uconst 0x2]
    1976                      .dwattr $C$DW$221, DW_AT_accessibility(DW_ACCESS_public)
    1977              $C$DW$222       .dwtag  DW_TAG_member
    1978                      .dwattr $C$DW$222, DW_AT_type(*$C$DW$T$21)
    1979                      .dwattr $C$DW$222, DW_AT_name("I2CCLKL")
    1980                      .dwattr $C$DW$222, DW_AT_TI_symbol_name("_I2CCLKL")
    1981                      .dwattr $C$DW$222, DW_AT_data_member_location[DW_OP_plus_uconst 0x3]
    1982                      .dwattr $C$DW$222, DW_AT_accessibility(DW_ACCESS_public)
    1983              $C$DW$223       .dwtag  DW_TAG_member
    1984                      .dwattr $C$DW$223, DW_AT_type(*$C$DW$T$21)
    1985                      .dwattr $C$DW$223, DW_AT_name("I2CCLKH")
    1986                      .dwattr $C$DW$223, DW_AT_TI_symbol_name("_I2CCLKH")
    1987                      .dwattr $C$DW$223, DW_AT_data_member_location[DW_OP_plus_uconst 0x4]
    1988                      .dwattr $C$DW$223, DW_AT_accessibility(DW_ACCESS_public)
    1989              $C$DW$224       .dwtag  DW_TAG_member
    1990                      .dwattr $C$DW$224, DW_AT_type(*$C$DW$T$21)
    1991                      .dwattr $C$DW$224, DW_AT_name("I2CCNT")
    1992                      .dwattr $C$DW$224, DW_AT_TI_symbol_name("_I2CCNT")
    1993                      .dwattr $C$DW$224, DW_AT_data_member_location[DW_OP_plus_uconst 0x5]
TMS320C2000 Assembler PC v6.2.5 Thu Nov 16 14:38:59 2017

Tools Copyright (c) 1996-2014 Texas Instruments Incorporated
C:\Users\wmj\AppData\Local\Temp\4237210                              PAGE   38

    1994                      .dwattr $C$DW$224, DW_AT_accessibility(DW_ACCESS_public)
    1995              $C$DW$225       .dwtag  DW_TAG_member
    1996                      .dwattr $C$DW$225, DW_AT_type(*$C$DW$T$21)
    1997                      .dwattr $C$DW$225, DW_AT_name("I2CDRR")
    1998                      .dwattr $C$DW$225, DW_AT_TI_symbol_name("_I2CDRR")
    1999                      .dwattr $C$DW$225, DW_AT_data_member_location[DW_OP_plus_uconst 0x6]
    2000                      .dwattr $C$DW$225, DW_AT_accessibility(DW_ACCESS_public)
    2001              $C$DW$226       .dwtag  DW_TAG_member
    2002                      .dwattr $C$DW$226, DW_AT_type(*$C$DW$T$21)
    2003                      .dwattr $C$DW$226, DW_AT_name("I2CSAR")
    2004                      .dwattr $C$DW$226, DW_AT_TI_symbol_name("_I2CSAR")
    2005                      .dwattr $C$DW$226, DW_AT_data_member_location[DW_OP_plus_uconst 0x7]
    2006                      .dwattr $C$DW$226, DW_AT_accessibility(DW_ACCESS_public)
    2007              $C$DW$227       .dwtag  DW_TAG_member
    2008                      .dwattr $C$DW$227, DW_AT_type(*$C$DW$T$21)
    2009                      .dwattr $C$DW$227, DW_AT_name("I2CDXR")
    2010                      .dwattr $C$DW$227, DW_AT_TI_symbol_name("_I2CDXR")
    2011                      .dwattr $C$DW$227, DW_AT_data_member_location[DW_OP_plus_uconst 0x8]
    2012                      .dwattr $C$DW$227, DW_AT_accessibility(DW_ACCESS_public)
    2013              $C$DW$228       .dwtag  DW_TAG_member
    2014                      .dwattr $C$DW$228, DW_AT_type(*$C$DW$T$21)
    2015                      .dwattr $C$DW$228, DW_AT_name("I2CMDR")
    2016                      .dwattr $C$DW$228, DW_AT_TI_symbol_name("_I2CMDR")
    2017                      .dwattr $C$DW$228, DW_AT_data_member_location[DW_OP_plus_uconst 0x9]
    2018                      .dwattr $C$DW$228, DW_AT_accessibility(DW_ACCESS_public)
    2019              $C$DW$229       .dwtag  DW_TAG_member
    2020                      .dwattr $C$DW$229, DW_AT_type(*$C$DW$T$21)
    2021                      .dwattr $C$DW$229, DW_AT_name("I2CISRC")
    2022                      .dwattr $C$DW$229, DW_AT_TI_symbol_name("_I2CISRC")
    2023                      .dwattr $C$DW$229, DW_AT_data_member_location[DW_OP_plus_uconst 0xa]
    2024                      .dwattr $C$DW$229, DW_AT_accessibility(DW_ACCESS_public)
    2025              $C$DW$230       .dwtag  DW_TAG_member
    2026                      .dwattr $C$DW$230, DW_AT_type(*$C$DW$T$21)
    2027                      .dwattr $C$DW$230, DW_AT_name("I2CEMDR")
    2028                      .dwattr $C$DW$230, DW_AT_TI_symbol_name("_I2CEMDR")
    2029                      .dwattr $C$DW$230, DW_AT_data_member_location[DW_OP_plus_uconst 0xb]
    2030                      .dwattr $C$DW$230, DW_AT_accessibility(DW_ACCESS_public)
    2031              $C$DW$231       .dwtag  DW_TAG_member
    2032                      .dwattr $C$DW$231, DW_AT_type(*$C$DW$T$21)
    2033                      .dwattr $C$DW$231, DW_AT_name("I2CPSC")
    2034                      .dwattr $C$DW$231, DW_AT_TI_symbol_name("_I2CPSC")
    2035                      .dwattr $C$DW$231, DW_AT_data_member_location[DW_OP_plus_uconst 0xc]
    2036                      .dwattr $C$DW$231, DW_AT_accessibility(DW_ACCESS_public)
    2037              $C$DW$232       .dwtag  DW_TAG_member
    2038                      .dwattr $C$DW$232, DW_AT_type(*$C$DW$T$22)
    2039                      .dwattr $C$DW$232, DW_AT_name("rsvd_1")
    2040                      .dwattr $C$DW$232, DW_AT_TI_symbol_name("_rsvd_1")
    2041                      .dwattr $C$DW$232, DW_AT_data_member_location[DW_OP_plus_uconst 0xd]
    2042                      .dwattr $C$DW$232, DW_AT_accessibility(DW_ACCESS_public)
    2043              $C$DW$233       .dwtag  DW_TAG_member
    2044                      .dwattr $C$DW$233, DW_AT_type(*$C$DW$T$21)
    2045                      .dwattr $C$DW$233, DW_AT_name("I2CFFTX")
    2046                      .dwattr $C$DW$233, DW_AT_TI_symbol_name("_I2CFFTX")
    2047                      .dwattr $C$DW$233, DW_AT_data_member_location[DW_OP_plus_uconst 0x20]
    2048                      .dwattr $C$DW$233, DW_AT_accessibility(DW_ACCESS_public)
TMS320C2000 Assembler PC v6.2.5 Thu Nov 16 14:38:59 2017

Tools Copyright (c) 1996-2014 Texas Instruments Incorporated
C:\Users\wmj\AppData\Local\Temp\4237210                              PAGE   39

    2049              $C$DW$234       .dwtag  DW_TAG_member
    2050                      .dwattr $C$DW$234, DW_AT_type(*$C$DW$T$21)
    2051                      .dwattr $C$DW$234, DW_AT_name("I2CFFRX")
    2052                      .dwattr $C$DW$234, DW_AT_TI_symbol_name("_I2CFFRX")
    2053                      .dwattr $C$DW$234, DW_AT_data_member_location[DW_OP_plus_uconst 0x21]
    2054                      .dwattr $C$DW$234, DW_AT_accessibility(DW_ACCESS_public)
    2055                      .dwendtag $C$DW$T$23
    2056              
    2057              $C$DW$T$50      .dwtag  DW_TAG_typedef, DW_AT_name("I2C_Obj")
    2058                      .dwattr $C$DW$T$50, DW_AT_type(*$C$DW$T$23)
    2059                      .dwattr $C$DW$T$50, DW_AT_language(DW_LANG_C)
    2060              $C$DW$T$51      .dwtag  DW_TAG_pointer_type
    2061                      .dwattr $C$DW$T$51, DW_AT_type(*$C$DW$T$50)
    2062                      .dwattr $C$DW$T$51, DW_AT_address_class(0x16)
    2063              $C$DW$T$3       .dwtag  DW_TAG_pointer_type
    2064                      .dwattr $C$DW$T$3, DW_AT_address_class(0x16)
    2065              $C$DW$235       .dwtag  DW_TAG_TI_far_type
    2066                      .dwattr $C$DW$235, DW_AT_type(*$C$DW$T$3)
    2067              $C$DW$T$53      .dwtag  DW_TAG_const_type
    2068                      .dwattr $C$DW$T$53, DW_AT_type(*$C$DW$235)
    2069              $C$DW$T$4       .dwtag  DW_TAG_base_type
    2070                      .dwattr $C$DW$T$4, DW_AT_encoding(DW_ATE_boolean)
    2071                      .dwattr $C$DW$T$4, DW_AT_name("bool")
    2072                      .dwattr $C$DW$T$4, DW_AT_byte_size(0x01)
    2073              $C$DW$T$5       .dwtag  DW_TAG_base_type
    2074                      .dwattr $C$DW$T$5, DW_AT_encoding(DW_ATE_signed_char)
    2075                      .dwattr $C$DW$T$5, DW_AT_name("signed char")
    2076                      .dwattr $C$DW$T$5, DW_AT_byte_size(0x01)
    2077              $C$DW$T$6       .dwtag  DW_TAG_base_type
    2078                      .dwattr $C$DW$T$6, DW_AT_encoding(DW_ATE_unsigned_char)
    2079                      .dwattr $C$DW$T$6, DW_AT_name("unsigned char")
    2080                      .dwattr $C$DW$T$6, DW_AT_byte_size(0x01)
    2081              $C$DW$T$69      .dwtag  DW_TAG_typedef, DW_AT_name("_Bool")
    2082                      .dwattr $C$DW$T$69, DW_AT_type(*$C$DW$T$6)
    2083                      .dwattr $C$DW$T$69, DW_AT_language(DW_LANG_C)
    2084              $C$DW$T$7       .dwtag  DW_TAG_base_type
    2085                      .dwattr $C$DW$T$7, DW_AT_encoding(DW_ATE_signed_char)
    2086                      .dwattr $C$DW$T$7, DW_AT_name("wchar_t")
    2087                      .dwattr $C$DW$T$7, DW_AT_byte_size(0x01)
    2088              $C$DW$T$8       .dwtag  DW_TAG_base_type
    2089                      .dwattr $C$DW$T$8, DW_AT_encoding(DW_ATE_signed)
    2090                      .dwattr $C$DW$T$8, DW_AT_name("short")
    2091                      .dwattr $C$DW$T$8, DW_AT_byte_size(0x01)
    2092              $C$DW$T$9       .dwtag  DW_TAG_base_type
    2093                      .dwattr $C$DW$T$9, DW_AT_encoding(DW_ATE_unsigned)
    2094                      .dwattr $C$DW$T$9, DW_AT_name("unsigned short")
    2095                      .dwattr $C$DW$T$9, DW_AT_byte_size(0x01)
    2096              $C$DW$T$20      .dwtag  DW_TAG_typedef, DW_AT_name("uint16_t")
    2097                      .dwattr $C$DW$T$20, DW_AT_type(*$C$DW$T$9)
    2098                      .dwattr $C$DW$T$20, DW_AT_language(DW_LANG_C)
    2099              $C$DW$T$66      .dwtag  DW_TAG_pointer_type
    2100                      .dwattr $C$DW$T$66, DW_AT_type(*$C$DW$T$20)
    2101                      .dwattr $C$DW$T$66, DW_AT_address_class(0x16)
    2102              $C$DW$236       .dwtag  DW_TAG_TI_far_type
    2103                      .dwattr $C$DW$236, DW_AT_type(*$C$DW$T$20)
TMS320C2000 Assembler PC v6.2.5 Thu Nov 16 14:38:59 2017

Tools Copyright (c) 1996-2014 Texas Instruments Incorporated
C:\Users\wmj\AppData\Local\Temp\4237210                              PAGE   40

    2104              $C$DW$T$21      .dwtag  DW_TAG_volatile_type
