TMS320C2000 Assembler PC v6.2.5 Sat Sep 16 14:55:48 2017

Tools Copyright (c) 1996-2014 Texas Instruments Incorporated
C:\Users\wmj\AppData\Local\Temp\1116811                              PAGE    1

       1              ;***************************************************************
       2              ;* TMS320C2000 C/C++ Codegen                         PC v6.2.5 *
       3              ;* Date/Time created: Sat Sep 16 14:55:48 2017                 *
       4              ;***************************************************************
       5                      .compiler_opts --float_support=softlib --hll_source=on --mem_model:code=flat --mem_model:data=large -
       6        0002  FP      .set    XAR2
       7              
       8              $C$DW$CU        .dwtag  DW_TAG_compile_unit
       9                      .dwattr $C$DW$CU, DW_AT_name("D:/BM1000/sw/drivers/drvic/ldc1612.c")
      10                      .dwattr $C$DW$CU, DW_AT_producer("TMS320C2000 C/C++ Codegen PC v6.2.5 Copyright (c) 1996-2014 Texas I
      11                      .dwattr $C$DW$CU, DW_AT_TI_version(0x01)
      12                      .dwattr $C$DW$CU, DW_AT_comp_dir("D:\BM1000\sw\solutions\instaspin_foc\boards\hvkit_rev1p1\f28x\f2802
      13              ;**************************************************************
      14              ;* CINIT RECORDS                                              *

    5572              $C$DW$642       .dwtag  DW_TAG_enumerator, DW_AT_name("LDC161x_RegName_RESET_DEV"), DW_AT_const_value(0x1c)
    5573              $C$DW$643       .dwtag  DW_TAG_enumerator, DW_AT_name("LDC161x_RegName_Ch0DrvCurrent"), DW_AT_const_value(0x1
    5574              $C$DW$644       .dwtag  DW_TAG_enumerator, DW_AT_name("LDC161x_RegName_Ch1DrvCurrent"), DW_AT_const_value(0x1
    5575              $C$DW$645       .dwtag  DW_TAG_enumerator, DW_AT_name("LDC161x_RegName_Ch2DrvCurrent"), DW_AT_const_value(0x2
    5576              $C$DW$646       .dwtag  DW_TAG_enumerator, DW_AT_name("LDC161x_RegName_Ch3DrvCurrent"), DW_AT_const_value(0x2
    5577              $C$DW$647       .dwtag  DW_TAG_enumerator, DW_AT_name("LDC161x_RegName_MANUFACTURER_ID"), DW_AT_const_value(0
    5578              $C$DW$648       .dwtag  DW_TAG_enumerator, DW_AT_name("LDC161x_RegName_DEVICE_ID"), DW_AT_const_value(0x7f)
    5579                      .dwendtag $C$DW$T$94
    5580              
    5581              $C$DW$T$95      .dwtag  DW_TAG_typedef, DW_AT_name("LDC161x_RegName_e")
    5582                      .dwattr $C$DW$T$95, DW_AT_type(*$C$DW$T$94)
    5583                      .dwattr $C$DW$T$95, DW_AT_language(DW_LANG_C)
    5584              $C$DW$649       .dwtag  DW_TAG_TI_far_type
    5585                      .dwattr $C$DW$649, DW_AT_type(*$C$DW$T$95)
    5586              $C$DW$T$96      .dwtag  DW_TAG_const_type
    5587                      .dwattr $C$DW$T$96, DW_AT_type(*$C$DW$649)
    5588              
    5589              $C$DW$T$97      .dwtag  DW_TAG_enumeration_type
    5590                      .dwattr $C$DW$T$97, DW_AT_byte_size(0x01)
    5591              $C$DW$650       .dwtag  DW_TAG_enumerator, DW_AT_name("LDC161x_ChNum_CH0"), DW_AT_const_value(0x00)
    5592              $C$DW$651       .dwtag  DW_TAG_enumerator, DW_AT_name("LDC161x_ChNum_CH1"), DW_AT_const_value(0x01)
    5593              $C$DW$652       .dwtag  DW_TAG_enumerator, DW_AT_name("LDC161x_ChNum_CH2"), DW_AT_const_value(0x02)
    5594              $C$DW$653       .dwtag  DW_TAG_enumerator, DW_AT_name("LDC161x_ChNum_CH3"), DW_AT_const_value(0x03)
    5595                      .dwendtag $C$DW$T$97
    5596              
    5597              $C$DW$T$98      .dwtag  DW_TAG_typedef, DW_AT_name("LDC161x_ChNum_e")
    5598                      .dwattr $C$DW$T$98, DW_AT_type(*$C$DW$T$97)
    5599                      .dwattr $C$DW$T$98, DW_AT_language(DW_LANG_C)
    5600              $C$DW$654       .dwtag  DW_TAG_TI_far_type
    5601                      .dwattr $C$DW$654, DW_AT_type(*$C$DW$T$98)
    5602              $C$DW$T$99      .dwtag  DW_TAG_const_type
    5603                      .dwattr $C$DW$T$99, DW_AT_type(*$C$DW$654)
    5604              $C$DW$655       .dwtag  DW_TAG_TI_far_type
    5605                      .dwattr $C$DW$655, DW_AT_type(*$C$DW$T$98)
    5606              $C$DW$T$100     .dwtag  DW_TAG_const_type
    5607                      .dwattr $C$DW$T$100, DW_AT_type(*$C$DW$655)
    5608              $C$DW$656       .dwtag  DW_TAG_TI_far_type
    5609                      .dwattr $C$DW$656, DW_AT_type(*$C$DW$T$98)
    5610              $C$DW$T$101     .dwtag  DW_TAG_const_type
    5611                      .dwattr $C$DW$T$101, DW_AT_type(*$C$DW$656)
    5612              $C$DW$657       .dwtag  DW_TAG_TI_far_type
    5613                      .dwattr $C$DW$657, DW_AT_type(*$C$DW$T$98)
    5614              $C$DW$T$102     .dwtag  DW_TAG_const_type
    5615                      .dwattr $C$DW$T$102, DW_AT_type(*$C$DW$657)
    5616              $C$DW$658       .dwtag  DW_TAG_TI_far_type
    5617                      .dwattr $C$DW$658, DW_AT_type(*$C$DW$T$98)
    5618              $C$DW$T$103     .dwtag  DW_TAG_const_type
    5619                      .dwattr $C$DW$T$103, DW_AT_type(*$C$DW$658)
    5620              $C$DW$659       .dwtag  DW_TAG_TI_far_type
    5621                      .dwattr $C$DW$659, DW_AT_type(*$C$DW$T$98)
    5622              $C$DW$T$104     .dwtag  DW_TAG_const_type
TMS320C2000 Assembler PC v6.2.5 Sat Sep 16 14:55:48 2017

Tools Copyright (c) 1996-2014 Texas Instruments Incorporated
C:\Users\wmj\AppData\Local\Temp\1116811                              PAGE  107

    5623                      .dwattr $C$DW$T$104, DW_AT_type(*$C$DW$659)
    5624              $C$DW$660       .dwtag  DW_TAG_TI_far_type
    5625                      .dwattr $C$DW$660, DW_AT_type(*$C$DW$T$98)
    5626              $C$DW$T$105     .dwtag  DW_TAG_const_type
    5627                      .dwattr $C$DW$T$105, DW_AT_type(*$C$DW$660)
    5628              $C$DW$661       .dwtag  DW_TAG_TI_far_type
    5629                      .dwattr $C$DW$661, DW_AT_type(*$C$DW$T$98)
    5630              $C$DW$T$106     .dwtag  DW_TAG_const_type
    5631                      .dwattr $C$DW$T$106, DW_AT_type(*$C$DW$661)
    5632              $C$DW$662       .dwtag  DW_TAG_TI_far_type
    5633                      .dwattr $C$DW$662, DW_AT_type(*$C$DW$T$98)
    5634              $C$DW$T$107     .dwtag  DW_TAG_const_type
    5635                      .dwattr $C$DW$T$107, DW_AT_type(*$C$DW$662)
    5636              $C$DW$663       .dwtag  DW_TAG_TI_far_type
    5637                      .dwattr $C$DW$663, DW_AT_type(*$C$DW$T$98)
    5638              $C$DW$T$108     .dwtag  DW_TAG_const_type
    5639                      .dwattr $C$DW$T$108, DW_AT_type(*$C$DW$663)
    5640              
    5641              $C$DW$T$22      .dwtag  DW_TAG_structure_type
    5642                      .dwattr $C$DW$T$22, DW_AT_name("Data")
    5643                      .dwattr $C$DW$T$22, DW_AT_byte_size(0x02)
    5644              $C$DW$664       .dwtag  DW_TAG_member
    5645                      .dwattr $C$DW$664, DW_AT_type(*$C$DW$T$21)
    5646                      .dwattr $C$DW$664, DW_AT_name("LSB")
    5647                      .dwattr $C$DW$664, DW_AT_TI_symbol_name("_LSB")
    5648                      .dwattr $C$DW$664, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    5649                      .dwattr $C$DW$664, DW_AT_accessibility(DW_ACCESS_public)
    5650              $C$DW$665       .dwtag  DW_TAG_member
    5651                      .dwattr $C$DW$665, DW_AT_type(*$C$DW$T$21)
    5652                      .dwattr $C$DW$665, DW_AT_name("MSB")
    5653                      .dwattr $C$DW$665, DW_AT_TI_symbol_name("_MSB")
    5654                      .dwattr $C$DW$665, DW_AT_data_member_location[DW_OP_plus_uconst 0x1]
    5655                      .dwattr $C$DW$665, DW_AT_accessibility(DW_ACCESS_public)
    5656                      .dwendtag $C$DW$T$22
    5657              
    5658              
    5659              $C$DW$T$19      .dwtag  DW_TAG_structure_type
    5660                      .dwattr $C$DW$T$19, DW_AT_name("I2C_Obj")
    5661                      .dwattr $C$DW$T$19, DW_AT_declaration
    5662                      .dwendtag $C$DW$T$19
    5663              
    5664              $C$DW$T$43      .dwtag  DW_TAG_pointer_type
    5665                      .dwattr $C$DW$T$43, DW_AT_type(*$C$DW$T$19)
    5666                      .dwattr $C$DW$T$43, DW_AT_address_class(0x16)
    5667              $C$DW$T$44      .dwtag  DW_TAG_typedef, DW_AT_name("I2C_Handle")
    5668                      .dwattr $C$DW$T$44, DW_AT_type(*$C$DW$T$43)
    5669                      .dwattr $C$DW$T$44, DW_AT_language(DW_LANG_C)
    5670              $C$DW$666       .dwtag  DW_TAG_TI_far_type
    5671                      .dwattr $C$DW$666, DW_AT_type(*$C$DW$T$44)
    5672              $C$DW$T$109     .dwtag  DW_TAG_const_type
    5673                      .dwattr $C$DW$T$109, DW_AT_type(*$C$DW$666)
    5674              
    5675              $C$DW$T$20      .dwtag  DW_TAG_structure_type
    5676                      .dwattr $C$DW$T$20, DW_AT_name("LDC161x_REG_Obj")
    5677                      .dwattr $C$DW$T$20, DW_AT_declaration
TMS320C2000 Assembler PC v6.2.5 Sat Sep 16 14:55:48 2017

Tools Copyright (c) 1996-2014 Texas Instruments Incorporated
C:\Users\wmj\AppData\Local\Temp\1116811                              PAGE  108

    5678                      .dwendtag $C$DW$T$20
    5679              
    5680              $C$DW$T$47      .dwtag  DW_TAG_pointer_type
    5681                      .dwattr $C$DW$T$47, DW_AT_type(*$C$DW$T$20)
    5682                      .dwattr $C$DW$T$47, DW_AT_address_class(0x16)
    5683              $C$DW$T$48      .dwtag  DW_TAG_typedef, DW_AT_name("LDC_Handle")
    5684                      .dwattr $C$DW$T$48, DW_AT_type(*$C$DW$T$47)
    5685                      .dwattr $C$DW$T$48, DW_AT_language(DW_LANG_C)
    5686              $C$DW$667       .dwtag  DW_TAG_TI_far_type
    5687                      .dwattr $C$DW$667, DW_AT_type(*$C$DW$T$48)
    5688              $C$DW$T$111     .dwtag  DW_TAG_const_type
    5689                      .dwattr $C$DW$T$111, DW_AT_type(*$C$DW$667)
    5690              
    5691              $C$DW$T$23      .dwtag  DW_TAG_structure_type
    5692                      .dwattr $C$DW$T$23, DW_AT_name("_CLK_DIV_t_")
    5693                      .dwattr $C$DW$T$23, DW_AT_byte_size(0x02)
    5694              $C$DW$668       .dwtag  DW_TAG_member
    5695                      .dwattr $C$DW$668, DW_AT_type(*$C$DW$T$21)
    5696                      .dwattr $C$DW$668, DW_AT_name("FREF_DIVIDER")
    5697                      .dwattr $C$DW$668, DW_AT_TI_symbol_name("_FREF_DIVIDER")
    5698                      .dwattr $C$DW$668, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    5699                      .dwattr $C$DW$668, DW_AT_accessibility(DW_ACCESS_public)
    5700              $C$DW$669       .dwtag  DW_TAG_member
    5701                      .dwattr $C$DW$669, DW_AT_type(*$C$DW$T$21)
    5702                      .dwattr $C$DW$669, DW_AT_name("FIN_DIVIDER")
    5703                      .dwattr $C$DW$669, DW_AT_TI_symbol_name("_FIN_DIVIDER")
    5704                      .dwattr $C$DW$669, DW_AT_data_member_location[DW_OP_plus_uconst 0x1]
    5705                      .dwattr $C$DW$669, DW_AT_accessibility(DW_ACCESS_public)
    5706                      .dwendtag $C$DW$T$23
    5707              
    5708              $C$DW$T$37      .dwtag  DW_TAG_typedef, DW_AT_name("CLK_DIV_t_")
    5709                      .dwattr $C$DW$T$37, DW_AT_type(*$C$DW$T$23)
    5710                      .dwattr $C$DW$T$37, DW_AT_language(DW_LANG_C)
    5711              
    5712              $C$DW$T$24      .dwtag  DW_TAG_structure_type
    5713                      .dwattr $C$DW$T$24, DW_AT_name("_DRIVE_CURRENT_t_")
    5714                      .dwattr $C$DW$T$24, DW_AT_byte_size(0x02)
    5715              $C$DW$670       .dwtag  DW_TAG_member
    5716                      .dwattr $C$DW$670, DW_AT_type(*$C$DW$T$21)
    5717                      .dwattr $C$DW$670, DW_AT_name("IDRIVE")
    5718                      .dwattr $C$DW$670, DW_AT_TI_symbol_name("_IDRIVE")
    5719                      .dwattr $C$DW$670, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    5720                      .dwattr $C$DW$670, DW_AT_accessibility(DW_ACCESS_public)
    5721              $C$DW$671       .dwtag  DW_TAG_member
    5722                      .dwattr $C$DW$671, DW_AT_type(*$C$DW$T$21)
    5723                      .dwattr $C$DW$671, DW_AT_name("INIT_IDRIVE")
    5724                      .dwattr $C$DW$671, DW_AT_TI_symbol_name("_INIT_IDRIVE")
    5725                      .dwattr $C$DW$671, DW_AT_data_member_location[DW_OP_plus_uconst 0x1]
    5726                      .dwattr $C$DW$671, DW_AT_accessibility(DW_ACCESS_public)
    5727                      .dwendtag $C$DW$T$24
    5728              
    5729              $C$DW$T$61      .dwtag  DW_TAG_typedef, DW_AT_name("DRIVE_CURRENT_t_")
    5730                      .dwattr $C$DW$T$61, DW_AT_type(*$C$DW$T$24)
    5731                      .dwattr $C$DW$T$61, DW_AT_language(DW_LANG_C)
    5732              
TMS320C2000 Assembler PC v6.2.5 Sat Sep 16 14:55:48 2017

Tools Copyright (c) 1996-2014 Texas Instruments Incorporated
C:\Users\wmj\AppData\Local\Temp\1116811                              PAGE  109

    5733              $C$DW$T$34      .dwtag  DW_TAG_structure_type
    5734                      .dwattr $C$DW$T$34, DW_AT_name("_GPIO_Obj_")
    5735                      .dwattr $C$DW$T$34, DW_AT_byte_size(0x6a)
    5736              $C$DW$672       .dwtag  DW_TAG_member
    5737                      .dwattr $C$DW$672, DW_AT_type(*$C$DW$T$26)
    5738                      .dwattr $C$DW$672, DW_AT_name("GPACTRL")
    5739                      .dwattr $C$DW$672, DW_AT_TI_symbol_name("_GPACTRL")
    5740                      .dwattr $C$DW$672, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    5741                      .dwattr $C$DW$672, DW_AT_accessibility(DW_ACCESS_public)
    5742              $C$DW$673       .dwtag  DW_TAG_member
    5743                      .dwattr $C$DW$673, DW_AT_type(*$C$DW$T$26)
    5744                      .dwattr $C$DW$673, DW_AT_name("GPAQSEL1")
    5745                      .dwattr $C$DW$673, DW_AT_TI_symbol_name("_GPAQSEL1")
    5746                      .dwattr $C$DW$673, DW_AT_data_member_location[DW_OP_plus_uconst 0x2]
    5747                      .dwattr $C$DW$673, DW_AT_accessibility(DW_ACCESS_public)
    5748              $C$DW$674       .dwtag  DW_TAG_member
    5749                      .dwattr $C$DW$674, DW_AT_type(*$C$DW$T$26)
    5750                      .dwattr $C$DW$674, DW_AT_name("GPAQSEL2")
    5751                      .dwattr $C$DW$674, DW_AT_TI_symbol_name("_GPAQSEL2")
    5752                      .dwattr $C$DW$674, DW_AT_data_member_location[DW_OP_plus_uconst 0x4]
    5753                      .dwattr $C$DW$674, DW_AT_accessibility(DW_ACCESS_public)
    5754              $C$DW$675       .dwtag  DW_TAG_member
    5755                      .dwattr $C$DW$675, DW_AT_type(*$C$DW$T$26)
    5756                      .dwattr $C$DW$675, DW_AT_name("GPAMUX1")
    5757                      .dwattr $C$DW$675, DW_AT_TI_symbol_name("_GPAMUX1")
    5758                      .dwattr $C$DW$675, DW_AT_data_member_location[DW_OP_plus_uconst 0x6]
    5759                      .dwattr $C$DW$675, DW_AT_accessibility(DW_ACCESS_public)
    5760              $C$DW$676       .dwtag  DW_TAG_member
    5761                      .dwattr $C$DW$676, DW_AT_type(*$C$DW$T$26)
    5762                      .dwattr $C$DW$676, DW_AT_name("GPAMUX2")
    5763                      .dwattr $C$DW$676, DW_AT_TI_symbol_name("_GPAMUX2")
    5764                      .dwattr $C$DW$676, DW_AT_data_member_location[DW_OP_plus_uconst 0x8]
    5765                      .dwattr $C$DW$676, DW_AT_accessibility(DW_ACCESS_public)
    5766              $C$DW$677       .dwtag  DW_TAG_member
    5767                      .dwattr $C$DW$677, DW_AT_type(*$C$DW$T$26)
    5768                      .dwattr $C$DW$677, DW_AT_name("GPADIR")
    5769                      .dwattr $C$DW$677, DW_AT_TI_symbol_name("_GPADIR")
    5770                      .dwattr $C$DW$677, DW_AT_data_member_location[DW_OP_plus_uconst 0xa]
    5771                      .dwattr $C$DW$677, DW_AT_accessibility(DW_ACCESS_public)
    5772              $C$DW$678       .dwtag  DW_TAG_member
    5773                      .dwattr $C$DW$678, DW_AT_type(*$C$DW$T$26)
    5774                      .dwattr $C$DW$678, DW_AT_name("GPAPUD")
    5775                      .dwattr $C$DW$678, DW_AT_TI_symbol_name("_GPAPUD")
    5776                      .dwattr $C$DW$678, DW_AT_data_member_location[DW_OP_plus_uconst 0xc]
    5777                      .dwattr $C$DW$678, DW_AT_accessibility(DW_ACCESS_public)
    5778              $C$DW$679       .dwtag  DW_TAG_member
    5779                      .dwattr $C$DW$679, DW_AT_type(*$C$DW$T$28)
    5780                      .dwattr $C$DW$679, DW_AT_name("rsvd_1")
    5781                      .dwattr $C$DW$679, DW_AT_TI_symbol_name("_rsvd_1")
    5782                      .dwattr $C$DW$679, DW_AT_data_member_location[DW_OP_plus_uconst 0xe]
    5783                      .dwattr $C$DW$679, DW_AT_accessibility(DW_ACCESS_public)
    5784              $C$DW$680       .dwtag  DW_TAG_member
    5785                      .dwattr $C$DW$680, DW_AT_type(*$C$DW$T$26)
    5786                      .dwattr $C$DW$680, DW_AT_name("GPBCTRL")
    5787                      .dwattr $C$DW$680, DW_AT_TI_symbol_name("_GPBCTRL")
TMS320C2000 Assembler PC v6.2.5 Sat Sep 16 14:55:48 2017

Tools Copyright (c) 1996-2014 Texas Instruments Incorporated
C:\Users\wmj\AppData\Local\Temp\1116811                              PAGE  110

    5788                      .dwattr $C$DW$680, DW_AT_data_member_location[DW_OP_plus_uconst 0x10]
    5789                      .dwattr $C$DW$680, DW_AT_accessibility(DW_ACCESS_public)
    5790              $C$DW$681       .dwtag  DW_TAG_member
    5791                      .dwattr $C$DW$681, DW_AT_type(*$C$DW$T$26)
    5792                      .dwattr $C$DW$681, DW_AT_name("GPBQSEL1")
    5793                      .dwattr $C$DW$681, DW_AT_TI_symbol_name("_GPBQSEL1")
    5794                      .dwattr $C$DW$681, DW_AT_data_member_location[DW_OP_plus_uconst 0x12]
    5795                      .dwattr $C$DW$681, DW_AT_accessibility(DW_ACCESS_public)
    5796              $C$DW$682       .dwtag  DW_TAG_member
    5797                      .dwattr $C$DW$682, DW_AT_type(*$C$DW$T$28)
    5798                      .dwattr $C$DW$682, DW_AT_name("rsvd_2")
    5799                      .dwattr $C$DW$682, DW_AT_TI_symbol_name("_rsvd_2")
    5800                      .dwattr $C$DW$682, DW_AT_data_member_location[DW_OP_plus_uconst 0x14]
    5801                      .dwattr $C$DW$682, DW_AT_accessibility(DW_ACCESS_public)
    5802              $C$DW$683       .dwtag  DW_TAG_member
    5803                      .dwattr $C$DW$683, DW_AT_type(*$C$DW$T$26)
    5804                      .dwattr $C$DW$683, DW_AT_name("GPBMUX1")
    5805                      .dwattr $C$DW$683, DW_AT_TI_symbol_name("_GPBMUX1")
    5806                      .dwattr $C$DW$683, DW_AT_data_member_location[DW_OP_plus_uconst 0x16]
    5807                      .dwattr $C$DW$683, DW_AT_accessibility(DW_ACCESS_public)
    5808              $C$DW$684       .dwtag  DW_TAG_member
    5809                      .dwattr $C$DW$684, DW_AT_type(*$C$DW$T$28)
    5810                      .dwattr $C$DW$684, DW_AT_name("rsvd_3")
    5811                      .dwattr $C$DW$684, DW_AT_TI_symbol_name("_rsvd_3")
    5812                      .dwattr $C$DW$684, DW_AT_data_member_location[DW_OP_plus_uconst 0x18]
    5813                      .dwattr $C$DW$684, DW_AT_accessibility(DW_ACCESS_public)
    5814              $C$DW$685       .dwtag  DW_TAG_member
    5815                      .dwattr $C$DW$685, DW_AT_type(*$C$DW$T$26)
    5816                      .dwattr $C$DW$685, DW_AT_name("GPBDIR")
    5817                      .dwattr $C$DW$685, DW_AT_TI_symbol_name("_GPBDIR")
    5818                      .dwattr $C$DW$685, DW_AT_data_member_location[DW_OP_plus_uconst 0x1a]
    5819                      .dwattr $C$DW$685, DW_AT_accessibility(DW_ACCESS_public)
    5820              $C$DW$686       .dwtag  DW_TAG_member
    5821                      .dwattr $C$DW$686, DW_AT_type(*$C$DW$T$26)
    5822                      .dwattr $C$DW$686, DW_AT_name("GPBPUD")
    5823                      .dwattr $C$DW$686, DW_AT_TI_symbol_name("_GPBPUD")
    5824                      .dwattr $C$DW$686, DW_AT_data_member_location[DW_OP_plus_uconst 0x1c]
    5825                      .dwattr $C$DW$686, DW_AT_accessibility(DW_ACCESS_public)
    5826              $C$DW$687       .dwtag  DW_TAG_member
    5827                      .dwattr $C$DW$687, DW_AT_type(*$C$DW$T$29)
    5828                      .dwattr $C$DW$687, DW_AT_name("rsvd_4")
    5829                      .dwattr $C$DW$687, DW_AT_TI_symbol_name("_rsvd_4")
    5830                      .dwattr $C$DW$687, DW_AT_data_member_location[DW_OP_plus_uconst 0x1e]
    5831                      .dwattr $C$DW$687, DW_AT_accessibility(DW_ACCESS_public)
    5832              $C$DW$688       .dwtag  DW_TAG_member
    5833                      .dwattr $C$DW$688, DW_AT_type(*$C$DW$T$26)
    5834                      .dwattr $C$DW$688, DW_AT_name("AIOMUX1")
    5835                      .dwattr $C$DW$688, DW_AT_TI_symbol_name("_AIOMUX1")
    5836                      .dwattr $C$DW$688, DW_AT_data_member_location[DW_OP_plus_uconst 0x36]
    5837                      .dwattr $C$DW$688, DW_AT_accessibility(DW_ACCESS_public)
    5838              $C$DW$689       .dwtag  DW_TAG_member
    5839                      .dwattr $C$DW$689, DW_AT_type(*$C$DW$T$28)
    5840                      .dwattr $C$DW$689, DW_AT_name("rsvd_5")
    5841                      .dwattr $C$DW$689, DW_AT_TI_symbol_name("_rsvd_5")
    5842                      .dwattr $C$DW$689, DW_AT_data_member_location[DW_OP_plus_uconst 0x38]
TMS320C2000 Assembler PC v6.2.5 Sat Sep 16 14:55:48 2017

Tools Copyright (c) 1996-2014 Texas Instruments Incorporated
C:\Users\wmj\AppData\Local\Temp\1116811                              PAGE  111

    5843                      .dwattr $C$DW$689, DW_AT_accessibility(DW_ACCESS_public)
    5844              $C$DW$690       .dwtag  DW_TAG_member
    5845                      .dwattr $C$DW$690, DW_AT_type(*$C$DW$T$26)
    5846                      .dwattr $C$DW$690, DW_AT_name("AIODIR")
    5847                      .dwattr $C$DW$690, DW_AT_TI_symbol_name("_AIODIR")
    5848                      .dwattr $C$DW$690, DW_AT_data_member_location[DW_OP_plus_uconst 0x3a]
    5849                      .dwattr $C$DW$690, DW_AT_accessibility(DW_ACCESS_public)
    5850              $C$DW$691       .dwtag  DW_TAG_member
    5851                      .dwattr $C$DW$691, DW_AT_type(*$C$DW$T$30)
    5852                      .dwattr $C$DW$691, DW_AT_name("rsvd_6")
    5853                      .dwattr $C$DW$691, DW_AT_TI_symbol_name("_rsvd_6")
    5854                      .dwattr $C$DW$691, DW_AT_data_member_location[DW_OP_plus_uconst 0x3c]
    5855                      .dwattr $C$DW$691, DW_AT_accessibility(DW_ACCESS_public)
    5856              $C$DW$692       .dwtag  DW_TAG_member
    5857                      .dwattr $C$DW$692, DW_AT_type(*$C$DW$T$26)
    5858                      .dwattr $C$DW$692, DW_AT_name("GPADAT")
    5859                      .dwattr $C$DW$692, DW_AT_TI_symbol_name("_GPADAT")
    5860                      .dwattr $C$DW$692, DW_AT_data_member_location[DW_OP_plus_uconst 0x40]
    5861                      .dwattr $C$DW$692, DW_AT_accessibility(DW_ACCESS_public)
    5862              $C$DW$693       .dwtag  DW_TAG_member
    5863                      .dwattr $C$DW$693, DW_AT_type(*$C$DW$T$26)
    5864                      .dwattr $C$DW$693, DW_AT_name("GPASET")
    5865                      .dwattr $C$DW$693, DW_AT_TI_symbol_name("_GPASET")
    5866                      .dwattr $C$DW$693, DW_AT_data_member_location[DW_OP_plus_uconst 0x42]
    5867                      .dwattr $C$DW$693, DW_AT_accessibility(DW_ACCESS_public)
    5868              $C$DW$694       .dwtag  DW_TAG_member
    5869                      .dwattr $C$DW$694, DW_AT_type(*$C$DW$T$26)
    5870                      .dwattr $C$DW$694, DW_AT_name("GPACLEAR")
    5871                      .dwattr $C$DW$694, DW_AT_TI_symbol_name("_GPACLEAR")
    5872                      .dwattr $C$DW$694, DW_AT_data_member_location[DW_OP_plus_uconst 0x44]
    5873                      .dwattr $C$DW$694, DW_AT_accessibility(DW_ACCESS_public)
    5874              $C$DW$695       .dwtag  DW_TAG_member
    5875                      .dwattr $C$DW$695, DW_AT_type(*$C$DW$T$26)
    5876                      .dwattr $C$DW$695, DW_AT_name("GPATOGGLE")
    5877                      .dwattr $C$DW$695, DW_AT_TI_symbol_name("_GPATOGGLE")
    5878                      .dwattr $C$DW$695, DW_AT_data_member_location[DW_OP_plus_uconst 0x46]
    5879                      .dwattr $C$DW$695, DW_AT_accessibility(DW_ACCESS_public)
    5880              $C$DW$696       .dwtag  DW_TAG_member
    5881                      .dwattr $C$DW$696, DW_AT_type(*$C$DW$T$26)
    5882                      .dwattr $C$DW$696, DW_AT_name("GPBDAT")
    5883                      .dwattr $C$DW$696, DW_AT_TI_symbol_name("_GPBDAT")
    5884                      .dwattr $C$DW$696, DW_AT_data_member_location[DW_OP_plus_uconst 0x48]
    5885                      .dwattr $C$DW$696, DW_AT_accessibility(DW_ACCESS_public)
    5886              $C$DW$697       .dwtag  DW_TAG_member
    5887                      .dwattr $C$DW$697, DW_AT_type(*$C$DW$T$26)
    5888                      .dwattr $C$DW$697, DW_AT_name("GPBSET")
    5889                      .dwattr $C$DW$697, DW_AT_TI_symbol_name("_GPBSET")
    5890                      .dwattr $C$DW$697, DW_AT_data_member_location[DW_OP_plus_uconst 0x4a]
    5891                      .dwattr $C$DW$697, DW_AT_accessibility(DW_ACCESS_public)
    5892              $C$DW$698       .dwtag  DW_TAG_member
    5893                      .dwattr $C$DW$698, DW_AT_type(*$C$DW$T$26)
    5894                      .dwattr $C$DW$698, DW_AT_name("GPBCLEAR")
    5895                      .dwattr $C$DW$698, DW_AT_TI_symbol_name("_GPBCLEAR")
    5896                      .dwattr $C$DW$698, DW_AT_data_member_location[DW_OP_plus_uconst 0x4c]
    5897                      .dwattr $C$DW$698, DW_AT_accessibility(DW_ACCESS_public)
TMS320C2000 Assembler PC v6.2.5 Sat Sep 16 14:55:48 2017

Tools Copyright (c) 1996-2014 Texas Instruments Incorporated
C:\Users\wmj\AppData\Local\Temp\1116811                              PAGE  112

    5898              $C$DW$699       .dwtag  DW_TAG_member
    5899                      .dwattr $C$DW$699, DW_AT_type(*$C$DW$T$26)
    5900                      .dwattr $C$DW$699, DW_AT_name("GPBTOGGLE")
    5901                      .dwattr $C$DW$699, DW_AT_TI_symbol_name("_GPBTOGGLE")
    5902                      .dwattr $C$DW$699, DW_AT_data_member_location[DW_OP_plus_uconst 0x4e]
    5903                      .dwattr $C$DW$699, DW_AT_accessibility(DW_ACCESS_public)
    5904              $C$DW$700       .dwtag  DW_TAG_member
    5905                      .dwattr $C$DW$700, DW_AT_type(*$C$DW$T$31)
    5906                      .dwattr $C$DW$700, DW_AT_name("rsvd_7")
    5907                      .dwattr $C$DW$700, DW_AT_TI_symbol_name("_rsvd_7")
    5908                      .dwattr $C$DW$700, DW_AT_data_member_location[DW_OP_plus_uconst 0x50]
    5909                      .dwattr $C$DW$700, DW_AT_accessibility(DW_ACCESS_public)
    5910              $C$DW$701       .dwtag  DW_TAG_member
    5911                      .dwattr $C$DW$701, DW_AT_type(*$C$DW$T$26)
    5912                      .dwattr $C$DW$701, DW_AT_name("AIODAT")
    5913                      .dwattr $C$DW$701, DW_AT_TI_symbol_name("_AIODAT")
    5914                      .dwattr $C$DW$701, DW_AT_data_member_location[DW_OP_plus_uconst 0x58]
    5915                      .dwattr $C$DW$701, DW_AT_accessibility(DW_ACCESS_public)
    5916              $C$DW$702       .dwtag  DW_TAG_member
    5917                      .dwattr $C$DW$702, DW_AT_type(*$C$DW$T$26)
    5918                      .dwattr $C$DW$702, DW_AT_name("AIOSET")
    5919                      .dwattr $C$DW$702, DW_AT_TI_symbol_name("_AIOSET")
    5920                      .dwattr $C$DW$702, DW_AT_data_member_location[DW_OP_plus_uconst 0x5a]
    5921                      .dwattr $C$DW$702, DW_AT_accessibility(DW_ACCESS_public)
    5922              $C$DW$703       .dwtag  DW_TAG_member
    5923                      .dwattr $C$DW$703, DW_AT_type(*$C$DW$T$26)
    5924                      .dwattr $C$DW$703, DW_AT_name("AIOCLEAR")
    5925                      .dwattr $C$DW$703, DW_AT_TI_symbol_name("_AIOCLEAR")
    5926                      .dwattr $C$DW$703, DW_AT_data_member_location[DW_OP_plus_uconst 0x5c]
    5927                      .dwattr $C$DW$703, DW_AT_accessibility(DW_ACCESS_public)
    5928              $C$DW$704       .dwtag  DW_TAG_member
    5929                      .dwattr $C$DW$704, DW_AT_type(*$C$DW$T$26)
    5930                      .dwattr $C$DW$704, DW_AT_name("AIOTOGGLE")
    5931                      .dwattr $C$DW$704, DW_AT_TI_symbol_name("_AIOTOGGLE")
    5932                      .dwattr $C$DW$704, DW_AT_data_member_location[DW_OP_plus_uconst 0x5e]
    5933                      .dwattr $C$DW$704, DW_AT_accessibility(DW_ACCESS_public)
    5934              $C$DW$705       .dwtag  DW_TAG_member
    5935                      .dwattr $C$DW$705, DW_AT_type(*$C$DW$T$32)
    5936                      .dwattr $C$DW$705, DW_AT_name("GPIOXINTnSEL")
    5937                      .dwattr $C$DW$705, DW_AT_TI_symbol_name("_GPIOXINTnSEL")
    5938                      .dwattr $C$DW$705, DW_AT_data_member_location[DW_OP_plus_uconst 0x60]
    5939                      .dwattr $C$DW$705, DW_AT_accessibility(DW_ACCESS_public)
    5940              $C$DW$706       .dwtag  DW_TAG_member
    5941                      .dwattr $C$DW$706, DW_AT_type(*$C$DW$T$33)
    5942                      .dwattr $C$DW$706, DW_AT_name("rsvd_8")
    5943                      .dwattr $C$DW$706, DW_AT_TI_symbol_name("_rsvd_8")
    5944                      .dwattr $C$DW$706, DW_AT_data_member_location[DW_OP_plus_uconst 0x63]
    5945                      .dwattr $C$DW$706, DW_AT_accessibility(DW_ACCESS_public)
    5946              $C$DW$707       .dwtag  DW_TAG_member
    5947                      .dwattr $C$DW$707, DW_AT_type(*$C$DW$T$26)
    5948                      .dwattr $C$DW$707, DW_AT_name("GPIOLPMSEL")
    5949                      .dwattr $C$DW$707, DW_AT_TI_symbol_name("_GPIOLPMSEL")
    5950                      .dwattr $C$DW$707, DW_AT_data_member_location[DW_OP_plus_uconst 0x68]
    5951                      .dwattr $C$DW$707, DW_AT_accessibility(DW_ACCESS_public)
    5952                      .dwendtag $C$DW$T$34
TMS320C2000 Assembler PC v6.2.5 Sat Sep 16 14:55:48 2017

Tools Copyright (c) 1996-2014 Texas Instruments Incorporated
C:\Users\wmj\AppData\Local\Temp\1116811                              PAGE  113

    5953              
    5954              $C$DW$T$45      .dwtag  DW_TAG_pointer_type
    5955                      .dwattr $C$DW$T$45, DW_AT_type(*$C$DW$T$34)
    5956                      .dwattr $C$DW$T$45, DW_AT_address_class(0x16)
    5957              $C$DW$T$46      .dwtag  DW_TAG_typedef, DW_AT_name("GPIO_Handle")
    5958                      .dwattr $C$DW$T$46, DW_AT_type(*$C$DW$T$45)
    5959                      .dwattr $C$DW$T$46, DW_AT_language(DW_LANG_C)
    5960              $C$DW$708       .dwtag  DW_TAG_TI_far_type
    5961                      .dwattr $C$DW$708, DW_AT_type(*$C$DW$T$46)
    5962              $C$DW$T$118     .dwtag  DW_TAG_const_type
    5963                      .dwattr $C$DW$T$118, DW_AT_type(*$C$DW$708)
    5964              
    5965              $C$DW$T$36      .dwtag  DW_TAG_structure_type
    5966                      .dwattr $C$DW$T$36, DW_AT_name("_LDC1612_CONFIG_t_")
    5967                      .dwattr $C$DW$T$36, DW_AT_byte_size(0x09)
    5968              $C$DW$709       .dwtag  DW_TAG_member
    5969                      .dwattr $C$DW$709, DW_AT_type(*$C$DW$T$35)
    5970                      .dwattr $C$DW$709, DW_AT_name("ACTIVE_CHAN_0")
    5971                      .dwattr $C$DW$709, DW_AT_TI_symbol_name("_ACTIVE_CHAN_0")
    5972                      .dwattr $C$DW$709, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    5973                      .dwattr $C$DW$709, DW_AT_accessibility(DW_ACCESS_public)
    5974              $C$DW$710       .dwtag  DW_TAG_member
    5975                      .dwattr $C$DW$710, DW_AT_type(*$C$DW$T$35)
    5976                      .dwattr $C$DW$710, DW_AT_name("ACTIVE_CHAN_1")
    5977                      .dwattr $C$DW$710, DW_AT_TI_symbol_name("_ACTIVE_CHAN_1")
    5978                      .dwattr $C$DW$710, DW_AT_data_member_location[DW_OP_plus_uconst 0x1]
    5979                      .dwattr $C$DW$710, DW_AT_accessibility(DW_ACCESS_public)
    5980              $C$DW$711       .dwtag  DW_TAG_member
    5981                      .dwattr $C$DW$711, DW_AT_type(*$C$DW$T$35)
    5982                      .dwattr $C$DW$711, DW_AT_name("SLEEP_MODE_EN")
    5983                      .dwattr $C$DW$711, DW_AT_TI_symbol_name("_SLEEP_MODE_EN")
    5984                      .dwattr $C$DW$711, DW_AT_data_member_location[DW_OP_plus_uconst 0x2]
    5985                      .dwattr $C$DW$711, DW_AT_accessibility(DW_ACCESS_public)
    5986              $C$DW$712       .dwtag  DW_TAG_member
    5987                      .dwattr $C$DW$712, DW_AT_type(*$C$DW$T$35)
    5988                      .dwattr $C$DW$712, DW_AT_name("RP_OVERRIDE_EN")
    5989                      .dwattr $C$DW$712, DW_AT_TI_symbol_name("_RP_OVERRIDE_EN")
    5990                      .dwattr $C$DW$712, DW_AT_data_member_location[DW_OP_plus_uconst 0x3]
    5991                      .dwattr $C$DW$712, DW_AT_accessibility(DW_ACCESS_public)
    5992              $C$DW$713       .dwtag  DW_TAG_member
    5993                      .dwattr $C$DW$713, DW_AT_type(*$C$DW$T$35)
    5994                      .dwattr $C$DW$713, DW_AT_name("SENSOR_ACTV_SEL")
    5995                      .dwattr $C$DW$713, DW_AT_TI_symbol_name("_SENSOR_ACTV_SEL")
    5996                      .dwattr $C$DW$713, DW_AT_data_member_location[DW_OP_plus_uconst 0x4]
    5997                      .dwattr $C$DW$713, DW_AT_accessibility(DW_ACCESS_public)
    5998              $C$DW$714       .dwtag  DW_TAG_member
    5999                      .dwattr $C$DW$714, DW_AT_type(*$C$DW$T$35)
    6000                      .dwattr $C$DW$714, DW_AT_name("AUTO_AMP_DIS")
    6001                      .dwattr $C$DW$714, DW_AT_TI_symbol_name("_AUTO_AMP_DIS")
    6002                      .dwattr $C$DW$714, DW_AT_data_member_location[DW_OP_plus_uconst 0x5]
    6003                      .dwattr $C$DW$714, DW_AT_accessibility(DW_ACCESS_public)
    6004              $C$DW$715       .dwtag  DW_TAG_member
    6005                      .dwattr $C$DW$715, DW_AT_type(*$C$DW$T$35)
    6006                      .dwattr $C$DW$715, DW_AT_name("REF_CLK_SRC")
    6007                      .dwattr $C$DW$715, DW_AT_TI_symbol_name("_REF_CLK_SRC")
TMS320C2000 Assembler PC v6.2.5 Sat Sep 16 14:55:48 2017

Tools Copyright (c) 1996-2014 Texas Instruments Incorporated
C:\Users\wmj\AppData\Local\Temp\1116811                              PAGE  114

    6008                      .dwattr $C$DW$715, DW_AT_data_member_location[DW_OP_plus_uconst 0x6]
    6009                      .dwattr $C$DW$715, DW_AT_accessibility(DW_ACCESS_public)
    6010              $C$DW$716       .dwtag  DW_TAG_member
    6011                      .dwattr $C$DW$716, DW_AT_type(*$C$DW$T$35)
    6012                      .dwattr $C$DW$716, DW_AT_name("INTB_DIS")
    6013                      .dwattr $C$DW$716, DW_AT_TI_symbol_name("_INTB_DIS")
    6014                      .dwattr $C$DW$716, DW_AT_data_member_location[DW_OP_plus_uconst 0x7]
    6015                      .dwattr $C$DW$716, DW_AT_accessibility(DW_ACCESS_public)
    6016              $C$DW$717       .dwtag  DW_TAG_member
    6017                      .dwattr $C$DW$717, DW_AT_type(*$C$DW$T$35)
    6018                      .dwattr $C$DW$717, DW_AT_name("HIGH_CURRENT_DRV")
    6019                      .dwattr $C$DW$717, DW_AT_TI_symbol_name("_HIGH_CURRENT_DRV")
    6020                      .dwattr $C$DW$717, DW_AT_data_member_location[DW_OP_plus_uconst 0x8]
    6021                      .dwattr $C$DW$717, DW_AT_accessibility(DW_ACCESS_public)
    6022                      .dwendtag $C$DW$T$36
    6023              
    6024              $C$DW$T$59      .dwtag  DW_TAG_typedef, DW_AT_name("LDC1612_CONFIG_t_")
    6025                      .dwattr $C$DW$T$59, DW_AT_type(*$C$DW$T$36)
    6026                      .dwattr $C$DW$T$59, DW_AT_language(DW_LANG_C)
    6027              
    6028              $C$DW$T$38      .dwtag  DW_TAG_structure_type
    6029                      .dwattr $C$DW$T$38, DW_AT_name("_LDC161x_CLK_DIVS_t_")
    6030                      .dwattr $C$DW$T$38, DW_AT_byte_size(0x02)
    6031              $C$DW$718       .dwtag  DW_TAG_member
    6032                      .dwattr $C$DW$718, DW_AT_type(*$C$DW$T$37)
    6033                      .dwattr $C$DW$718, DW_AT_name("CLK_DIVS_CH0")
    6034                      .dwattr $C$DW$718, DW_AT_TI_symbol_name("_CLK_DIVS_CH0")
    6035                      .dwattr $C$DW$718, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    6036                      .dwattr $C$DW$718, DW_AT_accessibility(DW_ACCESS_public)
    6037                      .dwendtag $C$DW$T$38
    6038              
    6039              $C$DW$T$56      .dwtag  DW_TAG_typedef, DW_AT_name("LDC161x_CLK_DIVS_t_")
    6040                      .dwattr $C$DW$T$56, DW_AT_type(*$C$DW$T$38)
    6041                      .dwattr $C$DW$T$56, DW_AT_language(DW_LANG_C)
    6042              
    6043              $C$DW$T$39      .dwtag  DW_TAG_structure_type
    6044                      .dwattr $C$DW$T$39, DW_AT_name("_LDC161x_ERROR_CONFIG_t_")
    6045                      .dwattr $C$DW$T$39, DW_AT_byte_size(0x0c)
    6046              $C$DW$719       .dwtag  DW_TAG_member
    6047                      .dwattr $C$DW$719, DW_AT_type(*$C$DW$T$35)
    6048                      .dwattr $C$DW$719, DW_AT_name("UR_ERR2OUT")
    6049                      .dwattr $C$DW$719, DW_AT_TI_symbol_name("_UR_ERR2OUT")
    6050                      .dwattr $C$DW$719, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    6051                      .dwattr $C$DW$719, DW_AT_accessibility(DW_ACCESS_public)
    6052              $C$DW$720       .dwtag  DW_TAG_member
    6053                      .dwattr $C$DW$720, DW_AT_type(*$C$DW$T$35)
    6054                      .dwattr $C$DW$720, DW_AT_name("OR_ERR2OUT")
    6055                      .dwattr $C$DW$720, DW_AT_TI_symbol_name("_OR_ERR2OUT")
    6056                      .dwattr $C$DW$720, DW_AT_data_member_location[DW_OP_plus_uconst 0x1]
    6057                      .dwattr $C$DW$720, DW_AT_accessibility(DW_ACCESS_public)
    6058              $C$DW$721       .dwtag  DW_TAG_member
    6059                      .dwattr $C$DW$721, DW_AT_type(*$C$DW$T$35)
    6060                      .dwattr $C$DW$721, DW_AT_name("WD_ERR2OUT")
    6061                      .dwattr $C$DW$721, DW_AT_TI_symbol_name("_WD_ERR2OUT")
    6062                      .dwattr $C$DW$721, DW_AT_data_member_location[DW_OP_plus_uconst 0x2]
TMS320C2000 Assembler PC v6.2.5 Sat Sep 16 14:55:48 2017

Tools Copyright (c) 1996-2014 Texas Instruments Incorporated
C:\Users\wmj\AppData\Local\Temp\1116811                              PAGE  115

    6063                      .dwattr $C$DW$721, DW_AT_accessibility(DW_ACCESS_public)
    6064              $C$DW$722       .dwtag  DW_TAG_member
    6065                      .dwattr $C$DW$722, DW_AT_type(*$C$DW$T$35)
    6066                      .dwattr $C$DW$722, DW_AT_name("AH_ERR2OUT")
    6067                      .dwattr $C$DW$722, DW_AT_TI_symbol_name("_AH_ERR2OUT")
    6068                      .dwattr $C$DW$722, DW_AT_data_member_location[DW_OP_plus_uconst 0x3]
    6069                      .dwattr $C$DW$722, DW_AT_accessibility(DW_ACCESS_public)
    6070              $C$DW$723       .dwtag  DW_TAG_member
    6071                      .dwattr $C$DW$723, DW_AT_type(*$C$DW$T$35)
    6072                      .dwattr $C$DW$723, DW_AT_name("AL_ERR2OUT")
    6073                      .dwattr $C$DW$723, DW_AT_TI_symbol_name("_AL_ERR2OUT")
    6074                      .dwattr $C$DW$723, DW_AT_data_member_location[DW_OP_plus_uconst 0x4]
    6075                      .dwattr $C$DW$723, DW_AT_accessibility(DW_ACCESS_public)
    6076              $C$DW$724       .dwtag  DW_TAG_member
    6077                      .dwattr $C$DW$724, DW_AT_type(*$C$DW$T$35)
    6078                      .dwattr $C$DW$724, DW_AT_name("UR_ERR2INT")
    6079                      .dwattr $C$DW$724, DW_AT_TI_symbol_name("_UR_ERR2INT")
    6080                      .dwattr $C$DW$724, DW_AT_data_member_location[DW_OP_plus_uconst 0x5]
    6081                      .dwattr $C$DW$724, DW_AT_accessibility(DW_ACCESS_public)
    6082              $C$DW$725       .dwtag  DW_TAG_member
    6083                      .dwattr $C$DW$725, DW_AT_type(*$C$DW$T$35)
    6084                      .dwattr $C$DW$725, DW_AT_name("OR_ERR2INT")
    6085                      .dwattr $C$DW$725, DW_AT_TI_symbol_name("_OR_ERR2INT")
    6086                      .dwattr $C$DW$725, DW_AT_data_member_location[DW_OP_plus_uconst 0x6]
    6087                      .dwattr $C$DW$725, DW_AT_accessibility(DW_ACCESS_public)
    6088              $C$DW$726       .dwtag  DW_TAG_member
    6089                      .dwattr $C$DW$726, DW_AT_type(*$C$DW$T$35)
    6090                      .dwattr $C$DW$726, DW_AT_name("WD_ERR2INT")
    6091                      .dwattr $C$DW$726, DW_AT_TI_symbol_name("_WD_ERR2INT")
    6092                      .dwattr $C$DW$726, DW_AT_data_member_location[DW_OP_plus_uconst 0x7]
    6093                      .dwattr $C$DW$726, DW_AT_accessibility(DW_ACCESS_public)
    6094              $C$DW$727       .dwtag  DW_TAG_member
    6095                      .dwattr $C$DW$727, DW_AT_type(*$C$DW$T$35)
    6096                      .dwattr $C$DW$727, DW_AT_name("AH_ERR2INT")
    6097                      .dwattr $C$DW$727, DW_AT_TI_symbol_name("_AH_ERR2INT")
    6098                      .dwattr $C$DW$727, DW_AT_data_member_location[DW_OP_plus_uconst 0x8]
    6099                      .dwattr $C$DW$727, DW_AT_accessibility(DW_ACCESS_public)
    6100              $C$DW$728       .dwtag  DW_TAG_member
    6101                      .dwattr $C$DW$728, DW_AT_type(*$C$DW$T$35)
    6102                      .dwattr $C$DW$728, DW_AT_name("AL_ERR2INT")
    6103                      .dwattr $C$DW$728, DW_AT_TI_symbol_name("_AL_ERR2INT")
    6104                      .dwattr $C$DW$728, DW_AT_data_member_location[DW_OP_plus_uconst 0x9]
    6105                      .dwattr $C$DW$728, DW_AT_accessibility(DW_ACCESS_public)
    6106              $C$DW$729       .dwtag  DW_TAG_member
    6107                      .dwattr $C$DW$729, DW_AT_type(*$C$DW$T$35)
    6108                      .dwattr $C$DW$729, DW_AT_name("ZC_ERR2INT")
    6109                      .dwattr $C$DW$729, DW_AT_TI_symbol_name("_ZC_ERR2INT")
    6110                      .dwattr $C$DW$729, DW_AT_data_member_location[DW_OP_plus_uconst 0xa]
    6111                      .dwattr $C$DW$729, DW_AT_accessibility(DW_ACCESS_public)
    6112              $C$DW$730       .dwtag  DW_TAG_member
    6113                      .dwattr $C$DW$730, DW_AT_type(*$C$DW$T$35)
    6114                      .dwattr $C$DW$730, DW_AT_name("DRDY_2INT")
    6115                      .dwattr $C$DW$730, DW_AT_TI_symbol_name("_DRDY_2INT")
    6116                      .dwattr $C$DW$730, DW_AT_data_member_location[DW_OP_plus_uconst 0xb]
    6117                      .dwattr $C$DW$730, DW_AT_accessibility(DW_ACCESS_public)
TMS320C2000 Assembler PC v6.2.5 Sat Sep 16 14:55:48 2017

Tools Copyright (c) 1996-2014 Texas Instruments Incorporated
C:\Users\wmj\AppData\Local\Temp\1116811                              PAGE  116

    6118                      .dwendtag $C$DW$T$39
    6119              
    6120              $C$DW$T$58      .dwtag  DW_TAG_typedef, DW_AT_name("LDC161x_ERROR_CONFIG_t_")
    6121                      .dwattr $C$DW$T$58, DW_AT_type(*$C$DW$T$39)
    6122                      .dwattr $C$DW$T$58, DW_AT_language(DW_LANG_C)
    6123              
    6124              $C$DW$T$40      .dwtag  DW_TAG_structure_type
    6125                      .dwattr $C$DW$T$40, DW_AT_name("_LDC161x_Kalman_t_")
    6126                      .dwattr $C$DW$T$40, DW_AT_byte_size(0x0a)
    6127              $C$DW$731       .dwtag  DW_TAG_member
    6128                      .dwattr $C$DW$731, DW_AT_type(*$C$DW$T$25)
    6129                      .dwattr $C$DW$731, DW_AT_name("x_Last")
    6130                      .dwattr $C$DW$731, DW_AT_TI_symbol_name("_x_Last")
    6131                      .dwattr $C$DW$731, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    6132                      .dwattr $C$DW$731, DW_AT_accessibility(DW_ACCESS_public)
    6133              $C$DW$732       .dwtag  DW_TAG_member
    6134                      .dwattr $C$DW$732, DW_AT_type(*$C$DW$T$25)
    6135                      .dwattr $C$DW$732, DW_AT_name("p_Last")
    6136                      .dwattr $C$DW$732, DW_AT_TI_symbol_name("_p_Last")
    6137                      .dwattr $C$DW$732, DW_AT_data_member_location[DW_OP_plus_uconst 0x2]
    6138                      .dwattr $C$DW$732, DW_AT_accessibility(DW_ACCESS_public)
    6139              $C$DW$733       .dwtag  DW_TAG_member
    6140                      .dwattr $C$DW$733, DW_AT_type(*$C$DW$T$25)
    6141                      .dwattr $C$DW$733, DW_AT_name("data_Last")
    6142                      .dwattr $C$DW$733, DW_AT_TI_symbol_name("_data_Last")
    6143                      .dwattr $C$DW$733, DW_AT_data_member_location[DW_OP_plus_uconst 0x4]
    6144                      .dwattr $C$DW$733, DW_AT_accessibility(DW_ACCESS_public)
    6145              $C$DW$734       .dwtag  DW_TAG_member
    6146                      .dwattr $C$DW$734, DW_AT_type(*$C$DW$T$25)
    6147                      .dwattr $C$DW$734, DW_AT_name("Ldc_Kalman_R")
    6148                      .dwattr $C$DW$734, DW_AT_TI_symbol_name("_Ldc_Kalman_R")
    6149                      .dwattr $C$DW$734, DW_AT_data_member_location[DW_OP_plus_uconst 0x6]
    6150                      .dwattr $C$DW$734, DW_AT_accessibility(DW_ACCESS_public)
    6151              $C$DW$735       .dwtag  DW_TAG_member
    6152                      .dwattr $C$DW$735, DW_AT_type(*$C$DW$T$25)
    6153                      .dwattr $C$DW$735, DW_AT_name("Ldc_Kalman_Q")
    6154                      .dwattr $C$DW$735, DW_AT_TI_symbol_name("_Ldc_Kalman_Q")
    6155                      .dwattr $C$DW$735, DW_AT_data_member_location[DW_OP_plus_uconst 0x8]
    6156                      .dwattr $C$DW$735, DW_AT_accessibility(DW_ACCESS_public)
    6157                      .dwendtag $C$DW$T$40
    6158              
    6159              $C$DW$T$62      .dwtag  DW_TAG_typedef, DW_AT_name("LDC161x_Kalman_t_")
    6160                      .dwattr $C$DW$T$62, DW_AT_type(*$C$DW$T$40)
    6161                      .dwattr $C$DW$T$62, DW_AT_language(DW_LANG_C)
    6162              
    6163              $C$DW$T$41      .dwtag  DW_TAG_structure_type
    6164                      .dwattr $C$DW$T$41, DW_AT_name("_LDC161x_MUX_CONFIG_t_")
    6165                      .dwattr $C$DW$T$41, DW_AT_byte_size(0x06)
    6166              $C$DW$736       .dwtag  DW_TAG_member
    6167                      .dwattr $C$DW$736, DW_AT_type(*$C$DW$T$35)
    6168                      .dwattr $C$DW$736, DW_AT_name("AUTOSCAN_EN")
    6169                      .dwattr $C$DW$736, DW_AT_TI_symbol_name("_AUTOSCAN_EN")
    6170                      .dwattr $C$DW$736, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    6171                      .dwattr $C$DW$736, DW_AT_accessibility(DW_ACCESS_public)
    6172              $C$DW$737       .dwtag  DW_TAG_member
TMS320C2000 Assembler PC v6.2.5 Sat Sep 16 14:55:48 2017

Tools Copyright (c) 1996-2014 Texas Instruments Incorporated
C:\Users\wmj\AppData\Local\Temp\1116811                              PAGE  117

    6173                      .dwattr $C$DW$737, DW_AT_type(*$C$DW$T$35)
    6174                      .dwattr $C$DW$737, DW_AT_name("RR_SEQUENCE_0")
    6175                      .dwattr $C$DW$737, DW_AT_TI_symbol_name("_RR_SEQUENCE_0")
    6176                      .dwattr $C$DW$737, DW_AT_data_member_location[DW_OP_plus_uconst 0x1]
    6177                      .dwattr $C$DW$737, DW_AT_accessibility(DW_ACCESS_public)
    6178              $C$DW$738       .dwtag  DW_TAG_member
    6179                      .dwattr $C$DW$738, DW_AT_type(*$C$DW$T$35)
    6180                      .dwattr $C$DW$738, DW_AT_name("RR_SEQUENCE_1")
    6181                      .dwattr $C$DW$738, DW_AT_TI_symbol_name("_RR_SEQUENCE_1")
    6182                      .dwattr $C$DW$738, DW_AT_data_member_location[DW_OP_plus_uconst 0x2]
    6183                      .dwattr $C$DW$738, DW_AT_accessibility(DW_ACCESS_public)
    6184              $C$DW$739       .dwtag  DW_TAG_member
    6185                      .dwattr $C$DW$739, DW_AT_type(*$C$DW$T$35)
    6186                      .dwattr $C$DW$739, DW_AT_name("DEGLITCH_0")
    6187                      .dwattr $C$DW$739, DW_AT_TI_symbol_name("_DEGLITCH_0")
    6188                      .dwattr $C$DW$739, DW_AT_data_member_location[DW_OP_plus_uconst 0x3]
    6189                      .dwattr $C$DW$739, DW_AT_accessibility(DW_ACCESS_public)
    6190              $C$DW$740       .dwtag  DW_TAG_member
    6191                      .dwattr $C$DW$740, DW_AT_type(*$C$DW$T$35)
    6192                      .dwattr $C$DW$740, DW_AT_name("DEGLITCH_1")
    6193                      .dwattr $C$DW$740, DW_AT_TI_symbol_name("_DEGLITCH_1")
    6194                      .dwattr $C$DW$740, DW_AT_data_member_location[DW_OP_plus_uconst 0x4]
    6195                      .dwattr $C$DW$740, DW_AT_accessibility(DW_ACCESS_public)
    6196              $C$DW$741       .dwtag  DW_TAG_member
    6197                      .dwattr $C$DW$741, DW_AT_type(*$C$DW$T$35)
    6198                      .dwattr $C$DW$741, DW_AT_name("DEGLITCH_2")
    6199                      .dwattr $C$DW$741, DW_AT_TI_symbol_name("_DEGLITCH_2")
    6200                      .dwattr $C$DW$741, DW_AT_data_member_location[DW_OP_plus_uconst 0x5]
    6201                      .dwattr $C$DW$741, DW_AT_accessibility(DW_ACCESS_public)
    6202                      .dwendtag $C$DW$T$41
    6203              
    6204              $C$DW$T$60      .dwtag  DW_TAG_typedef, DW_AT_name("LDC161x_MUX_CONFIG_t_")
    6205                      .dwattr $C$DW$T$60, DW_AT_type(*$C$DW$T$41)
    6206                      .dwattr $C$DW$T$60, DW_AT_language(DW_LANG_C)
    6207              
    6208              $C$DW$T$42      .dwtag  DW_TAG_structure_type
    6209                      .dwattr $C$DW$T$42, DW_AT_name("_LDC161x_OFFSET_t_")
    6210                      .dwattr $C$DW$T$42, DW_AT_byte_size(0x01)
    6211              $C$DW$742       .dwtag  DW_TAG_member
    6212                      .dwattr $C$DW$742, DW_AT_type(*$C$DW$T$21)
    6213                      .dwattr $C$DW$742, DW_AT_name("OFFSET_CH0")
    6214                      .dwattr $C$DW$742, DW_AT_TI_symbol_name("_OFFSET_CH0")
    6215                      .dwattr $C$DW$742, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    6216                      .dwattr $C$DW$742, DW_AT_accessibility(DW_ACCESS_public)
    6217                      .dwendtag $C$DW$T$42
    6218              
    6219              $C$DW$T$54      .dwtag  DW_TAG_typedef, DW_AT_name("LDC161x_OFFSET_t_")
    6220                      .dwattr $C$DW$T$54, DW_AT_type(*$C$DW$T$42)
    6221                      .dwattr $C$DW$T$54, DW_AT_language(DW_LANG_C)
    6222              
    6223              $C$DW$T$50      .dwtag  DW_TAG_structure_type
    6224                      .dwattr $C$DW$T$50, DW_AT_name("_LDC161x_Obj_")
    6225                      .dwattr $C$DW$T$50, DW_AT_byte_size(0x4a)
    6226              $C$DW$743       .dwtag  DW_TAG_member
    6227                      .dwattr $C$DW$743, DW_AT_type(*$C$DW$T$44)
TMS320C2000 Assembler PC v6.2.5 Sat Sep 16 14:55:48 2017

Tools Copyright (c) 1996-2014 Texas Instruments Incorporated
C:\Users\wmj\AppData\Local\Temp\1116811                              PAGE  118

    6228                      .dwattr $C$DW$743, DW_AT_name("i2cHandle")
    6229                      .dwattr $C$DW$743, DW_AT_TI_symbol_name("_i2cHandle")
    6230                      .dwattr $C$DW$743, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    6231                      .dwattr $C$DW$743, DW_AT_accessibility(DW_ACCESS_public)
    6232              $C$DW$744       .dwtag  DW_TAG_member
    6233                      .dwattr $C$DW$744, DW_AT_type(*$C$DW$T$46)
    6234                      .dwattr $C$DW$744, DW_AT_name("gpioHandle")
    6235                      .dwattr $C$DW$744, DW_AT_TI_symbol_name("_gpioHandle")
    6236                      .dwattr $C$DW$744, DW_AT_data_member_location[DW_OP_plus_uconst 0x2]
    6237                      .dwattr $C$DW$744, DW_AT_accessibility(DW_ACCESS_public)
    6238              $C$DW$745       .dwtag  DW_TAG_member
    6239                      .dwattr $C$DW$745, DW_AT_type(*$C$DW$T$48)
    6240                      .dwattr $C$DW$745, DW_AT_name("ldcHandle")
    6241                      .dwattr $C$DW$745, DW_AT_TI_symbol_name("_ldcHandle")
    6242                      .dwattr $C$DW$745, DW_AT_data_member_location[DW_OP_plus_uconst 0x4]
    6243                      .dwattr $C$DW$745, DW_AT_accessibility(DW_ACCESS_public)
    6244              $C$DW$746       .dwtag  DW_TAG_member
    6245                      .dwattr $C$DW$746, DW_AT_type(*$C$DW$T$49)
    6246                      .dwattr $C$DW$746, DW_AT_name("ldc161x")
    6247                      .dwattr $C$DW$746, DW_AT_TI_symbol_name("_ldc161x")
    6248                      .dwattr $C$DW$746, DW_AT_data_member_location[DW_OP_plus_uconst 0x6]
    6249                      .dwattr $C$DW$746, DW_AT_accessibility(DW_ACCESS_public)
    6250              $C$DW$747       .dwtag  DW_TAG_member
    6251                      .dwattr $C$DW$747, DW_AT_type(*$C$DW$T$35)
    6252                      .dwattr $C$DW$747, DW_AT_name("RxTimeOut")
    6253                      .dwattr $C$DW$747, DW_AT_TI_symbol_name("_RxTimeOut")
    6254                      .dwattr $C$DW$747, DW_AT_data_member_location[DW_OP_plus_uconst 0x48]
    6255                      .dwattr $C$DW$747, DW_AT_accessibility(DW_ACCESS_public)
    6256              $C$DW$748       .dwtag  DW_TAG_member
    6257                      .dwattr $C$DW$748, DW_AT_type(*$C$DW$T$35)
    6258                      .dwattr $C$DW$748, DW_AT_name("TxTimeOut")
    6259                      .dwattr $C$DW$748, DW_AT_TI_symbol_name("_TxTimeOut")
    6260                      .dwattr $C$DW$748, DW_AT_data_member_location[DW_OP_plus_uconst 0x49]
    6261                      .dwattr $C$DW$748, DW_AT_accessibility(DW_ACCESS_public)
    6262                      .dwendtag $C$DW$T$50
    6263              
    6264              $C$DW$T$120     .dwtag  DW_TAG_typedef, DW_AT_name("LDC161x_Obj")
    6265                      .dwattr $C$DW$T$120, DW_AT_type(*$C$DW$T$50)
    6266                      .dwattr $C$DW$T$120, DW_AT_language(DW_LANG_C)
    6267              $C$DW$T$121     .dwtag  DW_TAG_pointer_type
    6268                      .dwattr $C$DW$T$121, DW_AT_type(*$C$DW$T$50)
    6269                      .dwattr $C$DW$T$121, DW_AT_address_class(0x16)
    6270              $C$DW$T$122     .dwtag  DW_TAG_typedef, DW_AT_name("LDC161x_Handle")
    6271                      .dwattr $C$DW$T$122, DW_AT_type(*$C$DW$T$121)
    6272                      .dwattr $C$DW$T$122, DW_AT_language(DW_LANG_C)
    6273              $C$DW$749       .dwtag  DW_TAG_TI_far_type
    6274                      .dwattr $C$DW$749, DW_AT_type(*$C$DW$T$122)
    6275              $C$DW$T$123     .dwtag  DW_TAG_const_type
    6276                      .dwattr $C$DW$T$123, DW_AT_type(*$C$DW$749)
    6277              
    6278              $C$DW$T$51      .dwtag  DW_TAG_structure_type
    6279                      .dwattr $C$DW$T$51, DW_AT_name("_LDC161x_RCOUNT_t_")
    6280                      .dwattr $C$DW$T$51, DW_AT_byte_size(0x01)
    6281              $C$DW$750       .dwtag  DW_TAG_member
    6282                      .dwattr $C$DW$750, DW_AT_type(*$C$DW$T$21)
TMS320C2000 Assembler PC v6.2.5 Sat Sep 16 14:55:48 2017

Tools Copyright (c) 1996-2014 Texas Instruments Incorporated
C:\Users\wmj\AppData\Local\Temp\1116811                              PAGE  119

    6283                      .dwattr $C$DW$750, DW_AT_name("RCOUNT_CH0")
    6284                      .dwattr $C$DW$750, DW_AT_TI_symbol_name("_RCOUNT_CH0")
    6285                      .dwattr $C$DW$750, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    6286                      .dwattr $C$DW$750, DW_AT_accessibility(DW_ACCESS_public)
    6287                      .dwendtag $C$DW$T$51
    6288              
    6289              $C$DW$T$53      .dwtag  DW_TAG_typedef, DW_AT_name("LDC161x_RCOUNT_t_")
    6290                      .dwattr $C$DW$T$53, DW_AT_type(*$C$DW$T$51)
    6291                      .dwattr $C$DW$T$53, DW_AT_language(DW_LANG_C)
    6292              
    6293              $C$DW$T$67      .dwtag  DW_TAG_structure_type
    6294                      .dwattr $C$DW$T$67, DW_AT_name("_LDC161x_REG_Obj_")
    6295                      .dwattr $C$DW$T$67, DW_AT_byte_size(0x42)
    6296              $C$DW$751       .dwtag  DW_TAG_member
    6297                      .dwattr $C$DW$751, DW_AT_type(*$C$DW$T$52)
    6298                      .dwattr $C$DW$751, DW_AT_name("LdcChData")
    6299                      .dwattr $C$DW$751, DW_AT_TI_symbol_name("_LdcChData")
    6300                      .dwattr $C$DW$751, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    6301                      .dwattr $C$DW$751, DW_AT_accessibility(DW_ACCESS_public)
    6302              $C$DW$752       .dwtag  DW_TAG_member
    6303                      .dwattr $C$DW$752, DW_AT_type(*$C$DW$T$53)
    6304                      .dwattr $C$DW$752, DW_AT_name("LdcRcount")
    6305                      .dwattr $C$DW$752, DW_AT_TI_symbol_name("_LdcRcount")
    6306                      .dwattr $C$DW$752, DW_AT_data_member_location[DW_OP_plus_uconst 0x6]
    6307                      .dwattr $C$DW$752, DW_AT_accessibility(DW_ACCESS_public)
    6308              $C$DW$753       .dwtag  DW_TAG_member
    6309                      .dwattr $C$DW$753, DW_AT_type(*$C$DW$T$54)
    6310                      .dwattr $C$DW$753, DW_AT_name("LdcOffset")
    6311                      .dwattr $C$DW$753, DW_AT_TI_symbol_name("_LdcOffset")
    6312                      .dwattr $C$DW$753, DW_AT_data_member_location[DW_OP_plus_uconst 0x7]
    6313                      .dwattr $C$DW$753, DW_AT_accessibility(DW_ACCESS_public)
    6314              $C$DW$754       .dwtag  DW_TAG_member
    6315                      .dwattr $C$DW$754, DW_AT_type(*$C$DW$T$55)
    6316                      .dwattr $C$DW$754, DW_AT_name("LdcSettleCnt")
    6317                      .dwattr $C$DW$754, DW_AT_TI_symbol_name("_LdcSettleCnt")
    6318                      .dwattr $C$DW$754, DW_AT_data_member_location[DW_OP_plus_uconst 0x8]
    6319                      .dwattr $C$DW$754, DW_AT_accessibility(DW_ACCESS_public)
    6320              $C$DW$755       .dwtag  DW_TAG_member
    6321                      .dwattr $C$DW$755, DW_AT_type(*$C$DW$T$56)
    6322                      .dwattr $C$DW$755, DW_AT_name("LdcClkDiv")
    6323                      .dwattr $C$DW$755, DW_AT_TI_symbol_name("_LdcClkDiv")
    6324                      .dwattr $C$DW$755, DW_AT_data_member_location[DW_OP_plus_uconst 0x9]
    6325                      .dwattr $C$DW$755, DW_AT_accessibility(DW_ACCESS_public)
    6326              $C$DW$756       .dwtag  DW_TAG_member
    6327                      .dwattr $C$DW$756, DW_AT_type(*$C$DW$T$57)
    6328                      .dwattr $C$DW$756, DW_AT_name("LdcStatus")
    6329                      .dwattr $C$DW$756, DW_AT_TI_symbol_name("_LdcStatus")
    6330                      .dwattr $C$DW$756, DW_AT_data_member_location[DW_OP_plus_uconst 0xb]
    6331                      .dwattr $C$DW$756, DW_AT_accessibility(DW_ACCESS_public)
    6332              $C$DW$757       .dwtag  DW_TAG_member
    6333                      .dwattr $C$DW$757, DW_AT_type(*$C$DW$T$58)
    6334                      .dwattr $C$DW$757, DW_AT_name("LdcError")
    6335                      .dwattr $C$DW$757, DW_AT_TI_symbol_name("_LdcError")
    6336                      .dwattr $C$DW$757, DW_AT_data_member_location[DW_OP_plus_uconst 0x18]
    6337                      .dwattr $C$DW$757, DW_AT_accessibility(DW_ACCESS_public)
TMS320C2000 Assembler PC v6.2.5 Sat Sep 16 14:55:48 2017

Tools Copyright (c) 1996-2014 Texas Instruments Incorporated
C:\Users\wmj\AppData\Local\Temp\1116811                              PAGE  120

    6338              $C$DW$758       .dwtag  DW_TAG_member
    6339                      .dwattr $C$DW$758, DW_AT_type(*$C$DW$T$59)
    6340                      .dwattr $C$DW$758, DW_AT_name("LdcConfig")
    6341                      .dwattr $C$DW$758, DW_AT_TI_symbol_name("_LdcConfig")
    6342                      .dwattr $C$DW$758, DW_AT_data_member_location[DW_OP_plus_uconst 0x24]
    6343                      .dwattr $C$DW$758, DW_AT_accessibility(DW_ACCESS_public)
    6344              $C$DW$759       .dwtag  DW_TAG_member
    6345                      .dwattr $C$DW$759, DW_AT_type(*$C$DW$T$60)
    6346                      .dwattr $C$DW$759, DW_AT_name("LdcMuxConf")
    6347                      .dwattr $C$DW$759, DW_AT_TI_symbol_name("_LdcMuxConf")
    6348                      .dwattr $C$DW$759, DW_AT_data_member_location[DW_OP_plus_uconst 0x2d]
    6349                      .dwattr $C$DW$759, DW_AT_accessibility(DW_ACCESS_public)
    6350              $C$DW$760       .dwtag  DW_TAG_member
    6351                      .dwattr $C$DW$760, DW_AT_type(*$C$DW$T$61)
    6352                      .dwattr $C$DW$760, DW_AT_name("LdcDriveCurrent")
    6353                      .dwattr $C$DW$760, DW_AT_TI_symbol_name("_LdcDriveCurrent")
    6354                      .dwattr $C$DW$760, DW_AT_data_member_location[DW_OP_plus_uconst 0x33]
    6355                      .dwattr $C$DW$760, DW_AT_accessibility(DW_ACCESS_public)
    6356              $C$DW$761       .dwtag  DW_TAG_member
    6357                      .dwattr $C$DW$761, DW_AT_type(*$C$DW$T$62)
    6358                      .dwattr $C$DW$761, DW_AT_name("LdcKalman")
    6359                      .dwattr $C$DW$761, DW_AT_TI_symbol_name("_LdcKalman")
    6360                      .dwattr $C$DW$761, DW_AT_data_member_location[DW_OP_plus_uconst 0x36]
    6361                      .dwattr $C$DW$761, DW_AT_accessibility(DW_ACCESS_public)
    6362              $C$DW$762       .dwtag  DW_TAG_member
    6363                      .dwattr $C$DW$762, DW_AT_type(*$C$DW$T$64)
    6364                      .dwattr $C$DW$762, DW_AT_name("LdcType")
    6365                      .dwattr $C$DW$762, DW_AT_TI_symbol_name("_LdcType")
    6366                      .dwattr $C$DW$762, DW_AT_data_member_location[DW_OP_plus_uconst 0x40]
    6367                      .dwattr $C$DW$762, DW_AT_accessibility(DW_ACCESS_public)
    6368              $C$DW$763       .dwtag  DW_TAG_member
    6369                      .dwattr $C$DW$763, DW_AT_type(*$C$DW$T$66)
    6370                      .dwattr $C$DW$763, DW_AT_name("LdcSerial")
    6371                      .dwattr $C$DW$763, DW_AT_TI_symbol_name("_LdcSerial")
    6372                      .dwattr $C$DW$763, DW_AT_data_member_location[DW_OP_plus_uconst 0x41]
    6373                      .dwattr $C$DW$763, DW_AT_accessibility(DW_ACCESS_public)
    6374                      .dwendtag $C$DW$T$67
    6375              
    6376              $C$DW$T$49      .dwtag  DW_TAG_typedef, DW_AT_name("LDC161x_REG_Obj")
    6377                      .dwattr $C$DW$T$49, DW_AT_type(*$C$DW$T$67)
    6378                      .dwattr $C$DW$T$49, DW_AT_language(DW_LANG_C)
    6379              $C$DW$T$127     .dwtag  DW_TAG_pointer_type
    6380                      .dwattr $C$DW$T$127, DW_AT_type(*$C$DW$T$49)
    6381                      .dwattr $C$DW$T$127, DW_AT_address_class(0x16)
    6382              
    6383              $C$DW$T$68      .dwtag  DW_TAG_structure_type
    6384                      .dwattr $C$DW$T$68, DW_AT_name("_LDC161x_SETTLECOUNT_t_")
    6385                      .dwattr $C$DW$T$68, DW_AT_byte_size(0x01)
    6386              $C$DW$764       .dwtag  DW_TAG_member
    6387                      .dwattr $C$DW$764, DW_AT_type(*$C$DW$T$21)
    6388                      .dwattr $C$DW$764, DW_AT_name("SETTLECOUNT_CH0")
    6389                      .dwattr $C$DW$764, DW_AT_TI_symbol_name("_SETTLECOUNT_CH0")
    6390                      .dwattr $C$DW$764, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    6391                      .dwattr $C$DW$764, DW_AT_accessibility(DW_ACCESS_public)
    6392                      .dwendtag $C$DW$T$68
TMS320C2000 Assembler PC v6.2.5 Sat Sep 16 14:55:48 2017

Tools Copyright (c) 1996-2014 Texas Instruments Incorporated
C:\Users\wmj\AppData\Local\Temp\1116811                              PAGE  121

    6393              
    6394              $C$DW$T$55      .dwtag  DW_TAG_typedef, DW_AT_name("LDC161x_SETTLECOUNT_t_")
    6395                      .dwattr $C$DW$T$55, DW_AT_type(*$C$DW$T$68)
    6396                      .dwattr $C$DW$T$55, DW_AT_language(DW_LANG_C)
    6397              
    6398              $C$DW$T$69      .dwtag  DW_TAG_structure_type
    6399                      .dwattr $C$DW$T$69, DW_AT_name("_LDC161x_STATUS_t_")
    6400                      .dwattr $C$DW$T$69, DW_AT_byte_size(0x0d)
    6401              $C$DW$765       .dwtag  DW_TAG_member
    6402                      .dwattr $C$DW$765, DW_AT_type(*$C$DW$T$35)
    6403                      .dwattr $C$DW$765, DW_AT_name("UNRDCONV_CH3")
    6404                      .dwattr $C$DW$765, DW_AT_TI_symbol_name("_UNRDCONV_CH3")
    6405                      .dwattr $C$DW$765, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    6406                      .dwattr $C$DW$765, DW_AT_accessibility(DW_ACCESS_public)
    6407              $C$DW$766       .dwtag  DW_TAG_member
    6408                      .dwattr $C$DW$766, DW_AT_type(*$C$DW$T$35)
    6409                      .dwattr $C$DW$766, DW_AT_name("UNRDCONV_CH2")
    6410                      .dwattr $C$DW$766, DW_AT_TI_symbol_name("_UNRDCONV_CH2")
    6411                      .dwattr $C$DW$766, DW_AT_data_member_location[DW_OP_plus_uconst 0x1]
    6412                      .dwattr $C$DW$766, DW_AT_accessibility(DW_ACCESS_public)
    6413              $C$DW$767       .dwtag  DW_TAG_member
    6414                      .dwattr $C$DW$767, DW_AT_type(*$C$DW$T$35)
    6415                      .dwattr $C$DW$767, DW_AT_name("UNRDCONV_CH1")
    6416                      .dwattr $C$DW$767, DW_AT_TI_symbol_name("_UNRDCONV_CH1")
    6417                      .dwattr $C$DW$767, DW_AT_data_member_location[DW_OP_plus_uconst 0x2]
    6418                      .dwattr $C$DW$767, DW_AT_accessibility(DW_ACCESS_public)
    6419              $C$DW$768       .dwtag  DW_TAG_member
    6420                      .dwattr $C$DW$768, DW_AT_type(*$C$DW$T$35)
    6421                      .dwattr $C$DW$768, DW_AT_name("UNRDCONV_CH0")
    6422                      .dwattr $C$DW$768, DW_AT_TI_symbol_name("_UNRDCONV_CH0")
    6423                      .dwattr $C$DW$768, DW_AT_data_member_location[DW_OP_plus_uconst 0x3]
    6424                      .dwattr $C$DW$768, DW_AT_accessibility(DW_ACCESS_public)
    6425              $C$DW$769       .dwtag  DW_TAG_member
    6426                      .dwattr $C$DW$769, DW_AT_type(*$C$DW$T$35)
    6427                      .dwattr $C$DW$769, DW_AT_name("DRDY")
    6428                      .dwattr $C$DW$769, DW_AT_TI_symbol_name("_DRDY")
    6429                      .dwattr $C$DW$769, DW_AT_data_member_location[DW_OP_plus_uconst 0x4]
    6430                      .dwattr $C$DW$769, DW_AT_accessibility(DW_ACCESS_public)
    6431              $C$DW$770       .dwtag  DW_TAG_member
    6432                      .dwattr $C$DW$770, DW_AT_type(*$C$DW$T$35)
    6433                      .dwattr $C$DW$770, DW_AT_name("ERR_ZC")
    6434                      .dwattr $C$DW$770, DW_AT_TI_symbol_name("_ERR_ZC")
    6435                      .dwattr $C$DW$770, DW_AT_data_member_location[DW_OP_plus_uconst 0x5]
    6436                      .dwattr $C$DW$770, DW_AT_accessibility(DW_ACCESS_public)
    6437              $C$DW$771       .dwtag  DW_TAG_member
    6438                      .dwattr $C$DW$771, DW_AT_type(*$C$DW$T$35)
    6439                      .dwattr $C$DW$771, DW_AT_name("ERR_ALE")
    6440                      .dwattr $C$DW$771, DW_AT_TI_symbol_name("_ERR_ALE")
    6441                      .dwattr $C$DW$771, DW_AT_data_member_location[DW_OP_plus_uconst 0x6]
    6442                      .dwattr $C$DW$771, DW_AT_accessibility(DW_ACCESS_public)
    6443              $C$DW$772       .dwtag  DW_TAG_member
    6444                      .dwattr $C$DW$772, DW_AT_type(*$C$DW$T$35)
    6445                      .dwattr $C$DW$772, DW_AT_name("ERR_AHE")
    6446                      .dwattr $C$DW$772, DW_AT_TI_symbol_name("_ERR_AHE")
    6447                      .dwattr $C$DW$772, DW_AT_data_member_location[DW_OP_plus_uconst 0x7]
TMS320C2000 Assembler PC v6.2.5 Sat Sep 16 14:55:48 2017

Tools Copyright (c) 1996-2014 Texas Instruments Incorporated
C:\Users\wmj\AppData\Local\Temp\1116811                              PAGE  122

    6448                      .dwattr $C$DW$772, DW_AT_accessibility(DW_ACCESS_public)
    6449              $C$DW$773       .dwtag  DW_TAG_member
    6450                      .dwattr $C$DW$773, DW_AT_type(*$C$DW$T$35)
    6451                      .dwattr $C$DW$773, DW_AT_name("ERR_WD")
    6452                      .dwattr $C$DW$773, DW_AT_TI_symbol_name("_ERR_WD")
    6453                      .dwattr $C$DW$773, DW_AT_data_member_location[DW_OP_plus_uconst 0x8]
    6454                      .dwattr $C$DW$773, DW_AT_accessibility(DW_ACCESS_public)
    6455              $C$DW$774       .dwtag  DW_TAG_member
    6456                      .dwattr $C$DW$774, DW_AT_type(*$C$DW$T$35)
    6457                      .dwattr $C$DW$774, DW_AT_name("ERR_OR")
    6458                      .dwattr $C$DW$774, DW_AT_TI_symbol_name("_ERR_OR")
    6459                      .dwattr $C$DW$774, DW_AT_data_member_location[DW_OP_plus_uconst 0x9]
    6460                      .dwattr $C$DW$774, DW_AT_accessibility(DW_ACCESS_public)
    6461              $C$DW$775       .dwtag  DW_TAG_member
    6462                      .dwattr $C$DW$775, DW_AT_type(*$C$DW$T$35)
    6463                      .dwattr $C$DW$775, DW_AT_name("ERR_UR")
    6464                      .dwattr $C$DW$775, DW_AT_TI_symbol_name("_ERR_UR")
    6465                      .dwattr $C$DW$775, DW_AT_data_member_location[DW_OP_plus_uconst 0xa]
    6466                      .dwattr $C$DW$775, DW_AT_accessibility(DW_ACCESS_public)
    6467              $C$DW$776       .dwtag  DW_TAG_member
    6468                      .dwattr $C$DW$776, DW_AT_type(*$C$DW$T$35)
    6469                      .dwattr $C$DW$776, DW_AT_name("ERR_CHAN_0")
    6470                      .dwattr $C$DW$776, DW_AT_TI_symbol_name("_ERR_CHAN_0")
    6471                      .dwattr $C$DW$776, DW_AT_data_member_location[DW_OP_plus_uconst 0xb]
    6472                      .dwattr $C$DW$776, DW_AT_accessibility(DW_ACCESS_public)
    6473              $C$DW$777       .dwtag  DW_TAG_member
    6474                      .dwattr $C$DW$777, DW_AT_type(*$C$DW$T$35)
    6475                      .dwattr $C$DW$777, DW_AT_name("ERR_CHAN_1")
    6476                      .dwattr $C$DW$777, DW_AT_TI_symbol_name("_ERR_CHAN_1")
    6477                      .dwattr $C$DW$777, DW_AT_data_member_location[DW_OP_plus_uconst 0xc]
    6478                      .dwattr $C$DW$777, DW_AT_accessibility(DW_ACCESS_public)
    6479                      .dwendtag $C$DW$T$69
    6480              
    6481              $C$DW$T$57      .dwtag  DW_TAG_typedef, DW_AT_name("LDC161x_STATUS_t_")
    6482                      .dwattr $C$DW$T$57, DW_AT_type(*$C$DW$T$69)
    6483                      .dwattr $C$DW$T$57, DW_AT_language(DW_LANG_C)
    6484              
    6485              $C$DW$T$70      .dwtag  DW_TAG_structure_type
    6486                      .dwattr $C$DW$T$70, DW_AT_name("_LDC_161x_CHDATA_MSB_t_")
    6487                      .dwattr $C$DW$T$70, DW_AT_byte_size(0x05)
    6488              $C$DW$778       .dwtag  DW_TAG_member
    6489                      .dwattr $C$DW$778, DW_AT_type(*$C$DW$T$35)
    6490                      .dwattr $C$DW$778, DW_AT_name("ERR_UR")
    6491                      .dwattr $C$DW$778, DW_AT_TI_symbol_name("_ERR_UR")
    6492                      .dwattr $C$DW$778, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    6493                      .dwattr $C$DW$778, DW_AT_accessibility(DW_ACCESS_public)
    6494              $C$DW$779       .dwtag  DW_TAG_member
    6495                      .dwattr $C$DW$779, DW_AT_type(*$C$DW$T$35)
    6496                      .dwattr $C$DW$779, DW_AT_name("ERR_OR")
    6497                      .dwattr $C$DW$779, DW_AT_TI_symbol_name("_ERR_OR")
    6498                      .dwattr $C$DW$779, DW_AT_data_member_location[DW_OP_plus_uconst 0x1]
    6499                      .dwattr $C$DW$779, DW_AT_accessibility(DW_ACCESS_public)
    6500              $C$DW$780       .dwtag  DW_TAG_member
    6501                      .dwattr $C$DW$780, DW_AT_type(*$C$DW$T$35)
    6502                      .dwattr $C$DW$780, DW_AT_name("ERR_WD")
TMS320C2000 Assembler PC v6.2.5 Sat Sep 16 14:55:48 2017

Tools Copyright (c) 1996-2014 Texas Instruments Incorporated
C:\Users\wmj\AppData\Local\Temp\1116811                              PAGE  123

    6503                      .dwattr $C$DW$780, DW_AT_TI_symbol_name("_ERR_WD")
    6504                      .dwattr $C$DW$780, DW_AT_data_member_location[DW_OP_plus_uconst 0x2]
    6505                      .dwattr $C$DW$780, DW_AT_accessibility(DW_ACCESS_public)
    6506              $C$DW$781       .dwtag  DW_TAG_member
    6507                      .dwattr $C$DW$781, DW_AT_type(*$C$DW$T$35)
    6508                      .dwattr $C$DW$781, DW_AT_name("ERR_AE")
    6509                      .dwattr $C$DW$781, DW_AT_TI_symbol_name("_ERR_AE")
    6510                      .dwattr $C$DW$781, DW_AT_data_member_location[DW_OP_plus_uconst 0x3]
    6511                      .dwattr $C$DW$781, DW_AT_accessibility(DW_ACCESS_public)
    6512              $C$DW$782       .dwtag  DW_TAG_member
    6513                      .dwattr $C$DW$782, DW_AT_type(*$C$DW$T$21)
    6514                      .dwattr $C$DW$782, DW_AT_name("DAT_MB")
    6515                      .dwattr $C$DW$782, DW_AT_TI_symbol_name("_DAT_MB")
    6516                      .dwattr $C$DW$782, DW_AT_data_member_location[DW_OP_plus_uconst 0x4]
    6517                      .dwattr $C$DW$782, DW_AT_accessibility(DW_ACCESS_public)
    6518                      .dwendtag $C$DW$T$70
    6519              
    6520              $C$DW$T$71      .dwtag  DW_TAG_typedef, DW_AT_name("LDC_161x_CHDATA_MSB_t_")
    6521                      .dwattr $C$DW$T$71, DW_AT_type(*$C$DW$T$70)
    6522                      .dwattr $C$DW$T$71, DW_AT_language(DW_LANG_C)
    6523              
    6524              $C$DW$T$72      .dwtag  DW_TAG_structure_type
    6525                      .dwattr $C$DW$T$72, DW_AT_name("_LDC_161x_CHDATA_t_")
    6526                      .dwattr $C$DW$T$72, DW_AT_byte_size(0x06)
    6527              $C$DW$783       .dwtag  DW_TAG_member
    6528                      .dwattr $C$DW$783, DW_AT_type(*$C$DW$T$71)
    6529                      .dwattr $C$DW$783, DW_AT_name("MSB")
    6530                      .dwattr $C$DW$783, DW_AT_TI_symbol_name("_MSB")
    6531                      .dwattr $C$DW$783, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    6532                      .dwattr $C$DW$783, DW_AT_accessibility(DW_ACCESS_public)
    6533              $C$DW$784       .dwtag  DW_TAG_member
    6534                      .dwattr $C$DW$784, DW_AT_type(*$C$DW$T$21)
    6535                      .dwattr $C$DW$784, DW_AT_name("LSB")
    6536                      .dwattr $C$DW$784, DW_AT_TI_symbol_name("_LSB")
    6537                      .dwattr $C$DW$784, DW_AT_data_member_location[DW_OP_plus_uconst 0x5]
    6538                      .dwattr $C$DW$784, DW_AT_accessibility(DW_ACCESS_public)
    6539                      .dwendtag $C$DW$T$72
    6540              
    6541              $C$DW$T$73      .dwtag  DW_TAG_typedef, DW_AT_name("LDC_161x_CHDATA_t_")
    6542                      .dwattr $C$DW$T$73, DW_AT_type(*$C$DW$T$72)
    6543                      .dwattr $C$DW$T$73, DW_AT_language(DW_LANG_C)
    6544              
    6545              $C$DW$T$74      .dwtag  DW_TAG_structure_type
    6546                      .dwattr $C$DW$T$74, DW_AT_name("_LDC_161x_DATA_t_")
    6547                      .dwattr $C$DW$T$74, DW_AT_byte_size(0x06)
    6548              $C$DW$785       .dwtag  DW_TAG_member
    6549                      .dwattr $C$DW$785, DW_AT_type(*$C$DW$T$73)
    6550                      .dwattr $C$DW$785, DW_AT_name("CH0_DATA")
    6551                      .dwattr $C$DW$785, DW_AT_TI_symbol_name("_CH0_DATA")
    6552                      .dwattr $C$DW$785, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    6553                      .dwattr $C$DW$785, DW_AT_accessibility(DW_ACCESS_public)
    6554                      .dwendtag $C$DW$T$74
    6555              
    6556              $C$DW$T$52      .dwtag  DW_TAG_typedef, DW_AT_name("LDC_161x_DATA_t_")
    6557                      .dwattr $C$DW$T$52, DW_AT_type(*$C$DW$T$74)
TMS320C2000 Assembler PC v6.2.5 Sat Sep 16 14:55:48 2017

Tools Copyright (c) 1996-2014 Texas Instruments Incorporated
C:\Users\wmj\AppData\Local\Temp\1116811                              PAGE  124

    6558                      .dwattr $C$DW$T$52, DW_AT_language(DW_LANG_C)
    6559              $C$DW$T$3       .dwtag  DW_TAG_pointer_type
    6560                      .dwattr $C$DW$T$3, DW_AT_address_class(0x16)
    6561              $C$DW$786       .dwtag  DW_TAG_TI_far_type
    6562                      .dwattr $C$DW$786, DW_AT_type(*$C$DW$T$3)
    6563              $C$DW$T$129     .dwtag  DW_TAG_const_type
    6564                      .dwattr $C$DW$T$129, DW_AT_type(*$C$DW$786)
    6565              $C$DW$T$4       .dwtag  DW_TAG_base_type
    6566                      .dwattr $C$DW$T$4, DW_AT_encoding(DW_ATE_boolean)
    6567                      .dwattr $C$DW$T$4, DW_AT_name("bool")
    6568                      .dwattr $C$DW$T$4, DW_AT_byte_size(0x01)
    6569              $C$DW$T$5       .dwtag  DW_TAG_base_type
    6570                      .dwattr $C$DW$T$5, DW_AT_encoding(DW_ATE_signed_char)
    6571                      .dwattr $C$DW$T$5, DW_AT_name("signed char")
    6572                      .dwattr $C$DW$T$5, DW_AT_byte_size(0x01)
    6573              $C$DW$T$6       .dwtag  DW_TAG_base_type
    6574                      .dwattr $C$DW$T$6, DW_AT_encoding(DW_ATE_unsigned_char)
    6575                      .dwattr $C$DW$T$6, DW_AT_name("unsigned char")
    6576                      .dwattr $C$DW$T$6, DW_AT_byte_size(0x01)
    6577              $C$DW$T$35      .dwtag  DW_TAG_typedef, DW_AT_name("_Bool")
    6578                      .dwattr $C$DW$T$35, DW_AT_type(*$C$DW$T$6)
    6579                      .dwattr $C$DW$T$35, DW_AT_language(DW_LANG_C)
    6580              $C$DW$T$7       .dwtag  DW_TAG_base_type
    6581                      .dwattr $C$DW$T$7, DW_AT_encoding(DW_ATE_signed_char)
    6582                      .dwattr $C$DW$T$7, DW_AT_name("wchar_t")
    6583                      .dwattr $C$DW$T$7, DW_AT_byte_size(0x01)
    6584              $C$DW$T$8       .dwtag  DW_TAG_base_type
    6585                      .dwattr $C$DW$T$8, DW_AT_encoding(DW_ATE_signed)
    6586                      .dwattr $C$DW$T$8, DW_AT_name("short")
    6587                      .dwattr $C$DW$T$8, DW_AT_byte_size(0x01)
    6588              $C$DW$T$9       .dwtag  DW_TAG_base_type
    6589                      .dwattr $C$DW$T$9, DW_AT_encoding(DW_ATE_unsigned)
    6590                      .dwattr $C$DW$T$9, DW_AT_name("unsigned short")
    6591                      .dwattr $C$DW$T$9, DW_AT_byte_size(0x01)
    6592              $C$DW$T$21      .dwtag  DW_TAG_typedef, DW_AT_name("uint16_t")
    6593                      .dwattr $C$DW$T$21, DW_AT_type(*$C$DW$T$9)
    6594                      .dwattr $C$DW$T$21, DW_AT_language(DW_LANG_C)
    6595              $C$DW$T$157     .dwtag  DW_TAG_pointer_type
    6596                      .dwattr $C$DW$T$157, DW_AT_type(*$C$DW$T$21)
    6597                      .dwattr $C$DW$T$157, DW_AT_address_class(0x16)
    6598              $C$DW$787       .dwtag  DW_TAG_TI_far_type
    6599                      .dwattr $C$DW$787, DW_AT_type(*$C$DW$T$157)
    6600              $C$DW$T$170     .dwtag  DW_TAG_const_type
    6601                      .dwattr $C$DW$T$170, DW_AT_type(*$C$DW$787)
    6602              $C$DW$788       .dwtag  DW_TAG_TI_far_type
    6603                      .dwattr $C$DW$788, DW_AT_type(*$C$DW$T$21)
    6604              $C$DW$T$27      .dwtag  DW_TAG_volatile_type
    6605                      .dwattr $C$DW$T$27, DW_AT_type(*$C$DW$788)
    6606              
    6607              $C$DW$T$28      .dwtag  DW_TAG_array_type
    6608                      .dwattr $C$DW$T$28, DW_AT_type(*$C$DW$T$27)
    6609                      .dwattr $C$DW$T$28, DW_AT_language(DW_LANG_C)
    6610                      .dwattr $C$DW$T$28, DW_AT_byte_size(0x02)
    6611              $C$DW$789       .dwtag  DW_TAG_subrange_type
    6612                      .dwattr $C$DW$789, DW_AT_upper_bound(0x01)
TMS320C2000 Assembler PC v6.2.5 Sat Sep 16 14:55:48 2017

Tools Copyright (c) 1996-2014 Texas Instruments Incorporated
C:\Users\wmj\AppData\Local\Temp\1116811                              PAGE  125

    6613                      .dwendtag $C$DW$T$28
    6614              
    6615              
    6616              $C$DW$T$29      .dwtag  DW_TAG_array_type
    6617                      .dwattr $C$DW$T$29, DW_AT_type(*$C$DW$T$27)
    6618                      .dwattr $C$DW$T$29, DW_AT_language(DW_LANG_C)
    6619                      .dwattr $C$DW$T$29, DW_AT_byte_size(0x18)
    6620              $C$DW$790       .dwtag  DW_TAG_subrange_type
    6621                      .dwattr $C$DW$790, DW_AT_upper_bound(0x17)
    6622                      .dwendtag $C$DW$T$29
    6623              
    6624              
    6625              $C$DW$T$30      .dwtag  DW_TAG_array_type
    6626                      .dwattr $C$DW$T$30, DW_AT_type(*$C$DW$T$27)
    6627                      .dwattr $C$DW$T$30, DW_AT_language(DW_LANG_C)
    6628                      .dwattr $C$DW$T$30, DW_AT_byte_size(0x04)
    6629              $C$DW$791       .dwtag  DW_TAG_subrange_type
    6630                      .dwattr $C$DW$791, DW_AT_upper_bound(0x03)
    6631                      .dwendtag $C$DW$T$30
    6632              
    6633              
    6634              $C$DW$T$31      .dwtag  DW_TAG_array_type
    6635                      .dwattr $C$DW$T$31, DW_AT_type(*$C$DW$T$27)
    6636                      .dwattr $C$DW$T$31, DW_AT_language(DW_LANG_C)
    6637                      .dwattr $C$DW$T$31, DW_AT_byte_size(0x08)
    6638              $C$DW$792       .dwtag  DW_TAG_subrange_type
    6639                      .dwattr $C$DW$792, DW_AT_upper_bound(0x07)
    6640                      .dwendtag $C$DW$T$31
    6641              
    6642              
    6643              $C$DW$T$32      .dwtag  DW_TAG_array_type
    6644                      .dwattr $C$DW$T$32, DW_AT_type(*$C$DW$T$27)
    6645                      .dwattr $C$DW$T$32, DW_AT_language(DW_LANG_C)
    6646                      .dwattr $C$DW$T$32, DW_AT_byte_size(0x03)
    6647              $C$DW$793       .dwtag  DW_TAG_subrange_type
    6648                      .dwattr $C$DW$793, DW_AT_upper_bound(0x02)
    6649                      .dwendtag $C$DW$T$32
    6650              
    6651              
    6652              $C$DW$T$33      .dwtag  DW_TAG_array_type
    6653                      .dwattr $C$DW$T$33, DW_AT_type(*$C$DW$T$27)
    6654                      .dwattr $C$DW$T$33, DW_AT_language(DW_LANG_C)
    6655                      .dwattr $C$DW$T$33, DW_AT_byte_size(0x05)
    6656              $C$DW$794       .dwtag  DW_TAG_subrange_type
    6657                      .dwattr $C$DW$794, DW_AT_upper_bound(0x04)
    6658                      .dwendtag $C$DW$T$33
    6659              
    6660              $C$DW$795       .dwtag  DW_TAG_TI_far_type
    6661                      .dwattr $C$DW$795, DW_AT_type(*$C$DW$T$21)
    6662              $C$DW$T$138     .dwtag  DW_TAG_const_type
    6663                      .dwattr $C$DW$T$138, DW_AT_type(*$C$DW$795)
    6664              $C$DW$T$10      .dwtag  DW_TAG_base_type
    6665                      .dwattr $C$DW$T$10, DW_AT_encoding(DW_ATE_signed)
    6666                      .dwattr $C$DW$T$10, DW_AT_name("int")
    6667                      .dwattr $C$DW$T$10, DW_AT_byte_size(0x01)
TMS320C2000 Assembler PC v6.2.5 Sat Sep 16 14:55:48 2017

Tools Copyright (c) 1996-2014 Texas Instruments Incorporated
C:\Users\wmj\AppData\Local\Temp\1116811                              PAGE  126

    6668              $C$DW$T$11      .dwtag  DW_TAG_base_type
    6669                      .dwattr $C$DW$T$11, DW_AT_encoding(DW_ATE_unsigned)
    6670                      .dwattr $C$DW$T$11, DW_AT_name("unsigned int")
    6671                      .dwattr $C$DW$T$11, DW_AT_byte_size(0x01)
    6672              $C$DW$T$12      .dwtag  DW_TAG_base_type
    6673                      .dwattr $C$DW$T$12, DW_AT_encoding(DW_ATE_signed)
    6674                      .dwattr $C$DW$T$12, DW_AT_name("long")
    6675                      .dwattr $C$DW$T$12, DW_AT_byte_size(0x02)
    6676              $C$DW$T$13      .dwtag  DW_TAG_base_type
    6677                      .dwattr $C$DW$T$13, DW_AT_encoding(DW_ATE_unsigned)
    6678                      .dwattr $C$DW$T$13, DW_AT_name("unsigned long")
    6679                      .dwattr $C$DW$T$13, DW_AT_byte_size(0x02)
    6680              $C$DW$T$112     .dwtag  DW_TAG_typedef, DW_AT_name("size_t")
    6681                      .dwattr $C$DW$T$112, DW_AT_type(*$C$DW$T$13)
    6682                      .dwattr $C$DW$T$112, DW_AT_language(DW_LANG_C)
    6683              $C$DW$796       .dwtag  DW_TAG_TI_far_type
    6684                      .dwattr $C$DW$796, DW_AT_type(*$C$DW$T$112)
    6685              $C$DW$T$113     .dwtag  DW_TAG_const_type
    6686                      .dwattr $C$DW$T$113, DW_AT_type(*$C$DW$796)
    6687              $C$DW$T$25      .dwtag  DW_TAG_typedef, DW_AT_name("uint32_t")
    6688                      .dwattr $C$DW$T$25, DW_AT_type(*$C$DW$T$13)
    6689                      .dwattr $C$DW$T$25, DW_AT_language(DW_LANG_C)
    6690              $C$DW$T$160     .dwtag  DW_TAG_pointer_type
    6691                      .dwattr $C$DW$T$160, DW_AT_type(*$C$DW$T$25)
    6692                      .dwattr $C$DW$T$160, DW_AT_address_class(0x16)
    6693              $C$DW$797       .dwtag  DW_TAG_TI_far_type
    6694                      .dwattr $C$DW$797, DW_AT_type(*$C$DW$T$160)
    6695              $C$DW$T$185     .dwtag  DW_TAG_const_type
    6696                      .dwattr $C$DW$T$185, DW_AT_type(*$C$DW$797)
    6697              $C$DW$798       .dwtag  DW_TAG_TI_far_type
    6698                      .dwattr $C$DW$798, DW_AT_type(*$C$DW$T$25)
    6699              $C$DW$T$26      .dwtag  DW_TAG_volatile_type
    6700                      .dwattr $C$DW$T$26, DW_AT_type(*$C$DW$798)
    6701              $C$DW$799       .dwtag  DW_TAG_TI_far_type
    6702                      .dwattr $C$DW$799, DW_AT_type(*$C$DW$T$25)
    6703              $C$DW$T$186     .dwtag  DW_TAG_const_type
    6704                      .dwattr $C$DW$T$186, DW_AT_type(*$C$DW$799)
    6705              $C$DW$T$14      .dwtag  DW_TAG_base_type
    6706                      .dwattr $C$DW$T$14, DW_AT_encoding(DW_ATE_signed)
    6707                      .dwattr $C$DW$T$14, DW_AT_name("long long")
    6708                      .dwattr $C$DW$T$14, DW_AT_byte_size(0x04)
    6709              $C$DW$T$15      .dwtag  DW_TAG_base_type
    6710                      .dwattr $C$DW$T$15, DW_AT_encoding(DW_ATE_unsigned)
    6711                      .dwattr $C$DW$T$15, DW_AT_name("unsigned long long")
    6712                      .dwattr $C$DW$T$15, DW_AT_byte_size(0x04)
    6713              $C$DW$T$16      .dwtag  DW_TAG_base_type
    6714                      .dwattr $C$DW$T$16, DW_AT_encoding(DW_ATE_float)
    6715                      .dwattr $C$DW$T$16, DW_AT_name("float")
    6716                      .dwattr $C$DW$T$16, DW_AT_byte_size(0x02)
    6717              $C$DW$T$17      .dwtag  DW_TAG_base_type
    6718                      .dwattr $C$DW$T$17, DW_AT_encoding(DW_ATE_float)
    6719                      .dwattr $C$DW$T$17, DW_AT_name("double")
    6720                      .dwattr $C$DW$T$17, DW_AT_byte_size(0x02)
    6721              $C$DW$T$18      .dwtag  DW_TAG_base_type
    6722                      .dwattr $C$DW$T$18, DW_AT_encoding(DW_ATE_float)
TMS320C2000 Assembler PC v6.2.5 Sat Sep 16 14:55:48 2017

Tools Copyright (c) 1996-2014 Texas Instruments Incorporated
C:\Users\wmj\AppData\Local\Temp\1116811                              PAGE  127

    6723                      .dwattr $C$DW$T$18, DW_AT_name("long double")
    6724                      .dwattr $C$DW$T$18, DW_AT_byte_size(0x04)
    6725              
    6726              $C$DW$T$75      .dwtag  DW_TAG_union_type
    6727                      .dwattr $C$DW$T$75, DW_AT_name("data_u")
    6728                      .dwattr $C$DW$T$75, DW_AT_byte_size(0x02)
    6729              $C$DW$800       .dwtag  DW_TAG_member
    6730                      .dwattr $C$DW$800, DW_AT_type(*$C$DW$T$22)
    6731                      .dwattr $C$DW$800, DW_AT_name("Data_t")
    6732                      .dwattr $C$DW$800, DW_AT_TI_symbol_name("_Data_t")
    6733                      .dwattr $C$DW$800, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    6734                      .dwattr $C$DW$800, DW_AT_accessibility(DW_ACCESS_public)
    6735              $C$DW$801       .dwtag  DW_TAG_member
    6736                      .dwattr $C$DW$801, DW_AT_type(*$C$DW$T$25)
    6737                      .dwattr $C$DW$801, DW_AT_name("Data_u32")
    6738                      .dwattr $C$DW$801, DW_AT_TI_symbol_name("_Data_u32")
    6739                      .dwattr $C$DW$801, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    6740                      .dwattr $C$DW$801, DW_AT_accessibility(DW_ACCESS_public)
    6741                      .dwendtag $C$DW$T$75
    6742              
    6743                      .dwattr $C$DW$CU, DW_AT_language(DW_LANG_C)
    6744              
    6745              ;***************************************************************
    6746              ;* DWARF CIE ENTRIES                                           *
    6747              ;***************************************************************
    6748              
    6749              $C$DW$CIE       .dwcie 78
    6750                      .dwcfi  cfa_register, 20
    6751                      .dwcfi  cfa_offset, 0
    6752                      .dwcfi  undefined, 0
    6753                      .dwcfi  undefined, 1
    6754                      .dwcfi  undefined, 2
    6755                      .dwcfi  undefined, 3
    6756                      .dwcfi  undefined, 20
    6757                      .dwcfi  undefined, 21
    6758                      .dwcfi  undefined, 22
    6759                      .dwcfi  undefined, 23
    6760                      .dwcfi  undefined, 24
    6761                      .dwcfi  undefined, 25
    6762                      .dwcfi  undefined, 26
    6763                      .dwcfi  same_value, 28
    6764                      .dwcfi  undefined, 29
    6765                      .dwcfi  undefined, 30
    6766                      .dwcfi  undefined, 31
    6767                      .dwcfi  undefined, 32
    6768                      .dwcfi  undefined, 33
    6769                      .dwcfi  undefined, 34
    6770                      .dwcfi  undefined, 35
    6771                      .dwcfi  undefined, 36
    6772                      .dwcfi  undefined, 37
    6773                      .dwcfi  undefined, 38
    6774                      .dwcfi  undefined, 75
    6775                      .dwcfi  undefined, 76
    6776                      .dwcfi  undefined, 77
    6777                      .dwcfi  undefined, 4
TMS320C2000 Assembler PC v6.2.5 Sat Sep 16 14:55:48 2017

Tools Copyright (c) 1996-2014 Texas Instruments Incorporated
C:\Users\wmj\AppData\Local\Temp\1116811                              PAGE  128

    6778                      .dwcfi  same_value, 6
    6779                      .dwcfi  same_value, 8
    6780                      .dwcfi  same_value, 10
    6781                      .dwcfi  undefined, 12
    6782                      .dwcfi  undefined, 14
    6783                      .dwcfi  undefined, 16
    6784                      .dwcfi  undefined, 17
    6785                      .dwcfi  undefined, 18
    6786                      .dwcfi  undefined, 19
    6787                      .dwcfi  undefined, 5
    6788                      .dwcfi  same_value, 7
    6789                      .dwcfi  same_value, 9
    6790                      .dwcfi  same_value, 11
    6791                      .dwcfi  undefined, 13
    6792                      .dwcfi  undefined, 15
    6793                      .dwcfi  undefined, 78
    6794                      .dwendentry
    6795              
    6796              ;***************************************************************
    6797              ;* DWARF REGISTER MAP                                          *
    6798              ;***************************************************************
    6799              
    6800              $C$DW$802       .dwtag  DW_TAG_TI_assign_register, DW_AT_name("AL")
    6801                      .dwattr $C$DW$802, DW_AT_location[DW_OP_reg0]
    6802              $C$DW$803       .dwtag  DW_TAG_TI_assign_register, DW_AT_name("AH")
    6803                      .dwattr $C$DW$803, DW_AT_location[DW_OP_reg1]
    6804              $C$DW$804       .dwtag  DW_TAG_TI_assign_register, DW_AT_name("PL")
