TMS320C2000 Assembler PC v15.12.3 Wed Nov 22 01:55:15 2017

Tools Copyright (c) 1996-2015 Texas Instruments Incorporated
C:\Users\wmj\AppData\Local\Temp\1239610                              PAGE    1

       1              ;***************************************************************
       2              ;* TMS320C2000 C/C++ Codegen                   PC v15.12.3.LTS *
       3              ;* Date/Time created: Wed Nov 22 01:55:15 2017                 *
       4              ;***************************************************************
       5                      .compiler_opts --abi=coffabi --float_support=softlib --hll_source=on --mem_model:code=flat --mem_mode
       6        0002  FP      .set    XAR2
       7              
       8              $C$DW$CU        .dwtag  DW_TAG_compile_unit
       9                      .dwattr $C$DW$CU, DW_AT_name("C:/Users/wmj/Desktop/BM1000_v1.1/sw/drivers/drvic/modbus/mb.c")
      10                      .dwattr $C$DW$CU, DW_AT_producer("TI TMS320C2000 C/C++ Codegen PC v15.12.3.LTS Copyright (c) 1996-201
      11                      .dwattr $C$DW$CU, DW_AT_TI_version(0x01)
      12                      .dwattr $C$DW$CU, DW_AT_comp_dir("C:\Users\wmj\Desktop\BM1000_v1.1\sw\solutions\instaspin_foc\boards\
      13              
      14              $C$DW$1 .dwtag  DW_TAG_subprogram
      15                      .dwattr $C$DW$1, DW_AT_name("FSM_clrOverCurrentReg")

    5674                      .dwattr $C$DW$499, DW_AT_name("GPIO_Rsvd_22")
    5675                      .dwattr $C$DW$499, DW_AT_const_value(0x16)
    5676              
    5677              $C$DW$500       .dwtag  DW_TAG_enumerator
    5678                      .dwattr $C$DW$500, DW_AT_name("GPIO_Rsvd_23")
    5679                      .dwattr $C$DW$500, DW_AT_const_value(0x17)
    5680              
    5681              $C$DW$501       .dwtag  DW_TAG_enumerator
    5682                      .dwattr $C$DW$501, DW_AT_name("GPIO_Rsvd_24")
    5683                      .dwattr $C$DW$501, DW_AT_const_value(0x18)
    5684              
    5685              $C$DW$502       .dwtag  DW_TAG_enumerator
    5686                      .dwattr $C$DW$502, DW_AT_name("GPIO_Rsvd_25")
    5687                      .dwattr $C$DW$502, DW_AT_const_value(0x19)
    5688              
    5689              $C$DW$503       .dwtag  DW_TAG_enumerator
    5690                      .dwattr $C$DW$503, DW_AT_name("GPIO_Rsvd_26")
    5691                      .dwattr $C$DW$503, DW_AT_const_value(0x1a)
    5692              
    5693              $C$DW$504       .dwtag  DW_TAG_enumerator
    5694                      .dwattr $C$DW$504, DW_AT_name("GPIO_Rsvd_27")
    5695                      .dwattr $C$DW$504, DW_AT_const_value(0x1b)
    5696              
    5697              $C$DW$505       .dwtag  DW_TAG_enumerator
    5698                      .dwattr $C$DW$505, DW_AT_name("GPIO_Number_28")
    5699                      .dwattr $C$DW$505, DW_AT_const_value(0x1c)
    5700              
    5701              $C$DW$506       .dwtag  DW_TAG_enumerator
TMS320C2000 Assembler PC v15.12.3 Wed Nov 22 01:55:15 2017

Tools Copyright (c) 1996-2015 Texas Instruments Incorporated
C:\Users\wmj\AppData\Local\Temp\1239610                              PAGE  108

    5702                      .dwattr $C$DW$506, DW_AT_name("GPIO_Number_29")
    5703                      .dwattr $C$DW$506, DW_AT_const_value(0x1d)
    5704              
    5705              $C$DW$507       .dwtag  DW_TAG_enumerator
    5706                      .dwattr $C$DW$507, DW_AT_name("GPIO_Rsvd_30")
    5707                      .dwattr $C$DW$507, DW_AT_const_value(0x1e)
    5708              
    5709              $C$DW$508       .dwtag  DW_TAG_enumerator
    5710                      .dwattr $C$DW$508, DW_AT_name("GPIO_Rsvd_31")
    5711                      .dwattr $C$DW$508, DW_AT_const_value(0x1f)
    5712              
    5713              $C$DW$509       .dwtag  DW_TAG_enumerator
    5714                      .dwattr $C$DW$509, DW_AT_name("GPIO_Number_32")
    5715                      .dwattr $C$DW$509, DW_AT_const_value(0x20)
    5716              
    5717              $C$DW$510       .dwtag  DW_TAG_enumerator
    5718                      .dwattr $C$DW$510, DW_AT_name("GPIO_Number_33")
    5719                      .dwattr $C$DW$510, DW_AT_const_value(0x21)
    5720              
    5721              $C$DW$511       .dwtag  DW_TAG_enumerator
    5722                      .dwattr $C$DW$511, DW_AT_name("GPIO_Number_34")
    5723                      .dwattr $C$DW$511, DW_AT_const_value(0x22)
    5724              
    5725              $C$DW$512       .dwtag  DW_TAG_enumerator
    5726                      .dwattr $C$DW$512, DW_AT_name("GPIO_Number_35")
    5727                      .dwattr $C$DW$512, DW_AT_const_value(0x23)
    5728              
    5729              $C$DW$513       .dwtag  DW_TAG_enumerator
    5730                      .dwattr $C$DW$513, DW_AT_name("GPIO_Number_36")
    5731                      .dwattr $C$DW$513, DW_AT_const_value(0x24)
    5732              
    5733              $C$DW$514       .dwtag  DW_TAG_enumerator
    5734                      .dwattr $C$DW$514, DW_AT_name("GPIO_Number_37")
    5735                      .dwattr $C$DW$514, DW_AT_const_value(0x25)
    5736              
    5737              $C$DW$515       .dwtag  DW_TAG_enumerator
    5738                      .dwattr $C$DW$515, DW_AT_name("GPIO_Number_38")
    5739                      .dwattr $C$DW$515, DW_AT_const_value(0x26)
    5740              
    5741              $C$DW$516       .dwtag  DW_TAG_enumerator
    5742                      .dwattr $C$DW$516, DW_AT_name("GPIO_numGpios")
    5743                      .dwattr $C$DW$516, DW_AT_const_value(0x27)
    5744              
    5745                      .dwendtag $C$DW$T$190
    5746              
    5747              $C$DW$T$191     .dwtag  DW_TAG_typedef
    5748                      .dwattr $C$DW$T$191, DW_AT_name("GPIO_Number_e")
    5749                      .dwattr $C$DW$T$191, DW_AT_type(*$C$DW$T$190)
    5750                      .dwattr $C$DW$T$191, DW_AT_language(DW_LANG_C)
    5751              
    5752              $C$DW$517       .dwtag  DW_TAG_TI_far_type
    5753                      .dwattr $C$DW$517, DW_AT_type(*$C$DW$T$191)
    5754              
    5755              $C$DW$T$192     .dwtag  DW_TAG_const_type
    5756                      .dwattr $C$DW$T$192, DW_AT_type(*$C$DW$517)
TMS320C2000 Assembler PC v15.12.3 Wed Nov 22 01:55:15 2017

Tools Copyright (c) 1996-2015 Texas Instruments Incorporated
C:\Users\wmj\AppData\Local\Temp\1239610                              PAGE  109

    5757              
    5758              
    5759              $C$DW$T$29      .dwtag  DW_TAG_structure_type
    5760                      .dwattr $C$DW$T$29, DW_AT_name("_ADC_Obj_")
    5761                      .dwattr $C$DW$T$29, DW_AT_byte_size(0x6650)
    5762              $C$DW$518       .dwtag  DW_TAG_member
    5763                      .dwattr $C$DW$518, DW_AT_type(*$C$DW$T$23)
    5764                      .dwattr $C$DW$518, DW_AT_name("ADCRESULT")
    5765                      .dwattr $C$DW$518, DW_AT_TI_symbol_name("_ADCRESULT")
    5766                      .dwattr $C$DW$518, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    5767                      .dwattr $C$DW$518, DW_AT_accessibility(DW_ACCESS_public)
    5768              
    5769              $C$DW$519       .dwtag  DW_TAG_member
    5770                      .dwattr $C$DW$519, DW_AT_type(*$C$DW$T$24)
    5771                      .dwattr $C$DW$519, DW_AT_name("resvd_1")
    5772                      .dwattr $C$DW$519, DW_AT_TI_symbol_name("_resvd_1")
    5773                      .dwattr $C$DW$519, DW_AT_data_member_location[DW_OP_plus_uconst 0x10]
    5774                      .dwattr $C$DW$519, DW_AT_accessibility(DW_ACCESS_public)
    5775              
    5776              $C$DW$520       .dwtag  DW_TAG_member
    5777                      .dwattr $C$DW$520, DW_AT_type(*$C$DW$T$22)
    5778                      .dwattr $C$DW$520, DW_AT_name("ADCCTL1")
    5779                      .dwattr $C$DW$520, DW_AT_TI_symbol_name("_ADCCTL1")
    5780                      .dwattr $C$DW$520, DW_AT_data_member_location[DW_OP_plus_uconst 0x6600]
    5781                      .dwattr $C$DW$520, DW_AT_accessibility(DW_ACCESS_public)
    5782              
    5783              $C$DW$521       .dwtag  DW_TAG_member
    5784                      .dwattr $C$DW$521, DW_AT_type(*$C$DW$T$22)
    5785                      .dwattr $C$DW$521, DW_AT_name("ADCCTL2")
    5786                      .dwattr $C$DW$521, DW_AT_TI_symbol_name("_ADCCTL2")
    5787                      .dwattr $C$DW$521, DW_AT_data_member_location[DW_OP_plus_uconst 0x6601]
    5788                      .dwattr $C$DW$521, DW_AT_accessibility(DW_ACCESS_public)
    5789              
    5790              $C$DW$522       .dwtag  DW_TAG_member
    5791                      .dwattr $C$DW$522, DW_AT_type(*$C$DW$T$25)
    5792                      .dwattr $C$DW$522, DW_AT_name("rsvd_2")
    5793                      .dwattr $C$DW$522, DW_AT_TI_symbol_name("_rsvd_2")
    5794                      .dwattr $C$DW$522, DW_AT_data_member_location[DW_OP_plus_uconst 0x6602]
    5795                      .dwattr $C$DW$522, DW_AT_accessibility(DW_ACCESS_public)
    5796              
    5797              $C$DW$523       .dwtag  DW_TAG_member
    5798                      .dwattr $C$DW$523, DW_AT_type(*$C$DW$T$22)
    5799                      .dwattr $C$DW$523, DW_AT_name("ADCINTFLG")
    5800                      .dwattr $C$DW$523, DW_AT_TI_symbol_name("_ADCINTFLG")
    5801                      .dwattr $C$DW$523, DW_AT_data_member_location[DW_OP_plus_uconst 0x6604]
    5802                      .dwattr $C$DW$523, DW_AT_accessibility(DW_ACCESS_public)
    5803              
    5804              $C$DW$524       .dwtag  DW_TAG_member
    5805                      .dwattr $C$DW$524, DW_AT_type(*$C$DW$T$22)
    5806                      .dwattr $C$DW$524, DW_AT_name("ADCINTFLGCLR")
    5807                      .dwattr $C$DW$524, DW_AT_TI_symbol_name("_ADCINTFLGCLR")
    5808                      .dwattr $C$DW$524, DW_AT_data_member_location[DW_OP_plus_uconst 0x6605]
    5809                      .dwattr $C$DW$524, DW_AT_accessibility(DW_ACCESS_public)
    5810              
    5811              $C$DW$525       .dwtag  DW_TAG_member
TMS320C2000 Assembler PC v15.12.3 Wed Nov 22 01:55:15 2017

Tools Copyright (c) 1996-2015 Texas Instruments Incorporated
C:\Users\wmj\AppData\Local\Temp\1239610                              PAGE  110

    5812                      .dwattr $C$DW$525, DW_AT_type(*$C$DW$T$22)
    5813                      .dwattr $C$DW$525, DW_AT_name("ADCINTOVF")
    5814                      .dwattr $C$DW$525, DW_AT_TI_symbol_name("_ADCINTOVF")
    5815                      .dwattr $C$DW$525, DW_AT_data_member_location[DW_OP_plus_uconst 0x6606]
    5816                      .dwattr $C$DW$525, DW_AT_accessibility(DW_ACCESS_public)
    5817              
    5818              $C$DW$526       .dwtag  DW_TAG_member
    5819                      .dwattr $C$DW$526, DW_AT_type(*$C$DW$T$22)
    5820                      .dwattr $C$DW$526, DW_AT_name("ADCINTOVFCLR")
    5821                      .dwattr $C$DW$526, DW_AT_TI_symbol_name("_ADCINTOVFCLR")
    5822                      .dwattr $C$DW$526, DW_AT_data_member_location[DW_OP_plus_uconst 0x6607]
    5823                      .dwattr $C$DW$526, DW_AT_accessibility(DW_ACCESS_public)
    5824              
    5825              $C$DW$527       .dwtag  DW_TAG_member
    5826                      .dwattr $C$DW$527, DW_AT_type(*$C$DW$T$26)
    5827                      .dwattr $C$DW$527, DW_AT_name("INTSELxNy")
    5828                      .dwattr $C$DW$527, DW_AT_TI_symbol_name("_INTSELxNy")
    5829                      .dwattr $C$DW$527, DW_AT_data_member_location[DW_OP_plus_uconst 0x6608]
    5830                      .dwattr $C$DW$527, DW_AT_accessibility(DW_ACCESS_public)
    5831              
    5832              $C$DW$528       .dwtag  DW_TAG_member
    5833                      .dwattr $C$DW$528, DW_AT_type(*$C$DW$T$27)
    5834                      .dwattr $C$DW$528, DW_AT_name("rsvd_3")
    5835                      .dwattr $C$DW$528, DW_AT_TI_symbol_name("_rsvd_3")
    5836                      .dwattr $C$DW$528, DW_AT_data_member_location[DW_OP_plus_uconst 0x660d]
    5837                      .dwattr $C$DW$528, DW_AT_accessibility(DW_ACCESS_public)
    5838              
    5839              $C$DW$529       .dwtag  DW_TAG_member
    5840                      .dwattr $C$DW$529, DW_AT_type(*$C$DW$T$22)
    5841                      .dwattr $C$DW$529, DW_AT_name("SOCPRICTRL")
    5842                      .dwattr $C$DW$529, DW_AT_TI_symbol_name("_SOCPRICTRL")
    5843                      .dwattr $C$DW$529, DW_AT_data_member_location[DW_OP_plus_uconst 0x6610]
    5844                      .dwattr $C$DW$529, DW_AT_accessibility(DW_ACCESS_public)
    5845              
    5846              $C$DW$530       .dwtag  DW_TAG_member
    5847                      .dwattr $C$DW$530, DW_AT_type(*$C$DW$T$22)
    5848                      .dwattr $C$DW$530, DW_AT_name("rsvd_4")
    5849                      .dwattr $C$DW$530, DW_AT_TI_symbol_name("_rsvd_4")
    5850                      .dwattr $C$DW$530, DW_AT_data_member_location[DW_OP_plus_uconst 0x6611]
    5851                      .dwattr $C$DW$530, DW_AT_accessibility(DW_ACCESS_public)
    5852              
    5853              $C$DW$531       .dwtag  DW_TAG_member
    5854                      .dwattr $C$DW$531, DW_AT_type(*$C$DW$T$22)
    5855                      .dwattr $C$DW$531, DW_AT_name("ADCSAMPLEMODE")
    5856                      .dwattr $C$DW$531, DW_AT_TI_symbol_name("_ADCSAMPLEMODE")
    5857                      .dwattr $C$DW$531, DW_AT_data_member_location[DW_OP_plus_uconst 0x6612]
    5858                      .dwattr $C$DW$531, DW_AT_accessibility(DW_ACCESS_public)
    5859              
    5860              $C$DW$532       .dwtag  DW_TAG_member
    5861                      .dwattr $C$DW$532, DW_AT_type(*$C$DW$T$22)
    5862                      .dwattr $C$DW$532, DW_AT_name("rsvd_5")
    5863                      .dwattr $C$DW$532, DW_AT_TI_symbol_name("_rsvd_5")
    5864                      .dwattr $C$DW$532, DW_AT_data_member_location[DW_OP_plus_uconst 0x6613]
    5865                      .dwattr $C$DW$532, DW_AT_accessibility(DW_ACCESS_public)
    5866              
TMS320C2000 Assembler PC v15.12.3 Wed Nov 22 01:55:15 2017

Tools Copyright (c) 1996-2015 Texas Instruments Incorporated
C:\Users\wmj\AppData\Local\Temp\1239610                              PAGE  111

    5867              $C$DW$533       .dwtag  DW_TAG_member
    5868                      .dwattr $C$DW$533, DW_AT_type(*$C$DW$T$22)
    5869                      .dwattr $C$DW$533, DW_AT_name("ADCINTSOCSEL1")
    5870                      .dwattr $C$DW$533, DW_AT_TI_symbol_name("_ADCINTSOCSEL1")
    5871                      .dwattr $C$DW$533, DW_AT_data_member_location[DW_OP_plus_uconst 0x6614]
    5872                      .dwattr $C$DW$533, DW_AT_accessibility(DW_ACCESS_public)
    5873              
    5874              $C$DW$534       .dwtag  DW_TAG_member
    5875                      .dwattr $C$DW$534, DW_AT_type(*$C$DW$T$22)
    5876                      .dwattr $C$DW$534, DW_AT_name("ADCINTSOCSEL2")
    5877                      .dwattr $C$DW$534, DW_AT_TI_symbol_name("_ADCINTSOCSEL2")
    5878                      .dwattr $C$DW$534, DW_AT_data_member_location[DW_OP_plus_uconst 0x6615]
    5879                      .dwattr $C$DW$534, DW_AT_accessibility(DW_ACCESS_public)
    5880              
    5881              $C$DW$535       .dwtag  DW_TAG_member
    5882                      .dwattr $C$DW$535, DW_AT_type(*$C$DW$T$25)
    5883                      .dwattr $C$DW$535, DW_AT_name("rsvd_6")
    5884                      .dwattr $C$DW$535, DW_AT_TI_symbol_name("_rsvd_6")
    5885                      .dwattr $C$DW$535, DW_AT_data_member_location[DW_OP_plus_uconst 0x6616]
    5886                      .dwattr $C$DW$535, DW_AT_accessibility(DW_ACCESS_public)
    5887              
    5888              $C$DW$536       .dwtag  DW_TAG_member
    5889                      .dwattr $C$DW$536, DW_AT_type(*$C$DW$T$22)
    5890                      .dwattr $C$DW$536, DW_AT_name("ADCSOCFLG1")
    5891                      .dwattr $C$DW$536, DW_AT_TI_symbol_name("_ADCSOCFLG1")
    5892                      .dwattr $C$DW$536, DW_AT_data_member_location[DW_OP_plus_uconst 0x6618]
    5893                      .dwattr $C$DW$536, DW_AT_accessibility(DW_ACCESS_public)
    5894              
    5895              $C$DW$537       .dwtag  DW_TAG_member
    5896                      .dwattr $C$DW$537, DW_AT_type(*$C$DW$T$22)
    5897                      .dwattr $C$DW$537, DW_AT_name("rsvd_7")
    5898                      .dwattr $C$DW$537, DW_AT_TI_symbol_name("_rsvd_7")
    5899                      .dwattr $C$DW$537, DW_AT_data_member_location[DW_OP_plus_uconst 0x6619]
    5900                      .dwattr $C$DW$537, DW_AT_accessibility(DW_ACCESS_public)
    5901              
    5902              $C$DW$538       .dwtag  DW_TAG_member
    5903                      .dwattr $C$DW$538, DW_AT_type(*$C$DW$T$22)
    5904                      .dwattr $C$DW$538, DW_AT_name("ADCSOCFRC1")
    5905                      .dwattr $C$DW$538, DW_AT_TI_symbol_name("_ADCSOCFRC1")
    5906                      .dwattr $C$DW$538, DW_AT_data_member_location[DW_OP_plus_uconst 0x661a]
    5907                      .dwattr $C$DW$538, DW_AT_accessibility(DW_ACCESS_public)
    5908              
    5909              $C$DW$539       .dwtag  DW_TAG_member
    5910                      .dwattr $C$DW$539, DW_AT_type(*$C$DW$T$22)
    5911                      .dwattr $C$DW$539, DW_AT_name("rsvd_8")
    5912                      .dwattr $C$DW$539, DW_AT_TI_symbol_name("_rsvd_8")
    5913                      .dwattr $C$DW$539, DW_AT_data_member_location[DW_OP_plus_uconst 0x661b]
    5914                      .dwattr $C$DW$539, DW_AT_accessibility(DW_ACCESS_public)
    5915              
    5916              $C$DW$540       .dwtag  DW_TAG_member
    5917                      .dwattr $C$DW$540, DW_AT_type(*$C$DW$T$22)
    5918                      .dwattr $C$DW$540, DW_AT_name("ADCSOCOVF1")
    5919                      .dwattr $C$DW$540, DW_AT_TI_symbol_name("_ADCSOCOVF1")
    5920                      .dwattr $C$DW$540, DW_AT_data_member_location[DW_OP_plus_uconst 0x661c]
    5921                      .dwattr $C$DW$540, DW_AT_accessibility(DW_ACCESS_public)
TMS320C2000 Assembler PC v15.12.3 Wed Nov 22 01:55:15 2017

Tools Copyright (c) 1996-2015 Texas Instruments Incorporated
C:\Users\wmj\AppData\Local\Temp\1239610                              PAGE  112

    5922              
    5923              $C$DW$541       .dwtag  DW_TAG_member
    5924                      .dwattr $C$DW$541, DW_AT_type(*$C$DW$T$22)
    5925                      .dwattr $C$DW$541, DW_AT_name("rsvd_9")
    5926                      .dwattr $C$DW$541, DW_AT_TI_symbol_name("_rsvd_9")
    5927                      .dwattr $C$DW$541, DW_AT_data_member_location[DW_OP_plus_uconst 0x661d]
    5928                      .dwattr $C$DW$541, DW_AT_accessibility(DW_ACCESS_public)
    5929              
    5930              $C$DW$542       .dwtag  DW_TAG_member
    5931                      .dwattr $C$DW$542, DW_AT_type(*$C$DW$T$22)
    5932                      .dwattr $C$DW$542, DW_AT_name("ADCSOCOVFCLR1")
    5933                      .dwattr $C$DW$542, DW_AT_TI_symbol_name("_ADCSOCOVFCLR1")
    5934                      .dwattr $C$DW$542, DW_AT_data_member_location[DW_OP_plus_uconst 0x661e]
    5935                      .dwattr $C$DW$542, DW_AT_accessibility(DW_ACCESS_public)
    5936              
    5937              $C$DW$543       .dwtag  DW_TAG_member
    5938                      .dwattr $C$DW$543, DW_AT_type(*$C$DW$T$22)
    5939                      .dwattr $C$DW$543, DW_AT_name("rsvd_10")
    5940                      .dwattr $C$DW$543, DW_AT_TI_symbol_name("_rsvd_10")
    5941                      .dwattr $C$DW$543, DW_AT_data_member_location[DW_OP_plus_uconst 0x661f]
    5942                      .dwattr $C$DW$543, DW_AT_accessibility(DW_ACCESS_public)
    5943              
    5944              $C$DW$544       .dwtag  DW_TAG_member
    5945                      .dwattr $C$DW$544, DW_AT_type(*$C$DW$T$23)
    5946                      .dwattr $C$DW$544, DW_AT_name("ADCSOCxCTL")
    5947                      .dwattr $C$DW$544, DW_AT_TI_symbol_name("_ADCSOCxCTL")
    5948                      .dwattr $C$DW$544, DW_AT_data_member_location[DW_OP_plus_uconst 0x6620]
    5949                      .dwattr $C$DW$544, DW_AT_accessibility(DW_ACCESS_public)
    5950              
    5951              $C$DW$545       .dwtag  DW_TAG_member
    5952                      .dwattr $C$DW$545, DW_AT_type(*$C$DW$T$23)
    5953                      .dwattr $C$DW$545, DW_AT_name("rsvd_11")
    5954                      .dwattr $C$DW$545, DW_AT_TI_symbol_name("_rsvd_11")
    5955                      .dwattr $C$DW$545, DW_AT_data_member_location[DW_OP_plus_uconst 0x6630]
    5956                      .dwattr $C$DW$545, DW_AT_accessibility(DW_ACCESS_public)
    5957              
    5958              $C$DW$546       .dwtag  DW_TAG_member
    5959                      .dwattr $C$DW$546, DW_AT_type(*$C$DW$T$22)
    5960                      .dwattr $C$DW$546, DW_AT_name("ADCREFTRIM")
    5961                      .dwattr $C$DW$546, DW_AT_TI_symbol_name("_ADCREFTRIM")
    5962                      .dwattr $C$DW$546, DW_AT_data_member_location[DW_OP_plus_uconst 0x6640]
    5963                      .dwattr $C$DW$546, DW_AT_accessibility(DW_ACCESS_public)
    5964              
    5965              $C$DW$547       .dwtag  DW_TAG_member
    5966                      .dwattr $C$DW$547, DW_AT_type(*$C$DW$T$22)
    5967                      .dwattr $C$DW$547, DW_AT_name("ADCOFFTRIM")
    5968                      .dwattr $C$DW$547, DW_AT_TI_symbol_name("_ADCOFFTRIM")
    5969                      .dwattr $C$DW$547, DW_AT_data_member_location[DW_OP_plus_uconst 0x6641]
    5970                      .dwattr $C$DW$547, DW_AT_accessibility(DW_ACCESS_public)
    5971              
    5972              $C$DW$548       .dwtag  DW_TAG_member
    5973                      .dwattr $C$DW$548, DW_AT_type(*$C$DW$T$28)
    5974                      .dwattr $C$DW$548, DW_AT_name("resvd_12")
    5975                      .dwattr $C$DW$548, DW_AT_TI_symbol_name("_resvd_12")
    5976                      .dwattr $C$DW$548, DW_AT_data_member_location[DW_OP_plus_uconst 0x6642]
TMS320C2000 Assembler PC v15.12.3 Wed Nov 22 01:55:15 2017

Tools Copyright (c) 1996-2015 Texas Instruments Incorporated
C:\Users\wmj\AppData\Local\Temp\1239610                              PAGE  113

    5977                      .dwattr $C$DW$548, DW_AT_accessibility(DW_ACCESS_public)
    5978              
    5979              $C$DW$549       .dwtag  DW_TAG_member
    5980                      .dwattr $C$DW$549, DW_AT_type(*$C$DW$T$22)
    5981                      .dwattr $C$DW$549, DW_AT_name("ADCREV")
    5982                      .dwattr $C$DW$549, DW_AT_TI_symbol_name("_ADCREV")
    5983                      .dwattr $C$DW$549, DW_AT_data_member_location[DW_OP_plus_uconst 0x664f]
    5984                      .dwattr $C$DW$549, DW_AT_accessibility(DW_ACCESS_public)
    5985              
    5986                      .dwendtag $C$DW$T$29
    5987              
    5988              $C$DW$T$79      .dwtag  DW_TAG_pointer_type
    5989                      .dwattr $C$DW$T$79, DW_AT_type(*$C$DW$T$29)
    5990                      .dwattr $C$DW$T$79, DW_AT_address_class(0x20)
    5991              
    5992              $C$DW$T$80      .dwtag  DW_TAG_typedef
    5993                      .dwattr $C$DW$T$80, DW_AT_name("ADC_Handle")
    5994                      .dwattr $C$DW$T$80, DW_AT_type(*$C$DW$T$79)
    5995                      .dwattr $C$DW$T$80, DW_AT_language(DW_LANG_C)
    5996              
    5997              
    5998              $C$DW$T$31      .dwtag  DW_TAG_structure_type
    5999                      .dwattr $C$DW$T$31, DW_AT_name("_CLK_Obj_")
    6000                      .dwattr $C$DW$T$31, DW_AT_byte_size(0x11)
    6001              $C$DW$550       .dwtag  DW_TAG_member
    6002                      .dwattr $C$DW$550, DW_AT_type(*$C$DW$T$22)
    6003                      .dwattr $C$DW$550, DW_AT_name("XCLK")
    6004                      .dwattr $C$DW$550, DW_AT_TI_symbol_name("_XCLK")
    6005                      .dwattr $C$DW$550, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    6006                      .dwattr $C$DW$550, DW_AT_accessibility(DW_ACCESS_public)
    6007              
    6008              $C$DW$551       .dwtag  DW_TAG_member
    6009                      .dwattr $C$DW$551, DW_AT_type(*$C$DW$T$22)
    6010                      .dwattr $C$DW$551, DW_AT_name("rsvd_1")
    6011                      .dwattr $C$DW$551, DW_AT_TI_symbol_name("_rsvd_1")
    6012                      .dwattr $C$DW$551, DW_AT_data_member_location[DW_OP_plus_uconst 0x1]
    6013                      .dwattr $C$DW$551, DW_AT_accessibility(DW_ACCESS_public)
    6014              
    6015              $C$DW$552       .dwtag  DW_TAG_member
    6016                      .dwattr $C$DW$552, DW_AT_type(*$C$DW$T$22)
    6017                      .dwattr $C$DW$552, DW_AT_name("CLKCTL")
    6018                      .dwattr $C$DW$552, DW_AT_TI_symbol_name("_CLKCTL")
    6019                      .dwattr $C$DW$552, DW_AT_data_member_location[DW_OP_plus_uconst 0x2]
    6020                      .dwattr $C$DW$552, DW_AT_accessibility(DW_ACCESS_public)
    6021              
    6022              $C$DW$553       .dwtag  DW_TAG_member
    6023                      .dwattr $C$DW$553, DW_AT_type(*$C$DW$T$30)
    6024                      .dwattr $C$DW$553, DW_AT_name("rsvd_2")
    6025                      .dwattr $C$DW$553, DW_AT_TI_symbol_name("_rsvd_2")
    6026                      .dwattr $C$DW$553, DW_AT_data_member_location[DW_OP_plus_uconst 0x3]
    6027                      .dwattr $C$DW$553, DW_AT_accessibility(DW_ACCESS_public)
    6028              
    6029              $C$DW$554       .dwtag  DW_TAG_member
    6030                      .dwattr $C$DW$554, DW_AT_type(*$C$DW$T$22)
    6031                      .dwattr $C$DW$554, DW_AT_name("LOSPCP")
TMS320C2000 Assembler PC v15.12.3 Wed Nov 22 01:55:15 2017

Tools Copyright (c) 1996-2015 Texas Instruments Incorporated
C:\Users\wmj\AppData\Local\Temp\1239610                              PAGE  114

    6032                      .dwattr $C$DW$554, DW_AT_TI_symbol_name("_LOSPCP")
    6033                      .dwattr $C$DW$554, DW_AT_data_member_location[DW_OP_plus_uconst 0xb]
    6034                      .dwattr $C$DW$554, DW_AT_accessibility(DW_ACCESS_public)
    6035              
    6036              $C$DW$555       .dwtag  DW_TAG_member
    6037                      .dwattr $C$DW$555, DW_AT_type(*$C$DW$T$22)
    6038                      .dwattr $C$DW$555, DW_AT_name("PCLKCR0")
    6039                      .dwattr $C$DW$555, DW_AT_TI_symbol_name("_PCLKCR0")
    6040                      .dwattr $C$DW$555, DW_AT_data_member_location[DW_OP_plus_uconst 0xc]
    6041                      .dwattr $C$DW$555, DW_AT_accessibility(DW_ACCESS_public)
    6042              
    6043              $C$DW$556       .dwtag  DW_TAG_member
    6044                      .dwattr $C$DW$556, DW_AT_type(*$C$DW$T$22)
    6045                      .dwattr $C$DW$556, DW_AT_name("PCLKCR1")
    6046                      .dwattr $C$DW$556, DW_AT_TI_symbol_name("_PCLKCR1")
    6047                      .dwattr $C$DW$556, DW_AT_data_member_location[DW_OP_plus_uconst 0xd]
    6048                      .dwattr $C$DW$556, DW_AT_accessibility(DW_ACCESS_public)
    6049              
    6050              $C$DW$557       .dwtag  DW_TAG_member
    6051                      .dwattr $C$DW$557, DW_AT_type(*$C$DW$T$25)
    6052                      .dwattr $C$DW$557, DW_AT_name("rsvd_3")
    6053                      .dwattr $C$DW$557, DW_AT_TI_symbol_name("_rsvd_3")
    6054                      .dwattr $C$DW$557, DW_AT_data_member_location[DW_OP_plus_uconst 0xe]
    6055                      .dwattr $C$DW$557, DW_AT_accessibility(DW_ACCESS_public)
    6056              
    6057              $C$DW$558       .dwtag  DW_TAG_member
    6058                      .dwattr $C$DW$558, DW_AT_type(*$C$DW$T$22)
    6059                      .dwattr $C$DW$558, DW_AT_name("PCLKCR3")
    6060                      .dwattr $C$DW$558, DW_AT_TI_symbol_name("_PCLKCR3")
    6061                      .dwattr $C$DW$558, DW_AT_data_member_location[DW_OP_plus_uconst 0x10]
    6062                      .dwattr $C$DW$558, DW_AT_accessibility(DW_ACCESS_public)
    6063              
    6064                      .dwendtag $C$DW$T$31
    6065              
    6066              $C$DW$T$81      .dwtag  DW_TAG_pointer_type
    6067                      .dwattr $C$DW$T$81, DW_AT_type(*$C$DW$T$31)
    6068                      .dwattr $C$DW$T$81, DW_AT_address_class(0x20)
    6069              
    6070              $C$DW$T$82      .dwtag  DW_TAG_typedef
    6071                      .dwattr $C$DW$T$82, DW_AT_name("CLK_Handle")
    6072                      .dwattr $C$DW$T$82, DW_AT_type(*$C$DW$T$81)
    6073                      .dwattr $C$DW$T$82, DW_AT_language(DW_LANG_C)
    6074              
    6075              
    6076              $C$DW$T$33      .dwtag  DW_TAG_structure_type
    6077                      .dwattr $C$DW$T$33, DW_AT_name("_CPU_Obj_")
    6078                      .dwattr $C$DW$T$33, DW_AT_byte_size(0x01)
    6079              $C$DW$559       .dwtag  DW_TAG_member
    6080                      .dwattr $C$DW$559, DW_AT_type(*$C$DW$T$32)
    6081                      .dwattr $C$DW$559, DW_AT_name("tmp")
    6082                      .dwattr $C$DW$559, DW_AT_TI_symbol_name("_tmp")
    6083                      .dwattr $C$DW$559, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    6084                      .dwattr $C$DW$559, DW_AT_accessibility(DW_ACCESS_public)
    6085              
    6086                      .dwendtag $C$DW$T$33
TMS320C2000 Assembler PC v15.12.3 Wed Nov 22 01:55:15 2017

Tools Copyright (c) 1996-2015 Texas Instruments Incorporated
C:\Users\wmj\AppData\Local\Temp\1239610                              PAGE  115

    6087              
    6088              $C$DW$T$83      .dwtag  DW_TAG_pointer_type
    6089                      .dwattr $C$DW$T$83, DW_AT_type(*$C$DW$T$33)
    6090                      .dwattr $C$DW$T$83, DW_AT_address_class(0x20)
    6091              
    6092              $C$DW$T$84      .dwtag  DW_TAG_typedef
    6093                      .dwattr $C$DW$T$84, DW_AT_name("CPU_Handle")
    6094                      .dwattr $C$DW$T$84, DW_AT_type(*$C$DW$T$83)
    6095                      .dwattr $C$DW$T$84, DW_AT_language(DW_LANG_C)
    6096              
    6097              
    6098              $C$DW$T$36      .dwtag  DW_TAG_structure_type
    6099                      .dwattr $C$DW$T$36, DW_AT_name("_CTRL_Version_")
    6100                      .dwattr $C$DW$T$36, DW_AT_byte_size(0x04)
    6101              $C$DW$560       .dwtag  DW_TAG_member
    6102                      .dwattr $C$DW$560, DW_AT_type(*$C$DW$T$21)
    6103                      .dwattr $C$DW$560, DW_AT_name("rsvd")
    6104                      .dwattr $C$DW$560, DW_AT_TI_symbol_name("_rsvd")
    6105                      .dwattr $C$DW$560, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    6106                      .dwattr $C$DW$560, DW_AT_accessibility(DW_ACCESS_public)
    6107              
    6108              $C$DW$561       .dwtag  DW_TAG_member
    6109                      .dwattr $C$DW$561, DW_AT_type(*$C$DW$T$35)
    6110                      .dwattr $C$DW$561, DW_AT_name("targetProc")
    6111                      .dwattr $C$DW$561, DW_AT_TI_symbol_name("_targetProc")
    6112                      .dwattr $C$DW$561, DW_AT_data_member_location[DW_OP_plus_uconst 0x1]
    6113                      .dwattr $C$DW$561, DW_AT_accessibility(DW_ACCESS_public)
    6114              
    6115              $C$DW$562       .dwtag  DW_TAG_member
    6116                      .dwattr $C$DW$562, DW_AT_type(*$C$DW$T$21)
    6117                      .dwattr $C$DW$562, DW_AT_name("major")
    6118                      .dwattr $C$DW$562, DW_AT_TI_symbol_name("_major")
    6119                      .dwattr $C$DW$562, DW_AT_data_member_location[DW_OP_plus_uconst 0x2]
    6120                      .dwattr $C$DW$562, DW_AT_accessibility(DW_ACCESS_public)
    6121              
    6122              $C$DW$563       .dwtag  DW_TAG_member
    6123                      .dwattr $C$DW$563, DW_AT_type(*$C$DW$T$21)
    6124                      .dwattr $C$DW$563, DW_AT_name("minor")
    6125                      .dwattr $C$DW$563, DW_AT_TI_symbol_name("_minor")
    6126                      .dwattr $C$DW$563, DW_AT_data_member_location[DW_OP_plus_uconst 0x3]
    6127                      .dwattr $C$DW$563, DW_AT_accessibility(DW_ACCESS_public)
    6128              
    6129                      .dwendtag $C$DW$T$36
    6130              
    6131              $C$DW$T$145     .dwtag  DW_TAG_typedef
    6132                      .dwattr $C$DW$T$145, DW_AT_name("CTRL_Version")
    6133                      .dwattr $C$DW$T$145, DW_AT_type(*$C$DW$T$36)
    6134                      .dwattr $C$DW$T$145, DW_AT_language(DW_LANG_C)
    6135              
    6136              
    6137              $C$DW$T$38      .dwtag  DW_TAG_structure_type
    6138                      .dwattr $C$DW$T$38, DW_AT_name("_FILTER_FO_")
    6139                      .dwattr $C$DW$T$38, DW_AT_byte_size(0x0a)
    6140              $C$DW$564       .dwtag  DW_TAG_member
    6141                      .dwattr $C$DW$564, DW_AT_type(*$C$DW$T$37)
TMS320C2000 Assembler PC v15.12.3 Wed Nov 22 01:55:15 2017

Tools Copyright (c) 1996-2015 Texas Instruments Incorporated
C:\Users\wmj\AppData\Local\Temp\1239610                              PAGE  116

    6142                      .dwattr $C$DW$564, DW_AT_name("a1")
    6143                      .dwattr $C$DW$564, DW_AT_TI_symbol_name("_a1")
    6144                      .dwattr $C$DW$564, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    6145                      .dwattr $C$DW$564, DW_AT_accessibility(DW_ACCESS_public)
    6146              
    6147              $C$DW$565       .dwtag  DW_TAG_member
    6148                      .dwattr $C$DW$565, DW_AT_type(*$C$DW$T$37)
    6149                      .dwattr $C$DW$565, DW_AT_name("b0")
    6150                      .dwattr $C$DW$565, DW_AT_TI_symbol_name("_b0")
    6151                      .dwattr $C$DW$565, DW_AT_data_member_location[DW_OP_plus_uconst 0x2]
    6152                      .dwattr $C$DW$565, DW_AT_accessibility(DW_ACCESS_public)
    6153              
    6154              $C$DW$566       .dwtag  DW_TAG_member
    6155                      .dwattr $C$DW$566, DW_AT_type(*$C$DW$T$37)
    6156                      .dwattr $C$DW$566, DW_AT_name("b1")
    6157                      .dwattr $C$DW$566, DW_AT_TI_symbol_name("_b1")
    6158                      .dwattr $C$DW$566, DW_AT_data_member_location[DW_OP_plus_uconst 0x4]
    6159                      .dwattr $C$DW$566, DW_AT_accessibility(DW_ACCESS_public)
    6160              
    6161              $C$DW$567       .dwtag  DW_TAG_member
    6162                      .dwattr $C$DW$567, DW_AT_type(*$C$DW$T$37)
    6163                      .dwattr $C$DW$567, DW_AT_name("x1")
    6164                      .dwattr $C$DW$567, DW_AT_TI_symbol_name("_x1")
    6165                      .dwattr $C$DW$567, DW_AT_data_member_location[DW_OP_plus_uconst 0x6]
    6166                      .dwattr $C$DW$567, DW_AT_accessibility(DW_ACCESS_public)
    6167              
    6168              $C$DW$568       .dwtag  DW_TAG_member
    6169                      .dwattr $C$DW$568, DW_AT_type(*$C$DW$T$37)
    6170                      .dwattr $C$DW$568, DW_AT_name("y1")
    6171                      .dwattr $C$DW$568, DW_AT_TI_symbol_name("_y1")
    6172                      .dwattr $C$DW$568, DW_AT_data_member_location[DW_OP_plus_uconst 0x8]
    6173                      .dwattr $C$DW$568, DW_AT_accessibility(DW_ACCESS_public)
    6174              
    6175                      .dwendtag $C$DW$T$38
    6176              
    6177              $C$DW$T$149     .dwtag  DW_TAG_typedef
    6178                      .dwattr $C$DW$T$149, DW_AT_name("FILTER_FO_Obj")
    6179                      .dwattr $C$DW$T$149, DW_AT_type(*$C$DW$T$38)
    6180                      .dwattr $C$DW$T$149, DW_AT_language(DW_LANG_C)
    6181              
    6182              
    6183              $C$DW$T$19      .dwtag  DW_TAG_structure_type
    6184                      .dwattr $C$DW$T$19, DW_AT_name("_FILTER_FO_Obj_")
    6185                      .dwattr $C$DW$T$19, DW_AT_declaration
    6186                      .dwendtag $C$DW$T$19
    6187              
    6188              $C$DW$T$150     .dwtag  DW_TAG_pointer_type
    6189                      .dwattr $C$DW$T$150, DW_AT_type(*$C$DW$T$19)
    6190                      .dwattr $C$DW$T$150, DW_AT_address_class(0x20)
    6191              
    6192              $C$DW$T$151     .dwtag  DW_TAG_typedef
    6193                      .dwattr $C$DW$T$151, DW_AT_name("FILTER_FO_Handle")
    6194                      .dwattr $C$DW$T$151, DW_AT_type(*$C$DW$T$150)
    6195                      .dwattr $C$DW$T$151, DW_AT_language(DW_LANG_C)
    6196              
TMS320C2000 Assembler PC v15.12.3 Wed Nov 22 01:55:15 2017

Tools Copyright (c) 1996-2015 Texas Instruments Incorporated
C:\Users\wmj\AppData\Local\Temp\1239610                              PAGE  117

    6197              
    6198              $C$DW$T$39      .dwtag  DW_TAG_structure_type
    6199                      .dwattr $C$DW$T$39, DW_AT_name("_FLASH_Obj_")
    6200                      .dwattr $C$DW$T$39, DW_AT_byte_size(0x08)
    6201              $C$DW$569       .dwtag  DW_TAG_member
    6202                      .dwattr $C$DW$569, DW_AT_type(*$C$DW$T$22)
    6203                      .dwattr $C$DW$569, DW_AT_name("FOPT")
    6204                      .dwattr $C$DW$569, DW_AT_TI_symbol_name("_FOPT")
    6205                      .dwattr $C$DW$569, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    6206                      .dwattr $C$DW$569, DW_AT_accessibility(DW_ACCESS_public)
    6207              
    6208              $C$DW$570       .dwtag  DW_TAG_member
    6209                      .dwattr $C$DW$570, DW_AT_type(*$C$DW$T$22)
    6210                      .dwattr $C$DW$570, DW_AT_name("rsvd_1")
    6211                      .dwattr $C$DW$570, DW_AT_TI_symbol_name("_rsvd_1")
    6212                      .dwattr $C$DW$570, DW_AT_data_member_location[DW_OP_plus_uconst 0x1]
    6213                      .dwattr $C$DW$570, DW_AT_accessibility(DW_ACCESS_public)
    6214              
    6215              $C$DW$571       .dwtag  DW_TAG_member
    6216                      .dwattr $C$DW$571, DW_AT_type(*$C$DW$T$22)
    6217                      .dwattr $C$DW$571, DW_AT_name("FPWR")
    6218                      .dwattr $C$DW$571, DW_AT_TI_symbol_name("_FPWR")
    6219                      .dwattr $C$DW$571, DW_AT_data_member_location[DW_OP_plus_uconst 0x2]
    6220                      .dwattr $C$DW$571, DW_AT_accessibility(DW_ACCESS_public)
    6221              
    6222              $C$DW$572       .dwtag  DW_TAG_member
    6223                      .dwattr $C$DW$572, DW_AT_type(*$C$DW$T$22)
    6224                      .dwattr $C$DW$572, DW_AT_name("FSTATUS")
    6225                      .dwattr $C$DW$572, DW_AT_TI_symbol_name("_FSTATUS")
    6226                      .dwattr $C$DW$572, DW_AT_data_member_location[DW_OP_plus_uconst 0x3]
    6227                      .dwattr $C$DW$572, DW_AT_accessibility(DW_ACCESS_public)
    6228              
    6229              $C$DW$573       .dwtag  DW_TAG_member
    6230                      .dwattr $C$DW$573, DW_AT_type(*$C$DW$T$22)
    6231                      .dwattr $C$DW$573, DW_AT_name("FSTDBYWAIT")
    6232                      .dwattr $C$DW$573, DW_AT_TI_symbol_name("_FSTDBYWAIT")
    6233                      .dwattr $C$DW$573, DW_AT_data_member_location[DW_OP_plus_uconst 0x4]
    6234                      .dwattr $C$DW$573, DW_AT_accessibility(DW_ACCESS_public)
    6235              
    6236              $C$DW$574       .dwtag  DW_TAG_member
    6237                      .dwattr $C$DW$574, DW_AT_type(*$C$DW$T$22)
    6238                      .dwattr $C$DW$574, DW_AT_name("FACTIVEWAIT")
    6239                      .dwattr $C$DW$574, DW_AT_TI_symbol_name("_FACTIVEWAIT")
    6240                      .dwattr $C$DW$574, DW_AT_data_member_location[DW_OP_plus_uconst 0x5]
    6241                      .dwattr $C$DW$574, DW_AT_accessibility(DW_ACCESS_public)
    6242              
    6243              $C$DW$575       .dwtag  DW_TAG_member
    6244                      .dwattr $C$DW$575, DW_AT_type(*$C$DW$T$22)
    6245                      .dwattr $C$DW$575, DW_AT_name("FBANKWAIT")
    6246                      .dwattr $C$DW$575, DW_AT_TI_symbol_name("_FBANKWAIT")
    6247                      .dwattr $C$DW$575, DW_AT_data_member_location[DW_OP_plus_uconst 0x6]
    6248                      .dwattr $C$DW$575, DW_AT_accessibility(DW_ACCESS_public)
    6249              
    6250              $C$DW$576       .dwtag  DW_TAG_member
    6251                      .dwattr $C$DW$576, DW_AT_type(*$C$DW$T$22)
TMS320C2000 Assembler PC v15.12.3 Wed Nov 22 01:55:15 2017

Tools Copyright (c) 1996-2015 Texas Instruments Incorporated
C:\Users\wmj\AppData\Local\Temp\1239610                              PAGE  118

    6252                      .dwattr $C$DW$576, DW_AT_name("FOTPWAIT")
    6253                      .dwattr $C$DW$576, DW_AT_TI_symbol_name("_FOTPWAIT")
    6254                      .dwattr $C$DW$576, DW_AT_data_member_location[DW_OP_plus_uconst 0x7]
    6255                      .dwattr $C$DW$576, DW_AT_accessibility(DW_ACCESS_public)
    6256              
    6257                      .dwendtag $C$DW$T$39
    6258              
    6259              $C$DW$T$85      .dwtag  DW_TAG_pointer_type
    6260                      .dwattr $C$DW$T$85, DW_AT_type(*$C$DW$T$39)
    6261                      .dwattr $C$DW$T$85, DW_AT_address_class(0x20)
    6262              
    6263              $C$DW$T$86      .dwtag  DW_TAG_typedef
    6264                      .dwattr $C$DW$T$86, DW_AT_name("FLASH_Handle")
    6265                      .dwattr $C$DW$T$86, DW_AT_type(*$C$DW$T$85)
    6266                      .dwattr $C$DW$T$86, DW_AT_language(DW_LANG_C)
    6267              
    6268              
    6269              $C$DW$T$60      .dwtag  DW_TAG_structure_type
    6270                      .dwattr $C$DW$T$60, DW_AT_name("_FSM_Obj_")
    6271                      .dwattr $C$DW$T$60, DW_AT_byte_size(0x26)
    6272              $C$DW$577       .dwtag  DW_TAG_member
    6273                      .dwattr $C$DW$577, DW_AT_type(*$C$DW$T$41)
    6274                      .dwattr $C$DW$577, DW_AT_name("motorHandle")
    6275                      .dwattr $C$DW$577, DW_AT_TI_symbol_name("_motorHandle")
    6276                      .dwattr $C$DW$577, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    6277                      .dwattr $C$DW$577, DW_AT_accessibility(DW_ACCESS_public)
    6278              
    6279              $C$DW$578       .dwtag  DW_TAG_member
    6280                      .dwattr $C$DW$578, DW_AT_type(*$C$DW$T$43)
    6281                      .dwattr $C$DW$578, DW_AT_name("halHandle")
    6282                      .dwattr $C$DW$578, DW_AT_TI_symbol_name("_halHandle")
    6283                      .dwattr $C$DW$578, DW_AT_data_member_location[DW_OP_plus_uconst 0x2]
    6284                      .dwattr $C$DW$578, DW_AT_accessibility(DW_ACCESS_public)
    6285              
    6286              $C$DW$579       .dwtag  DW_TAG_member
    6287                      .dwattr $C$DW$579, DW_AT_type(*$C$DW$T$45)
    6288                      .dwattr $C$DW$579, DW_AT_name("StBoxHandle")
    6289                      .dwattr $C$DW$579, DW_AT_TI_symbol_name("_StBoxHandle")
    6290                      .dwattr $C$DW$579, DW_AT_data_member_location[DW_OP_plus_uconst 0x4]
    6291                      .dwattr $C$DW$579, DW_AT_accessibility(DW_ACCESS_public)
    6292              
    6293              $C$DW$580       .dwtag  DW_TAG_member
    6294                      .dwattr $C$DW$580, DW_AT_type(*$C$DW$T$47)
    6295                      .dwattr $C$DW$580, DW_AT_name("FSM_State")
    6296                      .dwattr $C$DW$580, DW_AT_TI_symbol_name("_FSM_State")
    6297                      .dwattr $C$DW$580, DW_AT_data_member_location[DW_OP_plus_uconst 0x6]
    6298                      .dwattr $C$DW$580, DW_AT_accessibility(DW_ACCESS_public)
    6299              
    6300              $C$DW$581       .dwtag  DW_TAG_member
    6301                      .dwattr $C$DW$581, DW_AT_type(*$C$DW$T$47)
    6302                      .dwattr $C$DW$581, DW_AT_name("FSM_CurState")
    6303                      .dwattr $C$DW$581, DW_AT_TI_symbol_name("_FSM_CurState")
    6304                      .dwattr $C$DW$581, DW_AT_data_member_location[DW_OP_plus_uconst 0x7]
    6305                      .dwattr $C$DW$581, DW_AT_accessibility(DW_ACCESS_public)
    6306              
TMS320C2000 Assembler PC v15.12.3 Wed Nov 22 01:55:15 2017

Tools Copyright (c) 1996-2015 Texas Instruments Incorporated
C:\Users\wmj\AppData\Local\Temp\1239610                              PAGE  119

    6307              $C$DW$582       .dwtag  DW_TAG_member
    6308                      .dwattr $C$DW$582, DW_AT_type(*$C$DW$T$49)
    6309                      .dwattr $C$DW$582, DW_AT_name("FSM_Trans")
    6310                      .dwattr $C$DW$582, DW_AT_TI_symbol_name("_FSM_Trans")
    6311                      .dwattr $C$DW$582, DW_AT_data_member_location[DW_OP_plus_uconst 0x8]
    6312                      .dwattr $C$DW$582, DW_AT_accessibility(DW_ACCESS_public)
    6313              
    6314              $C$DW$583       .dwtag  DW_TAG_member
    6315                      .dwattr $C$DW$583, DW_AT_type(*$C$DW$T$51)
    6316                      .dwattr $C$DW$583, DW_AT_name("FSM_Event")
    6317                      .dwattr $C$DW$583, DW_AT_TI_symbol_name("_FSM_Event")
    6318                      .dwattr $C$DW$583, DW_AT_data_member_location[DW_OP_plus_uconst 0x9]
    6319                      .dwattr $C$DW$583, DW_AT_accessibility(DW_ACCESS_public)
    6320              
    6321              $C$DW$584       .dwtag  DW_TAG_member
    6322                      .dwattr $C$DW$584, DW_AT_type(*$C$DW$T$53)
    6323                      .dwattr $C$DW$584, DW_AT_name("FSM_StMode")
    6324                      .dwattr $C$DW$584, DW_AT_TI_symbol_name("_FSM_StMode")
    6325                      .dwattr $C$DW$584, DW_AT_data_member_location[DW_OP_plus_uconst 0xa]
    6326                      .dwattr $C$DW$584, DW_AT_accessibility(DW_ACCESS_public)
    6327              
    6328              $C$DW$585       .dwtag  DW_TAG_member
    6329                      .dwattr $C$DW$585, DW_AT_type(*$C$DW$T$21)
    6330                      .dwattr $C$DW$585, DW_AT_name("FSM_ErrFlg")
    6331                      .dwattr $C$DW$585, DW_AT_TI_symbol_name("_FSM_ErrFlg")
    6332                      .dwattr $C$DW$585, DW_AT_data_member_location[DW_OP_plus_uconst 0xb]
    6333                      .dwattr $C$DW$585, DW_AT_accessibility(DW_ACCESS_public)
    6334              
    6335              $C$DW$586       .dwtag  DW_TAG_member
    6336                      .dwattr $C$DW$586, DW_AT_type(*$C$DW$T$21)
    6337                      .dwattr $C$DW$586, DW_AT_name("FSM_ErrMask")
    6338                      .dwattr $C$DW$586, DW_AT_TI_symbol_name("_FSM_ErrMask")
    6339                      .dwattr $C$DW$586, DW_AT_data_member_location[DW_OP_plus_uconst 0xc]
    6340                      .dwattr $C$DW$586, DW_AT_accessibility(DW_ACCESS_public)
    6341              
    6342              $C$DW$587       .dwtag  DW_TAG_member
    6343                      .dwattr $C$DW$587, DW_AT_type(*$C$DW$T$21)
    6344                      .dwattr $C$DW$587, DW_AT_name("FSM_runTime")
    6345                      .dwattr $C$DW$587, DW_AT_TI_symbol_name("_FSM_runTime")
    6346                      .dwattr $C$DW$587, DW_AT_data_member_location[DW_OP_plus_uconst 0xd]
    6347                      .dwattr $C$DW$587, DW_AT_accessibility(DW_ACCESS_public)
    6348              
    6349              $C$DW$588       .dwtag  DW_TAG_member
    6350                      .dwattr $C$DW$588, DW_AT_type(*$C$DW$T$21)
    6351                      .dwattr $C$DW$588, DW_AT_name("FSM_485Cmd")
    6352                      .dwattr $C$DW$588, DW_AT_TI_symbol_name("_FSM_485Cmd")
    6353                      .dwattr $C$DW$588, DW_AT_data_member_location[DW_OP_plus_uconst 0xe]
    6354                      .dwattr $C$DW$588, DW_AT_accessibility(DW_ACCESS_public)
    6355              
    6356              $C$DW$589       .dwtag  DW_TAG_member
    6357                      .dwattr $C$DW$589, DW_AT_type(*$C$DW$T$47)
    6358                      .dwattr $C$DW$589, DW_AT_name("FSM_485EditState")
    6359                      .dwattr $C$DW$589, DW_AT_TI_symbol_name("_FSM_485EditState")
    6360                      .dwattr $C$DW$589, DW_AT_data_member_location[DW_OP_plus_uconst 0xf]
    6361                      .dwattr $C$DW$589, DW_AT_accessibility(DW_ACCESS_public)
TMS320C2000 Assembler PC v15.12.3 Wed Nov 22 01:55:15 2017

Tools Copyright (c) 1996-2015 Texas Instruments Incorporated
C:\Users\wmj\AppData\Local\Temp\1239610                              PAGE  120

    6362              
    6363              $C$DW$590       .dwtag  DW_TAG_member
    6364                      .dwattr $C$DW$590, DW_AT_type(*$C$DW$T$55)
    6365                      .dwattr $C$DW$590, DW_AT_name("FSM_485EditOpt")
    6366                      .dwattr $C$DW$590, DW_AT_TI_symbol_name("_FSM_485EditOpt")
    6367                      .dwattr $C$DW$590, DW_AT_data_member_location[DW_OP_plus_uconst 0x10]
    6368                      .dwattr $C$DW$590, DW_AT_accessibility(DW_ACCESS_public)
    6369              
    6370              $C$DW$591       .dwtag  DW_TAG_member
    6371                      .dwattr $C$DW$591, DW_AT_type(*$C$DW$T$21)
    6372                      .dwattr $C$DW$591, DW_AT_name("FSM_485RefSpeed")
    6373                      .dwattr $C$DW$591, DW_AT_TI_symbol_name("_FSM_485RefSpeed")
    6374                      .dwattr $C$DW$591, DW_AT_data_member_location[DW_OP_plus_uconst 0x11]
    6375                      .dwattr $C$DW$591, DW_AT_accessibility(DW_ACCESS_public)
    6376              
    6377              $C$DW$592       .dwtag  DW_TAG_member
    6378                      .dwattr $C$DW$592, DW_AT_type(*$C$DW$T$37)
    6379                      .dwattr $C$DW$592, DW_AT_name("MaxTorque_Nm")
    6380                      .dwattr $C$DW$592, DW_AT_TI_symbol_name("_MaxTorque_Nm")
    6381                      .dwattr $C$DW$592, DW_AT_data_member_location[DW_OP_plus_uconst 0x12]
    6382                      .dwattr $C$DW$592, DW_AT_accessibility(DW_ACCESS_public)
    6383              
    6384              $C$DW$593       .dwtag  DW_TAG_member
    6385                      .dwattr $C$DW$593, DW_AT_type(*$C$DW$T$57)
    6386                      .dwattr $C$DW$593, DW_AT_name("FSM_CheckCond")
    6387                      .dwattr $C$DW$593, DW_AT_TI_symbol_name("_FSM_CheckCond")
    6388                      .dwattr $C$DW$593, DW_AT_data_member_location[DW_OP_plus_uconst 0x14]
    6389                      .dwattr $C$DW$593, DW_AT_accessibility(DW_ACCESS_public)
    6390              
    6391              $C$DW$594       .dwtag  DW_TAG_member
    6392                      .dwattr $C$DW$594, DW_AT_type(*$C$DW$T$21)
    6393                      .dwattr $C$DW$594, DW_AT_name("FSM_CondValue")
    6394                      .dwattr $C$DW$594, DW_AT_TI_symbol_name("_FSM_CondValue")
    6395                      .dwattr $C$DW$594, DW_AT_data_member_location[DW_OP_plus_uconst 0x15]
    6396                      .dwattr $C$DW$594, DW_AT_accessibility(DW_ACCESS_public)
    6397              
    6398              $C$DW$595       .dwtag  DW_TAG_member
    6399                      .dwattr $C$DW$595, DW_AT_type(*$C$DW$T$58)
    6400                      .dwattr $C$DW$595, DW_AT_name("OldAbsPos")
    6401                      .dwattr $C$DW$595, DW_AT_TI_symbol_name("_OldAbsPos")
    6402                      .dwattr $C$DW$595, DW_AT_data_member_location[DW_OP_plus_uconst 0x16]
    6403                      .dwattr $C$DW$595, DW_AT_accessibility(DW_ACCESS_public)
    6404              
    6405              $C$DW$596       .dwtag  DW_TAG_member
    6406                      .dwattr $C$DW$596, DW_AT_type(*$C$DW$T$58)
    6407                      .dwattr $C$DW$596, DW_AT_name("NewAbsPos")
    6408                      .dwattr $C$DW$596, DW_AT_TI_symbol_name("_NewAbsPos")
    6409                      .dwattr $C$DW$596, DW_AT_data_member_location[DW_OP_plus_uconst 0x1a]
    6410                      .dwattr $C$DW$596, DW_AT_accessibility(DW_ACCESS_public)
    6411              
    6412              $C$DW$597       .dwtag  DW_TAG_member
    6413                      .dwattr $C$DW$597, DW_AT_type(*$C$DW$T$59)
    6414                      .dwattr $C$DW$597, DW_AT_name("Flag_485StartMotor")
    6415                      .dwattr $C$DW$597, DW_AT_TI_symbol_name("_Flag_485StartMotor")
    6416                      .dwattr $C$DW$597, DW_AT_data_member_location[DW_OP_plus_uconst 0x1e]
TMS320C2000 Assembler PC v15.12.3 Wed Nov 22 01:55:15 2017

Tools Copyright (c) 1996-2015 Texas Instruments Incorporated
C:\Users\wmj\AppData\Local\Temp\1239610                              PAGE  121

    6417                      .dwattr $C$DW$597, DW_AT_accessibility(DW_ACCESS_public)
    6418              
    6419              $C$DW$598       .dwtag  DW_TAG_member
    6420                      .dwattr $C$DW$598, DW_AT_type(*$C$DW$T$59)
    6421                      .dwattr $C$DW$598, DW_AT_name("Flag_MaxTimeLimit")
    6422                      .dwattr $C$DW$598, DW_AT_TI_symbol_name("_Flag_MaxTimeLimit")
    6423                      .dwattr $C$DW$598, DW_AT_data_member_location[DW_OP_plus_uconst 0x1f]
    6424                      .dwattr $C$DW$598, DW_AT_accessibility(DW_ACCESS_public)
    6425              
    6426              $C$DW$599       .dwtag  DW_TAG_member
    6427                      .dwattr $C$DW$599, DW_AT_type(*$C$DW$T$59)
    6428                      .dwattr $C$DW$599, DW_AT_name("runTime_Enable")
    6429                      .dwattr $C$DW$599, DW_AT_TI_symbol_name("_runTime_Enable")
    6430                      .dwattr $C$DW$599, DW_AT_data_member_location[DW_OP_plus_uconst 0x20]
    6431                      .dwattr $C$DW$599, DW_AT_accessibility(DW_ACCESS_public)
    6432              
    6433              $C$DW$600       .dwtag  DW_TAG_member
    6434                      .dwattr $C$DW$600, DW_AT_type(*$C$DW$T$59)
    6435                      .dwattr $C$DW$600, DW_AT_name("Flag_StallEnable")
    6436                      .dwattr $C$DW$600, DW_AT_TI_symbol_name("_Flag_StallEnable")
    6437                      .dwattr $C$DW$600, DW_AT_data_member_location[DW_OP_plus_uconst 0x21]
    6438                      .dwattr $C$DW$600, DW_AT_accessibility(DW_ACCESS_public)
    6439              
    6440              $C$DW$601       .dwtag  DW_TAG_member
    6441                      .dwattr $C$DW$601, DW_AT_type(*$C$DW$T$59)
    6442                      .dwattr $C$DW$601, DW_AT_name("Flag_ReportState")
    6443                      .dwattr $C$DW$601, DW_AT_TI_symbol_name("_Flag_ReportState")
    6444                      .dwattr $C$DW$601, DW_AT_data_member_location[DW_OP_plus_uconst 0x22]
    6445                      .dwattr $C$DW$601, DW_AT_accessibility(DW_ACCESS_public)
    6446              
    6447              $C$DW$602       .dwtag  DW_TAG_member
    6448                      .dwattr $C$DW$602, DW_AT_type(*$C$DW$T$59)
    6449                      .dwattr $C$DW$602, DW_AT_name("Flag_RunMode")
    6450                      .dwattr $C$DW$602, DW_AT_TI_symbol_name("_Flag_RunMode")
    6451                      .dwattr $C$DW$602, DW_AT_data_member_location[DW_OP_plus_uconst 0x23]
    6452                      .dwattr $C$DW$602, DW_AT_accessibility(DW_ACCESS_public)
    6453              
    6454              $C$DW$603       .dwtag  DW_TAG_member
    6455                      .dwattr $C$DW$603, DW_AT_type(*$C$DW$T$59)
    6456                      .dwattr $C$DW$603, DW_AT_name("Flag_DcBrake")
    6457                      .dwattr $C$DW$603, DW_AT_TI_symbol_name("_Flag_DcBrake")
    6458                      .dwattr $C$DW$603, DW_AT_data_member_location[DW_OP_plus_uconst 0x24]
    6459                      .dwattr $C$DW$603, DW_AT_accessibility(DW_ACCESS_public)
    6460              
    6461                      .dwendtag $C$DW$T$60
    6462              
    6463              $C$DW$T$193     .dwtag  DW_TAG_typedef
    6464                      .dwattr $C$DW$T$193, DW_AT_name("FSM_Obj")
    6465                      .dwattr $C$DW$T$193, DW_AT_type(*$C$DW$T$60)
    6466                      .dwattr $C$DW$T$193, DW_AT_language(DW_LANG_C)
    6467              
    6468              $C$DW$T$194     .dwtag  DW_TAG_pointer_type
    6469                      .dwattr $C$DW$T$194, DW_AT_type(*$C$DW$T$193)
    6470                      .dwattr $C$DW$T$194, DW_AT_address_class(0x20)
    6471              
TMS320C2000 Assembler PC v15.12.3 Wed Nov 22 01:55:15 2017

Tools Copyright (c) 1996-2015 Texas Instruments Incorporated
C:\Users\wmj\AppData\Local\Temp\1239610                              PAGE  122

    6472              $C$DW$T$120     .dwtag  DW_TAG_pointer_type
    6473                      .dwattr $C$DW$T$120, DW_AT_type(*$C$DW$T$60)
    6474                      .dwattr $C$DW$T$120, DW_AT_address_class(0x20)
    6475              
    6476              $C$DW$T$121     .dwtag  DW_TAG_typedef
    6477                      .dwattr $C$DW$T$121, DW_AT_name("FSM_Handle")
    6478                      .dwattr $C$DW$T$121, DW_AT_type(*$C$DW$T$120)
    6479                      .dwattr $C$DW$T$121, DW_AT_language(DW_LANG_C)
    6480              
    6481              $C$DW$604       .dwtag  DW_TAG_TI_far_type
    6482                      .dwattr $C$DW$604, DW_AT_type(*$C$DW$T$121)
    6483              
    6484              $C$DW$T$195     .dwtag  DW_TAG_const_type
    6485                      .dwattr $C$DW$T$195, DW_AT_type(*$C$DW$604)
    6486              
    6487              
    6488              $C$DW$T$62      .dwtag  DW_TAG_structure_type
    6489                      .dwattr $C$DW$T$62, DW_AT_name("_FSM_Position_t_")
    6490                      .dwattr $C$DW$T$62, DW_AT_byte_size(0x04)
    6491              $C$DW$605       .dwtag  DW_TAG_member
    6492                      .dwattr $C$DW$605, DW_AT_type(*$C$DW$T$61)
    6493                      .dwattr $C$DW$605, DW_AT_name("PosInt_MRev")
    6494                      .dwattr $C$DW$605, DW_AT_TI_symbol_name("_PosInt_MRev")
    6495                      .dwattr $C$DW$605, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    6496                      .dwattr $C$DW$605, DW_AT_accessibility(DW_ACCESS_public)
    6497              
    6498              $C$DW$606       .dwtag  DW_TAG_member
    6499                      .dwattr $C$DW$606, DW_AT_type(*$C$DW$T$37)
    6500                      .dwattr $C$DW$606, DW_AT_name("PosFrac_MRev")
    6501                      .dwattr $C$DW$606, DW_AT_TI_symbol_name("_PosFrac_MRev")
    6502                      .dwattr $C$DW$606, DW_AT_data_member_location[DW_OP_plus_uconst 0x2]
    6503                      .dwattr $C$DW$606, DW_AT_accessibility(DW_ACCESS_public)
    6504              
    6505                      .dwendtag $C$DW$T$62
    6506              
    6507              $C$DW$T$58      .dwtag  DW_TAG_typedef
    6508                      .dwattr $C$DW$T$58, DW_AT_name("FSM_Position_t")
    6509                      .dwattr $C$DW$T$58, DW_AT_type(*$C$DW$T$62)
    6510                      .dwattr $C$DW$T$58, DW_AT_language(DW_LANG_C)
    6511              
    6512              
    6513              $C$DW$T$71      .dwtag  DW_TAG_structure_type
    6514                      .dwattr $C$DW$T$71, DW_AT_name("_FSM_StatePool_t_")
    6515                      .dwattr $C$DW$T$71, DW_AT_byte_size(0x4b)
    6516              $C$DW$607       .dwtag  DW_TAG_member
    6517                      .dwattr $C$DW$607, DW_AT_type(*$C$DW$T$64)
    6518                      .dwattr $C$DW$607, DW_AT_name("FSM_RefSpeed")
    6519                      .dwattr $C$DW$607, DW_AT_TI_symbol_name("_FSM_RefSpeed")
    6520                      .dwattr $C$DW$607, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    6521                      .dwattr $C$DW$607, DW_AT_accessibility(DW_ACCESS_public)
    6522              
    6523              $C$DW$608       .dwtag  DW_TAG_member
    6524                      .dwattr $C$DW$608, DW_AT_type(*$C$DW$T$65)
    6525                      .dwattr $C$DW$608, DW_AT_name("FSM_CondValue")
    6526                      .dwattr $C$DW$608, DW_AT_TI_symbol_name("_FSM_CondValue")
TMS320C2000 Assembler PC v15.12.3 Wed Nov 22 01:55:15 2017

Tools Copyright (c) 1996-2015 Texas Instruments Incorporated
C:\Users\wmj\AppData\Local\Temp\1239610                              PAGE  123

    6527                      .dwattr $C$DW$608, DW_AT_data_member_location[DW_OP_plus_uconst 0xf]
    6528                      .dwattr $C$DW$608, DW_AT_accessibility(DW_ACCESS_public)
    6529              
    6530              $C$DW$609       .dwtag  DW_TAG_member
    6531                      .dwattr $C$DW$609, DW_AT_type(*$C$DW$T$66)
    6532                      .dwattr $C$DW$609, DW_AT_name("FSM_Condition")
    6533                      .dwattr $C$DW$609, DW_AT_TI_symbol_name("_FSM_Condition")
    6534                      .dwattr $C$DW$609, DW_AT_data_member_location[DW_OP_plus_uconst 0x1e]
    6535                      .dwattr $C$DW$609, DW_AT_accessibility(DW_ACCESS_public)
    6536              
    6537              $C$DW$610       .dwtag  DW_TAG_member
    6538                      .dwattr $C$DW$610, DW_AT_type(*$C$DW$T$69)
    6539                      .dwattr $C$DW$610, DW_AT_name("FSM_RunAction")
    6540                      .dwattr $C$DW$610, DW_AT_TI_symbol_name("_FSM_RunAction")
    6541                      .dwattr $C$DW$610, DW_AT_data_member_location[DW_OP_plus_uconst 0x2d]
    6542                      .dwattr $C$DW$610, DW_AT_accessibility(DW_ACCESS_public)
    6543              
    6544              $C$DW$611       .dwtag  DW_TAG_member
    6545                      .dwattr $C$DW$611, DW_AT_type(*$C$DW$T$70)
    6546                      .dwattr $C$DW$611, DW_AT_name("FSM_NextState")
    6547                      .dwattr $C$DW$611, DW_AT_TI_symbol_name("_FSM_NextState")
    6548                      .dwattr $C$DW$611, DW_AT_data_member_location[DW_OP_plus_uconst 0x3c]
    6549                      .dwattr $C$DW$611, DW_AT_accessibility(DW_ACCESS_public)
    6550              
    6551                      .dwendtag $C$DW$T$71
    6552              
    6553              $C$DW$T$44      .dwtag  DW_TAG_pointer_type
    6554                      .dwattr $C$DW$T$44, DW_AT_type(*$C$DW$T$71)
    6555                      .dwattr $C$DW$T$44, DW_AT_address_class(0x20)
    6556              
    6557              $C$DW$T$45      .dwtag  DW_TAG_typedef
    6558                      .dwattr $C$DW$T$45, DW_AT_name("StPool_Handle")
    6559                      .dwattr $C$DW$T$45, DW_AT_type(*$C$DW$T$44)
    6560                      .dwattr $C$DW$T$45, DW_AT_language(DW_LANG_C)
    6561              
    6562              
    6563              $C$DW$T$76      .dwtag  DW_TAG_structure_type
    6564                      .dwattr $C$DW$T$76, DW_AT_name("_GPIO_Obj_")
    6565                      .dwattr $C$DW$T$76, DW_AT_byte_size(0x6a)
    6566              $C$DW$612       .dwtag  DW_TAG_member
    6567                      .dwattr $C$DW$612, DW_AT_type(*$C$DW$T$73)
    6568                      .dwattr $C$DW$612, DW_AT_name("GPACTRL")
    6569                      .dwattr $C$DW$612, DW_AT_TI_symbol_name("_GPACTRL")
    6570                      .dwattr $C$DW$612, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    6571                      .dwattr $C$DW$612, DW_AT_accessibility(DW_ACCESS_public)
    6572              
    6573              $C$DW$613       .dwtag  DW_TAG_member
    6574                      .dwattr $C$DW$613, DW_AT_type(*$C$DW$T$73)
    6575                      .dwattr $C$DW$613, DW_AT_name("GPAQSEL1")
    6576                      .dwattr $C$DW$613, DW_AT_TI_symbol_name("_GPAQSEL1")
    6577                      .dwattr $C$DW$613, DW_AT_data_member_location[DW_OP_plus_uconst 0x2]
    6578                      .dwattr $C$DW$613, DW_AT_accessibility(DW_ACCESS_public)
    6579              
    6580              $C$DW$614       .dwtag  DW_TAG_member
    6581                      .dwattr $C$DW$614, DW_AT_type(*$C$DW$T$73)
TMS320C2000 Assembler PC v15.12.3 Wed Nov 22 01:55:15 2017

Tools Copyright (c) 1996-2015 Texas Instruments Incorporated
C:\Users\wmj\AppData\Local\Temp\1239610                              PAGE  124

    6582                      .dwattr $C$DW$614, DW_AT_name("GPAQSEL2")
    6583                      .dwattr $C$DW$614, DW_AT_TI_symbol_name("_GPAQSEL2")
    6584                      .dwattr $C$DW$614, DW_AT_data_member_location[DW_OP_plus_uconst 0x4]
    6585                      .dwattr $C$DW$614, DW_AT_accessibility(DW_ACCESS_public)
    6586              
    6587              $C$DW$615       .dwtag  DW_TAG_member
    6588                      .dwattr $C$DW$615, DW_AT_type(*$C$DW$T$73)
    6589                      .dwattr $C$DW$615, DW_AT_name("GPAMUX1")
    6590                      .dwattr $C$DW$615, DW_AT_TI_symbol_name("_GPAMUX1")
    6591                      .dwattr $C$DW$615, DW_AT_data_member_location[DW_OP_plus_uconst 0x6]
    6592                      .dwattr $C$DW$615, DW_AT_accessibility(DW_ACCESS_public)
    6593              
    6594              $C$DW$616       .dwtag  DW_TAG_member
    6595                      .dwattr $C$DW$616, DW_AT_type(*$C$DW$T$73)
    6596                      .dwattr $C$DW$616, DW_AT_name("GPAMUX2")
    6597                      .dwattr $C$DW$616, DW_AT_TI_symbol_name("_GPAMUX2")
    6598                      .dwattr $C$DW$616, DW_AT_data_member_location[DW_OP_plus_uconst 0x8]
    6599                      .dwattr $C$DW$616, DW_AT_accessibility(DW_ACCESS_public)
    6600              
    6601              $C$DW$617       .dwtag  DW_TAG_member
    6602                      .dwattr $C$DW$617, DW_AT_type(*$C$DW$T$73)
    6603                      .dwattr $C$DW$617, DW_AT_name("GPADIR")
    6604                      .dwattr $C$DW$617, DW_AT_TI_symbol_name("_GPADIR")
    6605                      .dwattr $C$DW$617, DW_AT_data_member_location[DW_OP_plus_uconst 0xa]
    6606                      .dwattr $C$DW$617, DW_AT_accessibility(DW_ACCESS_public)
    6607              
    6608              $C$DW$618       .dwtag  DW_TAG_member
    6609                      .dwattr $C$DW$618, DW_AT_type(*$C$DW$T$73)
    6610                      .dwattr $C$DW$618, DW_AT_name("GPAPUD")
    6611                      .dwattr $C$DW$618, DW_AT_TI_symbol_name("_GPAPUD")
    6612                      .dwattr $C$DW$618, DW_AT_data_member_location[DW_OP_plus_uconst 0xc]
    6613                      .dwattr $C$DW$618, DW_AT_accessibility(DW_ACCESS_public)
    6614              
    6615              $C$DW$619       .dwtag  DW_TAG_member
    6616                      .dwattr $C$DW$619, DW_AT_type(*$C$DW$T$25)
    6617                      .dwattr $C$DW$619, DW_AT_name("rsvd_1")
    6618                      .dwattr $C$DW$619, DW_AT_TI_symbol_name("_rsvd_1")
    6619                      .dwattr $C$DW$619, DW_AT_data_member_location[DW_OP_plus_uconst 0xe]
    6620                      .dwattr $C$DW$619, DW_AT_accessibility(DW_ACCESS_public)
    6621              
    6622              $C$DW$620       .dwtag  DW_TAG_member
    6623                      .dwattr $C$DW$620, DW_AT_type(*$C$DW$T$73)
    6624                      .dwattr $C$DW$620, DW_AT_name("GPBCTRL")
    6625                      .dwattr $C$DW$620, DW_AT_TI_symbol_name("_GPBCTRL")
    6626                      .dwattr $C$DW$620, DW_AT_data_member_location[DW_OP_plus_uconst 0x10]
    6627                      .dwattr $C$DW$620, DW_AT_accessibility(DW_ACCESS_public)
    6628              
    6629              $C$DW$621       .dwtag  DW_TAG_member
    6630                      .dwattr $C$DW$621, DW_AT_type(*$C$DW$T$73)
    6631                      .dwattr $C$DW$621, DW_AT_name("GPBQSEL1")
    6632                      .dwattr $C$DW$621, DW_AT_TI_symbol_name("_GPBQSEL1")
    6633                      .dwattr $C$DW$621, DW_AT_data_member_location[DW_OP_plus_uconst 0x12]
    6634                      .dwattr $C$DW$621, DW_AT_accessibility(DW_ACCESS_public)
    6635              
    6636              $C$DW$622       .dwtag  DW_TAG_member
TMS320C2000 Assembler PC v15.12.3 Wed Nov 22 01:55:15 2017

Tools Copyright (c) 1996-2015 Texas Instruments Incorporated
C:\Users\wmj\AppData\Local\Temp\1239610                              PAGE  125

    6637                      .dwattr $C$DW$622, DW_AT_type(*$C$DW$T$25)
    6638                      .dwattr $C$DW$622, DW_AT_name("rsvd_2")
    6639                      .dwattr $C$DW$622, DW_AT_TI_symbol_name("_rsvd_2")
    6640                      .dwattr $C$DW$622, DW_AT_data_member_location[DW_OP_plus_uconst 0x14]
    6641                      .dwattr $C$DW$622, DW_AT_accessibility(DW_ACCESS_public)
    6642              
    6643              $C$DW$623       .dwtag  DW_TAG_member
    6644                      .dwattr $C$DW$623, DW_AT_type(*$C$DW$T$73)
    6645                      .dwattr $C$DW$623, DW_AT_name("GPBMUX1")
    6646                      .dwattr $C$DW$623, DW_AT_TI_symbol_name("_GPBMUX1")
    6647                      .dwattr $C$DW$623, DW_AT_data_member_location[DW_OP_plus_uconst 0x16]
    6648                      .dwattr $C$DW$623, DW_AT_accessibility(DW_ACCESS_public)
    6649              
    6650              $C$DW$624       .dwtag  DW_TAG_member
    6651                      .dwattr $C$DW$624, DW_AT_type(*$C$DW$T$25)
    6652                      .dwattr $C$DW$624, DW_AT_name("rsvd_3")
    6653                      .dwattr $C$DW$624, DW_AT_TI_symbol_name("_rsvd_3")
    6654                      .dwattr $C$DW$624, DW_AT_data_member_location[DW_OP_plus_uconst 0x18]
    6655                      .dwattr $C$DW$624, DW_AT_accessibility(DW_ACCESS_public)
    6656              
    6657              $C$DW$625       .dwtag  DW_TAG_member
    6658                      .dwattr $C$DW$625, DW_AT_type(*$C$DW$T$73)
    6659                      .dwattr $C$DW$625, DW_AT_name("GPBDIR")
    6660                      .dwattr $C$DW$625, DW_AT_TI_symbol_name("_GPBDIR")
    6661                      .dwattr $C$DW$625, DW_AT_data_member_location[DW_OP_plus_uconst 0x1a]
    6662                      .dwattr $C$DW$625, DW_AT_accessibility(DW_ACCESS_public)
    6663              
    6664              $C$DW$626       .dwtag  DW_TAG_member
    6665                      .dwattr $C$DW$626, DW_AT_type(*$C$DW$T$73)
    6666                      .dwattr $C$DW$626, DW_AT_name("GPBPUD")
    6667                      .dwattr $C$DW$626, DW_AT_TI_symbol_name("_GPBPUD")
    6668                      .dwattr $C$DW$626, DW_AT_data_member_location[DW_OP_plus_uconst 0x1c]
    6669                      .dwattr $C$DW$626, DW_AT_accessibility(DW_ACCESS_public)
    6670              
    6671              $C$DW$627       .dwtag  DW_TAG_member
    6672                      .dwattr $C$DW$627, DW_AT_type(*$C$DW$T$74)
    6673                      .dwattr $C$DW$627, DW_AT_name("rsvd_4")
    6674                      .dwattr $C$DW$627, DW_AT_TI_symbol_name("_rsvd_4")
    6675                      .dwattr $C$DW$627, DW_AT_data_member_location[DW_OP_plus_uconst 0x1e]
    6676                      .dwattr $C$DW$627, DW_AT_accessibility(DW_ACCESS_public)
    6677              
    6678              $C$DW$628       .dwtag  DW_TAG_member
    6679                      .dwattr $C$DW$628, DW_AT_type(*$C$DW$T$73)
    6680                      .dwattr $C$DW$628, DW_AT_name("AIOMUX1")
    6681                      .dwattr $C$DW$628, DW_AT_TI_symbol_name("_AIOMUX1")
    6682                      .dwattr $C$DW$628, DW_AT_data_member_location[DW_OP_plus_uconst 0x36]
    6683                      .dwattr $C$DW$628, DW_AT_accessibility(DW_ACCESS_public)
    6684              
    6685              $C$DW$629       .dwtag  DW_TAG_member
    6686                      .dwattr $C$DW$629, DW_AT_type(*$C$DW$T$25)
    6687                      .dwattr $C$DW$629, DW_AT_name("rsvd_5")
    6688                      .dwattr $C$DW$629, DW_AT_TI_symbol_name("_rsvd_5")
    6689                      .dwattr $C$DW$629, DW_AT_data_member_location[DW_OP_plus_uconst 0x38]
    6690                      .dwattr $C$DW$629, DW_AT_accessibility(DW_ACCESS_public)
    6691              
TMS320C2000 Assembler PC v15.12.3 Wed Nov 22 01:55:15 2017

Tools Copyright (c) 1996-2015 Texas Instruments Incorporated
C:\Users\wmj\AppData\Local\Temp\1239610                              PAGE  126

    6692              $C$DW$630       .dwtag  DW_TAG_member
    6693                      .dwattr $C$DW$630, DW_AT_type(*$C$DW$T$73)
    6694                      .dwattr $C$DW$630, DW_AT_name("AIODIR")
    6695                      .dwattr $C$DW$630, DW_AT_TI_symbol_name("_AIODIR")
    6696                      .dwattr $C$DW$630, DW_AT_data_member_location[DW_OP_plus_uconst 0x3a]
    6697                      .dwattr $C$DW$630, DW_AT_accessibility(DW_ACCESS_public)
    6698              
    6699              $C$DW$631       .dwtag  DW_TAG_member
    6700                      .dwattr $C$DW$631, DW_AT_type(*$C$DW$T$75)
    6701                      .dwattr $C$DW$631, DW_AT_name("rsvd_6")
    6702                      .dwattr $C$DW$631, DW_AT_TI_symbol_name("_rsvd_6")
    6703                      .dwattr $C$DW$631, DW_AT_data_member_location[DW_OP_plus_uconst 0x3c]
    6704                      .dwattr $C$DW$631, DW_AT_accessibility(DW_ACCESS_public)
    6705              
    6706              $C$DW$632       .dwtag  DW_TAG_member
    6707                      .dwattr $C$DW$632, DW_AT_type(*$C$DW$T$73)
    6708                      .dwattr $C$DW$632, DW_AT_name("GPADAT")
    6709                      .dwattr $C$DW$632, DW_AT_TI_symbol_name("_GPADAT")
    6710                      .dwattr $C$DW$632, DW_AT_data_member_location[DW_OP_plus_uconst 0x40]
    6711                      .dwattr $C$DW$632, DW_AT_accessibility(DW_ACCESS_public)
    6712              
    6713              $C$DW$633       .dwtag  DW_TAG_member
    6714                      .dwattr $C$DW$633, DW_AT_type(*$C$DW$T$73)
    6715                      .dwattr $C$DW$633, DW_AT_name("GPASET")
    6716                      .dwattr $C$DW$633, DW_AT_TI_symbol_name("_GPASET")
    6717                      .dwattr $C$DW$633, DW_AT_data_member_location[DW_OP_plus_uconst 0x42]
    6718                      .dwattr $C$DW$633, DW_AT_accessibility(DW_ACCESS_public)
    6719              
    6720              $C$DW$634       .dwtag  DW_TAG_member
    6721                      .dwattr $C$DW$634, DW_AT_type(*$C$DW$T$73)
    6722                      .dwattr $C$DW$634, DW_AT_name("GPACLEAR")
    6723                      .dwattr $C$DW$634, DW_AT_TI_symbol_name("_GPACLEAR")
    6724                      .dwattr $C$DW$634, DW_AT_data_member_location[DW_OP_plus_uconst 0x44]
    6725                      .dwattr $C$DW$634, DW_AT_accessibility(DW_ACCESS_public)
    6726              
    6727              $C$DW$635       .dwtag  DW_TAG_member
    6728                      .dwattr $C$DW$635, DW_AT_type(*$C$DW$T$73)
    6729                      .dwattr $C$DW$635, DW_AT_name("GPATOGGLE")
    6730                      .dwattr $C$DW$635, DW_AT_TI_symbol_name("_GPATOGGLE")
    6731                      .dwattr $C$DW$635, DW_AT_data_member_location[DW_OP_plus_uconst 0x46]
    6732                      .dwattr $C$DW$635, DW_AT_accessibility(DW_ACCESS_public)
    6733              
    6734              $C$DW$636       .dwtag  DW_TAG_member
    6735                      .dwattr $C$DW$636, DW_AT_type(*$C$DW$T$73)
    6736                      .dwattr $C$DW$636, DW_AT_name("GPBDAT")
    6737                      .dwattr $C$DW$636, DW_AT_TI_symbol_name("_GPBDAT")
    6738                      .dwattr $C$DW$636, DW_AT_data_member_location[DW_OP_plus_uconst 0x48]
    6739                      .dwattr $C$DW$636, DW_AT_accessibility(DW_ACCESS_public)
    6740              
    6741              $C$DW$637       .dwtag  DW_TAG_member
    6742                      .dwattr $C$DW$637, DW_AT_type(*$C$DW$T$73)
    6743                      .dwattr $C$DW$637, DW_AT_name("GPBSET")
    6744                      .dwattr $C$DW$637, DW_AT_TI_symbol_name("_GPBSET")
    6745                      .dwattr $C$DW$637, DW_AT_data_member_location[DW_OP_plus_uconst 0x4a]
    6746                      .dwattr $C$DW$637, DW_AT_accessibility(DW_ACCESS_public)
TMS320C2000 Assembler PC v15.12.3 Wed Nov 22 01:55:15 2017

Tools Copyright (c) 1996-2015 Texas Instruments Incorporated
C:\Users\wmj\AppData\Local\Temp\1239610                              PAGE  127

    6747              
    6748              $C$DW$638       .dwtag  DW_TAG_member
    6749                      .dwattr $C$DW$638, DW_AT_type(*$C$DW$T$73)
    6750                      .dwattr $C$DW$638, DW_AT_name("GPBCLEAR")
    6751                      .dwattr $C$DW$638, DW_AT_TI_symbol_name("_GPBCLEAR")
    6752                      .dwattr $C$DW$638, DW_AT_data_member_location[DW_OP_plus_uconst 0x4c]
    6753                      .dwattr $C$DW$638, DW_AT_accessibility(DW_ACCESS_public)
    6754              
    6755              $C$DW$639       .dwtag  DW_TAG_member
    6756                      .dwattr $C$DW$639, DW_AT_type(*$C$DW$T$73)
    6757                      .dwattr $C$DW$639, DW_AT_name("GPBTOGGLE")
    6758                      .dwattr $C$DW$639, DW_AT_TI_symbol_name("_GPBTOGGLE")
    6759                      .dwattr $C$DW$639, DW_AT_data_member_location[DW_OP_plus_uconst 0x4e]
    6760                      .dwattr $C$DW$639, DW_AT_accessibility(DW_ACCESS_public)
    6761              
    6762              $C$DW$640       .dwtag  DW_TAG_member
    6763                      .dwattr $C$DW$640, DW_AT_type(*$C$DW$T$30)
    6764                      .dwattr $C$DW$640, DW_AT_name("rsvd_7")
    6765                      .dwattr $C$DW$640, DW_AT_TI_symbol_name("_rsvd_7")
    6766                      .dwattr $C$DW$640, DW_AT_data_member_location[DW_OP_plus_uconst 0x50]
    6767                      .dwattr $C$DW$640, DW_AT_accessibility(DW_ACCESS_public)
    6768              
    6769              $C$DW$641       .dwtag  DW_TAG_member
    6770                      .dwattr $C$DW$641, DW_AT_type(*$C$DW$T$73)
    6771                      .dwattr $C$DW$641, DW_AT_name("AIODAT")
    6772                      .dwattr $C$DW$641, DW_AT_TI_symbol_name("_AIODAT")
    6773                      .dwattr $C$DW$641, DW_AT_data_member_location[DW_OP_plus_uconst 0x58]
    6774                      .dwattr $C$DW$641, DW_AT_accessibility(DW_ACCESS_public)
    6775              
    6776              $C$DW$642       .dwtag  DW_TAG_member
    6777                      .dwattr $C$DW$642, DW_AT_type(*$C$DW$T$73)
    6778                      .dwattr $C$DW$642, DW_AT_name("AIOSET")
    6779                      .dwattr $C$DW$642, DW_AT_TI_symbol_name("_AIOSET")
    6780                      .dwattr $C$DW$642, DW_AT_data_member_location[DW_OP_plus_uconst 0x5a]
    6781                      .dwattr $C$DW$642, DW_AT_accessibility(DW_ACCESS_public)
    6782              
    6783              $C$DW$643       .dwtag  DW_TAG_member
    6784                      .dwattr $C$DW$643, DW_AT_type(*$C$DW$T$73)
    6785                      .dwattr $C$DW$643, DW_AT_name("AIOCLEAR")
    6786                      .dwattr $C$DW$643, DW_AT_TI_symbol_name("_AIOCLEAR")
    6787                      .dwattr $C$DW$643, DW_AT_data_member_location[DW_OP_plus_uconst 0x5c]
    6788                      .dwattr $C$DW$643, DW_AT_accessibility(DW_ACCESS_public)
    6789              
    6790              $C$DW$644       .dwtag  DW_TAG_member
    6791                      .dwattr $C$DW$644, DW_AT_type(*$C$DW$T$73)
    6792                      .dwattr $C$DW$644, DW_AT_name("AIOTOGGLE")
    6793                      .dwattr $C$DW$644, DW_AT_TI_symbol_name("_AIOTOGGLE")
    6794                      .dwattr $C$DW$644, DW_AT_data_member_location[DW_OP_plus_uconst 0x5e]
    6795                      .dwattr $C$DW$644, DW_AT_accessibility(DW_ACCESS_public)
    6796              
    6797              $C$DW$645       .dwtag  DW_TAG_member
    6798                      .dwattr $C$DW$645, DW_AT_type(*$C$DW$T$27)
    6799                      .dwattr $C$DW$645, DW_AT_name("GPIOXINTnSEL")
    6800                      .dwattr $C$DW$645, DW_AT_TI_symbol_name("_GPIOXINTnSEL")
    6801                      .dwattr $C$DW$645, DW_AT_data_member_location[DW_OP_plus_uconst 0x60]
TMS320C2000 Assembler PC v15.12.3 Wed Nov 22 01:55:15 2017

Tools Copyright (c) 1996-2015 Texas Instruments Incorporated
C:\Users\wmj\AppData\Local\Temp\1239610                              PAGE  128

    6802                      .dwattr $C$DW$645, DW_AT_accessibility(DW_ACCESS_public)
    6803              
    6804              $C$DW$646       .dwtag  DW_TAG_member
    6805                      .dwattr $C$DW$646, DW_AT_type(*$C$DW$T$26)
    6806                      .dwattr $C$DW$646, DW_AT_name("rsvd_8")
    6807                      .dwattr $C$DW$646, DW_AT_TI_symbol_name("_rsvd_8")
    6808                      .dwattr $C$DW$646, DW_AT_data_member_location[DW_OP_plus_uconst 0x63]
    6809                      .dwattr $C$DW$646, DW_AT_accessibility(DW_ACCESS_public)
    6810              
    6811              $C$DW$647       .dwtag  DW_TAG_member
    6812                      .dwattr $C$DW$647, DW_AT_type(*$C$DW$T$73)
    6813                      .dwattr $C$DW$647, DW_AT_name("GPIOLPMSEL")
    6814                      .dwattr $C$DW$647, DW_AT_TI_symbol_name("_GPIOLPMSEL")
    6815                      .dwattr $C$DW$647, DW_AT_data_member_location[DW_OP_plus_uconst 0x68]
    6816                      .dwattr $C$DW$647, DW_AT_accessibility(DW_ACCESS_public)
    6817              
    6818                      .dwendtag $C$DW$T$76
    6819              
    6820              $C$DW$T$87      .dwtag  DW_TAG_pointer_type
    6821                      .dwattr $C$DW$T$87, DW_AT_type(*$C$DW$T$76)
    6822                      .dwattr $C$DW$T$87, DW_AT_address_class(0x20)
    6823              
    6824              $C$DW$T$88      .dwtag  DW_TAG_typedef
    6825                      .dwattr $C$DW$T$88, DW_AT_name("GPIO_Handle")
    6826                      .dwattr $C$DW$T$88, DW_AT_type(*$C$DW$T$87)
    6827                      .dwattr $C$DW$T$88, DW_AT_language(DW_LANG_C)
    6828              
    6829              $C$DW$648       .dwtag  DW_TAG_TI_far_type
    6830                      .dwattr $C$DW$648, DW_AT_type(*$C$DW$T$88)
    6831              
    6832              $C$DW$T$197     .dwtag  DW_TAG_const_type
    6833                      .dwattr $C$DW$T$197, DW_AT_type(*$C$DW$648)
    6834              
    6835              
    6836              $C$DW$T$78      .dwtag  DW_TAG_structure_type
    6837                      .dwattr $C$DW$T$78, DW_AT_name("_HAL_AdcData_t_")
    6838                      .dwattr $C$DW$T$78, DW_AT_byte_size(0x16)
    6839              $C$DW$649       .dwtag  DW_TAG_member
    6840                      .dwattr $C$DW$649, DW_AT_type(*$C$DW$T$77)
    6841                      .dwattr $C$DW$649, DW_AT_name("I")
    6842                      .dwattr $C$DW$649, DW_AT_TI_symbol_name("_I")
    6843                      .dwattr $C$DW$649, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    6844                      .dwattr $C$DW$649, DW_AT_accessibility(DW_ACCESS_public)
    6845              
    6846              $C$DW$650       .dwtag  DW_TAG_member
    6847                      .dwattr $C$DW$650, DW_AT_type(*$C$DW$T$77)
    6848                      .dwattr $C$DW$650, DW_AT_name("V")
    6849                      .dwattr $C$DW$650, DW_AT_TI_symbol_name("_V")
    6850                      .dwattr $C$DW$650, DW_AT_data_member_location[DW_OP_plus_uconst 0x6]
    6851                      .dwattr $C$DW$650, DW_AT_accessibility(DW_ACCESS_public)
    6852              
    6853              $C$DW$651       .dwtag  DW_TAG_member
    6854                      .dwattr $C$DW$651, DW_AT_type(*$C$DW$T$37)
    6855                      .dwattr $C$DW$651, DW_AT_name("dcBus")
    6856                      .dwattr $C$DW$651, DW_AT_TI_symbol_name("_dcBus")
TMS320C2000 Assembler PC v15.12.3 Wed Nov 22 01:55:15 2017

Tools Copyright (c) 1996-2015 Texas Instruments Incorporated
C:\Users\wmj\AppData\Local\Temp\1239610                              PAGE  129

    6857                      .dwattr $C$DW$651, DW_AT_data_member_location[DW_OP_plus_uconst 0xc]
    6858                      .dwattr $C$DW$651, DW_AT_accessibility(DW_ACCESS_public)
    6859              
    6860              $C$DW$652       .dwtag  DW_TAG_member
    6861                      .dwattr $C$DW$652, DW_AT_type(*$C$DW$T$37)
    6862                      .dwattr $C$DW$652, DW_AT_name("analogSensor1")
    6863                      .dwattr $C$DW$652, DW_AT_TI_symbol_name("_analogSensor1")
    6864                      .dwattr $C$DW$652, DW_AT_data_member_location[DW_OP_plus_uconst 0xe]
    6865                      .dwattr $C$DW$652, DW_AT_accessibility(DW_ACCESS_public)
    6866              
    6867              $C$DW$653       .dwtag  DW_TAG_member
    6868                      .dwattr $C$DW$653, DW_AT_type(*$C$DW$T$37)
    6869                      .dwattr $C$DW$653, DW_AT_name("analogSensor2")
    6870                      .dwattr $C$DW$653, DW_AT_TI_symbol_name("_analogSensor2")
    6871                      .dwattr $C$DW$653, DW_AT_data_member_location[DW_OP_plus_uconst 0x10]
    6872                      .dwattr $C$DW$653, DW_AT_accessibility(DW_ACCESS_public)
    6873              
    6874              $C$DW$654       .dwtag  DW_TAG_member
    6875                      .dwattr $C$DW$654, DW_AT_type(*$C$DW$T$37)
    6876                      .dwattr $C$DW$654, DW_AT_name("igbtNTC")
    6877                      .dwattr $C$DW$654, DW_AT_TI_symbol_name("_igbtNTC")
    6878                      .dwattr $C$DW$654, DW_AT_data_member_location[DW_OP_plus_uconst 0x12]
    6879                      .dwattr $C$DW$654, DW_AT_accessibility(DW_ACCESS_public)
    6880              
    6881              $C$DW$655       .dwtag  DW_TAG_member
    6882                      .dwattr $C$DW$655, DW_AT_type(*$C$DW$T$37)
    6883                      .dwattr $C$DW$655, DW_AT_name("boardAddr")
    6884                      .dwattr $C$DW$655, DW_AT_TI_symbol_name("_boardAddr")
    6885                      .dwattr $C$DW$655, DW_AT_data_member_location[DW_OP_plus_uconst 0x14]
    6886                      .dwattr $C$DW$655, DW_AT_accessibility(DW_ACCESS_public)
    6887              
    6888                      .dwendtag $C$DW$T$78
    6889              
    6890              $C$DW$T$114     .dwtag  DW_TAG_typedef
    6891                      .dwattr $C$DW$T$114, DW_AT_name("HAL_AdcData_t")
    6892                      .dwattr $C$DW$T$114, DW_AT_type(*$C$DW$T$78)
    6893                      .dwattr $C$DW$T$114, DW_AT_language(DW_LANG_C)
    6894              
    6895              
    6896              $C$DW$T$117     .dwtag  DW_TAG_structure_type
    6897                      .dwattr $C$DW$T$117, DW_AT_name("_HAL_Obj_")
    6898                      .dwattr $C$DW$T$117, DW_AT_byte_size(0xb4)
    6899              $C$DW$656       .dwtag  DW_TAG_member
    6900                      .dwattr $C$DW$656, DW_AT_type(*$C$DW$T$80)
    6901                      .dwattr $C$DW$656, DW_AT_name("adcHandle")
    6902                      .dwattr $C$DW$656, DW_AT_TI_symbol_name("_adcHandle")
    6903                      .dwattr $C$DW$656, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    6904                      .dwattr $C$DW$656, DW_AT_accessibility(DW_ACCESS_public)
    6905              
    6906              $C$DW$657       .dwtag  DW_TAG_member
    6907                      .dwattr $C$DW$657, DW_AT_type(*$C$DW$T$82)
    6908                      .dwattr $C$DW$657, DW_AT_name("clkHandle")
    6909                      .dwattr $C$DW$657, DW_AT_TI_symbol_name("_clkHandle")
    6910                      .dwattr $C$DW$657, DW_AT_data_member_location[DW_OP_plus_uconst 0x2]
    6911                      .dwattr $C$DW$657, DW_AT_accessibility(DW_ACCESS_public)
TMS320C2000 Assembler PC v15.12.3 Wed Nov 22 01:55:15 2017

Tools Copyright (c) 1996-2015 Texas Instruments Incorporated
C:\Users\wmj\AppData\Local\Temp\1239610                              PAGE  130

    6912              
    6913              $C$DW$658       .dwtag  DW_TAG_member
    6914                      .dwattr $C$DW$658, DW_AT_type(*$C$DW$T$84)
    6915                      .dwattr $C$DW$658, DW_AT_name("cpuHandle")
    6916                      .dwattr $C$DW$658, DW_AT_TI_symbol_name("_cpuHandle")
    6917                      .dwattr $C$DW$658, DW_AT_data_member_location[DW_OP_plus_uconst 0x4]
    6918                      .dwattr $C$DW$658, DW_AT_accessibility(DW_ACCESS_public)
    6919              
    6920              $C$DW$659       .dwtag  DW_TAG_member
    6921                      .dwattr $C$DW$659, DW_AT_type(*$C$DW$T$86)
    6922                      .dwattr $C$DW$659, DW_AT_name("flashHandle")
    6923                      .dwattr $C$DW$659, DW_AT_TI_symbol_name("_flashHandle")
    6924                      .dwattr $C$DW$659, DW_AT_data_member_location[DW_OP_plus_uconst 0x6]
    6925                      .dwattr $C$DW$659, DW_AT_accessibility(DW_ACCESS_public)
    6926              
    6927              $C$DW$660       .dwtag  DW_TAG_member
    6928                      .dwattr $C$DW$660, DW_AT_type(*$C$DW$T$88)
    6929                      .dwattr $C$DW$660, DW_AT_name("gpioHandle")
    6930                      .dwattr $C$DW$660, DW_AT_TI_symbol_name("_gpioHandle")
    6931                      .dwattr $C$DW$660, DW_AT_data_member_location[DW_OP_plus_uconst 0x8]
    6932                      .dwattr $C$DW$660, DW_AT_accessibility(DW_ACCESS_public)
    6933              
    6934              $C$DW$661       .dwtag  DW_TAG_member
    6935                      .dwattr $C$DW$661, DW_AT_type(*$C$DW$T$91)
    6936                      .dwattr $C$DW$661, DW_AT_name("offsetHandle_I")
    6937                      .dwattr $C$DW$661, DW_AT_TI_symbol_name("_offsetHandle_I")
    6938                      .dwattr $C$DW$661, DW_AT_data_member_location[DW_OP_plus_uconst 0xa]
    6939                      .dwattr $C$DW$661, DW_AT_accessibility(DW_ACCESS_public)
    6940              
    6941              $C$DW$662       .dwtag  DW_TAG_member
    6942                      .dwattr $C$DW$662, DW_AT_type(*$C$DW$T$93)
    6943                      .dwattr $C$DW$662, DW_AT_name("offset_I")
    6944                      .dwattr $C$DW$662, DW_AT_TI_symbol_name("_offset_I")
    6945                      .dwattr $C$DW$662, DW_AT_data_member_location[DW_OP_plus_uconst 0x10]
    6946                      .dwattr $C$DW$662, DW_AT_accessibility(DW_ACCESS_public)
    6947              
    6948              $C$DW$663       .dwtag  DW_TAG_member
    6949                      .dwattr $C$DW$663, DW_AT_type(*$C$DW$T$91)
    6950                      .dwattr $C$DW$663, DW_AT_name("offsetHandle_V")
    6951                      .dwattr $C$DW$663, DW_AT_TI_symbol_name("_offsetHandle_V")
    6952                      .dwattr $C$DW$663, DW_AT_data_member_location[DW_OP_plus_uconst 0x40]
    6953                      .dwattr $C$DW$663, DW_AT_accessibility(DW_ACCESS_public)
    6954              
    6955              $C$DW$664       .dwtag  DW_TAG_member
    6956                      .dwattr $C$DW$664, DW_AT_type(*$C$DW$T$93)
    6957                      .dwattr $C$DW$664, DW_AT_name("offset_V")
    6958                      .dwattr $C$DW$664, DW_AT_TI_symbol_name("_offset_V")
    6959                      .dwattr $C$DW$664, DW_AT_data_member_location[DW_OP_plus_uconst 0x46]
    6960                      .dwattr $C$DW$664, DW_AT_accessibility(DW_ACCESS_public)
    6961              
    6962              $C$DW$665       .dwtag  DW_TAG_member
    6963                      .dwattr $C$DW$665, DW_AT_type(*$C$DW$T$95)
    6964                      .dwattr $C$DW$665, DW_AT_name("oscHandle")
    6965                      .dwattr $C$DW$665, DW_AT_TI_symbol_name("_oscHandle")
    6966                      .dwattr $C$DW$665, DW_AT_data_member_location[DW_OP_plus_uconst 0x76]
TMS320C2000 Assembler PC v15.12.3 Wed Nov 22 01:55:15 2017

Tools Copyright (c) 1996-2015 Texas Instruments Incorporated
C:\Users\wmj\AppData\Local\Temp\1239610                              PAGE  131

    6967                      .dwattr $C$DW$665, DW_AT_accessibility(DW_ACCESS_public)
    6968              
    6969              $C$DW$666       .dwtag  DW_TAG_member
    6970                      .dwattr $C$DW$666, DW_AT_type(*$C$DW$T$97)
    6971                      .dwattr $C$DW$666, DW_AT_name("pieHandle")
    6972                      .dwattr $C$DW$666, DW_AT_TI_symbol_name("_pieHandle")
    6973                      .dwattr $C$DW$666, DW_AT_data_member_location[DW_OP_plus_uconst 0x78]
    6974                      .dwattr $C$DW$666, DW_AT_accessibility(DW_ACCESS_public)
    6975              
    6976              $C$DW$667       .dwtag  DW_TAG_member
    6977                      .dwattr $C$DW$667, DW_AT_type(*$C$DW$T$99)
    6978                      .dwattr $C$DW$667, DW_AT_name("pllHandle")
    6979                      .dwattr $C$DW$667, DW_AT_TI_symbol_name("_pllHandle")
    6980                      .dwattr $C$DW$667, DW_AT_data_member_location[DW_OP_plus_uconst 0x7a]
    6981                      .dwattr $C$DW$667, DW_AT_accessibility(DW_ACCESS_public)
    6982              
    6983              $C$DW$668       .dwtag  DW_TAG_member
    6984                      .dwattr $C$DW$668, DW_AT_type(*$C$DW$T$102)
    6985                      .dwattr $C$DW$668, DW_AT_name("pwmHandle")
    6986                      .dwattr $C$DW$668, DW_AT_TI_symbol_name("_pwmHandle")
    6987                      .dwattr $C$DW$668, DW_AT_data_member_location[DW_OP_plus_uconst 0x7c]
    6988                      .dwattr $C$DW$668, DW_AT_accessibility(DW_ACCESS_public)
    6989              
    6990              $C$DW$669       .dwtag  DW_TAG_member
    6991                      .dwattr $C$DW$669, DW_AT_type(*$C$DW$T$102)
    6992                      .dwattr $C$DW$669, DW_AT_name("pwmDacHandle")
    6993                      .dwattr $C$DW$669, DW_AT_TI_symbol_name("_pwmDacHandle")
    6994                      .dwattr $C$DW$669, DW_AT_data_member_location[DW_OP_plus_uconst 0x82]
    6995                      .dwattr $C$DW$669, DW_AT_accessibility(DW_ACCESS_public)
    6996              
    6997              $C$DW$670       .dwtag  DW_TAG_member
    6998                      .dwattr $C$DW$670, DW_AT_type(*$C$DW$T$104)
    6999                      .dwattr $C$DW$670, DW_AT_name("pwrHandle")
    7000                      .dwattr $C$DW$670, DW_AT_TI_symbol_name("_pwrHandle")
    7001                      .dwattr $C$DW$670, DW_AT_data_member_location[DW_OP_plus_uconst 0x88]
    7002                      .dwattr $C$DW$670, DW_AT_accessibility(DW_ACCESS_public)
    7003              
    7004              $C$DW$671       .dwtag  DW_TAG_member
    7005                      .dwattr $C$DW$671, DW_AT_type(*$C$DW$T$107)
    7006                      .dwattr $C$DW$671, DW_AT_name("timerHandle")
    7007                      .dwattr $C$DW$671, DW_AT_TI_symbol_name("_timerHandle")
    7008                      .dwattr $C$DW$671, DW_AT_data_member_location[DW_OP_plus_uconst 0x8a]
    7009                      .dwattr $C$DW$671, DW_AT_accessibility(DW_ACCESS_public)
    7010              
    7011              $C$DW$672       .dwtag  DW_TAG_member
    7012                      .dwattr $C$DW$672, DW_AT_type(*$C$DW$T$109)
    7013                      .dwattr $C$DW$672, DW_AT_name("spiAHandle")
    7014                      .dwattr $C$DW$672, DW_AT_TI_symbol_name("_spiAHandle")
    7015                      .dwattr $C$DW$672, DW_AT_data_member_location[DW_OP_plus_uconst 0x90]
    7016                      .dwattr $C$DW$672, DW_AT_accessibility(DW_ACCESS_public)
    7017              
    7018              $C$DW$673       .dwtag  DW_TAG_member
