TMS320C2000 Assembler PC v6.2.5 Wed Nov 22 14:48:16 2017

Tools Copyright (c) 1996-2014 Texas Instruments Incorporated
C:\Users\wmj\AppData\Local\Temp\0222411                              PAGE    1

       1              ;***************************************************************
       2              ;* TMS320C2000 C/C++ Codegen                         PC v6.2.5 *
       3              ;* Date/Time created: Wed Nov 22 14:48:16 2017                 *
       4              ;***************************************************************
       5                      .compiler_opts --float_support=softlib --hll_source=on --mem_model:code=flat --mem_model:data=large -
       6        0002  FP      .set    XAR2
       7              
       8              $C$DW$CU        .dwtag  DW_TAG_compile_unit
       9                      .dwattr $C$DW$CU, DW_AT_name("D:/BM1000_v1.1/sw/drivers/drvic/modbus/mb.c")
      10                      .dwattr $C$DW$CU, DW_AT_producer("TMS320C2000 C/C++ Codegen PC v6.2.5 Copyright (c) 1996-2014 Texas I
      11                      .dwattr $C$DW$CU, DW_AT_TI_version(0x01)
      12                      .dwattr $C$DW$CU, DW_AT_comp_dir("D:\BM1000_v1.1\sw\solutions\instaspin_foc\boards\hvkit_rev1p1\f28x\
      13              
      14              $C$DW$1 .dwtag  DW_TAG_subprogram, DW_AT_name("FSM_ShutDowm")
      15                      .dwattr $C$DW$1, DW_AT_TI_symbol_name("_FSM_ShutDowm")

    4743              $C$DW$503       .dwtag  DW_TAG_enumerator, DW_AT_name("GPIO_Number_1"), DW_AT_const_value(0x01)
    4744              $C$DW$504       .dwtag  DW_TAG_enumerator, DW_AT_name("GPIO_Number_2"), DW_AT_const_value(0x02)
    4745              $C$DW$505       .dwtag  DW_TAG_enumerator, DW_AT_name("GPIO_Number_3"), DW_AT_const_value(0x03)
    4746              $C$DW$506       .dwtag  DW_TAG_enumerator, DW_AT_name("GPIO_Number_4"), DW_AT_const_value(0x04)
    4747              $C$DW$507       .dwtag  DW_TAG_enumerator, DW_AT_name("GPIO_Number_5"), DW_AT_const_value(0x05)
    4748              $C$DW$508       .dwtag  DW_TAG_enumerator, DW_AT_name("GPIO_Number_6"), DW_AT_const_value(0x06)
    4749              $C$DW$509       .dwtag  DW_TAG_enumerator, DW_AT_name("GPIO_Number_7"), DW_AT_const_value(0x07)
    4750              $C$DW$510       .dwtag  DW_TAG_enumerator, DW_AT_name("GPIO_Rsvd_8"), DW_AT_const_value(0x08)
    4751              $C$DW$511       .dwtag  DW_TAG_enumerator, DW_AT_name("GPIO_Rsvd_9"), DW_AT_const_value(0x09)
    4752              $C$DW$512       .dwtag  DW_TAG_enumerator, DW_AT_name("GPIO_Rsvd_10"), DW_AT_const_value(0x0a)
    4753              $C$DW$513       .dwtag  DW_TAG_enumerator, DW_AT_name("GPIO_Rsvd_11"), DW_AT_const_value(0x0b)
    4754              $C$DW$514       .dwtag  DW_TAG_enumerator, DW_AT_name("GPIO_Number_12"), DW_AT_const_value(0x0c)
TMS320C2000 Assembler PC v6.2.5 Wed Nov 22 14:48:16 2017

Tools Copyright (c) 1996-2014 Texas Instruments Incorporated
C:\Users\wmj\AppData\Local\Temp\0222411                              PAGE   91

    4755              $C$DW$515       .dwtag  DW_TAG_enumerator, DW_AT_name("GPIO_Rsvd_13"), DW_AT_const_value(0x0d)
    4756              $C$DW$516       .dwtag  DW_TAG_enumerator, DW_AT_name("GPIO_Rsvd_14"), DW_AT_const_value(0x0e)
    4757              $C$DW$517       .dwtag  DW_TAG_enumerator, DW_AT_name("GPIO_Rsvd_15"), DW_AT_const_value(0x0f)
    4758              $C$DW$518       .dwtag  DW_TAG_enumerator, DW_AT_name("GPIO_Number_16"), DW_AT_const_value(0x10)
    4759              $C$DW$519       .dwtag  DW_TAG_enumerator, DW_AT_name("GPIO_Number_17"), DW_AT_const_value(0x11)
    4760              $C$DW$520       .dwtag  DW_TAG_enumerator, DW_AT_name("GPIO_Number_18"), DW_AT_const_value(0x12)
    4761              $C$DW$521       .dwtag  DW_TAG_enumerator, DW_AT_name("GPIO_Number_19"), DW_AT_const_value(0x13)
    4762              $C$DW$522       .dwtag  DW_TAG_enumerator, DW_AT_name("GPIO_Rsvd_20"), DW_AT_const_value(0x14)
    4763              $C$DW$523       .dwtag  DW_TAG_enumerator, DW_AT_name("GPIO_Rsvd_21"), DW_AT_const_value(0x15)
    4764              $C$DW$524       .dwtag  DW_TAG_enumerator, DW_AT_name("GPIO_Rsvd_22"), DW_AT_const_value(0x16)
    4765              $C$DW$525       .dwtag  DW_TAG_enumerator, DW_AT_name("GPIO_Rsvd_23"), DW_AT_const_value(0x17)
    4766              $C$DW$526       .dwtag  DW_TAG_enumerator, DW_AT_name("GPIO_Rsvd_24"), DW_AT_const_value(0x18)
    4767              $C$DW$527       .dwtag  DW_TAG_enumerator, DW_AT_name("GPIO_Rsvd_25"), DW_AT_const_value(0x19)
    4768              $C$DW$528       .dwtag  DW_TAG_enumerator, DW_AT_name("GPIO_Rsvd_26"), DW_AT_const_value(0x1a)
    4769              $C$DW$529       .dwtag  DW_TAG_enumerator, DW_AT_name("GPIO_Rsvd_27"), DW_AT_const_value(0x1b)
    4770              $C$DW$530       .dwtag  DW_TAG_enumerator, DW_AT_name("GPIO_Number_28"), DW_AT_const_value(0x1c)
    4771              $C$DW$531       .dwtag  DW_TAG_enumerator, DW_AT_name("GPIO_Number_29"), DW_AT_const_value(0x1d)
    4772              $C$DW$532       .dwtag  DW_TAG_enumerator, DW_AT_name("GPIO_Rsvd_30"), DW_AT_const_value(0x1e)
    4773              $C$DW$533       .dwtag  DW_TAG_enumerator, DW_AT_name("GPIO_Rsvd_31"), DW_AT_const_value(0x1f)
    4774              $C$DW$534       .dwtag  DW_TAG_enumerator, DW_AT_name("GPIO_Number_32"), DW_AT_const_value(0x20)
    4775              $C$DW$535       .dwtag  DW_TAG_enumerator, DW_AT_name("GPIO_Number_33"), DW_AT_const_value(0x21)
    4776              $C$DW$536       .dwtag  DW_TAG_enumerator, DW_AT_name("GPIO_Number_34"), DW_AT_const_value(0x22)
    4777              $C$DW$537       .dwtag  DW_TAG_enumerator, DW_AT_name("GPIO_Number_35"), DW_AT_const_value(0x23)
    4778              $C$DW$538       .dwtag  DW_TAG_enumerator, DW_AT_name("GPIO_Number_36"), DW_AT_const_value(0x24)
    4779              $C$DW$539       .dwtag  DW_TAG_enumerator, DW_AT_name("GPIO_Number_37"), DW_AT_const_value(0x25)
    4780              $C$DW$540       .dwtag  DW_TAG_enumerator, DW_AT_name("GPIO_Number_38"), DW_AT_const_value(0x26)
    4781              $C$DW$541       .dwtag  DW_TAG_enumerator, DW_AT_name("GPIO_numGpios"), DW_AT_const_value(0x27)
    4782                      .dwendtag $C$DW$T$190
    4783              
    4784              $C$DW$T$191     .dwtag  DW_TAG_typedef, DW_AT_name("GPIO_Number_e")
    4785                      .dwattr $C$DW$T$191, DW_AT_type(*$C$DW$T$190)
    4786                      .dwattr $C$DW$T$191, DW_AT_language(DW_LANG_C)
    4787              $C$DW$542       .dwtag  DW_TAG_TI_far_type
    4788                      .dwattr $C$DW$542, DW_AT_type(*$C$DW$T$191)
    4789              $C$DW$T$192     .dwtag  DW_TAG_const_type
    4790                      .dwattr $C$DW$T$192, DW_AT_type(*$C$DW$542)
    4791              
    4792              $C$DW$T$29      .dwtag  DW_TAG_structure_type
    4793                      .dwattr $C$DW$T$29, DW_AT_name("_ADC_Obj_")
    4794                      .dwattr $C$DW$T$29, DW_AT_byte_size(0x6650)
    4795              $C$DW$543       .dwtag  DW_TAG_member
    4796                      .dwattr $C$DW$543, DW_AT_type(*$C$DW$T$23)
    4797                      .dwattr $C$DW$543, DW_AT_name("ADCRESULT")
    4798                      .dwattr $C$DW$543, DW_AT_TI_symbol_name("_ADCRESULT")
    4799                      .dwattr $C$DW$543, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    4800                      .dwattr $C$DW$543, DW_AT_accessibility(DW_ACCESS_public)
    4801              $C$DW$544       .dwtag  DW_TAG_member
    4802                      .dwattr $C$DW$544, DW_AT_type(*$C$DW$T$24)
    4803                      .dwattr $C$DW$544, DW_AT_name("resvd_1")
    4804                      .dwattr $C$DW$544, DW_AT_TI_symbol_name("_resvd_1")
    4805                      .dwattr $C$DW$544, DW_AT_data_member_location[DW_OP_plus_uconst 0x10]
    4806                      .dwattr $C$DW$544, DW_AT_accessibility(DW_ACCESS_public)
    4807              $C$DW$545       .dwtag  DW_TAG_member
    4808                      .dwattr $C$DW$545, DW_AT_type(*$C$DW$T$22)
    4809                      .dwattr $C$DW$545, DW_AT_name("ADCCTL1")
TMS320C2000 Assembler PC v6.2.5 Wed Nov 22 14:48:16 2017

Tools Copyright (c) 1996-2014 Texas Instruments Incorporated
C:\Users\wmj\AppData\Local\Temp\0222411                              PAGE   92

    4810                      .dwattr $C$DW$545, DW_AT_TI_symbol_name("_ADCCTL1")
    4811                      .dwattr $C$DW$545, DW_AT_data_member_location[DW_OP_plus_uconst 0x6600]
    4812                      .dwattr $C$DW$545, DW_AT_accessibility(DW_ACCESS_public)
    4813              $C$DW$546       .dwtag  DW_TAG_member
    4814                      .dwattr $C$DW$546, DW_AT_type(*$C$DW$T$22)
    4815                      .dwattr $C$DW$546, DW_AT_name("ADCCTL2")
    4816                      .dwattr $C$DW$546, DW_AT_TI_symbol_name("_ADCCTL2")
    4817                      .dwattr $C$DW$546, DW_AT_data_member_location[DW_OP_plus_uconst 0x6601]
    4818                      .dwattr $C$DW$546, DW_AT_accessibility(DW_ACCESS_public)
    4819              $C$DW$547       .dwtag  DW_TAG_member
    4820                      .dwattr $C$DW$547, DW_AT_type(*$C$DW$T$25)
    4821                      .dwattr $C$DW$547, DW_AT_name("rsvd_2")
    4822                      .dwattr $C$DW$547, DW_AT_TI_symbol_name("_rsvd_2")
    4823                      .dwattr $C$DW$547, DW_AT_data_member_location[DW_OP_plus_uconst 0x6602]
    4824                      .dwattr $C$DW$547, DW_AT_accessibility(DW_ACCESS_public)
    4825              $C$DW$548       .dwtag  DW_TAG_member
    4826                      .dwattr $C$DW$548, DW_AT_type(*$C$DW$T$22)
    4827                      .dwattr $C$DW$548, DW_AT_name("ADCINTFLG")
    4828                      .dwattr $C$DW$548, DW_AT_TI_symbol_name("_ADCINTFLG")
    4829                      .dwattr $C$DW$548, DW_AT_data_member_location[DW_OP_plus_uconst 0x6604]
    4830                      .dwattr $C$DW$548, DW_AT_accessibility(DW_ACCESS_public)
    4831              $C$DW$549       .dwtag  DW_TAG_member
    4832                      .dwattr $C$DW$549, DW_AT_type(*$C$DW$T$22)
    4833                      .dwattr $C$DW$549, DW_AT_name("ADCINTFLGCLR")
    4834                      .dwattr $C$DW$549, DW_AT_TI_symbol_name("_ADCINTFLGCLR")
    4835                      .dwattr $C$DW$549, DW_AT_data_member_location[DW_OP_plus_uconst 0x6605]
    4836                      .dwattr $C$DW$549, DW_AT_accessibility(DW_ACCESS_public)
    4837              $C$DW$550       .dwtag  DW_TAG_member
    4838                      .dwattr $C$DW$550, DW_AT_type(*$C$DW$T$22)
    4839                      .dwattr $C$DW$550, DW_AT_name("ADCINTOVF")
    4840                      .dwattr $C$DW$550, DW_AT_TI_symbol_name("_ADCINTOVF")
    4841                      .dwattr $C$DW$550, DW_AT_data_member_location[DW_OP_plus_uconst 0x6606]
    4842                      .dwattr $C$DW$550, DW_AT_accessibility(DW_ACCESS_public)
    4843              $C$DW$551       .dwtag  DW_TAG_member
    4844                      .dwattr $C$DW$551, DW_AT_type(*$C$DW$T$22)
    4845                      .dwattr $C$DW$551, DW_AT_name("ADCINTOVFCLR")
    4846                      .dwattr $C$DW$551, DW_AT_TI_symbol_name("_ADCINTOVFCLR")
    4847                      .dwattr $C$DW$551, DW_AT_data_member_location[DW_OP_plus_uconst 0x6607]
    4848                      .dwattr $C$DW$551, DW_AT_accessibility(DW_ACCESS_public)
    4849              $C$DW$552       .dwtag  DW_TAG_member
    4850                      .dwattr $C$DW$552, DW_AT_type(*$C$DW$T$26)
    4851                      .dwattr $C$DW$552, DW_AT_name("INTSELxNy")
    4852                      .dwattr $C$DW$552, DW_AT_TI_symbol_name("_INTSELxNy")
    4853                      .dwattr $C$DW$552, DW_AT_data_member_location[DW_OP_plus_uconst 0x6608]
    4854                      .dwattr $C$DW$552, DW_AT_accessibility(DW_ACCESS_public)
    4855              $C$DW$553       .dwtag  DW_TAG_member
    4856                      .dwattr $C$DW$553, DW_AT_type(*$C$DW$T$27)
    4857                      .dwattr $C$DW$553, DW_AT_name("rsvd_3")
    4858                      .dwattr $C$DW$553, DW_AT_TI_symbol_name("_rsvd_3")
    4859                      .dwattr $C$DW$553, DW_AT_data_member_location[DW_OP_plus_uconst 0x660d]
    4860                      .dwattr $C$DW$553, DW_AT_accessibility(DW_ACCESS_public)
    4861              $C$DW$554       .dwtag  DW_TAG_member
    4862                      .dwattr $C$DW$554, DW_AT_type(*$C$DW$T$22)
    4863                      .dwattr $C$DW$554, DW_AT_name("SOCPRICTRL")
    4864                      .dwattr $C$DW$554, DW_AT_TI_symbol_name("_SOCPRICTRL")
TMS320C2000 Assembler PC v6.2.5 Wed Nov 22 14:48:16 2017

Tools Copyright (c) 1996-2014 Texas Instruments Incorporated
C:\Users\wmj\AppData\Local\Temp\0222411                              PAGE   93

    4865                      .dwattr $C$DW$554, DW_AT_data_member_location[DW_OP_plus_uconst 0x6610]
    4866                      .dwattr $C$DW$554, DW_AT_accessibility(DW_ACCESS_public)
    4867              $C$DW$555       .dwtag  DW_TAG_member
    4868                      .dwattr $C$DW$555, DW_AT_type(*$C$DW$T$22)
    4869                      .dwattr $C$DW$555, DW_AT_name("rsvd_4")
    4870                      .dwattr $C$DW$555, DW_AT_TI_symbol_name("_rsvd_4")
    4871                      .dwattr $C$DW$555, DW_AT_data_member_location[DW_OP_plus_uconst 0x6611]
    4872                      .dwattr $C$DW$555, DW_AT_accessibility(DW_ACCESS_public)
    4873              $C$DW$556       .dwtag  DW_TAG_member
    4874                      .dwattr $C$DW$556, DW_AT_type(*$C$DW$T$22)
    4875                      .dwattr $C$DW$556, DW_AT_name("ADCSAMPLEMODE")
    4876                      .dwattr $C$DW$556, DW_AT_TI_symbol_name("_ADCSAMPLEMODE")
    4877                      .dwattr $C$DW$556, DW_AT_data_member_location[DW_OP_plus_uconst 0x6612]
    4878                      .dwattr $C$DW$556, DW_AT_accessibility(DW_ACCESS_public)
    4879              $C$DW$557       .dwtag  DW_TAG_member
    4880                      .dwattr $C$DW$557, DW_AT_type(*$C$DW$T$22)
    4881                      .dwattr $C$DW$557, DW_AT_name("rsvd_5")
    4882                      .dwattr $C$DW$557, DW_AT_TI_symbol_name("_rsvd_5")
    4883                      .dwattr $C$DW$557, DW_AT_data_member_location[DW_OP_plus_uconst 0x6613]
    4884                      .dwattr $C$DW$557, DW_AT_accessibility(DW_ACCESS_public)
    4885              $C$DW$558       .dwtag  DW_TAG_member
    4886                      .dwattr $C$DW$558, DW_AT_type(*$C$DW$T$22)
    4887                      .dwattr $C$DW$558, DW_AT_name("ADCINTSOCSEL1")
    4888                      .dwattr $C$DW$558, DW_AT_TI_symbol_name("_ADCINTSOCSEL1")
    4889                      .dwattr $C$DW$558, DW_AT_data_member_location[DW_OP_plus_uconst 0x6614]
    4890                      .dwattr $C$DW$558, DW_AT_accessibility(DW_ACCESS_public)
    4891              $C$DW$559       .dwtag  DW_TAG_member
    4892                      .dwattr $C$DW$559, DW_AT_type(*$C$DW$T$22)
    4893                      .dwattr $C$DW$559, DW_AT_name("ADCINTSOCSEL2")
    4894                      .dwattr $C$DW$559, DW_AT_TI_symbol_name("_ADCINTSOCSEL2")
    4895                      .dwattr $C$DW$559, DW_AT_data_member_location[DW_OP_plus_uconst 0x6615]
    4896                      .dwattr $C$DW$559, DW_AT_accessibility(DW_ACCESS_public)
    4897              $C$DW$560       .dwtag  DW_TAG_member
    4898                      .dwattr $C$DW$560, DW_AT_type(*$C$DW$T$25)
    4899                      .dwattr $C$DW$560, DW_AT_name("rsvd_6")
    4900                      .dwattr $C$DW$560, DW_AT_TI_symbol_name("_rsvd_6")
    4901                      .dwattr $C$DW$560, DW_AT_data_member_location[DW_OP_plus_uconst 0x6616]
    4902                      .dwattr $C$DW$560, DW_AT_accessibility(DW_ACCESS_public)
    4903              $C$DW$561       .dwtag  DW_TAG_member
    4904                      .dwattr $C$DW$561, DW_AT_type(*$C$DW$T$22)
    4905                      .dwattr $C$DW$561, DW_AT_name("ADCSOCFLG1")
    4906                      .dwattr $C$DW$561, DW_AT_TI_symbol_name("_ADCSOCFLG1")
    4907                      .dwattr $C$DW$561, DW_AT_data_member_location[DW_OP_plus_uconst 0x6618]
    4908                      .dwattr $C$DW$561, DW_AT_accessibility(DW_ACCESS_public)
    4909              $C$DW$562       .dwtag  DW_TAG_member
    4910                      .dwattr $C$DW$562, DW_AT_type(*$C$DW$T$22)
    4911                      .dwattr $C$DW$562, DW_AT_name("rsvd_7")
    4912                      .dwattr $C$DW$562, DW_AT_TI_symbol_name("_rsvd_7")
    4913                      .dwattr $C$DW$562, DW_AT_data_member_location[DW_OP_plus_uconst 0x6619]
    4914                      .dwattr $C$DW$562, DW_AT_accessibility(DW_ACCESS_public)
    4915              $C$DW$563       .dwtag  DW_TAG_member
    4916                      .dwattr $C$DW$563, DW_AT_type(*$C$DW$T$22)
    4917                      .dwattr $C$DW$563, DW_AT_name("ADCSOCFRC1")
    4918                      .dwattr $C$DW$563, DW_AT_TI_symbol_name("_ADCSOCFRC1")
    4919                      .dwattr $C$DW$563, DW_AT_data_member_location[DW_OP_plus_uconst 0x661a]
TMS320C2000 Assembler PC v6.2.5 Wed Nov 22 14:48:16 2017

Tools Copyright (c) 1996-2014 Texas Instruments Incorporated
C:\Users\wmj\AppData\Local\Temp\0222411                              PAGE   94

    4920                      .dwattr $C$DW$563, DW_AT_accessibility(DW_ACCESS_public)
    4921              $C$DW$564       .dwtag  DW_TAG_member
    4922                      .dwattr $C$DW$564, DW_AT_type(*$C$DW$T$22)
    4923                      .dwattr $C$DW$564, DW_AT_name("rsvd_8")
    4924                      .dwattr $C$DW$564, DW_AT_TI_symbol_name("_rsvd_8")
    4925                      .dwattr $C$DW$564, DW_AT_data_member_location[DW_OP_plus_uconst 0x661b]
    4926                      .dwattr $C$DW$564, DW_AT_accessibility(DW_ACCESS_public)
    4927              $C$DW$565       .dwtag  DW_TAG_member
    4928                      .dwattr $C$DW$565, DW_AT_type(*$C$DW$T$22)
    4929                      .dwattr $C$DW$565, DW_AT_name("ADCSOCOVF1")
    4930                      .dwattr $C$DW$565, DW_AT_TI_symbol_name("_ADCSOCOVF1")
    4931                      .dwattr $C$DW$565, DW_AT_data_member_location[DW_OP_plus_uconst 0x661c]
    4932                      .dwattr $C$DW$565, DW_AT_accessibility(DW_ACCESS_public)
    4933              $C$DW$566       .dwtag  DW_TAG_member
    4934                      .dwattr $C$DW$566, DW_AT_type(*$C$DW$T$22)
    4935                      .dwattr $C$DW$566, DW_AT_name("rsvd_9")
    4936                      .dwattr $C$DW$566, DW_AT_TI_symbol_name("_rsvd_9")
    4937                      .dwattr $C$DW$566, DW_AT_data_member_location[DW_OP_plus_uconst 0x661d]
    4938                      .dwattr $C$DW$566, DW_AT_accessibility(DW_ACCESS_public)
    4939              $C$DW$567       .dwtag  DW_TAG_member
    4940                      .dwattr $C$DW$567, DW_AT_type(*$C$DW$T$22)
    4941                      .dwattr $C$DW$567, DW_AT_name("ADCSOCOVFCLR1")
    4942                      .dwattr $C$DW$567, DW_AT_TI_symbol_name("_ADCSOCOVFCLR1")
    4943                      .dwattr $C$DW$567, DW_AT_data_member_location[DW_OP_plus_uconst 0x661e]
    4944                      .dwattr $C$DW$567, DW_AT_accessibility(DW_ACCESS_public)
    4945              $C$DW$568       .dwtag  DW_TAG_member
    4946                      .dwattr $C$DW$568, DW_AT_type(*$C$DW$T$22)
    4947                      .dwattr $C$DW$568, DW_AT_name("rsvd_10")
    4948                      .dwattr $C$DW$568, DW_AT_TI_symbol_name("_rsvd_10")
    4949                      .dwattr $C$DW$568, DW_AT_data_member_location[DW_OP_plus_uconst 0x661f]
    4950                      .dwattr $C$DW$568, DW_AT_accessibility(DW_ACCESS_public)
    4951              $C$DW$569       .dwtag  DW_TAG_member
    4952                      .dwattr $C$DW$569, DW_AT_type(*$C$DW$T$23)
    4953                      .dwattr $C$DW$569, DW_AT_name("ADCSOCxCTL")
    4954                      .dwattr $C$DW$569, DW_AT_TI_symbol_name("_ADCSOCxCTL")
    4955                      .dwattr $C$DW$569, DW_AT_data_member_location[DW_OP_plus_uconst 0x6620]
    4956                      .dwattr $C$DW$569, DW_AT_accessibility(DW_ACCESS_public)
    4957              $C$DW$570       .dwtag  DW_TAG_member
    4958                      .dwattr $C$DW$570, DW_AT_type(*$C$DW$T$23)
    4959                      .dwattr $C$DW$570, DW_AT_name("rsvd_11")
    4960                      .dwattr $C$DW$570, DW_AT_TI_symbol_name("_rsvd_11")
    4961                      .dwattr $C$DW$570, DW_AT_data_member_location[DW_OP_plus_uconst 0x6630]
    4962                      .dwattr $C$DW$570, DW_AT_accessibility(DW_ACCESS_public)
    4963              $C$DW$571       .dwtag  DW_TAG_member
    4964                      .dwattr $C$DW$571, DW_AT_type(*$C$DW$T$22)
    4965                      .dwattr $C$DW$571, DW_AT_name("ADCREFTRIM")
    4966                      .dwattr $C$DW$571, DW_AT_TI_symbol_name("_ADCREFTRIM")
    4967                      .dwattr $C$DW$571, DW_AT_data_member_location[DW_OP_plus_uconst 0x6640]
    4968                      .dwattr $C$DW$571, DW_AT_accessibility(DW_ACCESS_public)
    4969              $C$DW$572       .dwtag  DW_TAG_member
    4970                      .dwattr $C$DW$572, DW_AT_type(*$C$DW$T$22)
    4971                      .dwattr $C$DW$572, DW_AT_name("ADCOFFTRIM")
    4972                      .dwattr $C$DW$572, DW_AT_TI_symbol_name("_ADCOFFTRIM")
    4973                      .dwattr $C$DW$572, DW_AT_data_member_location[DW_OP_plus_uconst 0x6641]
    4974                      .dwattr $C$DW$572, DW_AT_accessibility(DW_ACCESS_public)
TMS320C2000 Assembler PC v6.2.5 Wed Nov 22 14:48:16 2017

Tools Copyright (c) 1996-2014 Texas Instruments Incorporated
C:\Users\wmj\AppData\Local\Temp\0222411                              PAGE   95

    4975              $C$DW$573       .dwtag  DW_TAG_member
    4976                      .dwattr $C$DW$573, DW_AT_type(*$C$DW$T$28)
    4977                      .dwattr $C$DW$573, DW_AT_name("resvd_12")
    4978                      .dwattr $C$DW$573, DW_AT_TI_symbol_name("_resvd_12")
    4979                      .dwattr $C$DW$573, DW_AT_data_member_location[DW_OP_plus_uconst 0x6642]
    4980                      .dwattr $C$DW$573, DW_AT_accessibility(DW_ACCESS_public)
    4981              $C$DW$574       .dwtag  DW_TAG_member
    4982                      .dwattr $C$DW$574, DW_AT_type(*$C$DW$T$22)
    4983                      .dwattr $C$DW$574, DW_AT_name("ADCREV")
    4984                      .dwattr $C$DW$574, DW_AT_TI_symbol_name("_ADCREV")
    4985                      .dwattr $C$DW$574, DW_AT_data_member_location[DW_OP_plus_uconst 0x664f]
    4986                      .dwattr $C$DW$574, DW_AT_accessibility(DW_ACCESS_public)
    4987                      .dwendtag $C$DW$T$29
    4988              
    4989              $C$DW$T$79      .dwtag  DW_TAG_pointer_type
    4990                      .dwattr $C$DW$T$79, DW_AT_type(*$C$DW$T$29)
    4991                      .dwattr $C$DW$T$79, DW_AT_address_class(0x16)
    4992              $C$DW$T$80      .dwtag  DW_TAG_typedef, DW_AT_name("ADC_Handle")
    4993                      .dwattr $C$DW$T$80, DW_AT_type(*$C$DW$T$79)
    4994                      .dwattr $C$DW$T$80, DW_AT_language(DW_LANG_C)
    4995              
    4996              $C$DW$T$31      .dwtag  DW_TAG_structure_type
    4997                      .dwattr $C$DW$T$31, DW_AT_name("_CLK_Obj_")
    4998                      .dwattr $C$DW$T$31, DW_AT_byte_size(0x11)
    4999              $C$DW$575       .dwtag  DW_TAG_member
    5000                      .dwattr $C$DW$575, DW_AT_type(*$C$DW$T$22)
    5001                      .dwattr $C$DW$575, DW_AT_name("XCLK")
    5002                      .dwattr $C$DW$575, DW_AT_TI_symbol_name("_XCLK")
    5003                      .dwattr $C$DW$575, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    5004                      .dwattr $C$DW$575, DW_AT_accessibility(DW_ACCESS_public)
    5005              $C$DW$576       .dwtag  DW_TAG_member
    5006                      .dwattr $C$DW$576, DW_AT_type(*$C$DW$T$22)
    5007                      .dwattr $C$DW$576, DW_AT_name("rsvd_1")
    5008                      .dwattr $C$DW$576, DW_AT_TI_symbol_name("_rsvd_1")
    5009                      .dwattr $C$DW$576, DW_AT_data_member_location[DW_OP_plus_uconst 0x1]
    5010                      .dwattr $C$DW$576, DW_AT_accessibility(DW_ACCESS_public)
    5011              $C$DW$577       .dwtag  DW_TAG_member
    5012                      .dwattr $C$DW$577, DW_AT_type(*$C$DW$T$22)
    5013                      .dwattr $C$DW$577, DW_AT_name("CLKCTL")
    5014                      .dwattr $C$DW$577, DW_AT_TI_symbol_name("_CLKCTL")
    5015                      .dwattr $C$DW$577, DW_AT_data_member_location[DW_OP_plus_uconst 0x2]
    5016                      .dwattr $C$DW$577, DW_AT_accessibility(DW_ACCESS_public)
    5017              $C$DW$578       .dwtag  DW_TAG_member
    5018                      .dwattr $C$DW$578, DW_AT_type(*$C$DW$T$30)
    5019                      .dwattr $C$DW$578, DW_AT_name("rsvd_2")
    5020                      .dwattr $C$DW$578, DW_AT_TI_symbol_name("_rsvd_2")
    5021                      .dwattr $C$DW$578, DW_AT_data_member_location[DW_OP_plus_uconst 0x3]
    5022                      .dwattr $C$DW$578, DW_AT_accessibility(DW_ACCESS_public)
    5023              $C$DW$579       .dwtag  DW_TAG_member
    5024                      .dwattr $C$DW$579, DW_AT_type(*$C$DW$T$22)
    5025                      .dwattr $C$DW$579, DW_AT_name("LOSPCP")
    5026                      .dwattr $C$DW$579, DW_AT_TI_symbol_name("_LOSPCP")
    5027                      .dwattr $C$DW$579, DW_AT_data_member_location[DW_OP_plus_uconst 0xb]
    5028                      .dwattr $C$DW$579, DW_AT_accessibility(DW_ACCESS_public)
    5029              $C$DW$580       .dwtag  DW_TAG_member
TMS320C2000 Assembler PC v6.2.5 Wed Nov 22 14:48:16 2017

Tools Copyright (c) 1996-2014 Texas Instruments Incorporated
C:\Users\wmj\AppData\Local\Temp\0222411                              PAGE   96

    5030                      .dwattr $C$DW$580, DW_AT_type(*$C$DW$T$22)
    5031                      .dwattr $C$DW$580, DW_AT_name("PCLKCR0")
    5032                      .dwattr $C$DW$580, DW_AT_TI_symbol_name("_PCLKCR0")
    5033                      .dwattr $C$DW$580, DW_AT_data_member_location[DW_OP_plus_uconst 0xc]
    5034                      .dwattr $C$DW$580, DW_AT_accessibility(DW_ACCESS_public)
    5035              $C$DW$581       .dwtag  DW_TAG_member
    5036                      .dwattr $C$DW$581, DW_AT_type(*$C$DW$T$22)
    5037                      .dwattr $C$DW$581, DW_AT_name("PCLKCR1")
    5038                      .dwattr $C$DW$581, DW_AT_TI_symbol_name("_PCLKCR1")
    5039                      .dwattr $C$DW$581, DW_AT_data_member_location[DW_OP_plus_uconst 0xd]
    5040                      .dwattr $C$DW$581, DW_AT_accessibility(DW_ACCESS_public)
    5041              $C$DW$582       .dwtag  DW_TAG_member
    5042                      .dwattr $C$DW$582, DW_AT_type(*$C$DW$T$25)
    5043                      .dwattr $C$DW$582, DW_AT_name("rsvd_3")
    5044                      .dwattr $C$DW$582, DW_AT_TI_symbol_name("_rsvd_3")
    5045                      .dwattr $C$DW$582, DW_AT_data_member_location[DW_OP_plus_uconst 0xe]
    5046                      .dwattr $C$DW$582, DW_AT_accessibility(DW_ACCESS_public)
    5047              $C$DW$583       .dwtag  DW_TAG_member
    5048                      .dwattr $C$DW$583, DW_AT_type(*$C$DW$T$22)
    5049                      .dwattr $C$DW$583, DW_AT_name("PCLKCR3")
    5050                      .dwattr $C$DW$583, DW_AT_TI_symbol_name("_PCLKCR3")
    5051                      .dwattr $C$DW$583, DW_AT_data_member_location[DW_OP_plus_uconst 0x10]
    5052                      .dwattr $C$DW$583, DW_AT_accessibility(DW_ACCESS_public)
    5053                      .dwendtag $C$DW$T$31
    5054              
    5055              $C$DW$T$81      .dwtag  DW_TAG_pointer_type
    5056                      .dwattr $C$DW$T$81, DW_AT_type(*$C$DW$T$31)
    5057                      .dwattr $C$DW$T$81, DW_AT_address_class(0x16)
    5058              $C$DW$T$82      .dwtag  DW_TAG_typedef, DW_AT_name("CLK_Handle")
    5059                      .dwattr $C$DW$T$82, DW_AT_type(*$C$DW$T$81)
    5060                      .dwattr $C$DW$T$82, DW_AT_language(DW_LANG_C)
    5061              
    5062              $C$DW$T$33      .dwtag  DW_TAG_structure_type
    5063                      .dwattr $C$DW$T$33, DW_AT_name("_CPU_Obj_")
    5064                      .dwattr $C$DW$T$33, DW_AT_byte_size(0x01)
    5065              $C$DW$584       .dwtag  DW_TAG_member
    5066                      .dwattr $C$DW$584, DW_AT_type(*$C$DW$T$32)
    5067                      .dwattr $C$DW$584, DW_AT_name("tmp")
    5068                      .dwattr $C$DW$584, DW_AT_TI_symbol_name("_tmp")
    5069                      .dwattr $C$DW$584, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    5070                      .dwattr $C$DW$584, DW_AT_accessibility(DW_ACCESS_public)
    5071                      .dwendtag $C$DW$T$33
    5072              
    5073              $C$DW$T$83      .dwtag  DW_TAG_pointer_type
    5074                      .dwattr $C$DW$T$83, DW_AT_type(*$C$DW$T$33)
    5075                      .dwattr $C$DW$T$83, DW_AT_address_class(0x16)
    5076              $C$DW$T$84      .dwtag  DW_TAG_typedef, DW_AT_name("CPU_Handle")
    5077                      .dwattr $C$DW$T$84, DW_AT_type(*$C$DW$T$83)
    5078                      .dwattr $C$DW$T$84, DW_AT_language(DW_LANG_C)
    5079              
    5080              $C$DW$T$36      .dwtag  DW_TAG_structure_type
    5081                      .dwattr $C$DW$T$36, DW_AT_name("_CTRL_Version_")
    5082                      .dwattr $C$DW$T$36, DW_AT_byte_size(0x04)
    5083              $C$DW$585       .dwtag  DW_TAG_member
    5084                      .dwattr $C$DW$585, DW_AT_type(*$C$DW$T$21)
TMS320C2000 Assembler PC v6.2.5 Wed Nov 22 14:48:16 2017

Tools Copyright (c) 1996-2014 Texas Instruments Incorporated
C:\Users\wmj\AppData\Local\Temp\0222411                              PAGE   97

    5085                      .dwattr $C$DW$585, DW_AT_name("rsvd")
    5086                      .dwattr $C$DW$585, DW_AT_TI_symbol_name("_rsvd")
    5087                      .dwattr $C$DW$585, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    5088                      .dwattr $C$DW$585, DW_AT_accessibility(DW_ACCESS_public)
    5089              $C$DW$586       .dwtag  DW_TAG_member
    5090                      .dwattr $C$DW$586, DW_AT_type(*$C$DW$T$35)
    5091                      .dwattr $C$DW$586, DW_AT_name("targetProc")
    5092                      .dwattr $C$DW$586, DW_AT_TI_symbol_name("_targetProc")
    5093                      .dwattr $C$DW$586, DW_AT_data_member_location[DW_OP_plus_uconst 0x1]
    5094                      .dwattr $C$DW$586, DW_AT_accessibility(DW_ACCESS_public)
    5095              $C$DW$587       .dwtag  DW_TAG_member
    5096                      .dwattr $C$DW$587, DW_AT_type(*$C$DW$T$21)
    5097                      .dwattr $C$DW$587, DW_AT_name("major")
    5098                      .dwattr $C$DW$587, DW_AT_TI_symbol_name("_major")
    5099                      .dwattr $C$DW$587, DW_AT_data_member_location[DW_OP_plus_uconst 0x2]
    5100                      .dwattr $C$DW$587, DW_AT_accessibility(DW_ACCESS_public)
    5101              $C$DW$588       .dwtag  DW_TAG_member
    5102                      .dwattr $C$DW$588, DW_AT_type(*$C$DW$T$21)
    5103                      .dwattr $C$DW$588, DW_AT_name("minor")
    5104                      .dwattr $C$DW$588, DW_AT_TI_symbol_name("_minor")
    5105                      .dwattr $C$DW$588, DW_AT_data_member_location[DW_OP_plus_uconst 0x3]
    5106                      .dwattr $C$DW$588, DW_AT_accessibility(DW_ACCESS_public)
    5107                      .dwendtag $C$DW$T$36
    5108              
    5109              $C$DW$T$145     .dwtag  DW_TAG_typedef, DW_AT_name("CTRL_Version")
    5110                      .dwattr $C$DW$T$145, DW_AT_type(*$C$DW$T$36)
    5111                      .dwattr $C$DW$T$145, DW_AT_language(DW_LANG_C)
    5112              
    5113              $C$DW$T$38      .dwtag  DW_TAG_structure_type
    5114                      .dwattr $C$DW$T$38, DW_AT_name("_FILTER_FO_")
    5115                      .dwattr $C$DW$T$38, DW_AT_byte_size(0x0a)
    5116              $C$DW$589       .dwtag  DW_TAG_member
    5117                      .dwattr $C$DW$589, DW_AT_type(*$C$DW$T$37)
    5118                      .dwattr $C$DW$589, DW_AT_name("a1")
    5119                      .dwattr $C$DW$589, DW_AT_TI_symbol_name("_a1")
    5120                      .dwattr $C$DW$589, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    5121                      .dwattr $C$DW$589, DW_AT_accessibility(DW_ACCESS_public)
    5122              $C$DW$590       .dwtag  DW_TAG_member
    5123                      .dwattr $C$DW$590, DW_AT_type(*$C$DW$T$37)
    5124                      .dwattr $C$DW$590, DW_AT_name("b0")
    5125                      .dwattr $C$DW$590, DW_AT_TI_symbol_name("_b0")
    5126                      .dwattr $C$DW$590, DW_AT_data_member_location[DW_OP_plus_uconst 0x2]
    5127                      .dwattr $C$DW$590, DW_AT_accessibility(DW_ACCESS_public)
    5128              $C$DW$591       .dwtag  DW_TAG_member
    5129                      .dwattr $C$DW$591, DW_AT_type(*$C$DW$T$37)
    5130                      .dwattr $C$DW$591, DW_AT_name("b1")
    5131                      .dwattr $C$DW$591, DW_AT_TI_symbol_name("_b1")
    5132                      .dwattr $C$DW$591, DW_AT_data_member_location[DW_OP_plus_uconst 0x4]
    5133                      .dwattr $C$DW$591, DW_AT_accessibility(DW_ACCESS_public)
    5134              $C$DW$592       .dwtag  DW_TAG_member
    5135                      .dwattr $C$DW$592, DW_AT_type(*$C$DW$T$37)
    5136                      .dwattr $C$DW$592, DW_AT_name("x1")
    5137                      .dwattr $C$DW$592, DW_AT_TI_symbol_name("_x1")
    5138                      .dwattr $C$DW$592, DW_AT_data_member_location[DW_OP_plus_uconst 0x6]
    5139                      .dwattr $C$DW$592, DW_AT_accessibility(DW_ACCESS_public)
TMS320C2000 Assembler PC v6.2.5 Wed Nov 22 14:48:16 2017

Tools Copyright (c) 1996-2014 Texas Instruments Incorporated
C:\Users\wmj\AppData\Local\Temp\0222411                              PAGE   98

    5140              $C$DW$593       .dwtag  DW_TAG_member
    5141                      .dwattr $C$DW$593, DW_AT_type(*$C$DW$T$37)
    5142                      .dwattr $C$DW$593, DW_AT_name("y1")
    5143                      .dwattr $C$DW$593, DW_AT_TI_symbol_name("_y1")
    5144                      .dwattr $C$DW$593, DW_AT_data_member_location[DW_OP_plus_uconst 0x8]
    5145                      .dwattr $C$DW$593, DW_AT_accessibility(DW_ACCESS_public)
    5146                      .dwendtag $C$DW$T$38
    5147              
    5148              $C$DW$T$149     .dwtag  DW_TAG_typedef, DW_AT_name("FILTER_FO_Obj")
    5149                      .dwattr $C$DW$T$149, DW_AT_type(*$C$DW$T$38)
    5150                      .dwattr $C$DW$T$149, DW_AT_language(DW_LANG_C)
    5151              
    5152              $C$DW$T$19      .dwtag  DW_TAG_structure_type
    5153                      .dwattr $C$DW$T$19, DW_AT_name("_FILTER_FO_Obj_")
    5154                      .dwattr $C$DW$T$19, DW_AT_declaration
    5155                      .dwendtag $C$DW$T$19
    5156              
    5157              $C$DW$T$150     .dwtag  DW_TAG_pointer_type
    5158                      .dwattr $C$DW$T$150, DW_AT_type(*$C$DW$T$19)
    5159                      .dwattr $C$DW$T$150, DW_AT_address_class(0x16)
    5160              $C$DW$T$151     .dwtag  DW_TAG_typedef, DW_AT_name("FILTER_FO_Handle")
    5161                      .dwattr $C$DW$T$151, DW_AT_type(*$C$DW$T$150)
    5162                      .dwattr $C$DW$T$151, DW_AT_language(DW_LANG_C)
    5163              
    5164              $C$DW$T$39      .dwtag  DW_TAG_structure_type
    5165                      .dwattr $C$DW$T$39, DW_AT_name("_FLASH_Obj_")
    5166                      .dwattr $C$DW$T$39, DW_AT_byte_size(0x08)
    5167              $C$DW$594       .dwtag  DW_TAG_member
    5168                      .dwattr $C$DW$594, DW_AT_type(*$C$DW$T$22)
    5169                      .dwattr $C$DW$594, DW_AT_name("FOPT")
    5170                      .dwattr $C$DW$594, DW_AT_TI_symbol_name("_FOPT")
    5171                      .dwattr $C$DW$594, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    5172                      .dwattr $C$DW$594, DW_AT_accessibility(DW_ACCESS_public)
    5173              $C$DW$595       .dwtag  DW_TAG_member
    5174                      .dwattr $C$DW$595, DW_AT_type(*$C$DW$T$22)
    5175                      .dwattr $C$DW$595, DW_AT_name("rsvd_1")
    5176                      .dwattr $C$DW$595, DW_AT_TI_symbol_name("_rsvd_1")
    5177                      .dwattr $C$DW$595, DW_AT_data_member_location[DW_OP_plus_uconst 0x1]
    5178                      .dwattr $C$DW$595, DW_AT_accessibility(DW_ACCESS_public)
    5179              $C$DW$596       .dwtag  DW_TAG_member
    5180                      .dwattr $C$DW$596, DW_AT_type(*$C$DW$T$22)
    5181                      .dwattr $C$DW$596, DW_AT_name("FPWR")
    5182                      .dwattr $C$DW$596, DW_AT_TI_symbol_name("_FPWR")
    5183                      .dwattr $C$DW$596, DW_AT_data_member_location[DW_OP_plus_uconst 0x2]
    5184                      .dwattr $C$DW$596, DW_AT_accessibility(DW_ACCESS_public)
    5185              $C$DW$597       .dwtag  DW_TAG_member
    5186                      .dwattr $C$DW$597, DW_AT_type(*$C$DW$T$22)
    5187                      .dwattr $C$DW$597, DW_AT_name("FSTATUS")
    5188                      .dwattr $C$DW$597, DW_AT_TI_symbol_name("_FSTATUS")
    5189                      .dwattr $C$DW$597, DW_AT_data_member_location[DW_OP_plus_uconst 0x3]
    5190                      .dwattr $C$DW$597, DW_AT_accessibility(DW_ACCESS_public)
    5191              $C$DW$598       .dwtag  DW_TAG_member
    5192                      .dwattr $C$DW$598, DW_AT_type(*$C$DW$T$22)
    5193                      .dwattr $C$DW$598, DW_AT_name("FSTDBYWAIT")
    5194                      .dwattr $C$DW$598, DW_AT_TI_symbol_name("_FSTDBYWAIT")
TMS320C2000 Assembler PC v6.2.5 Wed Nov 22 14:48:16 2017

Tools Copyright (c) 1996-2014 Texas Instruments Incorporated
C:\Users\wmj\AppData\Local\Temp\0222411                              PAGE   99

    5195                      .dwattr $C$DW$598, DW_AT_data_member_location[DW_OP_plus_uconst 0x4]
    5196                      .dwattr $C$DW$598, DW_AT_accessibility(DW_ACCESS_public)
    5197              $C$DW$599       .dwtag  DW_TAG_member
    5198                      .dwattr $C$DW$599, DW_AT_type(*$C$DW$T$22)
    5199                      .dwattr $C$DW$599, DW_AT_name("FACTIVEWAIT")
    5200                      .dwattr $C$DW$599, DW_AT_TI_symbol_name("_FACTIVEWAIT")
    5201                      .dwattr $C$DW$599, DW_AT_data_member_location[DW_OP_plus_uconst 0x5]
    5202                      .dwattr $C$DW$599, DW_AT_accessibility(DW_ACCESS_public)
    5203              $C$DW$600       .dwtag  DW_TAG_member
    5204                      .dwattr $C$DW$600, DW_AT_type(*$C$DW$T$22)
    5205                      .dwattr $C$DW$600, DW_AT_name("FBANKWAIT")
    5206                      .dwattr $C$DW$600, DW_AT_TI_symbol_name("_FBANKWAIT")
    5207                      .dwattr $C$DW$600, DW_AT_data_member_location[DW_OP_plus_uconst 0x6]
    5208                      .dwattr $C$DW$600, DW_AT_accessibility(DW_ACCESS_public)
    5209              $C$DW$601       .dwtag  DW_TAG_member
    5210                      .dwattr $C$DW$601, DW_AT_type(*$C$DW$T$22)
    5211                      .dwattr $C$DW$601, DW_AT_name("FOTPWAIT")
    5212                      .dwattr $C$DW$601, DW_AT_TI_symbol_name("_FOTPWAIT")
    5213                      .dwattr $C$DW$601, DW_AT_data_member_location[DW_OP_plus_uconst 0x7]
    5214                      .dwattr $C$DW$601, DW_AT_accessibility(DW_ACCESS_public)
    5215                      .dwendtag $C$DW$T$39
    5216              
    5217              $C$DW$T$85      .dwtag  DW_TAG_pointer_type
    5218                      .dwattr $C$DW$T$85, DW_AT_type(*$C$DW$T$39)
    5219                      .dwattr $C$DW$T$85, DW_AT_address_class(0x16)
    5220              $C$DW$T$86      .dwtag  DW_TAG_typedef, DW_AT_name("FLASH_Handle")
    5221                      .dwattr $C$DW$T$86, DW_AT_type(*$C$DW$T$85)
    5222                      .dwattr $C$DW$T$86, DW_AT_language(DW_LANG_C)
    5223              
    5224              $C$DW$T$60      .dwtag  DW_TAG_structure_type
    5225                      .dwattr $C$DW$T$60, DW_AT_name("_FSM_Obj_")
    5226                      .dwattr $C$DW$T$60, DW_AT_byte_size(0x26)
    5227              $C$DW$602       .dwtag  DW_TAG_member
    5228                      .dwattr $C$DW$602, DW_AT_type(*$C$DW$T$41)
    5229                      .dwattr $C$DW$602, DW_AT_name("motorHandle")
    5230                      .dwattr $C$DW$602, DW_AT_TI_symbol_name("_motorHandle")
    5231                      .dwattr $C$DW$602, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    5232                      .dwattr $C$DW$602, DW_AT_accessibility(DW_ACCESS_public)
    5233              $C$DW$603       .dwtag  DW_TAG_member
    5234                      .dwattr $C$DW$603, DW_AT_type(*$C$DW$T$43)
    5235                      .dwattr $C$DW$603, DW_AT_name("halHandle")
    5236                      .dwattr $C$DW$603, DW_AT_TI_symbol_name("_halHandle")
    5237                      .dwattr $C$DW$603, DW_AT_data_member_location[DW_OP_plus_uconst 0x2]
    5238                      .dwattr $C$DW$603, DW_AT_accessibility(DW_ACCESS_public)
    5239              $C$DW$604       .dwtag  DW_TAG_member
    5240                      .dwattr $C$DW$604, DW_AT_type(*$C$DW$T$45)
    5241                      .dwattr $C$DW$604, DW_AT_name("StBoxHandle")
    5242                      .dwattr $C$DW$604, DW_AT_TI_symbol_name("_StBoxHandle")
    5243                      .dwattr $C$DW$604, DW_AT_data_member_location[DW_OP_plus_uconst 0x4]
    5244                      .dwattr $C$DW$604, DW_AT_accessibility(DW_ACCESS_public)
    5245              $C$DW$605       .dwtag  DW_TAG_member
    5246                      .dwattr $C$DW$605, DW_AT_type(*$C$DW$T$47)
    5247                      .dwattr $C$DW$605, DW_AT_name("FSM_State")
    5248                      .dwattr $C$DW$605, DW_AT_TI_symbol_name("_FSM_State")
    5249                      .dwattr $C$DW$605, DW_AT_data_member_location[DW_OP_plus_uconst 0x6]
TMS320C2000 Assembler PC v6.2.5 Wed Nov 22 14:48:16 2017

Tools Copyright (c) 1996-2014 Texas Instruments Incorporated
C:\Users\wmj\AppData\Local\Temp\0222411                              PAGE  100

    5250                      .dwattr $C$DW$605, DW_AT_accessibility(DW_ACCESS_public)
    5251              $C$DW$606       .dwtag  DW_TAG_member
    5252                      .dwattr $C$DW$606, DW_AT_type(*$C$DW$T$47)
    5253                      .dwattr $C$DW$606, DW_AT_name("FSM_CurState")
    5254                      .dwattr $C$DW$606, DW_AT_TI_symbol_name("_FSM_CurState")
    5255                      .dwattr $C$DW$606, DW_AT_data_member_location[DW_OP_plus_uconst 0x7]
    5256                      .dwattr $C$DW$606, DW_AT_accessibility(DW_ACCESS_public)
    5257              $C$DW$607       .dwtag  DW_TAG_member
    5258                      .dwattr $C$DW$607, DW_AT_type(*$C$DW$T$49)
    5259                      .dwattr $C$DW$607, DW_AT_name("FSM_Trans")
    5260                      .dwattr $C$DW$607, DW_AT_TI_symbol_name("_FSM_Trans")
    5261                      .dwattr $C$DW$607, DW_AT_data_member_location[DW_OP_plus_uconst 0x8]
    5262                      .dwattr $C$DW$607, DW_AT_accessibility(DW_ACCESS_public)
    5263              $C$DW$608       .dwtag  DW_TAG_member
    5264                      .dwattr $C$DW$608, DW_AT_type(*$C$DW$T$51)
    5265                      .dwattr $C$DW$608, DW_AT_name("FSM_Event")
    5266                      .dwattr $C$DW$608, DW_AT_TI_symbol_name("_FSM_Event")
    5267                      .dwattr $C$DW$608, DW_AT_data_member_location[DW_OP_plus_uconst 0x9]
    5268                      .dwattr $C$DW$608, DW_AT_accessibility(DW_ACCESS_public)
    5269              $C$DW$609       .dwtag  DW_TAG_member
    5270                      .dwattr $C$DW$609, DW_AT_type(*$C$DW$T$53)
    5271                      .dwattr $C$DW$609, DW_AT_name("FSM_StMode")
    5272                      .dwattr $C$DW$609, DW_AT_TI_symbol_name("_FSM_StMode")
    5273                      .dwattr $C$DW$609, DW_AT_data_member_location[DW_OP_plus_uconst 0xa]
    5274                      .dwattr $C$DW$609, DW_AT_accessibility(DW_ACCESS_public)
    5275              $C$DW$610       .dwtag  DW_TAG_member
    5276                      .dwattr $C$DW$610, DW_AT_type(*$C$DW$T$21)
    5277                      .dwattr $C$DW$610, DW_AT_name("FSM_ErrFlg")
    5278                      .dwattr $C$DW$610, DW_AT_TI_symbol_name("_FSM_ErrFlg")
    5279                      .dwattr $C$DW$610, DW_AT_data_member_location[DW_OP_plus_uconst 0xb]
    5280                      .dwattr $C$DW$610, DW_AT_accessibility(DW_ACCESS_public)
    5281              $C$DW$611       .dwtag  DW_TAG_member
    5282                      .dwattr $C$DW$611, DW_AT_type(*$C$DW$T$21)
    5283                      .dwattr $C$DW$611, DW_AT_name("FSM_ErrMask")
    5284                      .dwattr $C$DW$611, DW_AT_TI_symbol_name("_FSM_ErrMask")
    5285                      .dwattr $C$DW$611, DW_AT_data_member_location[DW_OP_plus_uconst 0xc]
    5286                      .dwattr $C$DW$611, DW_AT_accessibility(DW_ACCESS_public)
    5287              $C$DW$612       .dwtag  DW_TAG_member
    5288                      .dwattr $C$DW$612, DW_AT_type(*$C$DW$T$21)
    5289                      .dwattr $C$DW$612, DW_AT_name("FSM_runTime")
    5290                      .dwattr $C$DW$612, DW_AT_TI_symbol_name("_FSM_runTime")
    5291                      .dwattr $C$DW$612, DW_AT_data_member_location[DW_OP_plus_uconst 0xd]
    5292                      .dwattr $C$DW$612, DW_AT_accessibility(DW_ACCESS_public)
    5293              $C$DW$613       .dwtag  DW_TAG_member
    5294                      .dwattr $C$DW$613, DW_AT_type(*$C$DW$T$21)
    5295                      .dwattr $C$DW$613, DW_AT_name("FSM_485Cmd")
    5296                      .dwattr $C$DW$613, DW_AT_TI_symbol_name("_FSM_485Cmd")
    5297                      .dwattr $C$DW$613, DW_AT_data_member_location[DW_OP_plus_uconst 0xe]
    5298                      .dwattr $C$DW$613, DW_AT_accessibility(DW_ACCESS_public)
    5299              $C$DW$614       .dwtag  DW_TAG_member
    5300                      .dwattr $C$DW$614, DW_AT_type(*$C$DW$T$47)
    5301                      .dwattr $C$DW$614, DW_AT_name("FSM_485EditState")
    5302                      .dwattr $C$DW$614, DW_AT_TI_symbol_name("_FSM_485EditState")
    5303                      .dwattr $C$DW$614, DW_AT_data_member_location[DW_OP_plus_uconst 0xf]
    5304                      .dwattr $C$DW$614, DW_AT_accessibility(DW_ACCESS_public)
TMS320C2000 Assembler PC v6.2.5 Wed Nov 22 14:48:16 2017

Tools Copyright (c) 1996-2014 Texas Instruments Incorporated
C:\Users\wmj\AppData\Local\Temp\0222411                              PAGE  101

    5305              $C$DW$615       .dwtag  DW_TAG_member
    5306                      .dwattr $C$DW$615, DW_AT_type(*$C$DW$T$55)
    5307                      .dwattr $C$DW$615, DW_AT_name("FSM_485EditOpt")
    5308                      .dwattr $C$DW$615, DW_AT_TI_symbol_name("_FSM_485EditOpt")
    5309                      .dwattr $C$DW$615, DW_AT_data_member_location[DW_OP_plus_uconst 0x10]
    5310                      .dwattr $C$DW$615, DW_AT_accessibility(DW_ACCESS_public)
    5311              $C$DW$616       .dwtag  DW_TAG_member
    5312                      .dwattr $C$DW$616, DW_AT_type(*$C$DW$T$21)
    5313                      .dwattr $C$DW$616, DW_AT_name("FSM_485RefSpeed")
    5314                      .dwattr $C$DW$616, DW_AT_TI_symbol_name("_FSM_485RefSpeed")
    5315                      .dwattr $C$DW$616, DW_AT_data_member_location[DW_OP_plus_uconst 0x11]
    5316                      .dwattr $C$DW$616, DW_AT_accessibility(DW_ACCESS_public)
    5317              $C$DW$617       .dwtag  DW_TAG_member
    5318                      .dwattr $C$DW$617, DW_AT_type(*$C$DW$T$37)
    5319                      .dwattr $C$DW$617, DW_AT_name("MaxTorque_Nm")
    5320                      .dwattr $C$DW$617, DW_AT_TI_symbol_name("_MaxTorque_Nm")
    5321                      .dwattr $C$DW$617, DW_AT_data_member_location[DW_OP_plus_uconst 0x12]
    5322                      .dwattr $C$DW$617, DW_AT_accessibility(DW_ACCESS_public)
    5323              $C$DW$618       .dwtag  DW_TAG_member
    5324                      .dwattr $C$DW$618, DW_AT_type(*$C$DW$T$57)
    5325                      .dwattr $C$DW$618, DW_AT_name("FSM_CheckCond")
    5326                      .dwattr $C$DW$618, DW_AT_TI_symbol_name("_FSM_CheckCond")
    5327                      .dwattr $C$DW$618, DW_AT_data_member_location[DW_OP_plus_uconst 0x14]
    5328                      .dwattr $C$DW$618, DW_AT_accessibility(DW_ACCESS_public)
    5329              $C$DW$619       .dwtag  DW_TAG_member
    5330                      .dwattr $C$DW$619, DW_AT_type(*$C$DW$T$21)
    5331                      .dwattr $C$DW$619, DW_AT_name("FSM_CondValue")
    5332                      .dwattr $C$DW$619, DW_AT_TI_symbol_name("_FSM_CondValue")
    5333                      .dwattr $C$DW$619, DW_AT_data_member_location[DW_OP_plus_uconst 0x15]
    5334                      .dwattr $C$DW$619, DW_AT_accessibility(DW_ACCESS_public)
    5335              $C$DW$620       .dwtag  DW_TAG_member
    5336                      .dwattr $C$DW$620, DW_AT_type(*$C$DW$T$58)
    5337                      .dwattr $C$DW$620, DW_AT_name("OldAbsPos")
    5338                      .dwattr $C$DW$620, DW_AT_TI_symbol_name("_OldAbsPos")
    5339                      .dwattr $C$DW$620, DW_AT_data_member_location[DW_OP_plus_uconst 0x16]
    5340                      .dwattr $C$DW$620, DW_AT_accessibility(DW_ACCESS_public)
    5341              $C$DW$621       .dwtag  DW_TAG_member
    5342                      .dwattr $C$DW$621, DW_AT_type(*$C$DW$T$58)
    5343                      .dwattr $C$DW$621, DW_AT_name("NewAbsPos")
    5344                      .dwattr $C$DW$621, DW_AT_TI_symbol_name("_NewAbsPos")
    5345                      .dwattr $C$DW$621, DW_AT_data_member_location[DW_OP_plus_uconst 0x1a]
    5346                      .dwattr $C$DW$621, DW_AT_accessibility(DW_ACCESS_public)
    5347              $C$DW$622       .dwtag  DW_TAG_member
    5348                      .dwattr $C$DW$622, DW_AT_type(*$C$DW$T$59)
    5349                      .dwattr $C$DW$622, DW_AT_name("Flag_485StartMotor")
    5350                      .dwattr $C$DW$622, DW_AT_TI_symbol_name("_Flag_485StartMotor")
    5351                      .dwattr $C$DW$622, DW_AT_data_member_location[DW_OP_plus_uconst 0x1e]
    5352                      .dwattr $C$DW$622, DW_AT_accessibility(DW_ACCESS_public)
    5353              $C$DW$623       .dwtag  DW_TAG_member
    5354                      .dwattr $C$DW$623, DW_AT_type(*$C$DW$T$59)
    5355                      .dwattr $C$DW$623, DW_AT_name("Flag_MaxTimeLimit")
    5356                      .dwattr $C$DW$623, DW_AT_TI_symbol_name("_Flag_MaxTimeLimit")
    5357                      .dwattr $C$DW$623, DW_AT_data_member_location[DW_OP_plus_uconst 0x1f]
    5358                      .dwattr $C$DW$623, DW_AT_accessibility(DW_ACCESS_public)
    5359              $C$DW$624       .dwtag  DW_TAG_member
TMS320C2000 Assembler PC v6.2.5 Wed Nov 22 14:48:16 2017

Tools Copyright (c) 1996-2014 Texas Instruments Incorporated
C:\Users\wmj\AppData\Local\Temp\0222411                              PAGE  102

    5360                      .dwattr $C$DW$624, DW_AT_type(*$C$DW$T$59)
    5361                      .dwattr $C$DW$624, DW_AT_name("runTime_Enable")
    5362                      .dwattr $C$DW$624, DW_AT_TI_symbol_name("_runTime_Enable")
    5363                      .dwattr $C$DW$624, DW_AT_data_member_location[DW_OP_plus_uconst 0x20]
    5364                      .dwattr $C$DW$624, DW_AT_accessibility(DW_ACCESS_public)
    5365              $C$DW$625       .dwtag  DW_TAG_member
    5366                      .dwattr $C$DW$625, DW_AT_type(*$C$DW$T$59)
    5367                      .dwattr $C$DW$625, DW_AT_name("Flag_StallEnable")
    5368                      .dwattr $C$DW$625, DW_AT_TI_symbol_name("_Flag_StallEnable")
    5369                      .dwattr $C$DW$625, DW_AT_data_member_location[DW_OP_plus_uconst 0x21]
    5370                      .dwattr $C$DW$625, DW_AT_accessibility(DW_ACCESS_public)
    5371              $C$DW$626       .dwtag  DW_TAG_member
    5372                      .dwattr $C$DW$626, DW_AT_type(*$C$DW$T$59)
    5373                      .dwattr $C$DW$626, DW_AT_name("Flag_ReportState")
    5374                      .dwattr $C$DW$626, DW_AT_TI_symbol_name("_Flag_ReportState")
    5375                      .dwattr $C$DW$626, DW_AT_data_member_location[DW_OP_plus_uconst 0x22]
    5376                      .dwattr $C$DW$626, DW_AT_accessibility(DW_ACCESS_public)
    5377              $C$DW$627       .dwtag  DW_TAG_member
    5378                      .dwattr $C$DW$627, DW_AT_type(*$C$DW$T$59)
    5379                      .dwattr $C$DW$627, DW_AT_name("Flag_RunMode")
    5380                      .dwattr $C$DW$627, DW_AT_TI_symbol_name("_Flag_RunMode")
    5381                      .dwattr $C$DW$627, DW_AT_data_member_location[DW_OP_plus_uconst 0x23]
    5382                      .dwattr $C$DW$627, DW_AT_accessibility(DW_ACCESS_public)
    5383              $C$DW$628       .dwtag  DW_TAG_member
    5384                      .dwattr $C$DW$628, DW_AT_type(*$C$DW$T$59)
    5385                      .dwattr $C$DW$628, DW_AT_name("Flag_DcBrake")
    5386                      .dwattr $C$DW$628, DW_AT_TI_symbol_name("_Flag_DcBrake")
    5387                      .dwattr $C$DW$628, DW_AT_data_member_location[DW_OP_plus_uconst 0x24]
    5388                      .dwattr $C$DW$628, DW_AT_accessibility(DW_ACCESS_public)
    5389                      .dwendtag $C$DW$T$60
    5390              
    5391              $C$DW$T$193     .dwtag  DW_TAG_typedef, DW_AT_name("FSM_Obj")
    5392                      .dwattr $C$DW$T$193, DW_AT_type(*$C$DW$T$60)
    5393                      .dwattr $C$DW$T$193, DW_AT_language(DW_LANG_C)
    5394              $C$DW$T$194     .dwtag  DW_TAG_pointer_type
    5395                      .dwattr $C$DW$T$194, DW_AT_type(*$C$DW$T$193)
    5396                      .dwattr $C$DW$T$194, DW_AT_address_class(0x16)
    5397              $C$DW$T$120     .dwtag  DW_TAG_pointer_type
    5398                      .dwattr $C$DW$T$120, DW_AT_type(*$C$DW$T$60)
    5399                      .dwattr $C$DW$T$120, DW_AT_address_class(0x16)
    5400              $C$DW$T$121     .dwtag  DW_TAG_typedef, DW_AT_name("FSM_Handle")
    5401                      .dwattr $C$DW$T$121, DW_AT_type(*$C$DW$T$120)
    5402                      .dwattr $C$DW$T$121, DW_AT_language(DW_LANG_C)
    5403              $C$DW$629       .dwtag  DW_TAG_TI_far_type
    5404                      .dwattr $C$DW$629, DW_AT_type(*$C$DW$T$121)
    5405              $C$DW$T$195     .dwtag  DW_TAG_const_type
    5406                      .dwattr $C$DW$T$195, DW_AT_type(*$C$DW$629)
    5407              
    5408              $C$DW$T$62      .dwtag  DW_TAG_structure_type
    5409                      .dwattr $C$DW$T$62, DW_AT_name("_FSM_Position_t_")
    5410                      .dwattr $C$DW$T$62, DW_AT_byte_size(0x04)
    5411              $C$DW$630       .dwtag  DW_TAG_member
    5412                      .dwattr $C$DW$630, DW_AT_type(*$C$DW$T$61)
    5413                      .dwattr $C$DW$630, DW_AT_name("PosInt_MRev")
    5414                      .dwattr $C$DW$630, DW_AT_TI_symbol_name("_PosInt_MRev")
TMS320C2000 Assembler PC v6.2.5 Wed Nov 22 14:48:16 2017

Tools Copyright (c) 1996-2014 Texas Instruments Incorporated
C:\Users\wmj\AppData\Local\Temp\0222411                              PAGE  103

    5415                      .dwattr $C$DW$630, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    5416                      .dwattr $C$DW$630, DW_AT_accessibility(DW_ACCESS_public)
    5417              $C$DW$631       .dwtag  DW_TAG_member
    5418                      .dwattr $C$DW$631, DW_AT_type(*$C$DW$T$37)
    5419                      .dwattr $C$DW$631, DW_AT_name("PosFrac_MRev")
    5420                      .dwattr $C$DW$631, DW_AT_TI_symbol_name("_PosFrac_MRev")
    5421                      .dwattr $C$DW$631, DW_AT_data_member_location[DW_OP_plus_uconst 0x2]
    5422                      .dwattr $C$DW$631, DW_AT_accessibility(DW_ACCESS_public)
    5423                      .dwendtag $C$DW$T$62
    5424              
    5425              $C$DW$T$58      .dwtag  DW_TAG_typedef, DW_AT_name("FSM_Position_t")
    5426                      .dwattr $C$DW$T$58, DW_AT_type(*$C$DW$T$62)
    5427                      .dwattr $C$DW$T$58, DW_AT_language(DW_LANG_C)
    5428              
    5429              $C$DW$T$71      .dwtag  DW_TAG_structure_type
    5430                      .dwattr $C$DW$T$71, DW_AT_name("_FSM_StatePool_t_")
    5431                      .dwattr $C$DW$T$71, DW_AT_byte_size(0x4b)
    5432              $C$DW$632       .dwtag  DW_TAG_member
    5433                      .dwattr $C$DW$632, DW_AT_type(*$C$DW$T$64)
    5434                      .dwattr $C$DW$632, DW_AT_name("FSM_RefSpeed")
    5435                      .dwattr $C$DW$632, DW_AT_TI_symbol_name("_FSM_RefSpeed")
    5436                      .dwattr $C$DW$632, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    5437                      .dwattr $C$DW$632, DW_AT_accessibility(DW_ACCESS_public)
    5438              $C$DW$633       .dwtag  DW_TAG_member
    5439                      .dwattr $C$DW$633, DW_AT_type(*$C$DW$T$65)
    5440                      .dwattr $C$DW$633, DW_AT_name("FSM_CondValue")
    5441                      .dwattr $C$DW$633, DW_AT_TI_symbol_name("_FSM_CondValue")
    5442                      .dwattr $C$DW$633, DW_AT_data_member_location[DW_OP_plus_uconst 0xf]
    5443                      .dwattr $C$DW$633, DW_AT_accessibility(DW_ACCESS_public)
    5444              $C$DW$634       .dwtag  DW_TAG_member
    5445                      .dwattr $C$DW$634, DW_AT_type(*$C$DW$T$66)
    5446                      .dwattr $C$DW$634, DW_AT_name("FSM_Condition")
    5447                      .dwattr $C$DW$634, DW_AT_TI_symbol_name("_FSM_Condition")
    5448                      .dwattr $C$DW$634, DW_AT_data_member_location[DW_OP_plus_uconst 0x1e]
    5449                      .dwattr $C$DW$634, DW_AT_accessibility(DW_ACCESS_public)
    5450              $C$DW$635       .dwtag  DW_TAG_member
    5451                      .dwattr $C$DW$635, DW_AT_type(*$C$DW$T$69)
    5452                      .dwattr $C$DW$635, DW_AT_name("FSM_RunAction")
    5453                      .dwattr $C$DW$635, DW_AT_TI_symbol_name("_FSM_RunAction")
    5454                      .dwattr $C$DW$635, DW_AT_data_member_location[DW_OP_plus_uconst 0x2d]
    5455                      .dwattr $C$DW$635, DW_AT_accessibility(DW_ACCESS_public)
    5456              $C$DW$636       .dwtag  DW_TAG_member
    5457                      .dwattr $C$DW$636, DW_AT_type(*$C$DW$T$70)
    5458                      .dwattr $C$DW$636, DW_AT_name("FSM_NextState")
    5459                      .dwattr $C$DW$636, DW_AT_TI_symbol_name("_FSM_NextState")
    5460                      .dwattr $C$DW$636, DW_AT_data_member_location[DW_OP_plus_uconst 0x3c]
    5461                      .dwattr $C$DW$636, DW_AT_accessibility(DW_ACCESS_public)
    5462                      .dwendtag $C$DW$T$71
    5463              
    5464              $C$DW$T$44      .dwtag  DW_TAG_pointer_type
    5465                      .dwattr $C$DW$T$44, DW_AT_type(*$C$DW$T$71)
    5466                      .dwattr $C$DW$T$44, DW_AT_address_class(0x16)
    5467              $C$DW$T$45      .dwtag  DW_TAG_typedef, DW_AT_name("StPool_Handle")
    5468                      .dwattr $C$DW$T$45, DW_AT_type(*$C$DW$T$44)
    5469                      .dwattr $C$DW$T$45, DW_AT_language(DW_LANG_C)
TMS320C2000 Assembler PC v6.2.5 Wed Nov 22 14:48:16 2017

Tools Copyright (c) 1996-2014 Texas Instruments Incorporated
C:\Users\wmj\AppData\Local\Temp\0222411                              PAGE  104

    5470              
    5471              $C$DW$T$76      .dwtag  DW_TAG_structure_type
    5472                      .dwattr $C$DW$T$76, DW_AT_name("_GPIO_Obj_")
    5473                      .dwattr $C$DW$T$76, DW_AT_byte_size(0x6a)
    5474              $C$DW$637       .dwtag  DW_TAG_member
    5475                      .dwattr $C$DW$637, DW_AT_type(*$C$DW$T$73)
    5476                      .dwattr $C$DW$637, DW_AT_name("GPACTRL")
    5477                      .dwattr $C$DW$637, DW_AT_TI_symbol_name("_GPACTRL")
    5478                      .dwattr $C$DW$637, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    5479                      .dwattr $C$DW$637, DW_AT_accessibility(DW_ACCESS_public)
    5480              $C$DW$638       .dwtag  DW_TAG_member
    5481                      .dwattr $C$DW$638, DW_AT_type(*$C$DW$T$73)
    5482                      .dwattr $C$DW$638, DW_AT_name("GPAQSEL1")
    5483                      .dwattr $C$DW$638, DW_AT_TI_symbol_name("_GPAQSEL1")
    5484                      .dwattr $C$DW$638, DW_AT_data_member_location[DW_OP_plus_uconst 0x2]
    5485                      .dwattr $C$DW$638, DW_AT_accessibility(DW_ACCESS_public)
    5486              $C$DW$639       .dwtag  DW_TAG_member
    5487                      .dwattr $C$DW$639, DW_AT_type(*$C$DW$T$73)
    5488                      .dwattr $C$DW$639, DW_AT_name("GPAQSEL2")
    5489                      .dwattr $C$DW$639, DW_AT_TI_symbol_name("_GPAQSEL2")
    5490                      .dwattr $C$DW$639, DW_AT_data_member_location[DW_OP_plus_uconst 0x4]
    5491                      .dwattr $C$DW$639, DW_AT_accessibility(DW_ACCESS_public)
    5492              $C$DW$640       .dwtag  DW_TAG_member
    5493                      .dwattr $C$DW$640, DW_AT_type(*$C$DW$T$73)
    5494                      .dwattr $C$DW$640, DW_AT_name("GPAMUX1")
    5495                      .dwattr $C$DW$640, DW_AT_TI_symbol_name("_GPAMUX1")
    5496                      .dwattr $C$DW$640, DW_AT_data_member_location[DW_OP_plus_uconst 0x6]
    5497                      .dwattr $C$DW$640, DW_AT_accessibility(DW_ACCESS_public)
    5498              $C$DW$641       .dwtag  DW_TAG_member
    5499                      .dwattr $C$DW$641, DW_AT_type(*$C$DW$T$73)
    5500                      .dwattr $C$DW$641, DW_AT_name("GPAMUX2")
    5501                      .dwattr $C$DW$641, DW_AT_TI_symbol_name("_GPAMUX2")
    5502                      .dwattr $C$DW$641, DW_AT_data_member_location[DW_OP_plus_uconst 0x8]
    5503                      .dwattr $C$DW$641, DW_AT_accessibility(DW_ACCESS_public)
    5504              $C$DW$642       .dwtag  DW_TAG_member
    5505                      .dwattr $C$DW$642, DW_AT_type(*$C$DW$T$73)
    5506                      .dwattr $C$DW$642, DW_AT_name("GPADIR")
    5507                      .dwattr $C$DW$642, DW_AT_TI_symbol_name("_GPADIR")
    5508                      .dwattr $C$DW$642, DW_AT_data_member_location[DW_OP_plus_uconst 0xa]
    5509                      .dwattr $C$DW$642, DW_AT_accessibility(DW_ACCESS_public)
    5510              $C$DW$643       .dwtag  DW_TAG_member
    5511                      .dwattr $C$DW$643, DW_AT_type(*$C$DW$T$73)
    5512                      .dwattr $C$DW$643, DW_AT_name("GPAPUD")
    5513                      .dwattr $C$DW$643, DW_AT_TI_symbol_name("_GPAPUD")
    5514                      .dwattr $C$DW$643, DW_AT_data_member_location[DW_OP_plus_uconst 0xc]
    5515                      .dwattr $C$DW$643, DW_AT_accessibility(DW_ACCESS_public)
    5516              $C$DW$644       .dwtag  DW_TAG_member
    5517                      .dwattr $C$DW$644, DW_AT_type(*$C$DW$T$25)
    5518                      .dwattr $C$DW$644, DW_AT_name("rsvd_1")
    5519                      .dwattr $C$DW$644, DW_AT_TI_symbol_name("_rsvd_1")
    5520                      .dwattr $C$DW$644, DW_AT_data_member_location[DW_OP_plus_uconst 0xe]
    5521                      .dwattr $C$DW$644, DW_AT_accessibility(DW_ACCESS_public)
    5522              $C$DW$645       .dwtag  DW_TAG_member
    5523                      .dwattr $C$DW$645, DW_AT_type(*$C$DW$T$73)
    5524                      .dwattr $C$DW$645, DW_AT_name("GPBCTRL")
TMS320C2000 Assembler PC v6.2.5 Wed Nov 22 14:48:16 2017

Tools Copyright (c) 1996-2014 Texas Instruments Incorporated
C:\Users\wmj\AppData\Local\Temp\0222411                              PAGE  105

    5525                      .dwattr $C$DW$645, DW_AT_TI_symbol_name("_GPBCTRL")
    5526                      .dwattr $C$DW$645, DW_AT_data_member_location[DW_OP_plus_uconst 0x10]
    5527                      .dwattr $C$DW$645, DW_AT_accessibility(DW_ACCESS_public)
    5528              $C$DW$646       .dwtag  DW_TAG_member
    5529                      .dwattr $C$DW$646, DW_AT_type(*$C$DW$T$73)
    5530                      .dwattr $C$DW$646, DW_AT_name("GPBQSEL1")
    5531                      .dwattr $C$DW$646, DW_AT_TI_symbol_name("_GPBQSEL1")
    5532                      .dwattr $C$DW$646, DW_AT_data_member_location[DW_OP_plus_uconst 0x12]
    5533                      .dwattr $C$DW$646, DW_AT_accessibility(DW_ACCESS_public)
    5534              $C$DW$647       .dwtag  DW_TAG_member
    5535                      .dwattr $C$DW$647, DW_AT_type(*$C$DW$T$25)
    5536                      .dwattr $C$DW$647, DW_AT_name("rsvd_2")
    5537                      .dwattr $C$DW$647, DW_AT_TI_symbol_name("_rsvd_2")
    5538                      .dwattr $C$DW$647, DW_AT_data_member_location[DW_OP_plus_uconst 0x14]
    5539                      .dwattr $C$DW$647, DW_AT_accessibility(DW_ACCESS_public)
    5540              $C$DW$648       .dwtag  DW_TAG_member
    5541                      .dwattr $C$DW$648, DW_AT_type(*$C$DW$T$73)
    5542                      .dwattr $C$DW$648, DW_AT_name("GPBMUX1")
    5543                      .dwattr $C$DW$648, DW_AT_TI_symbol_name("_GPBMUX1")
    5544                      .dwattr $C$DW$648, DW_AT_data_member_location[DW_OP_plus_uconst 0x16]
    5545                      .dwattr $C$DW$648, DW_AT_accessibility(DW_ACCESS_public)
    5546              $C$DW$649       .dwtag  DW_TAG_member
    5547                      .dwattr $C$DW$649, DW_AT_type(*$C$DW$T$25)
    5548                      .dwattr $C$DW$649, DW_AT_name("rsvd_3")
    5549                      .dwattr $C$DW$649, DW_AT_TI_symbol_name("_rsvd_3")
    5550                      .dwattr $C$DW$649, DW_AT_data_member_location[DW_OP_plus_uconst 0x18]
    5551                      .dwattr $C$DW$649, DW_AT_accessibility(DW_ACCESS_public)
    5552              $C$DW$650       .dwtag  DW_TAG_member
    5553                      .dwattr $C$DW$650, DW_AT_type(*$C$DW$T$73)
    5554                      .dwattr $C$DW$650, DW_AT_name("GPBDIR")
    5555                      .dwattr $C$DW$650, DW_AT_TI_symbol_name("_GPBDIR")
    5556                      .dwattr $C$DW$650, DW_AT_data_member_location[DW_OP_plus_uconst 0x1a]
    5557                      .dwattr $C$DW$650, DW_AT_accessibility(DW_ACCESS_public)
    5558              $C$DW$651       .dwtag  DW_TAG_member
    5559                      .dwattr $C$DW$651, DW_AT_type(*$C$DW$T$73)
    5560                      .dwattr $C$DW$651, DW_AT_name("GPBPUD")
    5561                      .dwattr $C$DW$651, DW_AT_TI_symbol_name("_GPBPUD")
    5562                      .dwattr $C$DW$651, DW_AT_data_member_location[DW_OP_plus_uconst 0x1c]
    5563                      .dwattr $C$DW$651, DW_AT_accessibility(DW_ACCESS_public)
    5564              $C$DW$652       .dwtag  DW_TAG_member
    5565                      .dwattr $C$DW$652, DW_AT_type(*$C$DW$T$74)
    5566                      .dwattr $C$DW$652, DW_AT_name("rsvd_4")
    5567                      .dwattr $C$DW$652, DW_AT_TI_symbol_name("_rsvd_4")
    5568                      .dwattr $C$DW$652, DW_AT_data_member_location[DW_OP_plus_uconst 0x1e]
    5569                      .dwattr $C$DW$652, DW_AT_accessibility(DW_ACCESS_public)
    5570              $C$DW$653       .dwtag  DW_TAG_member
    5571                      .dwattr $C$DW$653, DW_AT_type(*$C$DW$T$73)
    5572                      .dwattr $C$DW$653, DW_AT_name("AIOMUX1")
    5573                      .dwattr $C$DW$653, DW_AT_TI_symbol_name("_AIOMUX1")
    5574                      .dwattr $C$DW$653, DW_AT_data_member_location[DW_OP_plus_uconst 0x36]
    5575                      .dwattr $C$DW$653, DW_AT_accessibility(DW_ACCESS_public)
    5576              $C$DW$654       .dwtag  DW_TAG_member
    5577                      .dwattr $C$DW$654, DW_AT_type(*$C$DW$T$25)
    5578                      .dwattr $C$DW$654, DW_AT_name("rsvd_5")
    5579                      .dwattr $C$DW$654, DW_AT_TI_symbol_name("_rsvd_5")
TMS320C2000 Assembler PC v6.2.5 Wed Nov 22 14:48:16 2017

Tools Copyright (c) 1996-2014 Texas Instruments Incorporated
C:\Users\wmj\AppData\Local\Temp\0222411                              PAGE  106

    5580                      .dwattr $C$DW$654, DW_AT_data_member_location[DW_OP_plus_uconst 0x38]
    5581                      .dwattr $C$DW$654, DW_AT_accessibility(DW_ACCESS_public)
    5582              $C$DW$655       .dwtag  DW_TAG_member
    5583                      .dwattr $C$DW$655, DW_AT_type(*$C$DW$T$73)
    5584                      .dwattr $C$DW$655, DW_AT_name("AIODIR")
    5585                      .dwattr $C$DW$655, DW_AT_TI_symbol_name("_AIODIR")
    5586                      .dwattr $C$DW$655, DW_AT_data_member_location[DW_OP_plus_uconst 0x3a]
    5587                      .dwattr $C$DW$655, DW_AT_accessibility(DW_ACCESS_public)
    5588              $C$DW$656       .dwtag  DW_TAG_member
    5589                      .dwattr $C$DW$656, DW_AT_type(*$C$DW$T$75)
    5590                      .dwattr $C$DW$656, DW_AT_name("rsvd_6")
    5591                      .dwattr $C$DW$656, DW_AT_TI_symbol_name("_rsvd_6")
    5592                      .dwattr $C$DW$656, DW_AT_data_member_location[DW_OP_plus_uconst 0x3c]
    5593                      .dwattr $C$DW$656, DW_AT_accessibility(DW_ACCESS_public)
    5594              $C$DW$657       .dwtag  DW_TAG_member
    5595                      .dwattr $C$DW$657, DW_AT_type(*$C$DW$T$73)
    5596                      .dwattr $C$DW$657, DW_AT_name("GPADAT")
    5597                      .dwattr $C$DW$657, DW_AT_TI_symbol_name("_GPADAT")
    5598                      .dwattr $C$DW$657, DW_AT_data_member_location[DW_OP_plus_uconst 0x40]
    5599                      .dwattr $C$DW$657, DW_AT_accessibility(DW_ACCESS_public)
    5600              $C$DW$658       .dwtag  DW_TAG_member
    5601                      .dwattr $C$DW$658, DW_AT_type(*$C$DW$T$73)
    5602                      .dwattr $C$DW$658, DW_AT_name("GPASET")
    5603                      .dwattr $C$DW$658, DW_AT_TI_symbol_name("_GPASET")
    5604                      .dwattr $C$DW$658, DW_AT_data_member_location[DW_OP_plus_uconst 0x42]
    5605                      .dwattr $C$DW$658, DW_AT_accessibility(DW_ACCESS_public)
    5606              $C$DW$659       .dwtag  DW_TAG_member
    5607                      .dwattr $C$DW$659, DW_AT_type(*$C$DW$T$73)
    5608                      .dwattr $C$DW$659, DW_AT_name("GPACLEAR")
    5609                      .dwattr $C$DW$659, DW_AT_TI_symbol_name("_GPACLEAR")
    5610                      .dwattr $C$DW$659, DW_AT_data_member_location[DW_OP_plus_uconst 0x44]
    5611                      .dwattr $C$DW$659, DW_AT_accessibility(DW_ACCESS_public)
    5612              $C$DW$660       .dwtag  DW_TAG_member
    5613                      .dwattr $C$DW$660, DW_AT_type(*$C$DW$T$73)
    5614                      .dwattr $C$DW$660, DW_AT_name("GPATOGGLE")
    5615                      .dwattr $C$DW$660, DW_AT_TI_symbol_name("_GPATOGGLE")
    5616                      .dwattr $C$DW$660, DW_AT_data_member_location[DW_OP_plus_uconst 0x46]
    5617                      .dwattr $C$DW$660, DW_AT_accessibility(DW_ACCESS_public)
    5618              $C$DW$661       .dwtag  DW_TAG_member
    5619                      .dwattr $C$DW$661, DW_AT_type(*$C$DW$T$73)
    5620                      .dwattr $C$DW$661, DW_AT_name("GPBDAT")
    5621                      .dwattr $C$DW$661, DW_AT_TI_symbol_name("_GPBDAT")
    5622                      .dwattr $C$DW$661, DW_AT_data_member_location[DW_OP_plus_uconst 0x48]
    5623                      .dwattr $C$DW$661, DW_AT_accessibility(DW_ACCESS_public)
    5624              $C$DW$662       .dwtag  DW_TAG_member
    5625                      .dwattr $C$DW$662, DW_AT_type(*$C$DW$T$73)
    5626                      .dwattr $C$DW$662, DW_AT_name("GPBSET")
    5627                      .dwattr $C$DW$662, DW_AT_TI_symbol_name("_GPBSET")
    5628                      .dwattr $C$DW$662, DW_AT_data_member_location[DW_OP_plus_uconst 0x4a]
    5629                      .dwattr $C$DW$662, DW_AT_accessibility(DW_ACCESS_public)
    5630              $C$DW$663       .dwtag  DW_TAG_member
    5631                      .dwattr $C$DW$663, DW_AT_type(*$C$DW$T$73)
    5632                      .dwattr $C$DW$663, DW_AT_name("GPBCLEAR")
    5633                      .dwattr $C$DW$663, DW_AT_TI_symbol_name("_GPBCLEAR")
    5634                      .dwattr $C$DW$663, DW_AT_data_member_location[DW_OP_plus_uconst 0x4c]
TMS320C2000 Assembler PC v6.2.5 Wed Nov 22 14:48:16 2017

Tools Copyright (c) 1996-2014 Texas Instruments Incorporated
C:\Users\wmj\AppData\Local\Temp\0222411                              PAGE  107

    5635                      .dwattr $C$DW$663, DW_AT_accessibility(DW_ACCESS_public)
    5636              $C$DW$664       .dwtag  DW_TAG_member
    5637                      .dwattr $C$DW$664, DW_AT_type(*$C$DW$T$73)
    5638                      .dwattr $C$DW$664, DW_AT_name("GPBTOGGLE")
    5639                      .dwattr $C$DW$664, DW_AT_TI_symbol_name("_GPBTOGGLE")
    5640                      .dwattr $C$DW$664, DW_AT_data_member_location[DW_OP_plus_uconst 0x4e]
    5641                      .dwattr $C$DW$664, DW_AT_accessibility(DW_ACCESS_public)
    5642              $C$DW$665       .dwtag  DW_TAG_member
    5643                      .dwattr $C$DW$665, DW_AT_type(*$C$DW$T$30)
    5644                      .dwattr $C$DW$665, DW_AT_name("rsvd_7")
    5645                      .dwattr $C$DW$665, DW_AT_TI_symbol_name("_rsvd_7")
    5646                      .dwattr $C$DW$665, DW_AT_data_member_location[DW_OP_plus_uconst 0x50]
    5647                      .dwattr $C$DW$665, DW_AT_accessibility(DW_ACCESS_public)
    5648              $C$DW$666       .dwtag  DW_TAG_member
    5649                      .dwattr $C$DW$666, DW_AT_type(*$C$DW$T$73)
    5650                      .dwattr $C$DW$666, DW_AT_name("AIODAT")
    5651                      .dwattr $C$DW$666, DW_AT_TI_symbol_name("_AIODAT")
    5652                      .dwattr $C$DW$666, DW_AT_data_member_location[DW_OP_plus_uconst 0x58]
    5653                      .dwattr $C$DW$666, DW_AT_accessibility(DW_ACCESS_public)
    5654              $C$DW$667       .dwtag  DW_TAG_member
    5655                      .dwattr $C$DW$667, DW_AT_type(*$C$DW$T$73)
    5656                      .dwattr $C$DW$667, DW_AT_name("AIOSET")
    5657                      .dwattr $C$DW$667, DW_AT_TI_symbol_name("_AIOSET")
    5658                      .dwattr $C$DW$667, DW_AT_data_member_location[DW_OP_plus_uconst 0x5a]
    5659                      .dwattr $C$DW$667, DW_AT_accessibility(DW_ACCESS_public)
    5660              $C$DW$668       .dwtag  DW_TAG_member
    5661                      .dwattr $C$DW$668, DW_AT_type(*$C$DW$T$73)
    5662                      .dwattr $C$DW$668, DW_AT_name("AIOCLEAR")
    5663                      .dwattr $C$DW$668, DW_AT_TI_symbol_name("_AIOCLEAR")
    5664                      .dwattr $C$DW$668, DW_AT_data_member_location[DW_OP_plus_uconst 0x5c]
    5665                      .dwattr $C$DW$668, DW_AT_accessibility(DW_ACCESS_public)
    5666              $C$DW$669       .dwtag  DW_TAG_member
    5667                      .dwattr $C$DW$669, DW_AT_type(*$C$DW$T$73)
    5668                      .dwattr $C$DW$669, DW_AT_name("AIOTOGGLE")
    5669                      .dwattr $C$DW$669, DW_AT_TI_symbol_name("_AIOTOGGLE")
    5670                      .dwattr $C$DW$669, DW_AT_data_member_location[DW_OP_plus_uconst 0x5e]
    5671                      .dwattr $C$DW$669, DW_AT_accessibility(DW_ACCESS_public)
    5672              $C$DW$670       .dwtag  DW_TAG_member
    5673                      .dwattr $C$DW$670, DW_AT_type(*$C$DW$T$27)
    5674                      .dwattr $C$DW$670, DW_AT_name("GPIOXINTnSEL")
    5675                      .dwattr $C$DW$670, DW_AT_TI_symbol_name("_GPIOXINTnSEL")
    5676                      .dwattr $C$DW$670, DW_AT_data_member_location[DW_OP_plus_uconst 0x60]
    5677                      .dwattr $C$DW$670, DW_AT_accessibility(DW_ACCESS_public)
    5678              $C$DW$671       .dwtag  DW_TAG_member
    5679                      .dwattr $C$DW$671, DW_AT_type(*$C$DW$T$26)
    5680                      .dwattr $C$DW$671, DW_AT_name("rsvd_8")
    5681                      .dwattr $C$DW$671, DW_AT_TI_symbol_name("_rsvd_8")
    5682                      .dwattr $C$DW$671, DW_AT_data_member_location[DW_OP_plus_uconst 0x63]
    5683                      .dwattr $C$DW$671, DW_AT_accessibility(DW_ACCESS_public)
    5684              $C$DW$672       .dwtag  DW_TAG_member
    5685                      .dwattr $C$DW$672, DW_AT_type(*$C$DW$T$73)
    5686                      .dwattr $C$DW$672, DW_AT_name("GPIOLPMSEL")
    5687                      .dwattr $C$DW$672, DW_AT_TI_symbol_name("_GPIOLPMSEL")
    5688                      .dwattr $C$DW$672, DW_AT_data_member_location[DW_OP_plus_uconst 0x68]
    5689                      .dwattr $C$DW$672, DW_AT_accessibility(DW_ACCESS_public)
TMS320C2000 Assembler PC v6.2.5 Wed Nov 22 14:48:16 2017

Tools Copyright (c) 1996-2014 Texas Instruments Incorporated
C:\Users\wmj\AppData\Local\Temp\0222411                              PAGE  108

    5690                      .dwendtag $C$DW$T$76
    5691              
    5692              $C$DW$T$87      .dwtag  DW_TAG_pointer_type
    5693                      .dwattr $C$DW$T$87, DW_AT_type(*$C$DW$T$76)
    5694                      .dwattr $C$DW$T$87, DW_AT_address_class(0x16)
    5695              $C$DW$T$88      .dwtag  DW_TAG_typedef, DW_AT_name("GPIO_Handle")
    5696                      .dwattr $C$DW$T$88, DW_AT_type(*$C$DW$T$87)
    5697                      .dwattr $C$DW$T$88, DW_AT_language(DW_LANG_C)
    5698              $C$DW$673       .dwtag  DW_TAG_TI_far_type
    5699                      .dwattr $C$DW$673, DW_AT_type(*$C$DW$T$88)
    5700              $C$DW$T$197     .dwtag  DW_TAG_const_type
    5701                      .dwattr $C$DW$T$197, DW_AT_type(*$C$DW$673)
    5702              
    5703              $C$DW$T$78      .dwtag  DW_TAG_structure_type
    5704                      .dwattr $C$DW$T$78, DW_AT_name("_HAL_AdcData_t_")
    5705                      .dwattr $C$DW$T$78, DW_AT_byte_size(0x16)
    5706              $C$DW$674       .dwtag  DW_TAG_member
    5707                      .dwattr $C$DW$674, DW_AT_type(*$C$DW$T$77)
    5708                      .dwattr $C$DW$674, DW_AT_name("I")
    5709                      .dwattr $C$DW$674, DW_AT_TI_symbol_name("_I")
    5710                      .dwattr $C$DW$674, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    5711                      .dwattr $C$DW$674, DW_AT_accessibility(DW_ACCESS_public)
    5712              $C$DW$675       .dwtag  DW_TAG_member
    5713                      .dwattr $C$DW$675, DW_AT_type(*$C$DW$T$77)
    5714                      .dwattr $C$DW$675, DW_AT_name("V")
    5715                      .dwattr $C$DW$675, DW_AT_TI_symbol_name("_V")
    5716                      .dwattr $C$DW$675, DW_AT_data_member_location[DW_OP_plus_uconst 0x6]
    5717                      .dwattr $C$DW$675, DW_AT_accessibility(DW_ACCESS_public)
    5718              $C$DW$676       .dwtag  DW_TAG_member
    5719                      .dwattr $C$DW$676, DW_AT_type(*$C$DW$T$37)
    5720                      .dwattr $C$DW$676, DW_AT_name("dcBus")
    5721                      .dwattr $C$DW$676, DW_AT_TI_symbol_name("_dcBus")
    5722                      .dwattr $C$DW$676, DW_AT_data_member_location[DW_OP_plus_uconst 0xc]
    5723                      .dwattr $C$DW$676, DW_AT_accessibility(DW_ACCESS_public)
    5724              $C$DW$677       .dwtag  DW_TAG_member
    5725                      .dwattr $C$DW$677, DW_AT_type(*$C$DW$T$37)
    5726                      .dwattr $C$DW$677, DW_AT_name("analogSensor1")
    5727                      .dwattr $C$DW$677, DW_AT_TI_symbol_name("_analogSensor1")
    5728                      .dwattr $C$DW$677, DW_AT_data_member_location[DW_OP_plus_uconst 0xe]
    5729                      .dwattr $C$DW$677, DW_AT_accessibility(DW_ACCESS_public)
    5730              $C$DW$678       .dwtag  DW_TAG_member
    5731                      .dwattr $C$DW$678, DW_AT_type(*$C$DW$T$37)
    5732                      .dwattr $C$DW$678, DW_AT_name("analogSensor2")
    5733                      .dwattr $C$DW$678, DW_AT_TI_symbol_name("_analogSensor2")
    5734                      .dwattr $C$DW$678, DW_AT_data_member_location[DW_OP_plus_uconst 0x10]
    5735                      .dwattr $C$DW$678, DW_AT_accessibility(DW_ACCESS_public)
    5736              $C$DW$679       .dwtag  DW_TAG_member
    5737                      .dwattr $C$DW$679, DW_AT_type(*$C$DW$T$37)
    5738                      .dwattr $C$DW$679, DW_AT_name("igbtNTC")
    5739                      .dwattr $C$DW$679, DW_AT_TI_symbol_name("_igbtNTC")
    5740                      .dwattr $C$DW$679, DW_AT_data_member_location[DW_OP_plus_uconst 0x12]
    5741                      .dwattr $C$DW$679, DW_AT_accessibility(DW_ACCESS_public)
    5742              $C$DW$680       .dwtag  DW_TAG_member
    5743                      .dwattr $C$DW$680, DW_AT_type(*$C$DW$T$37)
    5744                      .dwattr $C$DW$680, DW_AT_name("boardAddr")
TMS320C2000 Assembler PC v6.2.5 Wed Nov 22 14:48:16 2017

Tools Copyright (c) 1996-2014 Texas Instruments Incorporated
C:\Users\wmj\AppData\Local\Temp\0222411                              PAGE  109

    5745                      .dwattr $C$DW$680, DW_AT_TI_symbol_name("_boardAddr")
    5746                      .dwattr $C$DW$680, DW_AT_data_member_location[DW_OP_plus_uconst 0x14]
    5747                      .dwattr $C$DW$680, DW_AT_accessibility(DW_ACCESS_public)
    5748                      .dwendtag $C$DW$T$78
    5749              
    5750              $C$DW$T$114     .dwtag  DW_TAG_typedef, DW_AT_name("HAL_AdcData_t")
    5751                      .dwattr $C$DW$T$114, DW_AT_type(*$C$DW$T$78)
    5752                      .dwattr $C$DW$T$114, DW_AT_language(DW_LANG_C)
    5753              
    5754              $C$DW$T$117     .dwtag  DW_TAG_structure_type
    5755                      .dwattr $C$DW$T$117, DW_AT_name("_HAL_Obj_")
    5756                      .dwattr $C$DW$T$117, DW_AT_byte_size(0xb4)
    5757              $C$DW$681       .dwtag  DW_TAG_member
    5758                      .dwattr $C$DW$681, DW_AT_type(*$C$DW$T$80)
    5759                      .dwattr $C$DW$681, DW_AT_name("adcHandle")
    5760                      .dwattr $C$DW$681, DW_AT_TI_symbol_name("_adcHandle")
    5761                      .dwattr $C$DW$681, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    5762                      .dwattr $C$DW$681, DW_AT_accessibility(DW_ACCESS_public)
    5763              $C$DW$682       .dwtag  DW_TAG_member
    5764                      .dwattr $C$DW$682, DW_AT_type(*$C$DW$T$82)
    5765                      .dwattr $C$DW$682, DW_AT_name("clkHandle")
    5766                      .dwattr $C$DW$682, DW_AT_TI_symbol_name("_clkHandle")
    5767                      .dwattr $C$DW$682, DW_AT_data_member_location[DW_OP_plus_uconst 0x2]
    5768                      .dwattr $C$DW$682, DW_AT_accessibility(DW_ACCESS_public)
    5769              $C$DW$683       .dwtag  DW_TAG_member
    5770                      .dwattr $C$DW$683, DW_AT_type(*$C$DW$T$84)
    5771                      .dwattr $C$DW$683, DW_AT_name("cpuHandle")
    5772                      .dwattr $C$DW$683, DW_AT_TI_symbol_name("_cpuHandle")
    5773                      .dwattr $C$DW$683, DW_AT_data_member_location[DW_OP_plus_uconst 0x4]
    5774                      .dwattr $C$DW$683, DW_AT_accessibility(DW_ACCESS_public)
    5775              $C$DW$684       .dwtag  DW_TAG_member
    5776                      .dwattr $C$DW$684, DW_AT_type(*$C$DW$T$86)
    5777                      .dwattr $C$DW$684, DW_AT_name("flashHandle")
    5778                      .dwattr $C$DW$684, DW_AT_TI_symbol_name("_flashHandle")
    5779                      .dwattr $C$DW$684, DW_AT_data_member_location[DW_OP_plus_uconst 0x6]
    5780                      .dwattr $C$DW$684, DW_AT_accessibility(DW_ACCESS_public)
    5781              $C$DW$685       .dwtag  DW_TAG_member
    5782                      .dwattr $C$DW$685, DW_AT_type(*$C$DW$T$88)
    5783                      .dwattr $C$DW$685, DW_AT_name("gpioHandle")
    5784                      .dwattr $C$DW$685, DW_AT_TI_symbol_name("_gpioHandle")
    5785                      .dwattr $C$DW$685, DW_AT_data_member_location[DW_OP_plus_uconst 0x8]
    5786                      .dwattr $C$DW$685, DW_AT_accessibility(DW_ACCESS_public)
    5787              $C$DW$686       .dwtag  DW_TAG_member
    5788                      .dwattr $C$DW$686, DW_AT_type(*$C$DW$T$91)
    5789                      .dwattr $C$DW$686, DW_AT_name("offsetHandle_I")
    5790                      .dwattr $C$DW$686, DW_AT_TI_symbol_name("_offsetHandle_I")
    5791                      .dwattr $C$DW$686, DW_AT_data_member_location[DW_OP_plus_uconst 0xa]
    5792                      .dwattr $C$DW$686, DW_AT_accessibility(DW_ACCESS_public)
    5793              $C$DW$687       .dwtag  DW_TAG_member
    5794                      .dwattr $C$DW$687, DW_AT_type(*$C$DW$T$93)
    5795                      .dwattr $C$DW$687, DW_AT_name("offset_I")
    5796                      .dwattr $C$DW$687, DW_AT_TI_symbol_name("_offset_I")
    5797                      .dwattr $C$DW$687, DW_AT_data_member_location[DW_OP_plus_uconst 0x10]
    5798                      .dwattr $C$DW$687, DW_AT_accessibility(DW_ACCESS_public)
    5799              $C$DW$688       .dwtag  DW_TAG_member
TMS320C2000 Assembler PC v6.2.5 Wed Nov 22 14:48:16 2017

Tools Copyright (c) 1996-2014 Texas Instruments Incorporated
C:\Users\wmj\AppData\Local\Temp\0222411                              PAGE  110

    5800                      .dwattr $C$DW$688, DW_AT_type(*$C$DW$T$91)
    5801                      .dwattr $C$DW$688, DW_AT_name("offsetHandle_V")
    5802                      .dwattr $C$DW$688, DW_AT_TI_symbol_name("_offsetHandle_V")
    5803                      .dwattr $C$DW$688, DW_AT_data_member_location[DW_OP_plus_uconst 0x40]
    5804                      .dwattr $C$DW$688, DW_AT_accessibility(DW_ACCESS_public)
    5805              $C$DW$689       .dwtag  DW_TAG_member
    5806                      .dwattr $C$DW$689, DW_AT_type(*$C$DW$T$93)
    5807                      .dwattr $C$DW$689, DW_AT_name("offset_V")
    5808                      .dwattr $C$DW$689, DW_AT_TI_symbol_name("_offset_V")
    5809                      .dwattr $C$DW$689, DW_AT_data_member_location[DW_OP_plus_uconst 0x46]
    5810                      .dwattr $C$DW$689, DW_AT_accessibility(DW_ACCESS_public)
    5811              $C$DW$690       .dwtag  DW_TAG_member
    5812                      .dwattr $C$DW$690, DW_AT_type(*$C$DW$T$95)
    5813                      .dwattr $C$DW$690, DW_AT_name("oscHandle")
    5814                      .dwattr $C$DW$690, DW_AT_TI_symbol_name("_oscHandle")
    5815                      .dwattr $C$DW$690, DW_AT_data_member_location[DW_OP_plus_uconst 0x76]
    5816                      .dwattr $C$DW$690, DW_AT_accessibility(DW_ACCESS_public)
    5817              $C$DW$691       .dwtag  DW_TAG_member
    5818                      .dwattr $C$DW$691, DW_AT_type(*$C$DW$T$97)
    5819                      .dwattr $C$DW$691, DW_AT_name("pieHandle")
    5820                      .dwattr $C$DW$691, DW_AT_TI_symbol_name("_pieHandle")
    5821                      .dwattr $C$DW$691, DW_AT_data_member_location[DW_OP_plus_uconst 0x78]
    5822                      .dwattr $C$DW$691, DW_AT_accessibility(DW_ACCESS_public)
    5823              $C$DW$692       .dwtag  DW_TAG_member
    5824                      .dwattr $C$DW$692, DW_AT_type(*$C$DW$T$99)
    5825                      .dwattr $C$DW$692, DW_AT_name("pllHandle")
    5826                      .dwattr $C$DW$692, DW_AT_TI_symbol_name("_pllHandle")
    5827                      .dwattr $C$DW$692, DW_AT_data_member_location[DW_OP_plus_uconst 0x7a]
    5828                      .dwattr $C$DW$692, DW_AT_accessibility(DW_ACCESS_public)
    5829              $C$DW$693       .dwtag  DW_TAG_member
    5830                      .dwattr $C$DW$693, DW_AT_type(*$C$DW$T$102)
    5831                      .dwattr $C$DW$693, DW_AT_name("pwmHandle")
    5832                      .dwattr $C$DW$693, DW_AT_TI_symbol_name("_pwmHandle")
    5833                      .dwattr $C$DW$693, DW_AT_data_member_location[DW_OP_plus_uconst 0x7c]
    5834                      .dwattr $C$DW$693, DW_AT_accessibility(DW_ACCESS_public)
    5835              $C$DW$694       .dwtag  DW_TAG_member
    5836                      .dwattr $C$DW$694, DW_AT_type(*$C$DW$T$102)
    5837                      .dwattr $C$DW$694, DW_AT_name("pwmDacHandle")
    5838                      .dwattr $C$DW$694, DW_AT_TI_symbol_name("_pwmDacHandle")
    5839                      .dwattr $C$DW$694, DW_AT_data_member_location[DW_OP_plus_uconst 0x82]
    5840                      .dwattr $C$DW$694, DW_AT_accessibility(DW_ACCESS_public)
    5841              $C$DW$695       .dwtag  DW_TAG_member
    5842                      .dwattr $C$DW$695, DW_AT_type(*$C$DW$T$104)
    5843                      .dwattr $C$DW$695, DW_AT_name("pwrHandle")
    5844                      .dwattr $C$DW$695, DW_AT_TI_symbol_name("_pwrHandle")
    5845                      .dwattr $C$DW$695, DW_AT_data_member_location[DW_OP_plus_uconst 0x88]
    5846                      .dwattr $C$DW$695, DW_AT_accessibility(DW_ACCESS_public)
    5847              $C$DW$696       .dwtag  DW_TAG_member
    5848                      .dwattr $C$DW$696, DW_AT_type(*$C$DW$T$107)
    5849                      .dwattr $C$DW$696, DW_AT_name("timerHandle")
    5850                      .dwattr $C$DW$696, DW_AT_TI_symbol_name("_timerHandle")
    5851                      .dwattr $C$DW$696, DW_AT_data_member_location[DW_OP_plus_uconst 0x8a]
    5852                      .dwattr $C$DW$696, DW_AT_accessibility(DW_ACCESS_public)
    5853              $C$DW$697       .dwtag  DW_TAG_member
    5854                      .dwattr $C$DW$697, DW_AT_type(*$C$DW$T$109)
TMS320C2000 Assembler PC v6.2.5 Wed Nov 22 14:48:16 2017

Tools Copyright (c) 1996-2014 Texas Instruments Incorporated
C:\Users\wmj\AppData\Local\Temp\0222411                              PAGE  111

    5855                      .dwattr $C$DW$697, DW_AT_name("spiAHandle")
    5856                      .dwattr $C$DW$697, DW_AT_TI_symbol_name("_spiAHandle")
    5857                      .dwattr $C$DW$697, DW_AT_data_member_location[DW_OP_plus_uconst 0x90]
    5858                      .dwattr $C$DW$697, DW_AT_accessibility(DW_ACCESS_public)
    5859              $C$DW$698       .dwtag  DW_TAG_member
    5860                      .dwattr $C$DW$698, DW_AT_type(*$C$DW$T$111)
    5861                      .dwattr $C$DW$698, DW_AT_name("wdogHandle")
    5862                      .dwattr $C$DW$698, DW_AT_TI_symbol_name("_wdogHandle")
    5863                      .dwattr $C$DW$698, DW_AT_data_member_location[DW_OP_plus_uconst 0x92]
    5864                      .dwattr $C$DW$698, DW_AT_accessibility(DW_ACCESS_public)
    5865              $C$DW$699       .dwtag  DW_TAG_member
    5866                      .dwattr $C$DW$699, DW_AT_type(*$C$DW$T$113)
    5867                      .dwattr $C$DW$699, DW_AT_name("sciHandle")
    5868                      .dwattr $C$DW$699, DW_AT_TI_symbol_name("_sciHandle")
    5869                      .dwattr $C$DW$699, DW_AT_data_member_location[DW_OP_plus_uconst 0x94]
    5870                      .dwattr $C$DW$699, DW_AT_accessibility(DW_ACCESS_public)
    5871              $C$DW$700       .dwtag  DW_TAG_member
    5872                      .dwattr $C$DW$700, DW_AT_type(*$C$DW$T$114)
    5873                      .dwattr $C$DW$700, DW_AT_name("adcBias")
    5874                      .dwattr $C$DW$700, DW_AT_TI_symbol_name("_adcBias")
    5875                      .dwattr $C$DW$700, DW_AT_data_member_location[DW_OP_plus_uconst 0x96]
    5876                      .dwattr $C$DW$700, DW_AT_accessibility(DW_ACCESS_public)
    5877              $C$DW$701       .dwtag  DW_TAG_member
    5878                      .dwattr $C$DW$701, DW_AT_type(*$C$DW$T$37)
    5879                      .dwattr $C$DW$701, DW_AT_name("current_sf")
    5880                      .dwattr $C$DW$701, DW_AT_TI_symbol_name("_current_sf")
    5881                      .dwattr $C$DW$701, DW_AT_data_member_location[DW_OP_plus_uconst 0xac]
    5882                      .dwattr $C$DW$701, DW_AT_accessibility(DW_ACCESS_public)
    5883              $C$DW$702       .dwtag  DW_TAG_member
    5884                      .dwattr $C$DW$702, DW_AT_type(*$C$DW$T$37)
    5885                      .dwattr $C$DW$702, DW_AT_name("voltage_sf")
    5886                      .dwattr $C$DW$702, DW_AT_TI_symbol_name("_voltage_sf")
    5887                      .dwattr $C$DW$702, DW_AT_data_member_location[DW_OP_plus_uconst 0xae]
    5888                      .dwattr $C$DW$702, DW_AT_accessibility(DW_ACCESS_public)
    5889              $C$DW$703       .dwtag  DW_TAG_member
    5890                      .dwattr $C$DW$703, DW_AT_type(*$C$DW$T$32)
    5891                      .dwattr $C$DW$703, DW_AT_name("numCurrentSensors")
    5892                      .dwattr $C$DW$703, DW_AT_TI_symbol_name("_numCurrentSensors")
    5893                      .dwattr $C$DW$703, DW_AT_data_member_location[DW_OP_plus_uconst 0xb0]
    5894                      .dwattr $C$DW$703, DW_AT_accessibility(DW_ACCESS_public)
    5895              $C$DW$704       .dwtag  DW_TAG_member
    5896                      .dwattr $C$DW$704, DW_AT_type(*$C$DW$T$32)
    5897                      .dwattr $C$DW$704, DW_AT_name("numVoltageSensors")
    5898                      .dwattr $C$DW$704, DW_AT_TI_symbol_name("_numVoltageSensors")
    5899                      .dwattr $C$DW$704, DW_AT_data_member_location[DW_OP_plus_uconst 0xb1]
    5900                      .dwattr $C$DW$704, DW_AT_accessibility(DW_ACCESS_public)
    5901              $C$DW$705       .dwtag  DW_TAG_member
    5902                      .dwattr $C$DW$705, DW_AT_type(*$C$DW$T$116)
    5903                      .dwattr $C$DW$705, DW_AT_name("boardAddress")
    5904                      .dwattr $C$DW$705, DW_AT_TI_symbol_name("_boardAddress")
    5905                      .dwattr $C$DW$705, DW_AT_data_member_location[DW_OP_plus_uconst 0xb2]
    5906                      .dwattr $C$DW$705, DW_AT_accessibility(DW_ACCESS_public)
    5907                      .dwendtag $C$DW$T$117
    5908              
    5909              $C$DW$T$42      .dwtag  DW_TAG_pointer_type
TMS320C2000 Assembler PC v6.2.5 Wed Nov 22 14:48:16 2017

Tools Copyright (c) 1996-2014 Texas Instruments Incorporated
C:\Users\wmj\AppData\Local\Temp\0222411                              PAGE  112

    5910                      .dwattr $C$DW$T$42, DW_AT_type(*$C$DW$T$117)
    5911                      .dwattr $C$DW$T$42, DW_AT_address_class(0x16)
    5912              $C$DW$T$43      .dwtag  DW_TAG_typedef, DW_AT_name("HAL_Handle")
    5913                      .dwattr $C$DW$T$43, DW_AT_type(*$C$DW$T$42)
    5914                      .dwattr $C$DW$T$43, DW_AT_language(DW_LANG_C)
    5915              
    5916              $C$DW$T$119     .dwtag  DW_TAG_structure_type
    5917                      .dwattr $C$DW$T$119, DW_AT_name("_MATH_vec3_")
    5918                      .dwattr $C$DW$T$119, DW_AT_byte_size(0x06)
    5919              $C$DW$706       .dwtag  DW_TAG_member
    5920                      .dwattr $C$DW$706, DW_AT_type(*$C$DW$T$118)
    5921                      .dwattr $C$DW$706, DW_AT_name("value")
    5922                      .dwattr $C$DW$706, DW_AT_TI_symbol_name("_value")
    5923                      .dwattr $C$DW$706, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    5924                      .dwattr $C$DW$706, DW_AT_accessibility(DW_ACCESS_public)
    5925                      .dwendtag $C$DW$T$119
