TMS320C2000 Assembler PC v6.2.5 Tue Nov 21 22:57:44 2017

Tools Copyright (c) 1996-2014 Texas Instruments Incorporated
C:\Users\wmj\AppData\Local\Temp\0853211                              PAGE    1

       1              ;***************************************************************
       2              ;* TMS320C2000 C/C++ Codegen                         PC v6.2.5 *
       3              ;* Date/Time created: Tue Nov 21 22:57:43 2017                 *
       4              ;***************************************************************
       5                      .compiler_opts --float_support=softlib --hll_source=on --mem_model:code=flat --mem_model:data=large -
       6        0002  FP      .set    XAR2
       7              
       8              $C$DW$CU        .dwtag  DW_TAG_compile_unit
       9                      .dwattr $C$DW$CU, DW_AT_name("D:/BM1000_v1.1/sw/drivers/drvic/modbus/mb.c")
      10                      .dwattr $C$DW$CU, DW_AT_producer("TMS320C2000 C/C++ Codegen PC v6.2.5 Copyright (c) 1996-2014 Texas I
      11                      .dwattr $C$DW$CU, DW_AT_TI_version(0x01)
      12                      .dwattr $C$DW$CU, DW_AT_comp_dir("D:\BM1000_v1.1\sw\solutions\instaspin_foc\boards\hvkit_rev1p1\f28x\
      13              
      14              $C$DW$1 .dwtag  DW_TAG_subprogram, DW_AT_name("FSM_clrOverCurrentReg")
      15                      .dwattr $C$DW$1, DW_AT_TI_symbol_name("_FSM_clrOverCurrentReg")

    4539              $C$DW$487       .dwtag  DW_TAG_enumerator, DW_AT_name("GPIO_Number_1"), DW_AT_const_value(0x01)
    4540              $C$DW$488       .dwtag  DW_TAG_enumerator, DW_AT_name("GPIO_Number_2"), DW_AT_const_value(0x02)
    4541              $C$DW$489       .dwtag  DW_TAG_enumerator, DW_AT_name("GPIO_Number_3"), DW_AT_const_value(0x03)
    4542              $C$DW$490       .dwtag  DW_TAG_enumerator, DW_AT_name("GPIO_Number_4"), DW_AT_const_value(0x04)
    4543              $C$DW$491       .dwtag  DW_TAG_enumerator, DW_AT_name("GPIO_Number_5"), DW_AT_const_value(0x05)
    4544              $C$DW$492       .dwtag  DW_TAG_enumerator, DW_AT_name("GPIO_Number_6"), DW_AT_const_value(0x06)
    4545              $C$DW$493       .dwtag  DW_TAG_enumerator, DW_AT_name("GPIO_Number_7"), DW_AT_const_value(0x07)
    4546              $C$DW$494       .dwtag  DW_TAG_enumerator, DW_AT_name("GPIO_Rsvd_8"), DW_AT_const_value(0x08)
    4547              $C$DW$495       .dwtag  DW_TAG_enumerator, DW_AT_name("GPIO_Rsvd_9"), DW_AT_const_value(0x09)
    4548              $C$DW$496       .dwtag  DW_TAG_enumerator, DW_AT_name("GPIO_Rsvd_10"), DW_AT_const_value(0x0a)
    4549              $C$DW$497       .dwtag  DW_TAG_enumerator, DW_AT_name("GPIO_Rsvd_11"), DW_AT_const_value(0x0b)
TMS320C2000 Assembler PC v6.2.5 Tue Nov 21 22:57:44 2017

Tools Copyright (c) 1996-2014 Texas Instruments Incorporated
C:\Users\wmj\AppData\Local\Temp\0853211                              PAGE   87

    4550              $C$DW$498       .dwtag  DW_TAG_enumerator, DW_AT_name("GPIO_Number_12"), DW_AT_const_value(0x0c)
    4551              $C$DW$499       .dwtag  DW_TAG_enumerator, DW_AT_name("GPIO_Rsvd_13"), DW_AT_const_value(0x0d)
    4552              $C$DW$500       .dwtag  DW_TAG_enumerator, DW_AT_name("GPIO_Rsvd_14"), DW_AT_const_value(0x0e)
    4553              $C$DW$501       .dwtag  DW_TAG_enumerator, DW_AT_name("GPIO_Rsvd_15"), DW_AT_const_value(0x0f)
    4554              $C$DW$502       .dwtag  DW_TAG_enumerator, DW_AT_name("GPIO_Number_16"), DW_AT_const_value(0x10)
    4555              $C$DW$503       .dwtag  DW_TAG_enumerator, DW_AT_name("GPIO_Number_17"), DW_AT_const_value(0x11)
    4556              $C$DW$504       .dwtag  DW_TAG_enumerator, DW_AT_name("GPIO_Number_18"), DW_AT_const_value(0x12)
    4557              $C$DW$505       .dwtag  DW_TAG_enumerator, DW_AT_name("GPIO_Number_19"), DW_AT_const_value(0x13)
    4558              $C$DW$506       .dwtag  DW_TAG_enumerator, DW_AT_name("GPIO_Rsvd_20"), DW_AT_const_value(0x14)
    4559              $C$DW$507       .dwtag  DW_TAG_enumerator, DW_AT_name("GPIO_Rsvd_21"), DW_AT_const_value(0x15)
    4560              $C$DW$508       .dwtag  DW_TAG_enumerator, DW_AT_name("GPIO_Rsvd_22"), DW_AT_const_value(0x16)
    4561              $C$DW$509       .dwtag  DW_TAG_enumerator, DW_AT_name("GPIO_Rsvd_23"), DW_AT_const_value(0x17)
    4562              $C$DW$510       .dwtag  DW_TAG_enumerator, DW_AT_name("GPIO_Rsvd_24"), DW_AT_const_value(0x18)
    4563              $C$DW$511       .dwtag  DW_TAG_enumerator, DW_AT_name("GPIO_Rsvd_25"), DW_AT_const_value(0x19)
    4564              $C$DW$512       .dwtag  DW_TAG_enumerator, DW_AT_name("GPIO_Rsvd_26"), DW_AT_const_value(0x1a)
    4565              $C$DW$513       .dwtag  DW_TAG_enumerator, DW_AT_name("GPIO_Rsvd_27"), DW_AT_const_value(0x1b)
    4566              $C$DW$514       .dwtag  DW_TAG_enumerator, DW_AT_name("GPIO_Number_28"), DW_AT_const_value(0x1c)
    4567              $C$DW$515       .dwtag  DW_TAG_enumerator, DW_AT_name("GPIO_Number_29"), DW_AT_const_value(0x1d)
    4568              $C$DW$516       .dwtag  DW_TAG_enumerator, DW_AT_name("GPIO_Rsvd_30"), DW_AT_const_value(0x1e)
    4569              $C$DW$517       .dwtag  DW_TAG_enumerator, DW_AT_name("GPIO_Rsvd_31"), DW_AT_const_value(0x1f)
    4570              $C$DW$518       .dwtag  DW_TAG_enumerator, DW_AT_name("GPIO_Number_32"), DW_AT_const_value(0x20)
    4571              $C$DW$519       .dwtag  DW_TAG_enumerator, DW_AT_name("GPIO_Number_33"), DW_AT_const_value(0x21)
    4572              $C$DW$520       .dwtag  DW_TAG_enumerator, DW_AT_name("GPIO_Number_34"), DW_AT_const_value(0x22)
    4573              $C$DW$521       .dwtag  DW_TAG_enumerator, DW_AT_name("GPIO_Number_35"), DW_AT_const_value(0x23)
    4574              $C$DW$522       .dwtag  DW_TAG_enumerator, DW_AT_name("GPIO_Number_36"), DW_AT_const_value(0x24)
    4575              $C$DW$523       .dwtag  DW_TAG_enumerator, DW_AT_name("GPIO_Number_37"), DW_AT_const_value(0x25)
    4576              $C$DW$524       .dwtag  DW_TAG_enumerator, DW_AT_name("GPIO_Number_38"), DW_AT_const_value(0x26)
    4577              $C$DW$525       .dwtag  DW_TAG_enumerator, DW_AT_name("GPIO_numGpios"), DW_AT_const_value(0x27)
    4578                      .dwendtag $C$DW$T$190
    4579              
    4580              $C$DW$T$191     .dwtag  DW_TAG_typedef, DW_AT_name("GPIO_Number_e")
    4581                      .dwattr $C$DW$T$191, DW_AT_type(*$C$DW$T$190)
    4582                      .dwattr $C$DW$T$191, DW_AT_language(DW_LANG_C)
    4583              $C$DW$526       .dwtag  DW_TAG_TI_far_type
    4584                      .dwattr $C$DW$526, DW_AT_type(*$C$DW$T$191)
    4585              $C$DW$T$192     .dwtag  DW_TAG_const_type
    4586                      .dwattr $C$DW$T$192, DW_AT_type(*$C$DW$526)
    4587              
    4588              $C$DW$T$29      .dwtag  DW_TAG_structure_type
    4589                      .dwattr $C$DW$T$29, DW_AT_name("_ADC_Obj_")
    4590                      .dwattr $C$DW$T$29, DW_AT_byte_size(0x6650)
    4591              $C$DW$527       .dwtag  DW_TAG_member
    4592                      .dwattr $C$DW$527, DW_AT_type(*$C$DW$T$23)
    4593                      .dwattr $C$DW$527, DW_AT_name("ADCRESULT")
    4594                      .dwattr $C$DW$527, DW_AT_TI_symbol_name("_ADCRESULT")
    4595                      .dwattr $C$DW$527, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    4596                      .dwattr $C$DW$527, DW_AT_accessibility(DW_ACCESS_public)
    4597              $C$DW$528       .dwtag  DW_TAG_member
    4598                      .dwattr $C$DW$528, DW_AT_type(*$C$DW$T$24)
    4599                      .dwattr $C$DW$528, DW_AT_name("resvd_1")
    4600                      .dwattr $C$DW$528, DW_AT_TI_symbol_name("_resvd_1")
    4601                      .dwattr $C$DW$528, DW_AT_data_member_location[DW_OP_plus_uconst 0x10]
    4602                      .dwattr $C$DW$528, DW_AT_accessibility(DW_ACCESS_public)
    4603              $C$DW$529       .dwtag  DW_TAG_member
    4604                      .dwattr $C$DW$529, DW_AT_type(*$C$DW$T$22)
TMS320C2000 Assembler PC v6.2.5 Tue Nov 21 22:57:44 2017

Tools Copyright (c) 1996-2014 Texas Instruments Incorporated
C:\Users\wmj\AppData\Local\Temp\0853211                              PAGE   88

    4605                      .dwattr $C$DW$529, DW_AT_name("ADCCTL1")
    4606                      .dwattr $C$DW$529, DW_AT_TI_symbol_name("_ADCCTL1")
    4607                      .dwattr $C$DW$529, DW_AT_data_member_location[DW_OP_plus_uconst 0x6600]
    4608                      .dwattr $C$DW$529, DW_AT_accessibility(DW_ACCESS_public)
    4609              $C$DW$530       .dwtag  DW_TAG_member
    4610                      .dwattr $C$DW$530, DW_AT_type(*$C$DW$T$22)
    4611                      .dwattr $C$DW$530, DW_AT_name("ADCCTL2")
    4612                      .dwattr $C$DW$530, DW_AT_TI_symbol_name("_ADCCTL2")
    4613                      .dwattr $C$DW$530, DW_AT_data_member_location[DW_OP_plus_uconst 0x6601]
    4614                      .dwattr $C$DW$530, DW_AT_accessibility(DW_ACCESS_public)
    4615              $C$DW$531       .dwtag  DW_TAG_member
    4616                      .dwattr $C$DW$531, DW_AT_type(*$C$DW$T$25)
    4617                      .dwattr $C$DW$531, DW_AT_name("rsvd_2")
    4618                      .dwattr $C$DW$531, DW_AT_TI_symbol_name("_rsvd_2")
    4619                      .dwattr $C$DW$531, DW_AT_data_member_location[DW_OP_plus_uconst 0x6602]
    4620                      .dwattr $C$DW$531, DW_AT_accessibility(DW_ACCESS_public)
    4621              $C$DW$532       .dwtag  DW_TAG_member
    4622                      .dwattr $C$DW$532, DW_AT_type(*$C$DW$T$22)
    4623                      .dwattr $C$DW$532, DW_AT_name("ADCINTFLG")
    4624                      .dwattr $C$DW$532, DW_AT_TI_symbol_name("_ADCINTFLG")
    4625                      .dwattr $C$DW$532, DW_AT_data_member_location[DW_OP_plus_uconst 0x6604]
    4626                      .dwattr $C$DW$532, DW_AT_accessibility(DW_ACCESS_public)
    4627              $C$DW$533       .dwtag  DW_TAG_member
    4628                      .dwattr $C$DW$533, DW_AT_type(*$C$DW$T$22)
    4629                      .dwattr $C$DW$533, DW_AT_name("ADCINTFLGCLR")
    4630                      .dwattr $C$DW$533, DW_AT_TI_symbol_name("_ADCINTFLGCLR")
    4631                      .dwattr $C$DW$533, DW_AT_data_member_location[DW_OP_plus_uconst 0x6605]
    4632                      .dwattr $C$DW$533, DW_AT_accessibility(DW_ACCESS_public)
    4633              $C$DW$534       .dwtag  DW_TAG_member
    4634                      .dwattr $C$DW$534, DW_AT_type(*$C$DW$T$22)
    4635                      .dwattr $C$DW$534, DW_AT_name("ADCINTOVF")
    4636                      .dwattr $C$DW$534, DW_AT_TI_symbol_name("_ADCINTOVF")
    4637                      .dwattr $C$DW$534, DW_AT_data_member_location[DW_OP_plus_uconst 0x6606]
    4638                      .dwattr $C$DW$534, DW_AT_accessibility(DW_ACCESS_public)
    4639              $C$DW$535       .dwtag  DW_TAG_member
    4640                      .dwattr $C$DW$535, DW_AT_type(*$C$DW$T$22)
    4641                      .dwattr $C$DW$535, DW_AT_name("ADCINTOVFCLR")
    4642                      .dwattr $C$DW$535, DW_AT_TI_symbol_name("_ADCINTOVFCLR")
    4643                      .dwattr $C$DW$535, DW_AT_data_member_location[DW_OP_plus_uconst 0x6607]
    4644                      .dwattr $C$DW$535, DW_AT_accessibility(DW_ACCESS_public)
    4645              $C$DW$536       .dwtag  DW_TAG_member
    4646                      .dwattr $C$DW$536, DW_AT_type(*$C$DW$T$26)
    4647                      .dwattr $C$DW$536, DW_AT_name("INTSELxNy")
    4648                      .dwattr $C$DW$536, DW_AT_TI_symbol_name("_INTSELxNy")
    4649                      .dwattr $C$DW$536, DW_AT_data_member_location[DW_OP_plus_uconst 0x6608]
    4650                      .dwattr $C$DW$536, DW_AT_accessibility(DW_ACCESS_public)
    4651              $C$DW$537       .dwtag  DW_TAG_member
    4652                      .dwattr $C$DW$537, DW_AT_type(*$C$DW$T$27)
    4653                      .dwattr $C$DW$537, DW_AT_name("rsvd_3")
    4654                      .dwattr $C$DW$537, DW_AT_TI_symbol_name("_rsvd_3")
    4655                      .dwattr $C$DW$537, DW_AT_data_member_location[DW_OP_plus_uconst 0x660d]
    4656                      .dwattr $C$DW$537, DW_AT_accessibility(DW_ACCESS_public)
    4657              $C$DW$538       .dwtag  DW_TAG_member
    4658                      .dwattr $C$DW$538, DW_AT_type(*$C$DW$T$22)
    4659                      .dwattr $C$DW$538, DW_AT_name("SOCPRICTRL")
TMS320C2000 Assembler PC v6.2.5 Tue Nov 21 22:57:44 2017

Tools Copyright (c) 1996-2014 Texas Instruments Incorporated
C:\Users\wmj\AppData\Local\Temp\0853211                              PAGE   89

    4660                      .dwattr $C$DW$538, DW_AT_TI_symbol_name("_SOCPRICTRL")
    4661                      .dwattr $C$DW$538, DW_AT_data_member_location[DW_OP_plus_uconst 0x6610]
    4662                      .dwattr $C$DW$538, DW_AT_accessibility(DW_ACCESS_public)
    4663              $C$DW$539       .dwtag  DW_TAG_member
    4664                      .dwattr $C$DW$539, DW_AT_type(*$C$DW$T$22)
    4665                      .dwattr $C$DW$539, DW_AT_name("rsvd_4")
    4666                      .dwattr $C$DW$539, DW_AT_TI_symbol_name("_rsvd_4")
    4667                      .dwattr $C$DW$539, DW_AT_data_member_location[DW_OP_plus_uconst 0x6611]
    4668                      .dwattr $C$DW$539, DW_AT_accessibility(DW_ACCESS_public)
    4669              $C$DW$540       .dwtag  DW_TAG_member
    4670                      .dwattr $C$DW$540, DW_AT_type(*$C$DW$T$22)
    4671                      .dwattr $C$DW$540, DW_AT_name("ADCSAMPLEMODE")
    4672                      .dwattr $C$DW$540, DW_AT_TI_symbol_name("_ADCSAMPLEMODE")
    4673                      .dwattr $C$DW$540, DW_AT_data_member_location[DW_OP_plus_uconst 0x6612]
    4674                      .dwattr $C$DW$540, DW_AT_accessibility(DW_ACCESS_public)
    4675              $C$DW$541       .dwtag  DW_TAG_member
    4676                      .dwattr $C$DW$541, DW_AT_type(*$C$DW$T$22)
    4677                      .dwattr $C$DW$541, DW_AT_name("rsvd_5")
    4678                      .dwattr $C$DW$541, DW_AT_TI_symbol_name("_rsvd_5")
    4679                      .dwattr $C$DW$541, DW_AT_data_member_location[DW_OP_plus_uconst 0x6613]
    4680                      .dwattr $C$DW$541, DW_AT_accessibility(DW_ACCESS_public)
    4681              $C$DW$542       .dwtag  DW_TAG_member
    4682                      .dwattr $C$DW$542, DW_AT_type(*$C$DW$T$22)
    4683                      .dwattr $C$DW$542, DW_AT_name("ADCINTSOCSEL1")
    4684                      .dwattr $C$DW$542, DW_AT_TI_symbol_name("_ADCINTSOCSEL1")
    4685                      .dwattr $C$DW$542, DW_AT_data_member_location[DW_OP_plus_uconst 0x6614]
    4686                      .dwattr $C$DW$542, DW_AT_accessibility(DW_ACCESS_public)
    4687              $C$DW$543       .dwtag  DW_TAG_member
    4688                      .dwattr $C$DW$543, DW_AT_type(*$C$DW$T$22)
    4689                      .dwattr $C$DW$543, DW_AT_name("ADCINTSOCSEL2")
    4690                      .dwattr $C$DW$543, DW_AT_TI_symbol_name("_ADCINTSOCSEL2")
    4691                      .dwattr $C$DW$543, DW_AT_data_member_location[DW_OP_plus_uconst 0x6615]
    4692                      .dwattr $C$DW$543, DW_AT_accessibility(DW_ACCESS_public)
    4693              $C$DW$544       .dwtag  DW_TAG_member
    4694                      .dwattr $C$DW$544, DW_AT_type(*$C$DW$T$25)
    4695                      .dwattr $C$DW$544, DW_AT_name("rsvd_6")
    4696                      .dwattr $C$DW$544, DW_AT_TI_symbol_name("_rsvd_6")
    4697                      .dwattr $C$DW$544, DW_AT_data_member_location[DW_OP_plus_uconst 0x6616]
    4698                      .dwattr $C$DW$544, DW_AT_accessibility(DW_ACCESS_public)
    4699              $C$DW$545       .dwtag  DW_TAG_member
    4700                      .dwattr $C$DW$545, DW_AT_type(*$C$DW$T$22)
    4701                      .dwattr $C$DW$545, DW_AT_name("ADCSOCFLG1")
    4702                      .dwattr $C$DW$545, DW_AT_TI_symbol_name("_ADCSOCFLG1")
    4703                      .dwattr $C$DW$545, DW_AT_data_member_location[DW_OP_plus_uconst 0x6618]
    4704                      .dwattr $C$DW$545, DW_AT_accessibility(DW_ACCESS_public)
    4705              $C$DW$546       .dwtag  DW_TAG_member
    4706                      .dwattr $C$DW$546, DW_AT_type(*$C$DW$T$22)
    4707                      .dwattr $C$DW$546, DW_AT_name("rsvd_7")
    4708                      .dwattr $C$DW$546, DW_AT_TI_symbol_name("_rsvd_7")
    4709                      .dwattr $C$DW$546, DW_AT_data_member_location[DW_OP_plus_uconst 0x6619]
    4710                      .dwattr $C$DW$546, DW_AT_accessibility(DW_ACCESS_public)
    4711              $C$DW$547       .dwtag  DW_TAG_member
    4712                      .dwattr $C$DW$547, DW_AT_type(*$C$DW$T$22)
    4713                      .dwattr $C$DW$547, DW_AT_name("ADCSOCFRC1")
    4714                      .dwattr $C$DW$547, DW_AT_TI_symbol_name("_ADCSOCFRC1")
TMS320C2000 Assembler PC v6.2.5 Tue Nov 21 22:57:44 2017

Tools Copyright (c) 1996-2014 Texas Instruments Incorporated
C:\Users\wmj\AppData\Local\Temp\0853211                              PAGE   90

    4715                      .dwattr $C$DW$547, DW_AT_data_member_location[DW_OP_plus_uconst 0x661a]
    4716                      .dwattr $C$DW$547, DW_AT_accessibility(DW_ACCESS_public)
    4717              $C$DW$548       .dwtag  DW_TAG_member
    4718                      .dwattr $C$DW$548, DW_AT_type(*$C$DW$T$22)
    4719                      .dwattr $C$DW$548, DW_AT_name("rsvd_8")
    4720                      .dwattr $C$DW$548, DW_AT_TI_symbol_name("_rsvd_8")
    4721                      .dwattr $C$DW$548, DW_AT_data_member_location[DW_OP_plus_uconst 0x661b]
    4722                      .dwattr $C$DW$548, DW_AT_accessibility(DW_ACCESS_public)
    4723              $C$DW$549       .dwtag  DW_TAG_member
    4724                      .dwattr $C$DW$549, DW_AT_type(*$C$DW$T$22)
    4725                      .dwattr $C$DW$549, DW_AT_name("ADCSOCOVF1")
    4726                      .dwattr $C$DW$549, DW_AT_TI_symbol_name("_ADCSOCOVF1")
    4727                      .dwattr $C$DW$549, DW_AT_data_member_location[DW_OP_plus_uconst 0x661c]
    4728                      .dwattr $C$DW$549, DW_AT_accessibility(DW_ACCESS_public)
    4729              $C$DW$550       .dwtag  DW_TAG_member
    4730                      .dwattr $C$DW$550, DW_AT_type(*$C$DW$T$22)
    4731                      .dwattr $C$DW$550, DW_AT_name("rsvd_9")
    4732                      .dwattr $C$DW$550, DW_AT_TI_symbol_name("_rsvd_9")
    4733                      .dwattr $C$DW$550, DW_AT_data_member_location[DW_OP_plus_uconst 0x661d]
    4734                      .dwattr $C$DW$550, DW_AT_accessibility(DW_ACCESS_public)
    4735              $C$DW$551       .dwtag  DW_TAG_member
    4736                      .dwattr $C$DW$551, DW_AT_type(*$C$DW$T$22)
    4737                      .dwattr $C$DW$551, DW_AT_name("ADCSOCOVFCLR1")
    4738                      .dwattr $C$DW$551, DW_AT_TI_symbol_name("_ADCSOCOVFCLR1")
    4739                      .dwattr $C$DW$551, DW_AT_data_member_location[DW_OP_plus_uconst 0x661e]
    4740                      .dwattr $C$DW$551, DW_AT_accessibility(DW_ACCESS_public)
    4741              $C$DW$552       .dwtag  DW_TAG_member
    4742                      .dwattr $C$DW$552, DW_AT_type(*$C$DW$T$22)
    4743                      .dwattr $C$DW$552, DW_AT_name("rsvd_10")
    4744                      .dwattr $C$DW$552, DW_AT_TI_symbol_name("_rsvd_10")
    4745                      .dwattr $C$DW$552, DW_AT_data_member_location[DW_OP_plus_uconst 0x661f]
    4746                      .dwattr $C$DW$552, DW_AT_accessibility(DW_ACCESS_public)
    4747              $C$DW$553       .dwtag  DW_TAG_member
    4748                      .dwattr $C$DW$553, DW_AT_type(*$C$DW$T$23)
    4749                      .dwattr $C$DW$553, DW_AT_name("ADCSOCxCTL")
    4750                      .dwattr $C$DW$553, DW_AT_TI_symbol_name("_ADCSOCxCTL")
    4751                      .dwattr $C$DW$553, DW_AT_data_member_location[DW_OP_plus_uconst 0x6620]
    4752                      .dwattr $C$DW$553, DW_AT_accessibility(DW_ACCESS_public)
    4753              $C$DW$554       .dwtag  DW_TAG_member
    4754                      .dwattr $C$DW$554, DW_AT_type(*$C$DW$T$23)
    4755                      .dwattr $C$DW$554, DW_AT_name("rsvd_11")
    4756                      .dwattr $C$DW$554, DW_AT_TI_symbol_name("_rsvd_11")
    4757                      .dwattr $C$DW$554, DW_AT_data_member_location[DW_OP_plus_uconst 0x6630]
    4758                      .dwattr $C$DW$554, DW_AT_accessibility(DW_ACCESS_public)
    4759              $C$DW$555       .dwtag  DW_TAG_member
    4760                      .dwattr $C$DW$555, DW_AT_type(*$C$DW$T$22)
    4761                      .dwattr $C$DW$555, DW_AT_name("ADCREFTRIM")
    4762                      .dwattr $C$DW$555, DW_AT_TI_symbol_name("_ADCREFTRIM")
    4763                      .dwattr $C$DW$555, DW_AT_data_member_location[DW_OP_plus_uconst 0x6640]
    4764                      .dwattr $C$DW$555, DW_AT_accessibility(DW_ACCESS_public)
    4765              $C$DW$556       .dwtag  DW_TAG_member
    4766                      .dwattr $C$DW$556, DW_AT_type(*$C$DW$T$22)
    4767                      .dwattr $C$DW$556, DW_AT_name("ADCOFFTRIM")
    4768                      .dwattr $C$DW$556, DW_AT_TI_symbol_name("_ADCOFFTRIM")
    4769                      .dwattr $C$DW$556, DW_AT_data_member_location[DW_OP_plus_uconst 0x6641]
TMS320C2000 Assembler PC v6.2.5 Tue Nov 21 22:57:44 2017

Tools Copyright (c) 1996-2014 Texas Instruments Incorporated
C:\Users\wmj\AppData\Local\Temp\0853211                              PAGE   91

    4770                      .dwattr $C$DW$556, DW_AT_accessibility(DW_ACCESS_public)
    4771              $C$DW$557       .dwtag  DW_TAG_member
    4772                      .dwattr $C$DW$557, DW_AT_type(*$C$DW$T$28)
    4773                      .dwattr $C$DW$557, DW_AT_name("resvd_12")
    4774                      .dwattr $C$DW$557, DW_AT_TI_symbol_name("_resvd_12")
    4775                      .dwattr $C$DW$557, DW_AT_data_member_location[DW_OP_plus_uconst 0x6642]
    4776                      .dwattr $C$DW$557, DW_AT_accessibility(DW_ACCESS_public)
    4777              $C$DW$558       .dwtag  DW_TAG_member
    4778                      .dwattr $C$DW$558, DW_AT_type(*$C$DW$T$22)
    4779                      .dwattr $C$DW$558, DW_AT_name("ADCREV")
    4780                      .dwattr $C$DW$558, DW_AT_TI_symbol_name("_ADCREV")
    4781                      .dwattr $C$DW$558, DW_AT_data_member_location[DW_OP_plus_uconst 0x664f]
    4782                      .dwattr $C$DW$558, DW_AT_accessibility(DW_ACCESS_public)
    4783                      .dwendtag $C$DW$T$29
    4784              
    4785              $C$DW$T$79      .dwtag  DW_TAG_pointer_type
    4786                      .dwattr $C$DW$T$79, DW_AT_type(*$C$DW$T$29)
    4787                      .dwattr $C$DW$T$79, DW_AT_address_class(0x16)
    4788              $C$DW$T$80      .dwtag  DW_TAG_typedef, DW_AT_name("ADC_Handle")
    4789                      .dwattr $C$DW$T$80, DW_AT_type(*$C$DW$T$79)
    4790                      .dwattr $C$DW$T$80, DW_AT_language(DW_LANG_C)
    4791              
    4792              $C$DW$T$31      .dwtag  DW_TAG_structure_type
    4793                      .dwattr $C$DW$T$31, DW_AT_name("_CLK_Obj_")
    4794                      .dwattr $C$DW$T$31, DW_AT_byte_size(0x11)
    4795              $C$DW$559       .dwtag  DW_TAG_member
    4796                      .dwattr $C$DW$559, DW_AT_type(*$C$DW$T$22)
    4797                      .dwattr $C$DW$559, DW_AT_name("XCLK")
    4798                      .dwattr $C$DW$559, DW_AT_TI_symbol_name("_XCLK")
    4799                      .dwattr $C$DW$559, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    4800                      .dwattr $C$DW$559, DW_AT_accessibility(DW_ACCESS_public)
    4801              $C$DW$560       .dwtag  DW_TAG_member
    4802                      .dwattr $C$DW$560, DW_AT_type(*$C$DW$T$22)
    4803                      .dwattr $C$DW$560, DW_AT_name("rsvd_1")
    4804                      .dwattr $C$DW$560, DW_AT_TI_symbol_name("_rsvd_1")
    4805                      .dwattr $C$DW$560, DW_AT_data_member_location[DW_OP_plus_uconst 0x1]
    4806                      .dwattr $C$DW$560, DW_AT_accessibility(DW_ACCESS_public)
    4807              $C$DW$561       .dwtag  DW_TAG_member
    4808                      .dwattr $C$DW$561, DW_AT_type(*$C$DW$T$22)
    4809                      .dwattr $C$DW$561, DW_AT_name("CLKCTL")
    4810                      .dwattr $C$DW$561, DW_AT_TI_symbol_name("_CLKCTL")
    4811                      .dwattr $C$DW$561, DW_AT_data_member_location[DW_OP_plus_uconst 0x2]
    4812                      .dwattr $C$DW$561, DW_AT_accessibility(DW_ACCESS_public)
    4813              $C$DW$562       .dwtag  DW_TAG_member
    4814                      .dwattr $C$DW$562, DW_AT_type(*$C$DW$T$30)
    4815                      .dwattr $C$DW$562, DW_AT_name("rsvd_2")
    4816                      .dwattr $C$DW$562, DW_AT_TI_symbol_name("_rsvd_2")
    4817                      .dwattr $C$DW$562, DW_AT_data_member_location[DW_OP_plus_uconst 0x3]
    4818                      .dwattr $C$DW$562, DW_AT_accessibility(DW_ACCESS_public)
    4819              $C$DW$563       .dwtag  DW_TAG_member
    4820                      .dwattr $C$DW$563, DW_AT_type(*$C$DW$T$22)
    4821                      .dwattr $C$DW$563, DW_AT_name("LOSPCP")
    4822                      .dwattr $C$DW$563, DW_AT_TI_symbol_name("_LOSPCP")
    4823                      .dwattr $C$DW$563, DW_AT_data_member_location[DW_OP_plus_uconst 0xb]
    4824                      .dwattr $C$DW$563, DW_AT_accessibility(DW_ACCESS_public)
TMS320C2000 Assembler PC v6.2.5 Tue Nov 21 22:57:44 2017

Tools Copyright (c) 1996-2014 Texas Instruments Incorporated
C:\Users\wmj\AppData\Local\Temp\0853211                              PAGE   92

    4825              $C$DW$564       .dwtag  DW_TAG_member
    4826                      .dwattr $C$DW$564, DW_AT_type(*$C$DW$T$22)
    4827                      .dwattr $C$DW$564, DW_AT_name("PCLKCR0")
    4828                      .dwattr $C$DW$564, DW_AT_TI_symbol_name("_PCLKCR0")
    4829                      .dwattr $C$DW$564, DW_AT_data_member_location[DW_OP_plus_uconst 0xc]
    4830                      .dwattr $C$DW$564, DW_AT_accessibility(DW_ACCESS_public)
    4831              $C$DW$565       .dwtag  DW_TAG_member
    4832                      .dwattr $C$DW$565, DW_AT_type(*$C$DW$T$22)
    4833                      .dwattr $C$DW$565, DW_AT_name("PCLKCR1")
    4834                      .dwattr $C$DW$565, DW_AT_TI_symbol_name("_PCLKCR1")
    4835                      .dwattr $C$DW$565, DW_AT_data_member_location[DW_OP_plus_uconst 0xd]
    4836                      .dwattr $C$DW$565, DW_AT_accessibility(DW_ACCESS_public)
    4837              $C$DW$566       .dwtag  DW_TAG_member
    4838                      .dwattr $C$DW$566, DW_AT_type(*$C$DW$T$25)
    4839                      .dwattr $C$DW$566, DW_AT_name("rsvd_3")
    4840                      .dwattr $C$DW$566, DW_AT_TI_symbol_name("_rsvd_3")
    4841                      .dwattr $C$DW$566, DW_AT_data_member_location[DW_OP_plus_uconst 0xe]
    4842                      .dwattr $C$DW$566, DW_AT_accessibility(DW_ACCESS_public)
    4843              $C$DW$567       .dwtag  DW_TAG_member
    4844                      .dwattr $C$DW$567, DW_AT_type(*$C$DW$T$22)
    4845                      .dwattr $C$DW$567, DW_AT_name("PCLKCR3")
    4846                      .dwattr $C$DW$567, DW_AT_TI_symbol_name("_PCLKCR3")
    4847                      .dwattr $C$DW$567, DW_AT_data_member_location[DW_OP_plus_uconst 0x10]
    4848                      .dwattr $C$DW$567, DW_AT_accessibility(DW_ACCESS_public)
    4849                      .dwendtag $C$DW$T$31
    4850              
    4851              $C$DW$T$81      .dwtag  DW_TAG_pointer_type
    4852                      .dwattr $C$DW$T$81, DW_AT_type(*$C$DW$T$31)
    4853                      .dwattr $C$DW$T$81, DW_AT_address_class(0x16)
    4854              $C$DW$T$82      .dwtag  DW_TAG_typedef, DW_AT_name("CLK_Handle")
    4855                      .dwattr $C$DW$T$82, DW_AT_type(*$C$DW$T$81)
    4856                      .dwattr $C$DW$T$82, DW_AT_language(DW_LANG_C)
    4857              
    4858              $C$DW$T$33      .dwtag  DW_TAG_structure_type
    4859                      .dwattr $C$DW$T$33, DW_AT_name("_CPU_Obj_")
    4860                      .dwattr $C$DW$T$33, DW_AT_byte_size(0x01)
    4861              $C$DW$568       .dwtag  DW_TAG_member
    4862                      .dwattr $C$DW$568, DW_AT_type(*$C$DW$T$32)
    4863                      .dwattr $C$DW$568, DW_AT_name("tmp")
    4864                      .dwattr $C$DW$568, DW_AT_TI_symbol_name("_tmp")
    4865                      .dwattr $C$DW$568, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    4866                      .dwattr $C$DW$568, DW_AT_accessibility(DW_ACCESS_public)
    4867                      .dwendtag $C$DW$T$33
    4868              
    4869              $C$DW$T$83      .dwtag  DW_TAG_pointer_type
    4870                      .dwattr $C$DW$T$83, DW_AT_type(*$C$DW$T$33)
    4871                      .dwattr $C$DW$T$83, DW_AT_address_class(0x16)
    4872              $C$DW$T$84      .dwtag  DW_TAG_typedef, DW_AT_name("CPU_Handle")
    4873                      .dwattr $C$DW$T$84, DW_AT_type(*$C$DW$T$83)
    4874                      .dwattr $C$DW$T$84, DW_AT_language(DW_LANG_C)
    4875              
    4876              $C$DW$T$36      .dwtag  DW_TAG_structure_type
    4877                      .dwattr $C$DW$T$36, DW_AT_name("_CTRL_Version_")
    4878                      .dwattr $C$DW$T$36, DW_AT_byte_size(0x04)
    4879              $C$DW$569       .dwtag  DW_TAG_member
TMS320C2000 Assembler PC v6.2.5 Tue Nov 21 22:57:44 2017

Tools Copyright (c) 1996-2014 Texas Instruments Incorporated
C:\Users\wmj\AppData\Local\Temp\0853211                              PAGE   93

    4880                      .dwattr $C$DW$569, DW_AT_type(*$C$DW$T$21)
    4881                      .dwattr $C$DW$569, DW_AT_name("rsvd")
    4882                      .dwattr $C$DW$569, DW_AT_TI_symbol_name("_rsvd")
    4883                      .dwattr $C$DW$569, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    4884                      .dwattr $C$DW$569, DW_AT_accessibility(DW_ACCESS_public)
    4885              $C$DW$570       .dwtag  DW_TAG_member
    4886                      .dwattr $C$DW$570, DW_AT_type(*$C$DW$T$35)
    4887                      .dwattr $C$DW$570, DW_AT_name("targetProc")
    4888                      .dwattr $C$DW$570, DW_AT_TI_symbol_name("_targetProc")
    4889                      .dwattr $C$DW$570, DW_AT_data_member_location[DW_OP_plus_uconst 0x1]
    4890                      .dwattr $C$DW$570, DW_AT_accessibility(DW_ACCESS_public)
    4891              $C$DW$571       .dwtag  DW_TAG_member
    4892                      .dwattr $C$DW$571, DW_AT_type(*$C$DW$T$21)
    4893                      .dwattr $C$DW$571, DW_AT_name("major")
    4894                      .dwattr $C$DW$571, DW_AT_TI_symbol_name("_major")
    4895                      .dwattr $C$DW$571, DW_AT_data_member_location[DW_OP_plus_uconst 0x2]
    4896                      .dwattr $C$DW$571, DW_AT_accessibility(DW_ACCESS_public)
    4897              $C$DW$572       .dwtag  DW_TAG_member
    4898                      .dwattr $C$DW$572, DW_AT_type(*$C$DW$T$21)
    4899                      .dwattr $C$DW$572, DW_AT_name("minor")
    4900                      .dwattr $C$DW$572, DW_AT_TI_symbol_name("_minor")
    4901                      .dwattr $C$DW$572, DW_AT_data_member_location[DW_OP_plus_uconst 0x3]
    4902                      .dwattr $C$DW$572, DW_AT_accessibility(DW_ACCESS_public)
    4903                      .dwendtag $C$DW$T$36
    4904              
    4905              $C$DW$T$145     .dwtag  DW_TAG_typedef, DW_AT_name("CTRL_Version")
    4906                      .dwattr $C$DW$T$145, DW_AT_type(*$C$DW$T$36)
    4907                      .dwattr $C$DW$T$145, DW_AT_language(DW_LANG_C)
    4908              
    4909              $C$DW$T$38      .dwtag  DW_TAG_structure_type
    4910                      .dwattr $C$DW$T$38, DW_AT_name("_FILTER_FO_")
    4911                      .dwattr $C$DW$T$38, DW_AT_byte_size(0x0a)
    4912              $C$DW$573       .dwtag  DW_TAG_member
    4913                      .dwattr $C$DW$573, DW_AT_type(*$C$DW$T$37)
    4914                      .dwattr $C$DW$573, DW_AT_name("a1")
    4915                      .dwattr $C$DW$573, DW_AT_TI_symbol_name("_a1")
    4916                      .dwattr $C$DW$573, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    4917                      .dwattr $C$DW$573, DW_AT_accessibility(DW_ACCESS_public)
    4918              $C$DW$574       .dwtag  DW_TAG_member
    4919                      .dwattr $C$DW$574, DW_AT_type(*$C$DW$T$37)
    4920                      .dwattr $C$DW$574, DW_AT_name("b0")
    4921                      .dwattr $C$DW$574, DW_AT_TI_symbol_name("_b0")
    4922                      .dwattr $C$DW$574, DW_AT_data_member_location[DW_OP_plus_uconst 0x2]
    4923                      .dwattr $C$DW$574, DW_AT_accessibility(DW_ACCESS_public)
    4924              $C$DW$575       .dwtag  DW_TAG_member
    4925                      .dwattr $C$DW$575, DW_AT_type(*$C$DW$T$37)
    4926                      .dwattr $C$DW$575, DW_AT_name("b1")
    4927                      .dwattr $C$DW$575, DW_AT_TI_symbol_name("_b1")
    4928                      .dwattr $C$DW$575, DW_AT_data_member_location[DW_OP_plus_uconst 0x4]
    4929                      .dwattr $C$DW$575, DW_AT_accessibility(DW_ACCESS_public)
    4930              $C$DW$576       .dwtag  DW_TAG_member
    4931                      .dwattr $C$DW$576, DW_AT_type(*$C$DW$T$37)
    4932                      .dwattr $C$DW$576, DW_AT_name("x1")
    4933                      .dwattr $C$DW$576, DW_AT_TI_symbol_name("_x1")
    4934                      .dwattr $C$DW$576, DW_AT_data_member_location[DW_OP_plus_uconst 0x6]
TMS320C2000 Assembler PC v6.2.5 Tue Nov 21 22:57:44 2017

Tools Copyright (c) 1996-2014 Texas Instruments Incorporated
C:\Users\wmj\AppData\Local\Temp\0853211                              PAGE   94

    4935                      .dwattr $C$DW$576, DW_AT_accessibility(DW_ACCESS_public)
    4936              $C$DW$577       .dwtag  DW_TAG_member
    4937                      .dwattr $C$DW$577, DW_AT_type(*$C$DW$T$37)
    4938                      .dwattr $C$DW$577, DW_AT_name("y1")
    4939                      .dwattr $C$DW$577, DW_AT_TI_symbol_name("_y1")
    4940                      .dwattr $C$DW$577, DW_AT_data_member_location[DW_OP_plus_uconst 0x8]
    4941                      .dwattr $C$DW$577, DW_AT_accessibility(DW_ACCESS_public)
    4942                      .dwendtag $C$DW$T$38
    4943              
    4944              $C$DW$T$149     .dwtag  DW_TAG_typedef, DW_AT_name("FILTER_FO_Obj")
    4945                      .dwattr $C$DW$T$149, DW_AT_type(*$C$DW$T$38)
    4946                      .dwattr $C$DW$T$149, DW_AT_language(DW_LANG_C)
    4947              
    4948              $C$DW$T$19      .dwtag  DW_TAG_structure_type
    4949                      .dwattr $C$DW$T$19, DW_AT_name("_FILTER_FO_Obj_")
    4950                      .dwattr $C$DW$T$19, DW_AT_declaration
    4951                      .dwendtag $C$DW$T$19
    4952              
    4953              $C$DW$T$150     .dwtag  DW_TAG_pointer_type
    4954                      .dwattr $C$DW$T$150, DW_AT_type(*$C$DW$T$19)
    4955                      .dwattr $C$DW$T$150, DW_AT_address_class(0x16)
    4956              $C$DW$T$151     .dwtag  DW_TAG_typedef, DW_AT_name("FILTER_FO_Handle")
    4957                      .dwattr $C$DW$T$151, DW_AT_type(*$C$DW$T$150)
    4958                      .dwattr $C$DW$T$151, DW_AT_language(DW_LANG_C)
    4959              
    4960              $C$DW$T$39      .dwtag  DW_TAG_structure_type
    4961                      .dwattr $C$DW$T$39, DW_AT_name("_FLASH_Obj_")
    4962                      .dwattr $C$DW$T$39, DW_AT_byte_size(0x08)
    4963              $C$DW$578       .dwtag  DW_TAG_member
    4964                      .dwattr $C$DW$578, DW_AT_type(*$C$DW$T$22)
    4965                      .dwattr $C$DW$578, DW_AT_name("FOPT")
    4966                      .dwattr $C$DW$578, DW_AT_TI_symbol_name("_FOPT")
    4967                      .dwattr $C$DW$578, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    4968                      .dwattr $C$DW$578, DW_AT_accessibility(DW_ACCESS_public)
    4969              $C$DW$579       .dwtag  DW_TAG_member
    4970                      .dwattr $C$DW$579, DW_AT_type(*$C$DW$T$22)
    4971                      .dwattr $C$DW$579, DW_AT_name("rsvd_1")
    4972                      .dwattr $C$DW$579, DW_AT_TI_symbol_name("_rsvd_1")
    4973                      .dwattr $C$DW$579, DW_AT_data_member_location[DW_OP_plus_uconst 0x1]
    4974                      .dwattr $C$DW$579, DW_AT_accessibility(DW_ACCESS_public)
    4975              $C$DW$580       .dwtag  DW_TAG_member
    4976                      .dwattr $C$DW$580, DW_AT_type(*$C$DW$T$22)
    4977                      .dwattr $C$DW$580, DW_AT_name("FPWR")
    4978                      .dwattr $C$DW$580, DW_AT_TI_symbol_name("_FPWR")
    4979                      .dwattr $C$DW$580, DW_AT_data_member_location[DW_OP_plus_uconst 0x2]
    4980                      .dwattr $C$DW$580, DW_AT_accessibility(DW_ACCESS_public)
    4981              $C$DW$581       .dwtag  DW_TAG_member
    4982                      .dwattr $C$DW$581, DW_AT_type(*$C$DW$T$22)
    4983                      .dwattr $C$DW$581, DW_AT_name("FSTATUS")
    4984                      .dwattr $C$DW$581, DW_AT_TI_symbol_name("_FSTATUS")
    4985                      .dwattr $C$DW$581, DW_AT_data_member_location[DW_OP_plus_uconst 0x3]
    4986                      .dwattr $C$DW$581, DW_AT_accessibility(DW_ACCESS_public)
    4987              $C$DW$582       .dwtag  DW_TAG_member
    4988                      .dwattr $C$DW$582, DW_AT_type(*$C$DW$T$22)
    4989                      .dwattr $C$DW$582, DW_AT_name("FSTDBYWAIT")
TMS320C2000 Assembler PC v6.2.5 Tue Nov 21 22:57:44 2017

Tools Copyright (c) 1996-2014 Texas Instruments Incorporated
C:\Users\wmj\AppData\Local\Temp\0853211                              PAGE   95

    4990                      .dwattr $C$DW$582, DW_AT_TI_symbol_name("_FSTDBYWAIT")
    4991                      .dwattr $C$DW$582, DW_AT_data_member_location[DW_OP_plus_uconst 0x4]
    4992                      .dwattr $C$DW$582, DW_AT_accessibility(DW_ACCESS_public)
    4993              $C$DW$583       .dwtag  DW_TAG_member
    4994                      .dwattr $C$DW$583, DW_AT_type(*$C$DW$T$22)
    4995                      .dwattr $C$DW$583, DW_AT_name("FACTIVEWAIT")
    4996                      .dwattr $C$DW$583, DW_AT_TI_symbol_name("_FACTIVEWAIT")
    4997                      .dwattr $C$DW$583, DW_AT_data_member_location[DW_OP_plus_uconst 0x5]
    4998                      .dwattr $C$DW$583, DW_AT_accessibility(DW_ACCESS_public)
    4999              $C$DW$584       .dwtag  DW_TAG_member
    5000                      .dwattr $C$DW$584, DW_AT_type(*$C$DW$T$22)
    5001                      .dwattr $C$DW$584, DW_AT_name("FBANKWAIT")
    5002                      .dwattr $C$DW$584, DW_AT_TI_symbol_name("_FBANKWAIT")
    5003                      .dwattr $C$DW$584, DW_AT_data_member_location[DW_OP_plus_uconst 0x6]
    5004                      .dwattr $C$DW$584, DW_AT_accessibility(DW_ACCESS_public)
    5005              $C$DW$585       .dwtag  DW_TAG_member
    5006                      .dwattr $C$DW$585, DW_AT_type(*$C$DW$T$22)
    5007                      .dwattr $C$DW$585, DW_AT_name("FOTPWAIT")
    5008                      .dwattr $C$DW$585, DW_AT_TI_symbol_name("_FOTPWAIT")
    5009                      .dwattr $C$DW$585, DW_AT_data_member_location[DW_OP_plus_uconst 0x7]
    5010                      .dwattr $C$DW$585, DW_AT_accessibility(DW_ACCESS_public)
    5011                      .dwendtag $C$DW$T$39
    5012              
    5013              $C$DW$T$85      .dwtag  DW_TAG_pointer_type
    5014                      .dwattr $C$DW$T$85, DW_AT_type(*$C$DW$T$39)
    5015                      .dwattr $C$DW$T$85, DW_AT_address_class(0x16)
    5016              $C$DW$T$86      .dwtag  DW_TAG_typedef, DW_AT_name("FLASH_Handle")
    5017                      .dwattr $C$DW$T$86, DW_AT_type(*$C$DW$T$85)
    5018                      .dwattr $C$DW$T$86, DW_AT_language(DW_LANG_C)
    5019              
    5020              $C$DW$T$60      .dwtag  DW_TAG_structure_type
    5021                      .dwattr $C$DW$T$60, DW_AT_name("_FSM_Obj_")
    5022                      .dwattr $C$DW$T$60, DW_AT_byte_size(0x26)
    5023              $C$DW$586       .dwtag  DW_TAG_member
    5024                      .dwattr $C$DW$586, DW_AT_type(*$C$DW$T$41)
    5025                      .dwattr $C$DW$586, DW_AT_name("motorHandle")
    5026                      .dwattr $C$DW$586, DW_AT_TI_symbol_name("_motorHandle")
    5027                      .dwattr $C$DW$586, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    5028                      .dwattr $C$DW$586, DW_AT_accessibility(DW_ACCESS_public)
    5029              $C$DW$587       .dwtag  DW_TAG_member
    5030                      .dwattr $C$DW$587, DW_AT_type(*$C$DW$T$43)
    5031                      .dwattr $C$DW$587, DW_AT_name("halHandle")
    5032                      .dwattr $C$DW$587, DW_AT_TI_symbol_name("_halHandle")
    5033                      .dwattr $C$DW$587, DW_AT_data_member_location[DW_OP_plus_uconst 0x2]
    5034                      .dwattr $C$DW$587, DW_AT_accessibility(DW_ACCESS_public)
    5035              $C$DW$588       .dwtag  DW_TAG_member
    5036                      .dwattr $C$DW$588, DW_AT_type(*$C$DW$T$45)
    5037                      .dwattr $C$DW$588, DW_AT_name("StBoxHandle")
    5038                      .dwattr $C$DW$588, DW_AT_TI_symbol_name("_StBoxHandle")
    5039                      .dwattr $C$DW$588, DW_AT_data_member_location[DW_OP_plus_uconst 0x4]
    5040                      .dwattr $C$DW$588, DW_AT_accessibility(DW_ACCESS_public)
    5041              $C$DW$589       .dwtag  DW_TAG_member
    5042                      .dwattr $C$DW$589, DW_AT_type(*$C$DW$T$47)
    5043                      .dwattr $C$DW$589, DW_AT_name("FSM_State")
    5044                      .dwattr $C$DW$589, DW_AT_TI_symbol_name("_FSM_State")
TMS320C2000 Assembler PC v6.2.5 Tue Nov 21 22:57:44 2017

Tools Copyright (c) 1996-2014 Texas Instruments Incorporated
C:\Users\wmj\AppData\Local\Temp\0853211                              PAGE   96

    5045                      .dwattr $C$DW$589, DW_AT_data_member_location[DW_OP_plus_uconst 0x6]
    5046                      .dwattr $C$DW$589, DW_AT_accessibility(DW_ACCESS_public)
    5047              $C$DW$590       .dwtag  DW_TAG_member
    5048                      .dwattr $C$DW$590, DW_AT_type(*$C$DW$T$47)
    5049                      .dwattr $C$DW$590, DW_AT_name("FSM_CurState")
    5050                      .dwattr $C$DW$590, DW_AT_TI_symbol_name("_FSM_CurState")
    5051                      .dwattr $C$DW$590, DW_AT_data_member_location[DW_OP_plus_uconst 0x7]
    5052                      .dwattr $C$DW$590, DW_AT_accessibility(DW_ACCESS_public)
    5053              $C$DW$591       .dwtag  DW_TAG_member
    5054                      .dwattr $C$DW$591, DW_AT_type(*$C$DW$T$49)
    5055                      .dwattr $C$DW$591, DW_AT_name("FSM_Trans")
    5056                      .dwattr $C$DW$591, DW_AT_TI_symbol_name("_FSM_Trans")
    5057                      .dwattr $C$DW$591, DW_AT_data_member_location[DW_OP_plus_uconst 0x8]
    5058                      .dwattr $C$DW$591, DW_AT_accessibility(DW_ACCESS_public)
    5059              $C$DW$592       .dwtag  DW_TAG_member
    5060                      .dwattr $C$DW$592, DW_AT_type(*$C$DW$T$51)
    5061                      .dwattr $C$DW$592, DW_AT_name("FSM_Event")
    5062                      .dwattr $C$DW$592, DW_AT_TI_symbol_name("_FSM_Event")
    5063                      .dwattr $C$DW$592, DW_AT_data_member_location[DW_OP_plus_uconst 0x9]
    5064                      .dwattr $C$DW$592, DW_AT_accessibility(DW_ACCESS_public)
    5065              $C$DW$593       .dwtag  DW_TAG_member
    5066                      .dwattr $C$DW$593, DW_AT_type(*$C$DW$T$53)
    5067                      .dwattr $C$DW$593, DW_AT_name("FSM_StMode")
    5068                      .dwattr $C$DW$593, DW_AT_TI_symbol_name("_FSM_StMode")
    5069                      .dwattr $C$DW$593, DW_AT_data_member_location[DW_OP_plus_uconst 0xa]
    5070                      .dwattr $C$DW$593, DW_AT_accessibility(DW_ACCESS_public)
    5071              $C$DW$594       .dwtag  DW_TAG_member
    5072                      .dwattr $C$DW$594, DW_AT_type(*$C$DW$T$21)
    5073                      .dwattr $C$DW$594, DW_AT_name("FSM_ErrFlg")
    5074                      .dwattr $C$DW$594, DW_AT_TI_symbol_name("_FSM_ErrFlg")
    5075                      .dwattr $C$DW$594, DW_AT_data_member_location[DW_OP_plus_uconst 0xb]
    5076                      .dwattr $C$DW$594, DW_AT_accessibility(DW_ACCESS_public)
    5077              $C$DW$595       .dwtag  DW_TAG_member
    5078                      .dwattr $C$DW$595, DW_AT_type(*$C$DW$T$21)
    5079                      .dwattr $C$DW$595, DW_AT_name("FSM_ErrMask")
    5080                      .dwattr $C$DW$595, DW_AT_TI_symbol_name("_FSM_ErrMask")
    5081                      .dwattr $C$DW$595, DW_AT_data_member_location[DW_OP_plus_uconst 0xc]
    5082                      .dwattr $C$DW$595, DW_AT_accessibility(DW_ACCESS_public)
    5083              $C$DW$596       .dwtag  DW_TAG_member
    5084                      .dwattr $C$DW$596, DW_AT_type(*$C$DW$T$21)
    5085                      .dwattr $C$DW$596, DW_AT_name("FSM_runTime")
    5086                      .dwattr $C$DW$596, DW_AT_TI_symbol_name("_FSM_runTime")
    5087                      .dwattr $C$DW$596, DW_AT_data_member_location[DW_OP_plus_uconst 0xd]
    5088                      .dwattr $C$DW$596, DW_AT_accessibility(DW_ACCESS_public)
    5089              $C$DW$597       .dwtag  DW_TAG_member
    5090                      .dwattr $C$DW$597, DW_AT_type(*$C$DW$T$21)
    5091                      .dwattr $C$DW$597, DW_AT_name("FSM_485Cmd")
    5092                      .dwattr $C$DW$597, DW_AT_TI_symbol_name("_FSM_485Cmd")
    5093                      .dwattr $C$DW$597, DW_AT_data_member_location[DW_OP_plus_uconst 0xe]
    5094                      .dwattr $C$DW$597, DW_AT_accessibility(DW_ACCESS_public)
    5095              $C$DW$598       .dwtag  DW_TAG_member
    5096                      .dwattr $C$DW$598, DW_AT_type(*$C$DW$T$47)
    5097                      .dwattr $C$DW$598, DW_AT_name("FSM_485EditState")
    5098                      .dwattr $C$DW$598, DW_AT_TI_symbol_name("_FSM_485EditState")
    5099                      .dwattr $C$DW$598, DW_AT_data_member_location[DW_OP_plus_uconst 0xf]
TMS320C2000 Assembler PC v6.2.5 Tue Nov 21 22:57:44 2017

Tools Copyright (c) 1996-2014 Texas Instruments Incorporated
C:\Users\wmj\AppData\Local\Temp\0853211                              PAGE   97

    5100                      .dwattr $C$DW$598, DW_AT_accessibility(DW_ACCESS_public)
    5101              $C$DW$599       .dwtag  DW_TAG_member
    5102                      .dwattr $C$DW$599, DW_AT_type(*$C$DW$T$55)
    5103                      .dwattr $C$DW$599, DW_AT_name("FSM_485EditOpt")
    5104                      .dwattr $C$DW$599, DW_AT_TI_symbol_name("_FSM_485EditOpt")
    5105                      .dwattr $C$DW$599, DW_AT_data_member_location[DW_OP_plus_uconst 0x10]
    5106                      .dwattr $C$DW$599, DW_AT_accessibility(DW_ACCESS_public)
    5107              $C$DW$600       .dwtag  DW_TAG_member
    5108                      .dwattr $C$DW$600, DW_AT_type(*$C$DW$T$21)
    5109                      .dwattr $C$DW$600, DW_AT_name("FSM_485RefSpeed")
    5110                      .dwattr $C$DW$600, DW_AT_TI_symbol_name("_FSM_485RefSpeed")
    5111                      .dwattr $C$DW$600, DW_AT_data_member_location[DW_OP_plus_uconst 0x11]
    5112                      .dwattr $C$DW$600, DW_AT_accessibility(DW_ACCESS_public)
    5113              $C$DW$601       .dwtag  DW_TAG_member
    5114                      .dwattr $C$DW$601, DW_AT_type(*$C$DW$T$37)
    5115                      .dwattr $C$DW$601, DW_AT_name("MaxTorque_Nm")
    5116                      .dwattr $C$DW$601, DW_AT_TI_symbol_name("_MaxTorque_Nm")
    5117                      .dwattr $C$DW$601, DW_AT_data_member_location[DW_OP_plus_uconst 0x12]
    5118                      .dwattr $C$DW$601, DW_AT_accessibility(DW_ACCESS_public)
    5119              $C$DW$602       .dwtag  DW_TAG_member
    5120                      .dwattr $C$DW$602, DW_AT_type(*$C$DW$T$57)
    5121                      .dwattr $C$DW$602, DW_AT_name("FSM_CheckCond")
    5122                      .dwattr $C$DW$602, DW_AT_TI_symbol_name("_FSM_CheckCond")
    5123                      .dwattr $C$DW$602, DW_AT_data_member_location[DW_OP_plus_uconst 0x14]
    5124                      .dwattr $C$DW$602, DW_AT_accessibility(DW_ACCESS_public)
    5125              $C$DW$603       .dwtag  DW_TAG_member
    5126                      .dwattr $C$DW$603, DW_AT_type(*$C$DW$T$21)
    5127                      .dwattr $C$DW$603, DW_AT_name("FSM_CondValue")
    5128                      .dwattr $C$DW$603, DW_AT_TI_symbol_name("_FSM_CondValue")
    5129                      .dwattr $C$DW$603, DW_AT_data_member_location[DW_OP_plus_uconst 0x15]
    5130                      .dwattr $C$DW$603, DW_AT_accessibility(DW_ACCESS_public)
    5131              $C$DW$604       .dwtag  DW_TAG_member
    5132                      .dwattr $C$DW$604, DW_AT_type(*$C$DW$T$58)
    5133                      .dwattr $C$DW$604, DW_AT_name("OldAbsPos")
    5134                      .dwattr $C$DW$604, DW_AT_TI_symbol_name("_OldAbsPos")
    5135                      .dwattr $C$DW$604, DW_AT_data_member_location[DW_OP_plus_uconst 0x16]
    5136                      .dwattr $C$DW$604, DW_AT_accessibility(DW_ACCESS_public)
    5137              $C$DW$605       .dwtag  DW_TAG_member
    5138                      .dwattr $C$DW$605, DW_AT_type(*$C$DW$T$58)
    5139                      .dwattr $C$DW$605, DW_AT_name("NewAbsPos")
    5140                      .dwattr $C$DW$605, DW_AT_TI_symbol_name("_NewAbsPos")
    5141                      .dwattr $C$DW$605, DW_AT_data_member_location[DW_OP_plus_uconst 0x1a]
    5142                      .dwattr $C$DW$605, DW_AT_accessibility(DW_ACCESS_public)
    5143              $C$DW$606       .dwtag  DW_TAG_member
    5144                      .dwattr $C$DW$606, DW_AT_type(*$C$DW$T$59)
    5145                      .dwattr $C$DW$606, DW_AT_name("Flag_485StartMotor")
    5146                      .dwattr $C$DW$606, DW_AT_TI_symbol_name("_Flag_485StartMotor")
    5147                      .dwattr $C$DW$606, DW_AT_data_member_location[DW_OP_plus_uconst 0x1e]
    5148                      .dwattr $C$DW$606, DW_AT_accessibility(DW_ACCESS_public)
    5149              $C$DW$607       .dwtag  DW_TAG_member
    5150                      .dwattr $C$DW$607, DW_AT_type(*$C$DW$T$59)
    5151                      .dwattr $C$DW$607, DW_AT_name("Flag_MaxTimeLimit")
    5152                      .dwattr $C$DW$607, DW_AT_TI_symbol_name("_Flag_MaxTimeLimit")
    5153                      .dwattr $C$DW$607, DW_AT_data_member_location[DW_OP_plus_uconst 0x1f]
    5154                      .dwattr $C$DW$607, DW_AT_accessibility(DW_ACCESS_public)
TMS320C2000 Assembler PC v6.2.5 Tue Nov 21 22:57:44 2017

Tools Copyright (c) 1996-2014 Texas Instruments Incorporated
C:\Users\wmj\AppData\Local\Temp\0853211                              PAGE   98

    5155              $C$DW$608       .dwtag  DW_TAG_member
    5156                      .dwattr $C$DW$608, DW_AT_type(*$C$DW$T$59)
    5157                      .dwattr $C$DW$608, DW_AT_name("runTime_Enable")
    5158                      .dwattr $C$DW$608, DW_AT_TI_symbol_name("_runTime_Enable")
    5159                      .dwattr $C$DW$608, DW_AT_data_member_location[DW_OP_plus_uconst 0x20]
    5160                      .dwattr $C$DW$608, DW_AT_accessibility(DW_ACCESS_public)
    5161              $C$DW$609       .dwtag  DW_TAG_member
    5162                      .dwattr $C$DW$609, DW_AT_type(*$C$DW$T$59)
    5163                      .dwattr $C$DW$609, DW_AT_name("Flag_StallEnable")
    5164                      .dwattr $C$DW$609, DW_AT_TI_symbol_name("_Flag_StallEnable")
    5165                      .dwattr $C$DW$609, DW_AT_data_member_location[DW_OP_plus_uconst 0x21]
    5166                      .dwattr $C$DW$609, DW_AT_accessibility(DW_ACCESS_public)
    5167              $C$DW$610       .dwtag  DW_TAG_member
    5168                      .dwattr $C$DW$610, DW_AT_type(*$C$DW$T$59)
    5169                      .dwattr $C$DW$610, DW_AT_name("Flag_ReportState")
    5170                      .dwattr $C$DW$610, DW_AT_TI_symbol_name("_Flag_ReportState")
    5171                      .dwattr $C$DW$610, DW_AT_data_member_location[DW_OP_plus_uconst 0x22]
    5172                      .dwattr $C$DW$610, DW_AT_accessibility(DW_ACCESS_public)
    5173              $C$DW$611       .dwtag  DW_TAG_member
    5174                      .dwattr $C$DW$611, DW_AT_type(*$C$DW$T$59)
    5175                      .dwattr $C$DW$611, DW_AT_name("Flag_RunMode")
    5176                      .dwattr $C$DW$611, DW_AT_TI_symbol_name("_Flag_RunMode")
    5177                      .dwattr $C$DW$611, DW_AT_data_member_location[DW_OP_plus_uconst 0x23]
    5178                      .dwattr $C$DW$611, DW_AT_accessibility(DW_ACCESS_public)
    5179              $C$DW$612       .dwtag  DW_TAG_member
    5180                      .dwattr $C$DW$612, DW_AT_type(*$C$DW$T$59)
    5181                      .dwattr $C$DW$612, DW_AT_name("Flag_DcBrake")
    5182                      .dwattr $C$DW$612, DW_AT_TI_symbol_name("_Flag_DcBrake")
    5183                      .dwattr $C$DW$612, DW_AT_data_member_location[DW_OP_plus_uconst 0x24]
    5184                      .dwattr $C$DW$612, DW_AT_accessibility(DW_ACCESS_public)
    5185                      .dwendtag $C$DW$T$60
    5186              
    5187              $C$DW$T$193     .dwtag  DW_TAG_typedef, DW_AT_name("FSM_Obj")
    5188                      .dwattr $C$DW$T$193, DW_AT_type(*$C$DW$T$60)
    5189                      .dwattr $C$DW$T$193, DW_AT_language(DW_LANG_C)
    5190              $C$DW$T$194     .dwtag  DW_TAG_pointer_type
    5191                      .dwattr $C$DW$T$194, DW_AT_type(*$C$DW$T$193)
    5192                      .dwattr $C$DW$T$194, DW_AT_address_class(0x16)
    5193              $C$DW$T$120     .dwtag  DW_TAG_pointer_type
    5194                      .dwattr $C$DW$T$120, DW_AT_type(*$C$DW$T$60)
    5195                      .dwattr $C$DW$T$120, DW_AT_address_class(0x16)
    5196              $C$DW$T$121     .dwtag  DW_TAG_typedef, DW_AT_name("FSM_Handle")
    5197                      .dwattr $C$DW$T$121, DW_AT_type(*$C$DW$T$120)
    5198                      .dwattr $C$DW$T$121, DW_AT_language(DW_LANG_C)
    5199              $C$DW$613       .dwtag  DW_TAG_TI_far_type
    5200                      .dwattr $C$DW$613, DW_AT_type(*$C$DW$T$121)
    5201              $C$DW$T$195     .dwtag  DW_TAG_const_type
    5202                      .dwattr $C$DW$T$195, DW_AT_type(*$C$DW$613)
    5203              
    5204              $C$DW$T$62      .dwtag  DW_TAG_structure_type
    5205                      .dwattr $C$DW$T$62, DW_AT_name("_FSM_Position_t_")
    5206                      .dwattr $C$DW$T$62, DW_AT_byte_size(0x04)
    5207              $C$DW$614       .dwtag  DW_TAG_member
    5208                      .dwattr $C$DW$614, DW_AT_type(*$C$DW$T$61)
    5209                      .dwattr $C$DW$614, DW_AT_name("PosInt_MRev")
TMS320C2000 Assembler PC v6.2.5 Tue Nov 21 22:57:44 2017

Tools Copyright (c) 1996-2014 Texas Instruments Incorporated
C:\Users\wmj\AppData\Local\Temp\0853211                              PAGE   99

    5210                      .dwattr $C$DW$614, DW_AT_TI_symbol_name("_PosInt_MRev")
    5211                      .dwattr $C$DW$614, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    5212                      .dwattr $C$DW$614, DW_AT_accessibility(DW_ACCESS_public)
    5213              $C$DW$615       .dwtag  DW_TAG_member
    5214                      .dwattr $C$DW$615, DW_AT_type(*$C$DW$T$37)
    5215                      .dwattr $C$DW$615, DW_AT_name("PosFrac_MRev")
    5216                      .dwattr $C$DW$615, DW_AT_TI_symbol_name("_PosFrac_MRev")
    5217                      .dwattr $C$DW$615, DW_AT_data_member_location[DW_OP_plus_uconst 0x2]
    5218                      .dwattr $C$DW$615, DW_AT_accessibility(DW_ACCESS_public)
    5219                      .dwendtag $C$DW$T$62
    5220              
    5221              $C$DW$T$58      .dwtag  DW_TAG_typedef, DW_AT_name("FSM_Position_t")
    5222                      .dwattr $C$DW$T$58, DW_AT_type(*$C$DW$T$62)
    5223                      .dwattr $C$DW$T$58, DW_AT_language(DW_LANG_C)
    5224              
    5225              $C$DW$T$71      .dwtag  DW_TAG_structure_type
    5226                      .dwattr $C$DW$T$71, DW_AT_name("_FSM_StatePool_t_")
    5227                      .dwattr $C$DW$T$71, DW_AT_byte_size(0x4b)
    5228              $C$DW$616       .dwtag  DW_TAG_member
    5229                      .dwattr $C$DW$616, DW_AT_type(*$C$DW$T$64)
    5230                      .dwattr $C$DW$616, DW_AT_name("FSM_RefSpeed")
    5231                      .dwattr $C$DW$616, DW_AT_TI_symbol_name("_FSM_RefSpeed")
    5232                      .dwattr $C$DW$616, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    5233                      .dwattr $C$DW$616, DW_AT_accessibility(DW_ACCESS_public)
    5234              $C$DW$617       .dwtag  DW_TAG_member
    5235                      .dwattr $C$DW$617, DW_AT_type(*$C$DW$T$65)
    5236                      .dwattr $C$DW$617, DW_AT_name("FSM_CondValue")
    5237                      .dwattr $C$DW$617, DW_AT_TI_symbol_name("_FSM_CondValue")
    5238                      .dwattr $C$DW$617, DW_AT_data_member_location[DW_OP_plus_uconst 0xf]
    5239                      .dwattr $C$DW$617, DW_AT_accessibility(DW_ACCESS_public)
    5240              $C$DW$618       .dwtag  DW_TAG_member
    5241                      .dwattr $C$DW$618, DW_AT_type(*$C$DW$T$66)
    5242                      .dwattr $C$DW$618, DW_AT_name("FSM_Condition")
    5243                      .dwattr $C$DW$618, DW_AT_TI_symbol_name("_FSM_Condition")
    5244                      .dwattr $C$DW$618, DW_AT_data_member_location[DW_OP_plus_uconst 0x1e]
    5245                      .dwattr $C$DW$618, DW_AT_accessibility(DW_ACCESS_public)
    5246              $C$DW$619       .dwtag  DW_TAG_member
    5247                      .dwattr $C$DW$619, DW_AT_type(*$C$DW$T$69)
    5248                      .dwattr $C$DW$619, DW_AT_name("FSM_RunAction")
    5249                      .dwattr $C$DW$619, DW_AT_TI_symbol_name("_FSM_RunAction")
    5250                      .dwattr $C$DW$619, DW_AT_data_member_location[DW_OP_plus_uconst 0x2d]
    5251                      .dwattr $C$DW$619, DW_AT_accessibility(DW_ACCESS_public)
    5252              $C$DW$620       .dwtag  DW_TAG_member
    5253                      .dwattr $C$DW$620, DW_AT_type(*$C$DW$T$70)
    5254                      .dwattr $C$DW$620, DW_AT_name("FSM_NextState")
    5255                      .dwattr $C$DW$620, DW_AT_TI_symbol_name("_FSM_NextState")
    5256                      .dwattr $C$DW$620, DW_AT_data_member_location[DW_OP_plus_uconst 0x3c]
    5257                      .dwattr $C$DW$620, DW_AT_accessibility(DW_ACCESS_public)
    5258                      .dwendtag $C$DW$T$71
    5259              
    5260              $C$DW$T$44      .dwtag  DW_TAG_pointer_type
    5261                      .dwattr $C$DW$T$44, DW_AT_type(*$C$DW$T$71)
    5262                      .dwattr $C$DW$T$44, DW_AT_address_class(0x16)
    5263              $C$DW$T$45      .dwtag  DW_TAG_typedef, DW_AT_name("StPool_Handle")
    5264                      .dwattr $C$DW$T$45, DW_AT_type(*$C$DW$T$44)
TMS320C2000 Assembler PC v6.2.5 Tue Nov 21 22:57:44 2017

Tools Copyright (c) 1996-2014 Texas Instruments Incorporated
C:\Users\wmj\AppData\Local\Temp\0853211                              PAGE  100

    5265                      .dwattr $C$DW$T$45, DW_AT_language(DW_LANG_C)
    5266              
    5267              $C$DW$T$76      .dwtag  DW_TAG_structure_type
    5268                      .dwattr $C$DW$T$76, DW_AT_name("_GPIO_Obj_")
    5269                      .dwattr $C$DW$T$76, DW_AT_byte_size(0x6a)
    5270              $C$DW$621       .dwtag  DW_TAG_member
    5271                      .dwattr $C$DW$621, DW_AT_type(*$C$DW$T$73)
    5272                      .dwattr $C$DW$621, DW_AT_name("GPACTRL")
    5273                      .dwattr $C$DW$621, DW_AT_TI_symbol_name("_GPACTRL")
    5274                      .dwattr $C$DW$621, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    5275                      .dwattr $C$DW$621, DW_AT_accessibility(DW_ACCESS_public)
    5276              $C$DW$622       .dwtag  DW_TAG_member
    5277                      .dwattr $C$DW$622, DW_AT_type(*$C$DW$T$73)
    5278                      .dwattr $C$DW$622, DW_AT_name("GPAQSEL1")
    5279                      .dwattr $C$DW$622, DW_AT_TI_symbol_name("_GPAQSEL1")
    5280                      .dwattr $C$DW$622, DW_AT_data_member_location[DW_OP_plus_uconst 0x2]
    5281                      .dwattr $C$DW$622, DW_AT_accessibility(DW_ACCESS_public)
    5282              $C$DW$623       .dwtag  DW_TAG_member
    5283                      .dwattr $C$DW$623, DW_AT_type(*$C$DW$T$73)
    5284                      .dwattr $C$DW$623, DW_AT_name("GPAQSEL2")
    5285                      .dwattr $C$DW$623, DW_AT_TI_symbol_name("_GPAQSEL2")
    5286                      .dwattr $C$DW$623, DW_AT_data_member_location[DW_OP_plus_uconst 0x4]
    5287                      .dwattr $C$DW$623, DW_AT_accessibility(DW_ACCESS_public)
    5288              $C$DW$624       .dwtag  DW_TAG_member
    5289                      .dwattr $C$DW$624, DW_AT_type(*$C$DW$T$73)
    5290                      .dwattr $C$DW$624, DW_AT_name("GPAMUX1")
    5291                      .dwattr $C$DW$624, DW_AT_TI_symbol_name("_GPAMUX1")
    5292                      .dwattr $C$DW$624, DW_AT_data_member_location[DW_OP_plus_uconst 0x6]
    5293                      .dwattr $C$DW$624, DW_AT_accessibility(DW_ACCESS_public)
    5294              $C$DW$625       .dwtag  DW_TAG_member
    5295                      .dwattr $C$DW$625, DW_AT_type(*$C$DW$T$73)
    5296                      .dwattr $C$DW$625, DW_AT_name("GPAMUX2")
    5297                      .dwattr $C$DW$625, DW_AT_TI_symbol_name("_GPAMUX2")
    5298                      .dwattr $C$DW$625, DW_AT_data_member_location[DW_OP_plus_uconst 0x8]
    5299                      .dwattr $C$DW$625, DW_AT_accessibility(DW_ACCESS_public)
    5300              $C$DW$626       .dwtag  DW_TAG_member
    5301                      .dwattr $C$DW$626, DW_AT_type(*$C$DW$T$73)
    5302                      .dwattr $C$DW$626, DW_AT_name("GPADIR")
    5303                      .dwattr $C$DW$626, DW_AT_TI_symbol_name("_GPADIR")
    5304                      .dwattr $C$DW$626, DW_AT_data_member_location[DW_OP_plus_uconst 0xa]
    5305                      .dwattr $C$DW$626, DW_AT_accessibility(DW_ACCESS_public)
    5306              $C$DW$627       .dwtag  DW_TAG_member
    5307                      .dwattr $C$DW$627, DW_AT_type(*$C$DW$T$73)
    5308                      .dwattr $C$DW$627, DW_AT_name("GPAPUD")
    5309                      .dwattr $C$DW$627, DW_AT_TI_symbol_name("_GPAPUD")
    5310                      .dwattr $C$DW$627, DW_AT_data_member_location[DW_OP_plus_uconst 0xc]
    5311                      .dwattr $C$DW$627, DW_AT_accessibility(DW_ACCESS_public)
    5312              $C$DW$628       .dwtag  DW_TAG_member
    5313                      .dwattr $C$DW$628, DW_AT_type(*$C$DW$T$25)
    5314                      .dwattr $C$DW$628, DW_AT_name("rsvd_1")
    5315                      .dwattr $C$DW$628, DW_AT_TI_symbol_name("_rsvd_1")
    5316                      .dwattr $C$DW$628, DW_AT_data_member_location[DW_OP_plus_uconst 0xe]
    5317                      .dwattr $C$DW$628, DW_AT_accessibility(DW_ACCESS_public)
    5318              $C$DW$629       .dwtag  DW_TAG_member
    5319                      .dwattr $C$DW$629, DW_AT_type(*$C$DW$T$73)
TMS320C2000 Assembler PC v6.2.5 Tue Nov 21 22:57:44 2017

Tools Copyright (c) 1996-2014 Texas Instruments Incorporated
C:\Users\wmj\AppData\Local\Temp\0853211                              PAGE  101

    5320                      .dwattr $C$DW$629, DW_AT_name("GPBCTRL")
    5321                      .dwattr $C$DW$629, DW_AT_TI_symbol_name("_GPBCTRL")
    5322                      .dwattr $C$DW$629, DW_AT_data_member_location[DW_OP_plus_uconst 0x10]
    5323                      .dwattr $C$DW$629, DW_AT_accessibility(DW_ACCESS_public)
    5324              $C$DW$630       .dwtag  DW_TAG_member
    5325                      .dwattr $C$DW$630, DW_AT_type(*$C$DW$T$73)
    5326                      .dwattr $C$DW$630, DW_AT_name("GPBQSEL1")
    5327                      .dwattr $C$DW$630, DW_AT_TI_symbol_name("_GPBQSEL1")
    5328                      .dwattr $C$DW$630, DW_AT_data_member_location[DW_OP_plus_uconst 0x12]
    5329                      .dwattr $C$DW$630, DW_AT_accessibility(DW_ACCESS_public)
    5330              $C$DW$631       .dwtag  DW_TAG_member
    5331                      .dwattr $C$DW$631, DW_AT_type(*$C$DW$T$25)
    5332                      .dwattr $C$DW$631, DW_AT_name("rsvd_2")
    5333                      .dwattr $C$DW$631, DW_AT_TI_symbol_name("_rsvd_2")
    5334                      .dwattr $C$DW$631, DW_AT_data_member_location[DW_OP_plus_uconst 0x14]
    5335                      .dwattr $C$DW$631, DW_AT_accessibility(DW_ACCESS_public)
    5336              $C$DW$632       .dwtag  DW_TAG_member
    5337                      .dwattr $C$DW$632, DW_AT_type(*$C$DW$T$73)
    5338                      .dwattr $C$DW$632, DW_AT_name("GPBMUX1")
    5339                      .dwattr $C$DW$632, DW_AT_TI_symbol_name("_GPBMUX1")
    5340                      .dwattr $C$DW$632, DW_AT_data_member_location[DW_OP_plus_uconst 0x16]
    5341                      .dwattr $C$DW$632, DW_AT_accessibility(DW_ACCESS_public)
    5342              $C$DW$633       .dwtag  DW_TAG_member
    5343                      .dwattr $C$DW$633, DW_AT_type(*$C$DW$T$25)
    5344                      .dwattr $C$DW$633, DW_AT_name("rsvd_3")
    5345                      .dwattr $C$DW$633, DW_AT_TI_symbol_name("_rsvd_3")
    5346                      .dwattr $C$DW$633, DW_AT_data_member_location[DW_OP_plus_uconst 0x18]
    5347                      .dwattr $C$DW$633, DW_AT_accessibility(DW_ACCESS_public)
    5348              $C$DW$634       .dwtag  DW_TAG_member
    5349                      .dwattr $C$DW$634, DW_AT_type(*$C$DW$T$73)
    5350                      .dwattr $C$DW$634, DW_AT_name("GPBDIR")
    5351                      .dwattr $C$DW$634, DW_AT_TI_symbol_name("_GPBDIR")
    5352                      .dwattr $C$DW$634, DW_AT_data_member_location[DW_OP_plus_uconst 0x1a]
    5353                      .dwattr $C$DW$634, DW_AT_accessibility(DW_ACCESS_public)
    5354              $C$DW$635       .dwtag  DW_TAG_member
    5355                      .dwattr $C$DW$635, DW_AT_type(*$C$DW$T$73)
    5356                      .dwattr $C$DW$635, DW_AT_name("GPBPUD")
    5357                      .dwattr $C$DW$635, DW_AT_TI_symbol_name("_GPBPUD")
    5358                      .dwattr $C$DW$635, DW_AT_data_member_location[DW_OP_plus_uconst 0x1c]
    5359                      .dwattr $C$DW$635, DW_AT_accessibility(DW_ACCESS_public)
    5360              $C$DW$636       .dwtag  DW_TAG_member
    5361                      .dwattr $C$DW$636, DW_AT_type(*$C$DW$T$74)
    5362                      .dwattr $C$DW$636, DW_AT_name("rsvd_4")
    5363                      .dwattr $C$DW$636, DW_AT_TI_symbol_name("_rsvd_4")
    5364                      .dwattr $C$DW$636, DW_AT_data_member_location[DW_OP_plus_uconst 0x1e]
    5365                      .dwattr $C$DW$636, DW_AT_accessibility(DW_ACCESS_public)
    5366              $C$DW$637       .dwtag  DW_TAG_member
    5367                      .dwattr $C$DW$637, DW_AT_type(*$C$DW$T$73)
    5368                      .dwattr $C$DW$637, DW_AT_name("AIOMUX1")
    5369                      .dwattr $C$DW$637, DW_AT_TI_symbol_name("_AIOMUX1")
    5370                      .dwattr $C$DW$637, DW_AT_data_member_location[DW_OP_plus_uconst 0x36]
    5371                      .dwattr $C$DW$637, DW_AT_accessibility(DW_ACCESS_public)
    5372              $C$DW$638       .dwtag  DW_TAG_member
    5373                      .dwattr $C$DW$638, DW_AT_type(*$C$DW$T$25)
    5374                      .dwattr $C$DW$638, DW_AT_name("rsvd_5")
TMS320C2000 Assembler PC v6.2.5 Tue Nov 21 22:57:44 2017

Tools Copyright (c) 1996-2014 Texas Instruments Incorporated
C:\Users\wmj\AppData\Local\Temp\0853211                              PAGE  102

    5375                      .dwattr $C$DW$638, DW_AT_TI_symbol_name("_rsvd_5")
    5376                      .dwattr $C$DW$638, DW_AT_data_member_location[DW_OP_plus_uconst 0x38]
    5377                      .dwattr $C$DW$638, DW_AT_accessibility(DW_ACCESS_public)
    5378              $C$DW$639       .dwtag  DW_TAG_member
    5379                      .dwattr $C$DW$639, DW_AT_type(*$C$DW$T$73)
    5380                      .dwattr $C$DW$639, DW_AT_name("AIODIR")
    5381                      .dwattr $C$DW$639, DW_AT_TI_symbol_name("_AIODIR")
    5382                      .dwattr $C$DW$639, DW_AT_data_member_location[DW_OP_plus_uconst 0x3a]
    5383                      .dwattr $C$DW$639, DW_AT_accessibility(DW_ACCESS_public)
    5384              $C$DW$640       .dwtag  DW_TAG_member
    5385                      .dwattr $C$DW$640, DW_AT_type(*$C$DW$T$75)
    5386                      .dwattr $C$DW$640, DW_AT_name("rsvd_6")
    5387                      .dwattr $C$DW$640, DW_AT_TI_symbol_name("_rsvd_6")
    5388                      .dwattr $C$DW$640, DW_AT_data_member_location[DW_OP_plus_uconst 0x3c]
    5389                      .dwattr $C$DW$640, DW_AT_accessibility(DW_ACCESS_public)
    5390              $C$DW$641       .dwtag  DW_TAG_member
    5391                      .dwattr $C$DW$641, DW_AT_type(*$C$DW$T$73)
    5392                      .dwattr $C$DW$641, DW_AT_name("GPADAT")
    5393                      .dwattr $C$DW$641, DW_AT_TI_symbol_name("_GPADAT")
    5394                      .dwattr $C$DW$641, DW_AT_data_member_location[DW_OP_plus_uconst 0x40]
    5395                      .dwattr $C$DW$641, DW_AT_accessibility(DW_ACCESS_public)
    5396              $C$DW$642       .dwtag  DW_TAG_member
    5397                      .dwattr $C$DW$642, DW_AT_type(*$C$DW$T$73)
    5398                      .dwattr $C$DW$642, DW_AT_name("GPASET")
    5399                      .dwattr $C$DW$642, DW_AT_TI_symbol_name("_GPASET")
    5400                      .dwattr $C$DW$642, DW_AT_data_member_location[DW_OP_plus_uconst 0x42]
    5401                      .dwattr $C$DW$642, DW_AT_accessibility(DW_ACCESS_public)
    5402              $C$DW$643       .dwtag  DW_TAG_member
    5403                      .dwattr $C$DW$643, DW_AT_type(*$C$DW$T$73)
    5404                      .dwattr $C$DW$643, DW_AT_name("GPACLEAR")
    5405                      .dwattr $C$DW$643, DW_AT_TI_symbol_name("_GPACLEAR")
    5406                      .dwattr $C$DW$643, DW_AT_data_member_location[DW_OP_plus_uconst 0x44]
    5407                      .dwattr $C$DW$643, DW_AT_accessibility(DW_ACCESS_public)
    5408              $C$DW$644       .dwtag  DW_TAG_member
    5409                      .dwattr $C$DW$644, DW_AT_type(*$C$DW$T$73)
    5410                      .dwattr $C$DW$644, DW_AT_name("GPATOGGLE")
    5411                      .dwattr $C$DW$644, DW_AT_TI_symbol_name("_GPATOGGLE")
    5412                      .dwattr $C$DW$644, DW_AT_data_member_location[DW_OP_plus_uconst 0x46]
    5413                      .dwattr $C$DW$644, DW_AT_accessibility(DW_ACCESS_public)
    5414              $C$DW$645       .dwtag  DW_TAG_member
    5415                      .dwattr $C$DW$645, DW_AT_type(*$C$DW$T$73)
    5416                      .dwattr $C$DW$645, DW_AT_name("GPBDAT")
    5417                      .dwattr $C$DW$645, DW_AT_TI_symbol_name("_GPBDAT")
    5418                      .dwattr $C$DW$645, DW_AT_data_member_location[DW_OP_plus_uconst 0x48]
    5419                      .dwattr $C$DW$645, DW_AT_accessibility(DW_ACCESS_public)
    5420              $C$DW$646       .dwtag  DW_TAG_member
    5421                      .dwattr $C$DW$646, DW_AT_type(*$C$DW$T$73)
    5422                      .dwattr $C$DW$646, DW_AT_name("GPBSET")
    5423                      .dwattr $C$DW$646, DW_AT_TI_symbol_name("_GPBSET")
    5424                      .dwattr $C$DW$646, DW_AT_data_member_location[DW_OP_plus_uconst 0x4a]
    5425                      .dwattr $C$DW$646, DW_AT_accessibility(DW_ACCESS_public)
    5426              $C$DW$647       .dwtag  DW_TAG_member
    5427                      .dwattr $C$DW$647, DW_AT_type(*$C$DW$T$73)
    5428                      .dwattr $C$DW$647, DW_AT_name("GPBCLEAR")
    5429                      .dwattr $C$DW$647, DW_AT_TI_symbol_name("_GPBCLEAR")
TMS320C2000 Assembler PC v6.2.5 Tue Nov 21 22:57:44 2017

Tools Copyright (c) 1996-2014 Texas Instruments Incorporated
C:\Users\wmj\AppData\Local\Temp\0853211                              PAGE  103

    5430                      .dwattr $C$DW$647, DW_AT_data_member_location[DW_OP_plus_uconst 0x4c]
    5431                      .dwattr $C$DW$647, DW_AT_accessibility(DW_ACCESS_public)
    5432              $C$DW$648       .dwtag  DW_TAG_member
    5433                      .dwattr $C$DW$648, DW_AT_type(*$C$DW$T$73)
    5434                      .dwattr $C$DW$648, DW_AT_name("GPBTOGGLE")
    5435                      .dwattr $C$DW$648, DW_AT_TI_symbol_name("_GPBTOGGLE")
    5436                      .dwattr $C$DW$648, DW_AT_data_member_location[DW_OP_plus_uconst 0x4e]
    5437                      .dwattr $C$DW$648, DW_AT_accessibility(DW_ACCESS_public)
    5438              $C$DW$649       .dwtag  DW_TAG_member
    5439                      .dwattr $C$DW$649, DW_AT_type(*$C$DW$T$30)
    5440                      .dwattr $C$DW$649, DW_AT_name("rsvd_7")
    5441                      .dwattr $C$DW$649, DW_AT_TI_symbol_name("_rsvd_7")
    5442                      .dwattr $C$DW$649, DW_AT_data_member_location[DW_OP_plus_uconst 0x50]
    5443                      .dwattr $C$DW$649, DW_AT_accessibility(DW_ACCESS_public)
    5444              $C$DW$650       .dwtag  DW_TAG_member
    5445                      .dwattr $C$DW$650, DW_AT_type(*$C$DW$T$73)
    5446                      .dwattr $C$DW$650, DW_AT_name("AIODAT")
    5447                      .dwattr $C$DW$650, DW_AT_TI_symbol_name("_AIODAT")
    5448                      .dwattr $C$DW$650, DW_AT_data_member_location[DW_OP_plus_uconst 0x58]
    5449                      .dwattr $C$DW$650, DW_AT_accessibility(DW_ACCESS_public)
    5450              $C$DW$651       .dwtag  DW_TAG_member
    5451                      .dwattr $C$DW$651, DW_AT_type(*$C$DW$T$73)
    5452                      .dwattr $C$DW$651, DW_AT_name("AIOSET")
    5453                      .dwattr $C$DW$651, DW_AT_TI_symbol_name("_AIOSET")
    5454                      .dwattr $C$DW$651, DW_AT_data_member_location[DW_OP_plus_uconst 0x5a]
    5455                      .dwattr $C$DW$651, DW_AT_accessibility(DW_ACCESS_public)
    5456              $C$DW$652       .dwtag  DW_TAG_member
    5457                      .dwattr $C$DW$652, DW_AT_type(*$C$DW$T$73)
    5458                      .dwattr $C$DW$652, DW_AT_name("AIOCLEAR")
    5459                      .dwattr $C$DW$652, DW_AT_TI_symbol_name("_AIOCLEAR")
    5460                      .dwattr $C$DW$652, DW_AT_data_member_location[DW_OP_plus_uconst 0x5c]
    5461                      .dwattr $C$DW$652, DW_AT_accessibility(DW_ACCESS_public)
    5462              $C$DW$653       .dwtag  DW_TAG_member
    5463                      .dwattr $C$DW$653, DW_AT_type(*$C$DW$T$73)
    5464                      .dwattr $C$DW$653, DW_AT_name("AIOTOGGLE")
    5465                      .dwattr $C$DW$653, DW_AT_TI_symbol_name("_AIOTOGGLE")
    5466                      .dwattr $C$DW$653, DW_AT_data_member_location[DW_OP_plus_uconst 0x5e]
    5467                      .dwattr $C$DW$653, DW_AT_accessibility(DW_ACCESS_public)
    5468              $C$DW$654       .dwtag  DW_TAG_member
    5469                      .dwattr $C$DW$654, DW_AT_type(*$C$DW$T$27)
    5470                      .dwattr $C$DW$654, DW_AT_name("GPIOXINTnSEL")
    5471                      .dwattr $C$DW$654, DW_AT_TI_symbol_name("_GPIOXINTnSEL")
    5472                      .dwattr $C$DW$654, DW_AT_data_member_location[DW_OP_plus_uconst 0x60]
    5473                      .dwattr $C$DW$654, DW_AT_accessibility(DW_ACCESS_public)
    5474              $C$DW$655       .dwtag  DW_TAG_member
    5475                      .dwattr $C$DW$655, DW_AT_type(*$C$DW$T$26)
    5476                      .dwattr $C$DW$655, DW_AT_name("rsvd_8")
    5477                      .dwattr $C$DW$655, DW_AT_TI_symbol_name("_rsvd_8")
    5478                      .dwattr $C$DW$655, DW_AT_data_member_location[DW_OP_plus_uconst 0x63]
    5479                      .dwattr $C$DW$655, DW_AT_accessibility(DW_ACCESS_public)
    5480              $C$DW$656       .dwtag  DW_TAG_member
    5481                      .dwattr $C$DW$656, DW_AT_type(*$C$DW$T$73)
    5482                      .dwattr $C$DW$656, DW_AT_name("GPIOLPMSEL")
    5483                      .dwattr $C$DW$656, DW_AT_TI_symbol_name("_GPIOLPMSEL")
    5484                      .dwattr $C$DW$656, DW_AT_data_member_location[DW_OP_plus_uconst 0x68]
TMS320C2000 Assembler PC v6.2.5 Tue Nov 21 22:57:44 2017

Tools Copyright (c) 1996-2014 Texas Instruments Incorporated
C:\Users\wmj\AppData\Local\Temp\0853211                              PAGE  104

    5485                      .dwattr $C$DW$656, DW_AT_accessibility(DW_ACCESS_public)
    5486                      .dwendtag $C$DW$T$76
    5487              
    5488              $C$DW$T$87      .dwtag  DW_TAG_pointer_type
    5489                      .dwattr $C$DW$T$87, DW_AT_type(*$C$DW$T$76)
    5490                      .dwattr $C$DW$T$87, DW_AT_address_class(0x16)
    5491              $C$DW$T$88      .dwtag  DW_TAG_typedef, DW_AT_name("GPIO_Handle")
    5492                      .dwattr $C$DW$T$88, DW_AT_type(*$C$DW$T$87)
    5493                      .dwattr $C$DW$T$88, DW_AT_language(DW_LANG_C)
    5494              $C$DW$657       .dwtag  DW_TAG_TI_far_type
    5495                      .dwattr $C$DW$657, DW_AT_type(*$C$DW$T$88)
    5496              $C$DW$T$197     .dwtag  DW_TAG_const_type
    5497                      .dwattr $C$DW$T$197, DW_AT_type(*$C$DW$657)
    5498              
    5499              $C$DW$T$78      .dwtag  DW_TAG_structure_type
    5500                      .dwattr $C$DW$T$78, DW_AT_name("_HAL_AdcData_t_")
    5501                      .dwattr $C$DW$T$78, DW_AT_byte_size(0x16)
    5502              $C$DW$658       .dwtag  DW_TAG_member
    5503                      .dwattr $C$DW$658, DW_AT_type(*$C$DW$T$77)
    5504                      .dwattr $C$DW$658, DW_AT_name("I")
    5505                      .dwattr $C$DW$658, DW_AT_TI_symbol_name("_I")
    5506                      .dwattr $C$DW$658, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    5507                      .dwattr $C$DW$658, DW_AT_accessibility(DW_ACCESS_public)
    5508              $C$DW$659       .dwtag  DW_TAG_member
    5509                      .dwattr $C$DW$659, DW_AT_type(*$C$DW$T$77)
    5510                      .dwattr $C$DW$659, DW_AT_name("V")
    5511                      .dwattr $C$DW$659, DW_AT_TI_symbol_name("_V")
    5512                      .dwattr $C$DW$659, DW_AT_data_member_location[DW_OP_plus_uconst 0x6]
    5513                      .dwattr $C$DW$659, DW_AT_accessibility(DW_ACCESS_public)
    5514              $C$DW$660       .dwtag  DW_TAG_member
    5515                      .dwattr $C$DW$660, DW_AT_type(*$C$DW$T$37)
    5516                      .dwattr $C$DW$660, DW_AT_name("dcBus")
    5517                      .dwattr $C$DW$660, DW_AT_TI_symbol_name("_dcBus")
    5518                      .dwattr $C$DW$660, DW_AT_data_member_location[DW_OP_plus_uconst 0xc]
    5519                      .dwattr $C$DW$660, DW_AT_accessibility(DW_ACCESS_public)
    5520              $C$DW$661       .dwtag  DW_TAG_member
    5521                      .dwattr $C$DW$661, DW_AT_type(*$C$DW$T$37)
    5522                      .dwattr $C$DW$661, DW_AT_name("analogSensor1")
    5523                      .dwattr $C$DW$661, DW_AT_TI_symbol_name("_analogSensor1")
    5524                      .dwattr $C$DW$661, DW_AT_data_member_location[DW_OP_plus_uconst 0xe]
    5525                      .dwattr $C$DW$661, DW_AT_accessibility(DW_ACCESS_public)
    5526              $C$DW$662       .dwtag  DW_TAG_member
    5527                      .dwattr $C$DW$662, DW_AT_type(*$C$DW$T$37)
    5528                      .dwattr $C$DW$662, DW_AT_name("analogSensor2")
    5529                      .dwattr $C$DW$662, DW_AT_TI_symbol_name("_analogSensor2")
    5530                      .dwattr $C$DW$662, DW_AT_data_member_location[DW_OP_plus_uconst 0x10]
    5531                      .dwattr $C$DW$662, DW_AT_accessibility(DW_ACCESS_public)
    5532              $C$DW$663       .dwtag  DW_TAG_member
    5533                      .dwattr $C$DW$663, DW_AT_type(*$C$DW$T$37)
    5534                      .dwattr $C$DW$663, DW_AT_name("igbtNTC")
    5535                      .dwattr $C$DW$663, DW_AT_TI_symbol_name("_igbtNTC")
    5536                      .dwattr $C$DW$663, DW_AT_data_member_location[DW_OP_plus_uconst 0x12]
    5537                      .dwattr $C$DW$663, DW_AT_accessibility(DW_ACCESS_public)
    5538              $C$DW$664       .dwtag  DW_TAG_member
    5539                      .dwattr $C$DW$664, DW_AT_type(*$C$DW$T$37)
TMS320C2000 Assembler PC v6.2.5 Tue Nov 21 22:57:44 2017

Tools Copyright (c) 1996-2014 Texas Instruments Incorporated
C:\Users\wmj\AppData\Local\Temp\0853211                              PAGE  105

    5540                      .dwattr $C$DW$664, DW_AT_name("boardAddr")
    5541                      .dwattr $C$DW$664, DW_AT_TI_symbol_name("_boardAddr")
    5542                      .dwattr $C$DW$664, DW_AT_data_member_location[DW_OP_plus_uconst 0x14]
    5543                      .dwattr $C$DW$664, DW_AT_accessibility(DW_ACCESS_public)
    5544                      .dwendtag $C$DW$T$78
    5545              
    5546              $C$DW$T$114     .dwtag  DW_TAG_typedef, DW_AT_name("HAL_AdcData_t")
    5547                      .dwattr $C$DW$T$114, DW_AT_type(*$C$DW$T$78)
    5548                      .dwattr $C$DW$T$114, DW_AT_language(DW_LANG_C)
    5549              
    5550              $C$DW$T$117     .dwtag  DW_TAG_structure_type
    5551                      .dwattr $C$DW$T$117, DW_AT_name("_HAL_Obj_")
    5552                      .dwattr $C$DW$T$117, DW_AT_byte_size(0xb4)
    5553              $C$DW$665       .dwtag  DW_TAG_member
    5554                      .dwattr $C$DW$665, DW_AT_type(*$C$DW$T$80)
    5555                      .dwattr $C$DW$665, DW_AT_name("adcHandle")
    5556                      .dwattr $C$DW$665, DW_AT_TI_symbol_name("_adcHandle")
    5557                      .dwattr $C$DW$665, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    5558                      .dwattr $C$DW$665, DW_AT_accessibility(DW_ACCESS_public)
    5559              $C$DW$666       .dwtag  DW_TAG_member
    5560                      .dwattr $C$DW$666, DW_AT_type(*$C$DW$T$82)
    5561                      .dwattr $C$DW$666, DW_AT_name("clkHandle")
    5562                      .dwattr $C$DW$666, DW_AT_TI_symbol_name("_clkHandle")
    5563                      .dwattr $C$DW$666, DW_AT_data_member_location[DW_OP_plus_uconst 0x2]
    5564                      .dwattr $C$DW$666, DW_AT_accessibility(DW_ACCESS_public)
    5565              $C$DW$667       .dwtag  DW_TAG_member
    5566                      .dwattr $C$DW$667, DW_AT_type(*$C$DW$T$84)
    5567                      .dwattr $C$DW$667, DW_AT_name("cpuHandle")
    5568                      .dwattr $C$DW$667, DW_AT_TI_symbol_name("_cpuHandle")
    5569                      .dwattr $C$DW$667, DW_AT_data_member_location[DW_OP_plus_uconst 0x4]
    5570                      .dwattr $C$DW$667, DW_AT_accessibility(DW_ACCESS_public)
    5571              $C$DW$668       .dwtag  DW_TAG_member
    5572                      .dwattr $C$DW$668, DW_AT_type(*$C$DW$T$86)
    5573                      .dwattr $C$DW$668, DW_AT_name("flashHandle")
    5574                      .dwattr $C$DW$668, DW_AT_TI_symbol_name("_flashHandle")
    5575                      .dwattr $C$DW$668, DW_AT_data_member_location[DW_OP_plus_uconst 0x6]
    5576                      .dwattr $C$DW$668, DW_AT_accessibility(DW_ACCESS_public)
    5577              $C$DW$669       .dwtag  DW_TAG_member
    5578                      .dwattr $C$DW$669, DW_AT_type(*$C$DW$T$88)
    5579                      .dwattr $C$DW$669, DW_AT_name("gpioHandle")
    5580                      .dwattr $C$DW$669, DW_AT_TI_symbol_name("_gpioHandle")
    5581                      .dwattr $C$DW$669, DW_AT_data_member_location[DW_OP_plus_uconst 0x8]
    5582                      .dwattr $C$DW$669, DW_AT_accessibility(DW_ACCESS_public)
    5583              $C$DW$670       .dwtag  DW_TAG_member
    5584                      .dwattr $C$DW$670, DW_AT_type(*$C$DW$T$91)
    5585                      .dwattr $C$DW$670, DW_AT_name("offsetHandle_I")
    5586                      .dwattr $C$DW$670, DW_AT_TI_symbol_name("_offsetHandle_I")
    5587                      .dwattr $C$DW$670, DW_AT_data_member_location[DW_OP_plus_uconst 0xa]
    5588                      .dwattr $C$DW$670, DW_AT_accessibility(DW_ACCESS_public)
    5589              $C$DW$671       .dwtag  DW_TAG_member
    5590                      .dwattr $C$DW$671, DW_AT_type(*$C$DW$T$93)
    5591                      .dwattr $C$DW$671, DW_AT_name("offset_I")
    5592                      .dwattr $C$DW$671, DW_AT_TI_symbol_name("_offset_I")
    5593                      .dwattr $C$DW$671, DW_AT_data_member_location[DW_OP_plus_uconst 0x10]
    5594                      .dwattr $C$DW$671, DW_AT_accessibility(DW_ACCESS_public)
TMS320C2000 Assembler PC v6.2.5 Tue Nov 21 22:57:44 2017

Tools Copyright (c) 1996-2014 Texas Instruments Incorporated
C:\Users\wmj\AppData\Local\Temp\0853211                              PAGE  106

    5595              $C$DW$672       .dwtag  DW_TAG_member
    5596                      .dwattr $C$DW$672, DW_AT_type(*$C$DW$T$91)
    5597                      .dwattr $C$DW$672, DW_AT_name("offsetHandle_V")
    5598                      .dwattr $C$DW$672, DW_AT_TI_symbol_name("_offsetHandle_V")
    5599                      .dwattr $C$DW$672, DW_AT_data_member_location[DW_OP_plus_uconst 0x40]
    5600                      .dwattr $C$DW$672, DW_AT_accessibility(DW_ACCESS_public)
    5601              $C$DW$673       .dwtag  DW_TAG_member
    5602                      .dwattr $C$DW$673, DW_AT_type(*$C$DW$T$93)
    5603                      .dwattr $C$DW$673, DW_AT_name("offset_V")
    5604                      .dwattr $C$DW$673, DW_AT_TI_symbol_name("_offset_V")
    5605                      .dwattr $C$DW$673, DW_AT_data_member_location[DW_OP_plus_uconst 0x46]
    5606                      .dwattr $C$DW$673, DW_AT_accessibility(DW_ACCESS_public)
    5607              $C$DW$674       .dwtag  DW_TAG_member
    5608                      .dwattr $C$DW$674, DW_AT_type(*$C$DW$T$95)
    5609                      .dwattr $C$DW$674, DW_AT_name("oscHandle")
    5610                      .dwattr $C$DW$674, DW_AT_TI_symbol_name("_oscHandle")
    5611                      .dwattr $C$DW$674, DW_AT_data_member_location[DW_OP_plus_uconst 0x76]
    5612                      .dwattr $C$DW$674, DW_AT_accessibility(DW_ACCESS_public)
    5613              $C$DW$675       .dwtag  DW_TAG_member
    5614                      .dwattr $C$DW$675, DW_AT_type(*$C$DW$T$97)
    5615                      .dwattr $C$DW$675, DW_AT_name("pieHandle")
    5616                      .dwattr $C$DW$675, DW_AT_TI_symbol_name("_pieHandle")
    5617                      .dwattr $C$DW$675, DW_AT_data_member_location[DW_OP_plus_uconst 0x78]
    5618                      .dwattr $C$DW$675, DW_AT_accessibility(DW_ACCESS_public)
    5619              $C$DW$676       .dwtag  DW_TAG_member
    5620                      .dwattr $C$DW$676, DW_AT_type(*$C$DW$T$99)
    5621                      .dwattr $C$DW$676, DW_AT_name("pllHandle")
    5622                      .dwattr $C$DW$676, DW_AT_TI_symbol_name("_pllHandle")
    5623                      .dwattr $C$DW$676, DW_AT_data_member_location[DW_OP_plus_uconst 0x7a]
    5624                      .dwattr $C$DW$676, DW_AT_accessibility(DW_ACCESS_public)
    5625              $C$DW$677       .dwtag  DW_TAG_member
    5626                      .dwattr $C$DW$677, DW_AT_type(*$C$DW$T$102)
    5627                      .dwattr $C$DW$677, DW_AT_name("pwmHandle")
    5628                      .dwattr $C$DW$677, DW_AT_TI_symbol_name("_pwmHandle")
    5629                      .dwattr $C$DW$677, DW_AT_data_member_location[DW_OP_plus_uconst 0x7c]
    5630                      .dwattr $C$DW$677, DW_AT_accessibility(DW_ACCESS_public)
    5631              $C$DW$678       .dwtag  DW_TAG_member
    5632                      .dwattr $C$DW$678, DW_AT_type(*$C$DW$T$102)
    5633                      .dwattr $C$DW$678, DW_AT_name("pwmDacHandle")
    5634                      .dwattr $C$DW$678, DW_AT_TI_symbol_name("_pwmDacHandle")
    5635                      .dwattr $C$DW$678, DW_AT_data_member_location[DW_OP_plus_uconst 0x82]
    5636                      .dwattr $C$DW$678, DW_AT_accessibility(DW_ACCESS_public)
    5637              $C$DW$679       .dwtag  DW_TAG_member
    5638                      .dwattr $C$DW$679, DW_AT_type(*$C$DW$T$104)
    5639                      .dwattr $C$DW$679, DW_AT_name("pwrHandle")
    5640                      .dwattr $C$DW$679, DW_AT_TI_symbol_name("_pwrHandle")
    5641                      .dwattr $C$DW$679, DW_AT_data_member_location[DW_OP_plus_uconst 0x88]
    5642                      .dwattr $C$DW$679, DW_AT_accessibility(DW_ACCESS_public)
    5643              $C$DW$680       .dwtag  DW_TAG_member
    5644                      .dwattr $C$DW$680, DW_AT_type(*$C$DW$T$107)
    5645                      .dwattr $C$DW$680, DW_AT_name("timerHandle")
    5646                      .dwattr $C$DW$680, DW_AT_TI_symbol_name("_timerHandle")
    5647                      .dwattr $C$DW$680, DW_AT_data_member_location[DW_OP_plus_uconst 0x8a]
    5648                      .dwattr $C$DW$680, DW_AT_accessibility(DW_ACCESS_public)
    5649              $C$DW$681       .dwtag  DW_TAG_member
TMS320C2000 Assembler PC v6.2.5 Tue Nov 21 22:57:44 2017

Tools Copyright (c) 1996-2014 Texas Instruments Incorporated
C:\Users\wmj\AppData\Local\Temp\0853211                              PAGE  107

    5650                      .dwattr $C$DW$681, DW_AT_type(*$C$DW$T$109)
    5651                      .dwattr $C$DW$681, DW_AT_name("spiAHandle")
    5652                      .dwattr $C$DW$681, DW_AT_TI_symbol_name("_spiAHandle")
    5653                      .dwattr $C$DW$681, DW_AT_data_member_location[DW_OP_plus_uconst 0x90]
    5654                      .dwattr $C$DW$681, DW_AT_accessibility(DW_ACCESS_public)
    5655              $C$DW$682       .dwtag  DW_TAG_member
    5656                      .dwattr $C$DW$682, DW_AT_type(*$C$DW$T$111)
    5657                      .dwattr $C$DW$682, DW_AT_name("wdogHandle")
    5658                      .dwattr $C$DW$682, DW_AT_TI_symbol_name("_wdogHandle")
    5659                      .dwattr $C$DW$682, DW_AT_data_member_location[DW_OP_plus_uconst 0x92]
    5660                      .dwattr $C$DW$682, DW_AT_accessibility(DW_ACCESS_public)
    5661              $C$DW$683       .dwtag  DW_TAG_member
    5662                      .dwattr $C$DW$683, DW_AT_type(*$C$DW$T$113)
    5663                      .dwattr $C$DW$683, DW_AT_name("sciHandle")
    5664                      .dwattr $C$DW$683, DW_AT_TI_symbol_name("_sciHandle")
    5665                      .dwattr $C$DW$683, DW_AT_data_member_location[DW_OP_plus_uconst 0x94]
    5666                      .dwattr $C$DW$683, DW_AT_accessibility(DW_ACCESS_public)
    5667              $C$DW$684       .dwtag  DW_TAG_member
    5668                      .dwattr $C$DW$684, DW_AT_type(*$C$DW$T$114)
    5669                      .dwattr $C$DW$684, DW_AT_name("adcBias")
    5670                      .dwattr $C$DW$684, DW_AT_TI_symbol_name("_adcBias")
    5671                      .dwattr $C$DW$684, DW_AT_data_member_location[DW_OP_plus_uconst 0x96]
    5672                      .dwattr $C$DW$684, DW_AT_accessibility(DW_ACCESS_public)
    5673              $C$DW$685       .dwtag  DW_TAG_member
    5674                      .dwattr $C$DW$685, DW_AT_type(*$C$DW$T$37)
    5675                      .dwattr $C$DW$685, DW_AT_name("current_sf")
    5676                      .dwattr $C$DW$685, DW_AT_TI_symbol_name("_current_sf")
    5677                      .dwattr $C$DW$685, DW_AT_data_member_location[DW_OP_plus_uconst 0xac]
    5678                      .dwattr $C$DW$685, DW_AT_accessibility(DW_ACCESS_public)
    5679              $C$DW$686       .dwtag  DW_TAG_member
    5680                      .dwattr $C$DW$686, DW_AT_type(*$C$DW$T$37)
    5681                      .dwattr $C$DW$686, DW_AT_name("voltage_sf")
    5682                      .dwattr $C$DW$686, DW_AT_TI_symbol_name("_voltage_sf")
    5683                      .dwattr $C$DW$686, DW_AT_data_member_location[DW_OP_plus_uconst 0xae]
    5684                      .dwattr $C$DW$686, DW_AT_accessibility(DW_ACCESS_public)
    5685              $C$DW$687       .dwtag  DW_TAG_member
    5686                      .dwattr $C$DW$687, DW_AT_type(*$C$DW$T$32)
    5687                      .dwattr $C$DW$687, DW_AT_name("numCurrentSensors")
    5688                      .dwattr $C$DW$687, DW_AT_TI_symbol_name("_numCurrentSensors")
    5689                      .dwattr $C$DW$687, DW_AT_data_member_location[DW_OP_plus_uconst 0xb0]
    5690                      .dwattr $C$DW$687, DW_AT_accessibility(DW_ACCESS_public)
    5691              $C$DW$688       .dwtag  DW_TAG_member
    5692                      .dwattr $C$DW$688, DW_AT_type(*$C$DW$T$32)
    5693                      .dwattr $C$DW$688, DW_AT_name("numVoltageSensors")
    5694                      .dwattr $C$DW$688, DW_AT_TI_symbol_name("_numVoltageSensors")
    5695                      .dwattr $C$DW$688, DW_AT_data_member_location[DW_OP_plus_uconst 0xb1]
    5696                      .dwattr $C$DW$688, DW_AT_accessibility(DW_ACCESS_public)
    5697              $C$DW$689       .dwtag  DW_TAG_member
    5698                      .dwattr $C$DW$689, DW_AT_type(*$C$DW$T$116)
    5699                      .dwattr $C$DW$689, DW_AT_name("boardAddress")
    5700                      .dwattr $C$DW$689, DW_AT_TI_symbol_name("_boardAddress")
    5701                      .dwattr $C$DW$689, DW_AT_data_member_location[DW_OP_plus_uconst 0xb2]
    5702                      .dwattr $C$DW$689, DW_AT_accessibility(DW_ACCESS_public)
    5703                      .dwendtag $C$DW$T$117
    5704              
TMS320C2000 Assembler PC v6.2.5 Tue Nov 21 22:57:44 2017

Tools Copyright (c) 1996-2014 Texas Instruments Incorporated
C:\Users\wmj\AppData\Local\Temp\0853211                              PAGE  108

    5705              $C$DW$T$42      .dwtag  DW_TAG_pointer_type
    5706                      .dwattr $C$DW$T$42, DW_AT_type(*$C$DW$T$117)
    5707                      .dwattr $C$DW$T$42, DW_AT_address_class(0x16)
    5708              $C$DW$T$43      .dwtag  DW_TAG_typedef, DW_AT_name("HAL_Handle")
    5709                      .dwattr $C$DW$T$43, DW_AT_type(*$C$DW$T$42)
    5710                      .dwattr $C$DW$T$43, DW_AT_language(DW_LANG_C)
    5711              
    5712              $C$DW$T$119     .dwtag  DW_TAG_structure_type
    5713                      .dwattr $C$DW$T$119, DW_AT_name("_MATH_vec3_")
    5714                      .dwattr $C$DW$T$119, DW_AT_byte_size(0x06)
    5715              $C$DW$690       .dwtag  DW_TAG_member
    5716                      .dwattr $C$DW$690, DW_AT_type(*$C$DW$T$118)
    5717                      .dwattr $C$DW$690, DW_AT_name("value")
    5718                      .dwattr $C$DW$690, DW_AT_TI_symbol_name("_value")
    5719                      .dwattr $C$DW$690, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    5720                      .dwattr $C$DW$690, DW_AT_accessibility(DW_ACCESS_public)
