TMS320C2000 Assembler PC v6.2.5 Thu Nov 23 20:51:01 2017

Tools Copyright (c) 1996-2014 Texas Instruments Incorporated
C:\Users\wmj\AppData\Local\Temp\0119610                              PAGE    1

       1              ;***************************************************************
       2              ;* TMS320C2000 C/C++ Codegen                         PC v6.2.5 *
       3              ;* Date/Time created: Thu Nov 23 20:51:01 2017                 *
       4              ;***************************************************************
       5                      .compiler_opts --float_support=softlib --hll_source=on --mem_model:code=flat --mem_model:data=large -
       6        0002  FP      .set    XAR2
       7              
       8              $C$DW$CU        .dwtag  DW_TAG_compile_unit
       9                      .dwattr $C$DW$CU, DW_AT_name("D:/BM1000_v1.1/sw/drivers/drvic/modbus/mb.c")
      10                      .dwattr $C$DW$CU, DW_AT_producer("TMS320C2000 C/C++ Codegen PC v6.2.5 Copyright (c) 1996-2014 Texas I
      11                      .dwattr $C$DW$CU, DW_AT_TI_version(0x01)
      12                      .dwattr $C$DW$CU, DW_AT_comp_dir("D:\BM1000_v1.1\sw\solutions\instaspin_foc\boards\hvkit_rev1p1\f28x\
      13              
      14              $C$DW$1 .dwtag  DW_TAG_subprogram, DW_AT_name("FSM_clrOverCurrentReg")
      15                      .dwattr $C$DW$1, DW_AT_TI_symbol_name("_FSM_clrOverCurrentReg")

    4739              $C$DW$501       .dwtag  DW_TAG_enumerator, DW_AT_name("GPIO_Number_1"), DW_AT_const_value(0x01)
    4740              $C$DW$502       .dwtag  DW_TAG_enumerator, DW_AT_name("GPIO_Number_2"), DW_AT_const_value(0x02)
    4741              $C$DW$503       .dwtag  DW_TAG_enumerator, DW_AT_name("GPIO_Number_3"), DW_AT_const_value(0x03)
    4742              $C$DW$504       .dwtag  DW_TAG_enumerator, DW_AT_name("GPIO_Number_4"), DW_AT_const_value(0x04)
    4743              $C$DW$505       .dwtag  DW_TAG_enumerator, DW_AT_name("GPIO_Number_5"), DW_AT_const_value(0x05)
    4744              $C$DW$506       .dwtag  DW_TAG_enumerator, DW_AT_name("GPIO_Number_6"), DW_AT_const_value(0x06)
    4745              $C$DW$507       .dwtag  DW_TAG_enumerator, DW_AT_name("GPIO_Number_7"), DW_AT_const_value(0x07)
    4746              $C$DW$508       .dwtag  DW_TAG_enumerator, DW_AT_name("GPIO_Rsvd_8"), DW_AT_const_value(0x08)
    4747              $C$DW$509       .dwtag  DW_TAG_enumerator, DW_AT_name("GPIO_Rsvd_9"), DW_AT_const_value(0x09)
    4748              $C$DW$510       .dwtag  DW_TAG_enumerator, DW_AT_name("GPIO_Rsvd_10"), DW_AT_const_value(0x0a)
    4749              $C$DW$511       .dwtag  DW_TAG_enumerator, DW_AT_name("GPIO_Rsvd_11"), DW_AT_const_value(0x0b)
    4750              $C$DW$512       .dwtag  DW_TAG_enumerator, DW_AT_name("GPIO_Number_12"), DW_AT_const_value(0x0c)
    4751              $C$DW$513       .dwtag  DW_TAG_enumerator, DW_AT_name("GPIO_Rsvd_13"), DW_AT_const_value(0x0d)
    4752              $C$DW$514       .dwtag  DW_TAG_enumerator, DW_AT_name("GPIO_Rsvd_14"), DW_AT_const_value(0x0e)
TMS320C2000 Assembler PC v6.2.5 Thu Nov 23 20:51:01 2017

Tools Copyright (c) 1996-2014 Texas Instruments Incorporated
C:\Users\wmj\AppData\Local\Temp\0119610                              PAGE   91

    4753              $C$DW$515       .dwtag  DW_TAG_enumerator, DW_AT_name("GPIO_Rsvd_15"), DW_AT_const_value(0x0f)
    4754              $C$DW$516       .dwtag  DW_TAG_enumerator, DW_AT_name("GPIO_Number_16"), DW_AT_const_value(0x10)
    4755              $C$DW$517       .dwtag  DW_TAG_enumerator, DW_AT_name("GPIO_Number_17"), DW_AT_const_value(0x11)
    4756              $C$DW$518       .dwtag  DW_TAG_enumerator, DW_AT_name("GPIO_Number_18"), DW_AT_const_value(0x12)
    4757              $C$DW$519       .dwtag  DW_TAG_enumerator, DW_AT_name("GPIO_Number_19"), DW_AT_const_value(0x13)
    4758              $C$DW$520       .dwtag  DW_TAG_enumerator, DW_AT_name("GPIO_Rsvd_20"), DW_AT_const_value(0x14)
    4759              $C$DW$521       .dwtag  DW_TAG_enumerator, DW_AT_name("GPIO_Rsvd_21"), DW_AT_const_value(0x15)
    4760              $C$DW$522       .dwtag  DW_TAG_enumerator, DW_AT_name("GPIO_Rsvd_22"), DW_AT_const_value(0x16)
    4761              $C$DW$523       .dwtag  DW_TAG_enumerator, DW_AT_name("GPIO_Rsvd_23"), DW_AT_const_value(0x17)
    4762              $C$DW$524       .dwtag  DW_TAG_enumerator, DW_AT_name("GPIO_Rsvd_24"), DW_AT_const_value(0x18)
    4763              $C$DW$525       .dwtag  DW_TAG_enumerator, DW_AT_name("GPIO_Rsvd_25"), DW_AT_const_value(0x19)
    4764              $C$DW$526       .dwtag  DW_TAG_enumerator, DW_AT_name("GPIO_Rsvd_26"), DW_AT_const_value(0x1a)
    4765              $C$DW$527       .dwtag  DW_TAG_enumerator, DW_AT_name("GPIO_Rsvd_27"), DW_AT_const_value(0x1b)
    4766              $C$DW$528       .dwtag  DW_TAG_enumerator, DW_AT_name("GPIO_Number_28"), DW_AT_const_value(0x1c)
    4767              $C$DW$529       .dwtag  DW_TAG_enumerator, DW_AT_name("GPIO_Number_29"), DW_AT_const_value(0x1d)
    4768              $C$DW$530       .dwtag  DW_TAG_enumerator, DW_AT_name("GPIO_Rsvd_30"), DW_AT_const_value(0x1e)
    4769              $C$DW$531       .dwtag  DW_TAG_enumerator, DW_AT_name("GPIO_Rsvd_31"), DW_AT_const_value(0x1f)
    4770              $C$DW$532       .dwtag  DW_TAG_enumerator, DW_AT_name("GPIO_Number_32"), DW_AT_const_value(0x20)
    4771              $C$DW$533       .dwtag  DW_TAG_enumerator, DW_AT_name("GPIO_Number_33"), DW_AT_const_value(0x21)
    4772              $C$DW$534       .dwtag  DW_TAG_enumerator, DW_AT_name("GPIO_Number_34"), DW_AT_const_value(0x22)
    4773              $C$DW$535       .dwtag  DW_TAG_enumerator, DW_AT_name("GPIO_Number_35"), DW_AT_const_value(0x23)
    4774              $C$DW$536       .dwtag  DW_TAG_enumerator, DW_AT_name("GPIO_Number_36"), DW_AT_const_value(0x24)
    4775              $C$DW$537       .dwtag  DW_TAG_enumerator, DW_AT_name("GPIO_Number_37"), DW_AT_const_value(0x25)
    4776              $C$DW$538       .dwtag  DW_TAG_enumerator, DW_AT_name("GPIO_Number_38"), DW_AT_const_value(0x26)
    4777              $C$DW$539       .dwtag  DW_TAG_enumerator, DW_AT_name("GPIO_numGpios"), DW_AT_const_value(0x27)
    4778                      .dwendtag $C$DW$T$190
    4779              
    4780              $C$DW$T$191     .dwtag  DW_TAG_typedef, DW_AT_name("GPIO_Number_e")
    4781                      .dwattr $C$DW$T$191, DW_AT_type(*$C$DW$T$190)
    4782                      .dwattr $C$DW$T$191, DW_AT_language(DW_LANG_C)
    4783              $C$DW$540       .dwtag  DW_TAG_TI_far_type
    4784                      .dwattr $C$DW$540, DW_AT_type(*$C$DW$T$191)
    4785              $C$DW$T$192     .dwtag  DW_TAG_const_type
    4786                      .dwattr $C$DW$T$192, DW_AT_type(*$C$DW$540)
    4787              
    4788              $C$DW$T$29      .dwtag  DW_TAG_structure_type
    4789                      .dwattr $C$DW$T$29, DW_AT_name("_ADC_Obj_")
    4790                      .dwattr $C$DW$T$29, DW_AT_byte_size(0x6650)
    4791              $C$DW$541       .dwtag  DW_TAG_member
    4792                      .dwattr $C$DW$541, DW_AT_type(*$C$DW$T$23)
    4793                      .dwattr $C$DW$541, DW_AT_name("ADCRESULT")
    4794                      .dwattr $C$DW$541, DW_AT_TI_symbol_name("_ADCRESULT")
    4795                      .dwattr $C$DW$541, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    4796                      .dwattr $C$DW$541, DW_AT_accessibility(DW_ACCESS_public)
    4797              $C$DW$542       .dwtag  DW_TAG_member
    4798                      .dwattr $C$DW$542, DW_AT_type(*$C$DW$T$24)
    4799                      .dwattr $C$DW$542, DW_AT_name("resvd_1")
    4800                      .dwattr $C$DW$542, DW_AT_TI_symbol_name("_resvd_1")
    4801                      .dwattr $C$DW$542, DW_AT_data_member_location[DW_OP_plus_uconst 0x10]
    4802                      .dwattr $C$DW$542, DW_AT_accessibility(DW_ACCESS_public)
    4803              $C$DW$543       .dwtag  DW_TAG_member
    4804                      .dwattr $C$DW$543, DW_AT_type(*$C$DW$T$22)
    4805                      .dwattr $C$DW$543, DW_AT_name("ADCCTL1")
    4806                      .dwattr $C$DW$543, DW_AT_TI_symbol_name("_ADCCTL1")
    4807                      .dwattr $C$DW$543, DW_AT_data_member_location[DW_OP_plus_uconst 0x6600]
TMS320C2000 Assembler PC v6.2.5 Thu Nov 23 20:51:01 2017

Tools Copyright (c) 1996-2014 Texas Instruments Incorporated
C:\Users\wmj\AppData\Local\Temp\0119610                              PAGE   92

    4808                      .dwattr $C$DW$543, DW_AT_accessibility(DW_ACCESS_public)
    4809              $C$DW$544       .dwtag  DW_TAG_member
    4810                      .dwattr $C$DW$544, DW_AT_type(*$C$DW$T$22)
    4811                      .dwattr $C$DW$544, DW_AT_name("ADCCTL2")
    4812                      .dwattr $C$DW$544, DW_AT_TI_symbol_name("_ADCCTL2")
    4813                      .dwattr $C$DW$544, DW_AT_data_member_location[DW_OP_plus_uconst 0x6601]
    4814                      .dwattr $C$DW$544, DW_AT_accessibility(DW_ACCESS_public)
    4815              $C$DW$545       .dwtag  DW_TAG_member
    4816                      .dwattr $C$DW$545, DW_AT_type(*$C$DW$T$25)
    4817                      .dwattr $C$DW$545, DW_AT_name("rsvd_2")
    4818                      .dwattr $C$DW$545, DW_AT_TI_symbol_name("_rsvd_2")
    4819                      .dwattr $C$DW$545, DW_AT_data_member_location[DW_OP_plus_uconst 0x6602]
    4820                      .dwattr $C$DW$545, DW_AT_accessibility(DW_ACCESS_public)
    4821              $C$DW$546       .dwtag  DW_TAG_member
    4822                      .dwattr $C$DW$546, DW_AT_type(*$C$DW$T$22)
    4823                      .dwattr $C$DW$546, DW_AT_name("ADCINTFLG")
    4824                      .dwattr $C$DW$546, DW_AT_TI_symbol_name("_ADCINTFLG")
    4825                      .dwattr $C$DW$546, DW_AT_data_member_location[DW_OP_plus_uconst 0x6604]
    4826                      .dwattr $C$DW$546, DW_AT_accessibility(DW_ACCESS_public)
    4827              $C$DW$547       .dwtag  DW_TAG_member
    4828                      .dwattr $C$DW$547, DW_AT_type(*$C$DW$T$22)
    4829                      .dwattr $C$DW$547, DW_AT_name("ADCINTFLGCLR")
    4830                      .dwattr $C$DW$547, DW_AT_TI_symbol_name("_ADCINTFLGCLR")
    4831                      .dwattr $C$DW$547, DW_AT_data_member_location[DW_OP_plus_uconst 0x6605]
    4832                      .dwattr $C$DW$547, DW_AT_accessibility(DW_ACCESS_public)
    4833              $C$DW$548       .dwtag  DW_TAG_member
    4834                      .dwattr $C$DW$548, DW_AT_type(*$C$DW$T$22)
    4835                      .dwattr $C$DW$548, DW_AT_name("ADCINTOVF")
    4836                      .dwattr $C$DW$548, DW_AT_TI_symbol_name("_ADCINTOVF")
    4837                      .dwattr $C$DW$548, DW_AT_data_member_location[DW_OP_plus_uconst 0x6606]
    4838                      .dwattr $C$DW$548, DW_AT_accessibility(DW_ACCESS_public)
    4839              $C$DW$549       .dwtag  DW_TAG_member
    4840                      .dwattr $C$DW$549, DW_AT_type(*$C$DW$T$22)
    4841                      .dwattr $C$DW$549, DW_AT_name("ADCINTOVFCLR")
    4842                      .dwattr $C$DW$549, DW_AT_TI_symbol_name("_ADCINTOVFCLR")
    4843                      .dwattr $C$DW$549, DW_AT_data_member_location[DW_OP_plus_uconst 0x6607]
    4844                      .dwattr $C$DW$549, DW_AT_accessibility(DW_ACCESS_public)
    4845              $C$DW$550       .dwtag  DW_TAG_member
    4846                      .dwattr $C$DW$550, DW_AT_type(*$C$DW$T$26)
    4847                      .dwattr $C$DW$550, DW_AT_name("INTSELxNy")
    4848                      .dwattr $C$DW$550, DW_AT_TI_symbol_name("_INTSELxNy")
    4849                      .dwattr $C$DW$550, DW_AT_data_member_location[DW_OP_plus_uconst 0x6608]
    4850                      .dwattr $C$DW$550, DW_AT_accessibility(DW_ACCESS_public)
    4851              $C$DW$551       .dwtag  DW_TAG_member
    4852                      .dwattr $C$DW$551, DW_AT_type(*$C$DW$T$27)
    4853                      .dwattr $C$DW$551, DW_AT_name("rsvd_3")
    4854                      .dwattr $C$DW$551, DW_AT_TI_symbol_name("_rsvd_3")
    4855                      .dwattr $C$DW$551, DW_AT_data_member_location[DW_OP_plus_uconst 0x660d]
    4856                      .dwattr $C$DW$551, DW_AT_accessibility(DW_ACCESS_public)
    4857              $C$DW$552       .dwtag  DW_TAG_member
    4858                      .dwattr $C$DW$552, DW_AT_type(*$C$DW$T$22)
    4859                      .dwattr $C$DW$552, DW_AT_name("SOCPRICTRL")
    4860                      .dwattr $C$DW$552, DW_AT_TI_symbol_name("_SOCPRICTRL")
    4861                      .dwattr $C$DW$552, DW_AT_data_member_location[DW_OP_plus_uconst 0x6610]
    4862                      .dwattr $C$DW$552, DW_AT_accessibility(DW_ACCESS_public)
TMS320C2000 Assembler PC v6.2.5 Thu Nov 23 20:51:01 2017

Tools Copyright (c) 1996-2014 Texas Instruments Incorporated
C:\Users\wmj\AppData\Local\Temp\0119610                              PAGE   93

    4863              $C$DW$553       .dwtag  DW_TAG_member
    4864                      .dwattr $C$DW$553, DW_AT_type(*$C$DW$T$22)
    4865                      .dwattr $C$DW$553, DW_AT_name("rsvd_4")
    4866                      .dwattr $C$DW$553, DW_AT_TI_symbol_name("_rsvd_4")
    4867                      .dwattr $C$DW$553, DW_AT_data_member_location[DW_OP_plus_uconst 0x6611]
    4868                      .dwattr $C$DW$553, DW_AT_accessibility(DW_ACCESS_public)
    4869              $C$DW$554       .dwtag  DW_TAG_member
    4870                      .dwattr $C$DW$554, DW_AT_type(*$C$DW$T$22)
    4871                      .dwattr $C$DW$554, DW_AT_name("ADCSAMPLEMODE")
    4872                      .dwattr $C$DW$554, DW_AT_TI_symbol_name("_ADCSAMPLEMODE")
    4873                      .dwattr $C$DW$554, DW_AT_data_member_location[DW_OP_plus_uconst 0x6612]
    4874                      .dwattr $C$DW$554, DW_AT_accessibility(DW_ACCESS_public)
    4875              $C$DW$555       .dwtag  DW_TAG_member
    4876                      .dwattr $C$DW$555, DW_AT_type(*$C$DW$T$22)
    4877                      .dwattr $C$DW$555, DW_AT_name("rsvd_5")
    4878                      .dwattr $C$DW$555, DW_AT_TI_symbol_name("_rsvd_5")
    4879                      .dwattr $C$DW$555, DW_AT_data_member_location[DW_OP_plus_uconst 0x6613]
    4880                      .dwattr $C$DW$555, DW_AT_accessibility(DW_ACCESS_public)
    4881              $C$DW$556       .dwtag  DW_TAG_member
    4882                      .dwattr $C$DW$556, DW_AT_type(*$C$DW$T$22)
    4883                      .dwattr $C$DW$556, DW_AT_name("ADCINTSOCSEL1")
    4884                      .dwattr $C$DW$556, DW_AT_TI_symbol_name("_ADCINTSOCSEL1")
    4885                      .dwattr $C$DW$556, DW_AT_data_member_location[DW_OP_plus_uconst 0x6614]
    4886                      .dwattr $C$DW$556, DW_AT_accessibility(DW_ACCESS_public)
    4887              $C$DW$557       .dwtag  DW_TAG_member
    4888                      .dwattr $C$DW$557, DW_AT_type(*$C$DW$T$22)
    4889                      .dwattr $C$DW$557, DW_AT_name("ADCINTSOCSEL2")
    4890                      .dwattr $C$DW$557, DW_AT_TI_symbol_name("_ADCINTSOCSEL2")
    4891                      .dwattr $C$DW$557, DW_AT_data_member_location[DW_OP_plus_uconst 0x6615]
    4892                      .dwattr $C$DW$557, DW_AT_accessibility(DW_ACCESS_public)
    4893              $C$DW$558       .dwtag  DW_TAG_member
    4894                      .dwattr $C$DW$558, DW_AT_type(*$C$DW$T$25)
    4895                      .dwattr $C$DW$558, DW_AT_name("rsvd_6")
    4896                      .dwattr $C$DW$558, DW_AT_TI_symbol_name("_rsvd_6")
    4897                      .dwattr $C$DW$558, DW_AT_data_member_location[DW_OP_plus_uconst 0x6616]
    4898                      .dwattr $C$DW$558, DW_AT_accessibility(DW_ACCESS_public)
    4899              $C$DW$559       .dwtag  DW_TAG_member
    4900                      .dwattr $C$DW$559, DW_AT_type(*$C$DW$T$22)
    4901                      .dwattr $C$DW$559, DW_AT_name("ADCSOCFLG1")
    4902                      .dwattr $C$DW$559, DW_AT_TI_symbol_name("_ADCSOCFLG1")
    4903                      .dwattr $C$DW$559, DW_AT_data_member_location[DW_OP_plus_uconst 0x6618]
    4904                      .dwattr $C$DW$559, DW_AT_accessibility(DW_ACCESS_public)
    4905              $C$DW$560       .dwtag  DW_TAG_member
    4906                      .dwattr $C$DW$560, DW_AT_type(*$C$DW$T$22)
    4907                      .dwattr $C$DW$560, DW_AT_name("rsvd_7")
    4908                      .dwattr $C$DW$560, DW_AT_TI_symbol_name("_rsvd_7")
    4909                      .dwattr $C$DW$560, DW_AT_data_member_location[DW_OP_plus_uconst 0x6619]
    4910                      .dwattr $C$DW$560, DW_AT_accessibility(DW_ACCESS_public)
    4911              $C$DW$561       .dwtag  DW_TAG_member
    4912                      .dwattr $C$DW$561, DW_AT_type(*$C$DW$T$22)
    4913                      .dwattr $C$DW$561, DW_AT_name("ADCSOCFRC1")
    4914                      .dwattr $C$DW$561, DW_AT_TI_symbol_name("_ADCSOCFRC1")
    4915                      .dwattr $C$DW$561, DW_AT_data_member_location[DW_OP_plus_uconst 0x661a]
    4916                      .dwattr $C$DW$561, DW_AT_accessibility(DW_ACCESS_public)
    4917              $C$DW$562       .dwtag  DW_TAG_member
TMS320C2000 Assembler PC v6.2.5 Thu Nov 23 20:51:01 2017

Tools Copyright (c) 1996-2014 Texas Instruments Incorporated
C:\Users\wmj\AppData\Local\Temp\0119610                              PAGE   94

    4918                      .dwattr $C$DW$562, DW_AT_type(*$C$DW$T$22)
    4919                      .dwattr $C$DW$562, DW_AT_name("rsvd_8")
    4920                      .dwattr $C$DW$562, DW_AT_TI_symbol_name("_rsvd_8")
    4921                      .dwattr $C$DW$562, DW_AT_data_member_location[DW_OP_plus_uconst 0x661b]
    4922                      .dwattr $C$DW$562, DW_AT_accessibility(DW_ACCESS_public)
    4923              $C$DW$563       .dwtag  DW_TAG_member
    4924                      .dwattr $C$DW$563, DW_AT_type(*$C$DW$T$22)
    4925                      .dwattr $C$DW$563, DW_AT_name("ADCSOCOVF1")
    4926                      .dwattr $C$DW$563, DW_AT_TI_symbol_name("_ADCSOCOVF1")
    4927                      .dwattr $C$DW$563, DW_AT_data_member_location[DW_OP_plus_uconst 0x661c]
    4928                      .dwattr $C$DW$563, DW_AT_accessibility(DW_ACCESS_public)
    4929              $C$DW$564       .dwtag  DW_TAG_member
    4930                      .dwattr $C$DW$564, DW_AT_type(*$C$DW$T$22)
    4931                      .dwattr $C$DW$564, DW_AT_name("rsvd_9")
    4932                      .dwattr $C$DW$564, DW_AT_TI_symbol_name("_rsvd_9")
    4933                      .dwattr $C$DW$564, DW_AT_data_member_location[DW_OP_plus_uconst 0x661d]
    4934                      .dwattr $C$DW$564, DW_AT_accessibility(DW_ACCESS_public)
    4935              $C$DW$565       .dwtag  DW_TAG_member
    4936                      .dwattr $C$DW$565, DW_AT_type(*$C$DW$T$22)
    4937                      .dwattr $C$DW$565, DW_AT_name("ADCSOCOVFCLR1")
    4938                      .dwattr $C$DW$565, DW_AT_TI_symbol_name("_ADCSOCOVFCLR1")
    4939                      .dwattr $C$DW$565, DW_AT_data_member_location[DW_OP_plus_uconst 0x661e]
    4940                      .dwattr $C$DW$565, DW_AT_accessibility(DW_ACCESS_public)
    4941              $C$DW$566       .dwtag  DW_TAG_member
    4942                      .dwattr $C$DW$566, DW_AT_type(*$C$DW$T$22)
    4943                      .dwattr $C$DW$566, DW_AT_name("rsvd_10")
    4944                      .dwattr $C$DW$566, DW_AT_TI_symbol_name("_rsvd_10")
    4945                      .dwattr $C$DW$566, DW_AT_data_member_location[DW_OP_plus_uconst 0x661f]
    4946                      .dwattr $C$DW$566, DW_AT_accessibility(DW_ACCESS_public)
    4947              $C$DW$567       .dwtag  DW_TAG_member
    4948                      .dwattr $C$DW$567, DW_AT_type(*$C$DW$T$23)
    4949                      .dwattr $C$DW$567, DW_AT_name("ADCSOCxCTL")
    4950                      .dwattr $C$DW$567, DW_AT_TI_symbol_name("_ADCSOCxCTL")
    4951                      .dwattr $C$DW$567, DW_AT_data_member_location[DW_OP_plus_uconst 0x6620]
    4952                      .dwattr $C$DW$567, DW_AT_accessibility(DW_ACCESS_public)
    4953              $C$DW$568       .dwtag  DW_TAG_member
    4954                      .dwattr $C$DW$568, DW_AT_type(*$C$DW$T$23)
    4955                      .dwattr $C$DW$568, DW_AT_name("rsvd_11")
    4956                      .dwattr $C$DW$568, DW_AT_TI_symbol_name("_rsvd_11")
    4957                      .dwattr $C$DW$568, DW_AT_data_member_location[DW_OP_plus_uconst 0x6630]
    4958                      .dwattr $C$DW$568, DW_AT_accessibility(DW_ACCESS_public)
    4959              $C$DW$569       .dwtag  DW_TAG_member
    4960                      .dwattr $C$DW$569, DW_AT_type(*$C$DW$T$22)
    4961                      .dwattr $C$DW$569, DW_AT_name("ADCREFTRIM")
    4962                      .dwattr $C$DW$569, DW_AT_TI_symbol_name("_ADCREFTRIM")
    4963                      .dwattr $C$DW$569, DW_AT_data_member_location[DW_OP_plus_uconst 0x6640]
    4964                      .dwattr $C$DW$569, DW_AT_accessibility(DW_ACCESS_public)
    4965              $C$DW$570       .dwtag  DW_TAG_member
    4966                      .dwattr $C$DW$570, DW_AT_type(*$C$DW$T$22)
    4967                      .dwattr $C$DW$570, DW_AT_name("ADCOFFTRIM")
    4968                      .dwattr $C$DW$570, DW_AT_TI_symbol_name("_ADCOFFTRIM")
    4969                      .dwattr $C$DW$570, DW_AT_data_member_location[DW_OP_plus_uconst 0x6641]
    4970                      .dwattr $C$DW$570, DW_AT_accessibility(DW_ACCESS_public)
    4971              $C$DW$571       .dwtag  DW_TAG_member
    4972                      .dwattr $C$DW$571, DW_AT_type(*$C$DW$T$28)
TMS320C2000 Assembler PC v6.2.5 Thu Nov 23 20:51:01 2017

Tools Copyright (c) 1996-2014 Texas Instruments Incorporated
C:\Users\wmj\AppData\Local\Temp\0119610                              PAGE   95

    4973                      .dwattr $C$DW$571, DW_AT_name("resvd_12")
    4974                      .dwattr $C$DW$571, DW_AT_TI_symbol_name("_resvd_12")
    4975                      .dwattr $C$DW$571, DW_AT_data_member_location[DW_OP_plus_uconst 0x6642]
    4976                      .dwattr $C$DW$571, DW_AT_accessibility(DW_ACCESS_public)
    4977              $C$DW$572       .dwtag  DW_TAG_member
    4978                      .dwattr $C$DW$572, DW_AT_type(*$C$DW$T$22)
    4979                      .dwattr $C$DW$572, DW_AT_name("ADCREV")
    4980                      .dwattr $C$DW$572, DW_AT_TI_symbol_name("_ADCREV")
    4981                      .dwattr $C$DW$572, DW_AT_data_member_location[DW_OP_plus_uconst 0x664f]
    4982                      .dwattr $C$DW$572, DW_AT_accessibility(DW_ACCESS_public)
    4983                      .dwendtag $C$DW$T$29
    4984              
    4985              $C$DW$T$79      .dwtag  DW_TAG_pointer_type
    4986                      .dwattr $C$DW$T$79, DW_AT_type(*$C$DW$T$29)
    4987                      .dwattr $C$DW$T$79, DW_AT_address_class(0x16)
    4988              $C$DW$T$80      .dwtag  DW_TAG_typedef, DW_AT_name("ADC_Handle")
    4989                      .dwattr $C$DW$T$80, DW_AT_type(*$C$DW$T$79)
    4990                      .dwattr $C$DW$T$80, DW_AT_language(DW_LANG_C)
    4991              
    4992              $C$DW$T$31      .dwtag  DW_TAG_structure_type
    4993                      .dwattr $C$DW$T$31, DW_AT_name("_CLK_Obj_")
    4994                      .dwattr $C$DW$T$31, DW_AT_byte_size(0x11)
    4995              $C$DW$573       .dwtag  DW_TAG_member
    4996                      .dwattr $C$DW$573, DW_AT_type(*$C$DW$T$22)
    4997                      .dwattr $C$DW$573, DW_AT_name("XCLK")
    4998                      .dwattr $C$DW$573, DW_AT_TI_symbol_name("_XCLK")
    4999                      .dwattr $C$DW$573, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    5000                      .dwattr $C$DW$573, DW_AT_accessibility(DW_ACCESS_public)
    5001              $C$DW$574       .dwtag  DW_TAG_member
    5002                      .dwattr $C$DW$574, DW_AT_type(*$C$DW$T$22)
    5003                      .dwattr $C$DW$574, DW_AT_name("rsvd_1")
    5004                      .dwattr $C$DW$574, DW_AT_TI_symbol_name("_rsvd_1")
    5005                      .dwattr $C$DW$574, DW_AT_data_member_location[DW_OP_plus_uconst 0x1]
    5006                      .dwattr $C$DW$574, DW_AT_accessibility(DW_ACCESS_public)
    5007              $C$DW$575       .dwtag  DW_TAG_member
    5008                      .dwattr $C$DW$575, DW_AT_type(*$C$DW$T$22)
    5009                      .dwattr $C$DW$575, DW_AT_name("CLKCTL")
    5010                      .dwattr $C$DW$575, DW_AT_TI_symbol_name("_CLKCTL")
    5011                      .dwattr $C$DW$575, DW_AT_data_member_location[DW_OP_plus_uconst 0x2]
    5012                      .dwattr $C$DW$575, DW_AT_accessibility(DW_ACCESS_public)
    5013              $C$DW$576       .dwtag  DW_TAG_member
    5014                      .dwattr $C$DW$576, DW_AT_type(*$C$DW$T$30)
    5015                      .dwattr $C$DW$576, DW_AT_name("rsvd_2")
    5016                      .dwattr $C$DW$576, DW_AT_TI_symbol_name("_rsvd_2")
    5017                      .dwattr $C$DW$576, DW_AT_data_member_location[DW_OP_plus_uconst 0x3]
    5018                      .dwattr $C$DW$576, DW_AT_accessibility(DW_ACCESS_public)
    5019              $C$DW$577       .dwtag  DW_TAG_member
    5020                      .dwattr $C$DW$577, DW_AT_type(*$C$DW$T$22)
    5021                      .dwattr $C$DW$577, DW_AT_name("LOSPCP")
    5022                      .dwattr $C$DW$577, DW_AT_TI_symbol_name("_LOSPCP")
    5023                      .dwattr $C$DW$577, DW_AT_data_member_location[DW_OP_plus_uconst 0xb]
    5024                      .dwattr $C$DW$577, DW_AT_accessibility(DW_ACCESS_public)
    5025              $C$DW$578       .dwtag  DW_TAG_member
    5026                      .dwattr $C$DW$578, DW_AT_type(*$C$DW$T$22)
    5027                      .dwattr $C$DW$578, DW_AT_name("PCLKCR0")
TMS320C2000 Assembler PC v6.2.5 Thu Nov 23 20:51:01 2017

Tools Copyright (c) 1996-2014 Texas Instruments Incorporated
C:\Users\wmj\AppData\Local\Temp\0119610                              PAGE   96

    5028                      .dwattr $C$DW$578, DW_AT_TI_symbol_name("_PCLKCR0")
    5029                      .dwattr $C$DW$578, DW_AT_data_member_location[DW_OP_plus_uconst 0xc]
    5030                      .dwattr $C$DW$578, DW_AT_accessibility(DW_ACCESS_public)
    5031              $C$DW$579       .dwtag  DW_TAG_member
    5032                      .dwattr $C$DW$579, DW_AT_type(*$C$DW$T$22)
    5033                      .dwattr $C$DW$579, DW_AT_name("PCLKCR1")
    5034                      .dwattr $C$DW$579, DW_AT_TI_symbol_name("_PCLKCR1")
    5035                      .dwattr $C$DW$579, DW_AT_data_member_location[DW_OP_plus_uconst 0xd]
    5036                      .dwattr $C$DW$579, DW_AT_accessibility(DW_ACCESS_public)
    5037              $C$DW$580       .dwtag  DW_TAG_member
    5038                      .dwattr $C$DW$580, DW_AT_type(*$C$DW$T$25)
    5039                      .dwattr $C$DW$580, DW_AT_name("rsvd_3")
    5040                      .dwattr $C$DW$580, DW_AT_TI_symbol_name("_rsvd_3")
    5041                      .dwattr $C$DW$580, DW_AT_data_member_location[DW_OP_plus_uconst 0xe]
    5042                      .dwattr $C$DW$580, DW_AT_accessibility(DW_ACCESS_public)
    5043              $C$DW$581       .dwtag  DW_TAG_member
    5044                      .dwattr $C$DW$581, DW_AT_type(*$C$DW$T$22)
    5045                      .dwattr $C$DW$581, DW_AT_name("PCLKCR3")
    5046                      .dwattr $C$DW$581, DW_AT_TI_symbol_name("_PCLKCR3")
    5047                      .dwattr $C$DW$581, DW_AT_data_member_location[DW_OP_plus_uconst 0x10]
    5048                      .dwattr $C$DW$581, DW_AT_accessibility(DW_ACCESS_public)
    5049                      .dwendtag $C$DW$T$31
    5050              
    5051              $C$DW$T$81      .dwtag  DW_TAG_pointer_type
    5052                      .dwattr $C$DW$T$81, DW_AT_type(*$C$DW$T$31)
    5053                      .dwattr $C$DW$T$81, DW_AT_address_class(0x16)
    5054              $C$DW$T$82      .dwtag  DW_TAG_typedef, DW_AT_name("CLK_Handle")
    5055                      .dwattr $C$DW$T$82, DW_AT_type(*$C$DW$T$81)
    5056                      .dwattr $C$DW$T$82, DW_AT_language(DW_LANG_C)
    5057              
    5058              $C$DW$T$33      .dwtag  DW_TAG_structure_type
    5059                      .dwattr $C$DW$T$33, DW_AT_name("_CPU_Obj_")
    5060                      .dwattr $C$DW$T$33, DW_AT_byte_size(0x01)
    5061              $C$DW$582       .dwtag  DW_TAG_member
    5062                      .dwattr $C$DW$582, DW_AT_type(*$C$DW$T$32)
    5063                      .dwattr $C$DW$582, DW_AT_name("tmp")
    5064                      .dwattr $C$DW$582, DW_AT_TI_symbol_name("_tmp")
    5065                      .dwattr $C$DW$582, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    5066                      .dwattr $C$DW$582, DW_AT_accessibility(DW_ACCESS_public)
    5067                      .dwendtag $C$DW$T$33
    5068              
    5069              $C$DW$T$83      .dwtag  DW_TAG_pointer_type
    5070                      .dwattr $C$DW$T$83, DW_AT_type(*$C$DW$T$33)
    5071                      .dwattr $C$DW$T$83, DW_AT_address_class(0x16)
    5072              $C$DW$T$84      .dwtag  DW_TAG_typedef, DW_AT_name("CPU_Handle")
    5073                      .dwattr $C$DW$T$84, DW_AT_type(*$C$DW$T$83)
    5074                      .dwattr $C$DW$T$84, DW_AT_language(DW_LANG_C)
    5075              
    5076              $C$DW$T$36      .dwtag  DW_TAG_structure_type
    5077                      .dwattr $C$DW$T$36, DW_AT_name("_CTRL_Version_")
    5078                      .dwattr $C$DW$T$36, DW_AT_byte_size(0x04)
    5079              $C$DW$583       .dwtag  DW_TAG_member
    5080                      .dwattr $C$DW$583, DW_AT_type(*$C$DW$T$21)
    5081                      .dwattr $C$DW$583, DW_AT_name("rsvd")
    5082                      .dwattr $C$DW$583, DW_AT_TI_symbol_name("_rsvd")
TMS320C2000 Assembler PC v6.2.5 Thu Nov 23 20:51:01 2017

Tools Copyright (c) 1996-2014 Texas Instruments Incorporated
C:\Users\wmj\AppData\Local\Temp\0119610                              PAGE   97

    5083                      .dwattr $C$DW$583, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    5084                      .dwattr $C$DW$583, DW_AT_accessibility(DW_ACCESS_public)
    5085              $C$DW$584       .dwtag  DW_TAG_member
    5086                      .dwattr $C$DW$584, DW_AT_type(*$C$DW$T$35)
    5087                      .dwattr $C$DW$584, DW_AT_name("targetProc")
    5088                      .dwattr $C$DW$584, DW_AT_TI_symbol_name("_targetProc")
    5089                      .dwattr $C$DW$584, DW_AT_data_member_location[DW_OP_plus_uconst 0x1]
    5090                      .dwattr $C$DW$584, DW_AT_accessibility(DW_ACCESS_public)
    5091              $C$DW$585       .dwtag  DW_TAG_member
    5092                      .dwattr $C$DW$585, DW_AT_type(*$C$DW$T$21)
    5093                      .dwattr $C$DW$585, DW_AT_name("major")
    5094                      .dwattr $C$DW$585, DW_AT_TI_symbol_name("_major")
    5095                      .dwattr $C$DW$585, DW_AT_data_member_location[DW_OP_plus_uconst 0x2]
    5096                      .dwattr $C$DW$585, DW_AT_accessibility(DW_ACCESS_public)
    5097              $C$DW$586       .dwtag  DW_TAG_member
    5098                      .dwattr $C$DW$586, DW_AT_type(*$C$DW$T$21)
    5099                      .dwattr $C$DW$586, DW_AT_name("minor")
    5100                      .dwattr $C$DW$586, DW_AT_TI_symbol_name("_minor")
    5101                      .dwattr $C$DW$586, DW_AT_data_member_location[DW_OP_plus_uconst 0x3]
    5102                      .dwattr $C$DW$586, DW_AT_accessibility(DW_ACCESS_public)
    5103                      .dwendtag $C$DW$T$36
    5104              
    5105              $C$DW$T$145     .dwtag  DW_TAG_typedef, DW_AT_name("CTRL_Version")
    5106                      .dwattr $C$DW$T$145, DW_AT_type(*$C$DW$T$36)
    5107                      .dwattr $C$DW$T$145, DW_AT_language(DW_LANG_C)
    5108              
    5109              $C$DW$T$38      .dwtag  DW_TAG_structure_type
    5110                      .dwattr $C$DW$T$38, DW_AT_name("_FILTER_FO_")
    5111                      .dwattr $C$DW$T$38, DW_AT_byte_size(0x0a)
    5112              $C$DW$587       .dwtag  DW_TAG_member
    5113                      .dwattr $C$DW$587, DW_AT_type(*$C$DW$T$37)
    5114                      .dwattr $C$DW$587, DW_AT_name("a1")
    5115                      .dwattr $C$DW$587, DW_AT_TI_symbol_name("_a1")
    5116                      .dwattr $C$DW$587, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    5117                      .dwattr $C$DW$587, DW_AT_accessibility(DW_ACCESS_public)
    5118              $C$DW$588       .dwtag  DW_TAG_member
    5119                      .dwattr $C$DW$588, DW_AT_type(*$C$DW$T$37)
    5120                      .dwattr $C$DW$588, DW_AT_name("b0")
    5121                      .dwattr $C$DW$588, DW_AT_TI_symbol_name("_b0")
    5122                      .dwattr $C$DW$588, DW_AT_data_member_location[DW_OP_plus_uconst 0x2]
    5123                      .dwattr $C$DW$588, DW_AT_accessibility(DW_ACCESS_public)
    5124              $C$DW$589       .dwtag  DW_TAG_member
    5125                      .dwattr $C$DW$589, DW_AT_type(*$C$DW$T$37)
    5126                      .dwattr $C$DW$589, DW_AT_name("b1")
    5127                      .dwattr $C$DW$589, DW_AT_TI_symbol_name("_b1")
    5128                      .dwattr $C$DW$589, DW_AT_data_member_location[DW_OP_plus_uconst 0x4]
    5129                      .dwattr $C$DW$589, DW_AT_accessibility(DW_ACCESS_public)
    5130              $C$DW$590       .dwtag  DW_TAG_member
    5131                      .dwattr $C$DW$590, DW_AT_type(*$C$DW$T$37)
    5132                      .dwattr $C$DW$590, DW_AT_name("x1")
    5133                      .dwattr $C$DW$590, DW_AT_TI_symbol_name("_x1")
    5134                      .dwattr $C$DW$590, DW_AT_data_member_location[DW_OP_plus_uconst 0x6]
    5135                      .dwattr $C$DW$590, DW_AT_accessibility(DW_ACCESS_public)
    5136              $C$DW$591       .dwtag  DW_TAG_member
    5137                      .dwattr $C$DW$591, DW_AT_type(*$C$DW$T$37)
TMS320C2000 Assembler PC v6.2.5 Thu Nov 23 20:51:01 2017

Tools Copyright (c) 1996-2014 Texas Instruments Incorporated
C:\Users\wmj\AppData\Local\Temp\0119610                              PAGE   98

    5138                      .dwattr $C$DW$591, DW_AT_name("y1")
    5139                      .dwattr $C$DW$591, DW_AT_TI_symbol_name("_y1")
    5140                      .dwattr $C$DW$591, DW_AT_data_member_location[DW_OP_plus_uconst 0x8]
    5141                      .dwattr $C$DW$591, DW_AT_accessibility(DW_ACCESS_public)
    5142                      .dwendtag $C$DW$T$38
    5143              
    5144              $C$DW$T$149     .dwtag  DW_TAG_typedef, DW_AT_name("FILTER_FO_Obj")
    5145                      .dwattr $C$DW$T$149, DW_AT_type(*$C$DW$T$38)
    5146                      .dwattr $C$DW$T$149, DW_AT_language(DW_LANG_C)
    5147              
    5148              $C$DW$T$19      .dwtag  DW_TAG_structure_type
    5149                      .dwattr $C$DW$T$19, DW_AT_name("_FILTER_FO_Obj_")
    5150                      .dwattr $C$DW$T$19, DW_AT_declaration
    5151                      .dwendtag $C$DW$T$19
    5152              
    5153              $C$DW$T$150     .dwtag  DW_TAG_pointer_type
    5154                      .dwattr $C$DW$T$150, DW_AT_type(*$C$DW$T$19)
    5155                      .dwattr $C$DW$T$150, DW_AT_address_class(0x16)
    5156              $C$DW$T$151     .dwtag  DW_TAG_typedef, DW_AT_name("FILTER_FO_Handle")
    5157                      .dwattr $C$DW$T$151, DW_AT_type(*$C$DW$T$150)
    5158                      .dwattr $C$DW$T$151, DW_AT_language(DW_LANG_C)
    5159              
    5160              $C$DW$T$39      .dwtag  DW_TAG_structure_type
    5161                      .dwattr $C$DW$T$39, DW_AT_name("_FLASH_Obj_")
    5162                      .dwattr $C$DW$T$39, DW_AT_byte_size(0x08)
    5163              $C$DW$592       .dwtag  DW_TAG_member
    5164                      .dwattr $C$DW$592, DW_AT_type(*$C$DW$T$22)
    5165                      .dwattr $C$DW$592, DW_AT_name("FOPT")
    5166                      .dwattr $C$DW$592, DW_AT_TI_symbol_name("_FOPT")
    5167                      .dwattr $C$DW$592, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    5168                      .dwattr $C$DW$592, DW_AT_accessibility(DW_ACCESS_public)
    5169              $C$DW$593       .dwtag  DW_TAG_member
    5170                      .dwattr $C$DW$593, DW_AT_type(*$C$DW$T$22)
    5171                      .dwattr $C$DW$593, DW_AT_name("rsvd_1")
    5172                      .dwattr $C$DW$593, DW_AT_TI_symbol_name("_rsvd_1")
    5173                      .dwattr $C$DW$593, DW_AT_data_member_location[DW_OP_plus_uconst 0x1]
    5174                      .dwattr $C$DW$593, DW_AT_accessibility(DW_ACCESS_public)
    5175              $C$DW$594       .dwtag  DW_TAG_member
    5176                      .dwattr $C$DW$594, DW_AT_type(*$C$DW$T$22)
    5177                      .dwattr $C$DW$594, DW_AT_name("FPWR")
    5178                      .dwattr $C$DW$594, DW_AT_TI_symbol_name("_FPWR")
    5179                      .dwattr $C$DW$594, DW_AT_data_member_location[DW_OP_plus_uconst 0x2]
    5180                      .dwattr $C$DW$594, DW_AT_accessibility(DW_ACCESS_public)
    5181              $C$DW$595       .dwtag  DW_TAG_member
    5182                      .dwattr $C$DW$595, DW_AT_type(*$C$DW$T$22)
    5183                      .dwattr $C$DW$595, DW_AT_name("FSTATUS")
    5184                      .dwattr $C$DW$595, DW_AT_TI_symbol_name("_FSTATUS")
    5185                      .dwattr $C$DW$595, DW_AT_data_member_location[DW_OP_plus_uconst 0x3]
    5186                      .dwattr $C$DW$595, DW_AT_accessibility(DW_ACCESS_public)
    5187              $C$DW$596       .dwtag  DW_TAG_member
    5188                      .dwattr $C$DW$596, DW_AT_type(*$C$DW$T$22)
    5189                      .dwattr $C$DW$596, DW_AT_name("FSTDBYWAIT")
    5190                      .dwattr $C$DW$596, DW_AT_TI_symbol_name("_FSTDBYWAIT")
    5191                      .dwattr $C$DW$596, DW_AT_data_member_location[DW_OP_plus_uconst 0x4]
    5192                      .dwattr $C$DW$596, DW_AT_accessibility(DW_ACCESS_public)
TMS320C2000 Assembler PC v6.2.5 Thu Nov 23 20:51:01 2017

Tools Copyright (c) 1996-2014 Texas Instruments Incorporated
C:\Users\wmj\AppData\Local\Temp\0119610                              PAGE   99

    5193              $C$DW$597       .dwtag  DW_TAG_member
    5194                      .dwattr $C$DW$597, DW_AT_type(*$C$DW$T$22)
    5195                      .dwattr $C$DW$597, DW_AT_name("FACTIVEWAIT")
    5196                      .dwattr $C$DW$597, DW_AT_TI_symbol_name("_FACTIVEWAIT")
    5197                      .dwattr $C$DW$597, DW_AT_data_member_location[DW_OP_plus_uconst 0x5]
    5198                      .dwattr $C$DW$597, DW_AT_accessibility(DW_ACCESS_public)
    5199              $C$DW$598       .dwtag  DW_TAG_member
    5200                      .dwattr $C$DW$598, DW_AT_type(*$C$DW$T$22)
    5201                      .dwattr $C$DW$598, DW_AT_name("FBANKWAIT")
    5202                      .dwattr $C$DW$598, DW_AT_TI_symbol_name("_FBANKWAIT")
    5203                      .dwattr $C$DW$598, DW_AT_data_member_location[DW_OP_plus_uconst 0x6]
    5204                      .dwattr $C$DW$598, DW_AT_accessibility(DW_ACCESS_public)
    5205              $C$DW$599       .dwtag  DW_TAG_member
    5206                      .dwattr $C$DW$599, DW_AT_type(*$C$DW$T$22)
    5207                      .dwattr $C$DW$599, DW_AT_name("FOTPWAIT")
    5208                      .dwattr $C$DW$599, DW_AT_TI_symbol_name("_FOTPWAIT")
    5209                      .dwattr $C$DW$599, DW_AT_data_member_location[DW_OP_plus_uconst 0x7]
    5210                      .dwattr $C$DW$599, DW_AT_accessibility(DW_ACCESS_public)
    5211                      .dwendtag $C$DW$T$39
    5212              
    5213              $C$DW$T$85      .dwtag  DW_TAG_pointer_type
    5214                      .dwattr $C$DW$T$85, DW_AT_type(*$C$DW$T$39)
    5215                      .dwattr $C$DW$T$85, DW_AT_address_class(0x16)
    5216              $C$DW$T$86      .dwtag  DW_TAG_typedef, DW_AT_name("FLASH_Handle")
    5217                      .dwattr $C$DW$T$86, DW_AT_type(*$C$DW$T$85)
    5218                      .dwattr $C$DW$T$86, DW_AT_language(DW_LANG_C)
    5219              
    5220              $C$DW$T$60      .dwtag  DW_TAG_structure_type
    5221                      .dwattr $C$DW$T$60, DW_AT_name("_FSM_Obj_")
    5222                      .dwattr $C$DW$T$60, DW_AT_byte_size(0x26)
    5223              $C$DW$600       .dwtag  DW_TAG_member
    5224                      .dwattr $C$DW$600, DW_AT_type(*$C$DW$T$41)
    5225                      .dwattr $C$DW$600, DW_AT_name("motorHandle")
    5226                      .dwattr $C$DW$600, DW_AT_TI_symbol_name("_motorHandle")
    5227                      .dwattr $C$DW$600, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    5228                      .dwattr $C$DW$600, DW_AT_accessibility(DW_ACCESS_public)
    5229              $C$DW$601       .dwtag  DW_TAG_member
    5230                      .dwattr $C$DW$601, DW_AT_type(*$C$DW$T$43)
    5231                      .dwattr $C$DW$601, DW_AT_name("halHandle")
    5232                      .dwattr $C$DW$601, DW_AT_TI_symbol_name("_halHandle")
    5233                      .dwattr $C$DW$601, DW_AT_data_member_location[DW_OP_plus_uconst 0x2]
    5234                      .dwattr $C$DW$601, DW_AT_accessibility(DW_ACCESS_public)
    5235              $C$DW$602       .dwtag  DW_TAG_member
    5236                      .dwattr $C$DW$602, DW_AT_type(*$C$DW$T$45)
    5237                      .dwattr $C$DW$602, DW_AT_name("StBoxHandle")
    5238                      .dwattr $C$DW$602, DW_AT_TI_symbol_name("_StBoxHandle")
    5239                      .dwattr $C$DW$602, DW_AT_data_member_location[DW_OP_plus_uconst 0x4]
    5240                      .dwattr $C$DW$602, DW_AT_accessibility(DW_ACCESS_public)
    5241              $C$DW$603       .dwtag  DW_TAG_member
    5242                      .dwattr $C$DW$603, DW_AT_type(*$C$DW$T$47)
    5243                      .dwattr $C$DW$603, DW_AT_name("FSM_State")
    5244                      .dwattr $C$DW$603, DW_AT_TI_symbol_name("_FSM_State")
    5245                      .dwattr $C$DW$603, DW_AT_data_member_location[DW_OP_plus_uconst 0x6]
    5246                      .dwattr $C$DW$603, DW_AT_accessibility(DW_ACCESS_public)
    5247              $C$DW$604       .dwtag  DW_TAG_member
TMS320C2000 Assembler PC v6.2.5 Thu Nov 23 20:51:01 2017

Tools Copyright (c) 1996-2014 Texas Instruments Incorporated
C:\Users\wmj\AppData\Local\Temp\0119610                              PAGE  100

    5248                      .dwattr $C$DW$604, DW_AT_type(*$C$DW$T$47)
    5249                      .dwattr $C$DW$604, DW_AT_name("FSM_CurState")
    5250                      .dwattr $C$DW$604, DW_AT_TI_symbol_name("_FSM_CurState")
    5251                      .dwattr $C$DW$604, DW_AT_data_member_location[DW_OP_plus_uconst 0x7]
    5252                      .dwattr $C$DW$604, DW_AT_accessibility(DW_ACCESS_public)
    5253              $C$DW$605       .dwtag  DW_TAG_member
    5254                      .dwattr $C$DW$605, DW_AT_type(*$C$DW$T$49)
    5255                      .dwattr $C$DW$605, DW_AT_name("FSM_Trans")
    5256                      .dwattr $C$DW$605, DW_AT_TI_symbol_name("_FSM_Trans")
    5257                      .dwattr $C$DW$605, DW_AT_data_member_location[DW_OP_plus_uconst 0x8]
    5258                      .dwattr $C$DW$605, DW_AT_accessibility(DW_ACCESS_public)
    5259              $C$DW$606       .dwtag  DW_TAG_member
    5260                      .dwattr $C$DW$606, DW_AT_type(*$C$DW$T$51)
    5261                      .dwattr $C$DW$606, DW_AT_name("FSM_Event")
    5262                      .dwattr $C$DW$606, DW_AT_TI_symbol_name("_FSM_Event")
    5263                      .dwattr $C$DW$606, DW_AT_data_member_location[DW_OP_plus_uconst 0x9]
    5264                      .dwattr $C$DW$606, DW_AT_accessibility(DW_ACCESS_public)
    5265              $C$DW$607       .dwtag  DW_TAG_member
    5266                      .dwattr $C$DW$607, DW_AT_type(*$C$DW$T$53)
    5267                      .dwattr $C$DW$607, DW_AT_name("FSM_StMode")
    5268                      .dwattr $C$DW$607, DW_AT_TI_symbol_name("_FSM_StMode")
    5269                      .dwattr $C$DW$607, DW_AT_data_member_location[DW_OP_plus_uconst 0xa]
    5270                      .dwattr $C$DW$607, DW_AT_accessibility(DW_ACCESS_public)
    5271              $C$DW$608       .dwtag  DW_TAG_member
    5272                      .dwattr $C$DW$608, DW_AT_type(*$C$DW$T$21)
    5273                      .dwattr $C$DW$608, DW_AT_name("FSM_ErrFlg")
    5274                      .dwattr $C$DW$608, DW_AT_TI_symbol_name("_FSM_ErrFlg")
    5275                      .dwattr $C$DW$608, DW_AT_data_member_location[DW_OP_plus_uconst 0xb]
    5276                      .dwattr $C$DW$608, DW_AT_accessibility(DW_ACCESS_public)
    5277              $C$DW$609       .dwtag  DW_TAG_member
    5278                      .dwattr $C$DW$609, DW_AT_type(*$C$DW$T$21)
    5279                      .dwattr $C$DW$609, DW_AT_name("FSM_ErrMask")
    5280                      .dwattr $C$DW$609, DW_AT_TI_symbol_name("_FSM_ErrMask")
    5281                      .dwattr $C$DW$609, DW_AT_data_member_location[DW_OP_plus_uconst 0xc]
    5282                      .dwattr $C$DW$609, DW_AT_accessibility(DW_ACCESS_public)
    5283              $C$DW$610       .dwtag  DW_TAG_member
    5284                      .dwattr $C$DW$610, DW_AT_type(*$C$DW$T$21)
    5285                      .dwattr $C$DW$610, DW_AT_name("FSM_runTime")
    5286                      .dwattr $C$DW$610, DW_AT_TI_symbol_name("_FSM_runTime")
    5287                      .dwattr $C$DW$610, DW_AT_data_member_location[DW_OP_plus_uconst 0xd]
    5288                      .dwattr $C$DW$610, DW_AT_accessibility(DW_ACCESS_public)
    5289              $C$DW$611       .dwtag  DW_TAG_member
    5290                      .dwattr $C$DW$611, DW_AT_type(*$C$DW$T$21)
    5291                      .dwattr $C$DW$611, DW_AT_name("FSM_485Cmd")
    5292                      .dwattr $C$DW$611, DW_AT_TI_symbol_name("_FSM_485Cmd")
    5293                      .dwattr $C$DW$611, DW_AT_data_member_location[DW_OP_plus_uconst 0xe]
    5294                      .dwattr $C$DW$611, DW_AT_accessibility(DW_ACCESS_public)
    5295              $C$DW$612       .dwtag  DW_TAG_member
    5296                      .dwattr $C$DW$612, DW_AT_type(*$C$DW$T$47)
    5297                      .dwattr $C$DW$612, DW_AT_name("FSM_485EditState")
    5298                      .dwattr $C$DW$612, DW_AT_TI_symbol_name("_FSM_485EditState")
    5299                      .dwattr $C$DW$612, DW_AT_data_member_location[DW_OP_plus_uconst 0xf]
    5300                      .dwattr $C$DW$612, DW_AT_accessibility(DW_ACCESS_public)
    5301              $C$DW$613       .dwtag  DW_TAG_member
    5302                      .dwattr $C$DW$613, DW_AT_type(*$C$DW$T$55)
TMS320C2000 Assembler PC v6.2.5 Thu Nov 23 20:51:01 2017

Tools Copyright (c) 1996-2014 Texas Instruments Incorporated
C:\Users\wmj\AppData\Local\Temp\0119610                              PAGE  101

    5303                      .dwattr $C$DW$613, DW_AT_name("FSM_485EditOpt")
    5304                      .dwattr $C$DW$613, DW_AT_TI_symbol_name("_FSM_485EditOpt")
    5305                      .dwattr $C$DW$613, DW_AT_data_member_location[DW_OP_plus_uconst 0x10]
    5306                      .dwattr $C$DW$613, DW_AT_accessibility(DW_ACCESS_public)
    5307              $C$DW$614       .dwtag  DW_TAG_member
    5308                      .dwattr $C$DW$614, DW_AT_type(*$C$DW$T$21)
    5309                      .dwattr $C$DW$614, DW_AT_name("FSM_485RefSpeed")
    5310                      .dwattr $C$DW$614, DW_AT_TI_symbol_name("_FSM_485RefSpeed")
    5311                      .dwattr $C$DW$614, DW_AT_data_member_location[DW_OP_plus_uconst 0x11]
    5312                      .dwattr $C$DW$614, DW_AT_accessibility(DW_ACCESS_public)
    5313              $C$DW$615       .dwtag  DW_TAG_member
    5314                      .dwattr $C$DW$615, DW_AT_type(*$C$DW$T$37)
    5315                      .dwattr $C$DW$615, DW_AT_name("MaxTorque_Nm")
    5316                      .dwattr $C$DW$615, DW_AT_TI_symbol_name("_MaxTorque_Nm")
    5317                      .dwattr $C$DW$615, DW_AT_data_member_location[DW_OP_plus_uconst 0x12]
    5318                      .dwattr $C$DW$615, DW_AT_accessibility(DW_ACCESS_public)
    5319              $C$DW$616       .dwtag  DW_TAG_member
    5320                      .dwattr $C$DW$616, DW_AT_type(*$C$DW$T$57)
    5321                      .dwattr $C$DW$616, DW_AT_name("FSM_CheckCond")
    5322                      .dwattr $C$DW$616, DW_AT_TI_symbol_name("_FSM_CheckCond")
    5323                      .dwattr $C$DW$616, DW_AT_data_member_location[DW_OP_plus_uconst 0x14]
    5324                      .dwattr $C$DW$616, DW_AT_accessibility(DW_ACCESS_public)
    5325              $C$DW$617       .dwtag  DW_TAG_member
    5326                      .dwattr $C$DW$617, DW_AT_type(*$C$DW$T$21)
    5327                      .dwattr $C$DW$617, DW_AT_name("FSM_CondValue")
    5328                      .dwattr $C$DW$617, DW_AT_TI_symbol_name("_FSM_CondValue")
    5329                      .dwattr $C$DW$617, DW_AT_data_member_location[DW_OP_plus_uconst 0x15]
    5330                      .dwattr $C$DW$617, DW_AT_accessibility(DW_ACCESS_public)
    5331              $C$DW$618       .dwtag  DW_TAG_member
    5332                      .dwattr $C$DW$618, DW_AT_type(*$C$DW$T$58)
    5333                      .dwattr $C$DW$618, DW_AT_name("OldAbsPos")
    5334                      .dwattr $C$DW$618, DW_AT_TI_symbol_name("_OldAbsPos")
    5335                      .dwattr $C$DW$618, DW_AT_data_member_location[DW_OP_plus_uconst 0x16]
    5336                      .dwattr $C$DW$618, DW_AT_accessibility(DW_ACCESS_public)
    5337              $C$DW$619       .dwtag  DW_TAG_member
    5338                      .dwattr $C$DW$619, DW_AT_type(*$C$DW$T$58)
    5339                      .dwattr $C$DW$619, DW_AT_name("NewAbsPos")
    5340                      .dwattr $C$DW$619, DW_AT_TI_symbol_name("_NewAbsPos")
    5341                      .dwattr $C$DW$619, DW_AT_data_member_location[DW_OP_plus_uconst 0x1a]
    5342                      .dwattr $C$DW$619, DW_AT_accessibility(DW_ACCESS_public)
    5343              $C$DW$620       .dwtag  DW_TAG_member
    5344                      .dwattr $C$DW$620, DW_AT_type(*$C$DW$T$59)
    5345                      .dwattr $C$DW$620, DW_AT_name("Flag_485StartMotor")
    5346                      .dwattr $C$DW$620, DW_AT_TI_symbol_name("_Flag_485StartMotor")
    5347                      .dwattr $C$DW$620, DW_AT_data_member_location[DW_OP_plus_uconst 0x1e]
    5348                      .dwattr $C$DW$620, DW_AT_accessibility(DW_ACCESS_public)
    5349              $C$DW$621       .dwtag  DW_TAG_member
    5350                      .dwattr $C$DW$621, DW_AT_type(*$C$DW$T$59)
    5351                      .dwattr $C$DW$621, DW_AT_name("Flag_MaxTimeLimit")
    5352                      .dwattr $C$DW$621, DW_AT_TI_symbol_name("_Flag_MaxTimeLimit")
    5353                      .dwattr $C$DW$621, DW_AT_data_member_location[DW_OP_plus_uconst 0x1f]
    5354                      .dwattr $C$DW$621, DW_AT_accessibility(DW_ACCESS_public)
    5355              $C$DW$622       .dwtag  DW_TAG_member
    5356                      .dwattr $C$DW$622, DW_AT_type(*$C$DW$T$59)
    5357                      .dwattr $C$DW$622, DW_AT_name("runTime_Enable")
TMS320C2000 Assembler PC v6.2.5 Thu Nov 23 20:51:01 2017

Tools Copyright (c) 1996-2014 Texas Instruments Incorporated
C:\Users\wmj\AppData\Local\Temp\0119610                              PAGE  102

    5358                      .dwattr $C$DW$622, DW_AT_TI_symbol_name("_runTime_Enable")
    5359                      .dwattr $C$DW$622, DW_AT_data_member_location[DW_OP_plus_uconst 0x20]
    5360                      .dwattr $C$DW$622, DW_AT_accessibility(DW_ACCESS_public)
    5361              $C$DW$623       .dwtag  DW_TAG_member
    5362                      .dwattr $C$DW$623, DW_AT_type(*$C$DW$T$59)
    5363                      .dwattr $C$DW$623, DW_AT_name("Flag_StallEnable")
    5364                      .dwattr $C$DW$623, DW_AT_TI_symbol_name("_Flag_StallEnable")
    5365                      .dwattr $C$DW$623, DW_AT_data_member_location[DW_OP_plus_uconst 0x21]
    5366                      .dwattr $C$DW$623, DW_AT_accessibility(DW_ACCESS_public)
    5367              $C$DW$624       .dwtag  DW_TAG_member
    5368                      .dwattr $C$DW$624, DW_AT_type(*$C$DW$T$59)
    5369                      .dwattr $C$DW$624, DW_AT_name("Flag_ReportState")
    5370                      .dwattr $C$DW$624, DW_AT_TI_symbol_name("_Flag_ReportState")
    5371                      .dwattr $C$DW$624, DW_AT_data_member_location[DW_OP_plus_uconst 0x22]
    5372                      .dwattr $C$DW$624, DW_AT_accessibility(DW_ACCESS_public)
    5373              $C$DW$625       .dwtag  DW_TAG_member
    5374                      .dwattr $C$DW$625, DW_AT_type(*$C$DW$T$59)
    5375                      .dwattr $C$DW$625, DW_AT_name("Flag_RunMode")
    5376                      .dwattr $C$DW$625, DW_AT_TI_symbol_name("_Flag_RunMode")
    5377                      .dwattr $C$DW$625, DW_AT_data_member_location[DW_OP_plus_uconst 0x23]
    5378                      .dwattr $C$DW$625, DW_AT_accessibility(DW_ACCESS_public)
    5379              $C$DW$626       .dwtag  DW_TAG_member
    5380                      .dwattr $C$DW$626, DW_AT_type(*$C$DW$T$59)
    5381                      .dwattr $C$DW$626, DW_AT_name("Flag_DcBrake")
    5382                      .dwattr $C$DW$626, DW_AT_TI_symbol_name("_Flag_DcBrake")
    5383                      .dwattr $C$DW$626, DW_AT_data_member_location[DW_OP_plus_uconst 0x24]
    5384                      .dwattr $C$DW$626, DW_AT_accessibility(DW_ACCESS_public)
    5385                      .dwendtag $C$DW$T$60
    5386              
    5387              $C$DW$T$193     .dwtag  DW_TAG_typedef, DW_AT_name("FSM_Obj")
    5388                      .dwattr $C$DW$T$193, DW_AT_type(*$C$DW$T$60)
    5389                      .dwattr $C$DW$T$193, DW_AT_language(DW_LANG_C)
    5390              $C$DW$T$194     .dwtag  DW_TAG_pointer_type
    5391                      .dwattr $C$DW$T$194, DW_AT_type(*$C$DW$T$193)
    5392                      .dwattr $C$DW$T$194, DW_AT_address_class(0x16)
    5393              $C$DW$T$120     .dwtag  DW_TAG_pointer_type
    5394                      .dwattr $C$DW$T$120, DW_AT_type(*$C$DW$T$60)
    5395                      .dwattr $C$DW$T$120, DW_AT_address_class(0x16)
    5396              $C$DW$T$121     .dwtag  DW_TAG_typedef, DW_AT_name("FSM_Handle")
    5397                      .dwattr $C$DW$T$121, DW_AT_type(*$C$DW$T$120)
    5398                      .dwattr $C$DW$T$121, DW_AT_language(DW_LANG_C)
    5399              $C$DW$627       .dwtag  DW_TAG_TI_far_type
    5400                      .dwattr $C$DW$627, DW_AT_type(*$C$DW$T$121)
    5401              $C$DW$T$195     .dwtag  DW_TAG_const_type
    5402                      .dwattr $C$DW$T$195, DW_AT_type(*$C$DW$627)
    5403              
    5404              $C$DW$T$62      .dwtag  DW_TAG_structure_type
    5405                      .dwattr $C$DW$T$62, DW_AT_name("_FSM_Position_t_")
    5406                      .dwattr $C$DW$T$62, DW_AT_byte_size(0x04)
    5407              $C$DW$628       .dwtag  DW_TAG_member
    5408                      .dwattr $C$DW$628, DW_AT_type(*$C$DW$T$61)
    5409                      .dwattr $C$DW$628, DW_AT_name("PosInt_MRev")
    5410                      .dwattr $C$DW$628, DW_AT_TI_symbol_name("_PosInt_MRev")
    5411                      .dwattr $C$DW$628, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    5412                      .dwattr $C$DW$628, DW_AT_accessibility(DW_ACCESS_public)
TMS320C2000 Assembler PC v6.2.5 Thu Nov 23 20:51:01 2017

Tools Copyright (c) 1996-2014 Texas Instruments Incorporated
C:\Users\wmj\AppData\Local\Temp\0119610                              PAGE  103

    5413              $C$DW$629       .dwtag  DW_TAG_member
    5414                      .dwattr $C$DW$629, DW_AT_type(*$C$DW$T$37)
    5415                      .dwattr $C$DW$629, DW_AT_name("PosFrac_MRev")
    5416                      .dwattr $C$DW$629, DW_AT_TI_symbol_name("_PosFrac_MRev")
    5417                      .dwattr $C$DW$629, DW_AT_data_member_location[DW_OP_plus_uconst 0x2]
    5418                      .dwattr $C$DW$629, DW_AT_accessibility(DW_ACCESS_public)
    5419                      .dwendtag $C$DW$T$62
    5420              
    5421              $C$DW$T$58      .dwtag  DW_TAG_typedef, DW_AT_name("FSM_Position_t")
    5422                      .dwattr $C$DW$T$58, DW_AT_type(*$C$DW$T$62)
    5423                      .dwattr $C$DW$T$58, DW_AT_language(DW_LANG_C)
    5424              
    5425              $C$DW$T$71      .dwtag  DW_TAG_structure_type
    5426                      .dwattr $C$DW$T$71, DW_AT_name("_FSM_StatePool_t_")
    5427                      .dwattr $C$DW$T$71, DW_AT_byte_size(0x4b)
    5428              $C$DW$630       .dwtag  DW_TAG_member
    5429                      .dwattr $C$DW$630, DW_AT_type(*$C$DW$T$64)
    5430                      .dwattr $C$DW$630, DW_AT_name("FSM_RefSpeed")
    5431                      .dwattr $C$DW$630, DW_AT_TI_symbol_name("_FSM_RefSpeed")
    5432                      .dwattr $C$DW$630, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    5433                      .dwattr $C$DW$630, DW_AT_accessibility(DW_ACCESS_public)
    5434              $C$DW$631       .dwtag  DW_TAG_member
    5435                      .dwattr $C$DW$631, DW_AT_type(*$C$DW$T$65)
    5436                      .dwattr $C$DW$631, DW_AT_name("FSM_CondValue")
    5437                      .dwattr $C$DW$631, DW_AT_TI_symbol_name("_FSM_CondValue")
    5438                      .dwattr $C$DW$631, DW_AT_data_member_location[DW_OP_plus_uconst 0xf]
    5439                      .dwattr $C$DW$631, DW_AT_accessibility(DW_ACCESS_public)
    5440              $C$DW$632       .dwtag  DW_TAG_member
    5441                      .dwattr $C$DW$632, DW_AT_type(*$C$DW$T$66)
    5442                      .dwattr $C$DW$632, DW_AT_name("FSM_Condition")
    5443                      .dwattr $C$DW$632, DW_AT_TI_symbol_name("_FSM_Condition")
    5444                      .dwattr $C$DW$632, DW_AT_data_member_location[DW_OP_plus_uconst 0x1e]
    5445                      .dwattr $C$DW$632, DW_AT_accessibility(DW_ACCESS_public)
    5446              $C$DW$633       .dwtag  DW_TAG_member
    5447                      .dwattr $C$DW$633, DW_AT_type(*$C$DW$T$69)
    5448                      .dwattr $C$DW$633, DW_AT_name("FSM_RunAction")
    5449                      .dwattr $C$DW$633, DW_AT_TI_symbol_name("_FSM_RunAction")
    5450                      .dwattr $C$DW$633, DW_AT_data_member_location[DW_OP_plus_uconst 0x2d]
    5451                      .dwattr $C$DW$633, DW_AT_accessibility(DW_ACCESS_public)
    5452              $C$DW$634       .dwtag  DW_TAG_member
    5453                      .dwattr $C$DW$634, DW_AT_type(*$C$DW$T$70)
    5454                      .dwattr $C$DW$634, DW_AT_name("FSM_NextState")
    5455                      .dwattr $C$DW$634, DW_AT_TI_symbol_name("_FSM_NextState")
    5456                      .dwattr $C$DW$634, DW_AT_data_member_location[DW_OP_plus_uconst 0x3c]
    5457                      .dwattr $C$DW$634, DW_AT_accessibility(DW_ACCESS_public)
    5458                      .dwendtag $C$DW$T$71
    5459              
    5460              $C$DW$T$44      .dwtag  DW_TAG_pointer_type
    5461                      .dwattr $C$DW$T$44, DW_AT_type(*$C$DW$T$71)
    5462                      .dwattr $C$DW$T$44, DW_AT_address_class(0x16)
    5463              $C$DW$T$45      .dwtag  DW_TAG_typedef, DW_AT_name("StPool_Handle")
    5464                      .dwattr $C$DW$T$45, DW_AT_type(*$C$DW$T$44)
    5465                      .dwattr $C$DW$T$45, DW_AT_language(DW_LANG_C)
    5466              
    5467              $C$DW$T$76      .dwtag  DW_TAG_structure_type
TMS320C2000 Assembler PC v6.2.5 Thu Nov 23 20:51:01 2017

Tools Copyright (c) 1996-2014 Texas Instruments Incorporated
C:\Users\wmj\AppData\Local\Temp\0119610                              PAGE  104

    5468                      .dwattr $C$DW$T$76, DW_AT_name("_GPIO_Obj_")
    5469                      .dwattr $C$DW$T$76, DW_AT_byte_size(0x6a)
    5470              $C$DW$635       .dwtag  DW_TAG_member
    5471                      .dwattr $C$DW$635, DW_AT_type(*$C$DW$T$73)
    5472                      .dwattr $C$DW$635, DW_AT_name("GPACTRL")
    5473                      .dwattr $C$DW$635, DW_AT_TI_symbol_name("_GPACTRL")
    5474                      .dwattr $C$DW$635, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    5475                      .dwattr $C$DW$635, DW_AT_accessibility(DW_ACCESS_public)
    5476              $C$DW$636       .dwtag  DW_TAG_member
    5477                      .dwattr $C$DW$636, DW_AT_type(*$C$DW$T$73)
    5478                      .dwattr $C$DW$636, DW_AT_name("GPAQSEL1")
    5479                      .dwattr $C$DW$636, DW_AT_TI_symbol_name("_GPAQSEL1")
    5480                      .dwattr $C$DW$636, DW_AT_data_member_location[DW_OP_plus_uconst 0x2]
    5481                      .dwattr $C$DW$636, DW_AT_accessibility(DW_ACCESS_public)
    5482              $C$DW$637       .dwtag  DW_TAG_member
    5483                      .dwattr $C$DW$637, DW_AT_type(*$C$DW$T$73)
    5484                      .dwattr $C$DW$637, DW_AT_name("GPAQSEL2")
    5485                      .dwattr $C$DW$637, DW_AT_TI_symbol_name("_GPAQSEL2")
    5486                      .dwattr $C$DW$637, DW_AT_data_member_location[DW_OP_plus_uconst 0x4]
    5487                      .dwattr $C$DW$637, DW_AT_accessibility(DW_ACCESS_public)
    5488              $C$DW$638       .dwtag  DW_TAG_member
    5489                      .dwattr $C$DW$638, DW_AT_type(*$C$DW$T$73)
    5490                      .dwattr $C$DW$638, DW_AT_name("GPAMUX1")
    5491                      .dwattr $C$DW$638, DW_AT_TI_symbol_name("_GPAMUX1")
    5492                      .dwattr $C$DW$638, DW_AT_data_member_location[DW_OP_plus_uconst 0x6]
    5493                      .dwattr $C$DW$638, DW_AT_accessibility(DW_ACCESS_public)
    5494              $C$DW$639       .dwtag  DW_TAG_member
    5495                      .dwattr $C$DW$639, DW_AT_type(*$C$DW$T$73)
    5496                      .dwattr $C$DW$639, DW_AT_name("GPAMUX2")
    5497                      .dwattr $C$DW$639, DW_AT_TI_symbol_name("_GPAMUX2")
    5498                      .dwattr $C$DW$639, DW_AT_data_member_location[DW_OP_plus_uconst 0x8]
    5499                      .dwattr $C$DW$639, DW_AT_accessibility(DW_ACCESS_public)
    5500              $C$DW$640       .dwtag  DW_TAG_member
    5501                      .dwattr $C$DW$640, DW_AT_type(*$C$DW$T$73)
    5502                      .dwattr $C$DW$640, DW_AT_name("GPADIR")
    5503                      .dwattr $C$DW$640, DW_AT_TI_symbol_name("_GPADIR")
    5504                      .dwattr $C$DW$640, DW_AT_data_member_location[DW_OP_plus_uconst 0xa]
    5505                      .dwattr $C$DW$640, DW_AT_accessibility(DW_ACCESS_public)
    5506              $C$DW$641       .dwtag  DW_TAG_member
    5507                      .dwattr $C$DW$641, DW_AT_type(*$C$DW$T$73)
    5508                      .dwattr $C$DW$641, DW_AT_name("GPAPUD")
    5509                      .dwattr $C$DW$641, DW_AT_TI_symbol_name("_GPAPUD")
    5510                      .dwattr $C$DW$641, DW_AT_data_member_location[DW_OP_plus_uconst 0xc]
    5511                      .dwattr $C$DW$641, DW_AT_accessibility(DW_ACCESS_public)
    5512              $C$DW$642       .dwtag  DW_TAG_member
    5513                      .dwattr $C$DW$642, DW_AT_type(*$C$DW$T$25)
    5514                      .dwattr $C$DW$642, DW_AT_name("rsvd_1")
    5515                      .dwattr $C$DW$642, DW_AT_TI_symbol_name("_rsvd_1")
    5516                      .dwattr $C$DW$642, DW_AT_data_member_location[DW_OP_plus_uconst 0xe]
    5517                      .dwattr $C$DW$642, DW_AT_accessibility(DW_ACCESS_public)
    5518              $C$DW$643       .dwtag  DW_TAG_member
    5519                      .dwattr $C$DW$643, DW_AT_type(*$C$DW$T$73)
    5520                      .dwattr $C$DW$643, DW_AT_name("GPBCTRL")
    5521                      .dwattr $C$DW$643, DW_AT_TI_symbol_name("_GPBCTRL")
    5522                      .dwattr $C$DW$643, DW_AT_data_member_location[DW_OP_plus_uconst 0x10]
TMS320C2000 Assembler PC v6.2.5 Thu Nov 23 20:51:01 2017

Tools Copyright (c) 1996-2014 Texas Instruments Incorporated
C:\Users\wmj\AppData\Local\Temp\0119610                              PAGE  105

    5523                      .dwattr $C$DW$643, DW_AT_accessibility(DW_ACCESS_public)
    5524              $C$DW$644       .dwtag  DW_TAG_member
    5525                      .dwattr $C$DW$644, DW_AT_type(*$C$DW$T$73)
    5526                      .dwattr $C$DW$644, DW_AT_name("GPBQSEL1")
    5527                      .dwattr $C$DW$644, DW_AT_TI_symbol_name("_GPBQSEL1")
    5528                      .dwattr $C$DW$644, DW_AT_data_member_location[DW_OP_plus_uconst 0x12]
    5529                      .dwattr $C$DW$644, DW_AT_accessibility(DW_ACCESS_public)
    5530              $C$DW$645       .dwtag  DW_TAG_member
    5531                      .dwattr $C$DW$645, DW_AT_type(*$C$DW$T$25)
    5532                      .dwattr $C$DW$645, DW_AT_name("rsvd_2")
    5533                      .dwattr $C$DW$645, DW_AT_TI_symbol_name("_rsvd_2")
    5534                      .dwattr $C$DW$645, DW_AT_data_member_location[DW_OP_plus_uconst 0x14]
    5535                      .dwattr $C$DW$645, DW_AT_accessibility(DW_ACCESS_public)
    5536              $C$DW$646       .dwtag  DW_TAG_member
    5537                      .dwattr $C$DW$646, DW_AT_type(*$C$DW$T$73)
    5538                      .dwattr $C$DW$646, DW_AT_name("GPBMUX1")
    5539                      .dwattr $C$DW$646, DW_AT_TI_symbol_name("_GPBMUX1")
    5540                      .dwattr $C$DW$646, DW_AT_data_member_location[DW_OP_plus_uconst 0x16]
    5541                      .dwattr $C$DW$646, DW_AT_accessibility(DW_ACCESS_public)
    5542              $C$DW$647       .dwtag  DW_TAG_member
    5543                      .dwattr $C$DW$647, DW_AT_type(*$C$DW$T$25)
    5544                      .dwattr $C$DW$647, DW_AT_name("rsvd_3")
    5545                      .dwattr $C$DW$647, DW_AT_TI_symbol_name("_rsvd_3")
    5546                      .dwattr $C$DW$647, DW_AT_data_member_location[DW_OP_plus_uconst 0x18]
    5547                      .dwattr $C$DW$647, DW_AT_accessibility(DW_ACCESS_public)
    5548              $C$DW$648       .dwtag  DW_TAG_member
    5549                      .dwattr $C$DW$648, DW_AT_type(*$C$DW$T$73)
    5550                      .dwattr $C$DW$648, DW_AT_name("GPBDIR")
    5551                      .dwattr $C$DW$648, DW_AT_TI_symbol_name("_GPBDIR")
    5552                      .dwattr $C$DW$648, DW_AT_data_member_location[DW_OP_plus_uconst 0x1a]
    5553                      .dwattr $C$DW$648, DW_AT_accessibility(DW_ACCESS_public)
    5554              $C$DW$649       .dwtag  DW_TAG_member
    5555                      .dwattr $C$DW$649, DW_AT_type(*$C$DW$T$73)
    5556                      .dwattr $C$DW$649, DW_AT_name("GPBPUD")
    5557                      .dwattr $C$DW$649, DW_AT_TI_symbol_name("_GPBPUD")
    5558                      .dwattr $C$DW$649, DW_AT_data_member_location[DW_OP_plus_uconst 0x1c]
    5559                      .dwattr $C$DW$649, DW_AT_accessibility(DW_ACCESS_public)
    5560              $C$DW$650       .dwtag  DW_TAG_member
    5561                      .dwattr $C$DW$650, DW_AT_type(*$C$DW$T$74)
    5562                      .dwattr $C$DW$650, DW_AT_name("rsvd_4")
    5563                      .dwattr $C$DW$650, DW_AT_TI_symbol_name("_rsvd_4")
    5564                      .dwattr $C$DW$650, DW_AT_data_member_location[DW_OP_plus_uconst 0x1e]
    5565                      .dwattr $C$DW$650, DW_AT_accessibility(DW_ACCESS_public)
    5566              $C$DW$651       .dwtag  DW_TAG_member
    5567                      .dwattr $C$DW$651, DW_AT_type(*$C$DW$T$73)
    5568                      .dwattr $C$DW$651, DW_AT_name("AIOMUX1")
    5569                      .dwattr $C$DW$651, DW_AT_TI_symbol_name("_AIOMUX1")
    5570                      .dwattr $C$DW$651, DW_AT_data_member_location[DW_OP_plus_uconst 0x36]
    5571                      .dwattr $C$DW$651, DW_AT_accessibility(DW_ACCESS_public)
    5572              $C$DW$652       .dwtag  DW_TAG_member
    5573                      .dwattr $C$DW$652, DW_AT_type(*$C$DW$T$25)
    5574                      .dwattr $C$DW$652, DW_AT_name("rsvd_5")
    5575                      .dwattr $C$DW$652, DW_AT_TI_symbol_name("_rsvd_5")
    5576                      .dwattr $C$DW$652, DW_AT_data_member_location[DW_OP_plus_uconst 0x38]
    5577                      .dwattr $C$DW$652, DW_AT_accessibility(DW_ACCESS_public)
TMS320C2000 Assembler PC v6.2.5 Thu Nov 23 20:51:01 2017

Tools Copyright (c) 1996-2014 Texas Instruments Incorporated
C:\Users\wmj\AppData\Local\Temp\0119610                              PAGE  106

    5578              $C$DW$653       .dwtag  DW_TAG_member
    5579                      .dwattr $C$DW$653, DW_AT_type(*$C$DW$T$73)
    5580                      .dwattr $C$DW$653, DW_AT_name("AIODIR")
    5581                      .dwattr $C$DW$653, DW_AT_TI_symbol_name("_AIODIR")
    5582                      .dwattr $C$DW$653, DW_AT_data_member_location[DW_OP_plus_uconst 0x3a]
    5583                      .dwattr $C$DW$653, DW_AT_accessibility(DW_ACCESS_public)
    5584              $C$DW$654       .dwtag  DW_TAG_member
    5585                      .dwattr $C$DW$654, DW_AT_type(*$C$DW$T$75)
    5586                      .dwattr $C$DW$654, DW_AT_name("rsvd_6")
    5587                      .dwattr $C$DW$654, DW_AT_TI_symbol_name("_rsvd_6")
    5588                      .dwattr $C$DW$654, DW_AT_data_member_location[DW_OP_plus_uconst 0x3c]
    5589                      .dwattr $C$DW$654, DW_AT_accessibility(DW_ACCESS_public)
    5590              $C$DW$655       .dwtag  DW_TAG_member
    5591                      .dwattr $C$DW$655, DW_AT_type(*$C$DW$T$73)
    5592                      .dwattr $C$DW$655, DW_AT_name("GPADAT")
    5593                      .dwattr $C$DW$655, DW_AT_TI_symbol_name("_GPADAT")
    5594                      .dwattr $C$DW$655, DW_AT_data_member_location[DW_OP_plus_uconst 0x40]
    5595                      .dwattr $C$DW$655, DW_AT_accessibility(DW_ACCESS_public)
    5596              $C$DW$656       .dwtag  DW_TAG_member
    5597                      .dwattr $C$DW$656, DW_AT_type(*$C$DW$T$73)
    5598                      .dwattr $C$DW$656, DW_AT_name("GPASET")
    5599                      .dwattr $C$DW$656, DW_AT_TI_symbol_name("_GPASET")
    5600                      .dwattr $C$DW$656, DW_AT_data_member_location[DW_OP_plus_uconst 0x42]
    5601                      .dwattr $C$DW$656, DW_AT_accessibility(DW_ACCESS_public)
    5602              $C$DW$657       .dwtag  DW_TAG_member
    5603                      .dwattr $C$DW$657, DW_AT_type(*$C$DW$T$73)
    5604                      .dwattr $C$DW$657, DW_AT_name("GPACLEAR")
    5605                      .dwattr $C$DW$657, DW_AT_TI_symbol_name("_GPACLEAR")
    5606                      .dwattr $C$DW$657, DW_AT_data_member_location[DW_OP_plus_uconst 0x44]
    5607                      .dwattr $C$DW$657, DW_AT_accessibility(DW_ACCESS_public)
    5608              $C$DW$658       .dwtag  DW_TAG_member
    5609                      .dwattr $C$DW$658, DW_AT_type(*$C$DW$T$73)
    5610                      .dwattr $C$DW$658, DW_AT_name("GPATOGGLE")
    5611                      .dwattr $C$DW$658, DW_AT_TI_symbol_name("_GPATOGGLE")
    5612                      .dwattr $C$DW$658, DW_AT_data_member_location[DW_OP_plus_uconst 0x46]
    5613                      .dwattr $C$DW$658, DW_AT_accessibility(DW_ACCESS_public)
    5614              $C$DW$659       .dwtag  DW_TAG_member
    5615                      .dwattr $C$DW$659, DW_AT_type(*$C$DW$T$73)
    5616                      .dwattr $C$DW$659, DW_AT_name("GPBDAT")
    5617                      .dwattr $C$DW$659, DW_AT_TI_symbol_name("_GPBDAT")
    5618                      .dwattr $C$DW$659, DW_AT_data_member_location[DW_OP_plus_uconst 0x48]
    5619                      .dwattr $C$DW$659, DW_AT_accessibility(DW_ACCESS_public)
    5620              $C$DW$660       .dwtag  DW_TAG_member
    5621                      .dwattr $C$DW$660, DW_AT_type(*$C$DW$T$73)
    5622                      .dwattr $C$DW$660, DW_AT_name("GPBSET")
    5623                      .dwattr $C$DW$660, DW_AT_TI_symbol_name("_GPBSET")
    5624                      .dwattr $C$DW$660, DW_AT_data_member_location[DW_OP_plus_uconst 0x4a]
    5625                      .dwattr $C$DW$660, DW_AT_accessibility(DW_ACCESS_public)
    5626              $C$DW$661       .dwtag  DW_TAG_member
    5627                      .dwattr $C$DW$661, DW_AT_type(*$C$DW$T$73)
    5628                      .dwattr $C$DW$661, DW_AT_name("GPBCLEAR")
    5629                      .dwattr $C$DW$661, DW_AT_TI_symbol_name("_GPBCLEAR")
    5630                      .dwattr $C$DW$661, DW_AT_data_member_location[DW_OP_plus_uconst 0x4c]
    5631                      .dwattr $C$DW$661, DW_AT_accessibility(DW_ACCESS_public)
    5632              $C$DW$662       .dwtag  DW_TAG_member
TMS320C2000 Assembler PC v6.2.5 Thu Nov 23 20:51:01 2017

Tools Copyright (c) 1996-2014 Texas Instruments Incorporated
C:\Users\wmj\AppData\Local\Temp\0119610                              PAGE  107

    5633                      .dwattr $C$DW$662, DW_AT_type(*$C$DW$T$73)
    5634                      .dwattr $C$DW$662, DW_AT_name("GPBTOGGLE")
    5635                      .dwattr $C$DW$662, DW_AT_TI_symbol_name("_GPBTOGGLE")
    5636                      .dwattr $C$DW$662, DW_AT_data_member_location[DW_OP_plus_uconst 0x4e]
    5637                      .dwattr $C$DW$662, DW_AT_accessibility(DW_ACCESS_public)
    5638              $C$DW$663       .dwtag  DW_TAG_member
    5639                      .dwattr $C$DW$663, DW_AT_type(*$C$DW$T$30)
    5640                      .dwattr $C$DW$663, DW_AT_name("rsvd_7")
    5641                      .dwattr $C$DW$663, DW_AT_TI_symbol_name("_rsvd_7")
    5642                      .dwattr $C$DW$663, DW_AT_data_member_location[DW_OP_plus_uconst 0x50]
    5643                      .dwattr $C$DW$663, DW_AT_accessibility(DW_ACCESS_public)
    5644              $C$DW$664       .dwtag  DW_TAG_member
    5645                      .dwattr $C$DW$664, DW_AT_type(*$C$DW$T$73)
    5646                      .dwattr $C$DW$664, DW_AT_name("AIODAT")
    5647                      .dwattr $C$DW$664, DW_AT_TI_symbol_name("_AIODAT")
    5648                      .dwattr $C$DW$664, DW_AT_data_member_location[DW_OP_plus_uconst 0x58]
    5649                      .dwattr $C$DW$664, DW_AT_accessibility(DW_ACCESS_public)
    5650              $C$DW$665       .dwtag  DW_TAG_member
    5651                      .dwattr $C$DW$665, DW_AT_type(*$C$DW$T$73)
    5652                      .dwattr $C$DW$665, DW_AT_name("AIOSET")
    5653                      .dwattr $C$DW$665, DW_AT_TI_symbol_name("_AIOSET")
    5654                      .dwattr $C$DW$665, DW_AT_data_member_location[DW_OP_plus_uconst 0x5a]
    5655                      .dwattr $C$DW$665, DW_AT_accessibility(DW_ACCESS_public)
    5656              $C$DW$666       .dwtag  DW_TAG_member
    5657                      .dwattr $C$DW$666, DW_AT_type(*$C$DW$T$73)
    5658                      .dwattr $C$DW$666, DW_AT_name("AIOCLEAR")
    5659                      .dwattr $C$DW$666, DW_AT_TI_symbol_name("_AIOCLEAR")
    5660                      .dwattr $C$DW$666, DW_AT_data_member_location[DW_OP_plus_uconst 0x5c]
    5661                      .dwattr $C$DW$666, DW_AT_accessibility(DW_ACCESS_public)
    5662              $C$DW$667       .dwtag  DW_TAG_member
    5663                      .dwattr $C$DW$667, DW_AT_type(*$C$DW$T$73)
    5664                      .dwattr $C$DW$667, DW_AT_name("AIOTOGGLE")
    5665                      .dwattr $C$DW$667, DW_AT_TI_symbol_name("_AIOTOGGLE")
    5666                      .dwattr $C$DW$667, DW_AT_data_member_location[DW_OP_plus_uconst 0x5e]
    5667                      .dwattr $C$DW$667, DW_AT_accessibility(DW_ACCESS_public)
    5668              $C$DW$668       .dwtag  DW_TAG_member
    5669                      .dwattr $C$DW$668, DW_AT_type(*$C$DW$T$27)
    5670                      .dwattr $C$DW$668, DW_AT_name("GPIOXINTnSEL")
    5671                      .dwattr $C$DW$668, DW_AT_TI_symbol_name("_GPIOXINTnSEL")
    5672                      .dwattr $C$DW$668, DW_AT_data_member_location[DW_OP_plus_uconst 0x60]
    5673                      .dwattr $C$DW$668, DW_AT_accessibility(DW_ACCESS_public)
    5674              $C$DW$669       .dwtag  DW_TAG_member
    5675                      .dwattr $C$DW$669, DW_AT_type(*$C$DW$T$26)
    5676                      .dwattr $C$DW$669, DW_AT_name("rsvd_8")
    5677                      .dwattr $C$DW$669, DW_AT_TI_symbol_name("_rsvd_8")
    5678                      .dwattr $C$DW$669, DW_AT_data_member_location[DW_OP_plus_uconst 0x63]
    5679                      .dwattr $C$DW$669, DW_AT_accessibility(DW_ACCESS_public)
    5680              $C$DW$670       .dwtag  DW_TAG_member
    5681                      .dwattr $C$DW$670, DW_AT_type(*$C$DW$T$73)
    5682                      .dwattr $C$DW$670, DW_AT_name("GPIOLPMSEL")
    5683                      .dwattr $C$DW$670, DW_AT_TI_symbol_name("_GPIOLPMSEL")
    5684                      .dwattr $C$DW$670, DW_AT_data_member_location[DW_OP_plus_uconst 0x68]
    5685                      .dwattr $C$DW$670, DW_AT_accessibility(DW_ACCESS_public)
    5686                      .dwendtag $C$DW$T$76
    5687              
TMS320C2000 Assembler PC v6.2.5 Thu Nov 23 20:51:01 2017

Tools Copyright (c) 1996-2014 Texas Instruments Incorporated
C:\Users\wmj\AppData\Local\Temp\0119610                              PAGE  108

    5688              $C$DW$T$87      .dwtag  DW_TAG_pointer_type
    5689                      .dwattr $C$DW$T$87, DW_AT_type(*$C$DW$T$76)
    5690                      .dwattr $C$DW$T$87, DW_AT_address_class(0x16)
    5691              $C$DW$T$88      .dwtag  DW_TAG_typedef, DW_AT_name("GPIO_Handle")
    5692                      .dwattr $C$DW$T$88, DW_AT_type(*$C$DW$T$87)
    5693                      .dwattr $C$DW$T$88, DW_AT_language(DW_LANG_C)
    5694              $C$DW$671       .dwtag  DW_TAG_TI_far_type
    5695                      .dwattr $C$DW$671, DW_AT_type(*$C$DW$T$88)
    5696              $C$DW$T$197     .dwtag  DW_TAG_const_type
    5697                      .dwattr $C$DW$T$197, DW_AT_type(*$C$DW$671)
    5698              
    5699              $C$DW$T$78      .dwtag  DW_TAG_structure_type
    5700                      .dwattr $C$DW$T$78, DW_AT_name("_HAL_AdcData_t_")
    5701                      .dwattr $C$DW$T$78, DW_AT_byte_size(0x16)
    5702              $C$DW$672       .dwtag  DW_TAG_member
    5703                      .dwattr $C$DW$672, DW_AT_type(*$C$DW$T$77)
    5704                      .dwattr $C$DW$672, DW_AT_name("I")
    5705                      .dwattr $C$DW$672, DW_AT_TI_symbol_name("_I")
    5706                      .dwattr $C$DW$672, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    5707                      .dwattr $C$DW$672, DW_AT_accessibility(DW_ACCESS_public)
    5708              $C$DW$673       .dwtag  DW_TAG_member
    5709                      .dwattr $C$DW$673, DW_AT_type(*$C$DW$T$77)
    5710                      .dwattr $C$DW$673, DW_AT_name("V")
    5711                      .dwattr $C$DW$673, DW_AT_TI_symbol_name("_V")
    5712                      .dwattr $C$DW$673, DW_AT_data_member_location[DW_OP_plus_uconst 0x6]
    5713                      .dwattr $C$DW$673, DW_AT_accessibility(DW_ACCESS_public)
    5714              $C$DW$674       .dwtag  DW_TAG_member
    5715                      .dwattr $C$DW$674, DW_AT_type(*$C$DW$T$37)
    5716                      .dwattr $C$DW$674, DW_AT_name("dcBus")
    5717                      .dwattr $C$DW$674, DW_AT_TI_symbol_name("_dcBus")
    5718                      .dwattr $C$DW$674, DW_AT_data_member_location[DW_OP_plus_uconst 0xc]
    5719                      .dwattr $C$DW$674, DW_AT_accessibility(DW_ACCESS_public)
    5720              $C$DW$675       .dwtag  DW_TAG_member
    5721                      .dwattr $C$DW$675, DW_AT_type(*$C$DW$T$37)
    5722                      .dwattr $C$DW$675, DW_AT_name("analogSensor1")
    5723                      .dwattr $C$DW$675, DW_AT_TI_symbol_name("_analogSensor1")
    5724                      .dwattr $C$DW$675, DW_AT_data_member_location[DW_OP_plus_uconst 0xe]
    5725                      .dwattr $C$DW$675, DW_AT_accessibility(DW_ACCESS_public)
    5726              $C$DW$676       .dwtag  DW_TAG_member
    5727                      .dwattr $C$DW$676, DW_AT_type(*$C$DW$T$37)
    5728                      .dwattr $C$DW$676, DW_AT_name("analogSensor2")
    5729                      .dwattr $C$DW$676, DW_AT_TI_symbol_name("_analogSensor2")
    5730                      .dwattr $C$DW$676, DW_AT_data_member_location[DW_OP_plus_uconst 0x10]
    5731                      .dwattr $C$DW$676, DW_AT_accessibility(DW_ACCESS_public)
    5732              $C$DW$677       .dwtag  DW_TAG_member
    5733                      .dwattr $C$DW$677, DW_AT_type(*$C$DW$T$37)
    5734                      .dwattr $C$DW$677, DW_AT_name("igbtNTC")
    5735                      .dwattr $C$DW$677, DW_AT_TI_symbol_name("_igbtNTC")
    5736                      .dwattr $C$DW$677, DW_AT_data_member_location[DW_OP_plus_uconst 0x12]
    5737                      .dwattr $C$DW$677, DW_AT_accessibility(DW_ACCESS_public)
    5738              $C$DW$678       .dwtag  DW_TAG_member
    5739                      .dwattr $C$DW$678, DW_AT_type(*$C$DW$T$37)
    5740                      .dwattr $C$DW$678, DW_AT_name("boardAddr")
    5741                      .dwattr $C$DW$678, DW_AT_TI_symbol_name("_boardAddr")
    5742                      .dwattr $C$DW$678, DW_AT_data_member_location[DW_OP_plus_uconst 0x14]
TMS320C2000 Assembler PC v6.2.5 Thu Nov 23 20:51:01 2017

Tools Copyright (c) 1996-2014 Texas Instruments Incorporated
C:\Users\wmj\AppData\Local\Temp\0119610                              PAGE  109

    5743                      .dwattr $C$DW$678, DW_AT_accessibility(DW_ACCESS_public)
    5744                      .dwendtag $C$DW$T$78
    5745              
    5746              $C$DW$T$114     .dwtag  DW_TAG_typedef, DW_AT_name("HAL_AdcData_t")
    5747                      .dwattr $C$DW$T$114, DW_AT_type(*$C$DW$T$78)
    5748                      .dwattr $C$DW$T$114, DW_AT_language(DW_LANG_C)
    5749              
    5750              $C$DW$T$117     .dwtag  DW_TAG_structure_type
    5751                      .dwattr $C$DW$T$117, DW_AT_name("_HAL_Obj_")
    5752                      .dwattr $C$DW$T$117, DW_AT_byte_size(0xb4)
    5753              $C$DW$679       .dwtag  DW_TAG_member
    5754                      .dwattr $C$DW$679, DW_AT_type(*$C$DW$T$80)
    5755                      .dwattr $C$DW$679, DW_AT_name("adcHandle")
    5756                      .dwattr $C$DW$679, DW_AT_TI_symbol_name("_adcHandle")
    5757                      .dwattr $C$DW$679, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    5758                      .dwattr $C$DW$679, DW_AT_accessibility(DW_ACCESS_public)
    5759              $C$DW$680       .dwtag  DW_TAG_member
    5760                      .dwattr $C$DW$680, DW_AT_type(*$C$DW$T$82)
    5761                      .dwattr $C$DW$680, DW_AT_name("clkHandle")
    5762                      .dwattr $C$DW$680, DW_AT_TI_symbol_name("_clkHandle")
    5763                      .dwattr $C$DW$680, DW_AT_data_member_location[DW_OP_plus_uconst 0x2]
    5764                      .dwattr $C$DW$680, DW_AT_accessibility(DW_ACCESS_public)
    5765              $C$DW$681       .dwtag  DW_TAG_member
    5766                      .dwattr $C$DW$681, DW_AT_type(*$C$DW$T$84)
    5767                      .dwattr $C$DW$681, DW_AT_name("cpuHandle")
    5768                      .dwattr $C$DW$681, DW_AT_TI_symbol_name("_cpuHandle")
    5769                      .dwattr $C$DW$681, DW_AT_data_member_location[DW_OP_plus_uconst 0x4]
    5770                      .dwattr $C$DW$681, DW_AT_accessibility(DW_ACCESS_public)
    5771              $C$DW$682       .dwtag  DW_TAG_member
    5772                      .dwattr $C$DW$682, DW_AT_type(*$C$DW$T$86)
    5773                      .dwattr $C$DW$682, DW_AT_name("flashHandle")
    5774                      .dwattr $C$DW$682, DW_AT_TI_symbol_name("_flashHandle")
    5775                      .dwattr $C$DW$682, DW_AT_data_member_location[DW_OP_plus_uconst 0x6]
    5776                      .dwattr $C$DW$682, DW_AT_accessibility(DW_ACCESS_public)
    5777              $C$DW$683       .dwtag  DW_TAG_member
    5778                      .dwattr $C$DW$683, DW_AT_type(*$C$DW$T$88)
    5779                      .dwattr $C$DW$683, DW_AT_name("gpioHandle")
    5780                      .dwattr $C$DW$683, DW_AT_TI_symbol_name("_gpioHandle")
    5781                      .dwattr $C$DW$683, DW_AT_data_member_location[DW_OP_plus_uconst 0x8]
    5782                      .dwattr $C$DW$683, DW_AT_accessibility(DW_ACCESS_public)
    5783              $C$DW$684       .dwtag  DW_TAG_member
    5784                      .dwattr $C$DW$684, DW_AT_type(*$C$DW$T$91)
    5785                      .dwattr $C$DW$684, DW_AT_name("offsetHandle_I")
    5786                      .dwattr $C$DW$684, DW_AT_TI_symbol_name("_offsetHandle_I")
    5787                      .dwattr $C$DW$684, DW_AT_data_member_location[DW_OP_plus_uconst 0xa]
    5788                      .dwattr $C$DW$684, DW_AT_accessibility(DW_ACCESS_public)
    5789              $C$DW$685       .dwtag  DW_TAG_member
    5790                      .dwattr $C$DW$685, DW_AT_type(*$C$DW$T$93)
    5791                      .dwattr $C$DW$685, DW_AT_name("offset_I")
    5792                      .dwattr $C$DW$685, DW_AT_TI_symbol_name("_offset_I")
    5793                      .dwattr $C$DW$685, DW_AT_data_member_location[DW_OP_plus_uconst 0x10]
    5794                      .dwattr $C$DW$685, DW_AT_accessibility(DW_ACCESS_public)
    5795              $C$DW$686       .dwtag  DW_TAG_member
    5796                      .dwattr $C$DW$686, DW_AT_type(*$C$DW$T$91)
    5797                      .dwattr $C$DW$686, DW_AT_name("offsetHandle_V")
TMS320C2000 Assembler PC v6.2.5 Thu Nov 23 20:51:01 2017

Tools Copyright (c) 1996-2014 Texas Instruments Incorporated
C:\Users\wmj\AppData\Local\Temp\0119610                              PAGE  110

    5798                      .dwattr $C$DW$686, DW_AT_TI_symbol_name("_offsetHandle_V")
    5799                      .dwattr $C$DW$686, DW_AT_data_member_location[DW_OP_plus_uconst 0x40]
    5800                      .dwattr $C$DW$686, DW_AT_accessibility(DW_ACCESS_public)
    5801              $C$DW$687       .dwtag  DW_TAG_member
    5802                      .dwattr $C$DW$687, DW_AT_type(*$C$DW$T$93)
    5803                      .dwattr $C$DW$687, DW_AT_name("offset_V")
    5804                      .dwattr $C$DW$687, DW_AT_TI_symbol_name("_offset_V")
    5805                      .dwattr $C$DW$687, DW_AT_data_member_location[DW_OP_plus_uconst 0x46]
    5806                      .dwattr $C$DW$687, DW_AT_accessibility(DW_ACCESS_public)
    5807              $C$DW$688       .dwtag  DW_TAG_member
    5808                      .dwattr $C$DW$688, DW_AT_type(*$C$DW$T$95)
    5809                      .dwattr $C$DW$688, DW_AT_name("oscHandle")
    5810                      .dwattr $C$DW$688, DW_AT_TI_symbol_name("_oscHandle")
    5811                      .dwattr $C$DW$688, DW_AT_data_member_location[DW_OP_plus_uconst 0x76]
    5812                      .dwattr $C$DW$688, DW_AT_accessibility(DW_ACCESS_public)
    5813              $C$DW$689       .dwtag  DW_TAG_member
    5814                      .dwattr $C$DW$689, DW_AT_type(*$C$DW$T$97)
    5815                      .dwattr $C$DW$689, DW_AT_name("pieHandle")
    5816                      .dwattr $C$DW$689, DW_AT_TI_symbol_name("_pieHandle")
    5817                      .dwattr $C$DW$689, DW_AT_data_member_location[DW_OP_plus_uconst 0x78]
    5818                      .dwattr $C$DW$689, DW_AT_accessibility(DW_ACCESS_public)
    5819              $C$DW$690       .dwtag  DW_TAG_member
    5820                      .dwattr $C$DW$690, DW_AT_type(*$C$DW$T$99)
    5821                      .dwattr $C$DW$690, DW_AT_name("pllHandle")
    5822                      .dwattr $C$DW$690, DW_AT_TI_symbol_name("_pllHandle")
    5823                      .dwattr $C$DW$690, DW_AT_data_member_location[DW_OP_plus_uconst 0x7a]
    5824                      .dwattr $C$DW$690, DW_AT_accessibility(DW_ACCESS_public)
    5825              $C$DW$691       .dwtag  DW_TAG_member
    5826                      .dwattr $C$DW$691, DW_AT_type(*$C$DW$T$102)
    5827                      .dwattr $C$DW$691, DW_AT_name("pwmHandle")
    5828                      .dwattr $C$DW$691, DW_AT_TI_symbol_name("_pwmHandle")
    5829                      .dwattr $C$DW$691, DW_AT_data_member_location[DW_OP_plus_uconst 0x7c]
    5830                      .dwattr $C$DW$691, DW_AT_accessibility(DW_ACCESS_public)
    5831              $C$DW$692       .dwtag  DW_TAG_member
    5832                      .dwattr $C$DW$692, DW_AT_type(*$C$DW$T$102)
    5833                      .dwattr $C$DW$692, DW_AT_name("pwmDacHandle")
    5834                      .dwattr $C$DW$692, DW_AT_TI_symbol_name("_pwmDacHandle")
    5835                      .dwattr $C$DW$692, DW_AT_data_member_location[DW_OP_plus_uconst 0x82]
    5836                      .dwattr $C$DW$692, DW_AT_accessibility(DW_ACCESS_public)
    5837              $C$DW$693       .dwtag  DW_TAG_member
    5838                      .dwattr $C$DW$693, DW_AT_type(*$C$DW$T$104)
    5839                      .dwattr $C$DW$693, DW_AT_name("pwrHandle")
    5840                      .dwattr $C$DW$693, DW_AT_TI_symbol_name("_pwrHandle")
    5841                      .dwattr $C$DW$693, DW_AT_data_member_location[DW_OP_plus_uconst 0x88]
    5842                      .dwattr $C$DW$693, DW_AT_accessibility(DW_ACCESS_public)
    5843              $C$DW$694       .dwtag  DW_TAG_member
    5844                      .dwattr $C$DW$694, DW_AT_type(*$C$DW$T$107)
    5845                      .dwattr $C$DW$694, DW_AT_name("timerHandle")
    5846                      .dwattr $C$DW$694, DW_AT_TI_symbol_name("_timerHandle")
    5847                      .dwattr $C$DW$694, DW_AT_data_member_location[DW_OP_plus_uconst 0x8a]
    5848                      .dwattr $C$DW$694, DW_AT_accessibility(DW_ACCESS_public)
    5849              $C$DW$695       .dwtag  DW_TAG_member
    5850                      .dwattr $C$DW$695, DW_AT_type(*$C$DW$T$109)
    5851                      .dwattr $C$DW$695, DW_AT_name("spiAHandle")
    5852                      .dwattr $C$DW$695, DW_AT_TI_symbol_name("_spiAHandle")
TMS320C2000 Assembler PC v6.2.5 Thu Nov 23 20:51:01 2017

Tools Copyright (c) 1996-2014 Texas Instruments Incorporated
C:\Users\wmj\AppData\Local\Temp\0119610                              PAGE  111

    5853                      .dwattr $C$DW$695, DW_AT_data_member_location[DW_OP_plus_uconst 0x90]
    5854                      .dwattr $C$DW$695, DW_AT_accessibility(DW_ACCESS_public)
    5855              $C$DW$696       .dwtag  DW_TAG_member
    5856                      .dwattr $C$DW$696, DW_AT_type(*$C$DW$T$111)
    5857                      .dwattr $C$DW$696, DW_AT_name("wdogHandle")
    5858                      .dwattr $C$DW$696, DW_AT_TI_symbol_name("_wdogHandle")
    5859                      .dwattr $C$DW$696, DW_AT_data_member_location[DW_OP_plus_uconst 0x92]
    5860                      .dwattr $C$DW$696, DW_AT_accessibility(DW_ACCESS_public)
    5861              $C$DW$697       .dwtag  DW_TAG_member
    5862                      .dwattr $C$DW$697, DW_AT_type(*$C$DW$T$113)
    5863                      .dwattr $C$DW$697, DW_AT_name("sciHandle")
    5864                      .dwattr $C$DW$697, DW_AT_TI_symbol_name("_sciHandle")
    5865                      .dwattr $C$DW$697, DW_AT_data_member_location[DW_OP_plus_uconst 0x94]
    5866                      .dwattr $C$DW$697, DW_AT_accessibility(DW_ACCESS_public)
    5867              $C$DW$698       .dwtag  DW_TAG_member
    5868                      .dwattr $C$DW$698, DW_AT_type(*$C$DW$T$114)
    5869                      .dwattr $C$DW$698, DW_AT_name("adcBias")
    5870                      .dwattr $C$DW$698, DW_AT_TI_symbol_name("_adcBias")
    5871                      .dwattr $C$DW$698, DW_AT_data_member_location[DW_OP_plus_uconst 0x96]
    5872                      .dwattr $C$DW$698, DW_AT_accessibility(DW_ACCESS_public)
    5873              $C$DW$699       .dwtag  DW_TAG_member
    5874                      .dwattr $C$DW$699, DW_AT_type(*$C$DW$T$37)
    5875                      .dwattr $C$DW$699, DW_AT_name("current_sf")
    5876                      .dwattr $C$DW$699, DW_AT_TI_symbol_name("_current_sf")
    5877                      .dwattr $C$DW$699, DW_AT_data_member_location[DW_OP_plus_uconst 0xac]
    5878                      .dwattr $C$DW$699, DW_AT_accessibility(DW_ACCESS_public)
    5879              $C$DW$700       .dwtag  DW_TAG_member
    5880                      .dwattr $C$DW$700, DW_AT_type(*$C$DW$T$37)
    5881                      .dwattr $C$DW$700, DW_AT_name("voltage_sf")
    5882                      .dwattr $C$DW$700, DW_AT_TI_symbol_name("_voltage_sf")
    5883                      .dwattr $C$DW$700, DW_AT_data_member_location[DW_OP_plus_uconst 0xae]
    5884                      .dwattr $C$DW$700, DW_AT_accessibility(DW_ACCESS_public)
    5885              $C$DW$701       .dwtag  DW_TAG_member
    5886                      .dwattr $C$DW$701, DW_AT_type(*$C$DW$T$32)
    5887                      .dwattr $C$DW$701, DW_AT_name("numCurrentSensors")
    5888                      .dwattr $C$DW$701, DW_AT_TI_symbol_name("_numCurrentSensors")
    5889                      .dwattr $C$DW$701, DW_AT_data_member_location[DW_OP_plus_uconst 0xb0]
    5890                      .dwattr $C$DW$701, DW_AT_accessibility(DW_ACCESS_public)
    5891              $C$DW$702       .dwtag  DW_TAG_member
    5892                      .dwattr $C$DW$702, DW_AT_type(*$C$DW$T$32)
    5893                      .dwattr $C$DW$702, DW_AT_name("numVoltageSensors")
    5894                      .dwattr $C$DW$702, DW_AT_TI_symbol_name("_numVoltageSensors")
    5895                      .dwattr $C$DW$702, DW_AT_data_member_location[DW_OP_plus_uconst 0xb1]
    5896                      .dwattr $C$DW$702, DW_AT_accessibility(DW_ACCESS_public)
    5897              $C$DW$703       .dwtag  DW_TAG_member
    5898                      .dwattr $C$DW$703, DW_AT_type(*$C$DW$T$116)
    5899                      .dwattr $C$DW$703, DW_AT_name("boardAddress")
    5900                      .dwattr $C$DW$703, DW_AT_TI_symbol_name("_boardAddress")
    5901                      .dwattr $C$DW$703, DW_AT_data_member_location[DW_OP_plus_uconst 0xb2]
    5902                      .dwattr $C$DW$703, DW_AT_accessibility(DW_ACCESS_public)
    5903                      .dwendtag $C$DW$T$117
    5904              
    5905              $C$DW$T$199     .dwtag  DW_TAG_typedef, DW_AT_name("HAL_Obj")
    5906                      .dwattr $C$DW$T$199, DW_AT_type(*$C$DW$T$117)
    5907                      .dwattr $C$DW$T$199, DW_AT_language(DW_LANG_C)
TMS320C2000 Assembler PC v6.2.5 Thu Nov 23 20:51:01 2017

Tools Copyright (c) 1996-2014 Texas Instruments Incorporated
C:\Users\wmj\AppData\Local\Temp\0119610                              PAGE  112

    5908              $C$DW$T$42      .dwtag  DW_TAG_pointer_type
    5909                      .dwattr $C$DW$T$42, DW_AT_type(*$C$DW$T$117)
    5910                      .dwattr $C$DW$T$42, DW_AT_address_class(0x16)
    5911              $C$DW$T$43      .dwtag  DW_TAG_typedef, DW_AT_name("HAL_Handle")
    5912                      .dwattr $C$DW$T$43, DW_AT_type(*$C$DW$T$42)
    5913                      .dwattr $C$DW$T$43, DW_AT_language(DW_LANG_C)
    5914              
    5915              $C$DW$T$119     .dwtag  DW_TAG_structure_type
    5916                      .dwattr $C$DW$T$119, DW_AT_name("_MATH_vec3_")
    5917                      .dwattr $C$DW$T$119, DW_AT_byte_size(0x06)
    5918              $C$DW$704       .dwtag  DW_TAG_member
    5919                      .dwattr $C$DW$704, DW_AT_type(*$C$DW$T$118)
    5920                      .dwattr $C$DW$704, DW_AT_name("value")
