TMS320C2000 Assembler PC v6.2.5 Tue Nov 21 21:43:19 2017

Tools Copyright (c) 1996-2014 Texas Instruments Incorporated
C:\Users\wmj\AppData\Local\Temp\0106012                              PAGE    1

       1              ;***************************************************************
       2              ;* TMS320C2000 C/C++ Codegen                         PC v6.2.5 *
       3              ;* Date/Time created: Tue Nov 21 21:43:19 2017                 *
       4              ;***************************************************************
       5                      .compiler_opts --float_support=softlib --hll_source=on --mem_model:code=flat --mem_model:data=large -
       6        0002  FP      .set    XAR2
       7              
       8              $C$DW$CU        .dwtag  DW_TAG_compile_unit
       9                      .dwattr $C$DW$CU, DW_AT_name("D:/BM1000_v1.1/sw/drivers/drvic/motor.c")
      10                      .dwattr $C$DW$CU, DW_AT_producer("TMS320C2000 C/C++ Codegen PC v6.2.5 Copyright (c) 1996-2014 Texas I
      11                      .dwattr $C$DW$CU, DW_AT_TI_version(0x01)
      12                      .dwattr $C$DW$CU, DW_AT_comp_dir("D:\BM1000_v1.1\sw\solutions\instaspin_foc\boards\hvkit_rev1p1\f28x\
      13              ;       C:\ti\ccsv6\tools\compiler\c2000_6.2.5\bin\opt2000.exe C:\\Users\\wmj\\AppData\\Local\\Temp\\010604 C

    1103              $C$DW$133       .dwtag  DW_TAG_enumerator, DW_AT_name("USER_ErrorCode_maxCurrent_Low"), DW_AT_const_value(0x4
    1104              $C$DW$134       .dwtag  DW_TAG_enumerator, DW_AT_name("USER_ErrorCode_maxCurrent_resEst_High"), DW_AT_const_v
    1105              $C$DW$135       .dwtag  DW_TAG_enumerator, DW_AT_name("USER_ErrorCode_maxCurrent_resEst_Low"), DW_AT_const_va
    1106              $C$DW$136       .dwtag  DW_TAG_enumerator, DW_AT_name("USER_ErrorCode_maxCurrent_indEst_High"), DW_AT_const_v
    1107              $C$DW$137       .dwtag  DW_TAG_enumerator, DW_AT_name("USER_ErrorCode_maxCurrent_indEst_Low"), DW_AT_const_va
    1108              $C$DW$138       .dwtag  DW_TAG_enumerator, DW_AT_name("USER_ErrorCode_maxCurrentSlope_High"), DW_AT_const_val
    1109              $C$DW$139       .dwtag  DW_TAG_enumerator, DW_AT_name("USER_ErrorCode_maxCurrentSlope_Low"), DW_AT_const_valu
    1110              $C$DW$140       .dwtag  DW_TAG_enumerator, DW_AT_name("USER_ErrorCode_maxCurrentSlope_powerWarp_High"), DW_AT
    1111              $C$DW$141       .dwtag  DW_TAG_enumerator, DW_AT_name("USER_ErrorCode_maxCurrentSlope_powerWarp_Low"), DW_AT_
    1112              $C$DW$142       .dwtag  DW_TAG_enumerator, DW_AT_name("USER_ErrorCode_IdRated_High"), DW_AT_const_value(0x54)
TMS320C2000 Assembler PC v6.2.5 Tue Nov 21 21:43:19 2017

Tools Copyright (c) 1996-2014 Texas Instruments Incorporated
C:\Users\wmj\AppData\Local\Temp\0106012                              PAGE   22

    1113              $C$DW$143       .dwtag  DW_TAG_enumerator, DW_AT_name("USER_ErrorCode_IdRated_Low"), DW_AT_const_value(0x55)
    1114              $C$DW$144       .dwtag  DW_TAG_enumerator, DW_AT_name("USER_ErrorCode_IdRatedFraction_indEst_High"), DW_AT_co
    1115              $C$DW$145       .dwtag  DW_TAG_enumerator, DW_AT_name("USER_ErrorCode_IdRatedFraction_indEst_Low"), DW_AT_con
    1116              $C$DW$146       .dwtag  DW_TAG_enumerator, DW_AT_name("USER_ErrorCode_IdRatedFraction_ratedFlux_High"), DW_AT
    1117              $C$DW$147       .dwtag  DW_TAG_enumerator, DW_AT_name("USER_ErrorCode_IdRatedFraction_ratedFlux_Low"), DW_AT_
    1118              $C$DW$148       .dwtag  DW_TAG_enumerator, DW_AT_name("USER_ErrorCode_IdRated_delta_High"), DW_AT_const_value
    1119              $C$DW$149       .dwtag  DW_TAG_enumerator, DW_AT_name("USER_ErrorCode_IdRated_delta_Low"), DW_AT_const_value(
    1120              $C$DW$150       .dwtag  DW_TAG_enumerator, DW_AT_name("USER_ErrorCode_fluxEstFreq_Hz_High"), DW_AT_const_valu
    1121              $C$DW$151       .dwtag  DW_TAG_enumerator, DW_AT_name("USER_ErrorCode_fluxEstFreq_Hz_Low"), DW_AT_const_value
    1122              $C$DW$152       .dwtag  DW_TAG_enumerator, DW_AT_name("USER_ErrorCode_ctrlFreq_Hz_High"), DW_AT_const_value(0
    1123              $C$DW$153       .dwtag  DW_TAG_enumerator, DW_AT_name("USER_ErrorCode_ctrlFreq_Hz_Low"), DW_AT_const_value(0x
    1124              $C$DW$154       .dwtag  DW_TAG_enumerator, DW_AT_name("USER_ErrorCode_estFreq_Hz_High"), DW_AT_const_value(0x
    1125              $C$DW$155       .dwtag  DW_TAG_enumerator, DW_AT_name("USER_ErrorCode_estFreq_Hz_Low"), DW_AT_const_value(0x6
    1126              $C$DW$156       .dwtag  DW_TAG_enumerator, DW_AT_name("USER_ErrorCode_RoverL_estFreq_Hz_High"), DW_AT_const_v
    1127              $C$DW$157       .dwtag  DW_TAG_enumerator, DW_AT_name("USER_ErrorCode_RoverL_estFreq_Hz_Low"), DW_AT_const_va
    1128              $C$DW$158       .dwtag  DW_TAG_enumerator, DW_AT_name("USER_ErrorCode_trajFreq_Hz_High"), DW_AT_const_value(0
    1129              $C$DW$159       .dwtag  DW_TAG_enumerator, DW_AT_name("USER_ErrorCode_trajFreq_Hz_Low"), DW_AT_const_value(0x
    1130              $C$DW$160       .dwtag  DW_TAG_enumerator, DW_AT_name("USER_ErrorCode_ctrlPeriod_sec_High"), DW_AT_const_valu
    1131              $C$DW$161       .dwtag  DW_TAG_enumerator, DW_AT_name("USER_ErrorCode_ctrlPeriod_sec_Low"), DW_AT_const_value
    1132              $C$DW$162       .dwtag  DW_TAG_enumerator, DW_AT_name("USER_ErrorCode_maxNegativeIdCurrent_a_High"), DW_AT_co
    1133              $C$DW$163       .dwtag  DW_TAG_enumerator, DW_AT_name("USER_ErrorCode_maxNegativeIdCurrent_a_Low"), DW_AT_con
    1134              $C$DW$164       .dwtag  DW_TAG_enumerator, DW_AT_name("USER_numErrorCodes"), DW_AT_const_value(0x6a)
    1135                      .dwendtag $C$DW$T$31
    1136              
    1137              $C$DW$T$32      .dwtag  DW_TAG_typedef, DW_AT_name("USER_ErrorCode_e")
    1138                      .dwattr $C$DW$T$32, DW_AT_type(*$C$DW$T$31)
    1139                      .dwattr $C$DW$T$32, DW_AT_language(DW_LANG_C)
    1140              
    1141              $C$DW$T$40      .dwtag  DW_TAG_enumeration_type
    1142                      .dwattr $C$DW$T$40, DW_AT_byte_size(0x01)
    1143              $C$DW$165       .dwtag  DW_TAG_enumerator, DW_AT_name("MOTOR_Type_Induction"), DW_AT_const_value(0x00)
    1144              $C$DW$166       .dwtag  DW_TAG_enumerator, DW_AT_name("MOTOR_Type_Pm"), DW_AT_const_value(0x01)
    1145                      .dwendtag $C$DW$T$40
    1146              
    1147              $C$DW$T$41      .dwtag  DW_TAG_typedef, DW_AT_name("MOTOR_Type_e")
    1148                      .dwattr $C$DW$T$41, DW_AT_type(*$C$DW$T$40)
    1149                      .dwattr $C$DW$T$41, DW_AT_language(DW_LANG_C)
    1150              
    1151              $C$DW$T$22      .dwtag  DW_TAG_structure_type
    1152                      .dwattr $C$DW$T$22, DW_AT_name("_CTRL_Version_")
    1153                      .dwattr $C$DW$T$22, DW_AT_byte_size(0x04)
    1154              $C$DW$167       .dwtag  DW_TAG_member
    1155                      .dwattr $C$DW$167, DW_AT_type(*$C$DW$T$19)
    1156                      .dwattr $C$DW$167, DW_AT_name("rsvd")
    1157                      .dwattr $C$DW$167, DW_AT_TI_symbol_name("_rsvd")
    1158                      .dwattr $C$DW$167, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    1159                      .dwattr $C$DW$167, DW_AT_accessibility(DW_ACCESS_public)
    1160              $C$DW$168       .dwtag  DW_TAG_member
    1161                      .dwattr $C$DW$168, DW_AT_type(*$C$DW$T$21)
    1162                      .dwattr $C$DW$168, DW_AT_name("targetProc")
    1163                      .dwattr $C$DW$168, DW_AT_TI_symbol_name("_targetProc")
    1164                      .dwattr $C$DW$168, DW_AT_data_member_location[DW_OP_plus_uconst 0x1]
    1165                      .dwattr $C$DW$168, DW_AT_accessibility(DW_ACCESS_public)
    1166              $C$DW$169       .dwtag  DW_TAG_member
    1167                      .dwattr $C$DW$169, DW_AT_type(*$C$DW$T$19)
TMS320C2000 Assembler PC v6.2.5 Tue Nov 21 21:43:19 2017

Tools Copyright (c) 1996-2014 Texas Instruments Incorporated
C:\Users\wmj\AppData\Local\Temp\0106012                              PAGE   23

    1168                      .dwattr $C$DW$169, DW_AT_name("major")
    1169                      .dwattr $C$DW$169, DW_AT_TI_symbol_name("_major")
    1170                      .dwattr $C$DW$169, DW_AT_data_member_location[DW_OP_plus_uconst 0x2]
    1171                      .dwattr $C$DW$169, DW_AT_accessibility(DW_ACCESS_public)
    1172              $C$DW$170       .dwtag  DW_TAG_member
    1173                      .dwattr $C$DW$170, DW_AT_type(*$C$DW$T$19)
    1174                      .dwattr $C$DW$170, DW_AT_name("minor")
    1175                      .dwattr $C$DW$170, DW_AT_TI_symbol_name("_minor")
    1176                      .dwattr $C$DW$170, DW_AT_data_member_location[DW_OP_plus_uconst 0x3]
    1177                      .dwattr $C$DW$170, DW_AT_accessibility(DW_ACCESS_public)
    1178                      .dwendtag $C$DW$T$22
    1179              
    1180              $C$DW$T$33      .dwtag  DW_TAG_typedef, DW_AT_name("CTRL_Version")
    1181                      .dwattr $C$DW$T$33, DW_AT_type(*$C$DW$T$22)
    1182                      .dwattr $C$DW$T$33, DW_AT_language(DW_LANG_C)
    1183              
    1184              $C$DW$T$25      .dwtag  DW_TAG_structure_type
    1185                      .dwattr $C$DW$T$25, DW_AT_name("_MATH_vec3_")
    1186                      .dwattr $C$DW$T$25, DW_AT_byte_size(0x06)
    1187              $C$DW$171       .dwtag  DW_TAG_member
    1188                      .dwattr $C$DW$171, DW_AT_type(*$C$DW$T$24)
    1189                      .dwattr $C$DW$171, DW_AT_name("value")
    1190                      .dwattr $C$DW$171, DW_AT_TI_symbol_name("_value")
    1191                      .dwattr $C$DW$171, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    1192                      .dwattr $C$DW$171, DW_AT_accessibility(DW_ACCESS_public)
    1193                      .dwendtag $C$DW$T$25
    1194              
    1195              $C$DW$T$36      .dwtag  DW_TAG_typedef, DW_AT_name("MATH_vec3")
    1196                      .dwattr $C$DW$T$36, DW_AT_type(*$C$DW$T$25)
    1197                      .dwattr $C$DW$T$36, DW_AT_language(DW_LANG_C)
    1198              
    1199              $C$DW$T$37      .dwtag  DW_TAG_structure_type
    1200                      .dwattr $C$DW$T$37, DW_AT_name("_MOTOR_Obj_")
    1201                      .dwattr $C$DW$T$37, DW_AT_byte_size(0x70)
    1202              $C$DW$172       .dwtag  DW_TAG_member
    1203                      .dwattr $C$DW$172, DW_AT_type(*$C$DW$T$26)
    1204                      .dwattr $C$DW$172, DW_AT_name("Flag_enableSys")
    1205                      .dwattr $C$DW$172, DW_AT_TI_symbol_name("_Flag_enableSys")
    1206                      .dwattr $C$DW$172, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    1207                      .dwattr $C$DW$172, DW_AT_accessibility(DW_ACCESS_public)
    1208              $C$DW$173       .dwtag  DW_TAG_member
    1209                      .dwattr $C$DW$173, DW_AT_type(*$C$DW$T$26)
    1210                      .dwattr $C$DW$173, DW_AT_name("Flag_Run_Identify")
    1211                      .dwattr $C$DW$173, DW_AT_TI_symbol_name("_Flag_Run_Identify")
    1212                      .dwattr $C$DW$173, DW_AT_data_member_location[DW_OP_plus_uconst 0x1]
    1213                      .dwattr $C$DW$173, DW_AT_accessibility(DW_ACCESS_public)
    1214              $C$DW$174       .dwtag  DW_TAG_member
    1215                      .dwattr $C$DW$174, DW_AT_type(*$C$DW$T$26)
    1216                      .dwattr $C$DW$174, DW_AT_name("Flag_MotorIdentified")
    1217                      .dwattr $C$DW$174, DW_AT_TI_symbol_name("_Flag_MotorIdentified")
    1218                      .dwattr $C$DW$174, DW_AT_data_member_location[DW_OP_plus_uconst 0x2]
    1219                      .dwattr $C$DW$174, DW_AT_accessibility(DW_ACCESS_public)
    1220              $C$DW$175       .dwtag  DW_TAG_member
    1221                      .dwattr $C$DW$175, DW_AT_type(*$C$DW$T$26)
    1222                      .dwattr $C$DW$175, DW_AT_name("Flag_enableForceAngle")
TMS320C2000 Assembler PC v6.2.5 Tue Nov 21 21:43:19 2017

Tools Copyright (c) 1996-2014 Texas Instruments Incorporated
C:\Users\wmj\AppData\Local\Temp\0106012                              PAGE   24

    1223                      .dwattr $C$DW$175, DW_AT_TI_symbol_name("_Flag_enableForceAngle")
    1224                      .dwattr $C$DW$175, DW_AT_data_member_location[DW_OP_plus_uconst 0x3]
    1225                      .dwattr $C$DW$175, DW_AT_accessibility(DW_ACCESS_public)
    1226              $C$DW$176       .dwtag  DW_TAG_member
    1227                      .dwattr $C$DW$176, DW_AT_type(*$C$DW$T$26)
    1228                      .dwattr $C$DW$176, DW_AT_name("Flag_ZeroPiont_Identify")
    1229                      .dwattr $C$DW$176, DW_AT_TI_symbol_name("_Flag_ZeroPiont_Identify")
    1230                      .dwattr $C$DW$176, DW_AT_data_member_location[DW_OP_plus_uconst 0x4]
    1231                      .dwattr $C$DW$176, DW_AT_accessibility(DW_ACCESS_public)
    1232              $C$DW$177       .dwtag  DW_TAG_member
    1233                      .dwattr $C$DW$177, DW_AT_type(*$C$DW$T$26)
    1234                      .dwattr $C$DW$177, DW_AT_name("Flag_enableRsRecalc")
    1235                      .dwattr $C$DW$177, DW_AT_TI_symbol_name("_Flag_enableRsRecalc")
    1236                      .dwattr $C$DW$177, DW_AT_data_member_location[DW_OP_plus_uconst 0x5]
    1237                      .dwattr $C$DW$177, DW_AT_accessibility(DW_ACCESS_public)
    1238              $C$DW$178       .dwtag  DW_TAG_member
    1239                      .dwattr $C$DW$178, DW_AT_type(*$C$DW$T$26)
    1240                      .dwattr $C$DW$178, DW_AT_name("Flag_enableUserParams")
    1241                      .dwattr $C$DW$178, DW_AT_TI_symbol_name("_Flag_enableUserParams")
    1242                      .dwattr $C$DW$178, DW_AT_data_member_location[DW_OP_plus_uconst 0x6]
    1243                      .dwattr $C$DW$178, DW_AT_accessibility(DW_ACCESS_public)
    1244              $C$DW$179       .dwtag  DW_TAG_member
    1245                      .dwattr $C$DW$179, DW_AT_type(*$C$DW$T$26)
    1246                      .dwattr $C$DW$179, DW_AT_name("Flag_enableOffsetcalc")
    1247                      .dwattr $C$DW$179, DW_AT_TI_symbol_name("_Flag_enableOffsetcalc")
    1248                      .dwattr $C$DW$179, DW_AT_data_member_location[DW_OP_plus_uconst 0x7]
    1249                      .dwattr $C$DW$179, DW_AT_accessibility(DW_ACCESS_public)
    1250              $C$DW$180       .dwtag  DW_TAG_member
    1251                      .dwattr $C$DW$180, DW_AT_type(*$C$DW$T$26)
    1252                      .dwattr $C$DW$180, DW_AT_name("Flag_enablePowerWarp")
    1253                      .dwattr $C$DW$180, DW_AT_TI_symbol_name("_Flag_enablePowerWarp")
    1254                      .dwattr $C$DW$180, DW_AT_data_member_location[DW_OP_plus_uconst 0x8]
    1255                      .dwattr $C$DW$180, DW_AT_accessibility(DW_ACCESS_public)
    1256              $C$DW$181       .dwtag  DW_TAG_member
    1257                      .dwattr $C$DW$181, DW_AT_type(*$C$DW$T$26)
    1258                      .dwattr $C$DW$181, DW_AT_name("Flag_enableSpeedCtrl")
    1259                      .dwattr $C$DW$181, DW_AT_TI_symbol_name("_Flag_enableSpeedCtrl")
    1260                      .dwattr $C$DW$181, DW_AT_data_member_location[DW_OP_plus_uconst 0x9]
    1261                      .dwattr $C$DW$181, DW_AT_accessibility(DW_ACCESS_public)
    1262              $C$DW$182       .dwtag  DW_TAG_member
    1263                      .dwattr $C$DW$182, DW_AT_type(*$C$DW$T$26)
    1264                      .dwattr $C$DW$182, DW_AT_name("Flag_enableRun")
    1265                      .dwattr $C$DW$182, DW_AT_TI_symbol_name("_Flag_enableRun")
    1266                      .dwattr $C$DW$182, DW_AT_data_member_location[DW_OP_plus_uconst 0xa]
    1267                      .dwattr $C$DW$182, DW_AT_accessibility(DW_ACCESS_public)
    1268              $C$DW$183       .dwtag  DW_TAG_member
    1269                      .dwattr $C$DW$183, DW_AT_type(*$C$DW$T$26)
    1270                      .dwattr $C$DW$183, DW_AT_name("Flag_RunState")
    1271                      .dwattr $C$DW$183, DW_AT_TI_symbol_name("_Flag_RunState")
    1272                      .dwattr $C$DW$183, DW_AT_data_member_location[DW_OP_plus_uconst 0xb]
    1273                      .dwattr $C$DW$183, DW_AT_accessibility(DW_ACCESS_public)
    1274              $C$DW$184       .dwtag  DW_TAG_member
    1275                      .dwattr $C$DW$184, DW_AT_type(*$C$DW$T$26)
    1276                      .dwattr $C$DW$184, DW_AT_name("Flag_enableFlyingStart")
    1277                      .dwattr $C$DW$184, DW_AT_TI_symbol_name("_Flag_enableFlyingStart")
TMS320C2000 Assembler PC v6.2.5 Tue Nov 21 21:43:19 2017

Tools Copyright (c) 1996-2014 Texas Instruments Incorporated
C:\Users\wmj\AppData\Local\Temp\0106012                              PAGE   25

    1278                      .dwattr $C$DW$184, DW_AT_data_member_location[DW_OP_plus_uconst 0xc]
    1279                      .dwattr $C$DW$184, DW_AT_accessibility(DW_ACCESS_public)
    1280              $C$DW$185       .dwtag  DW_TAG_member
    1281                      .dwattr $C$DW$185, DW_AT_type(*$C$DW$T$26)
    1282                      .dwattr $C$DW$185, DW_AT_name("Flag_ContactSensor")
    1283                      .dwattr $C$DW$185, DW_AT_TI_symbol_name("_Flag_ContactSensor")
    1284                      .dwattr $C$DW$185, DW_AT_data_member_location[DW_OP_plus_uconst 0xd]
    1285                      .dwattr $C$DW$185, DW_AT_accessibility(DW_ACCESS_public)
    1286              $C$DW$186       .dwtag  DW_TAG_member
    1287                      .dwattr $C$DW$186, DW_AT_type(*$C$DW$T$26)
    1288                      .dwattr $C$DW$186, DW_AT_name("RunPositionProfile")
    1289                      .dwattr $C$DW$186, DW_AT_TI_symbol_name("_RunPositionProfile")
    1290                      .dwattr $C$DW$186, DW_AT_data_member_location[DW_OP_plus_uconst 0xe]
    1291                      .dwattr $C$DW$186, DW_AT_accessibility(DW_ACCESS_public)
    1292              $C$DW$187       .dwtag  DW_TAG_member
    1293                      .dwattr $C$DW$187, DW_AT_type(*$C$DW$T$26)
    1294                      .dwattr $C$DW$187, DW_AT_name("getSensor")
    1295                      .dwattr $C$DW$187, DW_AT_TI_symbol_name("_getSensor")
    1296                      .dwattr $C$DW$187, DW_AT_data_member_location[DW_OP_plus_uconst 0xf]
    1297                      .dwattr $C$DW$187, DW_AT_accessibility(DW_ACCESS_public)
    1298              $C$DW$188       .dwtag  DW_TAG_member
    1299                      .dwattr $C$DW$188, DW_AT_type(*$C$DW$T$26)
    1300                      .dwattr $C$DW$188, DW_AT_name("Flag_UseSpinTAC")
    1301                      .dwattr $C$DW$188, DW_AT_TI_symbol_name("_Flag_UseSpinTAC")
    1302                      .dwattr $C$DW$188, DW_AT_data_member_location[DW_OP_plus_uconst 0x10]
    1303                      .dwattr $C$DW$188, DW_AT_accessibility(DW_ACCESS_public)
    1304              $C$DW$189       .dwtag  DW_TAG_member
    1305                      .dwattr $C$DW$189, DW_AT_type(*$C$DW$T$26)
    1306                      .dwattr $C$DW$189, DW_AT_name("Flag_MotorParamsEst")
    1307                      .dwattr $C$DW$189, DW_AT_TI_symbol_name("_Flag_MotorParamsEst")
    1308                      .dwattr $C$DW$189, DW_AT_data_member_location[DW_OP_plus_uconst 0x11]
    1309                      .dwattr $C$DW$189, DW_AT_accessibility(DW_ACCESS_public)
    1310              $C$DW$190       .dwtag  DW_TAG_member
    1311                      .dwattr $C$DW$190, DW_AT_type(*$C$DW$T$28)
    1312                      .dwattr $C$DW$190, DW_AT_name("CtrlState")
    1313                      .dwattr $C$DW$190, DW_AT_TI_symbol_name("_CtrlState")
    1314                      .dwattr $C$DW$190, DW_AT_data_member_location[DW_OP_plus_uconst 0x12]
    1315                      .dwattr $C$DW$190, DW_AT_accessibility(DW_ACCESS_public)
    1316              $C$DW$191       .dwtag  DW_TAG_member
    1317                      .dwattr $C$DW$191, DW_AT_type(*$C$DW$T$30)
    1318                      .dwattr $C$DW$191, DW_AT_name("EstState")
    1319                      .dwattr $C$DW$191, DW_AT_TI_symbol_name("_EstState")
    1320                      .dwattr $C$DW$191, DW_AT_data_member_location[DW_OP_plus_uconst 0x13]
    1321                      .dwattr $C$DW$191, DW_AT_accessibility(DW_ACCESS_public)
    1322              $C$DW$192       .dwtag  DW_TAG_member
    1323                      .dwattr $C$DW$192, DW_AT_type(*$C$DW$T$32)
    1324                      .dwattr $C$DW$192, DW_AT_name("UserErrorCode")
    1325                      .dwattr $C$DW$192, DW_AT_TI_symbol_name("_UserErrorCode")
    1326                      .dwattr $C$DW$192, DW_AT_data_member_location[DW_OP_plus_uconst 0x14]
    1327                      .dwattr $C$DW$192, DW_AT_accessibility(DW_ACCESS_public)
    1328              $C$DW$193       .dwtag  DW_TAG_member
    1329                      .dwattr $C$DW$193, DW_AT_type(*$C$DW$T$33)
    1330                      .dwattr $C$DW$193, DW_AT_name("CtrlVersion")
    1331                      .dwattr $C$DW$193, DW_AT_TI_symbol_name("_CtrlVersion")
    1332                      .dwattr $C$DW$193, DW_AT_data_member_location[DW_OP_plus_uconst 0x15]
TMS320C2000 Assembler PC v6.2.5 Tue Nov 21 21:43:19 2017

Tools Copyright (c) 1996-2014 Texas Instruments Incorporated
C:\Users\wmj\AppData\Local\Temp\0106012                              PAGE   26

    1333                      .dwattr $C$DW$193, DW_AT_accessibility(DW_ACCESS_public)
    1334              $C$DW$194       .dwtag  DW_TAG_member
    1335                      .dwattr $C$DW$194, DW_AT_type(*$C$DW$T$23)
    1336                      .dwattr $C$DW$194, DW_AT_name("SpeedRef_krpm")
    1337                      .dwattr $C$DW$194, DW_AT_TI_symbol_name("_SpeedRef_krpm")
    1338                      .dwattr $C$DW$194, DW_AT_data_member_location[DW_OP_plus_uconst 0x1a]
    1339                      .dwattr $C$DW$194, DW_AT_accessibility(DW_ACCESS_public)
    1340              $C$DW$195       .dwtag  DW_TAG_member
    1341                      .dwattr $C$DW$195, DW_AT_type(*$C$DW$T$23)
    1342                      .dwattr $C$DW$195, DW_AT_name("MaxAccel_krpmps")
    1343                      .dwattr $C$DW$195, DW_AT_TI_symbol_name("_MaxAccel_krpmps")
    1344                      .dwattr $C$DW$195, DW_AT_data_member_location[DW_OP_plus_uconst 0x1c]
    1345                      .dwattr $C$DW$195, DW_AT_accessibility(DW_ACCESS_public)
    1346              $C$DW$196       .dwtag  DW_TAG_member
    1347                      .dwattr $C$DW$196, DW_AT_type(*$C$DW$T$23)
    1348                      .dwattr $C$DW$196, DW_AT_name("MaxDecel_krpmps")
    1349                      .dwattr $C$DW$196, DW_AT_TI_symbol_name("_MaxDecel_krpmps")
    1350                      .dwattr $C$DW$196, DW_AT_data_member_location[DW_OP_plus_uconst 0x1e]
    1351                      .dwattr $C$DW$196, DW_AT_accessibility(DW_ACCESS_public)
    1352              $C$DW$197       .dwtag  DW_TAG_member
    1353                      .dwattr $C$DW$197, DW_AT_type(*$C$DW$T$34)
    1354                      .dwattr $C$DW$197, DW_AT_name("MaxJrk_krpmps2")
    1355                      .dwattr $C$DW$197, DW_AT_TI_symbol_name("_MaxJrk_krpmps2")
    1356                      .dwattr $C$DW$197, DW_AT_data_member_location[DW_OP_plus_uconst 0x20]
    1357                      .dwattr $C$DW$197, DW_AT_accessibility(DW_ACCESS_public)
    1358              $C$DW$198       .dwtag  DW_TAG_member
    1359                      .dwattr $C$DW$198, DW_AT_type(*$C$DW$T$23)
    1360                      .dwattr $C$DW$198, DW_AT_name("MaxCurrentRatio_pu")
    1361                      .dwattr $C$DW$198, DW_AT_TI_symbol_name("_MaxCurrentRatio_pu")
    1362                      .dwattr $C$DW$198, DW_AT_data_member_location[DW_OP_plus_uconst 0x22]
    1363                      .dwattr $C$DW$198, DW_AT_accessibility(DW_ACCESS_public)
    1364              $C$DW$199       .dwtag  DW_TAG_member
    1365                      .dwattr $C$DW$199, DW_AT_type(*$C$DW$T$23)
    1366                      .dwattr $C$DW$199, DW_AT_name("Speed_krpm")
    1367                      .dwattr $C$DW$199, DW_AT_TI_symbol_name("_Speed_krpm")
    1368                      .dwattr $C$DW$199, DW_AT_data_member_location[DW_OP_plus_uconst 0x24]
    1369                      .dwattr $C$DW$199, DW_AT_accessibility(DW_ACCESS_public)
    1370              $C$DW$200       .dwtag  DW_TAG_member
    1371                      .dwattr $C$DW$200, DW_AT_type(*$C$DW$T$23)
    1372                      .dwattr $C$DW$200, DW_AT_name("Flux_Wb")
    1373                      .dwattr $C$DW$200, DW_AT_TI_symbol_name("_Flux_Wb")
    1374                      .dwattr $C$DW$200, DW_AT_data_member_location[DW_OP_plus_uconst 0x26]
    1375                      .dwattr $C$DW$200, DW_AT_accessibility(DW_ACCESS_public)
    1376              $C$DW$201       .dwtag  DW_TAG_member
    1377                      .dwattr $C$DW$201, DW_AT_type(*$C$DW$T$23)
    1378                      .dwattr $C$DW$201, DW_AT_name("Torque_Nm")
    1379                      .dwattr $C$DW$201, DW_AT_TI_symbol_name("_Torque_Nm")
    1380                      .dwattr $C$DW$201, DW_AT_data_member_location[DW_OP_plus_uconst 0x28]
    1381                      .dwattr $C$DW$201, DW_AT_accessibility(DW_ACCESS_public)
    1382              $C$DW$202       .dwtag  DW_TAG_member
    1383                      .dwattr $C$DW$202, DW_AT_type(*$C$DW$T$35)
    1384                      .dwattr $C$DW$202, DW_AT_name("Rr_Ohm")
    1385                      .dwattr $C$DW$202, DW_AT_TI_symbol_name("_Rr_Ohm")
    1386                      .dwattr $C$DW$202, DW_AT_data_member_location[DW_OP_plus_uconst 0x2a]
    1387                      .dwattr $C$DW$202, DW_AT_accessibility(DW_ACCESS_public)
TMS320C2000 Assembler PC v6.2.5 Tue Nov 21 21:43:19 2017

Tools Copyright (c) 1996-2014 Texas Instruments Incorporated
C:\Users\wmj\AppData\Local\Temp\0106012                              PAGE   27

    1388              $C$DW$203       .dwtag  DW_TAG_member
    1389                      .dwattr $C$DW$203, DW_AT_type(*$C$DW$T$35)
    1390                      .dwattr $C$DW$203, DW_AT_name("Rs_Ohm")
    1391                      .dwattr $C$DW$203, DW_AT_TI_symbol_name("_Rs_Ohm")
    1392                      .dwattr $C$DW$203, DW_AT_data_member_location[DW_OP_plus_uconst 0x2c]
    1393                      .dwattr $C$DW$203, DW_AT_accessibility(DW_ACCESS_public)
    1394              $C$DW$204       .dwtag  DW_TAG_member
    1395                      .dwattr $C$DW$204, DW_AT_type(*$C$DW$T$35)
    1396                      .dwattr $C$DW$204, DW_AT_name("Lsd_H")
    1397                      .dwattr $C$DW$204, DW_AT_TI_symbol_name("_Lsd_H")
    1398                      .dwattr $C$DW$204, DW_AT_data_member_location[DW_OP_plus_uconst 0x2e]
    1399                      .dwattr $C$DW$204, DW_AT_accessibility(DW_ACCESS_public)
    1400              $C$DW$205       .dwtag  DW_TAG_member
    1401                      .dwattr $C$DW$205, DW_AT_type(*$C$DW$T$35)
    1402                      .dwattr $C$DW$205, DW_AT_name("Lsq_H")
    1403                      .dwattr $C$DW$205, DW_AT_TI_symbol_name("_Lsq_H")
    1404                      .dwattr $C$DW$205, DW_AT_data_member_location[DW_OP_plus_uconst 0x30]
    1405                      .dwattr $C$DW$205, DW_AT_accessibility(DW_ACCESS_public)
    1406              $C$DW$206       .dwtag  DW_TAG_member
    1407                      .dwattr $C$DW$206, DW_AT_type(*$C$DW$T$35)
    1408                      .dwattr $C$DW$206, DW_AT_name("MaxCurr_A")
    1409                      .dwattr $C$DW$206, DW_AT_TI_symbol_name("_MaxCurr_A")
    1410                      .dwattr $C$DW$206, DW_AT_data_member_location[DW_OP_plus_uconst 0x32]
    1411                      .dwattr $C$DW$206, DW_AT_accessibility(DW_ACCESS_public)
    1412              $C$DW$207       .dwtag  DW_TAG_member
    1413                      .dwattr $C$DW$207, DW_AT_type(*$C$DW$T$35)
    1414                      .dwattr $C$DW$207, DW_AT_name("MagnCurr_A")
    1415                      .dwattr $C$DW$207, DW_AT_TI_symbol_name("_MagnCurr_A")
    1416                      .dwattr $C$DW$207, DW_AT_data_member_location[DW_OP_plus_uconst 0x34]
    1417                      .dwattr $C$DW$207, DW_AT_accessibility(DW_ACCESS_public)
    1418              $C$DW$208       .dwtag  DW_TAG_member
    1419                      .dwattr $C$DW$208, DW_AT_type(*$C$DW$T$35)
    1420                      .dwattr $C$DW$208, DW_AT_name("Flux_VpHz")
    1421                      .dwattr $C$DW$208, DW_AT_TI_symbol_name("_Flux_VpHz")
    1422                      .dwattr $C$DW$208, DW_AT_data_member_location[DW_OP_plus_uconst 0x36]
    1423                      .dwattr $C$DW$208, DW_AT_accessibility(DW_ACCESS_public)
    1424              $C$DW$209       .dwtag  DW_TAG_member
    1425                      .dwattr $C$DW$209, DW_AT_type(*$C$DW$T$35)
    1426                      .dwattr $C$DW$209, DW_AT_name("RsOnLine_Ohm")
    1427                      .dwattr $C$DW$209, DW_AT_TI_symbol_name("_RsOnLine_Ohm")
    1428                      .dwattr $C$DW$209, DW_AT_data_member_location[DW_OP_plus_uconst 0x38]
    1429                      .dwattr $C$DW$209, DW_AT_accessibility(DW_ACCESS_public)
    1430              $C$DW$210       .dwtag  DW_TAG_member
    1431                      .dwattr $C$DW$210, DW_AT_type(*$C$DW$T$23)
    1432                      .dwattr $C$DW$210, DW_AT_name("OverModulation")
    1433                      .dwattr $C$DW$210, DW_AT_TI_symbol_name("_OverModulation")
    1434                      .dwattr $C$DW$210, DW_AT_data_member_location[DW_OP_plus_uconst 0x3a]
    1435                      .dwattr $C$DW$210, DW_AT_accessibility(DW_ACCESS_public)
    1436              $C$DW$211       .dwtag  DW_TAG_member
    1437                      .dwattr $C$DW$211, DW_AT_type(*$C$DW$T$23)
    1438                      .dwattr $C$DW$211, DW_AT_name("RsOnLineCurrent_A")
    1439                      .dwattr $C$DW$211, DW_AT_TI_symbol_name("_RsOnLineCurrent_A")
    1440                      .dwattr $C$DW$211, DW_AT_data_member_location[DW_OP_plus_uconst 0x3c]
    1441                      .dwattr $C$DW$211, DW_AT_accessibility(DW_ACCESS_public)
    1442              $C$DW$212       .dwtag  DW_TAG_member
TMS320C2000 Assembler PC v6.2.5 Tue Nov 21 21:43:19 2017

Tools Copyright (c) 1996-2014 Texas Instruments Incorporated
C:\Users\wmj\AppData\Local\Temp\0106012                              PAGE   28

    1443                      .dwattr $C$DW$212, DW_AT_type(*$C$DW$T$23)
    1444                      .dwattr $C$DW$212, DW_AT_name("Kp_Idq")
    1445                      .dwattr $C$DW$212, DW_AT_TI_symbol_name("_Kp_Idq")
    1446                      .dwattr $C$DW$212, DW_AT_data_member_location[DW_OP_plus_uconst 0x3e]
    1447                      .dwattr $C$DW$212, DW_AT_accessibility(DW_ACCESS_public)
    1448              $C$DW$213       .dwtag  DW_TAG_member
    1449                      .dwattr $C$DW$213, DW_AT_type(*$C$DW$T$23)
    1450                      .dwattr $C$DW$213, DW_AT_name("Ki_Idq")
    1451                      .dwattr $C$DW$213, DW_AT_TI_symbol_name("_Ki_Idq")
    1452                      .dwattr $C$DW$213, DW_AT_data_member_location[DW_OP_plus_uconst 0x40]
    1453                      .dwattr $C$DW$213, DW_AT_accessibility(DW_ACCESS_public)
    1454              $C$DW$214       .dwtag  DW_TAG_member
    1455                      .dwattr $C$DW$214, DW_AT_type(*$C$DW$T$23)
    1456                      .dwattr $C$DW$214, DW_AT_name("Kp_spd")
    1457                      .dwattr $C$DW$214, DW_AT_TI_symbol_name("_Kp_spd")
    1458                      .dwattr $C$DW$214, DW_AT_data_member_location[DW_OP_plus_uconst 0x42]
    1459                      .dwattr $C$DW$214, DW_AT_accessibility(DW_ACCESS_public)
    1460              $C$DW$215       .dwtag  DW_TAG_member
    1461                      .dwattr $C$DW$215, DW_AT_type(*$C$DW$T$23)
    1462                      .dwattr $C$DW$215, DW_AT_name("Ki_spd")
    1463                      .dwattr $C$DW$215, DW_AT_TI_symbol_name("_Ki_spd")
    1464                      .dwattr $C$DW$215, DW_AT_data_member_location[DW_OP_plus_uconst 0x44]
    1465                      .dwattr $C$DW$215, DW_AT_accessibility(DW_ACCESS_public)
    1466              $C$DW$216       .dwtag  DW_TAG_member
    1467                      .dwattr $C$DW$216, DW_AT_type(*$C$DW$T$23)
    1468                      .dwattr $C$DW$216, DW_AT_name("Vd")
    1469                      .dwattr $C$DW$216, DW_AT_TI_symbol_name("_Vd")
    1470                      .dwattr $C$DW$216, DW_AT_data_member_location[DW_OP_plus_uconst 0x46]
    1471                      .dwattr $C$DW$216, DW_AT_accessibility(DW_ACCESS_public)
    1472              $C$DW$217       .dwtag  DW_TAG_member
    1473                      .dwattr $C$DW$217, DW_AT_type(*$C$DW$T$23)
    1474                      .dwattr $C$DW$217, DW_AT_name("Vq")
    1475                      .dwattr $C$DW$217, DW_AT_TI_symbol_name("_Vq")
    1476                      .dwattr $C$DW$217, DW_AT_data_member_location[DW_OP_plus_uconst 0x48]
    1477                      .dwattr $C$DW$217, DW_AT_accessibility(DW_ACCESS_public)
    1478              $C$DW$218       .dwtag  DW_TAG_member
    1479                      .dwattr $C$DW$218, DW_AT_type(*$C$DW$T$23)
    1480                      .dwattr $C$DW$218, DW_AT_name("Vs")
    1481                      .dwattr $C$DW$218, DW_AT_TI_symbol_name("_Vs")
    1482                      .dwattr $C$DW$218, DW_AT_data_member_location[DW_OP_plus_uconst 0x4a]
    1483                      .dwattr $C$DW$218, DW_AT_accessibility(DW_ACCESS_public)
    1484              $C$DW$219       .dwtag  DW_TAG_member
    1485                      .dwattr $C$DW$219, DW_AT_type(*$C$DW$T$23)
    1486                      .dwattr $C$DW$219, DW_AT_name("Id_A")
    1487                      .dwattr $C$DW$219, DW_AT_TI_symbol_name("_Id_A")
    1488                      .dwattr $C$DW$219, DW_AT_data_member_location[DW_OP_plus_uconst 0x4c]
    1489                      .dwattr $C$DW$219, DW_AT_accessibility(DW_ACCESS_public)
    1490              $C$DW$220       .dwtag  DW_TAG_member
    1491                      .dwattr $C$DW$220, DW_AT_type(*$C$DW$T$23)
    1492                      .dwattr $C$DW$220, DW_AT_name("Iq_A")
    1493                      .dwattr $C$DW$220, DW_AT_TI_symbol_name("_Iq_A")
    1494                      .dwattr $C$DW$220, DW_AT_data_member_location[DW_OP_plus_uconst 0x4e]
    1495                      .dwattr $C$DW$220, DW_AT_accessibility(DW_ACCESS_public)
    1496              $C$DW$221       .dwtag  DW_TAG_member
    1497                      .dwattr $C$DW$221, DW_AT_type(*$C$DW$T$23)
TMS320C2000 Assembler PC v6.2.5 Tue Nov 21 21:43:19 2017

Tools Copyright (c) 1996-2014 Texas Instruments Incorporated
C:\Users\wmj\AppData\Local\Temp\0106012                              PAGE   29

    1498                      .dwattr $C$DW$221, DW_AT_name("Is_A")
    1499                      .dwattr $C$DW$221, DW_AT_TI_symbol_name("_Is_A")
    1500                      .dwattr $C$DW$221, DW_AT_data_member_location[DW_OP_plus_uconst 0x50]
    1501                      .dwattr $C$DW$221, DW_AT_accessibility(DW_ACCESS_public)
    1502              $C$DW$222       .dwtag  DW_TAG_member
    1503                      .dwattr $C$DW$222, DW_AT_type(*$C$DW$T$23)
    1504                      .dwattr $C$DW$222, DW_AT_name("IdRef_A")
    1505                      .dwattr $C$DW$222, DW_AT_TI_symbol_name("_IdRef_A")
    1506                      .dwattr $C$DW$222, DW_AT_data_member_location[DW_OP_plus_uconst 0x52]
    1507                      .dwattr $C$DW$222, DW_AT_accessibility(DW_ACCESS_public)
    1508              $C$DW$223       .dwtag  DW_TAG_member
    1509                      .dwattr $C$DW$223, DW_AT_type(*$C$DW$T$23)
    1510                      .dwattr $C$DW$223, DW_AT_name("IqRef_A")
    1511                      .dwattr $C$DW$223, DW_AT_TI_symbol_name("_IqRef_A")
    1512                      .dwattr $C$DW$223, DW_AT_data_member_location[DW_OP_plus_uconst 0x54]
    1513                      .dwattr $C$DW$223, DW_AT_accessibility(DW_ACCESS_public)
    1514              $C$DW$224       .dwtag  DW_TAG_member
    1515                      .dwattr $C$DW$224, DW_AT_type(*$C$DW$T$23)
    1516                      .dwattr $C$DW$224, DW_AT_name("Ibrake_Ratio")
    1517                      .dwattr $C$DW$224, DW_AT_TI_symbol_name("_Ibrake_Ratio")
    1518                      .dwattr $C$DW$224, DW_AT_data_member_location[DW_OP_plus_uconst 0x56]
    1519                      .dwattr $C$DW$224, DW_AT_accessibility(DW_ACCESS_public)
    1520              $C$DW$225       .dwtag  DW_TAG_member
    1521                      .dwattr $C$DW$225, DW_AT_type(*$C$DW$T$36)
    1522                      .dwattr $C$DW$225, DW_AT_name("I_bias")
    1523                      .dwattr $C$DW$225, DW_AT_TI_symbol_name("_I_bias")
    1524                      .dwattr $C$DW$225, DW_AT_data_member_location[DW_OP_plus_uconst 0x58]
    1525                      .dwattr $C$DW$225, DW_AT_accessibility(DW_ACCESS_public)
    1526              $C$DW$226       .dwtag  DW_TAG_member
    1527                      .dwattr $C$DW$226, DW_AT_type(*$C$DW$T$36)
    1528                      .dwattr $C$DW$226, DW_AT_name("V_bias")
    1529                      .dwattr $C$DW$226, DW_AT_TI_symbol_name("_V_bias")
    1530                      .dwattr $C$DW$226, DW_AT_data_member_location[DW_OP_plus_uconst 0x5e]
    1531                      .dwattr $C$DW$226, DW_AT_accessibility(DW_ACCESS_public)
    1532              $C$DW$227       .dwtag  DW_TAG_member
    1533                      .dwattr $C$DW$227, DW_AT_type(*$C$DW$T$23)
    1534                      .dwattr $C$DW$227, DW_AT_name("Sensor0_Value")
    1535                      .dwattr $C$DW$227, DW_AT_TI_symbol_name("_Sensor0_Value")
    1536                      .dwattr $C$DW$227, DW_AT_data_member_location[DW_OP_plus_uconst 0x64]
    1537                      .dwattr $C$DW$227, DW_AT_accessibility(DW_ACCESS_public)
    1538              $C$DW$228       .dwtag  DW_TAG_member
    1539                      .dwattr $C$DW$228, DW_AT_type(*$C$DW$T$23)
    1540                      .dwattr $C$DW$228, DW_AT_name("Sensor1_Value")
    1541                      .dwattr $C$DW$228, DW_AT_TI_symbol_name("_Sensor1_Value")
    1542                      .dwattr $C$DW$228, DW_AT_data_member_location[DW_OP_plus_uconst 0x66]
    1543                      .dwattr $C$DW$228, DW_AT_accessibility(DW_ACCESS_public)
    1544              $C$DW$229       .dwtag  DW_TAG_member
    1545                      .dwattr $C$DW$229, DW_AT_type(*$C$DW$T$23)
    1546                      .dwattr $C$DW$229, DW_AT_name("ZeroPoint_Value")
    1547                      .dwattr $C$DW$229, DW_AT_TI_symbol_name("_ZeroPoint_Value")
    1548                      .dwattr $C$DW$229, DW_AT_data_member_location[DW_OP_plus_uconst 0x68]
    1549                      .dwattr $C$DW$229, DW_AT_accessibility(DW_ACCESS_public)
    1550              $C$DW$230       .dwtag  DW_TAG_member
    1551                      .dwattr $C$DW$230, DW_AT_type(*$C$DW$T$34)
    1552                      .dwattr $C$DW$230, DW_AT_name("ChipTemp")
TMS320C2000 Assembler PC v6.2.5 Tue Nov 21 21:43:19 2017

Tools Copyright (c) 1996-2014 Texas Instruments Incorporated
C:\Users\wmj\AppData\Local\Temp\0106012                              PAGE   30

    1553                      .dwattr $C$DW$230, DW_AT_TI_symbol_name("_ChipTemp")
    1554                      .dwattr $C$DW$230, DW_AT_data_member_location[DW_OP_plus_uconst 0x6a]
    1555                      .dwattr $C$DW$230, DW_AT_accessibility(DW_ACCESS_public)
    1556              $C$DW$231       .dwtag  DW_TAG_member
    1557                      .dwattr $C$DW$231, DW_AT_type(*$C$DW$T$23)
    1558                      .dwattr $C$DW$231, DW_AT_name("VdcBus_kV")
    1559                      .dwattr $C$DW$231, DW_AT_TI_symbol_name("_VdcBus_kV")
    1560                      .dwattr $C$DW$231, DW_AT_data_member_location[DW_OP_plus_uconst 0x6c]
    1561                      .dwattr $C$DW$231, DW_AT_accessibility(DW_ACCESS_public)
    1562              $C$DW$232       .dwtag  DW_TAG_member
    1563                      .dwattr $C$DW$232, DW_AT_type(*$C$DW$T$19)
    1564                      .dwattr $C$DW$232, DW_AT_name("MotorID")
    1565                      .dwattr $C$DW$232, DW_AT_TI_symbol_name("_MotorID")
    1566                      .dwattr $C$DW$232, DW_AT_data_member_location[DW_OP_plus_uconst 0x6e]
    1567                      .dwattr $C$DW$232, DW_AT_accessibility(DW_ACCESS_public)
    1568                      .dwendtag $C$DW$T$37
    1569              
    1570              $C$DW$T$49      .dwtag  DW_TAG_typedef, DW_AT_name("MOTOR_Obj")
    1571                      .dwattr $C$DW$T$49, DW_AT_type(*$C$DW$T$37)
    1572                      .dwattr $C$DW$T$49, DW_AT_language(DW_LANG_C)
    1573              $C$DW$T$50      .dwtag  DW_TAG_pointer_type
    1574                      .dwattr $C$DW$T$50, DW_AT_type(*$C$DW$T$37)
    1575                      .dwattr $C$DW$T$50, DW_AT_address_class(0x16)
    1576              $C$DW$T$51      .dwtag  DW_TAG_typedef, DW_AT_name("MOTOR_Handle")
    1577                      .dwattr $C$DW$T$51, DW_AT_type(*$C$DW$T$50)
    1578                      .dwattr $C$DW$T$51, DW_AT_language(DW_LANG_C)
    1579              $C$DW$233       .dwtag  DW_TAG_TI_far_type
    1580                      .dwattr $C$DW$233, DW_AT_type(*$C$DW$T$51)
    1581              $C$DW$T$52      .dwtag  DW_TAG_const_type
    1582                      .dwattr $C$DW$T$52, DW_AT_type(*$C$DW$233)
    1583              
    1584              $C$DW$T$48      .dwtag  DW_TAG_structure_type
    1585                      .dwattr $C$DW$T$48, DW_AT_name("_USER_Params_")
    1586                      .dwattr $C$DW$T$48, DW_AT_byte_size(0xac)
    1587              $C$DW$234       .dwtag  DW_TAG_member
    1588                      .dwattr $C$DW$234, DW_AT_type(*$C$DW$T$35)
    1589                      .dwattr $C$DW$234, DW_AT_name("iqFullScaleCurrent_A")
    1590                      .dwattr $C$DW$234, DW_AT_TI_symbol_name("_iqFullScaleCurrent_A")
    1591                      .dwattr $C$DW$234, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    1592                      .dwattr $C$DW$234, DW_AT_accessibility(DW_ACCESS_public)
    1593              $C$DW$235       .dwtag  DW_TAG_member
    1594                      .dwattr $C$DW$235, DW_AT_type(*$C$DW$T$35)
    1595                      .dwattr $C$DW$235, DW_AT_name("iqFullScaleVoltage_V")
    1596                      .dwattr $C$DW$235, DW_AT_TI_symbol_name("_iqFullScaleVoltage_V")
    1597                      .dwattr $C$DW$235, DW_AT_data_member_location[DW_OP_plus_uconst 0x2]
    1598                      .dwattr $C$DW$235, DW_AT_accessibility(DW_ACCESS_public)
    1599              $C$DW$236       .dwtag  DW_TAG_member
    1600                      .dwattr $C$DW$236, DW_AT_type(*$C$DW$T$35)
    1601                      .dwattr $C$DW$236, DW_AT_name("iqFullScaleFreq_Hz")
    1602                      .dwattr $C$DW$236, DW_AT_TI_symbol_name("_iqFullScaleFreq_Hz")
    1603                      .dwattr $C$DW$236, DW_AT_data_member_location[DW_OP_plus_uconst 0x4]
    1604                      .dwattr $C$DW$236, DW_AT_accessibility(DW_ACCESS_public)
    1605              $C$DW$237       .dwtag  DW_TAG_member
    1606                      .dwattr $C$DW$237, DW_AT_type(*$C$DW$T$38)
    1607                      .dwattr $C$DW$237, DW_AT_name("numIsrTicksPerCtrlTick")
TMS320C2000 Assembler PC v6.2.5 Tue Nov 21 21:43:19 2017

Tools Copyright (c) 1996-2014 Texas Instruments Incorporated
C:\Users\wmj\AppData\Local\Temp\0106012                              PAGE   31

    1608                      .dwattr $C$DW$237, DW_AT_TI_symbol_name("_numIsrTicksPerCtrlTick")
    1609                      .dwattr $C$DW$237, DW_AT_data_member_location[DW_OP_plus_uconst 0x6]
    1610                      .dwattr $C$DW$237, DW_AT_accessibility(DW_ACCESS_public)
    1611              $C$DW$238       .dwtag  DW_TAG_member
    1612                      .dwattr $C$DW$238, DW_AT_type(*$C$DW$T$38)
    1613                      .dwattr $C$DW$238, DW_AT_name("numCtrlTicksPerCurrentTick")
    1614                      .dwattr $C$DW$238, DW_AT_TI_symbol_name("_numCtrlTicksPerCurrentTick")
    1615                      .dwattr $C$DW$238, DW_AT_data_member_location[DW_OP_plus_uconst 0x7]
    1616                      .dwattr $C$DW$238, DW_AT_accessibility(DW_ACCESS_public)
    1617              $C$DW$239       .dwtag  DW_TAG_member
    1618                      .dwattr $C$DW$239, DW_AT_type(*$C$DW$T$38)
    1619                      .dwattr $C$DW$239, DW_AT_name("numCtrlTicksPerEstTick")
    1620                      .dwattr $C$DW$239, DW_AT_TI_symbol_name("_numCtrlTicksPerEstTick")
    1621                      .dwattr $C$DW$239, DW_AT_data_member_location[DW_OP_plus_uconst 0x8]
    1622                      .dwattr $C$DW$239, DW_AT_accessibility(DW_ACCESS_public)
    1623              $C$DW$240       .dwtag  DW_TAG_member
    1624                      .dwattr $C$DW$240, DW_AT_type(*$C$DW$T$38)
    1625                      .dwattr $C$DW$240, DW_AT_name("numCtrlTicksPerSpeedTick")
    1626                      .dwattr $C$DW$240, DW_AT_TI_symbol_name("_numCtrlTicksPerSpeedTick")
    1627                      .dwattr $C$DW$240, DW_AT_data_member_location[DW_OP_plus_uconst 0x9]
    1628                      .dwattr $C$DW$240, DW_AT_accessibility(DW_ACCESS_public)
    1629              $C$DW$241       .dwtag  DW_TAG_member
    1630                      .dwattr $C$DW$241, DW_AT_type(*$C$DW$T$38)
    1631                      .dwattr $C$DW$241, DW_AT_name("numCtrlTicksPerTrajTick")
    1632                      .dwattr $C$DW$241, DW_AT_TI_symbol_name("_numCtrlTicksPerTrajTick")
    1633                      .dwattr $C$DW$241, DW_AT_data_member_location[DW_OP_plus_uconst 0xa]
    1634                      .dwattr $C$DW$241, DW_AT_accessibility(DW_ACCESS_public)
    1635              $C$DW$242       .dwtag  DW_TAG_member
    1636                      .dwattr $C$DW$242, DW_AT_type(*$C$DW$T$39)
    1637                      .dwattr $C$DW$242, DW_AT_name("numCurrentSensors")
    1638                      .dwattr $C$DW$242, DW_AT_TI_symbol_name("_numCurrentSensors")
    1639                      .dwattr $C$DW$242, DW_AT_data_member_location[DW_OP_plus_uconst 0xb]
    1640                      .dwattr $C$DW$242, DW_AT_accessibility(DW_ACCESS_public)
    1641              $C$DW$243       .dwtag  DW_TAG_member
    1642                      .dwattr $C$DW$243, DW_AT_type(*$C$DW$T$39)
    1643                      .dwattr $C$DW$243, DW_AT_name("numVoltageSensors")
    1644                      .dwattr $C$DW$243, DW_AT_TI_symbol_name("_numVoltageSensors")
    1645                      .dwattr $C$DW$243, DW_AT_data_member_location[DW_OP_plus_uconst 0xc]
    1646                      .dwattr $C$DW$243, DW_AT_accessibility(DW_ACCESS_public)
    1647              $C$DW$244       .dwtag  DW_TAG_member
    1648                      .dwattr $C$DW$244, DW_AT_type(*$C$DW$T$35)
    1649                      .dwattr $C$DW$244, DW_AT_name("offsetPole_rps")
    1650                      .dwattr $C$DW$244, DW_AT_TI_symbol_name("_offsetPole_rps")
    1651                      .dwattr $C$DW$244, DW_AT_data_member_location[DW_OP_plus_uconst 0xe]
    1652                      .dwattr $C$DW$244, DW_AT_accessibility(DW_ACCESS_public)
    1653              $C$DW$245       .dwtag  DW_TAG_member
    1654                      .dwattr $C$DW$245, DW_AT_type(*$C$DW$T$35)
    1655                      .dwattr $C$DW$245, DW_AT_name("fluxPole_rps")
    1656                      .dwattr $C$DW$245, DW_AT_TI_symbol_name("_fluxPole_rps")
    1657                      .dwattr $C$DW$245, DW_AT_data_member_location[DW_OP_plus_uconst 0x10]
    1658                      .dwattr $C$DW$245, DW_AT_accessibility(DW_ACCESS_public)
    1659              $C$DW$246       .dwtag  DW_TAG_member
    1660                      .dwattr $C$DW$246, DW_AT_type(*$C$DW$T$35)
    1661                      .dwattr $C$DW$246, DW_AT_name("zeroSpeedLimit")
    1662                      .dwattr $C$DW$246, DW_AT_TI_symbol_name("_zeroSpeedLimit")
TMS320C2000 Assembler PC v6.2.5 Tue Nov 21 21:43:19 2017

Tools Copyright (c) 1996-2014 Texas Instruments Incorporated
C:\Users\wmj\AppData\Local\Temp\0106012                              PAGE   32

    1663                      .dwattr $C$DW$246, DW_AT_data_member_location[DW_OP_plus_uconst 0x12]
    1664                      .dwattr $C$DW$246, DW_AT_accessibility(DW_ACCESS_public)
    1665              $C$DW$247       .dwtag  DW_TAG_member
    1666                      .dwattr $C$DW$247, DW_AT_type(*$C$DW$T$35)
    1667                      .dwattr $C$DW$247, DW_AT_name("forceAngleFreq_Hz")
    1668                      .dwattr $C$DW$247, DW_AT_TI_symbol_name("_forceAngleFreq_Hz")
    1669                      .dwattr $C$DW$247, DW_AT_data_member_location[DW_OP_plus_uconst 0x14]
    1670                      .dwattr $C$DW$247, DW_AT_accessibility(DW_ACCESS_public)
    1671              $C$DW$248       .dwtag  DW_TAG_member
    1672                      .dwattr $C$DW$248, DW_AT_type(*$C$DW$T$35)
    1673                      .dwattr $C$DW$248, DW_AT_name("maxAccel_Hzps")
    1674                      .dwattr $C$DW$248, DW_AT_TI_symbol_name("_maxAccel_Hzps")
    1675                      .dwattr $C$DW$248, DW_AT_data_member_location[DW_OP_plus_uconst 0x16]
    1676                      .dwattr $C$DW$248, DW_AT_accessibility(DW_ACCESS_public)
    1677              $C$DW$249       .dwtag  DW_TAG_member
    1678                      .dwattr $C$DW$249, DW_AT_type(*$C$DW$T$35)
    1679                      .dwattr $C$DW$249, DW_AT_name("maxAccel_est_Hzps")
    1680                      .dwattr $C$DW$249, DW_AT_TI_symbol_name("_maxAccel_est_Hzps")
    1681                      .dwattr $C$DW$249, DW_AT_data_member_location[DW_OP_plus_uconst 0x18]
    1682                      .dwattr $C$DW$249, DW_AT_accessibility(DW_ACCESS_public)
    1683              $C$DW$250       .dwtag  DW_TAG_member
    1684                      .dwattr $C$DW$250, DW_AT_type(*$C$DW$T$35)
    1685                      .dwattr $C$DW$250, DW_AT_name("directionPole_rps")
    1686                      .dwattr $C$DW$250, DW_AT_TI_symbol_name("_directionPole_rps")
    1687                      .dwattr $C$DW$250, DW_AT_data_member_location[DW_OP_plus_uconst 0x1a]
    1688                      .dwattr $C$DW$250, DW_AT_accessibility(DW_ACCESS_public)
    1689              $C$DW$251       .dwtag  DW_TAG_member
    1690                      .dwattr $C$DW$251, DW_AT_type(*$C$DW$T$35)
    1691                      .dwattr $C$DW$251, DW_AT_name("speedPole_rps")
    1692                      .dwattr $C$DW$251, DW_AT_TI_symbol_name("_speedPole_rps")
    1693                      .dwattr $C$DW$251, DW_AT_data_member_location[DW_OP_plus_uconst 0x1c]
    1694                      .dwattr $C$DW$251, DW_AT_accessibility(DW_ACCESS_public)
    1695              $C$DW$252       .dwtag  DW_TAG_member
    1696                      .dwattr $C$DW$252, DW_AT_type(*$C$DW$T$35)
    1697                      .dwattr $C$DW$252, DW_AT_name("dcBusPole_rps")
    1698                      .dwattr $C$DW$252, DW_AT_TI_symbol_name("_dcBusPole_rps")
    1699                      .dwattr $C$DW$252, DW_AT_data_member_location[DW_OP_plus_uconst 0x1e]
    1700                      .dwattr $C$DW$252, DW_AT_accessibility(DW_ACCESS_public)
    1701              $C$DW$253       .dwtag  DW_TAG_member
    1702                      .dwattr $C$DW$253, DW_AT_type(*$C$DW$T$35)
    1703                      .dwattr $C$DW$253, DW_AT_name("fluxFraction")
    1704                      .dwattr $C$DW$253, DW_AT_TI_symbol_name("_fluxFraction")
    1705                      .dwattr $C$DW$253, DW_AT_data_member_location[DW_OP_plus_uconst 0x20]
    1706                      .dwattr $C$DW$253, DW_AT_accessibility(DW_ACCESS_public)
    1707              $C$DW$254       .dwtag  DW_TAG_member
    1708                      .dwattr $C$DW$254, DW_AT_type(*$C$DW$T$35)
    1709                      .dwattr $C$DW$254, DW_AT_name("indEst_speedMaxFraction")
    1710                      .dwattr $C$DW$254, DW_AT_TI_symbol_name("_indEst_speedMaxFraction")
    1711                      .dwattr $C$DW$254, DW_AT_data_member_location[DW_OP_plus_uconst 0x22]
    1712                      .dwattr $C$DW$254, DW_AT_accessibility(DW_ACCESS_public)
    1713              $C$DW$255       .dwtag  DW_TAG_member
    1714                      .dwattr $C$DW$255, DW_AT_type(*$C$DW$T$35)
    1715                      .dwattr $C$DW$255, DW_AT_name("powerWarpGain")
    1716                      .dwattr $C$DW$255, DW_AT_TI_symbol_name("_powerWarpGain")
    1717                      .dwattr $C$DW$255, DW_AT_data_member_location[DW_OP_plus_uconst 0x24]
TMS320C2000 Assembler PC v6.2.5 Tue Nov 21 21:43:19 2017

Tools Copyright (c) 1996-2014 Texas Instruments Incorporated
C:\Users\wmj\AppData\Local\Temp\0106012                              PAGE   33

    1718                      .dwattr $C$DW$255, DW_AT_accessibility(DW_ACCESS_public)
    1719              $C$DW$256       .dwtag  DW_TAG_member
    1720                      .dwattr $C$DW$256, DW_AT_type(*$C$DW$T$38)
    1721                      .dwattr $C$DW$256, DW_AT_name("systemFreq_MHz")
    1722                      .dwattr $C$DW$256, DW_AT_TI_symbol_name("_systemFreq_MHz")
    1723                      .dwattr $C$DW$256, DW_AT_data_member_location[DW_OP_plus_uconst 0x26]
    1724                      .dwattr $C$DW$256, DW_AT_accessibility(DW_ACCESS_public)
    1725              $C$DW$257       .dwtag  DW_TAG_member
    1726                      .dwattr $C$DW$257, DW_AT_type(*$C$DW$T$35)
    1727                      .dwattr $C$DW$257, DW_AT_name("pwmPeriod_usec")
    1728                      .dwattr $C$DW$257, DW_AT_TI_symbol_name("_pwmPeriod_usec")
    1729                      .dwattr $C$DW$257, DW_AT_data_member_location[DW_OP_plus_uconst 0x28]
    1730                      .dwattr $C$DW$257, DW_AT_accessibility(DW_ACCESS_public)
    1731              $C$DW$258       .dwtag  DW_TAG_member
    1732                      .dwattr $C$DW$258, DW_AT_type(*$C$DW$T$35)
    1733                      .dwattr $C$DW$258, DW_AT_name("voltage_sf")
    1734                      .dwattr $C$DW$258, DW_AT_TI_symbol_name("_voltage_sf")
    1735                      .dwattr $C$DW$258, DW_AT_data_member_location[DW_OP_plus_uconst 0x2a]
    1736                      .dwattr $C$DW$258, DW_AT_accessibility(DW_ACCESS_public)
    1737              $C$DW$259       .dwtag  DW_TAG_member
    1738                      .dwattr $C$DW$259, DW_AT_type(*$C$DW$T$35)
    1739                      .dwattr $C$DW$259, DW_AT_name("current_sf")
    1740                      .dwattr $C$DW$259, DW_AT_TI_symbol_name("_current_sf")
    1741                      .dwattr $C$DW$259, DW_AT_data_member_location[DW_OP_plus_uconst 0x2c]
    1742                      .dwattr $C$DW$259, DW_AT_accessibility(DW_ACCESS_public)
    1743              $C$DW$260       .dwtag  DW_TAG_member
    1744                      .dwattr $C$DW$260, DW_AT_type(*$C$DW$T$35)
    1745                      .dwattr $C$DW$260, DW_AT_name("voltageFilterPole_rps")
    1746                      .dwattr $C$DW$260, DW_AT_TI_symbol_name("_voltageFilterPole_rps")
    1747                      .dwattr $C$DW$260, DW_AT_data_member_location[DW_OP_plus_uconst 0x2e]
    1748                      .dwattr $C$DW$260, DW_AT_accessibility(DW_ACCESS_public)
    1749              $C$DW$261       .dwtag  DW_TAG_member
    1750                      .dwattr $C$DW$261, DW_AT_type(*$C$DW$T$35)
    1751                      .dwattr $C$DW$261, DW_AT_name("maxVsMag_pu")
    1752                      .dwattr $C$DW$261, DW_AT_TI_symbol_name("_maxVsMag_pu")
    1753                      .dwattr $C$DW$261, DW_AT_data_member_location[DW_OP_plus_uconst 0x30]
    1754                      .dwattr $C$DW$261, DW_AT_accessibility(DW_ACCESS_public)
    1755              $C$DW$262       .dwtag  DW_TAG_member
    1756                      .dwattr $C$DW$262, DW_AT_type(*$C$DW$T$35)
    1757                      .dwattr $C$DW$262, DW_AT_name("estKappa")
    1758                      .dwattr $C$DW$262, DW_AT_TI_symbol_name("_estKappa")
    1759                      .dwattr $C$DW$262, DW_AT_data_member_location[DW_OP_plus_uconst 0x32]
    1760                      .dwattr $C$DW$262, DW_AT_accessibility(DW_ACCESS_public)
    1761              $C$DW$263       .dwtag  DW_TAG_member
    1762                      .dwattr $C$DW$263, DW_AT_type(*$C$DW$T$41)
    1763                      .dwattr $C$DW$263, DW_AT_name("motor_type")
    1764                      .dwattr $C$DW$263, DW_AT_TI_symbol_name("_motor_type")
    1765                      .dwattr $C$DW$263, DW_AT_data_member_location[DW_OP_plus_uconst 0x34]
    1766                      .dwattr $C$DW$263, DW_AT_accessibility(DW_ACCESS_public)
    1767              $C$DW$264       .dwtag  DW_TAG_member
    1768                      .dwattr $C$DW$264, DW_AT_type(*$C$DW$T$38)
    1769                      .dwattr $C$DW$264, DW_AT_name("motor_numPolePairs")
    1770                      .dwattr $C$DW$264, DW_AT_TI_symbol_name("_motor_numPolePairs")
    1771                      .dwattr $C$DW$264, DW_AT_data_member_location[DW_OP_plus_uconst 0x35]
    1772                      .dwattr $C$DW$264, DW_AT_accessibility(DW_ACCESS_public)
TMS320C2000 Assembler PC v6.2.5 Tue Nov 21 21:43:19 2017

Tools Copyright (c) 1996-2014 Texas Instruments Incorporated
C:\Users\wmj\AppData\Local\Temp\0106012                              PAGE   34

    1773              $C$DW$265       .dwtag  DW_TAG_member
    1774                      .dwattr $C$DW$265, DW_AT_type(*$C$DW$T$35)
    1775                      .dwattr $C$DW$265, DW_AT_name("motor_ratedFlux")
    1776                      .dwattr $C$DW$265, DW_AT_TI_symbol_name("_motor_ratedFlux")
    1777                      .dwattr $C$DW$265, DW_AT_data_member_location[DW_OP_plus_uconst 0x36]
    1778                      .dwattr $C$DW$265, DW_AT_accessibility(DW_ACCESS_public)
    1779              $C$DW$266       .dwtag  DW_TAG_member
    1780                      .dwattr $C$DW$266, DW_AT_type(*$C$DW$T$35)
    1781                      .dwattr $C$DW$266, DW_AT_name("motor_Rr")
    1782                      .dwattr $C$DW$266, DW_AT_TI_symbol_name("_motor_Rr")
    1783                      .dwattr $C$DW$266, DW_AT_data_member_location[DW_OP_plus_uconst 0x38]
    1784                      .dwattr $C$DW$266, DW_AT_accessibility(DW_ACCESS_public)
    1785              $C$DW$267       .dwtag  DW_TAG_member
    1786                      .dwattr $C$DW$267, DW_AT_type(*$C$DW$T$35)
    1787                      .dwattr $C$DW$267, DW_AT_name("motor_Rs")
    1788                      .dwattr $C$DW$267, DW_AT_TI_symbol_name("_motor_Rs")
    1789                      .dwattr $C$DW$267, DW_AT_data_member_location[DW_OP_plus_uconst 0x3a]
    1790                      .dwattr $C$DW$267, DW_AT_accessibility(DW_ACCESS_public)
    1791              $C$DW$268       .dwtag  DW_TAG_member
    1792                      .dwattr $C$DW$268, DW_AT_type(*$C$DW$T$35)
    1793                      .dwattr $C$DW$268, DW_AT_name("motor_Ls_d")
    1794                      .dwattr $C$DW$268, DW_AT_TI_symbol_name("_motor_Ls_d")
    1795                      .dwattr $C$DW$268, DW_AT_data_member_location[DW_OP_plus_uconst 0x3c]
    1796                      .dwattr $C$DW$268, DW_AT_accessibility(DW_ACCESS_public)
    1797              $C$DW$269       .dwtag  DW_TAG_member
    1798                      .dwattr $C$DW$269, DW_AT_type(*$C$DW$T$35)
    1799                      .dwattr $C$DW$269, DW_AT_name("motor_Ls_q")
    1800                      .dwattr $C$DW$269, DW_AT_TI_symbol_name("_motor_Ls_q")
    1801                      .dwattr $C$DW$269, DW_AT_data_member_location[DW_OP_plus_uconst 0x3e]
    1802                      .dwattr $C$DW$269, DW_AT_accessibility(DW_ACCESS_public)
    1803              $C$DW$270       .dwtag  DW_TAG_member
    1804                      .dwattr $C$DW$270, DW_AT_type(*$C$DW$T$35)
    1805                      .dwattr $C$DW$270, DW_AT_name("maxCurrent")
    1806                      .dwattr $C$DW$270, DW_AT_TI_symbol_name("_maxCurrent")
    1807                      .dwattr $C$DW$270, DW_AT_data_member_location[DW_OP_plus_uconst 0x40]
    1808                      .dwattr $C$DW$270, DW_AT_accessibility(DW_ACCESS_public)
    1809              $C$DW$271       .dwtag  DW_TAG_member
    1810                      .dwattr $C$DW$271, DW_AT_type(*$C$DW$T$35)
    1811                      .dwattr $C$DW$271, DW_AT_name("maxCurrent_resEst")
    1812                      .dwattr $C$DW$271, DW_AT_TI_symbol_name("_maxCurrent_resEst")
    1813                      .dwattr $C$DW$271, DW_AT_data_member_location[DW_OP_plus_uconst 0x42]
    1814                      .dwattr $C$DW$271, DW_AT_accessibility(DW_ACCESS_public)
    1815              $C$DW$272       .dwtag  DW_TAG_member
    1816                      .dwattr $C$DW$272, DW_AT_type(*$C$DW$T$35)
    1817                      .dwattr $C$DW$272, DW_AT_name("maxCurrent_indEst")
    1818                      .dwattr $C$DW$272, DW_AT_TI_symbol_name("_maxCurrent_indEst")
    1819                      .dwattr $C$DW$272, DW_AT_data_member_location[DW_OP_plus_uconst 0x44]
    1820                      .dwattr $C$DW$272, DW_AT_accessibility(DW_ACCESS_public)
    1821              $C$DW$273       .dwtag  DW_TAG_member
    1822                      .dwattr $C$DW$273, DW_AT_type(*$C$DW$T$35)
    1823                      .dwattr $C$DW$273, DW_AT_name("maxCurrentSlope")
    1824                      .dwattr $C$DW$273, DW_AT_TI_symbol_name("_maxCurrentSlope")
    1825                      .dwattr $C$DW$273, DW_AT_data_member_location[DW_OP_plus_uconst 0x46]
    1826                      .dwattr $C$DW$273, DW_AT_accessibility(DW_ACCESS_public)
    1827              $C$DW$274       .dwtag  DW_TAG_member
TMS320C2000 Assembler PC v6.2.5 Tue Nov 21 21:43:19 2017

Tools Copyright (c) 1996-2014 Texas Instruments Incorporated
C:\Users\wmj\AppData\Local\Temp\0106012                              PAGE   35

    1828                      .dwattr $C$DW$274, DW_AT_type(*$C$DW$T$35)
    1829                      .dwattr $C$DW$274, DW_AT_name("maxCurrentSlope_powerWarp")
    1830                      .dwattr $C$DW$274, DW_AT_TI_symbol_name("_maxCurrentSlope_powerWarp")
    1831                      .dwattr $C$DW$274, DW_AT_data_member_location[DW_OP_plus_uconst 0x48]
    1832                      .dwattr $C$DW$274, DW_AT_accessibility(DW_ACCESS_public)
    1833              $C$DW$275       .dwtag  DW_TAG_member
    1834                      .dwattr $C$DW$275, DW_AT_type(*$C$DW$T$35)
    1835                      .dwattr $C$DW$275, DW_AT_name("IdRated")
    1836                      .dwattr $C$DW$275, DW_AT_TI_symbol_name("_IdRated")
    1837                      .dwattr $C$DW$275, DW_AT_data_member_location[DW_OP_plus_uconst 0x4a]
    1838                      .dwattr $C$DW$275, DW_AT_accessibility(DW_ACCESS_public)
    1839              $C$DW$276       .dwtag  DW_TAG_member
    1840                      .dwattr $C$DW$276, DW_AT_type(*$C$DW$T$35)
    1841                      .dwattr $C$DW$276, DW_AT_name("IdRatedFraction_indEst")
    1842                      .dwattr $C$DW$276, DW_AT_TI_symbol_name("_IdRatedFraction_indEst")
    1843                      .dwattr $C$DW$276, DW_AT_data_member_location[DW_OP_plus_uconst 0x4c]
    1844                      .dwattr $C$DW$276, DW_AT_accessibility(DW_ACCESS_public)
    1845              $C$DW$277       .dwtag  DW_TAG_member
    1846                      .dwattr $C$DW$277, DW_AT_type(*$C$DW$T$35)
    1847                      .dwattr $C$DW$277, DW_AT_name("IdRatedFraction_ratedFlux")
    1848                      .dwattr $C$DW$277, DW_AT_TI_symbol_name("_IdRatedFraction_ratedFlux")
    1849                      .dwattr $C$DW$277, DW_AT_data_member_location[DW_OP_plus_uconst 0x4e]
    1850                      .dwattr $C$DW$277, DW_AT_accessibility(DW_ACCESS_public)
    1851              $C$DW$278       .dwtag  DW_TAG_member
    1852                      .dwattr $C$DW$278, DW_AT_type(*$C$DW$T$35)
    1853                      .dwattr $C$DW$278, DW_AT_name("IdRated_delta")
    1854                      .dwattr $C$DW$278, DW_AT_TI_symbol_name("_IdRated_delta")
    1855                      .dwattr $C$DW$278, DW_AT_data_member_location[DW_OP_plus_uconst 0x50]
    1856                      .dwattr $C$DW$278, DW_AT_accessibility(DW_ACCESS_public)
    1857              $C$DW$279       .dwtag  DW_TAG_member
    1858                      .dwattr $C$DW$279, DW_AT_type(*$C$DW$T$35)
    1859                      .dwattr $C$DW$279, DW_AT_name("fluxEstFreq_Hz")
    1860                      .dwattr $C$DW$279, DW_AT_TI_symbol_name("_fluxEstFreq_Hz")
    1861                      .dwattr $C$DW$279, DW_AT_data_member_location[DW_OP_plus_uconst 0x52]
    1862                      .dwattr $C$DW$279, DW_AT_accessibility(DW_ACCESS_public)
    1863              $C$DW$280       .dwtag  DW_TAG_member
    1864                      .dwattr $C$DW$280, DW_AT_type(*$C$DW$T$44)
    1865                      .dwattr $C$DW$280, DW_AT_name("ctrlWaitTime")
    1866                      .dwattr $C$DW$280, DW_AT_TI_symbol_name("_ctrlWaitTime")
    1867                      .dwattr $C$DW$280, DW_AT_data_member_location[DW_OP_plus_uconst 0x54]
    1868                      .dwattr $C$DW$280, DW_AT_accessibility(DW_ACCESS_public)
    1869              $C$DW$281       .dwtag  DW_TAG_member
    1870                      .dwattr $C$DW$281, DW_AT_type(*$C$DW$T$45)
    1871                      .dwattr $C$DW$281, DW_AT_name("estWaitTime")
    1872                      .dwattr $C$DW$281, DW_AT_TI_symbol_name("_estWaitTime")
    1873                      .dwattr $C$DW$281, DW_AT_data_member_location[DW_OP_plus_uconst 0x5c]
    1874                      .dwattr $C$DW$281, DW_AT_accessibility(DW_ACCESS_public)
    1875              $C$DW$282       .dwtag  DW_TAG_member
    1876                      .dwattr $C$DW$282, DW_AT_type(*$C$DW$T$46)
    1877                      .dwattr $C$DW$282, DW_AT_name("FluxWaitTime")
    1878                      .dwattr $C$DW$282, DW_AT_TI_symbol_name("_FluxWaitTime")
    1879                      .dwattr $C$DW$282, DW_AT_data_member_location[DW_OP_plus_uconst 0x78]
    1880                      .dwattr $C$DW$282, DW_AT_accessibility(DW_ACCESS_public)
    1881              $C$DW$283       .dwtag  DW_TAG_member
    1882                      .dwattr $C$DW$283, DW_AT_type(*$C$DW$T$47)
TMS320C2000 Assembler PC v6.2.5 Tue Nov 21 21:43:19 2017

Tools Copyright (c) 1996-2014 Texas Instruments Incorporated
C:\Users\wmj\AppData\Local\Temp\0106012                              PAGE   36

    1883                      .dwattr $C$DW$283, DW_AT_name("LsWaitTime")
    1884                      .dwattr $C$DW$283, DW_AT_TI_symbol_name("_LsWaitTime")
    1885                      .dwattr $C$DW$283, DW_AT_data_member_location[DW_OP_plus_uconst 0x84]
    1886                      .dwattr $C$DW$283, DW_AT_accessibility(DW_ACCESS_public)
    1887              $C$DW$284       .dwtag  DW_TAG_member
    1888                      .dwattr $C$DW$284, DW_AT_type(*$C$DW$T$46)
    1889                      .dwattr $C$DW$284, DW_AT_name("RsWaitTime")
    1890                      .dwattr $C$DW$284, DW_AT_TI_symbol_name("_RsWaitTime")
    1891                      .dwattr $C$DW$284, DW_AT_data_member_location[DW_OP_plus_uconst 0x92]
    1892                      .dwattr $C$DW$284, DW_AT_accessibility(DW_ACCESS_public)
    1893              $C$DW$285       .dwtag  DW_TAG_member
    1894                      .dwattr $C$DW$285, DW_AT_type(*$C$DW$T$43)
    1895                      .dwattr $C$DW$285, DW_AT_name("ctrlFreq_Hz")
    1896                      .dwattr $C$DW$285, DW_AT_TI_symbol_name("_ctrlFreq_Hz")
    1897                      .dwattr $C$DW$285, DW_AT_data_member_location[DW_OP_plus_uconst 0x9e]
    1898                      .dwattr $C$DW$285, DW_AT_accessibility(DW_ACCESS_public)
    1899              $C$DW$286       .dwtag  DW_TAG_member
    1900                      .dwattr $C$DW$286, DW_AT_type(*$C$DW$T$43)
    1901                      .dwattr $C$DW$286, DW_AT_name("estFreq_Hz")
    1902                      .dwattr $C$DW$286, DW_AT_TI_symbol_name("_estFreq_Hz")
    1903                      .dwattr $C$DW$286, DW_AT_data_member_location[DW_OP_plus_uconst 0xa0]
    1904                      .dwattr $C$DW$286, DW_AT_accessibility(DW_ACCESS_public)
    1905              $C$DW$287       .dwtag  DW_TAG_member
    1906                      .dwattr $C$DW$287, DW_AT_type(*$C$DW$T$43)
    1907                      .dwattr $C$DW$287, DW_AT_name("RoverL_estFreq_Hz")
    1908                      .dwattr $C$DW$287, DW_AT_TI_symbol_name("_RoverL_estFreq_Hz")
    1909                      .dwattr $C$DW$287, DW_AT_data_member_location[DW_OP_plus_uconst 0xa2]
    1910                      .dwattr $C$DW$287, DW_AT_accessibility(DW_ACCESS_public)
    1911              $C$DW$288       .dwtag  DW_TAG_member
    1912                      .dwattr $C$DW$288, DW_AT_type(*$C$DW$T$43)
    1913                      .dwattr $C$DW$288, DW_AT_name("trajFreq_Hz")
    1914                      .dwattr $C$DW$288, DW_AT_TI_symbol_name("_trajFreq_Hz")
    1915                      .dwattr $C$DW$288, DW_AT_data_member_location[DW_OP_plus_uconst 0xa4]
    1916                      .dwattr $C$DW$288, DW_AT_accessibility(DW_ACCESS_public)
    1917              $C$DW$289       .dwtag  DW_TAG_member
    1918                      .dwattr $C$DW$289, DW_AT_type(*$C$DW$T$35)
    1919                      .dwattr $C$DW$289, DW_AT_name("ctrlPeriod_sec")
    1920                      .dwattr $C$DW$289, DW_AT_TI_symbol_name("_ctrlPeriod_sec")
    1921                      .dwattr $C$DW$289, DW_AT_data_member_location[DW_OP_plus_uconst 0xa6]
    1922                      .dwattr $C$DW$289, DW_AT_accessibility(DW_ACCESS_public)
    1923              $C$DW$290       .dwtag  DW_TAG_member
    1924                      .dwattr $C$DW$290, DW_AT_type(*$C$DW$T$35)
    1925                      .dwattr $C$DW$290, DW_AT_name("maxNegativeIdCurrent_a")
    1926                      .dwattr $C$DW$290, DW_AT_TI_symbol_name("_maxNegativeIdCurrent_a")
    1927                      .dwattr $C$DW$290, DW_AT_data_member_location[DW_OP_plus_uconst 0xa8]
    1928                      .dwattr $C$DW$290, DW_AT_accessibility(DW_ACCESS_public)
    1929              $C$DW$291       .dwtag  DW_TAG_member
    1930                      .dwattr $C$DW$291, DW_AT_type(*$C$DW$T$32)
    1931                      .dwattr $C$DW$291, DW_AT_name("errorCode")
    1932                      .dwattr $C$DW$291, DW_AT_TI_symbol_name("_errorCode")
    1933                      .dwattr $C$DW$291, DW_AT_data_member_location[DW_OP_plus_uconst 0xaa]
    1934                      .dwattr $C$DW$291, DW_AT_accessibility(DW_ACCESS_public)
    1935              $C$DW$292       .dwtag  DW_TAG_member
    1936                      .dwattr $C$DW$292, DW_AT_type(*$C$DW$T$39)
    1937                      .dwattr $C$DW$292, DW_AT_name("motor_ID")
TMS320C2000 Assembler PC v6.2.5 Tue Nov 21 21:43:19 2017

Tools Copyright (c) 1996-2014 Texas Instruments Incorporated
C:\Users\wmj\AppData\Local\Temp\0106012                              PAGE   37

    1938                      .dwattr $C$DW$292, DW_AT_TI_symbol_name("_motor_ID")
    1939                      .dwattr $C$DW$292, DW_AT_data_member_location[DW_OP_plus_uconst 0xab]
    1940                      .dwattr $C$DW$292, DW_AT_accessibility(DW_ACCESS_public)
    1941                      .dwendtag $C$DW$T$48
    1942              
    1943              $C$DW$T$58      .dwtag  DW_TAG_typedef, DW_AT_name("USER_Params")
    1944                      .dwattr $C$DW$T$58, DW_AT_type(*$C$DW$T$48)
    1945                      .dwattr $C$DW$T$58, DW_AT_language(DW_LANG_C)
    1946              $C$DW$T$59      .dwtag  DW_TAG_pointer_type
    1947                      .dwattr $C$DW$T$59, DW_AT_type(*$C$DW$T$58)
    1948                      .dwattr $C$DW$T$59, DW_AT_address_class(0x16)
    1949              $C$DW$293       .dwtag  DW_TAG_TI_far_type
    1950                      .dwattr $C$DW$293, DW_AT_type(*$C$DW$T$59)
    1951              $C$DW$T$60      .dwtag  DW_TAG_const_type
    1952                      .dwattr $C$DW$T$60, DW_AT_type(*$C$DW$293)
    1953              $C$DW$T$3       .dwtag  DW_TAG_pointer_type
    1954                      .dwattr $C$DW$T$3, DW_AT_address_class(0x16)
    1955              $C$DW$294       .dwtag  DW_TAG_TI_far_type
    1956                      .dwattr $C$DW$294, DW_AT_type(*$C$DW$T$3)
    1957              $C$DW$T$63      .dwtag  DW_TAG_const_type
    1958                      .dwattr $C$DW$T$63, DW_AT_type(*$C$DW$294)
    1959              $C$DW$T$4       .dwtag  DW_TAG_base_type
    1960                      .dwattr $C$DW$T$4, DW_AT_encoding(DW_ATE_boolean)
    1961                      .dwattr $C$DW$T$4, DW_AT_name("bool")
    1962                      .dwattr $C$DW$T$4, DW_AT_byte_size(0x01)
    1963              $C$DW$T$5       .dwtag  DW_TAG_base_type
    1964                      .dwattr $C$DW$T$5, DW_AT_encoding(DW_ATE_signed_char)
    1965                      .dwattr $C$DW$T$5, DW_AT_name("signed char")
    1966                      .dwattr $C$DW$T$5, DW_AT_byte_size(0x01)
    1967              $C$DW$T$6       .dwtag  DW_TAG_base_type
    1968                      .dwattr $C$DW$T$6, DW_AT_encoding(DW_ATE_unsigned_char)
    1969                      .dwattr $C$DW$T$6, DW_AT_name("unsigned char")
    1970                      .dwattr $C$DW$T$6, DW_AT_byte_size(0x01)
    1971              $C$DW$T$26      .dwtag  DW_TAG_typedef, DW_AT_name("_Bool")
    1972                      .dwattr $C$DW$T$26, DW_AT_type(*$C$DW$T$6)
    1973                      .dwattr $C$DW$T$26, DW_AT_language(DW_LANG_C)
    1974              $C$DW$T$7       .dwtag  DW_TAG_base_type
    1975                      .dwattr $C$DW$T$7, DW_AT_encoding(DW_ATE_signed_char)
    1976                      .dwattr $C$DW$T$7, DW_AT_name("wchar_t")
    1977                      .dwattr $C$DW$T$7, DW_AT_byte_size(0x01)
    1978              $C$DW$T$8       .dwtag  DW_TAG_base_type
    1979                      .dwattr $C$DW$T$8, DW_AT_encoding(DW_ATE_signed)
    1980                      .dwattr $C$DW$T$8, DW_AT_name("short")
    1981                      .dwattr $C$DW$T$8, DW_AT_byte_size(0x01)
    1982              $C$DW$T$9       .dwtag  DW_TAG_base_type
    1983                      .dwattr $C$DW$T$9, DW_AT_encoding(DW_ATE_unsigned)
    1984                      .dwattr $C$DW$T$9, DW_AT_name("unsigned short")
    1985                      .dwattr $C$DW$T$9, DW_AT_byte_size(0x01)
    1986              $C$DW$T$19      .dwtag  DW_TAG_typedef, DW_AT_name("uint16_t")
    1987                      .dwattr $C$DW$T$19, DW_AT_type(*$C$DW$T$9)
    1988                      .dwattr $C$DW$T$19, DW_AT_language(DW_LANG_C)
    1989              $C$DW$295       .dwtag  DW_TAG_TI_far_type
    1990                      .dwattr $C$DW$295, DW_AT_type(*$C$DW$T$19)
    1991              $C$DW$T$66      .dwtag  DW_TAG_const_type
    1992                      .dwattr $C$DW$T$66, DW_AT_type(*$C$DW$295)
TMS320C2000 Assembler PC v6.2.5 Tue Nov 21 21:43:19 2017

Tools Copyright (c) 1996-2014 Texas Instruments Incorporated
