TMS320C2000 Assembler PC v15.12.3 Wed Nov 22 00:56:24 2017

Tools Copyright (c) 1996-2015 Texas Instruments Incorporated
C:\Users\wmj\AppData\Local\Temp\0920410                              PAGE    1

       1              ;***************************************************************
       2              ;* TMS320C2000 C/C++ Codegen                   PC v15.12.3.LTS *
       3              ;* Date/Time created: Wed Nov 22 00:56:24 2017                 *
       4              ;***************************************************************
       5                      .compiler_opts --abi=coffabi --float_support=softlib --hll_source=on --mem_model:code=flat --mem_mode
       6        0002  FP      .set    XAR2
       7              
       8              $C$DW$CU        .dwtag  DW_TAG_compile_unit
       9                      .dwattr $C$DW$CU, DW_AT_name("C:/Users/wmj/Desktop/BM1000_v1.1/sw/drivers/drvic/motor.c")
      10                      .dwattr $C$DW$CU, DW_AT_producer("TI TMS320C2000 C/C++ Codegen PC v15.12.3.LTS Copyright (c) 1996-201
      11                      .dwattr $C$DW$CU, DW_AT_TI_version(0x01)
      12                      .dwattr $C$DW$CU, DW_AT_comp_dir("C:\Users\wmj\Desktop\BM1000_v1.1\sw\solutions\instaspin_foc\boards\
      13              ;       C:\ti\ccsv6\tools\compiler\c2000_15.12.3.LTS\bin\opt2000.exe C:\\Users\\wmj\\AppData\\Local\\Temp\\09

    1527              
    1528              $C$DW$150       .dwtag  DW_TAG_enumerator
    1529                      .dwattr $C$DW$150, DW_AT_name("USER_ErrorCode_fluxEstFreq_Hz_Low")
    1530                      .dwattr $C$DW$150, DW_AT_const_value(0x5d)
    1531              
    1532              $C$DW$151       .dwtag  DW_TAG_enumerator
    1533                      .dwattr $C$DW$151, DW_AT_name("USER_ErrorCode_ctrlFreq_Hz_High")
    1534                      .dwattr $C$DW$151, DW_AT_const_value(0x5e)
    1535              
    1536              $C$DW$152       .dwtag  DW_TAG_enumerator
    1537                      .dwattr $C$DW$152, DW_AT_name("USER_ErrorCode_ctrlFreq_Hz_Low")
    1538                      .dwattr $C$DW$152, DW_AT_const_value(0x5f)
    1539              
    1540              $C$DW$153       .dwtag  DW_TAG_enumerator
    1541                      .dwattr $C$DW$153, DW_AT_name("USER_ErrorCode_estFreq_Hz_High")
    1542                      .dwattr $C$DW$153, DW_AT_const_value(0x60)
    1543              
    1544              $C$DW$154       .dwtag  DW_TAG_enumerator
    1545                      .dwattr $C$DW$154, DW_AT_name("USER_ErrorCode_estFreq_Hz_Low")
    1546                      .dwattr $C$DW$154, DW_AT_const_value(0x61)
    1547              
    1548              $C$DW$155       .dwtag  DW_TAG_enumerator
    1549                      .dwattr $C$DW$155, DW_AT_name("USER_ErrorCode_RoverL_estFreq_Hz_High")
    1550                      .dwattr $C$DW$155, DW_AT_const_value(0x62)
    1551              
    1552              $C$DW$156       .dwtag  DW_TAG_enumerator
TMS320C2000 Assembler PC v15.12.3 Wed Nov 22 00:56:24 2017

Tools Copyright (c) 1996-2015 Texas Instruments Incorporated
C:\Users\wmj\AppData\Local\Temp\0920410                              PAGE   30

    1553                      .dwattr $C$DW$156, DW_AT_name("USER_ErrorCode_RoverL_estFreq_Hz_Low")
    1554                      .dwattr $C$DW$156, DW_AT_const_value(0x63)
    1555              
    1556              $C$DW$157       .dwtag  DW_TAG_enumerator
    1557                      .dwattr $C$DW$157, DW_AT_name("USER_ErrorCode_trajFreq_Hz_High")
    1558                      .dwattr $C$DW$157, DW_AT_const_value(0x64)
    1559              
    1560              $C$DW$158       .dwtag  DW_TAG_enumerator
    1561                      .dwattr $C$DW$158, DW_AT_name("USER_ErrorCode_trajFreq_Hz_Low")
    1562                      .dwattr $C$DW$158, DW_AT_const_value(0x65)
    1563              
    1564              $C$DW$159       .dwtag  DW_TAG_enumerator
    1565                      .dwattr $C$DW$159, DW_AT_name("USER_ErrorCode_ctrlPeriod_sec_High")
    1566                      .dwattr $C$DW$159, DW_AT_const_value(0x66)
    1567              
    1568              $C$DW$160       .dwtag  DW_TAG_enumerator
    1569                      .dwattr $C$DW$160, DW_AT_name("USER_ErrorCode_ctrlPeriod_sec_Low")
    1570                      .dwattr $C$DW$160, DW_AT_const_value(0x67)
    1571              
    1572              $C$DW$161       .dwtag  DW_TAG_enumerator
    1573                      .dwattr $C$DW$161, DW_AT_name("USER_ErrorCode_maxNegativeIdCurrent_a_High")
    1574                      .dwattr $C$DW$161, DW_AT_const_value(0x68)
    1575              
    1576              $C$DW$162       .dwtag  DW_TAG_enumerator
    1577                      .dwattr $C$DW$162, DW_AT_name("USER_ErrorCode_maxNegativeIdCurrent_a_Low")
    1578                      .dwattr $C$DW$162, DW_AT_const_value(0x69)
    1579              
    1580              $C$DW$163       .dwtag  DW_TAG_enumerator
    1581                      .dwattr $C$DW$163, DW_AT_name("USER_numErrorCodes")
    1582                      .dwattr $C$DW$163, DW_AT_const_value(0x6a)
    1583              
    1584                      .dwendtag $C$DW$T$31
    1585              
    1586              $C$DW$T$32      .dwtag  DW_TAG_typedef
    1587                      .dwattr $C$DW$T$32, DW_AT_name("USER_ErrorCode_e")
    1588                      .dwattr $C$DW$T$32, DW_AT_type(*$C$DW$T$31)
    1589                      .dwattr $C$DW$T$32, DW_AT_language(DW_LANG_C)
    1590              
    1591              
    1592              $C$DW$T$40      .dwtag  DW_TAG_enumeration_type
    1593                      .dwattr $C$DW$T$40, DW_AT_byte_size(0x01)
    1594              $C$DW$164       .dwtag  DW_TAG_enumerator
    1595                      .dwattr $C$DW$164, DW_AT_name("MOTOR_Type_Induction")
    1596                      .dwattr $C$DW$164, DW_AT_const_value(0x00)
    1597              
    1598              $C$DW$165       .dwtag  DW_TAG_enumerator
    1599                      .dwattr $C$DW$165, DW_AT_name("MOTOR_Type_Pm")
    1600                      .dwattr $C$DW$165, DW_AT_const_value(0x01)
    1601              
    1602                      .dwendtag $C$DW$T$40
    1603              
    1604              $C$DW$T$41      .dwtag  DW_TAG_typedef
    1605                      .dwattr $C$DW$T$41, DW_AT_name("MOTOR_Type_e")
    1606                      .dwattr $C$DW$T$41, DW_AT_type(*$C$DW$T$40)
    1607                      .dwattr $C$DW$T$41, DW_AT_language(DW_LANG_C)
TMS320C2000 Assembler PC v15.12.3 Wed Nov 22 00:56:24 2017

Tools Copyright (c) 1996-2015 Texas Instruments Incorporated
C:\Users\wmj\AppData\Local\Temp\0920410                              PAGE   31

    1608              
    1609              
    1610              $C$DW$T$22      .dwtag  DW_TAG_structure_type
    1611                      .dwattr $C$DW$T$22, DW_AT_name("_CTRL_Version_")
    1612                      .dwattr $C$DW$T$22, DW_AT_byte_size(0x04)
    1613              $C$DW$166       .dwtag  DW_TAG_member
    1614                      .dwattr $C$DW$166, DW_AT_type(*$C$DW$T$19)
    1615                      .dwattr $C$DW$166, DW_AT_name("rsvd")
    1616                      .dwattr $C$DW$166, DW_AT_TI_symbol_name("_rsvd")
    1617                      .dwattr $C$DW$166, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    1618                      .dwattr $C$DW$166, DW_AT_accessibility(DW_ACCESS_public)
    1619              
    1620              $C$DW$167       .dwtag  DW_TAG_member
    1621                      .dwattr $C$DW$167, DW_AT_type(*$C$DW$T$21)
    1622                      .dwattr $C$DW$167, DW_AT_name("targetProc")
    1623                      .dwattr $C$DW$167, DW_AT_TI_symbol_name("_targetProc")
    1624                      .dwattr $C$DW$167, DW_AT_data_member_location[DW_OP_plus_uconst 0x1]
    1625                      .dwattr $C$DW$167, DW_AT_accessibility(DW_ACCESS_public)
    1626              
    1627              $C$DW$168       .dwtag  DW_TAG_member
    1628                      .dwattr $C$DW$168, DW_AT_type(*$C$DW$T$19)
    1629                      .dwattr $C$DW$168, DW_AT_name("major")
    1630                      .dwattr $C$DW$168, DW_AT_TI_symbol_name("_major")
    1631                      .dwattr $C$DW$168, DW_AT_data_member_location[DW_OP_plus_uconst 0x2]
    1632                      .dwattr $C$DW$168, DW_AT_accessibility(DW_ACCESS_public)
    1633              
    1634              $C$DW$169       .dwtag  DW_TAG_member
    1635                      .dwattr $C$DW$169, DW_AT_type(*$C$DW$T$19)
    1636                      .dwattr $C$DW$169, DW_AT_name("minor")
    1637                      .dwattr $C$DW$169, DW_AT_TI_symbol_name("_minor")
    1638                      .dwattr $C$DW$169, DW_AT_data_member_location[DW_OP_plus_uconst 0x3]
    1639                      .dwattr $C$DW$169, DW_AT_accessibility(DW_ACCESS_public)
    1640              
    1641                      .dwendtag $C$DW$T$22
    1642              
    1643              $C$DW$T$33      .dwtag  DW_TAG_typedef
    1644                      .dwattr $C$DW$T$33, DW_AT_name("CTRL_Version")
    1645                      .dwattr $C$DW$T$33, DW_AT_type(*$C$DW$T$22)
    1646                      .dwattr $C$DW$T$33, DW_AT_language(DW_LANG_C)
    1647              
    1648              
    1649              $C$DW$T$25      .dwtag  DW_TAG_structure_type
    1650                      .dwattr $C$DW$T$25, DW_AT_name("_MATH_vec3_")
    1651                      .dwattr $C$DW$T$25, DW_AT_byte_size(0x06)
    1652              $C$DW$170       .dwtag  DW_TAG_member
    1653                      .dwattr $C$DW$170, DW_AT_type(*$C$DW$T$24)
    1654                      .dwattr $C$DW$170, DW_AT_name("value")
    1655                      .dwattr $C$DW$170, DW_AT_TI_symbol_name("_value")
    1656                      .dwattr $C$DW$170, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    1657                      .dwattr $C$DW$170, DW_AT_accessibility(DW_ACCESS_public)
    1658              
    1659                      .dwendtag $C$DW$T$25
    1660              
    1661              $C$DW$T$36      .dwtag  DW_TAG_typedef
    1662                      .dwattr $C$DW$T$36, DW_AT_name("MATH_vec3")
TMS320C2000 Assembler PC v15.12.3 Wed Nov 22 00:56:24 2017

Tools Copyright (c) 1996-2015 Texas Instruments Incorporated
C:\Users\wmj\AppData\Local\Temp\0920410                              PAGE   32

    1663                      .dwattr $C$DW$T$36, DW_AT_type(*$C$DW$T$25)
    1664                      .dwattr $C$DW$T$36, DW_AT_language(DW_LANG_C)
    1665              
    1666              
    1667              $C$DW$T$37      .dwtag  DW_TAG_structure_type
    1668                      .dwattr $C$DW$T$37, DW_AT_name("_MOTOR_Obj_")
    1669                      .dwattr $C$DW$T$37, DW_AT_byte_size(0x70)
    1670              $C$DW$171       .dwtag  DW_TAG_member
    1671                      .dwattr $C$DW$171, DW_AT_type(*$C$DW$T$26)
    1672                      .dwattr $C$DW$171, DW_AT_name("Flag_enableSys")
    1673                      .dwattr $C$DW$171, DW_AT_TI_symbol_name("_Flag_enableSys")
    1674                      .dwattr $C$DW$171, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    1675                      .dwattr $C$DW$171, DW_AT_accessibility(DW_ACCESS_public)
    1676              
    1677              $C$DW$172       .dwtag  DW_TAG_member
    1678                      .dwattr $C$DW$172, DW_AT_type(*$C$DW$T$26)
    1679                      .dwattr $C$DW$172, DW_AT_name("Flag_Run_Identify")
    1680                      .dwattr $C$DW$172, DW_AT_TI_symbol_name("_Flag_Run_Identify")
    1681                      .dwattr $C$DW$172, DW_AT_data_member_location[DW_OP_plus_uconst 0x1]
    1682                      .dwattr $C$DW$172, DW_AT_accessibility(DW_ACCESS_public)
    1683              
    1684              $C$DW$173       .dwtag  DW_TAG_member
    1685                      .dwattr $C$DW$173, DW_AT_type(*$C$DW$T$26)
    1686                      .dwattr $C$DW$173, DW_AT_name("Flag_MotorIdentified")
    1687                      .dwattr $C$DW$173, DW_AT_TI_symbol_name("_Flag_MotorIdentified")
    1688                      .dwattr $C$DW$173, DW_AT_data_member_location[DW_OP_plus_uconst 0x2]
    1689                      .dwattr $C$DW$173, DW_AT_accessibility(DW_ACCESS_public)
    1690              
    1691              $C$DW$174       .dwtag  DW_TAG_member
    1692                      .dwattr $C$DW$174, DW_AT_type(*$C$DW$T$26)
    1693                      .dwattr $C$DW$174, DW_AT_name("Flag_enableForceAngle")
    1694                      .dwattr $C$DW$174, DW_AT_TI_symbol_name("_Flag_enableForceAngle")
    1695                      .dwattr $C$DW$174, DW_AT_data_member_location[DW_OP_plus_uconst 0x3]
    1696                      .dwattr $C$DW$174, DW_AT_accessibility(DW_ACCESS_public)
    1697              
    1698              $C$DW$175       .dwtag  DW_TAG_member
    1699                      .dwattr $C$DW$175, DW_AT_type(*$C$DW$T$26)
    1700                      .dwattr $C$DW$175, DW_AT_name("Flag_ZeroPiont_Identify")
    1701                      .dwattr $C$DW$175, DW_AT_TI_symbol_name("_Flag_ZeroPiont_Identify")
    1702                      .dwattr $C$DW$175, DW_AT_data_member_location[DW_OP_plus_uconst 0x4]
    1703                      .dwattr $C$DW$175, DW_AT_accessibility(DW_ACCESS_public)
    1704              
    1705              $C$DW$176       .dwtag  DW_TAG_member
    1706                      .dwattr $C$DW$176, DW_AT_type(*$C$DW$T$26)
    1707                      .dwattr $C$DW$176, DW_AT_name("Flag_enableRsRecalc")
    1708                      .dwattr $C$DW$176, DW_AT_TI_symbol_name("_Flag_enableRsRecalc")
    1709                      .dwattr $C$DW$176, DW_AT_data_member_location[DW_OP_plus_uconst 0x5]
    1710                      .dwattr $C$DW$176, DW_AT_accessibility(DW_ACCESS_public)
    1711              
    1712              $C$DW$177       .dwtag  DW_TAG_member
    1713                      .dwattr $C$DW$177, DW_AT_type(*$C$DW$T$26)
    1714                      .dwattr $C$DW$177, DW_AT_name("Flag_enableUserParams")
    1715                      .dwattr $C$DW$177, DW_AT_TI_symbol_name("_Flag_enableUserParams")
    1716                      .dwattr $C$DW$177, DW_AT_data_member_location[DW_OP_plus_uconst 0x6]
    1717                      .dwattr $C$DW$177, DW_AT_accessibility(DW_ACCESS_public)
TMS320C2000 Assembler PC v15.12.3 Wed Nov 22 00:56:24 2017

Tools Copyright (c) 1996-2015 Texas Instruments Incorporated
C:\Users\wmj\AppData\Local\Temp\0920410                              PAGE   33

    1718              
    1719              $C$DW$178       .dwtag  DW_TAG_member
    1720                      .dwattr $C$DW$178, DW_AT_type(*$C$DW$T$26)
    1721                      .dwattr $C$DW$178, DW_AT_name("Flag_enableOffsetcalc")
    1722                      .dwattr $C$DW$178, DW_AT_TI_symbol_name("_Flag_enableOffsetcalc")
    1723                      .dwattr $C$DW$178, DW_AT_data_member_location[DW_OP_plus_uconst 0x7]
    1724                      .dwattr $C$DW$178, DW_AT_accessibility(DW_ACCESS_public)
    1725              
    1726              $C$DW$179       .dwtag  DW_TAG_member
    1727                      .dwattr $C$DW$179, DW_AT_type(*$C$DW$T$26)
    1728                      .dwattr $C$DW$179, DW_AT_name("Flag_enablePowerWarp")
    1729                      .dwattr $C$DW$179, DW_AT_TI_symbol_name("_Flag_enablePowerWarp")
    1730                      .dwattr $C$DW$179, DW_AT_data_member_location[DW_OP_plus_uconst 0x8]
    1731                      .dwattr $C$DW$179, DW_AT_accessibility(DW_ACCESS_public)
    1732              
    1733              $C$DW$180       .dwtag  DW_TAG_member
    1734                      .dwattr $C$DW$180, DW_AT_type(*$C$DW$T$26)
    1735                      .dwattr $C$DW$180, DW_AT_name("Flag_enableSpeedCtrl")
    1736                      .dwattr $C$DW$180, DW_AT_TI_symbol_name("_Flag_enableSpeedCtrl")
    1737                      .dwattr $C$DW$180, DW_AT_data_member_location[DW_OP_plus_uconst 0x9]
    1738                      .dwattr $C$DW$180, DW_AT_accessibility(DW_ACCESS_public)
    1739              
    1740              $C$DW$181       .dwtag  DW_TAG_member
    1741                      .dwattr $C$DW$181, DW_AT_type(*$C$DW$T$26)
    1742                      .dwattr $C$DW$181, DW_AT_name("Flag_enableRun")
    1743                      .dwattr $C$DW$181, DW_AT_TI_symbol_name("_Flag_enableRun")
    1744                      .dwattr $C$DW$181, DW_AT_data_member_location[DW_OP_plus_uconst 0xa]
    1745                      .dwattr $C$DW$181, DW_AT_accessibility(DW_ACCESS_public)
    1746              
    1747              $C$DW$182       .dwtag  DW_TAG_member
    1748                      .dwattr $C$DW$182, DW_AT_type(*$C$DW$T$26)
    1749                      .dwattr $C$DW$182, DW_AT_name("Flag_RunState")
    1750                      .dwattr $C$DW$182, DW_AT_TI_symbol_name("_Flag_RunState")
    1751                      .dwattr $C$DW$182, DW_AT_data_member_location[DW_OP_plus_uconst 0xb]
    1752                      .dwattr $C$DW$182, DW_AT_accessibility(DW_ACCESS_public)
    1753              
    1754              $C$DW$183       .dwtag  DW_TAG_member
    1755                      .dwattr $C$DW$183, DW_AT_type(*$C$DW$T$26)
    1756                      .dwattr $C$DW$183, DW_AT_name("Flag_enableFlyingStart")
    1757                      .dwattr $C$DW$183, DW_AT_TI_symbol_name("_Flag_enableFlyingStart")
    1758                      .dwattr $C$DW$183, DW_AT_data_member_location[DW_OP_plus_uconst 0xc]
    1759                      .dwattr $C$DW$183, DW_AT_accessibility(DW_ACCESS_public)
    1760              
    1761              $C$DW$184       .dwtag  DW_TAG_member
    1762                      .dwattr $C$DW$184, DW_AT_type(*$C$DW$T$26)
    1763                      .dwattr $C$DW$184, DW_AT_name("Flag_ContactSensor")
    1764                      .dwattr $C$DW$184, DW_AT_TI_symbol_name("_Flag_ContactSensor")
    1765                      .dwattr $C$DW$184, DW_AT_data_member_location[DW_OP_plus_uconst 0xd]
    1766                      .dwattr $C$DW$184, DW_AT_accessibility(DW_ACCESS_public)
    1767              
    1768              $C$DW$185       .dwtag  DW_TAG_member
    1769                      .dwattr $C$DW$185, DW_AT_type(*$C$DW$T$26)
    1770                      .dwattr $C$DW$185, DW_AT_name("RunPositionProfile")
    1771                      .dwattr $C$DW$185, DW_AT_TI_symbol_name("_RunPositionProfile")
    1772                      .dwattr $C$DW$185, DW_AT_data_member_location[DW_OP_plus_uconst 0xe]
TMS320C2000 Assembler PC v15.12.3 Wed Nov 22 00:56:24 2017

Tools Copyright (c) 1996-2015 Texas Instruments Incorporated
C:\Users\wmj\AppData\Local\Temp\0920410                              PAGE   34

    1773                      .dwattr $C$DW$185, DW_AT_accessibility(DW_ACCESS_public)
    1774              
    1775              $C$DW$186       .dwtag  DW_TAG_member
    1776                      .dwattr $C$DW$186, DW_AT_type(*$C$DW$T$26)
    1777                      .dwattr $C$DW$186, DW_AT_name("getSensor")
    1778                      .dwattr $C$DW$186, DW_AT_TI_symbol_name("_getSensor")
    1779                      .dwattr $C$DW$186, DW_AT_data_member_location[DW_OP_plus_uconst 0xf]
    1780                      .dwattr $C$DW$186, DW_AT_accessibility(DW_ACCESS_public)
    1781              
    1782              $C$DW$187       .dwtag  DW_TAG_member
    1783                      .dwattr $C$DW$187, DW_AT_type(*$C$DW$T$26)
    1784                      .dwattr $C$DW$187, DW_AT_name("Flag_UseSpinTAC")
    1785                      .dwattr $C$DW$187, DW_AT_TI_symbol_name("_Flag_UseSpinTAC")
    1786                      .dwattr $C$DW$187, DW_AT_data_member_location[DW_OP_plus_uconst 0x10]
    1787                      .dwattr $C$DW$187, DW_AT_accessibility(DW_ACCESS_public)
    1788              
    1789              $C$DW$188       .dwtag  DW_TAG_member
    1790                      .dwattr $C$DW$188, DW_AT_type(*$C$DW$T$26)
    1791                      .dwattr $C$DW$188, DW_AT_name("Flag_MotorParamsEst")
    1792                      .dwattr $C$DW$188, DW_AT_TI_symbol_name("_Flag_MotorParamsEst")
    1793                      .dwattr $C$DW$188, DW_AT_data_member_location[DW_OP_plus_uconst 0x11]
    1794                      .dwattr $C$DW$188, DW_AT_accessibility(DW_ACCESS_public)
    1795              
    1796              $C$DW$189       .dwtag  DW_TAG_member
    1797                      .dwattr $C$DW$189, DW_AT_type(*$C$DW$T$28)
    1798                      .dwattr $C$DW$189, DW_AT_name("CtrlState")
    1799                      .dwattr $C$DW$189, DW_AT_TI_symbol_name("_CtrlState")
    1800                      .dwattr $C$DW$189, DW_AT_data_member_location[DW_OP_plus_uconst 0x12]
    1801                      .dwattr $C$DW$189, DW_AT_accessibility(DW_ACCESS_public)
    1802              
    1803              $C$DW$190       .dwtag  DW_TAG_member
    1804                      .dwattr $C$DW$190, DW_AT_type(*$C$DW$T$30)
    1805                      .dwattr $C$DW$190, DW_AT_name("EstState")
    1806                      .dwattr $C$DW$190, DW_AT_TI_symbol_name("_EstState")
    1807                      .dwattr $C$DW$190, DW_AT_data_member_location[DW_OP_plus_uconst 0x13]
    1808                      .dwattr $C$DW$190, DW_AT_accessibility(DW_ACCESS_public)
    1809              
    1810              $C$DW$191       .dwtag  DW_TAG_member
    1811                      .dwattr $C$DW$191, DW_AT_type(*$C$DW$T$32)
    1812                      .dwattr $C$DW$191, DW_AT_name("UserErrorCode")
    1813                      .dwattr $C$DW$191, DW_AT_TI_symbol_name("_UserErrorCode")
    1814                      .dwattr $C$DW$191, DW_AT_data_member_location[DW_OP_plus_uconst 0x14]
    1815                      .dwattr $C$DW$191, DW_AT_accessibility(DW_ACCESS_public)
    1816              
    1817              $C$DW$192       .dwtag  DW_TAG_member
    1818                      .dwattr $C$DW$192, DW_AT_type(*$C$DW$T$33)
    1819                      .dwattr $C$DW$192, DW_AT_name("CtrlVersion")
    1820                      .dwattr $C$DW$192, DW_AT_TI_symbol_name("_CtrlVersion")
    1821                      .dwattr $C$DW$192, DW_AT_data_member_location[DW_OP_plus_uconst 0x15]
    1822                      .dwattr $C$DW$192, DW_AT_accessibility(DW_ACCESS_public)
    1823              
    1824              $C$DW$193       .dwtag  DW_TAG_member
    1825                      .dwattr $C$DW$193, DW_AT_type(*$C$DW$T$23)
    1826                      .dwattr $C$DW$193, DW_AT_name("SpeedRef_krpm")
    1827                      .dwattr $C$DW$193, DW_AT_TI_symbol_name("_SpeedRef_krpm")
TMS320C2000 Assembler PC v15.12.3 Wed Nov 22 00:56:24 2017

Tools Copyright (c) 1996-2015 Texas Instruments Incorporated
C:\Users\wmj\AppData\Local\Temp\0920410                              PAGE   35

    1828                      .dwattr $C$DW$193, DW_AT_data_member_location[DW_OP_plus_uconst 0x1a]
    1829                      .dwattr $C$DW$193, DW_AT_accessibility(DW_ACCESS_public)
    1830              
    1831              $C$DW$194       .dwtag  DW_TAG_member
    1832                      .dwattr $C$DW$194, DW_AT_type(*$C$DW$T$23)
    1833                      .dwattr $C$DW$194, DW_AT_name("MaxAccel_krpmps")
    1834                      .dwattr $C$DW$194, DW_AT_TI_symbol_name("_MaxAccel_krpmps")
    1835                      .dwattr $C$DW$194, DW_AT_data_member_location[DW_OP_plus_uconst 0x1c]
    1836                      .dwattr $C$DW$194, DW_AT_accessibility(DW_ACCESS_public)
    1837              
    1838              $C$DW$195       .dwtag  DW_TAG_member
    1839                      .dwattr $C$DW$195, DW_AT_type(*$C$DW$T$23)
    1840                      .dwattr $C$DW$195, DW_AT_name("MaxDecel_krpmps")
    1841                      .dwattr $C$DW$195, DW_AT_TI_symbol_name("_MaxDecel_krpmps")
    1842                      .dwattr $C$DW$195, DW_AT_data_member_location[DW_OP_plus_uconst 0x1e]
    1843                      .dwattr $C$DW$195, DW_AT_accessibility(DW_ACCESS_public)
    1844              
    1845              $C$DW$196       .dwtag  DW_TAG_member
    1846                      .dwattr $C$DW$196, DW_AT_type(*$C$DW$T$34)
    1847                      .dwattr $C$DW$196, DW_AT_name("MaxJrk_krpmps2")
    1848                      .dwattr $C$DW$196, DW_AT_TI_symbol_name("_MaxJrk_krpmps2")
    1849                      .dwattr $C$DW$196, DW_AT_data_member_location[DW_OP_plus_uconst 0x20]
    1850                      .dwattr $C$DW$196, DW_AT_accessibility(DW_ACCESS_public)
    1851              
    1852              $C$DW$197       .dwtag  DW_TAG_member
    1853                      .dwattr $C$DW$197, DW_AT_type(*$C$DW$T$23)
    1854                      .dwattr $C$DW$197, DW_AT_name("MaxCurrentRatio_pu")
    1855                      .dwattr $C$DW$197, DW_AT_TI_symbol_name("_MaxCurrentRatio_pu")
    1856                      .dwattr $C$DW$197, DW_AT_data_member_location[DW_OP_plus_uconst 0x22]
    1857                      .dwattr $C$DW$197, DW_AT_accessibility(DW_ACCESS_public)
    1858              
    1859              $C$DW$198       .dwtag  DW_TAG_member
    1860                      .dwattr $C$DW$198, DW_AT_type(*$C$DW$T$23)
    1861                      .dwattr $C$DW$198, DW_AT_name("Speed_krpm")
    1862                      .dwattr $C$DW$198, DW_AT_TI_symbol_name("_Speed_krpm")
    1863                      .dwattr $C$DW$198, DW_AT_data_member_location[DW_OP_plus_uconst 0x24]
    1864                      .dwattr $C$DW$198, DW_AT_accessibility(DW_ACCESS_public)
    1865              
    1866              $C$DW$199       .dwtag  DW_TAG_member
    1867                      .dwattr $C$DW$199, DW_AT_type(*$C$DW$T$23)
    1868                      .dwattr $C$DW$199, DW_AT_name("Flux_Wb")
    1869                      .dwattr $C$DW$199, DW_AT_TI_symbol_name("_Flux_Wb")
    1870                      .dwattr $C$DW$199, DW_AT_data_member_location[DW_OP_plus_uconst 0x26]
    1871                      .dwattr $C$DW$199, DW_AT_accessibility(DW_ACCESS_public)
    1872              
    1873              $C$DW$200       .dwtag  DW_TAG_member
    1874                      .dwattr $C$DW$200, DW_AT_type(*$C$DW$T$23)
    1875                      .dwattr $C$DW$200, DW_AT_name("Torque_Nm")
    1876                      .dwattr $C$DW$200, DW_AT_TI_symbol_name("_Torque_Nm")
    1877                      .dwattr $C$DW$200, DW_AT_data_member_location[DW_OP_plus_uconst 0x28]
    1878                      .dwattr $C$DW$200, DW_AT_accessibility(DW_ACCESS_public)
    1879              
    1880              $C$DW$201       .dwtag  DW_TAG_member
    1881                      .dwattr $C$DW$201, DW_AT_type(*$C$DW$T$35)
    1882                      .dwattr $C$DW$201, DW_AT_name("Rr_Ohm")
TMS320C2000 Assembler PC v15.12.3 Wed Nov 22 00:56:24 2017

Tools Copyright (c) 1996-2015 Texas Instruments Incorporated
C:\Users\wmj\AppData\Local\Temp\0920410                              PAGE   36

    1883                      .dwattr $C$DW$201, DW_AT_TI_symbol_name("_Rr_Ohm")
    1884                      .dwattr $C$DW$201, DW_AT_data_member_location[DW_OP_plus_uconst 0x2a]
    1885                      .dwattr $C$DW$201, DW_AT_accessibility(DW_ACCESS_public)
    1886              
    1887              $C$DW$202       .dwtag  DW_TAG_member
    1888                      .dwattr $C$DW$202, DW_AT_type(*$C$DW$T$35)
    1889                      .dwattr $C$DW$202, DW_AT_name("Rs_Ohm")
    1890                      .dwattr $C$DW$202, DW_AT_TI_symbol_name("_Rs_Ohm")
    1891                      .dwattr $C$DW$202, DW_AT_data_member_location[DW_OP_plus_uconst 0x2c]
    1892                      .dwattr $C$DW$202, DW_AT_accessibility(DW_ACCESS_public)
    1893              
    1894              $C$DW$203       .dwtag  DW_TAG_member
    1895                      .dwattr $C$DW$203, DW_AT_type(*$C$DW$T$35)
    1896                      .dwattr $C$DW$203, DW_AT_name("Lsd_H")
    1897                      .dwattr $C$DW$203, DW_AT_TI_symbol_name("_Lsd_H")
    1898                      .dwattr $C$DW$203, DW_AT_data_member_location[DW_OP_plus_uconst 0x2e]
    1899                      .dwattr $C$DW$203, DW_AT_accessibility(DW_ACCESS_public)
    1900              
    1901              $C$DW$204       .dwtag  DW_TAG_member
    1902                      .dwattr $C$DW$204, DW_AT_type(*$C$DW$T$35)
    1903                      .dwattr $C$DW$204, DW_AT_name("Lsq_H")
    1904                      .dwattr $C$DW$204, DW_AT_TI_symbol_name("_Lsq_H")
    1905                      .dwattr $C$DW$204, DW_AT_data_member_location[DW_OP_plus_uconst 0x30]
    1906                      .dwattr $C$DW$204, DW_AT_accessibility(DW_ACCESS_public)
    1907              
    1908              $C$DW$205       .dwtag  DW_TAG_member
    1909                      .dwattr $C$DW$205, DW_AT_type(*$C$DW$T$35)
    1910                      .dwattr $C$DW$205, DW_AT_name("MaxCurr_A")
    1911                      .dwattr $C$DW$205, DW_AT_TI_symbol_name("_MaxCurr_A")
    1912                      .dwattr $C$DW$205, DW_AT_data_member_location[DW_OP_plus_uconst 0x32]
    1913                      .dwattr $C$DW$205, DW_AT_accessibility(DW_ACCESS_public)
    1914              
    1915              $C$DW$206       .dwtag  DW_TAG_member
    1916                      .dwattr $C$DW$206, DW_AT_type(*$C$DW$T$35)
    1917                      .dwattr $C$DW$206, DW_AT_name("MagnCurr_A")
    1918                      .dwattr $C$DW$206, DW_AT_TI_symbol_name("_MagnCurr_A")
    1919                      .dwattr $C$DW$206, DW_AT_data_member_location[DW_OP_plus_uconst 0x34]
    1920                      .dwattr $C$DW$206, DW_AT_accessibility(DW_ACCESS_public)
    1921              
    1922              $C$DW$207       .dwtag  DW_TAG_member
    1923                      .dwattr $C$DW$207, DW_AT_type(*$C$DW$T$35)
    1924                      .dwattr $C$DW$207, DW_AT_name("Flux_VpHz")
    1925                      .dwattr $C$DW$207, DW_AT_TI_symbol_name("_Flux_VpHz")
    1926                      .dwattr $C$DW$207, DW_AT_data_member_location[DW_OP_plus_uconst 0x36]
    1927                      .dwattr $C$DW$207, DW_AT_accessibility(DW_ACCESS_public)
    1928              
    1929              $C$DW$208       .dwtag  DW_TAG_member
    1930                      .dwattr $C$DW$208, DW_AT_type(*$C$DW$T$35)
    1931                      .dwattr $C$DW$208, DW_AT_name("RsOnLine_Ohm")
    1932                      .dwattr $C$DW$208, DW_AT_TI_symbol_name("_RsOnLine_Ohm")
    1933                      .dwattr $C$DW$208, DW_AT_data_member_location[DW_OP_plus_uconst 0x38]
    1934                      .dwattr $C$DW$208, DW_AT_accessibility(DW_ACCESS_public)
    1935              
    1936              $C$DW$209       .dwtag  DW_TAG_member
    1937                      .dwattr $C$DW$209, DW_AT_type(*$C$DW$T$23)
TMS320C2000 Assembler PC v15.12.3 Wed Nov 22 00:56:24 2017

Tools Copyright (c) 1996-2015 Texas Instruments Incorporated
C:\Users\wmj\AppData\Local\Temp\0920410                              PAGE   37

    1938                      .dwattr $C$DW$209, DW_AT_name("OverModulation")
    1939                      .dwattr $C$DW$209, DW_AT_TI_symbol_name("_OverModulation")
    1940                      .dwattr $C$DW$209, DW_AT_data_member_location[DW_OP_plus_uconst 0x3a]
    1941                      .dwattr $C$DW$209, DW_AT_accessibility(DW_ACCESS_public)
    1942              
    1943              $C$DW$210       .dwtag  DW_TAG_member
    1944                      .dwattr $C$DW$210, DW_AT_type(*$C$DW$T$23)
    1945                      .dwattr $C$DW$210, DW_AT_name("RsOnLineCurrent_A")
    1946                      .dwattr $C$DW$210, DW_AT_TI_symbol_name("_RsOnLineCurrent_A")
    1947                      .dwattr $C$DW$210, DW_AT_data_member_location[DW_OP_plus_uconst 0x3c]
    1948                      .dwattr $C$DW$210, DW_AT_accessibility(DW_ACCESS_public)
    1949              
    1950              $C$DW$211       .dwtag  DW_TAG_member
    1951                      .dwattr $C$DW$211, DW_AT_type(*$C$DW$T$23)
    1952                      .dwattr $C$DW$211, DW_AT_name("Kp_Idq")
    1953                      .dwattr $C$DW$211, DW_AT_TI_symbol_name("_Kp_Idq")
    1954                      .dwattr $C$DW$211, DW_AT_data_member_location[DW_OP_plus_uconst 0x3e]
    1955                      .dwattr $C$DW$211, DW_AT_accessibility(DW_ACCESS_public)
    1956              
    1957              $C$DW$212       .dwtag  DW_TAG_member
    1958                      .dwattr $C$DW$212, DW_AT_type(*$C$DW$T$23)
    1959                      .dwattr $C$DW$212, DW_AT_name("Ki_Idq")
    1960                      .dwattr $C$DW$212, DW_AT_TI_symbol_name("_Ki_Idq")
    1961                      .dwattr $C$DW$212, DW_AT_data_member_location[DW_OP_plus_uconst 0x40]
    1962                      .dwattr $C$DW$212, DW_AT_accessibility(DW_ACCESS_public)
    1963              
    1964              $C$DW$213       .dwtag  DW_TAG_member
    1965                      .dwattr $C$DW$213, DW_AT_type(*$C$DW$T$23)
    1966                      .dwattr $C$DW$213, DW_AT_name("Kp_spd")
    1967                      .dwattr $C$DW$213, DW_AT_TI_symbol_name("_Kp_spd")
    1968                      .dwattr $C$DW$213, DW_AT_data_member_location[DW_OP_plus_uconst 0x42]
    1969                      .dwattr $C$DW$213, DW_AT_accessibility(DW_ACCESS_public)
    1970              
    1971              $C$DW$214       .dwtag  DW_TAG_member
    1972                      .dwattr $C$DW$214, DW_AT_type(*$C$DW$T$23)
    1973                      .dwattr $C$DW$214, DW_AT_name("Ki_spd")
    1974                      .dwattr $C$DW$214, DW_AT_TI_symbol_name("_Ki_spd")
    1975                      .dwattr $C$DW$214, DW_AT_data_member_location[DW_OP_plus_uconst 0x44]
    1976                      .dwattr $C$DW$214, DW_AT_accessibility(DW_ACCESS_public)
    1977              
    1978              $C$DW$215       .dwtag  DW_TAG_member
    1979                      .dwattr $C$DW$215, DW_AT_type(*$C$DW$T$23)
    1980                      .dwattr $C$DW$215, DW_AT_name("Vd")
    1981                      .dwattr $C$DW$215, DW_AT_TI_symbol_name("_Vd")
    1982                      .dwattr $C$DW$215, DW_AT_data_member_location[DW_OP_plus_uconst 0x46]
    1983                      .dwattr $C$DW$215, DW_AT_accessibility(DW_ACCESS_public)
    1984              
    1985              $C$DW$216       .dwtag  DW_TAG_member
    1986                      .dwattr $C$DW$216, DW_AT_type(*$C$DW$T$23)
    1987                      .dwattr $C$DW$216, DW_AT_name("Vq")
    1988                      .dwattr $C$DW$216, DW_AT_TI_symbol_name("_Vq")
    1989                      .dwattr $C$DW$216, DW_AT_data_member_location[DW_OP_plus_uconst 0x48]
    1990                      .dwattr $C$DW$216, DW_AT_accessibility(DW_ACCESS_public)
    1991              
    1992              $C$DW$217       .dwtag  DW_TAG_member
TMS320C2000 Assembler PC v15.12.3 Wed Nov 22 00:56:24 2017

Tools Copyright (c) 1996-2015 Texas Instruments Incorporated
C:\Users\wmj\AppData\Local\Temp\0920410                              PAGE   38

    1993                      .dwattr $C$DW$217, DW_AT_type(*$C$DW$T$23)
    1994                      .dwattr $C$DW$217, DW_AT_name("Vs")
    1995                      .dwattr $C$DW$217, DW_AT_TI_symbol_name("_Vs")
    1996                      .dwattr $C$DW$217, DW_AT_data_member_location[DW_OP_plus_uconst 0x4a]
    1997                      .dwattr $C$DW$217, DW_AT_accessibility(DW_ACCESS_public)
    1998              
    1999              $C$DW$218       .dwtag  DW_TAG_member
    2000                      .dwattr $C$DW$218, DW_AT_type(*$C$DW$T$23)
    2001                      .dwattr $C$DW$218, DW_AT_name("Id_A")
    2002                      .dwattr $C$DW$218, DW_AT_TI_symbol_name("_Id_A")
    2003                      .dwattr $C$DW$218, DW_AT_data_member_location[DW_OP_plus_uconst 0x4c]
    2004                      .dwattr $C$DW$218, DW_AT_accessibility(DW_ACCESS_public)
    2005              
    2006              $C$DW$219       .dwtag  DW_TAG_member
    2007                      .dwattr $C$DW$219, DW_AT_type(*$C$DW$T$23)
    2008                      .dwattr $C$DW$219, DW_AT_name("Iq_A")
    2009                      .dwattr $C$DW$219, DW_AT_TI_symbol_name("_Iq_A")
    2010                      .dwattr $C$DW$219, DW_AT_data_member_location[DW_OP_plus_uconst 0x4e]
    2011                      .dwattr $C$DW$219, DW_AT_accessibility(DW_ACCESS_public)
    2012              
    2013              $C$DW$220       .dwtag  DW_TAG_member
    2014                      .dwattr $C$DW$220, DW_AT_type(*$C$DW$T$23)
    2015                      .dwattr $C$DW$220, DW_AT_name("Is_A")
    2016                      .dwattr $C$DW$220, DW_AT_TI_symbol_name("_Is_A")
    2017                      .dwattr $C$DW$220, DW_AT_data_member_location[DW_OP_plus_uconst 0x50]
    2018                      .dwattr $C$DW$220, DW_AT_accessibility(DW_ACCESS_public)
    2019              
    2020              $C$DW$221       .dwtag  DW_TAG_member
    2021                      .dwattr $C$DW$221, DW_AT_type(*$C$DW$T$23)
    2022                      .dwattr $C$DW$221, DW_AT_name("IdRef_A")
    2023                      .dwattr $C$DW$221, DW_AT_TI_symbol_name("_IdRef_A")
    2024                      .dwattr $C$DW$221, DW_AT_data_member_location[DW_OP_plus_uconst 0x52]
    2025                      .dwattr $C$DW$221, DW_AT_accessibility(DW_ACCESS_public)
    2026              
    2027              $C$DW$222       .dwtag  DW_TAG_member
    2028                      .dwattr $C$DW$222, DW_AT_type(*$C$DW$T$23)
    2029                      .dwattr $C$DW$222, DW_AT_name("IqRef_A")
    2030                      .dwattr $C$DW$222, DW_AT_TI_symbol_name("_IqRef_A")
    2031                      .dwattr $C$DW$222, DW_AT_data_member_location[DW_OP_plus_uconst 0x54]
    2032                      .dwattr $C$DW$222, DW_AT_accessibility(DW_ACCESS_public)
    2033              
    2034              $C$DW$223       .dwtag  DW_TAG_member
    2035                      .dwattr $C$DW$223, DW_AT_type(*$C$DW$T$23)
    2036                      .dwattr $C$DW$223, DW_AT_name("Ibrake_Ratio")
    2037                      .dwattr $C$DW$223, DW_AT_TI_symbol_name("_Ibrake_Ratio")
    2038                      .dwattr $C$DW$223, DW_AT_data_member_location[DW_OP_plus_uconst 0x56]
    2039                      .dwattr $C$DW$223, DW_AT_accessibility(DW_ACCESS_public)
    2040              
    2041              $C$DW$224       .dwtag  DW_TAG_member
    2042                      .dwattr $C$DW$224, DW_AT_type(*$C$DW$T$36)
    2043                      .dwattr $C$DW$224, DW_AT_name("I_bias")
    2044                      .dwattr $C$DW$224, DW_AT_TI_symbol_name("_I_bias")
    2045                      .dwattr $C$DW$224, DW_AT_data_member_location[DW_OP_plus_uconst 0x58]
    2046                      .dwattr $C$DW$224, DW_AT_accessibility(DW_ACCESS_public)
    2047              
TMS320C2000 Assembler PC v15.12.3 Wed Nov 22 00:56:24 2017

Tools Copyright (c) 1996-2015 Texas Instruments Incorporated
C:\Users\wmj\AppData\Local\Temp\0920410                              PAGE   39

    2048              $C$DW$225       .dwtag  DW_TAG_member
    2049                      .dwattr $C$DW$225, DW_AT_type(*$C$DW$T$36)
    2050                      .dwattr $C$DW$225, DW_AT_name("V_bias")
    2051                      .dwattr $C$DW$225, DW_AT_TI_symbol_name("_V_bias")
    2052                      .dwattr $C$DW$225, DW_AT_data_member_location[DW_OP_plus_uconst 0x5e]
    2053                      .dwattr $C$DW$225, DW_AT_accessibility(DW_ACCESS_public)
    2054              
    2055              $C$DW$226       .dwtag  DW_TAG_member
    2056                      .dwattr $C$DW$226, DW_AT_type(*$C$DW$T$23)
    2057                      .dwattr $C$DW$226, DW_AT_name("Sensor0_Value")
    2058                      .dwattr $C$DW$226, DW_AT_TI_symbol_name("_Sensor0_Value")
    2059                      .dwattr $C$DW$226, DW_AT_data_member_location[DW_OP_plus_uconst 0x64]
    2060                      .dwattr $C$DW$226, DW_AT_accessibility(DW_ACCESS_public)
    2061              
    2062              $C$DW$227       .dwtag  DW_TAG_member
    2063                      .dwattr $C$DW$227, DW_AT_type(*$C$DW$T$23)
    2064                      .dwattr $C$DW$227, DW_AT_name("Sensor1_Value")
    2065                      .dwattr $C$DW$227, DW_AT_TI_symbol_name("_Sensor1_Value")
    2066                      .dwattr $C$DW$227, DW_AT_data_member_location[DW_OP_plus_uconst 0x66]
    2067                      .dwattr $C$DW$227, DW_AT_accessibility(DW_ACCESS_public)
    2068              
    2069              $C$DW$228       .dwtag  DW_TAG_member
    2070                      .dwattr $C$DW$228, DW_AT_type(*$C$DW$T$23)
    2071                      .dwattr $C$DW$228, DW_AT_name("ZeroPoint_Value")
    2072                      .dwattr $C$DW$228, DW_AT_TI_symbol_name("_ZeroPoint_Value")
    2073                      .dwattr $C$DW$228, DW_AT_data_member_location[DW_OP_plus_uconst 0x68]
    2074                      .dwattr $C$DW$228, DW_AT_accessibility(DW_ACCESS_public)
    2075              
    2076              $C$DW$229       .dwtag  DW_TAG_member
    2077                      .dwattr $C$DW$229, DW_AT_type(*$C$DW$T$34)
    2078                      .dwattr $C$DW$229, DW_AT_name("ChipTemp")
    2079                      .dwattr $C$DW$229, DW_AT_TI_symbol_name("_ChipTemp")
    2080                      .dwattr $C$DW$229, DW_AT_data_member_location[DW_OP_plus_uconst 0x6a]
    2081                      .dwattr $C$DW$229, DW_AT_accessibility(DW_ACCESS_public)
    2082              
    2083              $C$DW$230       .dwtag  DW_TAG_member
    2084                      .dwattr $C$DW$230, DW_AT_type(*$C$DW$T$23)
    2085                      .dwattr $C$DW$230, DW_AT_name("VdcBus_kV")
    2086                      .dwattr $C$DW$230, DW_AT_TI_symbol_name("_VdcBus_kV")
    2087                      .dwattr $C$DW$230, DW_AT_data_member_location[DW_OP_plus_uconst 0x6c]
    2088                      .dwattr $C$DW$230, DW_AT_accessibility(DW_ACCESS_public)
    2089              
    2090              $C$DW$231       .dwtag  DW_TAG_member
    2091                      .dwattr $C$DW$231, DW_AT_type(*$C$DW$T$19)
    2092                      .dwattr $C$DW$231, DW_AT_name("MotorID")
    2093                      .dwattr $C$DW$231, DW_AT_TI_symbol_name("_MotorID")
    2094                      .dwattr $C$DW$231, DW_AT_data_member_location[DW_OP_plus_uconst 0x6e]
    2095                      .dwattr $C$DW$231, DW_AT_accessibility(DW_ACCESS_public)
    2096              
    2097                      .dwendtag $C$DW$T$37
    2098              
    2099              $C$DW$T$49      .dwtag  DW_TAG_typedef
    2100                      .dwattr $C$DW$T$49, DW_AT_name("MOTOR_Obj")
    2101                      .dwattr $C$DW$T$49, DW_AT_type(*$C$DW$T$37)
    2102                      .dwattr $C$DW$T$49, DW_AT_language(DW_LANG_C)
TMS320C2000 Assembler PC v15.12.3 Wed Nov 22 00:56:24 2017

Tools Copyright (c) 1996-2015 Texas Instruments Incorporated
C:\Users\wmj\AppData\Local\Temp\0920410                              PAGE   40

    2103              
    2104              $C$DW$T$50      .dwtag  DW_TAG_pointer_type
    2105                      .dwattr $C$DW$T$50, DW_AT_type(*$C$DW$T$37)
    2106                      .dwattr $C$DW$T$50, DW_AT_address_class(0x20)
    2107              
    2108              $C$DW$T$51      .dwtag  DW_TAG_typedef
    2109                      .dwattr $C$DW$T$51, DW_AT_name("MOTOR_Handle")
    2110                      .dwattr $C$DW$T$51, DW_AT_type(*$C$DW$T$50)
    2111                      .dwattr $C$DW$T$51, DW_AT_language(DW_LANG_C)
    2112              
    2113              $C$DW$232       .dwtag  DW_TAG_TI_far_type
    2114                      .dwattr $C$DW$232, DW_AT_type(*$C$DW$T$51)
    2115              
    2116              $C$DW$T$52      .dwtag  DW_TAG_const_type
    2117                      .dwattr $C$DW$T$52, DW_AT_type(*$C$DW$232)
    2118              
    2119              
    2120              $C$DW$T$48      .dwtag  DW_TAG_structure_type
    2121                      .dwattr $C$DW$T$48, DW_AT_name("_USER_Params_")
    2122                      .dwattr $C$DW$T$48, DW_AT_byte_size(0xac)
    2123              $C$DW$233       .dwtag  DW_TAG_member
    2124                      .dwattr $C$DW$233, DW_AT_type(*$C$DW$T$35)
    2125                      .dwattr $C$DW$233, DW_AT_name("iqFullScaleCurrent_A")
    2126                      .dwattr $C$DW$233, DW_AT_TI_symbol_name("_iqFullScaleCurrent_A")
    2127                      .dwattr $C$DW$233, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    2128                      .dwattr $C$DW$233, DW_AT_accessibility(DW_ACCESS_public)
    2129              
    2130              $C$DW$234       .dwtag  DW_TAG_member
    2131                      .dwattr $C$DW$234, DW_AT_type(*$C$DW$T$35)
    2132                      .dwattr $C$DW$234, DW_AT_name("iqFullScaleVoltage_V")
    2133                      .dwattr $C$DW$234, DW_AT_TI_symbol_name("_iqFullScaleVoltage_V")
    2134                      .dwattr $C$DW$234, DW_AT_data_member_location[DW_OP_plus_uconst 0x2]
    2135                      .dwattr $C$DW$234, DW_AT_accessibility(DW_ACCESS_public)
    2136              
    2137              $C$DW$235       .dwtag  DW_TAG_member
    2138                      .dwattr $C$DW$235, DW_AT_type(*$C$DW$T$35)
    2139                      .dwattr $C$DW$235, DW_AT_name("iqFullScaleFreq_Hz")
    2140                      .dwattr $C$DW$235, DW_AT_TI_symbol_name("_iqFullScaleFreq_Hz")
    2141                      .dwattr $C$DW$235, DW_AT_data_member_location[DW_OP_plus_uconst 0x4]
    2142                      .dwattr $C$DW$235, DW_AT_accessibility(DW_ACCESS_public)
    2143              
    2144              $C$DW$236       .dwtag  DW_TAG_member
    2145                      .dwattr $C$DW$236, DW_AT_type(*$C$DW$T$38)
    2146                      .dwattr $C$DW$236, DW_AT_name("numIsrTicksPerCtrlTick")
    2147                      .dwattr $C$DW$236, DW_AT_TI_symbol_name("_numIsrTicksPerCtrlTick")
    2148                      .dwattr $C$DW$236, DW_AT_data_member_location[DW_OP_plus_uconst 0x6]
    2149                      .dwattr $C$DW$236, DW_AT_accessibility(DW_ACCESS_public)
    2150              
    2151              $C$DW$237       .dwtag  DW_TAG_member
    2152                      .dwattr $C$DW$237, DW_AT_type(*$C$DW$T$38)
    2153                      .dwattr $C$DW$237, DW_AT_name("numCtrlTicksPerCurrentTick")
    2154                      .dwattr $C$DW$237, DW_AT_TI_symbol_name("_numCtrlTicksPerCurrentTick")
    2155                      .dwattr $C$DW$237, DW_AT_data_member_location[DW_OP_plus_uconst 0x7]
    2156                      .dwattr $C$DW$237, DW_AT_accessibility(DW_ACCESS_public)
    2157              
TMS320C2000 Assembler PC v15.12.3 Wed Nov 22 00:56:24 2017

Tools Copyright (c) 1996-2015 Texas Instruments Incorporated
C:\Users\wmj\AppData\Local\Temp\0920410                              PAGE   41

    2158              $C$DW$238       .dwtag  DW_TAG_member
    2159                      .dwattr $C$DW$238, DW_AT_type(*$C$DW$T$38)
    2160                      .dwattr $C$DW$238, DW_AT_name("numCtrlTicksPerEstTick")
    2161                      .dwattr $C$DW$238, DW_AT_TI_symbol_name("_numCtrlTicksPerEstTick")
    2162                      .dwattr $C$DW$238, DW_AT_data_member_location[DW_OP_plus_uconst 0x8]
    2163                      .dwattr $C$DW$238, DW_AT_accessibility(DW_ACCESS_public)
    2164              
    2165              $C$DW$239       .dwtag  DW_TAG_member
    2166                      .dwattr $C$DW$239, DW_AT_type(*$C$DW$T$38)
    2167                      .dwattr $C$DW$239, DW_AT_name("numCtrlTicksPerSpeedTick")
    2168                      .dwattr $C$DW$239, DW_AT_TI_symbol_name("_numCtrlTicksPerSpeedTick")
    2169                      .dwattr $C$DW$239, DW_AT_data_member_location[DW_OP_plus_uconst 0x9]
    2170                      .dwattr $C$DW$239, DW_AT_accessibility(DW_ACCESS_public)
    2171              
    2172              $C$DW$240       .dwtag  DW_TAG_member
    2173                      .dwattr $C$DW$240, DW_AT_type(*$C$DW$T$38)
    2174                      .dwattr $C$DW$240, DW_AT_name("numCtrlTicksPerTrajTick")
    2175                      .dwattr $C$DW$240, DW_AT_TI_symbol_name("_numCtrlTicksPerTrajTick")
    2176                      .dwattr $C$DW$240, DW_AT_data_member_location[DW_OP_plus_uconst 0xa]
    2177                      .dwattr $C$DW$240, DW_AT_accessibility(DW_ACCESS_public)
    2178              
    2179              $C$DW$241       .dwtag  DW_TAG_member
    2180                      .dwattr $C$DW$241, DW_AT_type(*$C$DW$T$39)
    2181                      .dwattr $C$DW$241, DW_AT_name("numCurrentSensors")
    2182                      .dwattr $C$DW$241, DW_AT_TI_symbol_name("_numCurrentSensors")
    2183                      .dwattr $C$DW$241, DW_AT_data_member_location[DW_OP_plus_uconst 0xb]
    2184                      .dwattr $C$DW$241, DW_AT_accessibility(DW_ACCESS_public)
    2185              
    2186              $C$DW$242       .dwtag  DW_TAG_member
    2187                      .dwattr $C$DW$242, DW_AT_type(*$C$DW$T$39)
    2188                      .dwattr $C$DW$242, DW_AT_name("numVoltageSensors")
    2189                      .dwattr $C$DW$242, DW_AT_TI_symbol_name("_numVoltageSensors")
    2190                      .dwattr $C$DW$242, DW_AT_data_member_location[DW_OP_plus_uconst 0xc]
    2191                      .dwattr $C$DW$242, DW_AT_accessibility(DW_ACCESS_public)
    2192              
    2193              $C$DW$243       .dwtag  DW_TAG_member
    2194                      .dwattr $C$DW$243, DW_AT_type(*$C$DW$T$35)
    2195                      .dwattr $C$DW$243, DW_AT_name("offsetPole_rps")
    2196                      .dwattr $C$DW$243, DW_AT_TI_symbol_name("_offsetPole_rps")
    2197                      .dwattr $C$DW$243, DW_AT_data_member_location[DW_OP_plus_uconst 0xe]
    2198                      .dwattr $C$DW$243, DW_AT_accessibility(DW_ACCESS_public)
    2199              
    2200              $C$DW$244       .dwtag  DW_TAG_member
    2201                      .dwattr $C$DW$244, DW_AT_type(*$C$DW$T$35)
    2202                      .dwattr $C$DW$244, DW_AT_name("fluxPole_rps")
    2203                      .dwattr $C$DW$244, DW_AT_TI_symbol_name("_fluxPole_rps")
    2204                      .dwattr $C$DW$244, DW_AT_data_member_location[DW_OP_plus_uconst 0x10]
    2205                      .dwattr $C$DW$244, DW_AT_accessibility(DW_ACCESS_public)
    2206              
    2207              $C$DW$245       .dwtag  DW_TAG_member
    2208                      .dwattr $C$DW$245, DW_AT_type(*$C$DW$T$35)
    2209                      .dwattr $C$DW$245, DW_AT_name("zeroSpeedLimit")
    2210                      .dwattr $C$DW$245, DW_AT_TI_symbol_name("_zeroSpeedLimit")
    2211                      .dwattr $C$DW$245, DW_AT_data_member_location[DW_OP_plus_uconst 0x12]
    2212                      .dwattr $C$DW$245, DW_AT_accessibility(DW_ACCESS_public)
TMS320C2000 Assembler PC v15.12.3 Wed Nov 22 00:56:24 2017

Tools Copyright (c) 1996-2015 Texas Instruments Incorporated
C:\Users\wmj\AppData\Local\Temp\0920410                              PAGE   42

    2213              
    2214              $C$DW$246       .dwtag  DW_TAG_member
    2215                      .dwattr $C$DW$246, DW_AT_type(*$C$DW$T$35)
    2216                      .dwattr $C$DW$246, DW_AT_name("forceAngleFreq_Hz")
    2217                      .dwattr $C$DW$246, DW_AT_TI_symbol_name("_forceAngleFreq_Hz")
    2218                      .dwattr $C$DW$246, DW_AT_data_member_location[DW_OP_plus_uconst 0x14]
    2219                      .dwattr $C$DW$246, DW_AT_accessibility(DW_ACCESS_public)
    2220              
    2221              $C$DW$247       .dwtag  DW_TAG_member
    2222                      .dwattr $C$DW$247, DW_AT_type(*$C$DW$T$35)
    2223                      .dwattr $C$DW$247, DW_AT_name("maxAccel_Hzps")
    2224                      .dwattr $C$DW$247, DW_AT_TI_symbol_name("_maxAccel_Hzps")
    2225                      .dwattr $C$DW$247, DW_AT_data_member_location[DW_OP_plus_uconst 0x16]
    2226                      .dwattr $C$DW$247, DW_AT_accessibility(DW_ACCESS_public)
    2227              
    2228              $C$DW$248       .dwtag  DW_TAG_member
    2229                      .dwattr $C$DW$248, DW_AT_type(*$C$DW$T$35)
    2230                      .dwattr $C$DW$248, DW_AT_name("maxAccel_est_Hzps")
    2231                      .dwattr $C$DW$248, DW_AT_TI_symbol_name("_maxAccel_est_Hzps")
    2232                      .dwattr $C$DW$248, DW_AT_data_member_location[DW_OP_plus_uconst 0x18]
    2233                      .dwattr $C$DW$248, DW_AT_accessibility(DW_ACCESS_public)
    2234              
    2235              $C$DW$249       .dwtag  DW_TAG_member
    2236                      .dwattr $C$DW$249, DW_AT_type(*$C$DW$T$35)
    2237                      .dwattr $C$DW$249, DW_AT_name("directionPole_rps")
    2238                      .dwattr $C$DW$249, DW_AT_TI_symbol_name("_directionPole_rps")
    2239                      .dwattr $C$DW$249, DW_AT_data_member_location[DW_OP_plus_uconst 0x1a]
    2240                      .dwattr $C$DW$249, DW_AT_accessibility(DW_ACCESS_public)
    2241              
    2242              $C$DW$250       .dwtag  DW_TAG_member
    2243                      .dwattr $C$DW$250, DW_AT_type(*$C$DW$T$35)
    2244                      .dwattr $C$DW$250, DW_AT_name("speedPole_rps")
    2245                      .dwattr $C$DW$250, DW_AT_TI_symbol_name("_speedPole_rps")
    2246                      .dwattr $C$DW$250, DW_AT_data_member_location[DW_OP_plus_uconst 0x1c]
    2247                      .dwattr $C$DW$250, DW_AT_accessibility(DW_ACCESS_public)
    2248              
    2249              $C$DW$251       .dwtag  DW_TAG_member
    2250                      .dwattr $C$DW$251, DW_AT_type(*$C$DW$T$35)
    2251                      .dwattr $C$DW$251, DW_AT_name("dcBusPole_rps")
    2252                      .dwattr $C$DW$251, DW_AT_TI_symbol_name("_dcBusPole_rps")
    2253                      .dwattr $C$DW$251, DW_AT_data_member_location[DW_OP_plus_uconst 0x1e]
    2254                      .dwattr $C$DW$251, DW_AT_accessibility(DW_ACCESS_public)
    2255              
    2256              $C$DW$252       .dwtag  DW_TAG_member
    2257                      .dwattr $C$DW$252, DW_AT_type(*$C$DW$T$35)
    2258                      .dwattr $C$DW$252, DW_AT_name("fluxFraction")
    2259                      .dwattr $C$DW$252, DW_AT_TI_symbol_name("_fluxFraction")
    2260                      .dwattr $C$DW$252, DW_AT_data_member_location[DW_OP_plus_uconst 0x20]
    2261                      .dwattr $C$DW$252, DW_AT_accessibility(DW_ACCESS_public)
    2262              
    2263              $C$DW$253       .dwtag  DW_TAG_member
    2264                      .dwattr $C$DW$253, DW_AT_type(*$C$DW$T$35)
    2265                      .dwattr $C$DW$253, DW_AT_name("indEst_speedMaxFraction")
    2266                      .dwattr $C$DW$253, DW_AT_TI_symbol_name("_indEst_speedMaxFraction")
    2267                      .dwattr $C$DW$253, DW_AT_data_member_location[DW_OP_plus_uconst 0x22]
TMS320C2000 Assembler PC v15.12.3 Wed Nov 22 00:56:24 2017

Tools Copyright (c) 1996-2015 Texas Instruments Incorporated
C:\Users\wmj\AppData\Local\Temp\0920410                              PAGE   43

    2268                      .dwattr $C$DW$253, DW_AT_accessibility(DW_ACCESS_public)
    2269              
    2270              $C$DW$254       .dwtag  DW_TAG_member
    2271                      .dwattr $C$DW$254, DW_AT_type(*$C$DW$T$35)
    2272                      .dwattr $C$DW$254, DW_AT_name("powerWarpGain")
    2273                      .dwattr $C$DW$254, DW_AT_TI_symbol_name("_powerWarpGain")
    2274                      .dwattr $C$DW$254, DW_AT_data_member_location[DW_OP_plus_uconst 0x24]
    2275                      .dwattr $C$DW$254, DW_AT_accessibility(DW_ACCESS_public)
    2276              
    2277              $C$DW$255       .dwtag  DW_TAG_member
    2278                      .dwattr $C$DW$255, DW_AT_type(*$C$DW$T$38)
    2279                      .dwattr $C$DW$255, DW_AT_name("systemFreq_MHz")
    2280                      .dwattr $C$DW$255, DW_AT_TI_symbol_name("_systemFreq_MHz")
    2281                      .dwattr $C$DW$255, DW_AT_data_member_location[DW_OP_plus_uconst 0x26]
    2282                      .dwattr $C$DW$255, DW_AT_accessibility(DW_ACCESS_public)
    2283              
    2284              $C$DW$256       .dwtag  DW_TAG_member
    2285                      .dwattr $C$DW$256, DW_AT_type(*$C$DW$T$35)
    2286                      .dwattr $C$DW$256, DW_AT_name("pwmPeriod_usec")
    2287                      .dwattr $C$DW$256, DW_AT_TI_symbol_name("_pwmPeriod_usec")
    2288                      .dwattr $C$DW$256, DW_AT_data_member_location[DW_OP_plus_uconst 0x28]
    2289                      .dwattr $C$DW$256, DW_AT_accessibility(DW_ACCESS_public)
    2290              
    2291              $C$DW$257       .dwtag  DW_TAG_member
    2292                      .dwattr $C$DW$257, DW_AT_type(*$C$DW$T$35)
    2293                      .dwattr $C$DW$257, DW_AT_name("voltage_sf")
    2294                      .dwattr $C$DW$257, DW_AT_TI_symbol_name("_voltage_sf")
    2295                      .dwattr $C$DW$257, DW_AT_data_member_location[DW_OP_plus_uconst 0x2a]
    2296                      .dwattr $C$DW$257, DW_AT_accessibility(DW_ACCESS_public)
    2297              
    2298              $C$DW$258       .dwtag  DW_TAG_member
    2299                      .dwattr $C$DW$258, DW_AT_type(*$C$DW$T$35)
    2300                      .dwattr $C$DW$258, DW_AT_name("current_sf")
    2301                      .dwattr $C$DW$258, DW_AT_TI_symbol_name("_current_sf")
    2302                      .dwattr $C$DW$258, DW_AT_data_member_location[DW_OP_plus_uconst 0x2c]
    2303                      .dwattr $C$DW$258, DW_AT_accessibility(DW_ACCESS_public)
    2304              
    2305              $C$DW$259       .dwtag  DW_TAG_member
    2306                      .dwattr $C$DW$259, DW_AT_type(*$C$DW$T$35)
    2307                      .dwattr $C$DW$259, DW_AT_name("voltageFilterPole_rps")
    2308                      .dwattr $C$DW$259, DW_AT_TI_symbol_name("_voltageFilterPole_rps")
    2309                      .dwattr $C$DW$259, DW_AT_data_member_location[DW_OP_plus_uconst 0x2e]
    2310                      .dwattr $C$DW$259, DW_AT_accessibility(DW_ACCESS_public)
    2311              
    2312              $C$DW$260       .dwtag  DW_TAG_member
    2313                      .dwattr $C$DW$260, DW_AT_type(*$C$DW$T$35)
    2314                      .dwattr $C$DW$260, DW_AT_name("maxVsMag_pu")
    2315                      .dwattr $C$DW$260, DW_AT_TI_symbol_name("_maxVsMag_pu")
    2316                      .dwattr $C$DW$260, DW_AT_data_member_location[DW_OP_plus_uconst 0x30]
    2317                      .dwattr $C$DW$260, DW_AT_accessibility(DW_ACCESS_public)
    2318              
    2319              $C$DW$261       .dwtag  DW_TAG_member
    2320                      .dwattr $C$DW$261, DW_AT_type(*$C$DW$T$35)
    2321                      .dwattr $C$DW$261, DW_AT_name("estKappa")
    2322                      .dwattr $C$DW$261, DW_AT_TI_symbol_name("_estKappa")
TMS320C2000 Assembler PC v15.12.3 Wed Nov 22 00:56:24 2017

Tools Copyright (c) 1996-2015 Texas Instruments Incorporated
C:\Users\wmj\AppData\Local\Temp\0920410                              PAGE   44

    2323                      .dwattr $C$DW$261, DW_AT_data_member_location[DW_OP_plus_uconst 0x32]
    2324                      .dwattr $C$DW$261, DW_AT_accessibility(DW_ACCESS_public)
    2325              
    2326              $C$DW$262       .dwtag  DW_TAG_member
    2327                      .dwattr $C$DW$262, DW_AT_type(*$C$DW$T$41)
    2328                      .dwattr $C$DW$262, DW_AT_name("motor_type")
    2329                      .dwattr $C$DW$262, DW_AT_TI_symbol_name("_motor_type")
    2330                      .dwattr $C$DW$262, DW_AT_data_member_location[DW_OP_plus_uconst 0x34]
    2331                      .dwattr $C$DW$262, DW_AT_accessibility(DW_ACCESS_public)
    2332              
    2333              $C$DW$263       .dwtag  DW_TAG_member
    2334                      .dwattr $C$DW$263, DW_AT_type(*$C$DW$T$38)
    2335                      .dwattr $C$DW$263, DW_AT_name("motor_numPolePairs")
    2336                      .dwattr $C$DW$263, DW_AT_TI_symbol_name("_motor_numPolePairs")
    2337                      .dwattr $C$DW$263, DW_AT_data_member_location[DW_OP_plus_uconst 0x35]
    2338                      .dwattr $C$DW$263, DW_AT_accessibility(DW_ACCESS_public)
    2339              
    2340              $C$DW$264       .dwtag  DW_TAG_member
    2341                      .dwattr $C$DW$264, DW_AT_type(*$C$DW$T$35)
    2342                      .dwattr $C$DW$264, DW_AT_name("motor_ratedFlux")
    2343                      .dwattr $C$DW$264, DW_AT_TI_symbol_name("_motor_ratedFlux")
    2344                      .dwattr $C$DW$264, DW_AT_data_member_location[DW_OP_plus_uconst 0x36]
    2345                      .dwattr $C$DW$264, DW_AT_accessibility(DW_ACCESS_public)
    2346              
    2347              $C$DW$265       .dwtag  DW_TAG_member
    2348                      .dwattr $C$DW$265, DW_AT_type(*$C$DW$T$35)
    2349                      .dwattr $C$DW$265, DW_AT_name("motor_Rr")
    2350                      .dwattr $C$DW$265, DW_AT_TI_symbol_name("_motor_Rr")
    2351                      .dwattr $C$DW$265, DW_AT_data_member_location[DW_OP_plus_uconst 0x38]
    2352                      .dwattr $C$DW$265, DW_AT_accessibility(DW_ACCESS_public)
    2353              
    2354              $C$DW$266       .dwtag  DW_TAG_member
    2355                      .dwattr $C$DW$266, DW_AT_type(*$C$DW$T$35)
    2356                      .dwattr $C$DW$266, DW_AT_name("motor_Rs")
    2357                      .dwattr $C$DW$266, DW_AT_TI_symbol_name("_motor_Rs")
    2358                      .dwattr $C$DW$266, DW_AT_data_member_location[DW_OP_plus_uconst 0x3a]
    2359                      .dwattr $C$DW$266, DW_AT_accessibility(DW_ACCESS_public)
    2360              
    2361              $C$DW$267       .dwtag  DW_TAG_member
    2362                      .dwattr $C$DW$267, DW_AT_type(*$C$DW$T$35)
    2363                      .dwattr $C$DW$267, DW_AT_name("motor_Ls_d")
    2364                      .dwattr $C$DW$267, DW_AT_TI_symbol_name("_motor_Ls_d")
    2365                      .dwattr $C$DW$267, DW_AT_data_member_location[DW_OP_plus_uconst 0x3c]
    2366                      .dwattr $C$DW$267, DW_AT_accessibility(DW_ACCESS_public)
    2367              
    2368              $C$DW$268       .dwtag  DW_TAG_member
    2369                      .dwattr $C$DW$268, DW_AT_type(*$C$DW$T$35)
    2370                      .dwattr $C$DW$268, DW_AT_name("motor_Ls_q")
    2371                      .dwattr $C$DW$268, DW_AT_TI_symbol_name("_motor_Ls_q")
    2372                      .dwattr $C$DW$268, DW_AT_data_member_location[DW_OP_plus_uconst 0x3e]
    2373                      .dwattr $C$DW$268, DW_AT_accessibility(DW_ACCESS_public)
    2374              
    2375              $C$DW$269       .dwtag  DW_TAG_member
    2376                      .dwattr $C$DW$269, DW_AT_type(*$C$DW$T$35)
    2377                      .dwattr $C$DW$269, DW_AT_name("maxCurrent")
TMS320C2000 Assembler PC v15.12.3 Wed Nov 22 00:56:24 2017

Tools Copyright (c) 1996-2015 Texas Instruments Incorporated
C:\Users\wmj\AppData\Local\Temp\0920410                              PAGE   45

    2378                      .dwattr $C$DW$269, DW_AT_TI_symbol_name("_maxCurrent")
    2379                      .dwattr $C$DW$269, DW_AT_data_member_location[DW_OP_plus_uconst 0x40]
    2380                      .dwattr $C$DW$269, DW_AT_accessibility(DW_ACCESS_public)
    2381              
    2382              $C$DW$270       .dwtag  DW_TAG_member
    2383                      .dwattr $C$DW$270, DW_AT_type(*$C$DW$T$35)
    2384                      .dwattr $C$DW$270, DW_AT_name("maxCurrent_resEst")
    2385                      .dwattr $C$DW$270, DW_AT_TI_symbol_name("_maxCurrent_resEst")
    2386                      .dwattr $C$DW$270, DW_AT_data_member_location[DW_OP_plus_uconst 0x42]
    2387                      .dwattr $C$DW$270, DW_AT_accessibility(DW_ACCESS_public)
    2388              
    2389              $C$DW$271       .dwtag  DW_TAG_member
    2390                      .dwattr $C$DW$271, DW_AT_type(*$C$DW$T$35)
    2391                      .dwattr $C$DW$271, DW_AT_name("maxCurrent_indEst")
    2392                      .dwattr $C$DW$271, DW_AT_TI_symbol_name("_maxCurrent_indEst")
    2393                      .dwattr $C$DW$271, DW_AT_data_member_location[DW_OP_plus_uconst 0x44]
    2394                      .dwattr $C$DW$271, DW_AT_accessibility(DW_ACCESS_public)
    2395              
    2396              $C$DW$272       .dwtag  DW_TAG_member
    2397                      .dwattr $C$DW$272, DW_AT_type(*$C$DW$T$35)
    2398                      .dwattr $C$DW$272, DW_AT_name("maxCurrentSlope")
    2399                      .dwattr $C$DW$272, DW_AT_TI_symbol_name("_maxCurrentSlope")
    2400                      .dwattr $C$DW$272, DW_AT_data_member_location[DW_OP_plus_uconst 0x46]
    2401                      .dwattr $C$DW$272, DW_AT_accessibility(DW_ACCESS_public)
    2402              
    2403              $C$DW$273       .dwtag  DW_TAG_member
    2404                      .dwattr $C$DW$273, DW_AT_type(*$C$DW$T$35)
    2405                      .dwattr $C$DW$273, DW_AT_name("maxCurrentSlope_powerWarp")
    2406                      .dwattr $C$DW$273, DW_AT_TI_symbol_name("_maxCurrentSlope_powerWarp")
    2407                      .dwattr $C$DW$273, DW_AT_data_member_location[DW_OP_plus_uconst 0x48]
    2408                      .dwattr $C$DW$273, DW_AT_accessibility(DW_ACCESS_public)
    2409              
    2410              $C$DW$274       .dwtag  DW_TAG_member
    2411                      .dwattr $C$DW$274, DW_AT_type(*$C$DW$T$35)
    2412                      .dwattr $C$DW$274, DW_AT_name("IdRated")
    2413                      .dwattr $C$DW$274, DW_AT_TI_symbol_name("_IdRated")
    2414                      .dwattr $C$DW$274, DW_AT_data_member_location[DW_OP_plus_uconst 0x4a]
    2415                      .dwattr $C$DW$274, DW_AT_accessibility(DW_ACCESS_public)
    2416              
    2417              $C$DW$275       .dwtag  DW_TAG_member
    2418                      .dwattr $C$DW$275, DW_AT_type(*$C$DW$T$35)
    2419                      .dwattr $C$DW$275, DW_AT_name("IdRatedFraction_indEst")
    2420                      .dwattr $C$DW$275, DW_AT_TI_symbol_name("_IdRatedFraction_indEst")
    2421                      .dwattr $C$DW$275, DW_AT_data_member_location[DW_OP_plus_uconst 0x4c]
    2422                      .dwattr $C$DW$275, DW_AT_accessibility(DW_ACCESS_public)
    2423              
    2424              $C$DW$276       .dwtag  DW_TAG_member
    2425                      .dwattr $C$DW$276, DW_AT_type(*$C$DW$T$35)
    2426                      .dwattr $C$DW$276, DW_AT_name("IdRatedFraction_ratedFlux")
    2427                      .dwattr $C$DW$276, DW_AT_TI_symbol_name("_IdRatedFraction_ratedFlux")
    2428                      .dwattr $C$DW$276, DW_AT_data_member_location[DW_OP_plus_uconst 0x4e]
    2429                      .dwattr $C$DW$276, DW_AT_accessibility(DW_ACCESS_public)
    2430              
    2431              $C$DW$277       .dwtag  DW_TAG_member
    2432                      .dwattr $C$DW$277, DW_AT_type(*$C$DW$T$35)
TMS320C2000 Assembler PC v15.12.3 Wed Nov 22 00:56:24 2017

Tools Copyright (c) 1996-2015 Texas Instruments Incorporated
C:\Users\wmj\AppData\Local\Temp\0920410                              PAGE   46

    2433                      .dwattr $C$DW$277, DW_AT_name("IdRated_delta")
    2434                      .dwattr $C$DW$277, DW_AT_TI_symbol_name("_IdRated_delta")
    2435                      .dwattr $C$DW$277, DW_AT_data_member_location[DW_OP_plus_uconst 0x50]
    2436                      .dwattr $C$DW$277, DW_AT_accessibility(DW_ACCESS_public)
    2437              
    2438              $C$DW$278       .dwtag  DW_TAG_member
    2439                      .dwattr $C$DW$278, DW_AT_type(*$C$DW$T$35)
    2440                      .dwattr $C$DW$278, DW_AT_name("fluxEstFreq_Hz")
    2441                      .dwattr $C$DW$278, DW_AT_TI_symbol_name("_fluxEstFreq_Hz")
    2442                      .dwattr $C$DW$278, DW_AT_data_member_location[DW_OP_plus_uconst 0x52]
    2443                      .dwattr $C$DW$278, DW_AT_accessibility(DW_ACCESS_public)
    2444              
    2445              $C$DW$279       .dwtag  DW_TAG_member
    2446                      .dwattr $C$DW$279, DW_AT_type(*$C$DW$T$44)
    2447                      .dwattr $C$DW$279, DW_AT_name("ctrlWaitTime")
    2448                      .dwattr $C$DW$279, DW_AT_TI_symbol_name("_ctrlWaitTime")
    2449                      .dwattr $C$DW$279, DW_AT_data_member_location[DW_OP_plus_uconst 0x54]
    2450                      .dwattr $C$DW$279, DW_AT_accessibility(DW_ACCESS_public)
    2451              
    2452              $C$DW$280       .dwtag  DW_TAG_member
    2453                      .dwattr $C$DW$280, DW_AT_type(*$C$DW$T$45)
    2454                      .dwattr $C$DW$280, DW_AT_name("estWaitTime")
    2455                      .dwattr $C$DW$280, DW_AT_TI_symbol_name("_estWaitTime")
    2456                      .dwattr $C$DW$280, DW_AT_data_member_location[DW_OP_plus_uconst 0x5c]
    2457                      .dwattr $C$DW$280, DW_AT_accessibility(DW_ACCESS_public)
    2458              
    2459              $C$DW$281       .dwtag  DW_TAG_member
    2460                      .dwattr $C$DW$281, DW_AT_type(*$C$DW$T$46)
    2461                      .dwattr $C$DW$281, DW_AT_name("FluxWaitTime")
    2462                      .dwattr $C$DW$281, DW_AT_TI_symbol_name("_FluxWaitTime")
    2463                      .dwattr $C$DW$281, DW_AT_data_member_location[DW_OP_plus_uconst 0x78]
    2464                      .dwattr $C$DW$281, DW_AT_accessibility(DW_ACCESS_public)
    2465              
    2466              $C$DW$282       .dwtag  DW_TAG_member
    2467                      .dwattr $C$DW$282, DW_AT_type(*$C$DW$T$47)
    2468                      .dwattr $C$DW$282, DW_AT_name("LsWaitTime")
    2469                      .dwattr $C$DW$282, DW_AT_TI_symbol_name("_LsWaitTime")
    2470                      .dwattr $C$DW$282, DW_AT_data_member_location[DW_OP_plus_uconst 0x84]
    2471                      .dwattr $C$DW$282, DW_AT_accessibility(DW_ACCESS_public)
    2472              
    2473              $C$DW$283       .dwtag  DW_TAG_member
    2474                      .dwattr $C$DW$283, DW_AT_type(*$C$DW$T$46)
    2475                      .dwattr $C$DW$283, DW_AT_name("RsWaitTime")
    2476                      .dwattr $C$DW$283, DW_AT_TI_symbol_name("_RsWaitTime")
    2477                      .dwattr $C$DW$283, DW_AT_data_member_location[DW_OP_plus_uconst 0x92]
    2478                      .dwattr $C$DW$283, DW_AT_accessibility(DW_ACCESS_public)
    2479              
    2480              $C$DW$284       .dwtag  DW_TAG_member
    2481                      .dwattr $C$DW$284, DW_AT_type(*$C$DW$T$43)
    2482                      .dwattr $C$DW$284, DW_AT_name("ctrlFreq_Hz")
    2483                      .dwattr $C$DW$284, DW_AT_TI_symbol_name("_ctrlFreq_Hz")
    2484                      .dwattr $C$DW$284, DW_AT_data_member_location[DW_OP_plus_uconst 0x9e]
    2485                      .dwattr $C$DW$284, DW_AT_accessibility(DW_ACCESS_public)
    2486              
    2487              $C$DW$285       .dwtag  DW_TAG_member
TMS320C2000 Assembler PC v15.12.3 Wed Nov 22 00:56:24 2017

Tools Copyright (c) 1996-2015 Texas Instruments Incorporated
C:\Users\wmj\AppData\Local\Temp\0920410                              PAGE   47

    2488                      .dwattr $C$DW$285, DW_AT_type(*$C$DW$T$43)
    2489                      .dwattr $C$DW$285, DW_AT_name("estFreq_Hz")
    2490                      .dwattr $C$DW$285, DW_AT_TI_symbol_name("_estFreq_Hz")
    2491                      .dwattr $C$DW$285, DW_AT_data_member_location[DW_OP_plus_uconst 0xa0]
    2492                      .dwattr $C$DW$285, DW_AT_accessibility(DW_ACCESS_public)
    2493              
    2494              $C$DW$286       .dwtag  DW_TAG_member
    2495                      .dwattr $C$DW$286, DW_AT_type(*$C$DW$T$43)
    2496                      .dwattr $C$DW$286, DW_AT_name("RoverL_estFreq_Hz")
    2497                      .dwattr $C$DW$286, DW_AT_TI_symbol_name("_RoverL_estFreq_Hz")
    2498                      .dwattr $C$DW$286, DW_AT_data_member_location[DW_OP_plus_uconst 0xa2]
    2499                      .dwattr $C$DW$286, DW_AT_accessibility(DW_ACCESS_public)
    2500              
    2501              $C$DW$287       .dwtag  DW_TAG_member
    2502                      .dwattr $C$DW$287, DW_AT_type(*$C$DW$T$43)
    2503                      .dwattr $C$DW$287, DW_AT_name("trajFreq_Hz")
    2504                      .dwattr $C$DW$287, DW_AT_TI_symbol_name("_trajFreq_Hz")
    2505                      .dwattr $C$DW$287, DW_AT_data_member_location[DW_OP_plus_uconst 0xa4]
    2506                      .dwattr $C$DW$287, DW_AT_accessibility(DW_ACCESS_public)
    2507              
    2508              $C$DW$288       .dwtag  DW_TAG_member
    2509                      .dwattr $C$DW$288, DW_AT_type(*$C$DW$T$35)
    2510                      .dwattr $C$DW$288, DW_AT_name("ctrlPeriod_sec")
    2511                      .dwattr $C$DW$288, DW_AT_TI_symbol_name("_ctrlPeriod_sec")
    2512                      .dwattr $C$DW$288, DW_AT_data_member_location[DW_OP_plus_uconst 0xa6]
    2513                      .dwattr $C$DW$288, DW_AT_accessibility(DW_ACCESS_public)
    2514              
    2515              $C$DW$289       .dwtag  DW_TAG_member
    2516                      .dwattr $C$DW$289, DW_AT_type(*$C$DW$T$35)
    2517                      .dwattr $C$DW$289, DW_AT_name("maxNegativeIdCurrent_a")
    2518                      .dwattr $C$DW$289, DW_AT_TI_symbol_name("_maxNegativeIdCurrent_a")
    2519                      .dwattr $C$DW$289, DW_AT_data_member_location[DW_OP_plus_uconst 0xa8]
    2520                      .dwattr $C$DW$289, DW_AT_accessibility(DW_ACCESS_public)
    2521              
    2522              $C$DW$290       .dwtag  DW_TAG_member
    2523                      .dwattr $C$DW$290, DW_AT_type(*$C$DW$T$32)
    2524                      .dwattr $C$DW$290, DW_AT_name("errorCode")
    2525                      .dwattr $C$DW$290, DW_AT_TI_symbol_name("_errorCode")
    2526                      .dwattr $C$DW$290, DW_AT_data_member_location[DW_OP_plus_uconst 0xaa]
    2527                      .dwattr $C$DW$290, DW_AT_accessibility(DW_ACCESS_public)
    2528              
    2529              $C$DW$291       .dwtag  DW_TAG_member
    2530                      .dwattr $C$DW$291, DW_AT_type(*$C$DW$T$39)
    2531                      .dwattr $C$DW$291, DW_AT_name("motor_ID")
    2532                      .dwattr $C$DW$291, DW_AT_TI_symbol_name("_motor_ID")
    2533                      .dwattr $C$DW$291, DW_AT_data_member_location[DW_OP_plus_uconst 0xab]
    2534                      .dwattr $C$DW$291, DW_AT_accessibility(DW_ACCESS_public)
    2535              
    2536                      .dwendtag $C$DW$T$48
    2537              
    2538              $C$DW$T$58      .dwtag  DW_TAG_typedef
    2539                      .dwattr $C$DW$T$58, DW_AT_name("USER_Params")
    2540                      .dwattr $C$DW$T$58, DW_AT_type(*$C$DW$T$48)
    2541                      .dwattr $C$DW$T$58, DW_AT_language(DW_LANG_C)
    2542              
TMS320C2000 Assembler PC v15.12.3 Wed Nov 22 00:56:24 2017

Tools Copyright (c) 1996-2015 Texas Instruments Incorporated
C:\Users\wmj\AppData\Local\Temp\0920410                              PAGE   48

    2543              $C$DW$T$59      .dwtag  DW_TAG_pointer_type
    2544                      .dwattr $C$DW$T$59, DW_AT_type(*$C$DW$T$58)
    2545                      .dwattr $C$DW$T$59, DW_AT_address_class(0x20)
    2546              
    2547              $C$DW$292       .dwtag  DW_TAG_TI_far_type
    2548                      .dwattr $C$DW$292, DW_AT_type(*$C$DW$T$59)
    2549              
    2550              $C$DW$T$60      .dwtag  DW_TAG_const_type
    2551                      .dwattr $C$DW$T$60, DW_AT_type(*$C$DW$292)
    2552              
    2553              $C$DW$T$2       .dwtag  DW_TAG_unspecified_type
    2554                      .dwattr $C$DW$T$2, DW_AT_name("void")
    2555              
    2556              $C$DW$T$3       .dwtag  DW_TAG_pointer_type
    2557                      .dwattr $C$DW$T$3, DW_AT_type(*$C$DW$T$2)
    2558                      .dwattr $C$DW$T$3, DW_AT_address_class(0x20)
    2559              
    2560              $C$DW$T$4       .dwtag  DW_TAG_base_type
    2561                      .dwattr $C$DW$T$4, DW_AT_encoding(DW_ATE_boolean)
    2562                      .dwattr $C$DW$T$4, DW_AT_name("bool")
    2563                      .dwattr $C$DW$T$4, DW_AT_byte_size(0x01)
    2564              
    2565              $C$DW$T$5       .dwtag  DW_TAG_base_type
    2566                      .dwattr $C$DW$T$5, DW_AT_encoding(DW_ATE_signed_char)
    2567                      .dwattr $C$DW$T$5, DW_AT_name("signed char")
    2568                      .dwattr $C$DW$T$5, DW_AT_byte_size(0x01)
    2569              
    2570              $C$DW$T$6       .dwtag  DW_TAG_base_type
    2571                      .dwattr $C$DW$T$6, DW_AT_encoding(DW_ATE_unsigned_char)
    2572                      .dwattr $C$DW$T$6, DW_AT_name("unsigned char")
    2573                      .dwattr $C$DW$T$6, DW_AT_byte_size(0x01)
    2574              
    2575              $C$DW$T$7       .dwtag  DW_TAG_base_type
    2576                      .dwattr $C$DW$T$7, DW_AT_encoding(DW_ATE_signed_char)
    2577                      .dwattr $C$DW$T$7, DW_AT_name("wchar_t")
    2578                      .dwattr $C$DW$T$7, DW_AT_byte_size(0x01)
    2579              
    2580              $C$DW$T$8       .dwtag  DW_TAG_base_type
    2581                      .dwattr $C$DW$T$8, DW_AT_encoding(DW_ATE_signed)
    2582                      .dwattr $C$DW$T$8, DW_AT_name("short")
    2583                      .dwattr $C$DW$T$8, DW_AT_byte_size(0x01)
    2584              
    2585              $C$DW$T$9       .dwtag  DW_TAG_base_type
    2586                      .dwattr $C$DW$T$9, DW_AT_encoding(DW_ATE_unsigned)
    2587                      .dwattr $C$DW$T$9, DW_AT_name("unsigned short")
    2588                      .dwattr $C$DW$T$9, DW_AT_byte_size(0x01)
    2589              
    2590              $C$DW$T$10      .dwtag  DW_TAG_base_type
    2591                      .dwattr $C$DW$T$10, DW_AT_encoding(DW_ATE_signed)
    2592                      .dwattr $C$DW$T$10, DW_AT_name("int")
    2593                      .dwattr $C$DW$T$10, DW_AT_byte_size(0x01)
    2594              
    2595              $C$DW$T$11      .dwtag  DW_TAG_base_type
