TMS320C2000 Assembler PC v6.2.5 Sat Sep 16 14:55:50 2017

Tools Copyright (c) 1996-2014 Texas Instruments Incorporated
C:\Users\wmj\AppData\Local\Temp\1076810                              PAGE    1

       1              ;***************************************************************
       2              ;* TMS320C2000 C/C++ Codegen                         PC v6.2.5 *
       3              ;* Date/Time created: Sat Sep 16 14:55:49 2017                 *
       4              ;***************************************************************
       5                      .compiler_opts --float_support=softlib --hll_source=on --mem_model:code=flat --mem_model:data=large -
       6        0002  FP      .set    XAR2
       7              
       8              $C$DW$CU        .dwtag  DW_TAG_compile_unit
       9                      .dwattr $C$DW$CU, DW_AT_name("D:/BM1000/sw/drivers/drvic/pca9555.c")
      10                      .dwattr $C$DW$CU, DW_AT_producer("TMS320C2000 C/C++ Codegen PC v6.2.5 Copyright (c) 1996-2014 Texas I
      11                      .dwattr $C$DW$CU, DW_AT_TI_version(0x01)
      12                      .dwattr $C$DW$CU, DW_AT_comp_dir("D:\BM1000\sw\solutions\instaspin_foc\boards\hvkit_rev1p1\f28x\f2802
      13              
      14              $C$DW$1 .dwtag  DW_TAG_subprogram, DW_AT_name("I2C_setMasterSlaveAddr")
      15                      .dwattr $C$DW$1, DW_AT_TI_symbol_name("_I2C_setMasterSlaveAddr")

    1234              
    1235              $C$DW$T$35      .dwtag  DW_TAG_enumeration_type
    1236                      .dwattr $C$DW$T$35, DW_AT_byte_size(0x01)
    1237              $C$DW$139       .dwtag  DW_TAG_enumerator, DW_AT_name("PCA955x_RegName_Port0_IN"), DW_AT_const_value(0x00)
    1238              $C$DW$140       .dwtag  DW_TAG_enumerator, DW_AT_name("PCA955x_RegName_Port1_IN"), DW_AT_const_value(0x01)
    1239              $C$DW$141       .dwtag  DW_TAG_enumerator, DW_AT_name("PCA955x_RegName_Port0_OUT"), DW_AT_const_value(0x02)
    1240              $C$DW$142       .dwtag  DW_TAG_enumerator, DW_AT_name("PCA955x_RegName_Port1_OUT"), DW_AT_const_value(0x03)
    1241              $C$DW$143       .dwtag  DW_TAG_enumerator, DW_AT_name("PCA955x_RegName_Port0_PolarInv"), DW_AT_const_value(0x
    1242              $C$DW$144       .dwtag  DW_TAG_enumerator, DW_AT_name("PCA955x_RegName_Port1_PolarInv"), DW_AT_const_value(0x
    1243              $C$DW$145       .dwtag  DW_TAG_enumerator, DW_AT_name("PCA955x_RegName_Port0_Config"), DW_AT_const_value(0x06
    1244              $C$DW$146       .dwtag  DW_TAG_enumerator, DW_AT_name("PCA955x_RegName_Port1_Config"), DW_AT_const_value(0x07
    1245                      .dwendtag $C$DW$T$35
    1246              
    1247              $C$DW$T$36      .dwtag  DW_TAG_typedef, DW_AT_name("PCA955x_RegName_e")
    1248                      .dwattr $C$DW$T$36, DW_AT_type(*$C$DW$T$35)
    1249                      .dwattr $C$DW$T$36, DW_AT_language(DW_LANG_C)
    1250              $C$DW$147       .dwtag  DW_TAG_TI_far_type
TMS320C2000 Assembler PC v6.2.5 Sat Sep 16 14:55:50 2017

Tools Copyright (c) 1996-2014 Texas Instruments Incorporated
C:\Users\wmj\AppData\Local\Temp\1076810                              PAGE   25

    1251                      .dwattr $C$DW$147, DW_AT_type(*$C$DW$T$36)
    1252              $C$DW$T$37      .dwtag  DW_TAG_const_type
    1253                      .dwattr $C$DW$T$37, DW_AT_type(*$C$DW$147)
    1254              $C$DW$148       .dwtag  DW_TAG_TI_far_type
    1255                      .dwattr $C$DW$148, DW_AT_type(*$C$DW$T$36)
    1256              $C$DW$T$38      .dwtag  DW_TAG_const_type
    1257                      .dwattr $C$DW$T$38, DW_AT_type(*$C$DW$148)
    1258              
    1259              $C$DW$T$39      .dwtag  DW_TAG_enumeration_type
    1260                      .dwattr $C$DW$T$39, DW_AT_byte_size(0x01)
    1261              $C$DW$149       .dwtag  DW_TAG_enumerator, DW_AT_name("PCA955x_PortNum_Port0"), DW_AT_const_value(0x00)
    1262              $C$DW$150       .dwtag  DW_TAG_enumerator, DW_AT_name("PCA955x_PortNum_Port1"), DW_AT_const_value(0x01)
    1263                      .dwendtag $C$DW$T$39
    1264              
    1265              $C$DW$T$40      .dwtag  DW_TAG_typedef, DW_AT_name("PCA955x_PortNum_e")
    1266                      .dwattr $C$DW$T$40, DW_AT_type(*$C$DW$T$39)
    1267                      .dwattr $C$DW$T$40, DW_AT_language(DW_LANG_C)
    1268              $C$DW$151       .dwtag  DW_TAG_TI_far_type
    1269                      .dwattr $C$DW$151, DW_AT_type(*$C$DW$T$40)
    1270              $C$DW$T$41      .dwtag  DW_TAG_const_type
    1271                      .dwattr $C$DW$T$41, DW_AT_type(*$C$DW$151)
    1272              $C$DW$152       .dwtag  DW_TAG_TI_far_type
    1273                      .dwattr $C$DW$152, DW_AT_type(*$C$DW$T$40)
    1274              $C$DW$T$42      .dwtag  DW_TAG_const_type
    1275                      .dwattr $C$DW$T$42, DW_AT_type(*$C$DW$152)
    1276              $C$DW$153       .dwtag  DW_TAG_TI_far_type
    1277                      .dwattr $C$DW$153, DW_AT_type(*$C$DW$T$40)
    1278              $C$DW$T$43      .dwtag  DW_TAG_const_type
    1279                      .dwattr $C$DW$T$43, DW_AT_type(*$C$DW$153)
    1280              $C$DW$154       .dwtag  DW_TAG_TI_far_type
    1281                      .dwattr $C$DW$154, DW_AT_type(*$C$DW$T$40)
    1282              $C$DW$T$44      .dwtag  DW_TAG_const_type
    1283                      .dwattr $C$DW$T$44, DW_AT_type(*$C$DW$154)
    1284              
    1285              $C$DW$T$19      .dwtag  DW_TAG_structure_type
    1286                      .dwattr $C$DW$T$19, DW_AT_name("I2C_Obj")
    1287                      .dwattr $C$DW$T$19, DW_AT_declaration
    1288                      .dwendtag $C$DW$T$19
    1289              
    1290              $C$DW$T$20      .dwtag  DW_TAG_pointer_type
    1291                      .dwattr $C$DW$T$20, DW_AT_type(*$C$DW$T$19)
    1292                      .dwattr $C$DW$T$20, DW_AT_address_class(0x16)
    1293              $C$DW$T$21      .dwtag  DW_TAG_typedef, DW_AT_name("I2C_Handle")
    1294                      .dwattr $C$DW$T$21, DW_AT_type(*$C$DW$T$20)
    1295                      .dwattr $C$DW$T$21, DW_AT_language(DW_LANG_C)
    1296              $C$DW$155       .dwtag  DW_TAG_TI_far_type
    1297                      .dwattr $C$DW$155, DW_AT_type(*$C$DW$T$21)
    1298              $C$DW$T$45      .dwtag  DW_TAG_const_type
    1299                      .dwattr $C$DW$T$45, DW_AT_type(*$C$DW$155)
    1300              
    1301              $C$DW$T$24      .dwtag  DW_TAG_structure_type
    1302                      .dwattr $C$DW$T$24, DW_AT_name("_PCA955x_Obj_")
    1303                      .dwattr $C$DW$T$24, DW_AT_byte_size(0x12)
    1304              $C$DW$156       .dwtag  DW_TAG_member
    1305                      .dwattr $C$DW$156, DW_AT_type(*$C$DW$T$21)
TMS320C2000 Assembler PC v6.2.5 Sat Sep 16 14:55:50 2017

Tools Copyright (c) 1996-2014 Texas Instruments Incorporated
C:\Users\wmj\AppData\Local\Temp\1076810                              PAGE   26

    1306                      .dwattr $C$DW$156, DW_AT_name("i2cHandle")
    1307                      .dwattr $C$DW$156, DW_AT_TI_symbol_name("_i2cHandle")
    1308                      .dwattr $C$DW$156, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    1309                      .dwattr $C$DW$156, DW_AT_accessibility(DW_ACCESS_public)
    1310              $C$DW$157       .dwtag  DW_TAG_member
    1311                      .dwattr $C$DW$157, DW_AT_type(*$C$DW$T$22)
    1312                      .dwattr $C$DW$157, DW_AT_name("PortData")
    1313                      .dwattr $C$DW$157, DW_AT_TI_symbol_name("_PortData")
    1314                      .dwattr $C$DW$157, DW_AT_data_member_location[DW_OP_plus_uconst 0x2]
    1315                      .dwattr $C$DW$157, DW_AT_accessibility(DW_ACCESS_public)
    1316              $C$DW$158       .dwtag  DW_TAG_member
    1317                      .dwattr $C$DW$158, DW_AT_type(*$C$DW$T$23)
    1318                      .dwattr $C$DW$158, DW_AT_name("RxTimeOut")
    1319                      .dwattr $C$DW$158, DW_AT_TI_symbol_name("_RxTimeOut")
    1320                      .dwattr $C$DW$158, DW_AT_data_member_location[DW_OP_plus_uconst 0x10]
    1321                      .dwattr $C$DW$158, DW_AT_accessibility(DW_ACCESS_public)
    1322              $C$DW$159       .dwtag  DW_TAG_member
    1323                      .dwattr $C$DW$159, DW_AT_type(*$C$DW$T$23)
    1324                      .dwattr $C$DW$159, DW_AT_name("TxTimeOut")
    1325                      .dwattr $C$DW$159, DW_AT_TI_symbol_name("_TxTimeOut")
    1326                      .dwattr $C$DW$159, DW_AT_data_member_location[DW_OP_plus_uconst 0x11]
    1327                      .dwattr $C$DW$159, DW_AT_accessibility(DW_ACCESS_public)
    1328                      .dwendtag $C$DW$T$24
    1329              
    1330              $C$DW$T$47      .dwtag  DW_TAG_typedef, DW_AT_name("PCA955x_Obj")
    1331                      .dwattr $C$DW$T$47, DW_AT_type(*$C$DW$T$24)
    1332                      .dwattr $C$DW$T$47, DW_AT_language(DW_LANG_C)
    1333              $C$DW$T$48      .dwtag  DW_TAG_pointer_type
    1334                      .dwattr $C$DW$T$48, DW_AT_type(*$C$DW$T$24)
    1335                      .dwattr $C$DW$T$48, DW_AT_address_class(0x16)
    1336              $C$DW$T$49      .dwtag  DW_TAG_typedef, DW_AT_name("PCA955x_Handle")
    1337                      .dwattr $C$DW$T$49, DW_AT_type(*$C$DW$T$48)
    1338                      .dwattr $C$DW$T$49, DW_AT_language(DW_LANG_C)
    1339              $C$DW$160       .dwtag  DW_TAG_TI_far_type
    1340                      .dwattr $C$DW$160, DW_AT_type(*$C$DW$T$49)
    1341              $C$DW$T$50      .dwtag  DW_TAG_const_type
    1342                      .dwattr $C$DW$T$50, DW_AT_type(*$C$DW$160)
    1343              
    1344              $C$DW$T$25      .dwtag  DW_TAG_structure_type
    1345                      .dwattr $C$DW$T$25, DW_AT_name("_PORT_DATA_t_")
    1346                      .dwattr $C$DW$T$25, DW_AT_byte_size(0x0e)
    1347              $C$DW$161       .dwtag  DW_TAG_member
    1348                      .dwattr $C$DW$161, DW_AT_type(*$C$DW$T$23)
    1349                      .dwattr $C$DW$161, DW_AT_name("PORT0_SD")
    1350                      .dwattr $C$DW$161, DW_AT_TI_symbol_name("_PORT0_SD")
    1351                      .dwattr $C$DW$161, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    1352                      .dwattr $C$DW$161, DW_AT_accessibility(DW_ACCESS_public)
    1353              $C$DW$162       .dwtag  DW_TAG_member
    1354                      .dwattr $C$DW$162, DW_AT_type(*$C$DW$T$23)
    1355                      .dwattr $C$DW$162, DW_AT_name("PORT0_RELAY_OPEN")
    1356                      .dwattr $C$DW$162, DW_AT_TI_symbol_name("_PORT0_RELAY_OPEN")
    1357                      .dwattr $C$DW$162, DW_AT_data_member_location[DW_OP_plus_uconst 0x1]
    1358                      .dwattr $C$DW$162, DW_AT_accessibility(DW_ACCESS_public)
    1359              $C$DW$163       .dwtag  DW_TAG_member
    1360                      .dwattr $C$DW$163, DW_AT_type(*$C$DW$T$23)
TMS320C2000 Assembler PC v6.2.5 Sat Sep 16 14:55:50 2017

Tools Copyright (c) 1996-2014 Texas Instruments Incorporated
C:\Users\wmj\AppData\Local\Temp\1076810                              PAGE   27

    1361                      .dwattr $C$DW$163, DW_AT_name("PORT0_CLR_OC")
    1362                      .dwattr $C$DW$163, DW_AT_TI_symbol_name("_PORT0_CLR_OC")
    1363                      .dwattr $C$DW$163, DW_AT_data_member_location[DW_OP_plus_uconst 0x2]
    1364                      .dwattr $C$DW$163, DW_AT_accessibility(DW_ACCESS_public)
    1365              $C$DW$164       .dwtag  DW_TAG_member
    1366                      .dwattr $C$DW$164, DW_AT_type(*$C$DW$T$23)
    1367                      .dwattr $C$DW$164, DW_AT_name("PORT0_CPLD_RST")
    1368                      .dwattr $C$DW$164, DW_AT_TI_symbol_name("_PORT0_CPLD_RST")
    1369                      .dwattr $C$DW$164, DW_AT_data_member_location[DW_OP_plus_uconst 0x3]
    1370                      .dwattr $C$DW$164, DW_AT_accessibility(DW_ACCESS_public)
    1371              $C$DW$165       .dwtag  DW_TAG_member
    1372                      .dwattr $C$DW$165, DW_AT_type(*$C$DW$T$23)
    1373                      .dwattr $C$DW$165, DW_AT_name("PORT0_LEDR")
    1374                      .dwattr $C$DW$165, DW_AT_TI_symbol_name("_PORT0_LEDR")
    1375                      .dwattr $C$DW$165, DW_AT_data_member_location[DW_OP_plus_uconst 0x4]
    1376                      .dwattr $C$DW$165, DW_AT_accessibility(DW_ACCESS_public)
    1377              $C$DW$166       .dwtag  DW_TAG_member
    1378                      .dwattr $C$DW$166, DW_AT_type(*$C$DW$T$23)
    1379                      .dwattr $C$DW$166, DW_AT_name("PORT0_LEDY")
    1380                      .dwattr $C$DW$166, DW_AT_TI_symbol_name("_PORT0_LEDY")
    1381                      .dwattr $C$DW$166, DW_AT_data_member_location[DW_OP_plus_uconst 0x5]
    1382                      .dwattr $C$DW$166, DW_AT_accessibility(DW_ACCESS_public)
    1383              $C$DW$167       .dwtag  DW_TAG_member
    1384                      .dwattr $C$DW$167, DW_AT_type(*$C$DW$T$23)
    1385                      .dwattr $C$DW$167, DW_AT_name("PORT0_LEDG")
    1386                      .dwattr $C$DW$167, DW_AT_TI_symbol_name("_PORT0_LEDG")
    1387                      .dwattr $C$DW$167, DW_AT_data_member_location[DW_OP_plus_uconst 0x6]
    1388                      .dwattr $C$DW$167, DW_AT_accessibility(DW_ACCESS_public)
    1389              $C$DW$168       .dwtag  DW_TAG_member
    1390                      .dwattr $C$DW$168, DW_AT_type(*$C$DW$T$23)
    1391                      .dwattr $C$DW$168, DW_AT_name("PORT0_LEDB")
    1392                      .dwattr $C$DW$168, DW_AT_TI_symbol_name("_PORT0_LEDB")
    1393                      .dwattr $C$DW$168, DW_AT_data_member_location[DW_OP_plus_uconst 0x7]
    1394                      .dwattr $C$DW$168, DW_AT_accessibility(DW_ACCESS_public)
    1395              $C$DW$169       .dwtag  DW_TAG_member
    1396                      .dwattr $C$DW$169, DW_AT_type(*$C$DW$T$23)
    1397                      .dwattr $C$DW$169, DW_AT_name("PORT1_IGBT_OC")
    1398                      .dwattr $C$DW$169, DW_AT_TI_symbol_name("_PORT1_IGBT_OC")
    1399                      .dwattr $C$DW$169, DW_AT_data_member_location[DW_OP_plus_uconst 0x8]
    1400                      .dwattr $C$DW$169, DW_AT_accessibility(DW_ACCESS_public)
    1401              $C$DW$170       .dwtag  DW_TAG_member
    1402                      .dwattr $C$DW$170, DW_AT_type(*$C$DW$T$23)
    1403                      .dwattr $C$DW$170, DW_AT_name("PORT1_IKCM_UV")
    1404                      .dwattr $C$DW$170, DW_AT_TI_symbol_name("_PORT1_IKCM_UV")
    1405                      .dwattr $C$DW$170, DW_AT_data_member_location[DW_OP_plus_uconst 0x9]
    1406                      .dwattr $C$DW$170, DW_AT_accessibility(DW_ACCESS_public)
    1407              $C$DW$171       .dwtag  DW_TAG_member
    1408                      .dwattr $C$DW$171, DW_AT_type(*$C$DW$T$23)
    1409                      .dwattr $C$DW$171, DW_AT_name("PORT1_RELAY_ON")
    1410                      .dwattr $C$DW$171, DW_AT_TI_symbol_name("_PORT1_RELAY_ON")
    1411                      .dwattr $C$DW$171, DW_AT_data_member_location[DW_OP_plus_uconst 0xa]
    1412                      .dwattr $C$DW$171, DW_AT_accessibility(DW_ACCESS_public)
    1413              $C$DW$172       .dwtag  DW_TAG_member
    1414                      .dwattr $C$DW$172, DW_AT_type(*$C$DW$T$23)
    1415                      .dwattr $C$DW$172, DW_AT_name("PORT1_EMERG_STP")
TMS320C2000 Assembler PC v6.2.5 Sat Sep 16 14:55:50 2017

Tools Copyright (c) 1996-2014 Texas Instruments Incorporated
C:\Users\wmj\AppData\Local\Temp\1076810                              PAGE   28

    1416                      .dwattr $C$DW$172, DW_AT_TI_symbol_name("_PORT1_EMERG_STP")
    1417                      .dwattr $C$DW$172, DW_AT_data_member_location[DW_OP_plus_uconst 0xb]
    1418                      .dwattr $C$DW$172, DW_AT_accessibility(DW_ACCESS_public)
    1419              $C$DW$173       .dwtag  DW_TAG_member
    1420                      .dwattr $C$DW$173, DW_AT_type(*$C$DW$T$23)
    1421                      .dwattr $C$DW$173, DW_AT_name("PORT1_SENSOR0")
    1422                      .dwattr $C$DW$173, DW_AT_TI_symbol_name("_PORT1_SENSOR0")
    1423                      .dwattr $C$DW$173, DW_AT_data_member_location[DW_OP_plus_uconst 0xc]
    1424                      .dwattr $C$DW$173, DW_AT_accessibility(DW_ACCESS_public)
    1425              $C$DW$174       .dwtag  DW_TAG_member
    1426                      .dwattr $C$DW$174, DW_AT_type(*$C$DW$T$23)
    1427                      .dwattr $C$DW$174, DW_AT_name("PORT1_SENSOR1")
    1428                      .dwattr $C$DW$174, DW_AT_TI_symbol_name("_PORT1_SENSOR1")
    1429                      .dwattr $C$DW$174, DW_AT_data_member_location[DW_OP_plus_uconst 0xd]
    1430                      .dwattr $C$DW$174, DW_AT_accessibility(DW_ACCESS_public)
    1431                      .dwendtag $C$DW$T$25
    1432              
    1433              $C$DW$T$22      .dwtag  DW_TAG_typedef, DW_AT_name("PORT_DATA_t")
    1434                      .dwattr $C$DW$T$22, DW_AT_type(*$C$DW$T$25)
    1435                      .dwattr $C$DW$T$22, DW_AT_language(DW_LANG_C)
    1436              $C$DW$T$3       .dwtag  DW_TAG_pointer_type
    1437                      .dwattr $C$DW$T$3, DW_AT_address_class(0x16)
    1438              $C$DW$175       .dwtag  DW_TAG_TI_far_type
    1439                      .dwattr $C$DW$175, DW_AT_type(*$C$DW$T$3)
    1440              $C$DW$T$56      .dwtag  DW_TAG_const_type
    1441                      .dwattr $C$DW$T$56, DW_AT_type(*$C$DW$175)
    1442              $C$DW$T$4       .dwtag  DW_TAG_base_type
    1443                      .dwattr $C$DW$T$4, DW_AT_encoding(DW_ATE_boolean)
    1444                      .dwattr $C$DW$T$4, DW_AT_name("bool")
    1445                      .dwattr $C$DW$T$4, DW_AT_byte_size(0x01)
    1446              $C$DW$T$5       .dwtag  DW_TAG_base_type
    1447                      .dwattr $C$DW$T$5, DW_AT_encoding(DW_ATE_signed_char)
    1448                      .dwattr $C$DW$T$5, DW_AT_name("signed char")
    1449                      .dwattr $C$DW$T$5, DW_AT_byte_size(0x01)
    1450              $C$DW$T$6       .dwtag  DW_TAG_base_type
    1451                      .dwattr $C$DW$T$6, DW_AT_encoding(DW_ATE_unsigned_char)
    1452                      .dwattr $C$DW$T$6, DW_AT_name("unsigned char")
    1453                      .dwattr $C$DW$T$6, DW_AT_byte_size(0x01)
    1454              $C$DW$T$23      .dwtag  DW_TAG_typedef, DW_AT_name("_Bool")
    1455                      .dwattr $C$DW$T$23, DW_AT_type(*$C$DW$T$6)
    1456                      .dwattr $C$DW$T$23, DW_AT_language(DW_LANG_C)
    1457              $C$DW$T$7       .dwtag  DW_TAG_base_type
    1458                      .dwattr $C$DW$T$7, DW_AT_encoding(DW_ATE_signed_char)
    1459                      .dwattr $C$DW$T$7, DW_AT_name("wchar_t")
    1460                      .dwattr $C$DW$T$7, DW_AT_byte_size(0x01)
    1461              $C$DW$T$8       .dwtag  DW_TAG_base_type
    1462                      .dwattr $C$DW$T$8, DW_AT_encoding(DW_ATE_signed)
    1463                      .dwattr $C$DW$T$8, DW_AT_name("short")
    1464                      .dwattr $C$DW$T$8, DW_AT_byte_size(0x01)
    1465              $C$DW$T$9       .dwtag  DW_TAG_base_type
    1466                      .dwattr $C$DW$T$9, DW_AT_encoding(DW_ATE_unsigned)
    1467                      .dwattr $C$DW$T$9, DW_AT_name("unsigned short")
    1468                      .dwattr $C$DW$T$9, DW_AT_byte_size(0x01)
    1469              $C$DW$T$57      .dwtag  DW_TAG_typedef, DW_AT_name("uint16_t")
    1470                      .dwattr $C$DW$T$57, DW_AT_type(*$C$DW$T$9)
TMS320C2000 Assembler PC v6.2.5 Sat Sep 16 14:55:50 2017

Tools Copyright (c) 1996-2014 Texas Instruments Incorporated
C:\Users\wmj\AppData\Local\Temp\1076810                              PAGE   29

    1471                      .dwattr $C$DW$T$57, DW_AT_language(DW_LANG_C)
    1472              $C$DW$176       .dwtag  DW_TAG_TI_far_type
    1473                      .dwattr $C$DW$176, DW_AT_type(*$C$DW$T$57)
    1474              $C$DW$T$64      .dwtag  DW_TAG_const_type
    1475                      .dwattr $C$DW$T$64, DW_AT_type(*$C$DW$176)
    1476              $C$DW$177       .dwtag  DW_TAG_TI_far_type
    1477                      .dwattr $C$DW$177, DW_AT_type(*$C$DW$T$57)
    1478              $C$DW$T$77      .dwtag  DW_TAG_volatile_type
    1479                      .dwattr $C$DW$T$77, DW_AT_type(*$C$DW$177)
    1480              $C$DW$T$10      .dwtag  DW_TAG_base_type
