TMS320C2000 Assembler PC v6.2.5 Thu Nov 23 20:51:03 2017

Tools Copyright (c) 1996-2014 Texas Instruments Incorporated
C:\Users\wmj\AppData\Local\Temp\0886011                              PAGE    1

       1              ;***************************************************************
       2              ;* TMS320C2000 C/C++ Codegen                         PC v6.2.5 *
       3              ;* Date/Time created: Thu Nov 23 20:51:02 2017                 *
       4              ;***************************************************************
       5                      .compiler_opts --float_support=softlib --hll_source=on --mem_model:code=flat --mem_model:data=large -
       6        0002  FP      .set    XAR2
       7              
       8              $C$DW$CU        .dwtag  DW_TAG_compile_unit
       9                      .dwattr $C$DW$CU, DW_AT_name("D:/BM1000_v1.1/sw/drivers/drvic/process_ctrl.c")
      10                      .dwattr $C$DW$CU, DW_AT_producer("TMS320C2000 C/C++ Codegen PC v6.2.5 Copyright (c) 1996-2014 Texas I
      11                      .dwattr $C$DW$CU, DW_AT_TI_version(0x01)
      12                      .dwattr $C$DW$CU, DW_AT_comp_dir("D:\BM1000_v1.1\sw\solutions\instaspin_foc\boards\hvkit_rev1p1\f28x\
      13              ;**************************************************************
      14              ;* CINIT RECORDS                                              *

    8704              $C$DW$993       .dwtag  DW_TAG_enumerator, DW_AT_name("GPIO_Number_17"), DW_AT_const_value(0x11)
    8705              $C$DW$994       .dwtag  DW_TAG_enumerator, DW_AT_name("GPIO_Number_18"), DW_AT_const_value(0x12)
    8706              $C$DW$995       .dwtag  DW_TAG_enumerator, DW_AT_name("GPIO_Number_19"), DW_AT_const_value(0x13)
    8707              $C$DW$996       .dwtag  DW_TAG_enumerator, DW_AT_name("GPIO_Rsvd_20"), DW_AT_const_value(0x14)
    8708              $C$DW$997       .dwtag  DW_TAG_enumerator, DW_AT_name("GPIO_Rsvd_21"), DW_AT_const_value(0x15)
    8709              $C$DW$998       .dwtag  DW_TAG_enumerator, DW_AT_name("GPIO_Rsvd_22"), DW_AT_const_value(0x16)
    8710              $C$DW$999       .dwtag  DW_TAG_enumerator, DW_AT_name("GPIO_Rsvd_23"), DW_AT_const_value(0x17)
    8711              $C$DW$1000      .dwtag  DW_TAG_enumerator, DW_AT_name("GPIO_Rsvd_24"), DW_AT_const_value(0x18)
    8712              $C$DW$1001      .dwtag  DW_TAG_enumerator, DW_AT_name("GPIO_Rsvd_25"), DW_AT_const_value(0x19)
    8713              $C$DW$1002      .dwtag  DW_TAG_enumerator, DW_AT_name("GPIO_Rsvd_26"), DW_AT_const_value(0x1a)
    8714              $C$DW$1003      .dwtag  DW_TAG_enumerator, DW_AT_name("GPIO_Rsvd_27"), DW_AT_const_value(0x1b)
    8715              $C$DW$1004      .dwtag  DW_TAG_enumerator, DW_AT_name("GPIO_Number_28"), DW_AT_const_value(0x1c)
    8716              $C$DW$1005      .dwtag  DW_TAG_enumerator, DW_AT_name("GPIO_Number_29"), DW_AT_const_value(0x1d)
    8717              $C$DW$1006      .dwtag  DW_TAG_enumerator, DW_AT_name("GPIO_Rsvd_30"), DW_AT_const_value(0x1e)
    8718              $C$DW$1007      .dwtag  DW_TAG_enumerator, DW_AT_name("GPIO_Rsvd_31"), DW_AT_const_value(0x1f)
    8719              $C$DW$1008      .dwtag  DW_TAG_enumerator, DW_AT_name("GPIO_Number_32"), DW_AT_const_value(0x20)
    8720              $C$DW$1009      .dwtag  DW_TAG_enumerator, DW_AT_name("GPIO_Number_33"), DW_AT_const_value(0x21)
    8721              $C$DW$1010      .dwtag  DW_TAG_enumerator, DW_AT_name("GPIO_Number_34"), DW_AT_const_value(0x22)
    8722              $C$DW$1011      .dwtag  DW_TAG_enumerator, DW_AT_name("GPIO_Number_35"), DW_AT_const_value(0x23)
    8723              $C$DW$1012      .dwtag  DW_TAG_enumerator, DW_AT_name("GPIO_Number_36"), DW_AT_const_value(0x24)
    8724              $C$DW$1013      .dwtag  DW_TAG_enumerator, DW_AT_name("GPIO_Number_37"), DW_AT_const_value(0x25)
    8725              $C$DW$1014      .dwtag  DW_TAG_enumerator, DW_AT_name("GPIO_Number_38"), DW_AT_const_value(0x26)
    8726              $C$DW$1015      .dwtag  DW_TAG_enumerator, DW_AT_name("GPIO_numGpios"), DW_AT_const_value(0x27)
    8727                      .dwendtag $C$DW$T$242
    8728              
    8729              $C$DW$T$243     .dwtag  DW_TAG_typedef, DW_AT_name("GPIO_Number_e")
    8730                      .dwattr $C$DW$T$243, DW_AT_type(*$C$DW$T$242)
    8731                      .dwattr $C$DW$T$243, DW_AT_language(DW_LANG_C)
    8732              $C$DW$1016      .dwtag  DW_TAG_TI_far_type
TMS320C2000 Assembler PC v6.2.5 Thu Nov 23 20:51:03 2017

Tools Copyright (c) 1996-2014 Texas Instruments Incorporated
C:\Users\wmj\AppData\Local\Temp\0886011                              PAGE  169

    8733                      .dwattr $C$DW$1016, DW_AT_type(*$C$DW$T$243)
    8734              $C$DW$T$244     .dwtag  DW_TAG_const_type
    8735                      .dwattr $C$DW$T$244, DW_AT_type(*$C$DW$1016)
    8736              
    8737              $C$DW$T$245     .dwtag  DW_TAG_enumeration_type
    8738                      .dwattr $C$DW$T$245, DW_AT_byte_size(0x01)
    8739              $C$DW$1017      .dwtag  DW_TAG_enumerator, DW_AT_name("CTRL_Type_PID_spd"), DW_AT_const_value(0x00)
    8740              $C$DW$1018      .dwtag  DW_TAG_enumerator, DW_AT_name("CTRL_Type_PID_Id"), DW_AT_const_value(0x01)
    8741              $C$DW$1019      .dwtag  DW_TAG_enumerator, DW_AT_name("CTRL_Type_PID_Iq"), DW_AT_const_value(0x02)
    8742                      .dwendtag $C$DW$T$245
    8743              
    8744              $C$DW$T$246     .dwtag  DW_TAG_typedef, DW_AT_name("CTRL_Type_e")
    8745                      .dwattr $C$DW$T$246, DW_AT_type(*$C$DW$T$245)
    8746                      .dwattr $C$DW$T$246, DW_AT_language(DW_LANG_C)
    8747              $C$DW$1020      .dwtag  DW_TAG_TI_far_type
    8748                      .dwattr $C$DW$1020, DW_AT_type(*$C$DW$T$246)
    8749              $C$DW$T$247     .dwtag  DW_TAG_const_type
    8750                      .dwattr $C$DW$T$247, DW_AT_type(*$C$DW$1020)
    8751              
    8752              $C$DW$T$248     .dwtag  DW_TAG_enumeration_type
    8753                      .dwattr $C$DW$T$248, DW_AT_byte_size(0x01)
    8754              $C$DW$1021      .dwtag  DW_TAG_enumerator, DW_AT_name("HAL_SensorType_Current"), DW_AT_const_value(0x00)
    8755              $C$DW$1022      .dwtag  DW_TAG_enumerator, DW_AT_name("HAL_SensorType_Voltage"), DW_AT_const_value(0x01)
    8756                      .dwendtag $C$DW$T$248
    8757              
    8758              $C$DW$T$249     .dwtag  DW_TAG_typedef, DW_AT_name("HAL_SensorType_e")
    8759                      .dwattr $C$DW$T$249, DW_AT_type(*$C$DW$T$248)
    8760                      .dwattr $C$DW$T$249, DW_AT_language(DW_LANG_C)
    8761              
    8762              $C$DW$T$30      .dwtag  DW_TAG_structure_type
    8763                      .dwattr $C$DW$T$30, DW_AT_name("_ADC_Obj_")
    8764                      .dwattr $C$DW$T$30, DW_AT_byte_size(0x6650)
    8765              $C$DW$1023      .dwtag  DW_TAG_member
    8766                      .dwattr $C$DW$1023, DW_AT_type(*$C$DW$T$24)
    8767                      .dwattr $C$DW$1023, DW_AT_name("ADCRESULT")
    8768                      .dwattr $C$DW$1023, DW_AT_TI_symbol_name("_ADCRESULT")
    8769                      .dwattr $C$DW$1023, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    8770                      .dwattr $C$DW$1023, DW_AT_accessibility(DW_ACCESS_public)
    8771              $C$DW$1024      .dwtag  DW_TAG_member
    8772                      .dwattr $C$DW$1024, DW_AT_type(*$C$DW$T$25)
    8773                      .dwattr $C$DW$1024, DW_AT_name("resvd_1")
    8774                      .dwattr $C$DW$1024, DW_AT_TI_symbol_name("_resvd_1")
    8775                      .dwattr $C$DW$1024, DW_AT_data_member_location[DW_OP_plus_uconst 0x10]
    8776                      .dwattr $C$DW$1024, DW_AT_accessibility(DW_ACCESS_public)
    8777              $C$DW$1025      .dwtag  DW_TAG_member
    8778                      .dwattr $C$DW$1025, DW_AT_type(*$C$DW$T$23)
    8779                      .dwattr $C$DW$1025, DW_AT_name("ADCCTL1")
    8780                      .dwattr $C$DW$1025, DW_AT_TI_symbol_name("_ADCCTL1")
    8781                      .dwattr $C$DW$1025, DW_AT_data_member_location[DW_OP_plus_uconst 0x6600]
    8782                      .dwattr $C$DW$1025, DW_AT_accessibility(DW_ACCESS_public)
    8783              $C$DW$1026      .dwtag  DW_TAG_member
    8784                      .dwattr $C$DW$1026, DW_AT_type(*$C$DW$T$23)
    8785                      .dwattr $C$DW$1026, DW_AT_name("ADCCTL2")
    8786                      .dwattr $C$DW$1026, DW_AT_TI_symbol_name("_ADCCTL2")
    8787                      .dwattr $C$DW$1026, DW_AT_data_member_location[DW_OP_plus_uconst 0x6601]
TMS320C2000 Assembler PC v6.2.5 Thu Nov 23 20:51:03 2017

Tools Copyright (c) 1996-2014 Texas Instruments Incorporated
C:\Users\wmj\AppData\Local\Temp\0886011                              PAGE  170

    8788                      .dwattr $C$DW$1026, DW_AT_accessibility(DW_ACCESS_public)
    8789              $C$DW$1027      .dwtag  DW_TAG_member
    8790                      .dwattr $C$DW$1027, DW_AT_type(*$C$DW$T$26)
    8791                      .dwattr $C$DW$1027, DW_AT_name("rsvd_2")
    8792                      .dwattr $C$DW$1027, DW_AT_TI_symbol_name("_rsvd_2")
    8793                      .dwattr $C$DW$1027, DW_AT_data_member_location[DW_OP_plus_uconst 0x6602]
    8794                      .dwattr $C$DW$1027, DW_AT_accessibility(DW_ACCESS_public)
    8795              $C$DW$1028      .dwtag  DW_TAG_member
    8796                      .dwattr $C$DW$1028, DW_AT_type(*$C$DW$T$23)
    8797                      .dwattr $C$DW$1028, DW_AT_name("ADCINTFLG")
    8798                      .dwattr $C$DW$1028, DW_AT_TI_symbol_name("_ADCINTFLG")
    8799                      .dwattr $C$DW$1028, DW_AT_data_member_location[DW_OP_plus_uconst 0x6604]
    8800                      .dwattr $C$DW$1028, DW_AT_accessibility(DW_ACCESS_public)
    8801              $C$DW$1029      .dwtag  DW_TAG_member
    8802                      .dwattr $C$DW$1029, DW_AT_type(*$C$DW$T$23)
    8803                      .dwattr $C$DW$1029, DW_AT_name("ADCINTFLGCLR")
    8804                      .dwattr $C$DW$1029, DW_AT_TI_symbol_name("_ADCINTFLGCLR")
    8805                      .dwattr $C$DW$1029, DW_AT_data_member_location[DW_OP_plus_uconst 0x6605]
    8806                      .dwattr $C$DW$1029, DW_AT_accessibility(DW_ACCESS_public)
    8807              $C$DW$1030      .dwtag  DW_TAG_member
    8808                      .dwattr $C$DW$1030, DW_AT_type(*$C$DW$T$23)
    8809                      .dwattr $C$DW$1030, DW_AT_name("ADCINTOVF")
    8810                      .dwattr $C$DW$1030, DW_AT_TI_symbol_name("_ADCINTOVF")
    8811                      .dwattr $C$DW$1030, DW_AT_data_member_location[DW_OP_plus_uconst 0x6606]
    8812                      .dwattr $C$DW$1030, DW_AT_accessibility(DW_ACCESS_public)
    8813              $C$DW$1031      .dwtag  DW_TAG_member
    8814                      .dwattr $C$DW$1031, DW_AT_type(*$C$DW$T$23)
    8815                      .dwattr $C$DW$1031, DW_AT_name("ADCINTOVFCLR")
    8816                      .dwattr $C$DW$1031, DW_AT_TI_symbol_name("_ADCINTOVFCLR")
    8817                      .dwattr $C$DW$1031, DW_AT_data_member_location[DW_OP_plus_uconst 0x6607]
    8818                      .dwattr $C$DW$1031, DW_AT_accessibility(DW_ACCESS_public)
    8819              $C$DW$1032      .dwtag  DW_TAG_member
    8820                      .dwattr $C$DW$1032, DW_AT_type(*$C$DW$T$27)
    8821                      .dwattr $C$DW$1032, DW_AT_name("INTSELxNy")
    8822                      .dwattr $C$DW$1032, DW_AT_TI_symbol_name("_INTSELxNy")
    8823                      .dwattr $C$DW$1032, DW_AT_data_member_location[DW_OP_plus_uconst 0x6608]
    8824                      .dwattr $C$DW$1032, DW_AT_accessibility(DW_ACCESS_public)
    8825              $C$DW$1033      .dwtag  DW_TAG_member
    8826                      .dwattr $C$DW$1033, DW_AT_type(*$C$DW$T$28)
    8827                      .dwattr $C$DW$1033, DW_AT_name("rsvd_3")
    8828                      .dwattr $C$DW$1033, DW_AT_TI_symbol_name("_rsvd_3")
    8829                      .dwattr $C$DW$1033, DW_AT_data_member_location[DW_OP_plus_uconst 0x660d]
    8830                      .dwattr $C$DW$1033, DW_AT_accessibility(DW_ACCESS_public)
    8831              $C$DW$1034      .dwtag  DW_TAG_member
    8832                      .dwattr $C$DW$1034, DW_AT_type(*$C$DW$T$23)
    8833                      .dwattr $C$DW$1034, DW_AT_name("SOCPRICTRL")
    8834                      .dwattr $C$DW$1034, DW_AT_TI_symbol_name("_SOCPRICTRL")
    8835                      .dwattr $C$DW$1034, DW_AT_data_member_location[DW_OP_plus_uconst 0x6610]
    8836                      .dwattr $C$DW$1034, DW_AT_accessibility(DW_ACCESS_public)
    8837              $C$DW$1035      .dwtag  DW_TAG_member
    8838                      .dwattr $C$DW$1035, DW_AT_type(*$C$DW$T$23)
    8839                      .dwattr $C$DW$1035, DW_AT_name("rsvd_4")
    8840                      .dwattr $C$DW$1035, DW_AT_TI_symbol_name("_rsvd_4")
    8841                      .dwattr $C$DW$1035, DW_AT_data_member_location[DW_OP_plus_uconst 0x6611]
    8842                      .dwattr $C$DW$1035, DW_AT_accessibility(DW_ACCESS_public)
TMS320C2000 Assembler PC v6.2.5 Thu Nov 23 20:51:03 2017

Tools Copyright (c) 1996-2014 Texas Instruments Incorporated
C:\Users\wmj\AppData\Local\Temp\0886011                              PAGE  171

    8843              $C$DW$1036      .dwtag  DW_TAG_member
    8844                      .dwattr $C$DW$1036, DW_AT_type(*$C$DW$T$23)
    8845                      .dwattr $C$DW$1036, DW_AT_name("ADCSAMPLEMODE")
    8846                      .dwattr $C$DW$1036, DW_AT_TI_symbol_name("_ADCSAMPLEMODE")
    8847                      .dwattr $C$DW$1036, DW_AT_data_member_location[DW_OP_plus_uconst 0x6612]
    8848                      .dwattr $C$DW$1036, DW_AT_accessibility(DW_ACCESS_public)
    8849              $C$DW$1037      .dwtag  DW_TAG_member
    8850                      .dwattr $C$DW$1037, DW_AT_type(*$C$DW$T$23)
    8851                      .dwattr $C$DW$1037, DW_AT_name("rsvd_5")
    8852                      .dwattr $C$DW$1037, DW_AT_TI_symbol_name("_rsvd_5")
    8853                      .dwattr $C$DW$1037, DW_AT_data_member_location[DW_OP_plus_uconst 0x6613]
    8854                      .dwattr $C$DW$1037, DW_AT_accessibility(DW_ACCESS_public)
    8855              $C$DW$1038      .dwtag  DW_TAG_member
    8856                      .dwattr $C$DW$1038, DW_AT_type(*$C$DW$T$23)
    8857                      .dwattr $C$DW$1038, DW_AT_name("ADCINTSOCSEL1")
    8858                      .dwattr $C$DW$1038, DW_AT_TI_symbol_name("_ADCINTSOCSEL1")
    8859                      .dwattr $C$DW$1038, DW_AT_data_member_location[DW_OP_plus_uconst 0x6614]
    8860                      .dwattr $C$DW$1038, DW_AT_accessibility(DW_ACCESS_public)
    8861              $C$DW$1039      .dwtag  DW_TAG_member
    8862                      .dwattr $C$DW$1039, DW_AT_type(*$C$DW$T$23)
    8863                      .dwattr $C$DW$1039, DW_AT_name("ADCINTSOCSEL2")
    8864                      .dwattr $C$DW$1039, DW_AT_TI_symbol_name("_ADCINTSOCSEL2")
    8865                      .dwattr $C$DW$1039, DW_AT_data_member_location[DW_OP_plus_uconst 0x6615]
    8866                      .dwattr $C$DW$1039, DW_AT_accessibility(DW_ACCESS_public)
    8867              $C$DW$1040      .dwtag  DW_TAG_member
    8868                      .dwattr $C$DW$1040, DW_AT_type(*$C$DW$T$26)
    8869                      .dwattr $C$DW$1040, DW_AT_name("rsvd_6")
    8870                      .dwattr $C$DW$1040, DW_AT_TI_symbol_name("_rsvd_6")
    8871                      .dwattr $C$DW$1040, DW_AT_data_member_location[DW_OP_plus_uconst 0x6616]
    8872                      .dwattr $C$DW$1040, DW_AT_accessibility(DW_ACCESS_public)
    8873              $C$DW$1041      .dwtag  DW_TAG_member
    8874                      .dwattr $C$DW$1041, DW_AT_type(*$C$DW$T$23)
    8875                      .dwattr $C$DW$1041, DW_AT_name("ADCSOCFLG1")
    8876                      .dwattr $C$DW$1041, DW_AT_TI_symbol_name("_ADCSOCFLG1")
    8877                      .dwattr $C$DW$1041, DW_AT_data_member_location[DW_OP_plus_uconst 0x6618]
    8878                      .dwattr $C$DW$1041, DW_AT_accessibility(DW_ACCESS_public)
    8879              $C$DW$1042      .dwtag  DW_TAG_member
    8880                      .dwattr $C$DW$1042, DW_AT_type(*$C$DW$T$23)
    8881                      .dwattr $C$DW$1042, DW_AT_name("rsvd_7")
    8882                      .dwattr $C$DW$1042, DW_AT_TI_symbol_name("_rsvd_7")
    8883                      .dwattr $C$DW$1042, DW_AT_data_member_location[DW_OP_plus_uconst 0x6619]
    8884                      .dwattr $C$DW$1042, DW_AT_accessibility(DW_ACCESS_public)
    8885              $C$DW$1043      .dwtag  DW_TAG_member
    8886                      .dwattr $C$DW$1043, DW_AT_type(*$C$DW$T$23)
    8887                      .dwattr $C$DW$1043, DW_AT_name("ADCSOCFRC1")
    8888                      .dwattr $C$DW$1043, DW_AT_TI_symbol_name("_ADCSOCFRC1")
    8889                      .dwattr $C$DW$1043, DW_AT_data_member_location[DW_OP_plus_uconst 0x661a]
    8890                      .dwattr $C$DW$1043, DW_AT_accessibility(DW_ACCESS_public)
    8891              $C$DW$1044      .dwtag  DW_TAG_member
    8892                      .dwattr $C$DW$1044, DW_AT_type(*$C$DW$T$23)
    8893                      .dwattr $C$DW$1044, DW_AT_name("rsvd_8")
    8894                      .dwattr $C$DW$1044, DW_AT_TI_symbol_name("_rsvd_8")
    8895                      .dwattr $C$DW$1044, DW_AT_data_member_location[DW_OP_plus_uconst 0x661b]
    8896                      .dwattr $C$DW$1044, DW_AT_accessibility(DW_ACCESS_public)
    8897              $C$DW$1045      .dwtag  DW_TAG_member
TMS320C2000 Assembler PC v6.2.5 Thu Nov 23 20:51:03 2017

Tools Copyright (c) 1996-2014 Texas Instruments Incorporated
C:\Users\wmj\AppData\Local\Temp\0886011                              PAGE  172

    8898                      .dwattr $C$DW$1045, DW_AT_type(*$C$DW$T$23)
    8899                      .dwattr $C$DW$1045, DW_AT_name("ADCSOCOVF1")
    8900                      .dwattr $C$DW$1045, DW_AT_TI_symbol_name("_ADCSOCOVF1")
    8901                      .dwattr $C$DW$1045, DW_AT_data_member_location[DW_OP_plus_uconst 0x661c]
    8902                      .dwattr $C$DW$1045, DW_AT_accessibility(DW_ACCESS_public)
    8903              $C$DW$1046      .dwtag  DW_TAG_member
    8904                      .dwattr $C$DW$1046, DW_AT_type(*$C$DW$T$23)
    8905                      .dwattr $C$DW$1046, DW_AT_name("rsvd_9")
    8906                      .dwattr $C$DW$1046, DW_AT_TI_symbol_name("_rsvd_9")
    8907                      .dwattr $C$DW$1046, DW_AT_data_member_location[DW_OP_plus_uconst 0x661d]
    8908                      .dwattr $C$DW$1046, DW_AT_accessibility(DW_ACCESS_public)
    8909              $C$DW$1047      .dwtag  DW_TAG_member
    8910                      .dwattr $C$DW$1047, DW_AT_type(*$C$DW$T$23)
    8911                      .dwattr $C$DW$1047, DW_AT_name("ADCSOCOVFCLR1")
    8912                      .dwattr $C$DW$1047, DW_AT_TI_symbol_name("_ADCSOCOVFCLR1")
    8913                      .dwattr $C$DW$1047, DW_AT_data_member_location[DW_OP_plus_uconst 0x661e]
    8914                      .dwattr $C$DW$1047, DW_AT_accessibility(DW_ACCESS_public)
    8915              $C$DW$1048      .dwtag  DW_TAG_member
    8916                      .dwattr $C$DW$1048, DW_AT_type(*$C$DW$T$23)
    8917                      .dwattr $C$DW$1048, DW_AT_name("rsvd_10")
    8918                      .dwattr $C$DW$1048, DW_AT_TI_symbol_name("_rsvd_10")
    8919                      .dwattr $C$DW$1048, DW_AT_data_member_location[DW_OP_plus_uconst 0x661f]
    8920                      .dwattr $C$DW$1048, DW_AT_accessibility(DW_ACCESS_public)
    8921              $C$DW$1049      .dwtag  DW_TAG_member
    8922                      .dwattr $C$DW$1049, DW_AT_type(*$C$DW$T$24)
    8923                      .dwattr $C$DW$1049, DW_AT_name("ADCSOCxCTL")
    8924                      .dwattr $C$DW$1049, DW_AT_TI_symbol_name("_ADCSOCxCTL")
    8925                      .dwattr $C$DW$1049, DW_AT_data_member_location[DW_OP_plus_uconst 0x6620]
    8926                      .dwattr $C$DW$1049, DW_AT_accessibility(DW_ACCESS_public)
    8927              $C$DW$1050      .dwtag  DW_TAG_member
    8928                      .dwattr $C$DW$1050, DW_AT_type(*$C$DW$T$24)
    8929                      .dwattr $C$DW$1050, DW_AT_name("rsvd_11")
    8930                      .dwattr $C$DW$1050, DW_AT_TI_symbol_name("_rsvd_11")
    8931                      .dwattr $C$DW$1050, DW_AT_data_member_location[DW_OP_plus_uconst 0x6630]
    8932                      .dwattr $C$DW$1050, DW_AT_accessibility(DW_ACCESS_public)
    8933              $C$DW$1051      .dwtag  DW_TAG_member
    8934                      .dwattr $C$DW$1051, DW_AT_type(*$C$DW$T$23)
    8935                      .dwattr $C$DW$1051, DW_AT_name("ADCREFTRIM")
    8936                      .dwattr $C$DW$1051, DW_AT_TI_symbol_name("_ADCREFTRIM")
    8937                      .dwattr $C$DW$1051, DW_AT_data_member_location[DW_OP_plus_uconst 0x6640]
    8938                      .dwattr $C$DW$1051, DW_AT_accessibility(DW_ACCESS_public)
    8939              $C$DW$1052      .dwtag  DW_TAG_member
    8940                      .dwattr $C$DW$1052, DW_AT_type(*$C$DW$T$23)
    8941                      .dwattr $C$DW$1052, DW_AT_name("ADCOFFTRIM")
    8942                      .dwattr $C$DW$1052, DW_AT_TI_symbol_name("_ADCOFFTRIM")
    8943                      .dwattr $C$DW$1052, DW_AT_data_member_location[DW_OP_plus_uconst 0x6641]
    8944                      .dwattr $C$DW$1052, DW_AT_accessibility(DW_ACCESS_public)
    8945              $C$DW$1053      .dwtag  DW_TAG_member
    8946                      .dwattr $C$DW$1053, DW_AT_type(*$C$DW$T$29)
    8947                      .dwattr $C$DW$1053, DW_AT_name("resvd_12")
    8948                      .dwattr $C$DW$1053, DW_AT_TI_symbol_name("_resvd_12")
    8949                      .dwattr $C$DW$1053, DW_AT_data_member_location[DW_OP_plus_uconst 0x6642]
    8950                      .dwattr $C$DW$1053, DW_AT_accessibility(DW_ACCESS_public)
    8951              $C$DW$1054      .dwtag  DW_TAG_member
    8952                      .dwattr $C$DW$1054, DW_AT_type(*$C$DW$T$23)
TMS320C2000 Assembler PC v6.2.5 Thu Nov 23 20:51:03 2017

Tools Copyright (c) 1996-2014 Texas Instruments Incorporated
C:\Users\wmj\AppData\Local\Temp\0886011                              PAGE  173

    8953                      .dwattr $C$DW$1054, DW_AT_name("ADCREV")
    8954                      .dwattr $C$DW$1054, DW_AT_TI_symbol_name("_ADCREV")
    8955                      .dwattr $C$DW$1054, DW_AT_data_member_location[DW_OP_plus_uconst 0x664f]
    8956                      .dwattr $C$DW$1054, DW_AT_accessibility(DW_ACCESS_public)
    8957                      .dwendtag $C$DW$T$30
    8958              
    8959              $C$DW$T$118     .dwtag  DW_TAG_pointer_type
    8960                      .dwattr $C$DW$T$118, DW_AT_type(*$C$DW$T$30)
    8961                      .dwattr $C$DW$T$118, DW_AT_address_class(0x16)
    8962              $C$DW$T$119     .dwtag  DW_TAG_typedef, DW_AT_name("ADC_Handle")
    8963                      .dwattr $C$DW$T$119, DW_AT_type(*$C$DW$T$118)
    8964                      .dwattr $C$DW$T$119, DW_AT_language(DW_LANG_C)
    8965              
    8966              $C$DW$T$34      .dwtag  DW_TAG_structure_type
    8967                      .dwattr $C$DW$T$34, DW_AT_name("_BRAKE_Obj_")
    8968                      .dwattr $C$DW$T$34, DW_AT_byte_size(0x08)
    8969              $C$DW$1055      .dwtag  DW_TAG_member
    8970                      .dwattr $C$DW$1055, DW_AT_type(*$C$DW$T$31)
    8971                      .dwattr $C$DW$1055, DW_AT_name("angle_pu")
    8972                      .dwattr $C$DW$1055, DW_AT_TI_symbol_name("_angle_pu")
    8973                      .dwattr $C$DW$1055, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    8974                      .dwattr $C$DW$1055, DW_AT_accessibility(DW_ACCESS_public)
    8975              $C$DW$1056      .dwtag  DW_TAG_member
    8976                      .dwattr $C$DW$1056, DW_AT_type(*$C$DW$T$32)
    8977                      .dwattr $C$DW$1056, DW_AT_name("Idq_brake")
    8978                      .dwattr $C$DW$1056, DW_AT_TI_symbol_name("_Idq_brake")
    8979                      .dwattr $C$DW$1056, DW_AT_data_member_location[DW_OP_plus_uconst 0x2]
    8980                      .dwattr $C$DW$1056, DW_AT_accessibility(DW_ACCESS_public)
    8981              $C$DW$1057      .dwtag  DW_TAG_member
    8982                      .dwattr $C$DW$1057, DW_AT_type(*$C$DW$T$33)
    8983                      .dwattr $C$DW$1057, DW_AT_name("brake_enable")
    8984                      .dwattr $C$DW$1057, DW_AT_TI_symbol_name("_brake_enable")
    8985                      .dwattr $C$DW$1057, DW_AT_data_member_location[DW_OP_plus_uconst 0x6]
    8986                      .dwattr $C$DW$1057, DW_AT_accessibility(DW_ACCESS_public)
    8987                      .dwendtag $C$DW$T$34
    8988              
    8989              $C$DW$T$73      .dwtag  DW_TAG_typedef, DW_AT_name("BRAKE_Obj")
    8990                      .dwattr $C$DW$T$73, DW_AT_type(*$C$DW$T$34)
    8991                      .dwattr $C$DW$T$73, DW_AT_language(DW_LANG_C)
    8992              $C$DW$T$71      .dwtag  DW_TAG_pointer_type
    8993                      .dwattr $C$DW$T$71, DW_AT_type(*$C$DW$T$34)
    8994                      .dwattr $C$DW$T$71, DW_AT_address_class(0x16)
    8995              $C$DW$T$72      .dwtag  DW_TAG_typedef, DW_AT_name("BRAKE_Handle")
    8996                      .dwattr $C$DW$T$72, DW_AT_type(*$C$DW$T$71)
    8997                      .dwattr $C$DW$T$72, DW_AT_language(DW_LANG_C)
    8998              
    8999              $C$DW$T$36      .dwtag  DW_TAG_structure_type
    9000                      .dwattr $C$DW$T$36, DW_AT_name("_CLARKE_Obj_")
    9001                      .dwattr $C$DW$T$36, DW_AT_byte_size(0x06)
    9002              $C$DW$1058      .dwtag  DW_TAG_member
    9003                      .dwattr $C$DW$1058, DW_AT_type(*$C$DW$T$31)
    9004                      .dwattr $C$DW$1058, DW_AT_name("alpha_sf")
    9005                      .dwattr $C$DW$1058, DW_AT_TI_symbol_name("_alpha_sf")
    9006                      .dwattr $C$DW$1058, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    9007                      .dwattr $C$DW$1058, DW_AT_accessibility(DW_ACCESS_public)
TMS320C2000 Assembler PC v6.2.5 Thu Nov 23 20:51:03 2017

Tools Copyright (c) 1996-2014 Texas Instruments Incorporated
C:\Users\wmj\AppData\Local\Temp\0886011                              PAGE  174

    9008              $C$DW$1059      .dwtag  DW_TAG_member
    9009                      .dwattr $C$DW$1059, DW_AT_type(*$C$DW$T$31)
    9010                      .dwattr $C$DW$1059, DW_AT_name("beta_sf")
    9011                      .dwattr $C$DW$1059, DW_AT_TI_symbol_name("_beta_sf")
    9012                      .dwattr $C$DW$1059, DW_AT_data_member_location[DW_OP_plus_uconst 0x2]
    9013                      .dwattr $C$DW$1059, DW_AT_accessibility(DW_ACCESS_public)
    9014              $C$DW$1060      .dwtag  DW_TAG_member
    9015                      .dwattr $C$DW$1060, DW_AT_type(*$C$DW$T$35)
    9016                      .dwattr $C$DW$1060, DW_AT_name("numSensors")
    9017                      .dwattr $C$DW$1060, DW_AT_TI_symbol_name("_numSensors")
    9018                      .dwattr $C$DW$1060, DW_AT_data_member_location[DW_OP_plus_uconst 0x4]
    9019                      .dwattr $C$DW$1060, DW_AT_accessibility(DW_ACCESS_public)
    9020                      .dwendtag $C$DW$T$36
    9021              
    9022              $C$DW$T$47      .dwtag  DW_TAG_typedef, DW_AT_name("CLARKE_Obj")
    9023                      .dwattr $C$DW$T$47, DW_AT_type(*$C$DW$T$36)
    9024                      .dwattr $C$DW$T$47, DW_AT_language(DW_LANG_C)
    9025              $C$DW$T$45      .dwtag  DW_TAG_pointer_type
    9026                      .dwattr $C$DW$T$45, DW_AT_type(*$C$DW$T$36)
    9027                      .dwattr $C$DW$T$45, DW_AT_address_class(0x16)
    9028              $C$DW$T$46      .dwtag  DW_TAG_typedef, DW_AT_name("CLARKE_Handle")
    9029                      .dwattr $C$DW$T$46, DW_AT_type(*$C$DW$T$45)
    9030                      .dwattr $C$DW$T$46, DW_AT_language(DW_LANG_C)
    9031              
    9032              $C$DW$T$38      .dwtag  DW_TAG_structure_type
    9033                      .dwattr $C$DW$T$38, DW_AT_name("_CLK_Obj_")
    9034                      .dwattr $C$DW$T$38, DW_AT_byte_size(0x11)
    9035              $C$DW$1061      .dwtag  DW_TAG_member
    9036                      .dwattr $C$DW$1061, DW_AT_type(*$C$DW$T$23)
    9037                      .dwattr $C$DW$1061, DW_AT_name("XCLK")
    9038                      .dwattr $C$DW$1061, DW_AT_TI_symbol_name("_XCLK")
    9039                      .dwattr $C$DW$1061, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    9040                      .dwattr $C$DW$1061, DW_AT_accessibility(DW_ACCESS_public)
    9041              $C$DW$1062      .dwtag  DW_TAG_member
    9042                      .dwattr $C$DW$1062, DW_AT_type(*$C$DW$T$23)
    9043                      .dwattr $C$DW$1062, DW_AT_name("rsvd_1")
    9044                      .dwattr $C$DW$1062, DW_AT_TI_symbol_name("_rsvd_1")
    9045                      .dwattr $C$DW$1062, DW_AT_data_member_location[DW_OP_plus_uconst 0x1]
    9046                      .dwattr $C$DW$1062, DW_AT_accessibility(DW_ACCESS_public)
    9047              $C$DW$1063      .dwtag  DW_TAG_member
    9048                      .dwattr $C$DW$1063, DW_AT_type(*$C$DW$T$23)
    9049                      .dwattr $C$DW$1063, DW_AT_name("CLKCTL")
    9050                      .dwattr $C$DW$1063, DW_AT_TI_symbol_name("_CLKCTL")
    9051                      .dwattr $C$DW$1063, DW_AT_data_member_location[DW_OP_plus_uconst 0x2]
    9052                      .dwattr $C$DW$1063, DW_AT_accessibility(DW_ACCESS_public)
    9053              $C$DW$1064      .dwtag  DW_TAG_member
    9054                      .dwattr $C$DW$1064, DW_AT_type(*$C$DW$T$37)
    9055                      .dwattr $C$DW$1064, DW_AT_name("rsvd_2")
    9056                      .dwattr $C$DW$1064, DW_AT_TI_symbol_name("_rsvd_2")
    9057                      .dwattr $C$DW$1064, DW_AT_data_member_location[DW_OP_plus_uconst 0x3]
    9058                      .dwattr $C$DW$1064, DW_AT_accessibility(DW_ACCESS_public)
    9059              $C$DW$1065      .dwtag  DW_TAG_member
    9060                      .dwattr $C$DW$1065, DW_AT_type(*$C$DW$T$23)
    9061                      .dwattr $C$DW$1065, DW_AT_name("LOSPCP")
    9062                      .dwattr $C$DW$1065, DW_AT_TI_symbol_name("_LOSPCP")
TMS320C2000 Assembler PC v6.2.5 Thu Nov 23 20:51:03 2017

Tools Copyright (c) 1996-2014 Texas Instruments Incorporated
C:\Users\wmj\AppData\Local\Temp\0886011                              PAGE  175

    9063                      .dwattr $C$DW$1065, DW_AT_data_member_location[DW_OP_plus_uconst 0xb]
    9064                      .dwattr $C$DW$1065, DW_AT_accessibility(DW_ACCESS_public)
    9065              $C$DW$1066      .dwtag  DW_TAG_member
    9066                      .dwattr $C$DW$1066, DW_AT_type(*$C$DW$T$23)
    9067                      .dwattr $C$DW$1066, DW_AT_name("PCLKCR0")
    9068                      .dwattr $C$DW$1066, DW_AT_TI_symbol_name("_PCLKCR0")
    9069                      .dwattr $C$DW$1066, DW_AT_data_member_location[DW_OP_plus_uconst 0xc]
    9070                      .dwattr $C$DW$1066, DW_AT_accessibility(DW_ACCESS_public)
    9071              $C$DW$1067      .dwtag  DW_TAG_member
    9072                      .dwattr $C$DW$1067, DW_AT_type(*$C$DW$T$23)
    9073                      .dwattr $C$DW$1067, DW_AT_name("PCLKCR1")
    9074                      .dwattr $C$DW$1067, DW_AT_TI_symbol_name("_PCLKCR1")
    9075                      .dwattr $C$DW$1067, DW_AT_data_member_location[DW_OP_plus_uconst 0xd]
    9076                      .dwattr $C$DW$1067, DW_AT_accessibility(DW_ACCESS_public)
    9077              $C$DW$1068      .dwtag  DW_TAG_member
    9078                      .dwattr $C$DW$1068, DW_AT_type(*$C$DW$T$26)
    9079                      .dwattr $C$DW$1068, DW_AT_name("rsvd_3")
    9080                      .dwattr $C$DW$1068, DW_AT_TI_symbol_name("_rsvd_3")
    9081                      .dwattr $C$DW$1068, DW_AT_data_member_location[DW_OP_plus_uconst 0xe]
    9082                      .dwattr $C$DW$1068, DW_AT_accessibility(DW_ACCESS_public)
    9083              $C$DW$1069      .dwtag  DW_TAG_member
    9084                      .dwattr $C$DW$1069, DW_AT_type(*$C$DW$T$23)
    9085                      .dwattr $C$DW$1069, DW_AT_name("PCLKCR3")
    9086                      .dwattr $C$DW$1069, DW_AT_TI_symbol_name("_PCLKCR3")
    9087                      .dwattr $C$DW$1069, DW_AT_data_member_location[DW_OP_plus_uconst 0x10]
    9088                      .dwattr $C$DW$1069, DW_AT_accessibility(DW_ACCESS_public)
    9089                      .dwendtag $C$DW$T$38
    9090              
    9091              $C$DW$T$120     .dwtag  DW_TAG_pointer_type
    9092                      .dwattr $C$DW$T$120, DW_AT_type(*$C$DW$T$38)
    9093                      .dwattr $C$DW$T$120, DW_AT_address_class(0x16)
    9094              $C$DW$T$121     .dwtag  DW_TAG_typedef, DW_AT_name("CLK_Handle")
    9095                      .dwattr $C$DW$T$121, DW_AT_type(*$C$DW$T$120)
    9096                      .dwattr $C$DW$T$121, DW_AT_language(DW_LANG_C)
    9097              
    9098              $C$DW$T$39      .dwtag  DW_TAG_structure_type
    9099                      .dwattr $C$DW$T$39, DW_AT_name("_CPU_Obj_")
    9100                      .dwattr $C$DW$T$39, DW_AT_byte_size(0x01)
    9101              $C$DW$1070      .dwtag  DW_TAG_member
    9102                      .dwattr $C$DW$1070, DW_AT_type(*$C$DW$T$35)
    9103                      .dwattr $C$DW$1070, DW_AT_name("tmp")
    9104                      .dwattr $C$DW$1070, DW_AT_TI_symbol_name("_tmp")
    9105                      .dwattr $C$DW$1070, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    9106                      .dwattr $C$DW$1070, DW_AT_accessibility(DW_ACCESS_public)
    9107                      .dwendtag $C$DW$T$39
    9108              
    9109              $C$DW$T$122     .dwtag  DW_TAG_pointer_type
    9110                      .dwattr $C$DW$T$122, DW_AT_type(*$C$DW$T$39)
    9111                      .dwattr $C$DW$T$122, DW_AT_address_class(0x16)
    9112              $C$DW$T$123     .dwtag  DW_TAG_typedef, DW_AT_name("CPU_Handle")
    9113                      .dwattr $C$DW$T$123, DW_AT_type(*$C$DW$T$122)
    9114                      .dwattr $C$DW$T$123, DW_AT_language(DW_LANG_C)
    9115              
    9116              $C$DW$T$74      .dwtag  DW_TAG_structure_type
    9117                      .dwattr $C$DW$T$74, DW_AT_name("_CTRL_Obj_")
TMS320C2000 Assembler PC v6.2.5 Thu Nov 23 20:51:03 2017

Tools Copyright (c) 1996-2014 Texas Instruments Incorporated
C:\Users\wmj\AppData\Local\Temp\0886011                              PAGE  176

    9118                      .dwattr $C$DW$T$74, DW_AT_byte_size(0x10a)
    9119              $C$DW$1071      .dwtag  DW_TAG_member
    9120                      .dwattr $C$DW$1071, DW_AT_type(*$C$DW$T$40)
    9121                      .dwattr $C$DW$1071, DW_AT_name("version")
    9122                      .dwattr $C$DW$1071, DW_AT_TI_symbol_name("_version")
    9123                      .dwattr $C$DW$1071, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    9124                      .dwattr $C$DW$1071, DW_AT_accessibility(DW_ACCESS_public)
    9125              $C$DW$1072      .dwtag  DW_TAG_member
    9126                      .dwattr $C$DW$1072, DW_AT_type(*$C$DW$T$42)
    9127                      .dwattr $C$DW$1072, DW_AT_name("state")
    9128                      .dwattr $C$DW$1072, DW_AT_TI_symbol_name("_state")
    9129                      .dwattr $C$DW$1072, DW_AT_data_member_location[DW_OP_plus_uconst 0x4]
    9130                      .dwattr $C$DW$1072, DW_AT_accessibility(DW_ACCESS_public)
    9131              $C$DW$1073      .dwtag  DW_TAG_member
    9132                      .dwattr $C$DW$1073, DW_AT_type(*$C$DW$T$42)
    9133                      .dwattr $C$DW$1073, DW_AT_name("prevState")
    9134                      .dwattr $C$DW$1073, DW_AT_TI_symbol_name("_prevState")
    9135                      .dwattr $C$DW$1073, DW_AT_data_member_location[DW_OP_plus_uconst 0x5]
    9136                      .dwattr $C$DW$1073, DW_AT_accessibility(DW_ACCESS_public)
    9137              $C$DW$1074      .dwtag  DW_TAG_member
    9138                      .dwattr $C$DW$1074, DW_AT_type(*$C$DW$T$44)
    9139                      .dwattr $C$DW$1074, DW_AT_name("errorCode")
    9140                      .dwattr $C$DW$1074, DW_AT_TI_symbol_name("_errorCode")
    9141                      .dwattr $C$DW$1074, DW_AT_data_member_location[DW_OP_plus_uconst 0x6]
    9142                      .dwattr $C$DW$1074, DW_AT_accessibility(DW_ACCESS_public)
    9143              $C$DW$1075      .dwtag  DW_TAG_member
    9144                      .dwattr $C$DW$1075, DW_AT_type(*$C$DW$T$46)
    9145                      .dwattr $C$DW$1075, DW_AT_name("clarkeHandle_I")
    9146                      .dwattr $C$DW$1075, DW_AT_TI_symbol_name("_clarkeHandle_I")
    9147                      .dwattr $C$DW$1075, DW_AT_data_member_location[DW_OP_plus_uconst 0x8]
    9148                      .dwattr $C$DW$1075, DW_AT_accessibility(DW_ACCESS_public)
    9149              $C$DW$1076      .dwtag  DW_TAG_member
    9150                      .dwattr $C$DW$1076, DW_AT_type(*$C$DW$T$47)
    9151                      .dwattr $C$DW$1076, DW_AT_name("clarke_I")
    9152                      .dwattr $C$DW$1076, DW_AT_TI_symbol_name("_clarke_I")
    9153                      .dwattr $C$DW$1076, DW_AT_data_member_location[DW_OP_plus_uconst 0xa]
    9154                      .dwattr $C$DW$1076, DW_AT_accessibility(DW_ACCESS_public)
    9155              $C$DW$1077      .dwtag  DW_TAG_member
    9156                      .dwattr $C$DW$1077, DW_AT_type(*$C$DW$T$46)
    9157                      .dwattr $C$DW$1077, DW_AT_name("clarkeHandle_V")
    9158                      .dwattr $C$DW$1077, DW_AT_TI_symbol_name("_clarkeHandle_V")
    9159                      .dwattr $C$DW$1077, DW_AT_data_member_location[DW_OP_plus_uconst 0x10]
    9160                      .dwattr $C$DW$1077, DW_AT_accessibility(DW_ACCESS_public)
    9161              $C$DW$1078      .dwtag  DW_TAG_member
    9162                      .dwattr $C$DW$1078, DW_AT_type(*$C$DW$T$47)
    9163                      .dwattr $C$DW$1078, DW_AT_name("clarke_V")
    9164                      .dwattr $C$DW$1078, DW_AT_TI_symbol_name("_clarke_V")
    9165                      .dwattr $C$DW$1078, DW_AT_data_member_location[DW_OP_plus_uconst 0x12]
    9166                      .dwattr $C$DW$1078, DW_AT_accessibility(DW_ACCESS_public)
    9167              $C$DW$1079      .dwtag  DW_TAG_member
    9168                      .dwattr $C$DW$1079, DW_AT_type(*$C$DW$T$49)
    9169                      .dwattr $C$DW$1079, DW_AT_name("estHandle")
    9170                      .dwattr $C$DW$1079, DW_AT_TI_symbol_name("_estHandle")
    9171                      .dwattr $C$DW$1079, DW_AT_data_member_location[DW_OP_plus_uconst 0x18]
    9172                      .dwattr $C$DW$1079, DW_AT_accessibility(DW_ACCESS_public)
TMS320C2000 Assembler PC v6.2.5 Thu Nov 23 20:51:03 2017

Tools Copyright (c) 1996-2014 Texas Instruments Incorporated
C:\Users\wmj\AppData\Local\Temp\0886011                              PAGE  177

    9173              $C$DW$1080      .dwtag  DW_TAG_member
    9174                      .dwattr $C$DW$1080, DW_AT_type(*$C$DW$T$51)
    9175                      .dwattr $C$DW$1080, DW_AT_name("parkHandle")
    9176                      .dwattr $C$DW$1080, DW_AT_TI_symbol_name("_parkHandle")
    9177                      .dwattr $C$DW$1080, DW_AT_data_member_location[DW_OP_plus_uconst 0x1a]
    9178                      .dwattr $C$DW$1080, DW_AT_accessibility(DW_ACCESS_public)
    9179              $C$DW$1081      .dwtag  DW_TAG_member
    9180                      .dwattr $C$DW$1081, DW_AT_type(*$C$DW$T$52)
    9181                      .dwattr $C$DW$1081, DW_AT_name("park")
    9182                      .dwattr $C$DW$1081, DW_AT_TI_symbol_name("_park")
    9183                      .dwattr $C$DW$1081, DW_AT_data_member_location[DW_OP_plus_uconst 0x1c]
    9184                      .dwattr $C$DW$1081, DW_AT_accessibility(DW_ACCESS_public)
    9185              $C$DW$1082      .dwtag  DW_TAG_member
    9186                      .dwattr $C$DW$1082, DW_AT_type(*$C$DW$T$54)
    9187                      .dwattr $C$DW$1082, DW_AT_name("pidHandle_Id")
    9188                      .dwattr $C$DW$1082, DW_AT_TI_symbol_name("_pidHandle_Id")
    9189                      .dwattr $C$DW$1082, DW_AT_data_member_location[DW_OP_plus_uconst 0x20]
    9190                      .dwattr $C$DW$1082, DW_AT_accessibility(DW_ACCESS_public)
    9191              $C$DW$1083      .dwtag  DW_TAG_member
    9192                      .dwattr $C$DW$1083, DW_AT_type(*$C$DW$T$55)
    9193                      .dwattr $C$DW$1083, DW_AT_name("pid_Id")
    9194                      .dwattr $C$DW$1083, DW_AT_TI_symbol_name("_pid_Id")
    9195                      .dwattr $C$DW$1083, DW_AT_data_member_location[DW_OP_plus_uconst 0x22]
    9196                      .dwattr $C$DW$1083, DW_AT_accessibility(DW_ACCESS_public)
    9197              $C$DW$1084      .dwtag  DW_TAG_member
    9198                      .dwattr $C$DW$1084, DW_AT_type(*$C$DW$T$54)
    9199                      .dwattr $C$DW$1084, DW_AT_name("pidHandle_Iq")
    9200                      .dwattr $C$DW$1084, DW_AT_TI_symbol_name("_pidHandle_Iq")
    9201                      .dwattr $C$DW$1084, DW_AT_data_member_location[DW_OP_plus_uconst 0x32]
    9202                      .dwattr $C$DW$1084, DW_AT_accessibility(DW_ACCESS_public)
    9203              $C$DW$1085      .dwtag  DW_TAG_member
    9204                      .dwattr $C$DW$1085, DW_AT_type(*$C$DW$T$55)
    9205                      .dwattr $C$DW$1085, DW_AT_name("pid_Iq")
    9206                      .dwattr $C$DW$1085, DW_AT_TI_symbol_name("_pid_Iq")
    9207                      .dwattr $C$DW$1085, DW_AT_data_member_location[DW_OP_plus_uconst 0x34]
    9208                      .dwattr $C$DW$1085, DW_AT_accessibility(DW_ACCESS_public)
    9209              $C$DW$1086      .dwtag  DW_TAG_member
    9210                      .dwattr $C$DW$1086, DW_AT_type(*$C$DW$T$54)
    9211                      .dwattr $C$DW$1086, DW_AT_name("pidHandle_spd")
    9212                      .dwattr $C$DW$1086, DW_AT_TI_symbol_name("_pidHandle_spd")
    9213                      .dwattr $C$DW$1086, DW_AT_data_member_location[DW_OP_plus_uconst 0x44]
    9214                      .dwattr $C$DW$1086, DW_AT_accessibility(DW_ACCESS_public)
    9215              $C$DW$1087      .dwtag  DW_TAG_member
    9216                      .dwattr $C$DW$1087, DW_AT_type(*$C$DW$T$55)
    9217                      .dwattr $C$DW$1087, DW_AT_name("pid_spd")
    9218                      .dwattr $C$DW$1087, DW_AT_TI_symbol_name("_pid_spd")
    9219                      .dwattr $C$DW$1087, DW_AT_data_member_location[DW_OP_plus_uconst 0x46]
    9220                      .dwattr $C$DW$1087, DW_AT_accessibility(DW_ACCESS_public)
    9221              $C$DW$1088      .dwtag  DW_TAG_member
    9222                      .dwattr $C$DW$1088, DW_AT_type(*$C$DW$T$57)
    9223                      .dwattr $C$DW$1088, DW_AT_name("iparkHandle")
    9224                      .dwattr $C$DW$1088, DW_AT_TI_symbol_name("_iparkHandle")
    9225                      .dwattr $C$DW$1088, DW_AT_data_member_location[DW_OP_plus_uconst 0x56]
    9226                      .dwattr $C$DW$1088, DW_AT_accessibility(DW_ACCESS_public)
    9227              $C$DW$1089      .dwtag  DW_TAG_member
TMS320C2000 Assembler PC v6.2.5 Thu Nov 23 20:51:03 2017

Tools Copyright (c) 1996-2014 Texas Instruments Incorporated
C:\Users\wmj\AppData\Local\Temp\0886011                              PAGE  178

    9228                      .dwattr $C$DW$1089, DW_AT_type(*$C$DW$T$58)
    9229                      .dwattr $C$DW$1089, DW_AT_name("ipark")
    9230                      .dwattr $C$DW$1089, DW_AT_TI_symbol_name("_ipark")
    9231                      .dwattr $C$DW$1089, DW_AT_data_member_location[DW_OP_plus_uconst 0x58]
    9232                      .dwattr $C$DW$1089, DW_AT_accessibility(DW_ACCESS_public)
    9233              $C$DW$1090      .dwtag  DW_TAG_member
    9234                      .dwattr $C$DW$1090, DW_AT_type(*$C$DW$T$60)
    9235                      .dwattr $C$DW$1090, DW_AT_name("svgenHandle")
    9236                      .dwattr $C$DW$1090, DW_AT_TI_symbol_name("_svgenHandle")
    9237                      .dwattr $C$DW$1090, DW_AT_data_member_location[DW_OP_plus_uconst 0x5c]
    9238                      .dwattr $C$DW$1090, DW_AT_accessibility(DW_ACCESS_public)
    9239              $C$DW$1091      .dwtag  DW_TAG_member
    9240                      .dwattr $C$DW$1091, DW_AT_type(*$C$DW$T$61)
    9241                      .dwattr $C$DW$1091, DW_AT_name("svgen")
    9242                      .dwattr $C$DW$1091, DW_AT_TI_symbol_name("_svgen")
    9243                      .dwattr $C$DW$1091, DW_AT_data_member_location[DW_OP_plus_uconst 0x5e]
    9244                      .dwattr $C$DW$1091, DW_AT_accessibility(DW_ACCESS_public)
    9245              $C$DW$1092      .dwtag  DW_TAG_member
    9246                      .dwattr $C$DW$1092, DW_AT_type(*$C$DW$T$63)
    9247                      .dwattr $C$DW$1092, DW_AT_name("trajHandle_Id")
    9248                      .dwattr $C$DW$1092, DW_AT_TI_symbol_name("_trajHandle_Id")
    9249                      .dwattr $C$DW$1092, DW_AT_data_member_location[DW_OP_plus_uconst 0x60]
    9250                      .dwattr $C$DW$1092, DW_AT_accessibility(DW_ACCESS_public)
    9251              $C$DW$1093      .dwtag  DW_TAG_member
    9252                      .dwattr $C$DW$1093, DW_AT_type(*$C$DW$T$64)
    9253                      .dwattr $C$DW$1093, DW_AT_name("traj_Id")
    9254                      .dwattr $C$DW$1093, DW_AT_TI_symbol_name("_traj_Id")
    9255                      .dwattr $C$DW$1093, DW_AT_data_member_location[DW_OP_plus_uconst 0x62]
    9256                      .dwattr $C$DW$1093, DW_AT_accessibility(DW_ACCESS_public)
    9257              $C$DW$1094      .dwtag  DW_TAG_member
    9258                      .dwattr $C$DW$1094, DW_AT_type(*$C$DW$T$63)
    9259                      .dwattr $C$DW$1094, DW_AT_name("trajHandle_spd")
    9260                      .dwattr $C$DW$1094, DW_AT_TI_symbol_name("_trajHandle_spd")
    9261                      .dwattr $C$DW$1094, DW_AT_data_member_location[DW_OP_plus_uconst 0x6c]
    9262                      .dwattr $C$DW$1094, DW_AT_accessibility(DW_ACCESS_public)
    9263              $C$DW$1095      .dwtag  DW_TAG_member
    9264                      .dwattr $C$DW$1095, DW_AT_type(*$C$DW$T$64)
    9265                      .dwattr $C$DW$1095, DW_AT_name("traj_spd")
    9266                      .dwattr $C$DW$1095, DW_AT_TI_symbol_name("_traj_spd")
    9267                      .dwattr $C$DW$1095, DW_AT_data_member_location[DW_OP_plus_uconst 0x6e]
    9268                      .dwattr $C$DW$1095, DW_AT_accessibility(DW_ACCESS_public)
    9269              $C$DW$1096      .dwtag  DW_TAG_member
    9270                      .dwattr $C$DW$1096, DW_AT_type(*$C$DW$T$63)
    9271                      .dwattr $C$DW$1096, DW_AT_name("trajHandle_spdMax")
    9272                      .dwattr $C$DW$1096, DW_AT_TI_symbol_name("_trajHandle_spdMax")
    9273                      .dwattr $C$DW$1096, DW_AT_data_member_location[DW_OP_plus_uconst 0x78]
    9274                      .dwattr $C$DW$1096, DW_AT_accessibility(DW_ACCESS_public)
    9275              $C$DW$1097      .dwtag  DW_TAG_member
    9276                      .dwattr $C$DW$1097, DW_AT_type(*$C$DW$T$64)
    9277                      .dwattr $C$DW$1097, DW_AT_name("traj_spdMax")
    9278                      .dwattr $C$DW$1097, DW_AT_TI_symbol_name("_traj_spdMax")
    9279                      .dwattr $C$DW$1097, DW_AT_data_member_location[DW_OP_plus_uconst 0x7a]
    9280                      .dwattr $C$DW$1097, DW_AT_accessibility(DW_ACCESS_public)
    9281              $C$DW$1098      .dwtag  DW_TAG_member
    9282                      .dwattr $C$DW$1098, DW_AT_type(*$C$DW$T$65)
TMS320C2000 Assembler PC v6.2.5 Thu Nov 23 20:51:03 2017

Tools Copyright (c) 1996-2014 Texas Instruments Incorporated
C:\Users\wmj\AppData\Local\Temp\0886011                              PAGE  179

    9283                      .dwattr $C$DW$1098, DW_AT_name("motorParams")
    9284                      .dwattr $C$DW$1098, DW_AT_TI_symbol_name("_motorParams")
    9285                      .dwattr $C$DW$1098, DW_AT_data_member_location[DW_OP_plus_uconst 0x84]
    9286                      .dwattr $C$DW$1098, DW_AT_accessibility(DW_ACCESS_public)
    9287              $C$DW$1099      .dwtag  DW_TAG_member
    9288                      .dwattr $C$DW$1099, DW_AT_type(*$C$DW$T$68)
    9289                      .dwattr $C$DW$1099, DW_AT_name("waitTimes")
    9290                      .dwattr $C$DW$1099, DW_AT_TI_symbol_name("_waitTimes")
    9291                      .dwattr $C$DW$1099, DW_AT_data_member_location[DW_OP_plus_uconst 0x92]
    9292                      .dwattr $C$DW$1099, DW_AT_accessibility(DW_ACCESS_public)
    9293              $C$DW$1100      .dwtag  DW_TAG_member
    9294                      .dwattr $C$DW$1100, DW_AT_type(*$C$DW$T$67)
    9295                      .dwattr $C$DW$1100, DW_AT_name("counter_state")
    9296                      .dwattr $C$DW$1100, DW_AT_TI_symbol_name("_counter_state")
    9297                      .dwattr $C$DW$1100, DW_AT_data_member_location[DW_OP_plus_uconst 0x9a]
    9298                      .dwattr $C$DW$1100, DW_AT_accessibility(DW_ACCESS_public)
    9299              $C$DW$1101      .dwtag  DW_TAG_member
    9300                      .dwattr $C$DW$1101, DW_AT_type(*$C$DW$T$69)
    9301                      .dwattr $C$DW$1101, DW_AT_name("numIsrTicksPerCtrlTick")
    9302                      .dwattr $C$DW$1101, DW_AT_TI_symbol_name("_numIsrTicksPerCtrlTick")
    9303                      .dwattr $C$DW$1101, DW_AT_data_member_location[DW_OP_plus_uconst 0x9c]
    9304                      .dwattr $C$DW$1101, DW_AT_accessibility(DW_ACCESS_public)
    9305              $C$DW$1102      .dwtag  DW_TAG_member
    9306                      .dwattr $C$DW$1102, DW_AT_type(*$C$DW$T$69)
    9307                      .dwattr $C$DW$1102, DW_AT_name("numCtrlTicksPerCurrentTick")
    9308                      .dwattr $C$DW$1102, DW_AT_TI_symbol_name("_numCtrlTicksPerCurrentTick")
    9309                      .dwattr $C$DW$1102, DW_AT_data_member_location[DW_OP_plus_uconst 0x9d]
    9310                      .dwattr $C$DW$1102, DW_AT_accessibility(DW_ACCESS_public)
    9311              $C$DW$1103      .dwtag  DW_TAG_member
    9312                      .dwattr $C$DW$1103, DW_AT_type(*$C$DW$T$69)
    9313                      .dwattr $C$DW$1103, DW_AT_name("numCtrlTicksPerSpeedTick")
    9314                      .dwattr $C$DW$1103, DW_AT_TI_symbol_name("_numCtrlTicksPerSpeedTick")
    9315                      .dwattr $C$DW$1103, DW_AT_data_member_location[DW_OP_plus_uconst 0x9e]
    9316                      .dwattr $C$DW$1103, DW_AT_accessibility(DW_ACCESS_public)
    9317              $C$DW$1104      .dwtag  DW_TAG_member
    9318                      .dwattr $C$DW$1104, DW_AT_type(*$C$DW$T$69)
    9319                      .dwattr $C$DW$1104, DW_AT_name("numCtrlTicksPerTrajTick")
    9320                      .dwattr $C$DW$1104, DW_AT_TI_symbol_name("_numCtrlTicksPerTrajTick")
    9321                      .dwattr $C$DW$1104, DW_AT_data_member_location[DW_OP_plus_uconst 0x9f]
    9322                      .dwattr $C$DW$1104, DW_AT_accessibility(DW_ACCESS_public)
    9323              $C$DW$1105      .dwtag  DW_TAG_member
    9324                      .dwattr $C$DW$1105, DW_AT_type(*$C$DW$T$67)
    9325                      .dwattr $C$DW$1105, DW_AT_name("ctrlFreq_Hz")
    9326                      .dwattr $C$DW$1105, DW_AT_TI_symbol_name("_ctrlFreq_Hz")
    9327                      .dwattr $C$DW$1105, DW_AT_data_member_location[DW_OP_plus_uconst 0xa0]
    9328                      .dwattr $C$DW$1105, DW_AT_accessibility(DW_ACCESS_public)
    9329              $C$DW$1106      .dwtag  DW_TAG_member
    9330                      .dwattr $C$DW$1106, DW_AT_type(*$C$DW$T$67)
    9331                      .dwattr $C$DW$1106, DW_AT_name("trajFreq_Hz")
    9332                      .dwattr $C$DW$1106, DW_AT_TI_symbol_name("_trajFreq_Hz")
    9333                      .dwattr $C$DW$1106, DW_AT_data_member_location[DW_OP_plus_uconst 0xa2]
    9334                      .dwattr $C$DW$1106, DW_AT_accessibility(DW_ACCESS_public)
    9335              $C$DW$1107      .dwtag  DW_TAG_member
    9336                      .dwattr $C$DW$1107, DW_AT_type(*$C$DW$T$31)
    9337                      .dwattr $C$DW$1107, DW_AT_name("trajPeriod_sec")
TMS320C2000 Assembler PC v6.2.5 Thu Nov 23 20:51:03 2017

Tools Copyright (c) 1996-2014 Texas Instruments Incorporated
C:\Users\wmj\AppData\Local\Temp\0886011                              PAGE  180

    9338                      .dwattr $C$DW$1107, DW_AT_TI_symbol_name("_trajPeriod_sec")
    9339                      .dwattr $C$DW$1107, DW_AT_data_member_location[DW_OP_plus_uconst 0xa4]
    9340                      .dwattr $C$DW$1107, DW_AT_accessibility(DW_ACCESS_public)
    9341              $C$DW$1108      .dwtag  DW_TAG_member
    9342                      .dwattr $C$DW$1108, DW_AT_type(*$C$DW$T$70)
    9343                      .dwattr $C$DW$1108, DW_AT_name("ctrlPeriod_sec")
    9344                      .dwattr $C$DW$1108, DW_AT_TI_symbol_name("_ctrlPeriod_sec")
    9345                      .dwattr $C$DW$1108, DW_AT_data_member_location[DW_OP_plus_uconst 0xa6]
    9346                      .dwattr $C$DW$1108, DW_AT_accessibility(DW_ACCESS_public)
    9347              $C$DW$1109      .dwtag  DW_TAG_member
    9348                      .dwattr $C$DW$1109, DW_AT_type(*$C$DW$T$31)
    9349                      .dwattr $C$DW$1109, DW_AT_name("maxVsMag_pu")
    9350                      .dwattr $C$DW$1109, DW_AT_TI_symbol_name("_maxVsMag_pu")
    9351                      .dwattr $C$DW$1109, DW_AT_data_member_location[DW_OP_plus_uconst 0xa8]
    9352                      .dwattr $C$DW$1109, DW_AT_accessibility(DW_ACCESS_public)
    9353              $C$DW$1110      .dwtag  DW_TAG_member
    9354                      .dwattr $C$DW$1110, DW_AT_type(*$C$DW$T$32)
    9355                      .dwattr $C$DW$1110, DW_AT_name("Iab_in")
    9356                      .dwattr $C$DW$1110, DW_AT_TI_symbol_name("_Iab_in")
    9357                      .dwattr $C$DW$1110, DW_AT_data_member_location[DW_OP_plus_uconst 0xaa]
    9358                      .dwattr $C$DW$1110, DW_AT_accessibility(DW_ACCESS_public)
    9359              $C$DW$1111      .dwtag  DW_TAG_member
    9360                      .dwattr $C$DW$1111, DW_AT_type(*$C$DW$T$32)
    9361                      .dwattr $C$DW$1111, DW_AT_name("Iab_filt")
    9362                      .dwattr $C$DW$1111, DW_AT_TI_symbol_name("_Iab_filt")
    9363                      .dwattr $C$DW$1111, DW_AT_data_member_location[DW_OP_plus_uconst 0xae]
    9364                      .dwattr $C$DW$1111, DW_AT_accessibility(DW_ACCESS_public)
    9365              $C$DW$1112      .dwtag  DW_TAG_member
    9366                      .dwattr $C$DW$1112, DW_AT_type(*$C$DW$T$32)
    9367                      .dwattr $C$DW$1112, DW_AT_name("Idq_in")
    9368                      .dwattr $C$DW$1112, DW_AT_TI_symbol_name("_Idq_in")
    9369                      .dwattr $C$DW$1112, DW_AT_data_member_location[DW_OP_plus_uconst 0xb2]
    9370                      .dwattr $C$DW$1112, DW_AT_accessibility(DW_ACCESS_public)
    9371              $C$DW$1113      .dwtag  DW_TAG_member
    9372                      .dwattr $C$DW$1113, DW_AT_type(*$C$DW$T$32)
    9373                      .dwattr $C$DW$1113, DW_AT_name("Vab_in")
    9374                      .dwattr $C$DW$1113, DW_AT_TI_symbol_name("_Vab_in")
    9375                      .dwattr $C$DW$1113, DW_AT_data_member_location[DW_OP_plus_uconst 0xb6]
    9376                      .dwattr $C$DW$1113, DW_AT_accessibility(DW_ACCESS_public)
    9377              $C$DW$1114      .dwtag  DW_TAG_member
    9378                      .dwattr $C$DW$1114, DW_AT_type(*$C$DW$T$31)
    9379                      .dwattr $C$DW$1114, DW_AT_name("spd_out")
    9380                      .dwattr $C$DW$1114, DW_AT_TI_symbol_name("_spd_out")
    9381                      .dwattr $C$DW$1114, DW_AT_data_member_location[DW_OP_plus_uconst 0xba]
    9382                      .dwattr $C$DW$1114, DW_AT_accessibility(DW_ACCESS_public)
    9383              $C$DW$1115      .dwtag  DW_TAG_member
    9384                      .dwattr $C$DW$1115, DW_AT_type(*$C$DW$T$32)
    9385                      .dwattr $C$DW$1115, DW_AT_name("Vab_out")
    9386                      .dwattr $C$DW$1115, DW_AT_TI_symbol_name("_Vab_out")
    9387                      .dwattr $C$DW$1115, DW_AT_data_member_location[DW_OP_plus_uconst 0xbc]
    9388                      .dwattr $C$DW$1115, DW_AT_accessibility(DW_ACCESS_public)
    9389              $C$DW$1116      .dwtag  DW_TAG_member
    9390                      .dwattr $C$DW$1116, DW_AT_type(*$C$DW$T$32)
    9391                      .dwattr $C$DW$1116, DW_AT_name("Vdq_out")
    9392                      .dwattr $C$DW$1116, DW_AT_TI_symbol_name("_Vdq_out")
TMS320C2000 Assembler PC v6.2.5 Thu Nov 23 20:51:03 2017

Tools Copyright (c) 1996-2014 Texas Instruments Incorporated
C:\Users\wmj\AppData\Local\Temp\0886011                              PAGE  181

    9393                      .dwattr $C$DW$1116, DW_AT_data_member_location[DW_OP_plus_uconst 0xc0]
    9394                      .dwattr $C$DW$1116, DW_AT_accessibility(DW_ACCESS_public)
    9395              $C$DW$1117      .dwtag  DW_TAG_member
    9396                      .dwattr $C$DW$1117, DW_AT_type(*$C$DW$T$70)
    9397                      .dwattr $C$DW$1117, DW_AT_name("Rhf")
    9398                      .dwattr $C$DW$1117, DW_AT_TI_symbol_name("_Rhf")
    9399                      .dwattr $C$DW$1117, DW_AT_data_member_location[DW_OP_plus_uconst 0xc4]
    9400                      .dwattr $C$DW$1117, DW_AT_accessibility(DW_ACCESS_public)
    9401              $C$DW$1118      .dwtag  DW_TAG_member
    9402                      .dwattr $C$DW$1118, DW_AT_type(*$C$DW$T$70)
    9403                      .dwattr $C$DW$1118, DW_AT_name("Lhf")
    9404                      .dwattr $C$DW$1118, DW_AT_TI_symbol_name("_Lhf")
    9405                      .dwattr $C$DW$1118, DW_AT_data_member_location[DW_OP_plus_uconst 0xc6]
    9406                      .dwattr $C$DW$1118, DW_AT_accessibility(DW_ACCESS_public)
    9407              $C$DW$1119      .dwtag  DW_TAG_member
    9408                      .dwattr $C$DW$1119, DW_AT_type(*$C$DW$T$70)
    9409                      .dwattr $C$DW$1119, DW_AT_name("RoverL")
    9410                      .dwattr $C$DW$1119, DW_AT_TI_symbol_name("_RoverL")
    9411                      .dwattr $C$DW$1119, DW_AT_data_member_location[DW_OP_plus_uconst 0xc8]
    9412                      .dwattr $C$DW$1119, DW_AT_accessibility(DW_ACCESS_public)
    9413              $C$DW$1120      .dwtag  DW_TAG_member
    9414                      .dwattr $C$DW$1120, DW_AT_type(*$C$DW$T$31)
    9415                      .dwattr $C$DW$1120, DW_AT_name("Kp_Id")
    9416                      .dwattr $C$DW$1120, DW_AT_TI_symbol_name("_Kp_Id")
    9417                      .dwattr $C$DW$1120, DW_AT_data_member_location[DW_OP_plus_uconst 0xca]
    9418                      .dwattr $C$DW$1120, DW_AT_accessibility(DW_ACCESS_public)
    9419              $C$DW$1121      .dwtag  DW_TAG_member
    9420                      .dwattr $C$DW$1121, DW_AT_type(*$C$DW$T$31)
    9421                      .dwattr $C$DW$1121, DW_AT_name("Kp_Iq")
    9422                      .dwattr $C$DW$1121, DW_AT_TI_symbol_name("_Kp_Iq")
    9423                      .dwattr $C$DW$1121, DW_AT_data_member_location[DW_OP_plus_uconst 0xcc]
    9424                      .dwattr $C$DW$1121, DW_AT_accessibility(DW_ACCESS_public)
    9425              $C$DW$1122      .dwtag  DW_TAG_member
    9426                      .dwattr $C$DW$1122, DW_AT_type(*$C$DW$T$31)
    9427                      .dwattr $C$DW$1122, DW_AT_name("Kp_spd")
    9428                      .dwattr $C$DW$1122, DW_AT_TI_symbol_name("_Kp_spd")
    9429                      .dwattr $C$DW$1122, DW_AT_data_member_location[DW_OP_plus_uconst 0xce]
    9430                      .dwattr $C$DW$1122, DW_AT_accessibility(DW_ACCESS_public)
    9431              $C$DW$1123      .dwtag  DW_TAG_member
    9432                      .dwattr $C$DW$1123, DW_AT_type(*$C$DW$T$31)
    9433                      .dwattr $C$DW$1123, DW_AT_name("Ki_Id")
    9434                      .dwattr $C$DW$1123, DW_AT_TI_symbol_name("_Ki_Id")
    9435                      .dwattr $C$DW$1123, DW_AT_data_member_location[DW_OP_plus_uconst 0xd0]
    9436                      .dwattr $C$DW$1123, DW_AT_accessibility(DW_ACCESS_public)
    9437              $C$DW$1124      .dwtag  DW_TAG_member
    9438                      .dwattr $C$DW$1124, DW_AT_type(*$C$DW$T$31)
    9439                      .dwattr $C$DW$1124, DW_AT_name("Ki_Iq")
    9440                      .dwattr $C$DW$1124, DW_AT_TI_symbol_name("_Ki_Iq")
    9441                      .dwattr $C$DW$1124, DW_AT_data_member_location[DW_OP_plus_uconst 0xd2]
    9442                      .dwattr $C$DW$1124, DW_AT_accessibility(DW_ACCESS_public)
    9443              $C$DW$1125      .dwtag  DW_TAG_member
    9444                      .dwattr $C$DW$1125, DW_AT_type(*$C$DW$T$31)
    9445                      .dwattr $C$DW$1125, DW_AT_name("Ki_spd")
    9446                      .dwattr $C$DW$1125, DW_AT_TI_symbol_name("_Ki_spd")
    9447                      .dwattr $C$DW$1125, DW_AT_data_member_location[DW_OP_plus_uconst 0xd4]
TMS320C2000 Assembler PC v6.2.5 Thu Nov 23 20:51:03 2017

Tools Copyright (c) 1996-2014 Texas Instruments Incorporated
C:\Users\wmj\AppData\Local\Temp\0886011                              PAGE  182

    9448                      .dwattr $C$DW$1125, DW_AT_accessibility(DW_ACCESS_public)
    9449              $C$DW$1126      .dwtag  DW_TAG_member
    9450                      .dwattr $C$DW$1126, DW_AT_type(*$C$DW$T$31)
    9451                      .dwattr $C$DW$1126, DW_AT_name("Kd_Id")
    9452                      .dwattr $C$DW$1126, DW_AT_TI_symbol_name("_Kd_Id")
    9453                      .dwattr $C$DW$1126, DW_AT_data_member_location[DW_OP_plus_uconst 0xd6]
    9454                      .dwattr $C$DW$1126, DW_AT_accessibility(DW_ACCESS_public)
    9455              $C$DW$1127      .dwtag  DW_TAG_member
    9456                      .dwattr $C$DW$1127, DW_AT_type(*$C$DW$T$31)
    9457                      .dwattr $C$DW$1127, DW_AT_name("Kd_Iq")
    9458                      .dwattr $C$DW$1127, DW_AT_TI_symbol_name("_Kd_Iq")
    9459                      .dwattr $C$DW$1127, DW_AT_data_member_location[DW_OP_plus_uconst 0xd8]
    9460                      .dwattr $C$DW$1127, DW_AT_accessibility(DW_ACCESS_public)
    9461              $C$DW$1128      .dwtag  DW_TAG_member
    9462                      .dwattr $C$DW$1128, DW_AT_type(*$C$DW$T$31)
    9463                      .dwattr $C$DW$1128, DW_AT_name("Kd_spd")
    9464                      .dwattr $C$DW$1128, DW_AT_TI_symbol_name("_Kd_spd")
    9465                      .dwattr $C$DW$1128, DW_AT_data_member_location[DW_OP_plus_uconst 0xda]
    9466                      .dwattr $C$DW$1128, DW_AT_accessibility(DW_ACCESS_public)
    9467              $C$DW$1129      .dwtag  DW_TAG_member
    9468                      .dwattr $C$DW$1129, DW_AT_type(*$C$DW$T$31)
    9469                      .dwattr $C$DW$1129, DW_AT_name("Ui_Id")
    9470                      .dwattr $C$DW$1129, DW_AT_TI_symbol_name("_Ui_Id")
    9471                      .dwattr $C$DW$1129, DW_AT_data_member_location[DW_OP_plus_uconst 0xdc]
    9472                      .dwattr $C$DW$1129, DW_AT_accessibility(DW_ACCESS_public)
    9473              $C$DW$1130      .dwtag  DW_TAG_member
    9474                      .dwattr $C$DW$1130, DW_AT_type(*$C$DW$T$31)
    9475                      .dwattr $C$DW$1130, DW_AT_name("Ui_Iq")
    9476                      .dwattr $C$DW$1130, DW_AT_TI_symbol_name("_Ui_Iq")
    9477                      .dwattr $C$DW$1130, DW_AT_data_member_location[DW_OP_plus_uconst 0xde]
    9478                      .dwattr $C$DW$1130, DW_AT_accessibility(DW_ACCESS_public)
    9479              $C$DW$1131      .dwtag  DW_TAG_member
    9480                      .dwattr $C$DW$1131, DW_AT_type(*$C$DW$T$31)
    9481                      .dwattr $C$DW$1131, DW_AT_name("Ui_spd")
    9482                      .dwattr $C$DW$1131, DW_AT_TI_symbol_name("_Ui_spd")
    9483                      .dwattr $C$DW$1131, DW_AT_data_member_location[DW_OP_plus_uconst 0xe0]
    9484                      .dwattr $C$DW$1131, DW_AT_accessibility(DW_ACCESS_public)
    9485              $C$DW$1132      .dwtag  DW_TAG_member
    9486                      .dwattr $C$DW$1132, DW_AT_type(*$C$DW$T$32)
    9487                      .dwattr $C$DW$1132, DW_AT_name("Idq_ref")
    9488                      .dwattr $C$DW$1132, DW_AT_TI_symbol_name("_Idq_ref")
    9489                      .dwattr $C$DW$1132, DW_AT_data_member_location[DW_OP_plus_uconst 0xe2]
    9490                      .dwattr $C$DW$1132, DW_AT_accessibility(DW_ACCESS_public)
    9491              $C$DW$1133      .dwtag  DW_TAG_member
    9492                      .dwattr $C$DW$1133, DW_AT_type(*$C$DW$T$31)
    9493                      .dwattr $C$DW$1133, DW_AT_name("IdRated")
    9494                      .dwattr $C$DW$1133, DW_AT_TI_symbol_name("_IdRated")
    9495                      .dwattr $C$DW$1133, DW_AT_data_member_location[DW_OP_plus_uconst 0xe6]
    9496                      .dwattr $C$DW$1133, DW_AT_accessibility(DW_ACCESS_public)
    9497              $C$DW$1134      .dwtag  DW_TAG_member
    9498                      .dwattr $C$DW$1134, DW_AT_type(*$C$DW$T$31)
    9499                      .dwattr $C$DW$1134, DW_AT_name("spd_ref")
    9500                      .dwattr $C$DW$1134, DW_AT_TI_symbol_name("_spd_ref")
    9501                      .dwattr $C$DW$1134, DW_AT_data_member_location[DW_OP_plus_uconst 0xe8]
    9502                      .dwattr $C$DW$1134, DW_AT_accessibility(DW_ACCESS_public)
TMS320C2000 Assembler PC v6.2.5 Thu Nov 23 20:51:03 2017

Tools Copyright (c) 1996-2014 Texas Instruments Incorporated
C:\Users\wmj\AppData\Local\Temp\0886011                              PAGE  183

    9503              $C$DW$1135      .dwtag  DW_TAG_member
    9504                      .dwattr $C$DW$1135, DW_AT_type(*$C$DW$T$31)
    9505                      .dwattr $C$DW$1135, DW_AT_name("spd_max")
    9506                      .dwattr $C$DW$1135, DW_AT_TI_symbol_name("_spd_max")
    9507                      .dwattr $C$DW$1135, DW_AT_data_member_location[DW_OP_plus_uconst 0xea]
    9508                      .dwattr $C$DW$1135, DW_AT_accessibility(DW_ACCESS_public)
    9509              $C$DW$1136      .dwtag  DW_TAG_member
    9510                      .dwattr $C$DW$1136, DW_AT_type(*$C$DW$T$69)
    9511                      .dwattr $C$DW$1136, DW_AT_name("counter_current")
    9512                      .dwattr $C$DW$1136, DW_AT_TI_symbol_name("_counter_current")
    9513                      .dwattr $C$DW$1136, DW_AT_data_member_location[DW_OP_plus_uconst 0xec]
    9514                      .dwattr $C$DW$1136, DW_AT_accessibility(DW_ACCESS_public)
    9515              $C$DW$1137      .dwtag  DW_TAG_member
    9516                      .dwattr $C$DW$1137, DW_AT_type(*$C$DW$T$69)
    9517                      .dwattr $C$DW$1137, DW_AT_name("counter_isr")
    9518                      .dwattr $C$DW$1137, DW_AT_TI_symbol_name("_counter_isr")
    9519                      .dwattr $C$DW$1137, DW_AT_data_member_location[DW_OP_plus_uconst 0xed]
    9520                      .dwattr $C$DW$1137, DW_AT_accessibility(DW_ACCESS_public)
    9521              $C$DW$1138      .dwtag  DW_TAG_member
    9522                      .dwattr $C$DW$1138, DW_AT_type(*$C$DW$T$69)
    9523                      .dwattr $C$DW$1138, DW_AT_name("counter_speed")
    9524                      .dwattr $C$DW$1138, DW_AT_TI_symbol_name("_counter_speed")
    9525                      .dwattr $C$DW$1138, DW_AT_data_member_location[DW_OP_plus_uconst 0xee]
    9526                      .dwattr $C$DW$1138, DW_AT_accessibility(DW_ACCESS_public)
    9527              $C$DW$1139      .dwtag  DW_TAG_member
    9528                      .dwattr $C$DW$1139, DW_AT_type(*$C$DW$T$69)
    9529                      .dwattr $C$DW$1139, DW_AT_name("counter_traj")
    9530                      .dwattr $C$DW$1139, DW_AT_TI_symbol_name("_counter_traj")
    9531                      .dwattr $C$DW$1139, DW_AT_data_member_location[DW_OP_plus_uconst 0xef]
    9532                      .dwattr $C$DW$1139, DW_AT_accessibility(DW_ACCESS_public)
    9533              $C$DW$1140      .dwtag  DW_TAG_member
    9534                      .dwattr $C$DW$1140, DW_AT_type(*$C$DW$T$33)
    9535                      .dwattr $C$DW$1140, DW_AT_name("flag_enableCtrl")
    9536                      .dwattr $C$DW$1140, DW_AT_TI_symbol_name("_flag_enableCtrl")
    9537                      .dwattr $C$DW$1140, DW_AT_data_member_location[DW_OP_plus_uconst 0xf0]
    9538                      .dwattr $C$DW$1140, DW_AT_accessibility(DW_ACCESS_public)
    9539              $C$DW$1141      .dwtag  DW_TAG_member
    9540                      .dwattr $C$DW$1141, DW_AT_type(*$C$DW$T$33)
    9541                      .dwattr $C$DW$1141, DW_AT_name("flag_enableDcBusComp")
    9542                      .dwattr $C$DW$1141, DW_AT_TI_symbol_name("_flag_enableDcBusComp")
    9543                      .dwattr $C$DW$1141, DW_AT_data_member_location[DW_OP_plus_uconst 0xf1]
    9544                      .dwattr $C$DW$1141, DW_AT_accessibility(DW_ACCESS_public)
    9545              $C$DW$1142      .dwtag  DW_TAG_member
    9546                      .dwattr $C$DW$1142, DW_AT_type(*$C$DW$T$33)
    9547                      .dwattr $C$DW$1142, DW_AT_name("flag_enablePowerWarp")
    9548                      .dwattr $C$DW$1142, DW_AT_TI_symbol_name("_flag_enablePowerWarp")
    9549                      .dwattr $C$DW$1142, DW_AT_data_member_location[DW_OP_plus_uconst 0xf2]
    9550                      .dwattr $C$DW$1142, DW_AT_accessibility(DW_ACCESS_public)
    9551              $C$DW$1143      .dwtag  DW_TAG_member
    9552                      .dwattr $C$DW$1143, DW_AT_type(*$C$DW$T$33)
    9553                      .dwattr $C$DW$1143, DW_AT_name("flag_enableOffset")
    9554                      .dwattr $C$DW$1143, DW_AT_TI_symbol_name("_flag_enableOffset")
    9555                      .dwattr $C$DW$1143, DW_AT_data_member_location[DW_OP_plus_uconst 0xf3]
    9556                      .dwattr $C$DW$1143, DW_AT_accessibility(DW_ACCESS_public)
    9557              $C$DW$1144      .dwtag  DW_TAG_member
TMS320C2000 Assembler PC v6.2.5 Thu Nov 23 20:51:03 2017

Tools Copyright (c) 1996-2014 Texas Instruments Incorporated
C:\Users\wmj\AppData\Local\Temp\0886011                              PAGE  184

    9558                      .dwattr $C$DW$1144, DW_AT_type(*$C$DW$T$33)
    9559                      .dwattr $C$DW$1144, DW_AT_name("flag_enableSpeedCtrl")
    9560                      .dwattr $C$DW$1144, DW_AT_TI_symbol_name("_flag_enableSpeedCtrl")
    9561                      .dwattr $C$DW$1144, DW_AT_data_member_location[DW_OP_plus_uconst 0xf4]
    9562                      .dwattr $C$DW$1144, DW_AT_accessibility(DW_ACCESS_public)
    9563              $C$DW$1145      .dwtag  DW_TAG_member
    9564                      .dwattr $C$DW$1145, DW_AT_type(*$C$DW$T$33)
    9565                      .dwattr $C$DW$1145, DW_AT_name("flag_enableUserMotorParams")
    9566                      .dwattr $C$DW$1145, DW_AT_TI_symbol_name("_flag_enableUserMotorParams")
    9567                      .dwattr $C$DW$1145, DW_AT_data_member_location[DW_OP_plus_uconst 0xf5]
    9568                      .dwattr $C$DW$1145, DW_AT_accessibility(DW_ACCESS_public)
    9569              $C$DW$1146      .dwtag  DW_TAG_member
    9570                      .dwattr $C$DW$1146, DW_AT_type(*$C$DW$T$33)
    9571                      .dwattr $C$DW$1146, DW_AT_name("flag_enableCurrentCtrl")
    9572                      .dwattr $C$DW$1146, DW_AT_TI_symbol_name("_flag_enableCurrentCtrl")
    9573                      .dwattr $C$DW$1146, DW_AT_data_member_location[DW_OP_plus_uconst 0xf6]
    9574                      .dwattr $C$DW$1146, DW_AT_accessibility(DW_ACCESS_public)
    9575              $C$DW$1147      .dwtag  DW_TAG_member
    9576                      .dwattr $C$DW$1147, DW_AT_type(*$C$DW$T$31)
    9577                      .dwattr $C$DW$1147, DW_AT_name("spd_outMaxRatio_pu")
    9578                      .dwattr $C$DW$1147, DW_AT_TI_symbol_name("_spd_outMaxRatio_pu")
    9579                      .dwattr $C$DW$1147, DW_AT_data_member_location[DW_OP_plus_uconst 0xf8]
    9580                      .dwattr $C$DW$1147, DW_AT_accessibility(DW_ACCESS_public)
    9581              $C$DW$1148      .dwtag  DW_TAG_member
    9582                      .dwattr $C$DW$1148, DW_AT_type(*$C$DW$T$31)
    9583                      .dwattr $C$DW$1148, DW_AT_name("enc_Angle")
    9584                      .dwattr $C$DW$1148, DW_AT_TI_symbol_name("_enc_Angle")
    9585                      .dwattr $C$DW$1148, DW_AT_data_member_location[DW_OP_plus_uconst 0xfa]
    9586                      .dwattr $C$DW$1148, DW_AT_accessibility(DW_ACCESS_public)
    9587              $C$DW$1149      .dwtag  DW_TAG_member
    9588                      .dwattr $C$DW$1149, DW_AT_type(*$C$DW$T$33)
    9589                      .dwattr $C$DW$1149, DW_AT_name("flag_enableEncAngle")
    9590                      .dwattr $C$DW$1149, DW_AT_TI_symbol_name("_flag_enableEncAngle")
    9591                      .dwattr $C$DW$1149, DW_AT_data_member_location[DW_OP_plus_uconst 0xfc]
    9592                      .dwattr $C$DW$1149, DW_AT_accessibility(DW_ACCESS_public)
    9593              $C$DW$1150      .dwtag  DW_TAG_member
    9594                      .dwattr $C$DW$1150, DW_AT_type(*$C$DW$T$72)
    9595                      .dwattr $C$DW$1150, DW_AT_name("brakeHandle")
    9596                      .dwattr $C$DW$1150, DW_AT_TI_symbol_name("_brakeHandle")
    9597                      .dwattr $C$DW$1150, DW_AT_data_member_location[DW_OP_plus_uconst 0xfe]
    9598                      .dwattr $C$DW$1150, DW_AT_accessibility(DW_ACCESS_public)
    9599              $C$DW$1151      .dwtag  DW_TAG_member
    9600                      .dwattr $C$DW$1151, DW_AT_type(*$C$DW$T$73)
    9601                      .dwattr $C$DW$1151, DW_AT_name("brake")
    9602                      .dwattr $C$DW$1151, DW_AT_TI_symbol_name("_brake")
    9603                      .dwattr $C$DW$1151, DW_AT_data_member_location[DW_OP_plus_uconst 0x100]
    9604                      .dwattr $C$DW$1151, DW_AT_accessibility(DW_ACCESS_public)
    9605              $C$DW$1152      .dwtag  DW_TAG_member
    9606                      .dwattr $C$DW$1152, DW_AT_type(*$C$DW$T$31)
    9607                      .dwattr $C$DW$1152, DW_AT_name("Freq_Hz_PerPwmPeriod")
    9608                      .dwattr $C$DW$1152, DW_AT_TI_symbol_name("_Freq_Hz_PerPwmPeriod")
    9609                      .dwattr $C$DW$1152, DW_AT_data_member_location[DW_OP_plus_uconst 0x108]
    9610                      .dwattr $C$DW$1152, DW_AT_accessibility(DW_ACCESS_public)
    9611                      .dwendtag $C$DW$T$74
    9612              
TMS320C2000 Assembler PC v6.2.5 Thu Nov 23 20:51:03 2017

Tools Copyright (c) 1996-2014 Texas Instruments Incorporated
C:\Users\wmj\AppData\Local\Temp\0886011                              PAGE  185

    9613              $C$DW$T$251     .dwtag  DW_TAG_typedef, DW_AT_name("CTRL_Obj")
    9614                      .dwattr $C$DW$T$251, DW_AT_type(*$C$DW$T$74)
    9615                      .dwattr $C$DW$T$251, DW_AT_language(DW_LANG_C)
    9616              $C$DW$T$210     .dwtag  DW_TAG_pointer_type
    9617                      .dwattr $C$DW$T$210, DW_AT_type(*$C$DW$T$74)
    9618                      .dwattr $C$DW$T$210, DW_AT_address_class(0x16)
    9619              $C$DW$T$211     .dwtag  DW_TAG_typedef, DW_AT_name("CTRL_Handle")
    9620                      .dwattr $C$DW$T$211, DW_AT_type(*$C$DW$T$210)
    9621                      .dwattr $C$DW$T$211, DW_AT_language(DW_LANG_C)
    9622              $C$DW$1153      .dwtag  DW_TAG_TI_far_type
    9623                      .dwattr $C$DW$1153, DW_AT_type(*$C$DW$T$211)
    9624              $C$DW$T$252     .dwtag  DW_TAG_const_type
    9625                      .dwattr $C$DW$T$252, DW_AT_type(*$C$DW$1153)
    9626              
    9627              $C$DW$T$77      .dwtag  DW_TAG_structure_type
    9628                      .dwattr $C$DW$T$77, DW_AT_name("_CTRL_Version_")
    9629                      .dwattr $C$DW$T$77, DW_AT_byte_size(0x04)
    9630              $C$DW$1154      .dwtag  DW_TAG_member
    9631                      .dwattr $C$DW$1154, DW_AT_type(*$C$DW$T$22)
    9632                      .dwattr $C$DW$1154, DW_AT_name("rsvd")
    9633                      .dwattr $C$DW$1154, DW_AT_TI_symbol_name("_rsvd")
    9634                      .dwattr $C$DW$1154, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    9635                      .dwattr $C$DW$1154, DW_AT_accessibility(DW_ACCESS_public)
    9636              $C$DW$1155      .dwtag  DW_TAG_member
    9637                      .dwattr $C$DW$1155, DW_AT_type(*$C$DW$T$76)
    9638                      .dwattr $C$DW$1155, DW_AT_name("targetProc")
    9639                      .dwattr $C$DW$1155, DW_AT_TI_symbol_name("_targetProc")
    9640                      .dwattr $C$DW$1155, DW_AT_data_member_location[DW_OP_plus_uconst 0x1]
    9641                      .dwattr $C$DW$1155, DW_AT_accessibility(DW_ACCESS_public)
    9642              $C$DW$1156      .dwtag  DW_TAG_member
    9643                      .dwattr $C$DW$1156, DW_AT_type(*$C$DW$T$22)
    9644                      .dwattr $C$DW$1156, DW_AT_name("major")
    9645                      .dwattr $C$DW$1156, DW_AT_TI_symbol_name("_major")
    9646                      .dwattr $C$DW$1156, DW_AT_data_member_location[DW_OP_plus_uconst 0x2]
    9647                      .dwattr $C$DW$1156, DW_AT_accessibility(DW_ACCESS_public)
    9648              $C$DW$1157      .dwtag  DW_TAG_member
    9649                      .dwattr $C$DW$1157, DW_AT_type(*$C$DW$T$22)
    9650                      .dwattr $C$DW$1157, DW_AT_name("minor")
    9651                      .dwattr $C$DW$1157, DW_AT_TI_symbol_name("_minor")
    9652                      .dwattr $C$DW$1157, DW_AT_data_member_location[DW_OP_plus_uconst 0x3]
    9653                      .dwattr $C$DW$1157, DW_AT_accessibility(DW_ACCESS_public)
    9654                      .dwendtag $C$DW$T$77
    9655              
    9656              $C$DW$T$40      .dwtag  DW_TAG_typedef, DW_AT_name("CTRL_Version")
    9657                      .dwattr $C$DW$T$40, DW_AT_type(*$C$DW$T$77)
    9658                      .dwattr $C$DW$T$40, DW_AT_language(DW_LANG_C)
    9659              
    9660              $C$DW$T$19      .dwtag  DW_TAG_structure_type
    9661                      .dwattr $C$DW$T$19, DW_AT_name("_EST_Obj_")
    9662                      .dwattr $C$DW$T$19, DW_AT_declaration
    9663                      .dwendtag $C$DW$T$19
    9664              
    9665              $C$DW$T$48      .dwtag  DW_TAG_pointer_type
    9666                      .dwattr $C$DW$T$48, DW_AT_type(*$C$DW$T$19)
    9667                      .dwattr $C$DW$T$48, DW_AT_address_class(0x16)
TMS320C2000 Assembler PC v6.2.5 Thu Nov 23 20:51:03 2017

Tools Copyright (c) 1996-2014 Texas Instruments Incorporated
C:\Users\wmj\AppData\Local\Temp\0886011                              PAGE  186

    9668              $C$DW$T$49      .dwtag  DW_TAG_typedef, DW_AT_name("EST_Handle")
    9669                      .dwattr $C$DW$T$49, DW_AT_type(*$C$DW$T$48)
    9670                      .dwattr $C$DW$T$49, DW_AT_language(DW_LANG_C)
    9671              
    9672              $C$DW$T$78      .dwtag  DW_TAG_structure_type
    9673                      .dwattr $C$DW$T$78, DW_AT_name("_FILTER_FO_")
    9674                      .dwattr $C$DW$T$78, DW_AT_byte_size(0x0a)
    9675              $C$DW$1158      .dwtag  DW_TAG_member
    9676                      .dwattr $C$DW$1158, DW_AT_type(*$C$DW$T$31)
    9677                      .dwattr $C$DW$1158, DW_AT_name("a1")
    9678                      .dwattr $C$DW$1158, DW_AT_TI_symbol_name("_a1")
    9679                      .dwattr $C$DW$1158, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    9680                      .dwattr $C$DW$1158, DW_AT_accessibility(DW_ACCESS_public)
    9681              $C$DW$1159      .dwtag  DW_TAG_member
    9682                      .dwattr $C$DW$1159, DW_AT_type(*$C$DW$T$31)
    9683                      .dwattr $C$DW$1159, DW_AT_name("b0")
    9684                      .dwattr $C$DW$1159, DW_AT_TI_symbol_name("_b0")
    9685                      .dwattr $C$DW$1159, DW_AT_data_member_location[DW_OP_plus_uconst 0x2]
    9686                      .dwattr $C$DW$1159, DW_AT_accessibility(DW_ACCESS_public)
    9687              $C$DW$1160      .dwtag  DW_TAG_member
    9688                      .dwattr $C$DW$1160, DW_AT_type(*$C$DW$T$31)
    9689                      .dwattr $C$DW$1160, DW_AT_name("b1")
    9690                      .dwattr $C$DW$1160, DW_AT_TI_symbol_name("_b1")
    9691                      .dwattr $C$DW$1160, DW_AT_data_member_location[DW_OP_plus_uconst 0x4]
    9692                      .dwattr $C$DW$1160, DW_AT_accessibility(DW_ACCESS_public)
    9693              $C$DW$1161      .dwtag  DW_TAG_member
    9694                      .dwattr $C$DW$1161, DW_AT_type(*$C$DW$T$31)
    9695                      .dwattr $C$DW$1161, DW_AT_name("x1")
    9696                      .dwattr $C$DW$1161, DW_AT_TI_symbol_name("_x1")
    9697                      .dwattr $C$DW$1161, DW_AT_data_member_location[DW_OP_plus_uconst 0x6]
    9698                      .dwattr $C$DW$1161, DW_AT_accessibility(DW_ACCESS_public)
    9699              $C$DW$1162      .dwtag  DW_TAG_member
    9700                      .dwattr $C$DW$1162, DW_AT_type(*$C$DW$T$31)
    9701                      .dwattr $C$DW$1162, DW_AT_name("y1")
    9702                      .dwattr $C$DW$1162, DW_AT_TI_symbol_name("_y1")
    9703                      .dwattr $C$DW$1162, DW_AT_data_member_location[DW_OP_plus_uconst 0x8]
    9704                      .dwattr $C$DW$1162, DW_AT_accessibility(DW_ACCESS_public)
    9705                      .dwendtag $C$DW$T$78
    9706              
    9707              $C$DW$T$191     .dwtag  DW_TAG_typedef, DW_AT_name("FILTER_FO_Obj")
    9708                      .dwattr $C$DW$T$191, DW_AT_type(*$C$DW$T$78)
    9709                      .dwattr $C$DW$T$191, DW_AT_language(DW_LANG_C)
    9710              
    9711              $C$DW$T$20      .dwtag  DW_TAG_structure_type
    9712                      .dwattr $C$DW$T$20, DW_AT_name("_FILTER_FO_Obj_")
    9713                      .dwattr $C$DW$T$20, DW_AT_declaration
    9714                      .dwendtag $C$DW$T$20
    9715              
    9716              $C$DW$T$192     .dwtag  DW_TAG_pointer_type
    9717                      .dwattr $C$DW$T$192, DW_AT_type(*$C$DW$T$20)
    9718                      .dwattr $C$DW$T$192, DW_AT_address_class(0x16)
    9719              $C$DW$T$193     .dwtag  DW_TAG_typedef, DW_AT_name("FILTER_FO_Handle")
    9720                      .dwattr $C$DW$T$193, DW_AT_type(*$C$DW$T$192)
    9721                      .dwattr $C$DW$T$193, DW_AT_language(DW_LANG_C)
    9722              
TMS320C2000 Assembler PC v6.2.5 Thu Nov 23 20:51:03 2017

Tools Copyright (c) 1996-2014 Texas Instruments Incorporated
C:\Users\wmj\AppData\Local\Temp\0886011                              PAGE  187

    9723              $C$DW$T$79      .dwtag  DW_TAG_structure_type
    9724                      .dwattr $C$DW$T$79, DW_AT_name("_FLASH_Obj_")
    9725                      .dwattr $C$DW$T$79, DW_AT_byte_size(0x08)
    9726              $C$DW$1163      .dwtag  DW_TAG_member
    9727                      .dwattr $C$DW$1163, DW_AT_type(*$C$DW$T$23)
    9728                      .dwattr $C$DW$1163, DW_AT_name("FOPT")
    9729                      .dwattr $C$DW$1163, DW_AT_TI_symbol_name("_FOPT")
    9730                      .dwattr $C$DW$1163, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    9731                      .dwattr $C$DW$1163, DW_AT_accessibility(DW_ACCESS_public)
    9732              $C$DW$1164      .dwtag  DW_TAG_member
    9733                      .dwattr $C$DW$1164, DW_AT_type(*$C$DW$T$23)
    9734                      .dwattr $C$DW$1164, DW_AT_name("rsvd_1")
    9735                      .dwattr $C$DW$1164, DW_AT_TI_symbol_name("_rsvd_1")
    9736                      .dwattr $C$DW$1164, DW_AT_data_member_location[DW_OP_plus_uconst 0x1]
    9737                      .dwattr $C$DW$1164, DW_AT_accessibility(DW_ACCESS_public)
    9738              $C$DW$1165      .dwtag  DW_TAG_member
    9739                      .dwattr $C$DW$1165, DW_AT_type(*$C$DW$T$23)
    9740                      .dwattr $C$DW$1165, DW_AT_name("FPWR")
    9741                      .dwattr $C$DW$1165, DW_AT_TI_symbol_name("_FPWR")
    9742                      .dwattr $C$DW$1165, DW_AT_data_member_location[DW_OP_plus_uconst 0x2]
    9743                      .dwattr $C$DW$1165, DW_AT_accessibility(DW_ACCESS_public)
    9744              $C$DW$1166      .dwtag  DW_TAG_member
    9745                      .dwattr $C$DW$1166, DW_AT_type(*$C$DW$T$23)
    9746                      .dwattr $C$DW$1166, DW_AT_name("FSTATUS")
    9747                      .dwattr $C$DW$1166, DW_AT_TI_symbol_name("_FSTATUS")
    9748                      .dwattr $C$DW$1166, DW_AT_data_member_location[DW_OP_plus_uconst 0x3]
    9749                      .dwattr $C$DW$1166, DW_AT_accessibility(DW_ACCESS_public)
    9750              $C$DW$1167      .dwtag  DW_TAG_member
    9751                      .dwattr $C$DW$1167, DW_AT_type(*$C$DW$T$23)
    9752                      .dwattr $C$DW$1167, DW_AT_name("FSTDBYWAIT")
    9753                      .dwattr $C$DW$1167, DW_AT_TI_symbol_name("_FSTDBYWAIT")
    9754                      .dwattr $C$DW$1167, DW_AT_data_member_location[DW_OP_plus_uconst 0x4]
    9755                      .dwattr $C$DW$1167, DW_AT_accessibility(DW_ACCESS_public)
    9756              $C$DW$1168      .dwtag  DW_TAG_member
    9757                      .dwattr $C$DW$1168, DW_AT_type(*$C$DW$T$23)
    9758                      .dwattr $C$DW$1168, DW_AT_name("FACTIVEWAIT")
    9759                      .dwattr $C$DW$1168, DW_AT_TI_symbol_name("_FACTIVEWAIT")
    9760                      .dwattr $C$DW$1168, DW_AT_data_member_location[DW_OP_plus_uconst 0x5]
    9761                      .dwattr $C$DW$1168, DW_AT_accessibility(DW_ACCESS_public)
    9762              $C$DW$1169      .dwtag  DW_TAG_member
    9763                      .dwattr $C$DW$1169, DW_AT_type(*$C$DW$T$23)
    9764                      .dwattr $C$DW$1169, DW_AT_name("FBANKWAIT")
    9765                      .dwattr $C$DW$1169, DW_AT_TI_symbol_name("_FBANKWAIT")
    9766                      .dwattr $C$DW$1169, DW_AT_data_member_location[DW_OP_plus_uconst 0x6]
    9767                      .dwattr $C$DW$1169, DW_AT_accessibility(DW_ACCESS_public)
    9768              $C$DW$1170      .dwtag  DW_TAG_member
    9769                      .dwattr $C$DW$1170, DW_AT_type(*$C$DW$T$23)
    9770                      .dwattr $C$DW$1170, DW_AT_name("FOTPWAIT")
    9771                      .dwattr $C$DW$1170, DW_AT_TI_symbol_name("_FOTPWAIT")
    9772                      .dwattr $C$DW$1170, DW_AT_data_member_location[DW_OP_plus_uconst 0x7]
    9773                      .dwattr $C$DW$1170, DW_AT_accessibility(DW_ACCESS_public)
    9774                      .dwendtag $C$DW$T$79
    9775              
    9776              $C$DW$T$124     .dwtag  DW_TAG_pointer_type
    9777                      .dwattr $C$DW$T$124, DW_AT_type(*$C$DW$T$79)
TMS320C2000 Assembler PC v6.2.5 Thu Nov 23 20:51:03 2017

Tools Copyright (c) 1996-2014 Texas Instruments Incorporated
C:\Users\wmj\AppData\Local\Temp\0886011                              PAGE  188

    9778                      .dwattr $C$DW$T$124, DW_AT_address_class(0x16)
    9779              $C$DW$T$125     .dwtag  DW_TAG_typedef, DW_AT_name("FLASH_Handle")
    9780                      .dwattr $C$DW$T$125, DW_AT_type(*$C$DW$T$124)
    9781                      .dwattr $C$DW$T$125, DW_AT_language(DW_LANG_C)
    9782              
    9783              $C$DW$T$99      .dwtag  DW_TAG_structure_type
    9784                      .dwattr $C$DW$T$99, DW_AT_name("_FSM_Obj_")
    9785                      .dwattr $C$DW$T$99, DW_AT_byte_size(0x26)
    9786              $C$DW$1171      .dwtag  DW_TAG_member
    9787                      .dwattr $C$DW$1171, DW_AT_type(*$C$DW$T$81)
    9788                      .dwattr $C$DW$1171, DW_AT_name("motorHandle")
    9789                      .dwattr $C$DW$1171, DW_AT_TI_symbol_name("_motorHandle")
    9790                      .dwattr $C$DW$1171, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    9791                      .dwattr $C$DW$1171, DW_AT_accessibility(DW_ACCESS_public)
    9792              $C$DW$1172      .dwtag  DW_TAG_member
    9793                      .dwattr $C$DW$1172, DW_AT_type(*$C$DW$T$83)
    9794                      .dwattr $C$DW$1172, DW_AT_name("halHandle")
    9795                      .dwattr $C$DW$1172, DW_AT_TI_symbol_name("_halHandle")
    9796                      .dwattr $C$DW$1172, DW_AT_data_member_location[DW_OP_plus_uconst 0x2]
    9797                      .dwattr $C$DW$1172, DW_AT_accessibility(DW_ACCESS_public)
    9798              $C$DW$1173      .dwtag  DW_TAG_member
    9799                      .dwattr $C$DW$1173, DW_AT_type(*$C$DW$T$85)
    9800                      .dwattr $C$DW$1173, DW_AT_name("StBoxHandle")
    9801                      .dwattr $C$DW$1173, DW_AT_TI_symbol_name("_StBoxHandle")
    9802                      .dwattr $C$DW$1173, DW_AT_data_member_location[DW_OP_plus_uconst 0x4]
    9803                      .dwattr $C$DW$1173, DW_AT_accessibility(DW_ACCESS_public)
    9804              $C$DW$1174      .dwtag  DW_TAG_member
    9805                      .dwattr $C$DW$1174, DW_AT_type(*$C$DW$T$87)
    9806                      .dwattr $C$DW$1174, DW_AT_name("FSM_State")
    9807                      .dwattr $C$DW$1174, DW_AT_TI_symbol_name("_FSM_State")
    9808                      .dwattr $C$DW$1174, DW_AT_data_member_location[DW_OP_plus_uconst 0x6]
    9809                      .dwattr $C$DW$1174, DW_AT_accessibility(DW_ACCESS_public)
    9810              $C$DW$1175      .dwtag  DW_TAG_member
    9811                      .dwattr $C$DW$1175, DW_AT_type(*$C$DW$T$87)
    9812                      .dwattr $C$DW$1175, DW_AT_name("FSM_CurState")
    9813                      .dwattr $C$DW$1175, DW_AT_TI_symbol_name("_FSM_CurState")
    9814                      .dwattr $C$DW$1175, DW_AT_data_member_location[DW_OP_plus_uconst 0x7]
    9815                      .dwattr $C$DW$1175, DW_AT_accessibility(DW_ACCESS_public)
    9816              $C$DW$1176      .dwtag  DW_TAG_member
    9817                      .dwattr $C$DW$1176, DW_AT_type(*$C$DW$T$89)
    9818                      .dwattr $C$DW$1176, DW_AT_name("FSM_Trans")
    9819                      .dwattr $C$DW$1176, DW_AT_TI_symbol_name("_FSM_Trans")
    9820                      .dwattr $C$DW$1176, DW_AT_data_member_location[DW_OP_plus_uconst 0x8]
    9821                      .dwattr $C$DW$1176, DW_AT_accessibility(DW_ACCESS_public)
    9822              $C$DW$1177      .dwtag  DW_TAG_member
    9823                      .dwattr $C$DW$1177, DW_AT_type(*$C$DW$T$91)
    9824                      .dwattr $C$DW$1177, DW_AT_name("FSM_Event")
    9825                      .dwattr $C$DW$1177, DW_AT_TI_symbol_name("_FSM_Event")
    9826                      .dwattr $C$DW$1177, DW_AT_data_member_location[DW_OP_plus_uconst 0x9]
    9827                      .dwattr $C$DW$1177, DW_AT_accessibility(DW_ACCESS_public)
    9828              $C$DW$1178      .dwtag  DW_TAG_member
    9829                      .dwattr $C$DW$1178, DW_AT_type(*$C$DW$T$93)
    9830                      .dwattr $C$DW$1178, DW_AT_name("FSM_StMode")
    9831                      .dwattr $C$DW$1178, DW_AT_TI_symbol_name("_FSM_StMode")
    9832                      .dwattr $C$DW$1178, DW_AT_data_member_location[DW_OP_plus_uconst 0xa]
TMS320C2000 Assembler PC v6.2.5 Thu Nov 23 20:51:03 2017

Tools Copyright (c) 1996-2014 Texas Instruments Incorporated
C:\Users\wmj\AppData\Local\Temp\0886011                              PAGE  189

    9833                      .dwattr $C$DW$1178, DW_AT_accessibility(DW_ACCESS_public)
    9834              $C$DW$1179      .dwtag  DW_TAG_member
    9835                      .dwattr $C$DW$1179, DW_AT_type(*$C$DW$T$22)
    9836                      .dwattr $C$DW$1179, DW_AT_name("FSM_ErrFlg")
    9837                      .dwattr $C$DW$1179, DW_AT_TI_symbol_name("_FSM_ErrFlg")
    9838                      .dwattr $C$DW$1179, DW_AT_data_member_location[DW_OP_plus_uconst 0xb]
    9839                      .dwattr $C$DW$1179, DW_AT_accessibility(DW_ACCESS_public)
    9840              $C$DW$1180      .dwtag  DW_TAG_member
    9841                      .dwattr $C$DW$1180, DW_AT_type(*$C$DW$T$22)
    9842                      .dwattr $C$DW$1180, DW_AT_name("FSM_ErrMask")
    9843                      .dwattr $C$DW$1180, DW_AT_TI_symbol_name("_FSM_ErrMask")
    9844                      .dwattr $C$DW$1180, DW_AT_data_member_location[DW_OP_plus_uconst 0xc]
    9845                      .dwattr $C$DW$1180, DW_AT_accessibility(DW_ACCESS_public)
    9846              $C$DW$1181      .dwtag  DW_TAG_member
    9847                      .dwattr $C$DW$1181, DW_AT_type(*$C$DW$T$22)
    9848                      .dwattr $C$DW$1181, DW_AT_name("FSM_runTime")
    9849                      .dwattr $C$DW$1181, DW_AT_TI_symbol_name("_FSM_runTime")
    9850                      .dwattr $C$DW$1181, DW_AT_data_member_location[DW_OP_plus_uconst 0xd]
    9851                      .dwattr $C$DW$1181, DW_AT_accessibility(DW_ACCESS_public)
    9852              $C$DW$1182      .dwtag  DW_TAG_member
    9853                      .dwattr $C$DW$1182, DW_AT_type(*$C$DW$T$22)
    9854                      .dwattr $C$DW$1182, DW_AT_name("FSM_485Cmd")
    9855                      .dwattr $C$DW$1182, DW_AT_TI_symbol_name("_FSM_485Cmd")
    9856                      .dwattr $C$DW$1182, DW_AT_data_member_location[DW_OP_plus_uconst 0xe]
    9857                      .dwattr $C$DW$1182, DW_AT_accessibility(DW_ACCESS_public)
    9858              $C$DW$1183      .dwtag  DW_TAG_member
    9859                      .dwattr $C$DW$1183, DW_AT_type(*$C$DW$T$87)
    9860                      .dwattr $C$DW$1183, DW_AT_name("FSM_485EditState")
    9861                      .dwattr $C$DW$1183, DW_AT_TI_symbol_name("_FSM_485EditState")
    9862                      .dwattr $C$DW$1183, DW_AT_data_member_location[DW_OP_plus_uconst 0xf]
    9863                      .dwattr $C$DW$1183, DW_AT_accessibility(DW_ACCESS_public)
    9864              $C$DW$1184      .dwtag  DW_TAG_member
    9865                      .dwattr $C$DW$1184, DW_AT_type(*$C$DW$T$95)
    9866                      .dwattr $C$DW$1184, DW_AT_name("FSM_485EditOpt")
    9867                      .dwattr $C$DW$1184, DW_AT_TI_symbol_name("_FSM_485EditOpt")
    9868                      .dwattr $C$DW$1184, DW_AT_data_member_location[DW_OP_plus_uconst 0x10]
    9869                      .dwattr $C$DW$1184, DW_AT_accessibility(DW_ACCESS_public)
    9870              $C$DW$1185      .dwtag  DW_TAG_member
    9871                      .dwattr $C$DW$1185, DW_AT_type(*$C$DW$T$22)
    9872                      .dwattr $C$DW$1185, DW_AT_name("FSM_485RefSpeed")
    9873                      .dwattr $C$DW$1185, DW_AT_TI_symbol_name("_FSM_485RefSpeed")
    9874                      .dwattr $C$DW$1185, DW_AT_data_member_location[DW_OP_plus_uconst 0x11]
    9875                      .dwattr $C$DW$1185, DW_AT_accessibility(DW_ACCESS_public)
    9876              $C$DW$1186      .dwtag  DW_TAG_member
    9877                      .dwattr $C$DW$1186, DW_AT_type(*$C$DW$T$31)
    9878                      .dwattr $C$DW$1186, DW_AT_name("MaxTorque_Nm")
    9879                      .dwattr $C$DW$1186, DW_AT_TI_symbol_name("_MaxTorque_Nm")
    9880                      .dwattr $C$DW$1186, DW_AT_data_member_location[DW_OP_plus_uconst 0x12]
