TMS320C2000 Assembler PC v15.12.3 Wed Nov 22 01:55:16 2017

Tools Copyright (c) 1996-2015 Texas Instruments Incorporated
C:\Users\wmj\AppData\Local\Temp\1673210                              PAGE    1

       1              ;***************************************************************
       2              ;* TMS320C2000 C/C++ Codegen                   PC v15.12.3.LTS *
       3              ;* Date/Time created: Wed Nov 22 01:55:15 2017                 *
       4              ;***************************************************************
       5                      .compiler_opts --abi=coffabi --float_support=softlib --hll_source=on --mem_model:code=flat --mem_mode
       6        0002  FP      .set    XAR2
       7              
       8              $C$DW$CU        .dwtag  DW_TAG_compile_unit
       9                      .dwattr $C$DW$CU, DW_AT_name("C:/Users/wmj/Desktop/BM1000_v1.1/sw/drivers/drvic/process_ctrl.c")
      10                      .dwattr $C$DW$CU, DW_AT_producer("TI TMS320C2000 C/C++ Codegen PC v15.12.3.LTS Copyright (c) 1996-201
      11                      .dwattr $C$DW$CU, DW_AT_TI_version(0x01)
      12                      .dwattr $C$DW$CU, DW_AT_comp_dir("C:\Users\wmj\Desktop\BM1000_v1.1\sw\solutions\instaspin_foc\boards\
      13              ;**************************************************************
      14              ;* CINIT RECORDS                                              *

    7347                      .dwattr $C$DW$681, DW_AT_name("USER_ErrorCode_ctrlPeriod_sec_High")
    7348                      .dwattr $C$DW$681, DW_AT_const_value(0x66)
    7349              
    7350              $C$DW$682       .dwtag  DW_TAG_enumerator
    7351                      .dwattr $C$DW$682, DW_AT_name("USER_ErrorCode_ctrlPeriod_sec_Low")
    7352                      .dwattr $C$DW$682, DW_AT_const_value(0x67)
    7353              
    7354              $C$DW$683       .dwtag  DW_TAG_enumerator
    7355                      .dwattr $C$DW$683, DW_AT_name("USER_ErrorCode_maxNegativeIdCurrent_a_High")
    7356                      .dwattr $C$DW$683, DW_AT_const_value(0x68)
    7357              
    7358              $C$DW$684       .dwtag  DW_TAG_enumerator
    7359                      .dwattr $C$DW$684, DW_AT_name("USER_ErrorCode_maxNegativeIdCurrent_a_Low")
TMS320C2000 Assembler PC v15.12.3 Wed Nov 22 01:55:16 2017

Tools Copyright (c) 1996-2015 Texas Instruments Incorporated
C:\Users\wmj\AppData\Local\Temp\1673210                              PAGE  140

    7360                      .dwattr $C$DW$684, DW_AT_const_value(0x69)
    7361              
    7362              $C$DW$685       .dwtag  DW_TAG_enumerator
    7363                      .dwattr $C$DW$685, DW_AT_name("USER_numErrorCodes")
    7364                      .dwattr $C$DW$685, DW_AT_const_value(0x6a)
    7365              
    7366                      .dwendtag $C$DW$T$184
    7367              
    7368              $C$DW$T$185     .dwtag  DW_TAG_typedef
    7369                      .dwattr $C$DW$T$185, DW_AT_name("USER_ErrorCode_e")
    7370                      .dwattr $C$DW$T$185, DW_AT_type(*$C$DW$T$184)
    7371                      .dwattr $C$DW$T$185, DW_AT_language(DW_LANG_C)
    7372              
    7373              
    7374              $C$DW$T$188     .dwtag  DW_TAG_enumeration_type
    7375                      .dwattr $C$DW$T$188, DW_AT_byte_size(0x01)
    7376              $C$DW$686       .dwtag  DW_TAG_enumerator
    7377                      .dwattr $C$DW$686, DW_AT_name("MOTOR_Type_Induction")
    7378                      .dwattr $C$DW$686, DW_AT_const_value(0x00)
    7379              
    7380              $C$DW$687       .dwtag  DW_TAG_enumerator
    7381                      .dwattr $C$DW$687, DW_AT_name("MOTOR_Type_Pm")
    7382                      .dwattr $C$DW$687, DW_AT_const_value(0x01)
    7383              
    7384                      .dwendtag $C$DW$T$188
    7385              
    7386              $C$DW$T$189     .dwtag  DW_TAG_typedef
    7387                      .dwattr $C$DW$T$189, DW_AT_name("MOTOR_Type_e")
    7388                      .dwattr $C$DW$T$189, DW_AT_type(*$C$DW$T$188)
    7389                      .dwattr $C$DW$T$189, DW_AT_language(DW_LANG_C)
    7390              
    7391              
    7392              $C$DW$T$242     .dwtag  DW_TAG_enumeration_type
    7393                      .dwattr $C$DW$T$242, DW_AT_byte_size(0x01)
    7394              $C$DW$688       .dwtag  DW_TAG_enumerator
    7395                      .dwattr $C$DW$688, DW_AT_name("CTRL_Type_PID_spd")
    7396                      .dwattr $C$DW$688, DW_AT_const_value(0x00)
    7397              
    7398              $C$DW$689       .dwtag  DW_TAG_enumerator
    7399                      .dwattr $C$DW$689, DW_AT_name("CTRL_Type_PID_Id")
    7400                      .dwattr $C$DW$689, DW_AT_const_value(0x01)
    7401              
    7402              $C$DW$690       .dwtag  DW_TAG_enumerator
    7403                      .dwattr $C$DW$690, DW_AT_name("CTRL_Type_PID_Iq")
    7404                      .dwattr $C$DW$690, DW_AT_const_value(0x02)
    7405              
    7406                      .dwendtag $C$DW$T$242
    7407              
    7408              $C$DW$T$243     .dwtag  DW_TAG_typedef
    7409                      .dwattr $C$DW$T$243, DW_AT_name("CTRL_Type_e")
    7410                      .dwattr $C$DW$T$243, DW_AT_type(*$C$DW$T$242)
    7411                      .dwattr $C$DW$T$243, DW_AT_language(DW_LANG_C)
    7412              
    7413              
    7414              $C$DW$T$245     .dwtag  DW_TAG_enumeration_type
TMS320C2000 Assembler PC v15.12.3 Wed Nov 22 01:55:16 2017

Tools Copyright (c) 1996-2015 Texas Instruments Incorporated
C:\Users\wmj\AppData\Local\Temp\1673210                              PAGE  141

    7415                      .dwattr $C$DW$T$245, DW_AT_byte_size(0x01)
    7416              $C$DW$691       .dwtag  DW_TAG_enumerator
    7417                      .dwattr $C$DW$691, DW_AT_name("HAL_SensorType_Current")
    7418                      .dwattr $C$DW$691, DW_AT_const_value(0x00)
    7419              
    7420              $C$DW$692       .dwtag  DW_TAG_enumerator
    7421                      .dwattr $C$DW$692, DW_AT_name("HAL_SensorType_Voltage")
    7422                      .dwattr $C$DW$692, DW_AT_const_value(0x01)
    7423              
    7424                      .dwendtag $C$DW$T$245
    7425              
    7426              $C$DW$T$246     .dwtag  DW_TAG_typedef
    7427                      .dwattr $C$DW$T$246, DW_AT_name("HAL_SensorType_e")
    7428                      .dwattr $C$DW$T$246, DW_AT_type(*$C$DW$T$245)
    7429                      .dwattr $C$DW$T$246, DW_AT_language(DW_LANG_C)
    7430              
    7431              
    7432              $C$DW$T$30      .dwtag  DW_TAG_structure_type
    7433                      .dwattr $C$DW$T$30, DW_AT_name("_ADC_Obj_")
    7434                      .dwattr $C$DW$T$30, DW_AT_byte_size(0x6650)
    7435              $C$DW$693       .dwtag  DW_TAG_member
    7436                      .dwattr $C$DW$693, DW_AT_type(*$C$DW$T$24)
    7437                      .dwattr $C$DW$693, DW_AT_name("ADCRESULT")
    7438                      .dwattr $C$DW$693, DW_AT_TI_symbol_name("_ADCRESULT")
    7439                      .dwattr $C$DW$693, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    7440                      .dwattr $C$DW$693, DW_AT_accessibility(DW_ACCESS_public)
    7441              
    7442              $C$DW$694       .dwtag  DW_TAG_member
    7443                      .dwattr $C$DW$694, DW_AT_type(*$C$DW$T$25)
    7444                      .dwattr $C$DW$694, DW_AT_name("resvd_1")
    7445                      .dwattr $C$DW$694, DW_AT_TI_symbol_name("_resvd_1")
    7446                      .dwattr $C$DW$694, DW_AT_data_member_location[DW_OP_plus_uconst 0x10]
    7447                      .dwattr $C$DW$694, DW_AT_accessibility(DW_ACCESS_public)
    7448              
    7449              $C$DW$695       .dwtag  DW_TAG_member
    7450                      .dwattr $C$DW$695, DW_AT_type(*$C$DW$T$23)
    7451                      .dwattr $C$DW$695, DW_AT_name("ADCCTL1")
    7452                      .dwattr $C$DW$695, DW_AT_TI_symbol_name("_ADCCTL1")
    7453                      .dwattr $C$DW$695, DW_AT_data_member_location[DW_OP_plus_uconst 0x6600]
    7454                      .dwattr $C$DW$695, DW_AT_accessibility(DW_ACCESS_public)
    7455              
    7456              $C$DW$696       .dwtag  DW_TAG_member
    7457                      .dwattr $C$DW$696, DW_AT_type(*$C$DW$T$23)
    7458                      .dwattr $C$DW$696, DW_AT_name("ADCCTL2")
    7459                      .dwattr $C$DW$696, DW_AT_TI_symbol_name("_ADCCTL2")
    7460                      .dwattr $C$DW$696, DW_AT_data_member_location[DW_OP_plus_uconst 0x6601]
    7461                      .dwattr $C$DW$696, DW_AT_accessibility(DW_ACCESS_public)
    7462              
    7463              $C$DW$697       .dwtag  DW_TAG_member
    7464                      .dwattr $C$DW$697, DW_AT_type(*$C$DW$T$26)
    7465                      .dwattr $C$DW$697, DW_AT_name("rsvd_2")
    7466                      .dwattr $C$DW$697, DW_AT_TI_symbol_name("_rsvd_2")
    7467                      .dwattr $C$DW$697, DW_AT_data_member_location[DW_OP_plus_uconst 0x6602]
    7468                      .dwattr $C$DW$697, DW_AT_accessibility(DW_ACCESS_public)
    7469              
TMS320C2000 Assembler PC v15.12.3 Wed Nov 22 01:55:16 2017

Tools Copyright (c) 1996-2015 Texas Instruments Incorporated
C:\Users\wmj\AppData\Local\Temp\1673210                              PAGE  142

    7470              $C$DW$698       .dwtag  DW_TAG_member
    7471                      .dwattr $C$DW$698, DW_AT_type(*$C$DW$T$23)
    7472                      .dwattr $C$DW$698, DW_AT_name("ADCINTFLG")
    7473                      .dwattr $C$DW$698, DW_AT_TI_symbol_name("_ADCINTFLG")
    7474                      .dwattr $C$DW$698, DW_AT_data_member_location[DW_OP_plus_uconst 0x6604]
    7475                      .dwattr $C$DW$698, DW_AT_accessibility(DW_ACCESS_public)
    7476              
    7477              $C$DW$699       .dwtag  DW_TAG_member
    7478                      .dwattr $C$DW$699, DW_AT_type(*$C$DW$T$23)
    7479                      .dwattr $C$DW$699, DW_AT_name("ADCINTFLGCLR")
    7480                      .dwattr $C$DW$699, DW_AT_TI_symbol_name("_ADCINTFLGCLR")
    7481                      .dwattr $C$DW$699, DW_AT_data_member_location[DW_OP_plus_uconst 0x6605]
    7482                      .dwattr $C$DW$699, DW_AT_accessibility(DW_ACCESS_public)
    7483              
    7484              $C$DW$700       .dwtag  DW_TAG_member
    7485                      .dwattr $C$DW$700, DW_AT_type(*$C$DW$T$23)
    7486                      .dwattr $C$DW$700, DW_AT_name("ADCINTOVF")
    7487                      .dwattr $C$DW$700, DW_AT_TI_symbol_name("_ADCINTOVF")
    7488                      .dwattr $C$DW$700, DW_AT_data_member_location[DW_OP_plus_uconst 0x6606]
    7489                      .dwattr $C$DW$700, DW_AT_accessibility(DW_ACCESS_public)
    7490              
    7491              $C$DW$701       .dwtag  DW_TAG_member
    7492                      .dwattr $C$DW$701, DW_AT_type(*$C$DW$T$23)
    7493                      .dwattr $C$DW$701, DW_AT_name("ADCINTOVFCLR")
    7494                      .dwattr $C$DW$701, DW_AT_TI_symbol_name("_ADCINTOVFCLR")
    7495                      .dwattr $C$DW$701, DW_AT_data_member_location[DW_OP_plus_uconst 0x6607]
    7496                      .dwattr $C$DW$701, DW_AT_accessibility(DW_ACCESS_public)
    7497              
    7498              $C$DW$702       .dwtag  DW_TAG_member
    7499                      .dwattr $C$DW$702, DW_AT_type(*$C$DW$T$27)
    7500                      .dwattr $C$DW$702, DW_AT_name("INTSELxNy")
    7501                      .dwattr $C$DW$702, DW_AT_TI_symbol_name("_INTSELxNy")
    7502                      .dwattr $C$DW$702, DW_AT_data_member_location[DW_OP_plus_uconst 0x6608]
    7503                      .dwattr $C$DW$702, DW_AT_accessibility(DW_ACCESS_public)
    7504              
    7505              $C$DW$703       .dwtag  DW_TAG_member
    7506                      .dwattr $C$DW$703, DW_AT_type(*$C$DW$T$28)
    7507                      .dwattr $C$DW$703, DW_AT_name("rsvd_3")
    7508                      .dwattr $C$DW$703, DW_AT_TI_symbol_name("_rsvd_3")
    7509                      .dwattr $C$DW$703, DW_AT_data_member_location[DW_OP_plus_uconst 0x660d]
    7510                      .dwattr $C$DW$703, DW_AT_accessibility(DW_ACCESS_public)
    7511              
    7512              $C$DW$704       .dwtag  DW_TAG_member
    7513                      .dwattr $C$DW$704, DW_AT_type(*$C$DW$T$23)
    7514                      .dwattr $C$DW$704, DW_AT_name("SOCPRICTRL")
    7515                      .dwattr $C$DW$704, DW_AT_TI_symbol_name("_SOCPRICTRL")
    7516                      .dwattr $C$DW$704, DW_AT_data_member_location[DW_OP_plus_uconst 0x6610]
    7517                      .dwattr $C$DW$704, DW_AT_accessibility(DW_ACCESS_public)
    7518              
    7519              $C$DW$705       .dwtag  DW_TAG_member
    7520                      .dwattr $C$DW$705, DW_AT_type(*$C$DW$T$23)
    7521                      .dwattr $C$DW$705, DW_AT_name("rsvd_4")
    7522                      .dwattr $C$DW$705, DW_AT_TI_symbol_name("_rsvd_4")
    7523                      .dwattr $C$DW$705, DW_AT_data_member_location[DW_OP_plus_uconst 0x6611]
    7524                      .dwattr $C$DW$705, DW_AT_accessibility(DW_ACCESS_public)
TMS320C2000 Assembler PC v15.12.3 Wed Nov 22 01:55:16 2017

Tools Copyright (c) 1996-2015 Texas Instruments Incorporated
C:\Users\wmj\AppData\Local\Temp\1673210                              PAGE  143

    7525              
    7526              $C$DW$706       .dwtag  DW_TAG_member
    7527                      .dwattr $C$DW$706, DW_AT_type(*$C$DW$T$23)
    7528                      .dwattr $C$DW$706, DW_AT_name("ADCSAMPLEMODE")
    7529                      .dwattr $C$DW$706, DW_AT_TI_symbol_name("_ADCSAMPLEMODE")
    7530                      .dwattr $C$DW$706, DW_AT_data_member_location[DW_OP_plus_uconst 0x6612]
    7531                      .dwattr $C$DW$706, DW_AT_accessibility(DW_ACCESS_public)
    7532              
    7533              $C$DW$707       .dwtag  DW_TAG_member
    7534                      .dwattr $C$DW$707, DW_AT_type(*$C$DW$T$23)
    7535                      .dwattr $C$DW$707, DW_AT_name("rsvd_5")
    7536                      .dwattr $C$DW$707, DW_AT_TI_symbol_name("_rsvd_5")
    7537                      .dwattr $C$DW$707, DW_AT_data_member_location[DW_OP_plus_uconst 0x6613]
    7538                      .dwattr $C$DW$707, DW_AT_accessibility(DW_ACCESS_public)
    7539              
    7540              $C$DW$708       .dwtag  DW_TAG_member
    7541                      .dwattr $C$DW$708, DW_AT_type(*$C$DW$T$23)
    7542                      .dwattr $C$DW$708, DW_AT_name("ADCINTSOCSEL1")
    7543                      .dwattr $C$DW$708, DW_AT_TI_symbol_name("_ADCINTSOCSEL1")
    7544                      .dwattr $C$DW$708, DW_AT_data_member_location[DW_OP_plus_uconst 0x6614]
    7545                      .dwattr $C$DW$708, DW_AT_accessibility(DW_ACCESS_public)
    7546              
    7547              $C$DW$709       .dwtag  DW_TAG_member
    7548                      .dwattr $C$DW$709, DW_AT_type(*$C$DW$T$23)
    7549                      .dwattr $C$DW$709, DW_AT_name("ADCINTSOCSEL2")
    7550                      .dwattr $C$DW$709, DW_AT_TI_symbol_name("_ADCINTSOCSEL2")
    7551                      .dwattr $C$DW$709, DW_AT_data_member_location[DW_OP_plus_uconst 0x6615]
    7552                      .dwattr $C$DW$709, DW_AT_accessibility(DW_ACCESS_public)
    7553              
    7554              $C$DW$710       .dwtag  DW_TAG_member
    7555                      .dwattr $C$DW$710, DW_AT_type(*$C$DW$T$26)
    7556                      .dwattr $C$DW$710, DW_AT_name("rsvd_6")
    7557                      .dwattr $C$DW$710, DW_AT_TI_symbol_name("_rsvd_6")
    7558                      .dwattr $C$DW$710, DW_AT_data_member_location[DW_OP_plus_uconst 0x6616]
    7559                      .dwattr $C$DW$710, DW_AT_accessibility(DW_ACCESS_public)
    7560              
    7561              $C$DW$711       .dwtag  DW_TAG_member
    7562                      .dwattr $C$DW$711, DW_AT_type(*$C$DW$T$23)
    7563                      .dwattr $C$DW$711, DW_AT_name("ADCSOCFLG1")
    7564                      .dwattr $C$DW$711, DW_AT_TI_symbol_name("_ADCSOCFLG1")
    7565                      .dwattr $C$DW$711, DW_AT_data_member_location[DW_OP_plus_uconst 0x6618]
    7566                      .dwattr $C$DW$711, DW_AT_accessibility(DW_ACCESS_public)
    7567              
    7568              $C$DW$712       .dwtag  DW_TAG_member
    7569                      .dwattr $C$DW$712, DW_AT_type(*$C$DW$T$23)
    7570                      .dwattr $C$DW$712, DW_AT_name("rsvd_7")
    7571                      .dwattr $C$DW$712, DW_AT_TI_symbol_name("_rsvd_7")
    7572                      .dwattr $C$DW$712, DW_AT_data_member_location[DW_OP_plus_uconst 0x6619]
    7573                      .dwattr $C$DW$712, DW_AT_accessibility(DW_ACCESS_public)
    7574              
    7575              $C$DW$713       .dwtag  DW_TAG_member
    7576                      .dwattr $C$DW$713, DW_AT_type(*$C$DW$T$23)
    7577                      .dwattr $C$DW$713, DW_AT_name("ADCSOCFRC1")
    7578                      .dwattr $C$DW$713, DW_AT_TI_symbol_name("_ADCSOCFRC1")
    7579                      .dwattr $C$DW$713, DW_AT_data_member_location[DW_OP_plus_uconst 0x661a]
TMS320C2000 Assembler PC v15.12.3 Wed Nov 22 01:55:16 2017

Tools Copyright (c) 1996-2015 Texas Instruments Incorporated
C:\Users\wmj\AppData\Local\Temp\1673210                              PAGE  144

    7580                      .dwattr $C$DW$713, DW_AT_accessibility(DW_ACCESS_public)
    7581              
    7582              $C$DW$714       .dwtag  DW_TAG_member
    7583                      .dwattr $C$DW$714, DW_AT_type(*$C$DW$T$23)
    7584                      .dwattr $C$DW$714, DW_AT_name("rsvd_8")
    7585                      .dwattr $C$DW$714, DW_AT_TI_symbol_name("_rsvd_8")
    7586                      .dwattr $C$DW$714, DW_AT_data_member_location[DW_OP_plus_uconst 0x661b]
    7587                      .dwattr $C$DW$714, DW_AT_accessibility(DW_ACCESS_public)
    7588              
    7589              $C$DW$715       .dwtag  DW_TAG_member
    7590                      .dwattr $C$DW$715, DW_AT_type(*$C$DW$T$23)
    7591                      .dwattr $C$DW$715, DW_AT_name("ADCSOCOVF1")
    7592                      .dwattr $C$DW$715, DW_AT_TI_symbol_name("_ADCSOCOVF1")
    7593                      .dwattr $C$DW$715, DW_AT_data_member_location[DW_OP_plus_uconst 0x661c]
    7594                      .dwattr $C$DW$715, DW_AT_accessibility(DW_ACCESS_public)
    7595              
    7596              $C$DW$716       .dwtag  DW_TAG_member
    7597                      .dwattr $C$DW$716, DW_AT_type(*$C$DW$T$23)
    7598                      .dwattr $C$DW$716, DW_AT_name("rsvd_9")
    7599                      .dwattr $C$DW$716, DW_AT_TI_symbol_name("_rsvd_9")
    7600                      .dwattr $C$DW$716, DW_AT_data_member_location[DW_OP_plus_uconst 0x661d]
    7601                      .dwattr $C$DW$716, DW_AT_accessibility(DW_ACCESS_public)
    7602              
    7603              $C$DW$717       .dwtag  DW_TAG_member
    7604                      .dwattr $C$DW$717, DW_AT_type(*$C$DW$T$23)
    7605                      .dwattr $C$DW$717, DW_AT_name("ADCSOCOVFCLR1")
    7606                      .dwattr $C$DW$717, DW_AT_TI_symbol_name("_ADCSOCOVFCLR1")
    7607                      .dwattr $C$DW$717, DW_AT_data_member_location[DW_OP_plus_uconst 0x661e]
    7608                      .dwattr $C$DW$717, DW_AT_accessibility(DW_ACCESS_public)
    7609              
    7610              $C$DW$718       .dwtag  DW_TAG_member
    7611                      .dwattr $C$DW$718, DW_AT_type(*$C$DW$T$23)
    7612                      .dwattr $C$DW$718, DW_AT_name("rsvd_10")
    7613                      .dwattr $C$DW$718, DW_AT_TI_symbol_name("_rsvd_10")
    7614                      .dwattr $C$DW$718, DW_AT_data_member_location[DW_OP_plus_uconst 0x661f]
    7615                      .dwattr $C$DW$718, DW_AT_accessibility(DW_ACCESS_public)
    7616              
    7617              $C$DW$719       .dwtag  DW_TAG_member
    7618                      .dwattr $C$DW$719, DW_AT_type(*$C$DW$T$24)
    7619                      .dwattr $C$DW$719, DW_AT_name("ADCSOCxCTL")
    7620                      .dwattr $C$DW$719, DW_AT_TI_symbol_name("_ADCSOCxCTL")
    7621                      .dwattr $C$DW$719, DW_AT_data_member_location[DW_OP_plus_uconst 0x6620]
    7622                      .dwattr $C$DW$719, DW_AT_accessibility(DW_ACCESS_public)
    7623              
    7624              $C$DW$720       .dwtag  DW_TAG_member
    7625                      .dwattr $C$DW$720, DW_AT_type(*$C$DW$T$24)
    7626                      .dwattr $C$DW$720, DW_AT_name("rsvd_11")
    7627                      .dwattr $C$DW$720, DW_AT_TI_symbol_name("_rsvd_11")
    7628                      .dwattr $C$DW$720, DW_AT_data_member_location[DW_OP_plus_uconst 0x6630]
    7629                      .dwattr $C$DW$720, DW_AT_accessibility(DW_ACCESS_public)
    7630              
    7631              $C$DW$721       .dwtag  DW_TAG_member
    7632                      .dwattr $C$DW$721, DW_AT_type(*$C$DW$T$23)
    7633                      .dwattr $C$DW$721, DW_AT_name("ADCREFTRIM")
    7634                      .dwattr $C$DW$721, DW_AT_TI_symbol_name("_ADCREFTRIM")
TMS320C2000 Assembler PC v15.12.3 Wed Nov 22 01:55:16 2017

Tools Copyright (c) 1996-2015 Texas Instruments Incorporated
C:\Users\wmj\AppData\Local\Temp\1673210                              PAGE  145

    7635                      .dwattr $C$DW$721, DW_AT_data_member_location[DW_OP_plus_uconst 0x6640]
    7636                      .dwattr $C$DW$721, DW_AT_accessibility(DW_ACCESS_public)
    7637              
    7638              $C$DW$722       .dwtag  DW_TAG_member
    7639                      .dwattr $C$DW$722, DW_AT_type(*$C$DW$T$23)
    7640                      .dwattr $C$DW$722, DW_AT_name("ADCOFFTRIM")
    7641                      .dwattr $C$DW$722, DW_AT_TI_symbol_name("_ADCOFFTRIM")
    7642                      .dwattr $C$DW$722, DW_AT_data_member_location[DW_OP_plus_uconst 0x6641]
    7643                      .dwattr $C$DW$722, DW_AT_accessibility(DW_ACCESS_public)
    7644              
    7645              $C$DW$723       .dwtag  DW_TAG_member
    7646                      .dwattr $C$DW$723, DW_AT_type(*$C$DW$T$29)
    7647                      .dwattr $C$DW$723, DW_AT_name("resvd_12")
    7648                      .dwattr $C$DW$723, DW_AT_TI_symbol_name("_resvd_12")
    7649                      .dwattr $C$DW$723, DW_AT_data_member_location[DW_OP_plus_uconst 0x6642]
    7650                      .dwattr $C$DW$723, DW_AT_accessibility(DW_ACCESS_public)
    7651              
    7652              $C$DW$724       .dwtag  DW_TAG_member
    7653                      .dwattr $C$DW$724, DW_AT_type(*$C$DW$T$23)
    7654                      .dwattr $C$DW$724, DW_AT_name("ADCREV")
    7655                      .dwattr $C$DW$724, DW_AT_TI_symbol_name("_ADCREV")
    7656                      .dwattr $C$DW$724, DW_AT_data_member_location[DW_OP_plus_uconst 0x664f]
    7657                      .dwattr $C$DW$724, DW_AT_accessibility(DW_ACCESS_public)
    7658              
    7659                      .dwendtag $C$DW$T$30
    7660              
    7661              $C$DW$T$118     .dwtag  DW_TAG_pointer_type
    7662                      .dwattr $C$DW$T$118, DW_AT_type(*$C$DW$T$30)
    7663                      .dwattr $C$DW$T$118, DW_AT_address_class(0x20)
    7664              
    7665              $C$DW$T$119     .dwtag  DW_TAG_typedef
    7666                      .dwattr $C$DW$T$119, DW_AT_name("ADC_Handle")
    7667                      .dwattr $C$DW$T$119, DW_AT_type(*$C$DW$T$118)
    7668                      .dwattr $C$DW$T$119, DW_AT_language(DW_LANG_C)
    7669              
    7670              
    7671              $C$DW$T$34      .dwtag  DW_TAG_structure_type
    7672                      .dwattr $C$DW$T$34, DW_AT_name("_BRAKE_Obj_")
    7673                      .dwattr $C$DW$T$34, DW_AT_byte_size(0x08)
    7674              $C$DW$725       .dwtag  DW_TAG_member
    7675                      .dwattr $C$DW$725, DW_AT_type(*$C$DW$T$31)
    7676                      .dwattr $C$DW$725, DW_AT_name("angle_pu")
    7677                      .dwattr $C$DW$725, DW_AT_TI_symbol_name("_angle_pu")
    7678                      .dwattr $C$DW$725, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    7679                      .dwattr $C$DW$725, DW_AT_accessibility(DW_ACCESS_public)
    7680              
    7681              $C$DW$726       .dwtag  DW_TAG_member
    7682                      .dwattr $C$DW$726, DW_AT_type(*$C$DW$T$32)
    7683                      .dwattr $C$DW$726, DW_AT_name("Idq_brake")
    7684                      .dwattr $C$DW$726, DW_AT_TI_symbol_name("_Idq_brake")
    7685                      .dwattr $C$DW$726, DW_AT_data_member_location[DW_OP_plus_uconst 0x2]
    7686                      .dwattr $C$DW$726, DW_AT_accessibility(DW_ACCESS_public)
    7687              
    7688              $C$DW$727       .dwtag  DW_TAG_member
    7689                      .dwattr $C$DW$727, DW_AT_type(*$C$DW$T$33)
TMS320C2000 Assembler PC v15.12.3 Wed Nov 22 01:55:16 2017

Tools Copyright (c) 1996-2015 Texas Instruments Incorporated
C:\Users\wmj\AppData\Local\Temp\1673210                              PAGE  146

    7690                      .dwattr $C$DW$727, DW_AT_name("brake_enable")
    7691                      .dwattr $C$DW$727, DW_AT_TI_symbol_name("_brake_enable")
    7692                      .dwattr $C$DW$727, DW_AT_data_member_location[DW_OP_plus_uconst 0x6]
    7693                      .dwattr $C$DW$727, DW_AT_accessibility(DW_ACCESS_public)
    7694              
    7695                      .dwendtag $C$DW$T$34
    7696              
    7697              $C$DW$T$73      .dwtag  DW_TAG_typedef
    7698                      .dwattr $C$DW$T$73, DW_AT_name("BRAKE_Obj")
    7699                      .dwattr $C$DW$T$73, DW_AT_type(*$C$DW$T$34)
    7700                      .dwattr $C$DW$T$73, DW_AT_language(DW_LANG_C)
    7701              
    7702              $C$DW$T$71      .dwtag  DW_TAG_pointer_type
    7703                      .dwattr $C$DW$T$71, DW_AT_type(*$C$DW$T$34)
    7704                      .dwattr $C$DW$T$71, DW_AT_address_class(0x20)
    7705              
    7706              $C$DW$T$72      .dwtag  DW_TAG_typedef
    7707                      .dwattr $C$DW$T$72, DW_AT_name("BRAKE_Handle")
    7708                      .dwattr $C$DW$T$72, DW_AT_type(*$C$DW$T$71)
    7709                      .dwattr $C$DW$T$72, DW_AT_language(DW_LANG_C)
    7710              
    7711              
    7712              $C$DW$T$36      .dwtag  DW_TAG_structure_type
    7713                      .dwattr $C$DW$T$36, DW_AT_name("_CLARKE_Obj_")
    7714                      .dwattr $C$DW$T$36, DW_AT_byte_size(0x06)
    7715              $C$DW$728       .dwtag  DW_TAG_member
    7716                      .dwattr $C$DW$728, DW_AT_type(*$C$DW$T$31)
    7717                      .dwattr $C$DW$728, DW_AT_name("alpha_sf")
    7718                      .dwattr $C$DW$728, DW_AT_TI_symbol_name("_alpha_sf")
    7719                      .dwattr $C$DW$728, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    7720                      .dwattr $C$DW$728, DW_AT_accessibility(DW_ACCESS_public)
    7721              
    7722              $C$DW$729       .dwtag  DW_TAG_member
    7723                      .dwattr $C$DW$729, DW_AT_type(*$C$DW$T$31)
    7724                      .dwattr $C$DW$729, DW_AT_name("beta_sf")
    7725                      .dwattr $C$DW$729, DW_AT_TI_symbol_name("_beta_sf")
    7726                      .dwattr $C$DW$729, DW_AT_data_member_location[DW_OP_plus_uconst 0x2]
    7727                      .dwattr $C$DW$729, DW_AT_accessibility(DW_ACCESS_public)
    7728              
    7729              $C$DW$730       .dwtag  DW_TAG_member
    7730                      .dwattr $C$DW$730, DW_AT_type(*$C$DW$T$35)
    7731                      .dwattr $C$DW$730, DW_AT_name("numSensors")
    7732                      .dwattr $C$DW$730, DW_AT_TI_symbol_name("_numSensors")
    7733                      .dwattr $C$DW$730, DW_AT_data_member_location[DW_OP_plus_uconst 0x4]
    7734                      .dwattr $C$DW$730, DW_AT_accessibility(DW_ACCESS_public)
    7735              
    7736                      .dwendtag $C$DW$T$36
    7737              
    7738              $C$DW$T$47      .dwtag  DW_TAG_typedef
    7739                      .dwattr $C$DW$T$47, DW_AT_name("CLARKE_Obj")
    7740                      .dwattr $C$DW$T$47, DW_AT_type(*$C$DW$T$36)
    7741                      .dwattr $C$DW$T$47, DW_AT_language(DW_LANG_C)
    7742              
    7743              $C$DW$T$45      .dwtag  DW_TAG_pointer_type
    7744                      .dwattr $C$DW$T$45, DW_AT_type(*$C$DW$T$36)
TMS320C2000 Assembler PC v15.12.3 Wed Nov 22 01:55:16 2017

Tools Copyright (c) 1996-2015 Texas Instruments Incorporated
C:\Users\wmj\AppData\Local\Temp\1673210                              PAGE  147

    7745                      .dwattr $C$DW$T$45, DW_AT_address_class(0x20)
    7746              
    7747              $C$DW$T$46      .dwtag  DW_TAG_typedef
    7748                      .dwattr $C$DW$T$46, DW_AT_name("CLARKE_Handle")
    7749                      .dwattr $C$DW$T$46, DW_AT_type(*$C$DW$T$45)
    7750                      .dwattr $C$DW$T$46, DW_AT_language(DW_LANG_C)
    7751              
    7752              
    7753              $C$DW$T$38      .dwtag  DW_TAG_structure_type
    7754                      .dwattr $C$DW$T$38, DW_AT_name("_CLK_Obj_")
    7755                      .dwattr $C$DW$T$38, DW_AT_byte_size(0x11)
    7756              $C$DW$731       .dwtag  DW_TAG_member
    7757                      .dwattr $C$DW$731, DW_AT_type(*$C$DW$T$23)
    7758                      .dwattr $C$DW$731, DW_AT_name("XCLK")
    7759                      .dwattr $C$DW$731, DW_AT_TI_symbol_name("_XCLK")
    7760                      .dwattr $C$DW$731, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    7761                      .dwattr $C$DW$731, DW_AT_accessibility(DW_ACCESS_public)
    7762              
    7763              $C$DW$732       .dwtag  DW_TAG_member
    7764                      .dwattr $C$DW$732, DW_AT_type(*$C$DW$T$23)
    7765                      .dwattr $C$DW$732, DW_AT_name("rsvd_1")
    7766                      .dwattr $C$DW$732, DW_AT_TI_symbol_name("_rsvd_1")
    7767                      .dwattr $C$DW$732, DW_AT_data_member_location[DW_OP_plus_uconst 0x1]
    7768                      .dwattr $C$DW$732, DW_AT_accessibility(DW_ACCESS_public)
    7769              
    7770              $C$DW$733       .dwtag  DW_TAG_member
    7771                      .dwattr $C$DW$733, DW_AT_type(*$C$DW$T$23)
    7772                      .dwattr $C$DW$733, DW_AT_name("CLKCTL")
    7773                      .dwattr $C$DW$733, DW_AT_TI_symbol_name("_CLKCTL")
    7774                      .dwattr $C$DW$733, DW_AT_data_member_location[DW_OP_plus_uconst 0x2]
    7775                      .dwattr $C$DW$733, DW_AT_accessibility(DW_ACCESS_public)
    7776              
    7777              $C$DW$734       .dwtag  DW_TAG_member
    7778                      .dwattr $C$DW$734, DW_AT_type(*$C$DW$T$37)
    7779                      .dwattr $C$DW$734, DW_AT_name("rsvd_2")
    7780                      .dwattr $C$DW$734, DW_AT_TI_symbol_name("_rsvd_2")
    7781                      .dwattr $C$DW$734, DW_AT_data_member_location[DW_OP_plus_uconst 0x3]
    7782                      .dwattr $C$DW$734, DW_AT_accessibility(DW_ACCESS_public)
    7783              
    7784              $C$DW$735       .dwtag  DW_TAG_member
    7785                      .dwattr $C$DW$735, DW_AT_type(*$C$DW$T$23)
    7786                      .dwattr $C$DW$735, DW_AT_name("LOSPCP")
    7787                      .dwattr $C$DW$735, DW_AT_TI_symbol_name("_LOSPCP")
    7788                      .dwattr $C$DW$735, DW_AT_data_member_location[DW_OP_plus_uconst 0xb]
    7789                      .dwattr $C$DW$735, DW_AT_accessibility(DW_ACCESS_public)
    7790              
    7791              $C$DW$736       .dwtag  DW_TAG_member
    7792                      .dwattr $C$DW$736, DW_AT_type(*$C$DW$T$23)
    7793                      .dwattr $C$DW$736, DW_AT_name("PCLKCR0")
    7794                      .dwattr $C$DW$736, DW_AT_TI_symbol_name("_PCLKCR0")
    7795                      .dwattr $C$DW$736, DW_AT_data_member_location[DW_OP_plus_uconst 0xc]
    7796                      .dwattr $C$DW$736, DW_AT_accessibility(DW_ACCESS_public)
    7797              
    7798              $C$DW$737       .dwtag  DW_TAG_member
    7799                      .dwattr $C$DW$737, DW_AT_type(*$C$DW$T$23)
TMS320C2000 Assembler PC v15.12.3 Wed Nov 22 01:55:16 2017

Tools Copyright (c) 1996-2015 Texas Instruments Incorporated
C:\Users\wmj\AppData\Local\Temp\1673210                              PAGE  148

    7800                      .dwattr $C$DW$737, DW_AT_name("PCLKCR1")
    7801                      .dwattr $C$DW$737, DW_AT_TI_symbol_name("_PCLKCR1")
    7802                      .dwattr $C$DW$737, DW_AT_data_member_location[DW_OP_plus_uconst 0xd]
    7803                      .dwattr $C$DW$737, DW_AT_accessibility(DW_ACCESS_public)
    7804              
    7805              $C$DW$738       .dwtag  DW_TAG_member
    7806                      .dwattr $C$DW$738, DW_AT_type(*$C$DW$T$26)
    7807                      .dwattr $C$DW$738, DW_AT_name("rsvd_3")
    7808                      .dwattr $C$DW$738, DW_AT_TI_symbol_name("_rsvd_3")
    7809                      .dwattr $C$DW$738, DW_AT_data_member_location[DW_OP_plus_uconst 0xe]
    7810                      .dwattr $C$DW$738, DW_AT_accessibility(DW_ACCESS_public)
    7811              
    7812              $C$DW$739       .dwtag  DW_TAG_member
    7813                      .dwattr $C$DW$739, DW_AT_type(*$C$DW$T$23)
    7814                      .dwattr $C$DW$739, DW_AT_name("PCLKCR3")
    7815                      .dwattr $C$DW$739, DW_AT_TI_symbol_name("_PCLKCR3")
    7816                      .dwattr $C$DW$739, DW_AT_data_member_location[DW_OP_plus_uconst 0x10]
    7817                      .dwattr $C$DW$739, DW_AT_accessibility(DW_ACCESS_public)
    7818              
    7819                      .dwendtag $C$DW$T$38
    7820              
    7821              $C$DW$T$120     .dwtag  DW_TAG_pointer_type
    7822                      .dwattr $C$DW$T$120, DW_AT_type(*$C$DW$T$38)
    7823                      .dwattr $C$DW$T$120, DW_AT_address_class(0x20)
    7824              
    7825              $C$DW$T$121     .dwtag  DW_TAG_typedef
    7826                      .dwattr $C$DW$T$121, DW_AT_name("CLK_Handle")
    7827                      .dwattr $C$DW$T$121, DW_AT_type(*$C$DW$T$120)
    7828                      .dwattr $C$DW$T$121, DW_AT_language(DW_LANG_C)
    7829              
    7830              
    7831              $C$DW$T$39      .dwtag  DW_TAG_structure_type
    7832                      .dwattr $C$DW$T$39, DW_AT_name("_CPU_Obj_")
    7833                      .dwattr $C$DW$T$39, DW_AT_byte_size(0x01)
    7834              $C$DW$740       .dwtag  DW_TAG_member
    7835                      .dwattr $C$DW$740, DW_AT_type(*$C$DW$T$35)
    7836                      .dwattr $C$DW$740, DW_AT_name("tmp")
    7837                      .dwattr $C$DW$740, DW_AT_TI_symbol_name("_tmp")
    7838                      .dwattr $C$DW$740, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    7839                      .dwattr $C$DW$740, DW_AT_accessibility(DW_ACCESS_public)
    7840              
    7841                      .dwendtag $C$DW$T$39
    7842              
    7843              $C$DW$T$122     .dwtag  DW_TAG_pointer_type
    7844                      .dwattr $C$DW$T$122, DW_AT_type(*$C$DW$T$39)
    7845                      .dwattr $C$DW$T$122, DW_AT_address_class(0x20)
    7846              
    7847              $C$DW$T$123     .dwtag  DW_TAG_typedef
    7848                      .dwattr $C$DW$T$123, DW_AT_name("CPU_Handle")
    7849                      .dwattr $C$DW$T$123, DW_AT_type(*$C$DW$T$122)
    7850                      .dwattr $C$DW$T$123, DW_AT_language(DW_LANG_C)
    7851              
    7852              
    7853              $C$DW$T$74      .dwtag  DW_TAG_structure_type
    7854                      .dwattr $C$DW$T$74, DW_AT_name("_CTRL_Obj_")
TMS320C2000 Assembler PC v15.12.3 Wed Nov 22 01:55:16 2017

Tools Copyright (c) 1996-2015 Texas Instruments Incorporated
C:\Users\wmj\AppData\Local\Temp\1673210                              PAGE  149

    7855                      .dwattr $C$DW$T$74, DW_AT_byte_size(0x108)
    7856              $C$DW$741       .dwtag  DW_TAG_member
    7857                      .dwattr $C$DW$741, DW_AT_type(*$C$DW$T$40)
    7858                      .dwattr $C$DW$741, DW_AT_name("version")
    7859                      .dwattr $C$DW$741, DW_AT_TI_symbol_name("_version")
    7860                      .dwattr $C$DW$741, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    7861                      .dwattr $C$DW$741, DW_AT_accessibility(DW_ACCESS_public)
    7862              
    7863              $C$DW$742       .dwtag  DW_TAG_member
    7864                      .dwattr $C$DW$742, DW_AT_type(*$C$DW$T$42)
    7865                      .dwattr $C$DW$742, DW_AT_name("state")
    7866                      .dwattr $C$DW$742, DW_AT_TI_symbol_name("_state")
    7867                      .dwattr $C$DW$742, DW_AT_data_member_location[DW_OP_plus_uconst 0x4]
    7868                      .dwattr $C$DW$742, DW_AT_accessibility(DW_ACCESS_public)
    7869              
    7870              $C$DW$743       .dwtag  DW_TAG_member
    7871                      .dwattr $C$DW$743, DW_AT_type(*$C$DW$T$42)
    7872                      .dwattr $C$DW$743, DW_AT_name("prevState")
    7873                      .dwattr $C$DW$743, DW_AT_TI_symbol_name("_prevState")
    7874                      .dwattr $C$DW$743, DW_AT_data_member_location[DW_OP_plus_uconst 0x5]
    7875                      .dwattr $C$DW$743, DW_AT_accessibility(DW_ACCESS_public)
    7876              
    7877              $C$DW$744       .dwtag  DW_TAG_member
    7878                      .dwattr $C$DW$744, DW_AT_type(*$C$DW$T$44)
    7879                      .dwattr $C$DW$744, DW_AT_name("errorCode")
    7880                      .dwattr $C$DW$744, DW_AT_TI_symbol_name("_errorCode")
    7881                      .dwattr $C$DW$744, DW_AT_data_member_location[DW_OP_plus_uconst 0x6]
    7882                      .dwattr $C$DW$744, DW_AT_accessibility(DW_ACCESS_public)
    7883              
    7884              $C$DW$745       .dwtag  DW_TAG_member
    7885                      .dwattr $C$DW$745, DW_AT_type(*$C$DW$T$46)
    7886                      .dwattr $C$DW$745, DW_AT_name("clarkeHandle_I")
    7887                      .dwattr $C$DW$745, DW_AT_TI_symbol_name("_clarkeHandle_I")
    7888                      .dwattr $C$DW$745, DW_AT_data_member_location[DW_OP_plus_uconst 0x8]
    7889                      .dwattr $C$DW$745, DW_AT_accessibility(DW_ACCESS_public)
    7890              
    7891              $C$DW$746       .dwtag  DW_TAG_member
    7892                      .dwattr $C$DW$746, DW_AT_type(*$C$DW$T$47)
    7893                      .dwattr $C$DW$746, DW_AT_name("clarke_I")
    7894                      .dwattr $C$DW$746, DW_AT_TI_symbol_name("_clarke_I")
    7895                      .dwattr $C$DW$746, DW_AT_data_member_location[DW_OP_plus_uconst 0xa]
    7896                      .dwattr $C$DW$746, DW_AT_accessibility(DW_ACCESS_public)
    7897              
    7898              $C$DW$747       .dwtag  DW_TAG_member
    7899                      .dwattr $C$DW$747, DW_AT_type(*$C$DW$T$46)
    7900                      .dwattr $C$DW$747, DW_AT_name("clarkeHandle_V")
    7901                      .dwattr $C$DW$747, DW_AT_TI_symbol_name("_clarkeHandle_V")
    7902                      .dwattr $C$DW$747, DW_AT_data_member_location[DW_OP_plus_uconst 0x10]
    7903                      .dwattr $C$DW$747, DW_AT_accessibility(DW_ACCESS_public)
    7904              
    7905              $C$DW$748       .dwtag  DW_TAG_member
    7906                      .dwattr $C$DW$748, DW_AT_type(*$C$DW$T$47)
    7907                      .dwattr $C$DW$748, DW_AT_name("clarke_V")
    7908                      .dwattr $C$DW$748, DW_AT_TI_symbol_name("_clarke_V")
    7909                      .dwattr $C$DW$748, DW_AT_data_member_location[DW_OP_plus_uconst 0x12]
TMS320C2000 Assembler PC v15.12.3 Wed Nov 22 01:55:16 2017

Tools Copyright (c) 1996-2015 Texas Instruments Incorporated
C:\Users\wmj\AppData\Local\Temp\1673210                              PAGE  150

    7910                      .dwattr $C$DW$748, DW_AT_accessibility(DW_ACCESS_public)
    7911              
    7912              $C$DW$749       .dwtag  DW_TAG_member
    7913                      .dwattr $C$DW$749, DW_AT_type(*$C$DW$T$49)
    7914                      .dwattr $C$DW$749, DW_AT_name("estHandle")
    7915                      .dwattr $C$DW$749, DW_AT_TI_symbol_name("_estHandle")
    7916                      .dwattr $C$DW$749, DW_AT_data_member_location[DW_OP_plus_uconst 0x18]
    7917                      .dwattr $C$DW$749, DW_AT_accessibility(DW_ACCESS_public)
    7918              
    7919              $C$DW$750       .dwtag  DW_TAG_member
    7920                      .dwattr $C$DW$750, DW_AT_type(*$C$DW$T$51)
    7921                      .dwattr $C$DW$750, DW_AT_name("parkHandle")
    7922                      .dwattr $C$DW$750, DW_AT_TI_symbol_name("_parkHandle")
    7923                      .dwattr $C$DW$750, DW_AT_data_member_location[DW_OP_plus_uconst 0x1a]
    7924                      .dwattr $C$DW$750, DW_AT_accessibility(DW_ACCESS_public)
    7925              
    7926              $C$DW$751       .dwtag  DW_TAG_member
    7927                      .dwattr $C$DW$751, DW_AT_type(*$C$DW$T$52)
    7928                      .dwattr $C$DW$751, DW_AT_name("park")
    7929                      .dwattr $C$DW$751, DW_AT_TI_symbol_name("_park")
    7930                      .dwattr $C$DW$751, DW_AT_data_member_location[DW_OP_plus_uconst 0x1c]
    7931                      .dwattr $C$DW$751, DW_AT_accessibility(DW_ACCESS_public)
    7932              
    7933              $C$DW$752       .dwtag  DW_TAG_member
    7934                      .dwattr $C$DW$752, DW_AT_type(*$C$DW$T$54)
    7935                      .dwattr $C$DW$752, DW_AT_name("pidHandle_Id")
    7936                      .dwattr $C$DW$752, DW_AT_TI_symbol_name("_pidHandle_Id")
    7937                      .dwattr $C$DW$752, DW_AT_data_member_location[DW_OP_plus_uconst 0x20]
    7938                      .dwattr $C$DW$752, DW_AT_accessibility(DW_ACCESS_public)
    7939              
    7940              $C$DW$753       .dwtag  DW_TAG_member
    7941                      .dwattr $C$DW$753, DW_AT_type(*$C$DW$T$55)
    7942                      .dwattr $C$DW$753, DW_AT_name("pid_Id")
    7943                      .dwattr $C$DW$753, DW_AT_TI_symbol_name("_pid_Id")
    7944                      .dwattr $C$DW$753, DW_AT_data_member_location[DW_OP_plus_uconst 0x22]
    7945                      .dwattr $C$DW$753, DW_AT_accessibility(DW_ACCESS_public)
    7946              
    7947              $C$DW$754       .dwtag  DW_TAG_member
    7948                      .dwattr $C$DW$754, DW_AT_type(*$C$DW$T$54)
    7949                      .dwattr $C$DW$754, DW_AT_name("pidHandle_Iq")
    7950                      .dwattr $C$DW$754, DW_AT_TI_symbol_name("_pidHandle_Iq")
    7951                      .dwattr $C$DW$754, DW_AT_data_member_location[DW_OP_plus_uconst 0x32]
    7952                      .dwattr $C$DW$754, DW_AT_accessibility(DW_ACCESS_public)
    7953              
    7954              $C$DW$755       .dwtag  DW_TAG_member
    7955                      .dwattr $C$DW$755, DW_AT_type(*$C$DW$T$55)
    7956                      .dwattr $C$DW$755, DW_AT_name("pid_Iq")
    7957                      .dwattr $C$DW$755, DW_AT_TI_symbol_name("_pid_Iq")
    7958                      .dwattr $C$DW$755, DW_AT_data_member_location[DW_OP_plus_uconst 0x34]
    7959                      .dwattr $C$DW$755, DW_AT_accessibility(DW_ACCESS_public)
    7960              
    7961              $C$DW$756       .dwtag  DW_TAG_member
    7962                      .dwattr $C$DW$756, DW_AT_type(*$C$DW$T$54)
    7963                      .dwattr $C$DW$756, DW_AT_name("pidHandle_spd")
    7964                      .dwattr $C$DW$756, DW_AT_TI_symbol_name("_pidHandle_spd")
TMS320C2000 Assembler PC v15.12.3 Wed Nov 22 01:55:16 2017

Tools Copyright (c) 1996-2015 Texas Instruments Incorporated
C:\Users\wmj\AppData\Local\Temp\1673210                              PAGE  151

    7965                      .dwattr $C$DW$756, DW_AT_data_member_location[DW_OP_plus_uconst 0x44]
    7966                      .dwattr $C$DW$756, DW_AT_accessibility(DW_ACCESS_public)
    7967              
    7968              $C$DW$757       .dwtag  DW_TAG_member
    7969                      .dwattr $C$DW$757, DW_AT_type(*$C$DW$T$55)
    7970                      .dwattr $C$DW$757, DW_AT_name("pid_spd")
    7971                      .dwattr $C$DW$757, DW_AT_TI_symbol_name("_pid_spd")
    7972                      .dwattr $C$DW$757, DW_AT_data_member_location[DW_OP_plus_uconst 0x46]
    7973                      .dwattr $C$DW$757, DW_AT_accessibility(DW_ACCESS_public)
    7974              
    7975              $C$DW$758       .dwtag  DW_TAG_member
    7976                      .dwattr $C$DW$758, DW_AT_type(*$C$DW$T$57)
    7977                      .dwattr $C$DW$758, DW_AT_name("iparkHandle")
    7978                      .dwattr $C$DW$758, DW_AT_TI_symbol_name("_iparkHandle")
    7979                      .dwattr $C$DW$758, DW_AT_data_member_location[DW_OP_plus_uconst 0x56]
    7980                      .dwattr $C$DW$758, DW_AT_accessibility(DW_ACCESS_public)
    7981              
    7982              $C$DW$759       .dwtag  DW_TAG_member
    7983                      .dwattr $C$DW$759, DW_AT_type(*$C$DW$T$58)
    7984                      .dwattr $C$DW$759, DW_AT_name("ipark")
    7985                      .dwattr $C$DW$759, DW_AT_TI_symbol_name("_ipark")
    7986                      .dwattr $C$DW$759, DW_AT_data_member_location[DW_OP_plus_uconst 0x58]
    7987                      .dwattr $C$DW$759, DW_AT_accessibility(DW_ACCESS_public)
    7988              
    7989              $C$DW$760       .dwtag  DW_TAG_member
    7990                      .dwattr $C$DW$760, DW_AT_type(*$C$DW$T$60)
    7991                      .dwattr $C$DW$760, DW_AT_name("svgenHandle")
    7992                      .dwattr $C$DW$760, DW_AT_TI_symbol_name("_svgenHandle")
    7993                      .dwattr $C$DW$760, DW_AT_data_member_location[DW_OP_plus_uconst 0x5c]
    7994                      .dwattr $C$DW$760, DW_AT_accessibility(DW_ACCESS_public)
    7995              
    7996              $C$DW$761       .dwtag  DW_TAG_member
    7997                      .dwattr $C$DW$761, DW_AT_type(*$C$DW$T$61)
    7998                      .dwattr $C$DW$761, DW_AT_name("svgen")
    7999                      .dwattr $C$DW$761, DW_AT_TI_symbol_name("_svgen")
    8000                      .dwattr $C$DW$761, DW_AT_data_member_location[DW_OP_plus_uconst 0x5e]
    8001                      .dwattr $C$DW$761, DW_AT_accessibility(DW_ACCESS_public)
    8002              
    8003              $C$DW$762       .dwtag  DW_TAG_member
    8004                      .dwattr $C$DW$762, DW_AT_type(*$C$DW$T$63)
    8005                      .dwattr $C$DW$762, DW_AT_name("trajHandle_Id")
    8006                      .dwattr $C$DW$762, DW_AT_TI_symbol_name("_trajHandle_Id")
    8007                      .dwattr $C$DW$762, DW_AT_data_member_location[DW_OP_plus_uconst 0x60]
    8008                      .dwattr $C$DW$762, DW_AT_accessibility(DW_ACCESS_public)
    8009              
    8010              $C$DW$763       .dwtag  DW_TAG_member
    8011                      .dwattr $C$DW$763, DW_AT_type(*$C$DW$T$64)
    8012                      .dwattr $C$DW$763, DW_AT_name("traj_Id")
    8013                      .dwattr $C$DW$763, DW_AT_TI_symbol_name("_traj_Id")
    8014                      .dwattr $C$DW$763, DW_AT_data_member_location[DW_OP_plus_uconst 0x62]
    8015                      .dwattr $C$DW$763, DW_AT_accessibility(DW_ACCESS_public)
    8016              
    8017              $C$DW$764       .dwtag  DW_TAG_member
    8018                      .dwattr $C$DW$764, DW_AT_type(*$C$DW$T$63)
    8019                      .dwattr $C$DW$764, DW_AT_name("trajHandle_spd")
TMS320C2000 Assembler PC v15.12.3 Wed Nov 22 01:55:16 2017

Tools Copyright (c) 1996-2015 Texas Instruments Incorporated
C:\Users\wmj\AppData\Local\Temp\1673210                              PAGE  152

    8020                      .dwattr $C$DW$764, DW_AT_TI_symbol_name("_trajHandle_spd")
    8021                      .dwattr $C$DW$764, DW_AT_data_member_location[DW_OP_plus_uconst 0x6c]
    8022                      .dwattr $C$DW$764, DW_AT_accessibility(DW_ACCESS_public)
    8023              
    8024              $C$DW$765       .dwtag  DW_TAG_member
    8025                      .dwattr $C$DW$765, DW_AT_type(*$C$DW$T$64)
    8026                      .dwattr $C$DW$765, DW_AT_name("traj_spd")
    8027                      .dwattr $C$DW$765, DW_AT_TI_symbol_name("_traj_spd")
    8028                      .dwattr $C$DW$765, DW_AT_data_member_location[DW_OP_plus_uconst 0x6e]
    8029                      .dwattr $C$DW$765, DW_AT_accessibility(DW_ACCESS_public)
    8030              
    8031              $C$DW$766       .dwtag  DW_TAG_member
    8032                      .dwattr $C$DW$766, DW_AT_type(*$C$DW$T$63)
    8033                      .dwattr $C$DW$766, DW_AT_name("trajHandle_spdMax")
    8034                      .dwattr $C$DW$766, DW_AT_TI_symbol_name("_trajHandle_spdMax")
    8035                      .dwattr $C$DW$766, DW_AT_data_member_location[DW_OP_plus_uconst 0x78]
    8036                      .dwattr $C$DW$766, DW_AT_accessibility(DW_ACCESS_public)
    8037              
    8038              $C$DW$767       .dwtag  DW_TAG_member
    8039                      .dwattr $C$DW$767, DW_AT_type(*$C$DW$T$64)
    8040                      .dwattr $C$DW$767, DW_AT_name("traj_spdMax")
    8041                      .dwattr $C$DW$767, DW_AT_TI_symbol_name("_traj_spdMax")
    8042                      .dwattr $C$DW$767, DW_AT_data_member_location[DW_OP_plus_uconst 0x7a]
    8043                      .dwattr $C$DW$767, DW_AT_accessibility(DW_ACCESS_public)
    8044              
    8045              $C$DW$768       .dwtag  DW_TAG_member
    8046                      .dwattr $C$DW$768, DW_AT_type(*$C$DW$T$65)
    8047                      .dwattr $C$DW$768, DW_AT_name("motorParams")
    8048                      .dwattr $C$DW$768, DW_AT_TI_symbol_name("_motorParams")
    8049                      .dwattr $C$DW$768, DW_AT_data_member_location[DW_OP_plus_uconst 0x84]
    8050                      .dwattr $C$DW$768, DW_AT_accessibility(DW_ACCESS_public)
    8051              
    8052              $C$DW$769       .dwtag  DW_TAG_member
    8053                      .dwattr $C$DW$769, DW_AT_type(*$C$DW$T$68)
    8054                      .dwattr $C$DW$769, DW_AT_name("waitTimes")
    8055                      .dwattr $C$DW$769, DW_AT_TI_symbol_name("_waitTimes")
    8056                      .dwattr $C$DW$769, DW_AT_data_member_location[DW_OP_plus_uconst 0x92]
    8057                      .dwattr $C$DW$769, DW_AT_accessibility(DW_ACCESS_public)
    8058              
    8059              $C$DW$770       .dwtag  DW_TAG_member
    8060                      .dwattr $C$DW$770, DW_AT_type(*$C$DW$T$67)
    8061                      .dwattr $C$DW$770, DW_AT_name("counter_state")
    8062                      .dwattr $C$DW$770, DW_AT_TI_symbol_name("_counter_state")
    8063                      .dwattr $C$DW$770, DW_AT_data_member_location[DW_OP_plus_uconst 0x9a]
    8064                      .dwattr $C$DW$770, DW_AT_accessibility(DW_ACCESS_public)
    8065              
    8066              $C$DW$771       .dwtag  DW_TAG_member
    8067                      .dwattr $C$DW$771, DW_AT_type(*$C$DW$T$69)
    8068                      .dwattr $C$DW$771, DW_AT_name("numIsrTicksPerCtrlTick")
    8069                      .dwattr $C$DW$771, DW_AT_TI_symbol_name("_numIsrTicksPerCtrlTick")
    8070                      .dwattr $C$DW$771, DW_AT_data_member_location[DW_OP_plus_uconst 0x9c]
    8071                      .dwattr $C$DW$771, DW_AT_accessibility(DW_ACCESS_public)
    8072              
    8073              $C$DW$772       .dwtag  DW_TAG_member
    8074                      .dwattr $C$DW$772, DW_AT_type(*$C$DW$T$69)
TMS320C2000 Assembler PC v15.12.3 Wed Nov 22 01:55:16 2017

Tools Copyright (c) 1996-2015 Texas Instruments Incorporated
C:\Users\wmj\AppData\Local\Temp\1673210                              PAGE  153

    8075                      .dwattr $C$DW$772, DW_AT_name("numCtrlTicksPerCurrentTick")
    8076                      .dwattr $C$DW$772, DW_AT_TI_symbol_name("_numCtrlTicksPerCurrentTick")
    8077                      .dwattr $C$DW$772, DW_AT_data_member_location[DW_OP_plus_uconst 0x9d]
    8078                      .dwattr $C$DW$772, DW_AT_accessibility(DW_ACCESS_public)
    8079              
    8080              $C$DW$773       .dwtag  DW_TAG_member
    8081                      .dwattr $C$DW$773, DW_AT_type(*$C$DW$T$69)
    8082                      .dwattr $C$DW$773, DW_AT_name("numCtrlTicksPerSpeedTick")
    8083                      .dwattr $C$DW$773, DW_AT_TI_symbol_name("_numCtrlTicksPerSpeedTick")
    8084                      .dwattr $C$DW$773, DW_AT_data_member_location[DW_OP_plus_uconst 0x9e]
    8085                      .dwattr $C$DW$773, DW_AT_accessibility(DW_ACCESS_public)
    8086              
    8087              $C$DW$774       .dwtag  DW_TAG_member
    8088                      .dwattr $C$DW$774, DW_AT_type(*$C$DW$T$69)
    8089                      .dwattr $C$DW$774, DW_AT_name("numCtrlTicksPerTrajTick")
    8090                      .dwattr $C$DW$774, DW_AT_TI_symbol_name("_numCtrlTicksPerTrajTick")
    8091                      .dwattr $C$DW$774, DW_AT_data_member_location[DW_OP_plus_uconst 0x9f]
    8092                      .dwattr $C$DW$774, DW_AT_accessibility(DW_ACCESS_public)
    8093              
    8094              $C$DW$775       .dwtag  DW_TAG_member
    8095                      .dwattr $C$DW$775, DW_AT_type(*$C$DW$T$67)
    8096                      .dwattr $C$DW$775, DW_AT_name("ctrlFreq_Hz")
    8097                      .dwattr $C$DW$775, DW_AT_TI_symbol_name("_ctrlFreq_Hz")
    8098                      .dwattr $C$DW$775, DW_AT_data_member_location[DW_OP_plus_uconst 0xa0]
    8099                      .dwattr $C$DW$775, DW_AT_accessibility(DW_ACCESS_public)
    8100              
    8101              $C$DW$776       .dwtag  DW_TAG_member
    8102                      .dwattr $C$DW$776, DW_AT_type(*$C$DW$T$67)
    8103                      .dwattr $C$DW$776, DW_AT_name("trajFreq_Hz")
    8104                      .dwattr $C$DW$776, DW_AT_TI_symbol_name("_trajFreq_Hz")
    8105                      .dwattr $C$DW$776, DW_AT_data_member_location[DW_OP_plus_uconst 0xa2]
    8106                      .dwattr $C$DW$776, DW_AT_accessibility(DW_ACCESS_public)
    8107              
    8108              $C$DW$777       .dwtag  DW_TAG_member
    8109                      .dwattr $C$DW$777, DW_AT_type(*$C$DW$T$31)
    8110                      .dwattr $C$DW$777, DW_AT_name("trajPeriod_sec")
    8111                      .dwattr $C$DW$777, DW_AT_TI_symbol_name("_trajPeriod_sec")
    8112                      .dwattr $C$DW$777, DW_AT_data_member_location[DW_OP_plus_uconst 0xa4]
    8113                      .dwattr $C$DW$777, DW_AT_accessibility(DW_ACCESS_public)
    8114              
    8115              $C$DW$778       .dwtag  DW_TAG_member
    8116                      .dwattr $C$DW$778, DW_AT_type(*$C$DW$T$70)
    8117                      .dwattr $C$DW$778, DW_AT_name("ctrlPeriod_sec")
    8118                      .dwattr $C$DW$778, DW_AT_TI_symbol_name("_ctrlPeriod_sec")
    8119                      .dwattr $C$DW$778, DW_AT_data_member_location[DW_OP_plus_uconst 0xa6]
    8120                      .dwattr $C$DW$778, DW_AT_accessibility(DW_ACCESS_public)
    8121              
    8122              $C$DW$779       .dwtag  DW_TAG_member
    8123                      .dwattr $C$DW$779, DW_AT_type(*$C$DW$T$31)
    8124                      .dwattr $C$DW$779, DW_AT_name("maxVsMag_pu")
    8125                      .dwattr $C$DW$779, DW_AT_TI_symbol_name("_maxVsMag_pu")
    8126                      .dwattr $C$DW$779, DW_AT_data_member_location[DW_OP_plus_uconst 0xa8]
    8127                      .dwattr $C$DW$779, DW_AT_accessibility(DW_ACCESS_public)
    8128              
    8129              $C$DW$780       .dwtag  DW_TAG_member
TMS320C2000 Assembler PC v15.12.3 Wed Nov 22 01:55:16 2017

Tools Copyright (c) 1996-2015 Texas Instruments Incorporated
C:\Users\wmj\AppData\Local\Temp\1673210                              PAGE  154

    8130                      .dwattr $C$DW$780, DW_AT_type(*$C$DW$T$32)
    8131                      .dwattr $C$DW$780, DW_AT_name("Iab_in")
    8132                      .dwattr $C$DW$780, DW_AT_TI_symbol_name("_Iab_in")
    8133                      .dwattr $C$DW$780, DW_AT_data_member_location[DW_OP_plus_uconst 0xaa]
    8134                      .dwattr $C$DW$780, DW_AT_accessibility(DW_ACCESS_public)
    8135              
    8136              $C$DW$781       .dwtag  DW_TAG_member
    8137                      .dwattr $C$DW$781, DW_AT_type(*$C$DW$T$32)
    8138                      .dwattr $C$DW$781, DW_AT_name("Iab_filt")
    8139                      .dwattr $C$DW$781, DW_AT_TI_symbol_name("_Iab_filt")
    8140                      .dwattr $C$DW$781, DW_AT_data_member_location[DW_OP_plus_uconst 0xae]
    8141                      .dwattr $C$DW$781, DW_AT_accessibility(DW_ACCESS_public)
    8142              
    8143              $C$DW$782       .dwtag  DW_TAG_member
    8144                      .dwattr $C$DW$782, DW_AT_type(*$C$DW$T$32)
    8145                      .dwattr $C$DW$782, DW_AT_name("Idq_in")
    8146                      .dwattr $C$DW$782, DW_AT_TI_symbol_name("_Idq_in")
    8147                      .dwattr $C$DW$782, DW_AT_data_member_location[DW_OP_plus_uconst 0xb2]
    8148                      .dwattr $C$DW$782, DW_AT_accessibility(DW_ACCESS_public)
    8149              
    8150              $C$DW$783       .dwtag  DW_TAG_member
    8151                      .dwattr $C$DW$783, DW_AT_type(*$C$DW$T$32)
    8152                      .dwattr $C$DW$783, DW_AT_name("Vab_in")
    8153                      .dwattr $C$DW$783, DW_AT_TI_symbol_name("_Vab_in")
    8154                      .dwattr $C$DW$783, DW_AT_data_member_location[DW_OP_plus_uconst 0xb6]
    8155                      .dwattr $C$DW$783, DW_AT_accessibility(DW_ACCESS_public)
    8156              
    8157              $C$DW$784       .dwtag  DW_TAG_member
    8158                      .dwattr $C$DW$784, DW_AT_type(*$C$DW$T$31)
    8159                      .dwattr $C$DW$784, DW_AT_name("spd_out")
    8160                      .dwattr $C$DW$784, DW_AT_TI_symbol_name("_spd_out")
    8161                      .dwattr $C$DW$784, DW_AT_data_member_location[DW_OP_plus_uconst 0xba]
    8162                      .dwattr $C$DW$784, DW_AT_accessibility(DW_ACCESS_public)
    8163              
    8164              $C$DW$785       .dwtag  DW_TAG_member
    8165                      .dwattr $C$DW$785, DW_AT_type(*$C$DW$T$32)
    8166                      .dwattr $C$DW$785, DW_AT_name("Vab_out")
    8167                      .dwattr $C$DW$785, DW_AT_TI_symbol_name("_Vab_out")
    8168                      .dwattr $C$DW$785, DW_AT_data_member_location[DW_OP_plus_uconst 0xbc]
    8169                      .dwattr $C$DW$785, DW_AT_accessibility(DW_ACCESS_public)
    8170              
    8171              $C$DW$786       .dwtag  DW_TAG_member
    8172                      .dwattr $C$DW$786, DW_AT_type(*$C$DW$T$32)
    8173                      .dwattr $C$DW$786, DW_AT_name("Vdq_out")
    8174                      .dwattr $C$DW$786, DW_AT_TI_symbol_name("_Vdq_out")
    8175                      .dwattr $C$DW$786, DW_AT_data_member_location[DW_OP_plus_uconst 0xc0]
    8176                      .dwattr $C$DW$786, DW_AT_accessibility(DW_ACCESS_public)
    8177              
    8178              $C$DW$787       .dwtag  DW_TAG_member
    8179                      .dwattr $C$DW$787, DW_AT_type(*$C$DW$T$70)
    8180                      .dwattr $C$DW$787, DW_AT_name("Rhf")
    8181                      .dwattr $C$DW$787, DW_AT_TI_symbol_name("_Rhf")
    8182                      .dwattr $C$DW$787, DW_AT_data_member_location[DW_OP_plus_uconst 0xc4]
    8183                      .dwattr $C$DW$787, DW_AT_accessibility(DW_ACCESS_public)
    8184              
TMS320C2000 Assembler PC v15.12.3 Wed Nov 22 01:55:16 2017

Tools Copyright (c) 1996-2015 Texas Instruments Incorporated
C:\Users\wmj\AppData\Local\Temp\1673210                              PAGE  155

    8185              $C$DW$788       .dwtag  DW_TAG_member
    8186                      .dwattr $C$DW$788, DW_AT_type(*$C$DW$T$70)
    8187                      .dwattr $C$DW$788, DW_AT_name("Lhf")
    8188                      .dwattr $C$DW$788, DW_AT_TI_symbol_name("_Lhf")
    8189                      .dwattr $C$DW$788, DW_AT_data_member_location[DW_OP_plus_uconst 0xc6]
    8190                      .dwattr $C$DW$788, DW_AT_accessibility(DW_ACCESS_public)
    8191              
    8192              $C$DW$789       .dwtag  DW_TAG_member
    8193                      .dwattr $C$DW$789, DW_AT_type(*$C$DW$T$70)
    8194                      .dwattr $C$DW$789, DW_AT_name("RoverL")
    8195                      .dwattr $C$DW$789, DW_AT_TI_symbol_name("_RoverL")
    8196                      .dwattr $C$DW$789, DW_AT_data_member_location[DW_OP_plus_uconst 0xc8]
    8197                      .dwattr $C$DW$789, DW_AT_accessibility(DW_ACCESS_public)
    8198              
    8199              $C$DW$790       .dwtag  DW_TAG_member
    8200                      .dwattr $C$DW$790, DW_AT_type(*$C$DW$T$31)
    8201                      .dwattr $C$DW$790, DW_AT_name("Kp_Id")
    8202                      .dwattr $C$DW$790, DW_AT_TI_symbol_name("_Kp_Id")
    8203                      .dwattr $C$DW$790, DW_AT_data_member_location[DW_OP_plus_uconst 0xca]
    8204                      .dwattr $C$DW$790, DW_AT_accessibility(DW_ACCESS_public)
    8205              
    8206              $C$DW$791       .dwtag  DW_TAG_member
    8207                      .dwattr $C$DW$791, DW_AT_type(*$C$DW$T$31)
    8208                      .dwattr $C$DW$791, DW_AT_name("Kp_Iq")
    8209                      .dwattr $C$DW$791, DW_AT_TI_symbol_name("_Kp_Iq")
    8210                      .dwattr $C$DW$791, DW_AT_data_member_location[DW_OP_plus_uconst 0xcc]
    8211                      .dwattr $C$DW$791, DW_AT_accessibility(DW_ACCESS_public)
    8212              
    8213              $C$DW$792       .dwtag  DW_TAG_member
    8214                      .dwattr $C$DW$792, DW_AT_type(*$C$DW$T$31)
    8215                      .dwattr $C$DW$792, DW_AT_name("Kp_spd")
    8216                      .dwattr $C$DW$792, DW_AT_TI_symbol_name("_Kp_spd")
    8217                      .dwattr $C$DW$792, DW_AT_data_member_location[DW_OP_plus_uconst 0xce]
    8218                      .dwattr $C$DW$792, DW_AT_accessibility(DW_ACCESS_public)
    8219              
    8220              $C$DW$793       .dwtag  DW_TAG_member
    8221                      .dwattr $C$DW$793, DW_AT_type(*$C$DW$T$31)
    8222                      .dwattr $C$DW$793, DW_AT_name("Ki_Id")
    8223                      .dwattr $C$DW$793, DW_AT_TI_symbol_name("_Ki_Id")
    8224                      .dwattr $C$DW$793, DW_AT_data_member_location[DW_OP_plus_uconst 0xd0]
    8225                      .dwattr $C$DW$793, DW_AT_accessibility(DW_ACCESS_public)
    8226              
    8227              $C$DW$794       .dwtag  DW_TAG_member
    8228                      .dwattr $C$DW$794, DW_AT_type(*$C$DW$T$31)
    8229                      .dwattr $C$DW$794, DW_AT_name("Ki_Iq")
    8230                      .dwattr $C$DW$794, DW_AT_TI_symbol_name("_Ki_Iq")
    8231                      .dwattr $C$DW$794, DW_AT_data_member_location[DW_OP_plus_uconst 0xd2]
    8232                      .dwattr $C$DW$794, DW_AT_accessibility(DW_ACCESS_public)
    8233              
    8234              $C$DW$795       .dwtag  DW_TAG_member
    8235                      .dwattr $C$DW$795, DW_AT_type(*$C$DW$T$31)
    8236                      .dwattr $C$DW$795, DW_AT_name("Ki_spd")
    8237                      .dwattr $C$DW$795, DW_AT_TI_symbol_name("_Ki_spd")
    8238                      .dwattr $C$DW$795, DW_AT_data_member_location[DW_OP_plus_uconst 0xd4]
    8239                      .dwattr $C$DW$795, DW_AT_accessibility(DW_ACCESS_public)
TMS320C2000 Assembler PC v15.12.3 Wed Nov 22 01:55:16 2017

Tools Copyright (c) 1996-2015 Texas Instruments Incorporated
C:\Users\wmj\AppData\Local\Temp\1673210                              PAGE  156

    8240              
    8241              $C$DW$796       .dwtag  DW_TAG_member
    8242                      .dwattr $C$DW$796, DW_AT_type(*$C$DW$T$31)
    8243                      .dwattr $C$DW$796, DW_AT_name("Kd_Id")
    8244                      .dwattr $C$DW$796, DW_AT_TI_symbol_name("_Kd_Id")
    8245                      .dwattr $C$DW$796, DW_AT_data_member_location[DW_OP_plus_uconst 0xd6]
    8246                      .dwattr $C$DW$796, DW_AT_accessibility(DW_ACCESS_public)
    8247              
    8248              $C$DW$797       .dwtag  DW_TAG_member
    8249                      .dwattr $C$DW$797, DW_AT_type(*$C$DW$T$31)
    8250                      .dwattr $C$DW$797, DW_AT_name("Kd_Iq")
    8251                      .dwattr $C$DW$797, DW_AT_TI_symbol_name("_Kd_Iq")
    8252                      .dwattr $C$DW$797, DW_AT_data_member_location[DW_OP_plus_uconst 0xd8]
    8253                      .dwattr $C$DW$797, DW_AT_accessibility(DW_ACCESS_public)
    8254              
    8255              $C$DW$798       .dwtag  DW_TAG_member
    8256                      .dwattr $C$DW$798, DW_AT_type(*$C$DW$T$31)
    8257                      .dwattr $C$DW$798, DW_AT_name("Kd_spd")
    8258                      .dwattr $C$DW$798, DW_AT_TI_symbol_name("_Kd_spd")
    8259                      .dwattr $C$DW$798, DW_AT_data_member_location[DW_OP_plus_uconst 0xda]
    8260                      .dwattr $C$DW$798, DW_AT_accessibility(DW_ACCESS_public)
    8261              
    8262              $C$DW$799       .dwtag  DW_TAG_member
    8263                      .dwattr $C$DW$799, DW_AT_type(*$C$DW$T$31)
    8264                      .dwattr $C$DW$799, DW_AT_name("Ui_Id")
    8265                      .dwattr $C$DW$799, DW_AT_TI_symbol_name("_Ui_Id")
    8266                      .dwattr $C$DW$799, DW_AT_data_member_location[DW_OP_plus_uconst 0xdc]
    8267                      .dwattr $C$DW$799, DW_AT_accessibility(DW_ACCESS_public)
    8268              
    8269              $C$DW$800       .dwtag  DW_TAG_member
    8270                      .dwattr $C$DW$800, DW_AT_type(*$C$DW$T$31)
    8271                      .dwattr $C$DW$800, DW_AT_name("Ui_Iq")
    8272                      .dwattr $C$DW$800, DW_AT_TI_symbol_name("_Ui_Iq")
    8273                      .dwattr $C$DW$800, DW_AT_data_member_location[DW_OP_plus_uconst 0xde]
    8274                      .dwattr $C$DW$800, DW_AT_accessibility(DW_ACCESS_public)
    8275              
    8276              $C$DW$801       .dwtag  DW_TAG_member
    8277                      .dwattr $C$DW$801, DW_AT_type(*$C$DW$T$31)
    8278                      .dwattr $C$DW$801, DW_AT_name("Ui_spd")
    8279                      .dwattr $C$DW$801, DW_AT_TI_symbol_name("_Ui_spd")
    8280                      .dwattr $C$DW$801, DW_AT_data_member_location[DW_OP_plus_uconst 0xe0]
    8281                      .dwattr $C$DW$801, DW_AT_accessibility(DW_ACCESS_public)
    8282              
    8283              $C$DW$802       .dwtag  DW_TAG_member
    8284                      .dwattr $C$DW$802, DW_AT_type(*$C$DW$T$32)
    8285                      .dwattr $C$DW$802, DW_AT_name("Idq_ref")
    8286                      .dwattr $C$DW$802, DW_AT_TI_symbol_name("_Idq_ref")
    8287                      .dwattr $C$DW$802, DW_AT_data_member_location[DW_OP_plus_uconst 0xe2]
    8288                      .dwattr $C$DW$802, DW_AT_accessibility(DW_ACCESS_public)
    8289              
    8290              $C$DW$803       .dwtag  DW_TAG_member
    8291                      .dwattr $C$DW$803, DW_AT_type(*$C$DW$T$31)
    8292                      .dwattr $C$DW$803, DW_AT_name("IdRated")
    8293                      .dwattr $C$DW$803, DW_AT_TI_symbol_name("_IdRated")
    8294                      .dwattr $C$DW$803, DW_AT_data_member_location[DW_OP_plus_uconst 0xe6]
TMS320C2000 Assembler PC v15.12.3 Wed Nov 22 01:55:16 2017

Tools Copyright (c) 1996-2015 Texas Instruments Incorporated
C:\Users\wmj\AppData\Local\Temp\1673210                              PAGE  157

    8295                      .dwattr $C$DW$803, DW_AT_accessibility(DW_ACCESS_public)
    8296              
    8297              $C$DW$804       .dwtag  DW_TAG_member
    8298                      .dwattr $C$DW$804, DW_AT_type(*$C$DW$T$31)
    8299                      .dwattr $C$DW$804, DW_AT_name("spd_ref")
    8300                      .dwattr $C$DW$804, DW_AT_TI_symbol_name("_spd_ref")
    8301                      .dwattr $C$DW$804, DW_AT_data_member_location[DW_OP_plus_uconst 0xe8]
    8302                      .dwattr $C$DW$804, DW_AT_accessibility(DW_ACCESS_public)
    8303              
    8304              $C$DW$805       .dwtag  DW_TAG_member
    8305                      .dwattr $C$DW$805, DW_AT_type(*$C$DW$T$31)
    8306                      .dwattr $C$DW$805, DW_AT_name("spd_max")
    8307                      .dwattr $C$DW$805, DW_AT_TI_symbol_name("_spd_max")
    8308                      .dwattr $C$DW$805, DW_AT_data_member_location[DW_OP_plus_uconst 0xea]
    8309                      .dwattr $C$DW$805, DW_AT_accessibility(DW_ACCESS_public)
    8310              
    8311              $C$DW$806       .dwtag  DW_TAG_member
    8312                      .dwattr $C$DW$806, DW_AT_type(*$C$DW$T$69)
    8313                      .dwattr $C$DW$806, DW_AT_name("counter_current")
    8314                      .dwattr $C$DW$806, DW_AT_TI_symbol_name("_counter_current")
    8315                      .dwattr $C$DW$806, DW_AT_data_member_location[DW_OP_plus_uconst 0xec]
    8316                      .dwattr $C$DW$806, DW_AT_accessibility(DW_ACCESS_public)
    8317              
    8318              $C$DW$807       .dwtag  DW_TAG_member
    8319                      .dwattr $C$DW$807, DW_AT_type(*$C$DW$T$69)
    8320                      .dwattr $C$DW$807, DW_AT_name("counter_isr")
    8321                      .dwattr $C$DW$807, DW_AT_TI_symbol_name("_counter_isr")
    8322                      .dwattr $C$DW$807, DW_AT_data_member_location[DW_OP_plus_uconst 0xed]
    8323                      .dwattr $C$DW$807, DW_AT_accessibility(DW_ACCESS_public)
    8324              
    8325              $C$DW$808       .dwtag  DW_TAG_member
    8326                      .dwattr $C$DW$808, DW_AT_type(*$C$DW$T$69)
    8327                      .dwattr $C$DW$808, DW_AT_name("counter_speed")
    8328                      .dwattr $C$DW$808, DW_AT_TI_symbol_name("_counter_speed")
    8329                      .dwattr $C$DW$808, DW_AT_data_member_location[DW_OP_plus_uconst 0xee]
    8330                      .dwattr $C$DW$808, DW_AT_accessibility(DW_ACCESS_public)
    8331              
    8332              $C$DW$809       .dwtag  DW_TAG_member
    8333                      .dwattr $C$DW$809, DW_AT_type(*$C$DW$T$69)
    8334                      .dwattr $C$DW$809, DW_AT_name("counter_traj")
    8335                      .dwattr $C$DW$809, DW_AT_TI_symbol_name("_counter_traj")
    8336                      .dwattr $C$DW$809, DW_AT_data_member_location[DW_OP_plus_uconst 0xef]
    8337                      .dwattr $C$DW$809, DW_AT_accessibility(DW_ACCESS_public)
    8338              
    8339              $C$DW$810       .dwtag  DW_TAG_member
    8340                      .dwattr $C$DW$810, DW_AT_type(*$C$DW$T$33)
    8341                      .dwattr $C$DW$810, DW_AT_name("flag_enableCtrl")
    8342                      .dwattr $C$DW$810, DW_AT_TI_symbol_name("_flag_enableCtrl")
    8343                      .dwattr $C$DW$810, DW_AT_data_member_location[DW_OP_plus_uconst 0xf0]
    8344                      .dwattr $C$DW$810, DW_AT_accessibility(DW_ACCESS_public)
    8345              
    8346              $C$DW$811       .dwtag  DW_TAG_member
    8347                      .dwattr $C$DW$811, DW_AT_type(*$C$DW$T$33)
    8348                      .dwattr $C$DW$811, DW_AT_name("flag_enableDcBusComp")
    8349                      .dwattr $C$DW$811, DW_AT_TI_symbol_name("_flag_enableDcBusComp")
TMS320C2000 Assembler PC v15.12.3 Wed Nov 22 01:55:16 2017

Tools Copyright (c) 1996-2015 Texas Instruments Incorporated
C:\Users\wmj\AppData\Local\Temp\1673210                              PAGE  158

    8350                      .dwattr $C$DW$811, DW_AT_data_member_location[DW_OP_plus_uconst 0xf1]
    8351                      .dwattr $C$DW$811, DW_AT_accessibility(DW_ACCESS_public)
    8352              
    8353              $C$DW$812       .dwtag  DW_TAG_member
    8354                      .dwattr $C$DW$812, DW_AT_type(*$C$DW$T$33)
    8355                      .dwattr $C$DW$812, DW_AT_name("flag_enablePowerWarp")
    8356                      .dwattr $C$DW$812, DW_AT_TI_symbol_name("_flag_enablePowerWarp")
    8357                      .dwattr $C$DW$812, DW_AT_data_member_location[DW_OP_plus_uconst 0xf2]
    8358                      .dwattr $C$DW$812, DW_AT_accessibility(DW_ACCESS_public)
    8359              
    8360              $C$DW$813       .dwtag  DW_TAG_member
    8361                      .dwattr $C$DW$813, DW_AT_type(*$C$DW$T$33)
    8362                      .dwattr $C$DW$813, DW_AT_name("flag_enableOffset")
    8363                      .dwattr $C$DW$813, DW_AT_TI_symbol_name("_flag_enableOffset")
    8364                      .dwattr $C$DW$813, DW_AT_data_member_location[DW_OP_plus_uconst 0xf3]
    8365                      .dwattr $C$DW$813, DW_AT_accessibility(DW_ACCESS_public)
    8366              
    8367              $C$DW$814       .dwtag  DW_TAG_member
    8368                      .dwattr $C$DW$814, DW_AT_type(*$C$DW$T$33)
    8369                      .dwattr $C$DW$814, DW_AT_name("flag_enableSpeedCtrl")
    8370                      .dwattr $C$DW$814, DW_AT_TI_symbol_name("_flag_enableSpeedCtrl")
    8371                      .dwattr $C$DW$814, DW_AT_data_member_location[DW_OP_plus_uconst 0xf4]
    8372                      .dwattr $C$DW$814, DW_AT_accessibility(DW_ACCESS_public)
    8373              
    8374              $C$DW$815       .dwtag  DW_TAG_member
    8375                      .dwattr $C$DW$815, DW_AT_type(*$C$DW$T$33)
    8376                      .dwattr $C$DW$815, DW_AT_name("flag_enableUserMotorParams")
    8377                      .dwattr $C$DW$815, DW_AT_TI_symbol_name("_flag_enableUserMotorParams")
    8378                      .dwattr $C$DW$815, DW_AT_data_member_location[DW_OP_plus_uconst 0xf5]
    8379                      .dwattr $C$DW$815, DW_AT_accessibility(DW_ACCESS_public)
    8380              
    8381              $C$DW$816       .dwtag  DW_TAG_member
    8382                      .dwattr $C$DW$816, DW_AT_type(*$C$DW$T$33)
    8383                      .dwattr $C$DW$816, DW_AT_name("flag_enableCurrentCtrl")
    8384                      .dwattr $C$DW$816, DW_AT_TI_symbol_name("_flag_enableCurrentCtrl")
    8385                      .dwattr $C$DW$816, DW_AT_data_member_location[DW_OP_plus_uconst 0xf6]
    8386                      .dwattr $C$DW$816, DW_AT_accessibility(DW_ACCESS_public)
    8387              
    8388              $C$DW$817       .dwtag  DW_TAG_member
    8389                      .dwattr $C$DW$817, DW_AT_type(*$C$DW$T$31)
    8390                      .dwattr $C$DW$817, DW_AT_name("spd_outMaxRatio_pu")
    8391                      .dwattr $C$DW$817, DW_AT_TI_symbol_name("_spd_outMaxRatio_pu")
    8392                      .dwattr $C$DW$817, DW_AT_data_member_location[DW_OP_plus_uconst 0xf8]
    8393                      .dwattr $C$DW$817, DW_AT_accessibility(DW_ACCESS_public)
    8394              
    8395              $C$DW$818       .dwtag  DW_TAG_member
    8396                      .dwattr $C$DW$818, DW_AT_type(*$C$DW$T$31)
    8397                      .dwattr $C$DW$818, DW_AT_name("enc_Angle")
    8398                      .dwattr $C$DW$818, DW_AT_TI_symbol_name("_enc_Angle")
    8399                      .dwattr $C$DW$818, DW_AT_data_member_location[DW_OP_plus_uconst 0xfa]
    8400                      .dwattr $C$DW$818, DW_AT_accessibility(DW_ACCESS_public)
    8401              
    8402              $C$DW$819       .dwtag  DW_TAG_member
    8403                      .dwattr $C$DW$819, DW_AT_type(*$C$DW$T$33)
    8404                      .dwattr $C$DW$819, DW_AT_name("flag_enableEncAngle")
TMS320C2000 Assembler PC v15.12.3 Wed Nov 22 01:55:16 2017

Tools Copyright (c) 1996-2015 Texas Instruments Incorporated
C:\Users\wmj\AppData\Local\Temp\1673210                              PAGE  159

    8405                      .dwattr $C$DW$819, DW_AT_TI_symbol_name("_flag_enableEncAngle")
    8406                      .dwattr $C$DW$819, DW_AT_data_member_location[DW_OP_plus_uconst 0xfc]
    8407                      .dwattr $C$DW$819, DW_AT_accessibility(DW_ACCESS_public)
    8408              
    8409              $C$DW$820       .dwtag  DW_TAG_member
    8410                      .dwattr $C$DW$820, DW_AT_type(*$C$DW$T$72)
    8411                      .dwattr $C$DW$820, DW_AT_name("brakeHandle")
    8412                      .dwattr $C$DW$820, DW_AT_TI_symbol_name("_brakeHandle")
    8413                      .dwattr $C$DW$820, DW_AT_data_member_location[DW_OP_plus_uconst 0xfe]
    8414                      .dwattr $C$DW$820, DW_AT_accessibility(DW_ACCESS_public)
    8415              
    8416              $C$DW$821       .dwtag  DW_TAG_member
    8417                      .dwattr $C$DW$821, DW_AT_type(*$C$DW$T$73)
    8418                      .dwattr $C$DW$821, DW_AT_name("brake")
    8419                      .dwattr $C$DW$821, DW_AT_TI_symbol_name("_brake")
    8420                      .dwattr $C$DW$821, DW_AT_data_member_location[DW_OP_plus_uconst 0x100]
    8421                      .dwattr $C$DW$821, DW_AT_accessibility(DW_ACCESS_public)
    8422              
    8423                      .dwendtag $C$DW$T$74
    8424              
    8425              $C$DW$T$248     .dwtag  DW_TAG_typedef
    8426                      .dwattr $C$DW$T$248, DW_AT_name("CTRL_Obj")
    8427                      .dwattr $C$DW$T$248, DW_AT_type(*$C$DW$T$74)
    8428                      .dwattr $C$DW$T$248, DW_AT_language(DW_LANG_C)
    8429              
    8430              $C$DW$T$210     .dwtag  DW_TAG_pointer_type
    8431                      .dwattr $C$DW$T$210, DW_AT_type(*$C$DW$T$74)
    8432                      .dwattr $C$DW$T$210, DW_AT_address_class(0x20)
    8433              
    8434              $C$DW$T$211     .dwtag  DW_TAG_typedef
    8435                      .dwattr $C$DW$T$211, DW_AT_name("CTRL_Handle")
    8436                      .dwattr $C$DW$T$211, DW_AT_type(*$C$DW$T$210)
    8437                      .dwattr $C$DW$T$211, DW_AT_language(DW_LANG_C)
    8438              
    8439              $C$DW$822       .dwtag  DW_TAG_TI_far_type
    8440                      .dwattr $C$DW$822, DW_AT_type(*$C$DW$T$211)
    8441              
    8442              $C$DW$T$249     .dwtag  DW_TAG_const_type
    8443                      .dwattr $C$DW$T$249, DW_AT_type(*$C$DW$822)
    8444              
    8445              
    8446              $C$DW$T$77      .dwtag  DW_TAG_structure_type
    8447                      .dwattr $C$DW$T$77, DW_AT_name("_CTRL_Version_")
    8448                      .dwattr $C$DW$T$77, DW_AT_byte_size(0x04)
    8449              $C$DW$823       .dwtag  DW_TAG_member
    8450                      .dwattr $C$DW$823, DW_AT_type(*$C$DW$T$22)
    8451                      .dwattr $C$DW$823, DW_AT_name("rsvd")
    8452                      .dwattr $C$DW$823, DW_AT_TI_symbol_name("_rsvd")
    8453                      .dwattr $C$DW$823, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    8454                      .dwattr $C$DW$823, DW_AT_accessibility(DW_ACCESS_public)
    8455              
    8456              $C$DW$824       .dwtag  DW_TAG_member
    8457                      .dwattr $C$DW$824, DW_AT_type(*$C$DW$T$76)
    8458                      .dwattr $C$DW$824, DW_AT_name("targetProc")
    8459                      .dwattr $C$DW$824, DW_AT_TI_symbol_name("_targetProc")
TMS320C2000 Assembler PC v15.12.3 Wed Nov 22 01:55:16 2017

Tools Copyright (c) 1996-2015 Texas Instruments Incorporated
C:\Users\wmj\AppData\Local\Temp\1673210                              PAGE  160

    8460                      .dwattr $C$DW$824, DW_AT_data_member_location[DW_OP_plus_uconst 0x1]
    8461                      .dwattr $C$DW$824, DW_AT_accessibility(DW_ACCESS_public)
    8462              
    8463              $C$DW$825       .dwtag  DW_TAG_member
    8464                      .dwattr $C$DW$825, DW_AT_type(*$C$DW$T$22)
    8465                      .dwattr $C$DW$825, DW_AT_name("major")
    8466                      .dwattr $C$DW$825, DW_AT_TI_symbol_name("_major")
    8467                      .dwattr $C$DW$825, DW_AT_data_member_location[DW_OP_plus_uconst 0x2]
    8468                      .dwattr $C$DW$825, DW_AT_accessibility(DW_ACCESS_public)
    8469              
    8470              $C$DW$826       .dwtag  DW_TAG_member
    8471                      .dwattr $C$DW$826, DW_AT_type(*$C$DW$T$22)
    8472                      .dwattr $C$DW$826, DW_AT_name("minor")
    8473                      .dwattr $C$DW$826, DW_AT_TI_symbol_name("_minor")
    8474                      .dwattr $C$DW$826, DW_AT_data_member_location[DW_OP_plus_uconst 0x3]
    8475                      .dwattr $C$DW$826, DW_AT_accessibility(DW_ACCESS_public)
    8476              
    8477                      .dwendtag $C$DW$T$77
    8478              
    8479              $C$DW$T$40      .dwtag  DW_TAG_typedef
    8480                      .dwattr $C$DW$T$40, DW_AT_name("CTRL_Version")
    8481                      .dwattr $C$DW$T$40, DW_AT_type(*$C$DW$T$77)
    8482                      .dwattr $C$DW$T$40, DW_AT_language(DW_LANG_C)
    8483              
    8484              
    8485              $C$DW$T$19      .dwtag  DW_TAG_structure_type
    8486                      .dwattr $C$DW$T$19, DW_AT_name("_EST_Obj_")
    8487                      .dwattr $C$DW$T$19, DW_AT_declaration
    8488                      .dwendtag $C$DW$T$19
    8489              
    8490              $C$DW$T$48      .dwtag  DW_TAG_pointer_type
    8491                      .dwattr $C$DW$T$48, DW_AT_type(*$C$DW$T$19)
    8492                      .dwattr $C$DW$T$48, DW_AT_address_class(0x20)
    8493              
    8494              $C$DW$T$49      .dwtag  DW_TAG_typedef
    8495                      .dwattr $C$DW$T$49, DW_AT_name("EST_Handle")
    8496                      .dwattr $C$DW$T$49, DW_AT_type(*$C$DW$T$48)
    8497                      .dwattr $C$DW$T$49, DW_AT_language(DW_LANG_C)
    8498              
    8499              
    8500              $C$DW$T$78      .dwtag  DW_TAG_structure_type
    8501                      .dwattr $C$DW$T$78, DW_AT_name("_FILTER_FO_")
    8502                      .dwattr $C$DW$T$78, DW_AT_byte_size(0x0a)
    8503              $C$DW$827       .dwtag  DW_TAG_member
    8504                      .dwattr $C$DW$827, DW_AT_type(*$C$DW$T$31)
    8505                      .dwattr $C$DW$827, DW_AT_name("a1")
    8506                      .dwattr $C$DW$827, DW_AT_TI_symbol_name("_a1")
    8507                      .dwattr $C$DW$827, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    8508                      .dwattr $C$DW$827, DW_AT_accessibility(DW_ACCESS_public)
    8509              
    8510              $C$DW$828       .dwtag  DW_TAG_member
    8511                      .dwattr $C$DW$828, DW_AT_type(*$C$DW$T$31)
    8512                      .dwattr $C$DW$828, DW_AT_name("b0")
    8513                      .dwattr $C$DW$828, DW_AT_TI_symbol_name("_b0")
    8514                      .dwattr $C$DW$828, DW_AT_data_member_location[DW_OP_plus_uconst 0x2]
TMS320C2000 Assembler PC v15.12.3 Wed Nov 22 01:55:16 2017

Tools Copyright (c) 1996-2015 Texas Instruments Incorporated
C:\Users\wmj\AppData\Local\Temp\1673210                              PAGE  161

    8515                      .dwattr $C$DW$828, DW_AT_accessibility(DW_ACCESS_public)
    8516              
    8517              $C$DW$829       .dwtag  DW_TAG_member
    8518                      .dwattr $C$DW$829, DW_AT_type(*$C$DW$T$31)
    8519                      .dwattr $C$DW$829, DW_AT_name("b1")
    8520                      .dwattr $C$DW$829, DW_AT_TI_symbol_name("_b1")
    8521                      .dwattr $C$DW$829, DW_AT_data_member_location[DW_OP_plus_uconst 0x4]
    8522                      .dwattr $C$DW$829, DW_AT_accessibility(DW_ACCESS_public)
    8523              
    8524              $C$DW$830       .dwtag  DW_TAG_member
    8525                      .dwattr $C$DW$830, DW_AT_type(*$C$DW$T$31)
    8526                      .dwattr $C$DW$830, DW_AT_name("x1")
    8527                      .dwattr $C$DW$830, DW_AT_TI_symbol_name("_x1")
    8528                      .dwattr $C$DW$830, DW_AT_data_member_location[DW_OP_plus_uconst 0x6]
    8529                      .dwattr $C$DW$830, DW_AT_accessibility(DW_ACCESS_public)
    8530              
    8531              $C$DW$831       .dwtag  DW_TAG_member
    8532                      .dwattr $C$DW$831, DW_AT_type(*$C$DW$T$31)
    8533                      .dwattr $C$DW$831, DW_AT_name("y1")
    8534                      .dwattr $C$DW$831, DW_AT_TI_symbol_name("_y1")
    8535                      .dwattr $C$DW$831, DW_AT_data_member_location[DW_OP_plus_uconst 0x8]
    8536                      .dwattr $C$DW$831, DW_AT_accessibility(DW_ACCESS_public)
    8537              
    8538                      .dwendtag $C$DW$T$78
    8539              
    8540              $C$DW$T$191     .dwtag  DW_TAG_typedef
    8541                      .dwattr $C$DW$T$191, DW_AT_name("FILTER_FO_Obj")
    8542                      .dwattr $C$DW$T$191, DW_AT_type(*$C$DW$T$78)
    8543                      .dwattr $C$DW$T$191, DW_AT_language(DW_LANG_C)
    8544              
    8545              
    8546              $C$DW$T$20      .dwtag  DW_TAG_structure_type
    8547                      .dwattr $C$DW$T$20, DW_AT_name("_FILTER_FO_Obj_")
    8548                      .dwattr $C$DW$T$20, DW_AT_declaration
    8549                      .dwendtag $C$DW$T$20
    8550              
    8551              $C$DW$T$192     .dwtag  DW_TAG_pointer_type
    8552                      .dwattr $C$DW$T$192, DW_AT_type(*$C$DW$T$20)
    8553                      .dwattr $C$DW$T$192, DW_AT_address_class(0x20)
    8554              
    8555              $C$DW$T$193     .dwtag  DW_TAG_typedef
    8556                      .dwattr $C$DW$T$193, DW_AT_name("FILTER_FO_Handle")
    8557                      .dwattr $C$DW$T$193, DW_AT_type(*$C$DW$T$192)
    8558                      .dwattr $C$DW$T$193, DW_AT_language(DW_LANG_C)
    8559              
    8560              
    8561              $C$DW$T$79      .dwtag  DW_TAG_structure_type
    8562                      .dwattr $C$DW$T$79, DW_AT_name("_FLASH_Obj_")
    8563                      .dwattr $C$DW$T$79, DW_AT_byte_size(0x08)
    8564              $C$DW$832       .dwtag  DW_TAG_member
    8565                      .dwattr $C$DW$832, DW_AT_type(*$C$DW$T$23)
    8566                      .dwattr $C$DW$832, DW_AT_name("FOPT")
    8567                      .dwattr $C$DW$832, DW_AT_TI_symbol_name("_FOPT")
    8568                      .dwattr $C$DW$832, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    8569                      .dwattr $C$DW$832, DW_AT_accessibility(DW_ACCESS_public)
TMS320C2000 Assembler PC v15.12.3 Wed Nov 22 01:55:16 2017

Tools Copyright (c) 1996-2015 Texas Instruments Incorporated
C:\Users\wmj\AppData\Local\Temp\1673210                              PAGE  162

    8570              
    8571              $C$DW$833       .dwtag  DW_TAG_member
    8572                      .dwattr $C$DW$833, DW_AT_type(*$C$DW$T$23)
    8573                      .dwattr $C$DW$833, DW_AT_name("rsvd_1")
    8574                      .dwattr $C$DW$833, DW_AT_TI_symbol_name("_rsvd_1")
    8575                      .dwattr $C$DW$833, DW_AT_data_member_location[DW_OP_plus_uconst 0x1]
    8576                      .dwattr $C$DW$833, DW_AT_accessibility(DW_ACCESS_public)
    8577              
    8578              $C$DW$834       .dwtag  DW_TAG_member
    8579                      .dwattr $C$DW$834, DW_AT_type(*$C$DW$T$23)
    8580                      .dwattr $C$DW$834, DW_AT_name("FPWR")
    8581                      .dwattr $C$DW$834, DW_AT_TI_symbol_name("_FPWR")
    8582                      .dwattr $C$DW$834, DW_AT_data_member_location[DW_OP_plus_uconst 0x2]
    8583                      .dwattr $C$DW$834, DW_AT_accessibility(DW_ACCESS_public)
    8584              
    8585              $C$DW$835       .dwtag  DW_TAG_member
    8586                      .dwattr $C$DW$835, DW_AT_type(*$C$DW$T$23)
    8587                      .dwattr $C$DW$835, DW_AT_name("FSTATUS")
    8588                      .dwattr $C$DW$835, DW_AT_TI_symbol_name("_FSTATUS")
    8589                      .dwattr $C$DW$835, DW_AT_data_member_location[DW_OP_plus_uconst 0x3]
    8590                      .dwattr $C$DW$835, DW_AT_accessibility(DW_ACCESS_public)
    8591              
    8592              $C$DW$836       .dwtag  DW_TAG_member
    8593                      .dwattr $C$DW$836, DW_AT_type(*$C$DW$T$23)
    8594                      .dwattr $C$DW$836, DW_AT_name("FSTDBYWAIT")
    8595                      .dwattr $C$DW$836, DW_AT_TI_symbol_name("_FSTDBYWAIT")
    8596                      .dwattr $C$DW$836, DW_AT_data_member_location[DW_OP_plus_uconst 0x4]
    8597                      .dwattr $C$DW$836, DW_AT_accessibility(DW_ACCESS_public)
    8598              
    8599              $C$DW$837       .dwtag  DW_TAG_member
    8600                      .dwattr $C$DW$837, DW_AT_type(*$C$DW$T$23)
    8601                      .dwattr $C$DW$837, DW_AT_name("FACTIVEWAIT")
    8602                      .dwattr $C$DW$837, DW_AT_TI_symbol_name("_FACTIVEWAIT")
    8603                      .dwattr $C$DW$837, DW_AT_data_member_location[DW_OP_plus_uconst 0x5]
    8604                      .dwattr $C$DW$837, DW_AT_accessibility(DW_ACCESS_public)
    8605              
    8606              $C$DW$838       .dwtag  DW_TAG_member
    8607                      .dwattr $C$DW$838, DW_AT_type(*$C$DW$T$23)
    8608                      .dwattr $C$DW$838, DW_AT_name("FBANKWAIT")
    8609                      .dwattr $C$DW$838, DW_AT_TI_symbol_name("_FBANKWAIT")
    8610                      .dwattr $C$DW$838, DW_AT_data_member_location[DW_OP_plus_uconst 0x6]
    8611                      .dwattr $C$DW$838, DW_AT_accessibility(DW_ACCESS_public)
    8612              
    8613              $C$DW$839       .dwtag  DW_TAG_member
    8614                      .dwattr $C$DW$839, DW_AT_type(*$C$DW$T$23)
    8615                      .dwattr $C$DW$839, DW_AT_name("FOTPWAIT")
    8616                      .dwattr $C$DW$839, DW_AT_TI_symbol_name("_FOTPWAIT")
    8617                      .dwattr $C$DW$839, DW_AT_data_member_location[DW_OP_plus_uconst 0x7]
    8618                      .dwattr $C$DW$839, DW_AT_accessibility(DW_ACCESS_public)
    8619              
    8620                      .dwendtag $C$DW$T$79
    8621              
    8622              $C$DW$T$124     .dwtag  DW_TAG_pointer_type
    8623                      .dwattr $C$DW$T$124, DW_AT_type(*$C$DW$T$79)
    8624                      .dwattr $C$DW$T$124, DW_AT_address_class(0x20)
TMS320C2000 Assembler PC v15.12.3 Wed Nov 22 01:55:16 2017

Tools Copyright (c) 1996-2015 Texas Instruments Incorporated
C:\Users\wmj\AppData\Local\Temp\1673210                              PAGE  163

    8625              
    8626              $C$DW$T$125     .dwtag  DW_TAG_typedef
    8627                      .dwattr $C$DW$T$125, DW_AT_name("FLASH_Handle")
    8628                      .dwattr $C$DW$T$125, DW_AT_type(*$C$DW$T$124)
    8629                      .dwattr $C$DW$T$125, DW_AT_language(DW_LANG_C)
    8630              
    8631              
    8632              $C$DW$T$99      .dwtag  DW_TAG_structure_type
    8633                      .dwattr $C$DW$T$99, DW_AT_name("_FSM_Obj_")
    8634                      .dwattr $C$DW$T$99, DW_AT_byte_size(0x26)
    8635              $C$DW$840       .dwtag  DW_TAG_member
    8636                      .dwattr $C$DW$840, DW_AT_type(*$C$DW$T$81)
    8637                      .dwattr $C$DW$840, DW_AT_name("motorHandle")
    8638                      .dwattr $C$DW$840, DW_AT_TI_symbol_name("_motorHandle")
    8639                      .dwattr $C$DW$840, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    8640                      .dwattr $C$DW$840, DW_AT_accessibility(DW_ACCESS_public)
    8641              
    8642              $C$DW$841       .dwtag  DW_TAG_member
    8643                      .dwattr $C$DW$841, DW_AT_type(*$C$DW$T$83)
    8644                      .dwattr $C$DW$841, DW_AT_name("halHandle")
    8645                      .dwattr $C$DW$841, DW_AT_TI_symbol_name("_halHandle")
    8646                      .dwattr $C$DW$841, DW_AT_data_member_location[DW_OP_plus_uconst 0x2]
    8647                      .dwattr $C$DW$841, DW_AT_accessibility(DW_ACCESS_public)
    8648              
    8649              $C$DW$842       .dwtag  DW_TAG_member
    8650                      .dwattr $C$DW$842, DW_AT_type(*$C$DW$T$85)
    8651                      .dwattr $C$DW$842, DW_AT_name("StBoxHandle")
    8652                      .dwattr $C$DW$842, DW_AT_TI_symbol_name("_StBoxHandle")
    8653                      .dwattr $C$DW$842, DW_AT_data_member_location[DW_OP_plus_uconst 0x4]
    8654                      .dwattr $C$DW$842, DW_AT_accessibility(DW_ACCESS_public)
    8655              
    8656              $C$DW$843       .dwtag  DW_TAG_member
    8657                      .dwattr $C$DW$843, DW_AT_type(*$C$DW$T$87)
    8658                      .dwattr $C$DW$843, DW_AT_name("FSM_State")
    8659                      .dwattr $C$DW$843, DW_AT_TI_symbol_name("_FSM_State")
    8660                      .dwattr $C$DW$843, DW_AT_data_member_location[DW_OP_plus_uconst 0x6]
    8661                      .dwattr $C$DW$843, DW_AT_accessibility(DW_ACCESS_public)
    8662              
    8663              $C$DW$844       .dwtag  DW_TAG_member
    8664                      .dwattr $C$DW$844, DW_AT_type(*$C$DW$T$87)
    8665                      .dwattr $C$DW$844, DW_AT_name("FSM_CurState")
    8666                      .dwattr $C$DW$844, DW_AT_TI_symbol_name("_FSM_CurState")
    8667                      .dwattr $C$DW$844, DW_AT_data_member_location[DW_OP_plus_uconst 0x7]
    8668                      .dwattr $C$DW$844, DW_AT_accessibility(DW_ACCESS_public)
    8669              
    8670              $C$DW$845       .dwtag  DW_TAG_member
    8671                      .dwattr $C$DW$845, DW_AT_type(*$C$DW$T$89)
    8672                      .dwattr $C$DW$845, DW_AT_name("FSM_Trans")
    8673                      .dwattr $C$DW$845, DW_AT_TI_symbol_name("_FSM_Trans")
    8674                      .dwattr $C$DW$845, DW_AT_data_member_location[DW_OP_plus_uconst 0x8]
    8675                      .dwattr $C$DW$845, DW_AT_accessibility(DW_ACCESS_public)
    8676              
    8677              $C$DW$846       .dwtag  DW_TAG_member
    8678                      .dwattr $C$DW$846, DW_AT_type(*$C$DW$T$91)
    8679                      .dwattr $C$DW$846, DW_AT_name("FSM_Event")
TMS320C2000 Assembler PC v15.12.3 Wed Nov 22 01:55:16 2017

Tools Copyright (c) 1996-2015 Texas Instruments Incorporated
C:\Users\wmj\AppData\Local\Temp\1673210                              PAGE  164

    8680                      .dwattr $C$DW$846, DW_AT_TI_symbol_name("_FSM_Event")
    8681                      .dwattr $C$DW$846, DW_AT_data_member_location[DW_OP_plus_uconst 0x9]
