TMS320C2000 Assembler PC v6.2.5 Wed Nov 22 14:48:17 2017

Tools Copyright (c) 1996-2014 Texas Instruments Incorporated
C:\Users\wmj\AppData\Local\Temp\1398010                              PAGE    1

       1              ;***************************************************************
       2              ;* TMS320C2000 C/C++ Codegen                         PC v6.2.5 *
       3              ;* Date/Time created: Wed Nov 22 14:48:17 2017                 *
       4              ;***************************************************************
       5                      .compiler_opts --float_support=softlib --hll_source=on --mem_model:code=flat --mem_model:data=large -
       6        0002  FP      .set    XAR2
       7              
       8              $C$DW$CU        .dwtag  DW_TAG_compile_unit
       9                      .dwattr $C$DW$CU, DW_AT_name("D:/BM1000_v1.1/sw/drivers/drvic/process_ctrl.c")
      10                      .dwattr $C$DW$CU, DW_AT_producer("TMS320C2000 C/C++ Codegen PC v6.2.5 Copyright (c) 1996-2014 Texas I
      11                      .dwattr $C$DW$CU, DW_AT_TI_version(0x01)
      12                      .dwattr $C$DW$CU, DW_AT_comp_dir("D:\BM1000_v1.1\sw\solutions\instaspin_foc\boards\hvkit_rev1p1\f28x\
      13              ;**************************************************************
      14              ;* CINIT RECORDS                                              *

    5990              $C$DW$694       .dwtag  DW_TAG_enumerator, DW_AT_name("USER_ErrorCode_IdRatedFraction_indEst_Low"), DW_AT_con
    5991              $C$DW$695       .dwtag  DW_TAG_enumerator, DW_AT_name("USER_ErrorCode_IdRatedFraction_ratedFlux_High"), DW_AT
    5992              $C$DW$696       .dwtag  DW_TAG_enumerator, DW_AT_name("USER_ErrorCode_IdRatedFraction_ratedFlux_Low"), DW_AT_
    5993              $C$DW$697       .dwtag  DW_TAG_enumerator, DW_AT_name("USER_ErrorCode_IdRated_delta_High"), DW_AT_const_value
    5994              $C$DW$698       .dwtag  DW_TAG_enumerator, DW_AT_name("USER_ErrorCode_IdRated_delta_Low"), DW_AT_const_value(
    5995              $C$DW$699       .dwtag  DW_TAG_enumerator, DW_AT_name("USER_ErrorCode_fluxEstFreq_Hz_High"), DW_AT_const_valu
    5996              $C$DW$700       .dwtag  DW_TAG_enumerator, DW_AT_name("USER_ErrorCode_fluxEstFreq_Hz_Low"), DW_AT_const_value
    5997              $C$DW$701       .dwtag  DW_TAG_enumerator, DW_AT_name("USER_ErrorCode_ctrlFreq_Hz_High"), DW_AT_const_value(0
    5998              $C$DW$702       .dwtag  DW_TAG_enumerator, DW_AT_name("USER_ErrorCode_ctrlFreq_Hz_Low"), DW_AT_const_value(0x
    5999              $C$DW$703       .dwtag  DW_TAG_enumerator, DW_AT_name("USER_ErrorCode_estFreq_Hz_High"), DW_AT_const_value(0x
    6000              $C$DW$704       .dwtag  DW_TAG_enumerator, DW_AT_name("USER_ErrorCode_estFreq_Hz_Low"), DW_AT_const_value(0x6
    6001              $C$DW$705       .dwtag  DW_TAG_enumerator, DW_AT_name("USER_ErrorCode_RoverL_estFreq_Hz_High"), DW_AT_const_v
    6002              $C$DW$706       .dwtag  DW_TAG_enumerator, DW_AT_name("USER_ErrorCode_RoverL_estFreq_Hz_Low"), DW_AT_const_va
    6003              $C$DW$707       .dwtag  DW_TAG_enumerator, DW_AT_name("USER_ErrorCode_trajFreq_Hz_High"), DW_AT_const_value(0
    6004              $C$DW$708       .dwtag  DW_TAG_enumerator, DW_AT_name("USER_ErrorCode_trajFreq_Hz_Low"), DW_AT_const_value(0x
    6005              $C$DW$709       .dwtag  DW_TAG_enumerator, DW_AT_name("USER_ErrorCode_ctrlPeriod_sec_High"), DW_AT_const_valu
    6006              $C$DW$710       .dwtag  DW_TAG_enumerator, DW_AT_name("USER_ErrorCode_ctrlPeriod_sec_Low"), DW_AT_const_value
    6007              $C$DW$711       .dwtag  DW_TAG_enumerator, DW_AT_name("USER_ErrorCode_maxNegativeIdCurrent_a_High"), DW_AT_co
    6008              $C$DW$712       .dwtag  DW_TAG_enumerator, DW_AT_name("USER_ErrorCode_maxNegativeIdCurrent_a_Low"), DW_AT_con
    6009              $C$DW$713       .dwtag  DW_TAG_enumerator, DW_AT_name("USER_numErrorCodes"), DW_AT_const_value(0x6a)
    6010                      .dwendtag $C$DW$T$184
    6011              
    6012              $C$DW$T$185     .dwtag  DW_TAG_typedef, DW_AT_name("USER_ErrorCode_e")
    6013                      .dwattr $C$DW$T$185, DW_AT_type(*$C$DW$T$184)
    6014                      .dwattr $C$DW$T$185, DW_AT_language(DW_LANG_C)
    6015              
    6016              $C$DW$T$188     .dwtag  DW_TAG_enumeration_type
    6017                      .dwattr $C$DW$T$188, DW_AT_byte_size(0x01)
    6018              $C$DW$714       .dwtag  DW_TAG_enumerator, DW_AT_name("MOTOR_Type_Induction"), DW_AT_const_value(0x00)
    6019              $C$DW$715       .dwtag  DW_TAG_enumerator, DW_AT_name("MOTOR_Type_Pm"), DW_AT_const_value(0x01)
    6020                      .dwendtag $C$DW$T$188
    6021              
    6022              $C$DW$T$189     .dwtag  DW_TAG_typedef, DW_AT_name("MOTOR_Type_e")
    6023                      .dwattr $C$DW$T$189, DW_AT_type(*$C$DW$T$188)
    6024                      .dwattr $C$DW$T$189, DW_AT_language(DW_LANG_C)
    6025              
    6026              $C$DW$T$242     .dwtag  DW_TAG_enumeration_type
    6027                      .dwattr $C$DW$T$242, DW_AT_byte_size(0x01)
    6028              $C$DW$716       .dwtag  DW_TAG_enumerator, DW_AT_name("CTRL_Type_PID_spd"), DW_AT_const_value(0x00)
    6029              $C$DW$717       .dwtag  DW_TAG_enumerator, DW_AT_name("CTRL_Type_PID_Id"), DW_AT_const_value(0x01)
    6030              $C$DW$718       .dwtag  DW_TAG_enumerator, DW_AT_name("CTRL_Type_PID_Iq"), DW_AT_const_value(0x02)
    6031                      .dwendtag $C$DW$T$242
    6032              
    6033              $C$DW$T$243     .dwtag  DW_TAG_typedef, DW_AT_name("CTRL_Type_e")
    6034                      .dwattr $C$DW$T$243, DW_AT_type(*$C$DW$T$242)
    6035                      .dwattr $C$DW$T$243, DW_AT_language(DW_LANG_C)
    6036              
    6037              $C$DW$T$245     .dwtag  DW_TAG_enumeration_type
    6038                      .dwattr $C$DW$T$245, DW_AT_byte_size(0x01)
    6039              $C$DW$719       .dwtag  DW_TAG_enumerator, DW_AT_name("HAL_SensorType_Current"), DW_AT_const_value(0x00)
    6040              $C$DW$720       .dwtag  DW_TAG_enumerator, DW_AT_name("HAL_SensorType_Voltage"), DW_AT_const_value(0x01)
    6041                      .dwendtag $C$DW$T$245
    6042              
    6043              $C$DW$T$246     .dwtag  DW_TAG_typedef, DW_AT_name("HAL_SensorType_e")
    6044                      .dwattr $C$DW$T$246, DW_AT_type(*$C$DW$T$245)
TMS320C2000 Assembler PC v6.2.5 Wed Nov 22 14:48:17 2017

Tools Copyright (c) 1996-2014 Texas Instruments Incorporated
C:\Users\wmj\AppData\Local\Temp\1398010                              PAGE  116

    6045                      .dwattr $C$DW$T$246, DW_AT_language(DW_LANG_C)
    6046              
    6047              $C$DW$T$30      .dwtag  DW_TAG_structure_type
    6048                      .dwattr $C$DW$T$30, DW_AT_name("_ADC_Obj_")
    6049                      .dwattr $C$DW$T$30, DW_AT_byte_size(0x6650)
    6050              $C$DW$721       .dwtag  DW_TAG_member
    6051                      .dwattr $C$DW$721, DW_AT_type(*$C$DW$T$24)
    6052                      .dwattr $C$DW$721, DW_AT_name("ADCRESULT")
    6053                      .dwattr $C$DW$721, DW_AT_TI_symbol_name("_ADCRESULT")
    6054                      .dwattr $C$DW$721, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    6055                      .dwattr $C$DW$721, DW_AT_accessibility(DW_ACCESS_public)
    6056              $C$DW$722       .dwtag  DW_TAG_member
    6057                      .dwattr $C$DW$722, DW_AT_type(*$C$DW$T$25)
    6058                      .dwattr $C$DW$722, DW_AT_name("resvd_1")
    6059                      .dwattr $C$DW$722, DW_AT_TI_symbol_name("_resvd_1")
    6060                      .dwattr $C$DW$722, DW_AT_data_member_location[DW_OP_plus_uconst 0x10]
    6061                      .dwattr $C$DW$722, DW_AT_accessibility(DW_ACCESS_public)
    6062              $C$DW$723       .dwtag  DW_TAG_member
    6063                      .dwattr $C$DW$723, DW_AT_type(*$C$DW$T$23)
    6064                      .dwattr $C$DW$723, DW_AT_name("ADCCTL1")
    6065                      .dwattr $C$DW$723, DW_AT_TI_symbol_name("_ADCCTL1")
    6066                      .dwattr $C$DW$723, DW_AT_data_member_location[DW_OP_plus_uconst 0x6600]
    6067                      .dwattr $C$DW$723, DW_AT_accessibility(DW_ACCESS_public)
    6068              $C$DW$724       .dwtag  DW_TAG_member
    6069                      .dwattr $C$DW$724, DW_AT_type(*$C$DW$T$23)
    6070                      .dwattr $C$DW$724, DW_AT_name("ADCCTL2")
    6071                      .dwattr $C$DW$724, DW_AT_TI_symbol_name("_ADCCTL2")
    6072                      .dwattr $C$DW$724, DW_AT_data_member_location[DW_OP_plus_uconst 0x6601]
    6073                      .dwattr $C$DW$724, DW_AT_accessibility(DW_ACCESS_public)
    6074              $C$DW$725       .dwtag  DW_TAG_member
    6075                      .dwattr $C$DW$725, DW_AT_type(*$C$DW$T$26)
    6076                      .dwattr $C$DW$725, DW_AT_name("rsvd_2")
    6077                      .dwattr $C$DW$725, DW_AT_TI_symbol_name("_rsvd_2")
    6078                      .dwattr $C$DW$725, DW_AT_data_member_location[DW_OP_plus_uconst 0x6602]
    6079                      .dwattr $C$DW$725, DW_AT_accessibility(DW_ACCESS_public)
    6080              $C$DW$726       .dwtag  DW_TAG_member
    6081                      .dwattr $C$DW$726, DW_AT_type(*$C$DW$T$23)
    6082                      .dwattr $C$DW$726, DW_AT_name("ADCINTFLG")
    6083                      .dwattr $C$DW$726, DW_AT_TI_symbol_name("_ADCINTFLG")
    6084                      .dwattr $C$DW$726, DW_AT_data_member_location[DW_OP_plus_uconst 0x6604]
    6085                      .dwattr $C$DW$726, DW_AT_accessibility(DW_ACCESS_public)
    6086              $C$DW$727       .dwtag  DW_TAG_member
    6087                      .dwattr $C$DW$727, DW_AT_type(*$C$DW$T$23)
    6088                      .dwattr $C$DW$727, DW_AT_name("ADCINTFLGCLR")
    6089                      .dwattr $C$DW$727, DW_AT_TI_symbol_name("_ADCINTFLGCLR")
    6090                      .dwattr $C$DW$727, DW_AT_data_member_location[DW_OP_plus_uconst 0x6605]
    6091                      .dwattr $C$DW$727, DW_AT_accessibility(DW_ACCESS_public)
    6092              $C$DW$728       .dwtag  DW_TAG_member
    6093                      .dwattr $C$DW$728, DW_AT_type(*$C$DW$T$23)
    6094                      .dwattr $C$DW$728, DW_AT_name("ADCINTOVF")
    6095                      .dwattr $C$DW$728, DW_AT_TI_symbol_name("_ADCINTOVF")
    6096                      .dwattr $C$DW$728, DW_AT_data_member_location[DW_OP_plus_uconst 0x6606]
    6097                      .dwattr $C$DW$728, DW_AT_accessibility(DW_ACCESS_public)
    6098              $C$DW$729       .dwtag  DW_TAG_member
    6099                      .dwattr $C$DW$729, DW_AT_type(*$C$DW$T$23)
TMS320C2000 Assembler PC v6.2.5 Wed Nov 22 14:48:17 2017

Tools Copyright (c) 1996-2014 Texas Instruments Incorporated
C:\Users\wmj\AppData\Local\Temp\1398010                              PAGE  117

    6100                      .dwattr $C$DW$729, DW_AT_name("ADCINTOVFCLR")
    6101                      .dwattr $C$DW$729, DW_AT_TI_symbol_name("_ADCINTOVFCLR")
    6102                      .dwattr $C$DW$729, DW_AT_data_member_location[DW_OP_plus_uconst 0x6607]
    6103                      .dwattr $C$DW$729, DW_AT_accessibility(DW_ACCESS_public)
    6104              $C$DW$730       .dwtag  DW_TAG_member
    6105                      .dwattr $C$DW$730, DW_AT_type(*$C$DW$T$27)
    6106                      .dwattr $C$DW$730, DW_AT_name("INTSELxNy")
    6107                      .dwattr $C$DW$730, DW_AT_TI_symbol_name("_INTSELxNy")
    6108                      .dwattr $C$DW$730, DW_AT_data_member_location[DW_OP_plus_uconst 0x6608]
    6109                      .dwattr $C$DW$730, DW_AT_accessibility(DW_ACCESS_public)
    6110              $C$DW$731       .dwtag  DW_TAG_member
    6111                      .dwattr $C$DW$731, DW_AT_type(*$C$DW$T$28)
    6112                      .dwattr $C$DW$731, DW_AT_name("rsvd_3")
    6113                      .dwattr $C$DW$731, DW_AT_TI_symbol_name("_rsvd_3")
    6114                      .dwattr $C$DW$731, DW_AT_data_member_location[DW_OP_plus_uconst 0x660d]
    6115                      .dwattr $C$DW$731, DW_AT_accessibility(DW_ACCESS_public)
    6116              $C$DW$732       .dwtag  DW_TAG_member
    6117                      .dwattr $C$DW$732, DW_AT_type(*$C$DW$T$23)
    6118                      .dwattr $C$DW$732, DW_AT_name("SOCPRICTRL")
    6119                      .dwattr $C$DW$732, DW_AT_TI_symbol_name("_SOCPRICTRL")
    6120                      .dwattr $C$DW$732, DW_AT_data_member_location[DW_OP_plus_uconst 0x6610]
    6121                      .dwattr $C$DW$732, DW_AT_accessibility(DW_ACCESS_public)
    6122              $C$DW$733       .dwtag  DW_TAG_member
    6123                      .dwattr $C$DW$733, DW_AT_type(*$C$DW$T$23)
    6124                      .dwattr $C$DW$733, DW_AT_name("rsvd_4")
    6125                      .dwattr $C$DW$733, DW_AT_TI_symbol_name("_rsvd_4")
    6126                      .dwattr $C$DW$733, DW_AT_data_member_location[DW_OP_plus_uconst 0x6611]
    6127                      .dwattr $C$DW$733, DW_AT_accessibility(DW_ACCESS_public)
    6128              $C$DW$734       .dwtag  DW_TAG_member
    6129                      .dwattr $C$DW$734, DW_AT_type(*$C$DW$T$23)
    6130                      .dwattr $C$DW$734, DW_AT_name("ADCSAMPLEMODE")
    6131                      .dwattr $C$DW$734, DW_AT_TI_symbol_name("_ADCSAMPLEMODE")
    6132                      .dwattr $C$DW$734, DW_AT_data_member_location[DW_OP_plus_uconst 0x6612]
    6133                      .dwattr $C$DW$734, DW_AT_accessibility(DW_ACCESS_public)
    6134              $C$DW$735       .dwtag  DW_TAG_member
    6135                      .dwattr $C$DW$735, DW_AT_type(*$C$DW$T$23)
    6136                      .dwattr $C$DW$735, DW_AT_name("rsvd_5")
    6137                      .dwattr $C$DW$735, DW_AT_TI_symbol_name("_rsvd_5")
    6138                      .dwattr $C$DW$735, DW_AT_data_member_location[DW_OP_plus_uconst 0x6613]
    6139                      .dwattr $C$DW$735, DW_AT_accessibility(DW_ACCESS_public)
    6140              $C$DW$736       .dwtag  DW_TAG_member
    6141                      .dwattr $C$DW$736, DW_AT_type(*$C$DW$T$23)
    6142                      .dwattr $C$DW$736, DW_AT_name("ADCINTSOCSEL1")
    6143                      .dwattr $C$DW$736, DW_AT_TI_symbol_name("_ADCINTSOCSEL1")
    6144                      .dwattr $C$DW$736, DW_AT_data_member_location[DW_OP_plus_uconst 0x6614]
    6145                      .dwattr $C$DW$736, DW_AT_accessibility(DW_ACCESS_public)
    6146              $C$DW$737       .dwtag  DW_TAG_member
    6147                      .dwattr $C$DW$737, DW_AT_type(*$C$DW$T$23)
    6148                      .dwattr $C$DW$737, DW_AT_name("ADCINTSOCSEL2")
    6149                      .dwattr $C$DW$737, DW_AT_TI_symbol_name("_ADCINTSOCSEL2")
    6150                      .dwattr $C$DW$737, DW_AT_data_member_location[DW_OP_plus_uconst 0x6615]
    6151                      .dwattr $C$DW$737, DW_AT_accessibility(DW_ACCESS_public)
    6152              $C$DW$738       .dwtag  DW_TAG_member
    6153                      .dwattr $C$DW$738, DW_AT_type(*$C$DW$T$26)
    6154                      .dwattr $C$DW$738, DW_AT_name("rsvd_6")
TMS320C2000 Assembler PC v6.2.5 Wed Nov 22 14:48:17 2017

Tools Copyright (c) 1996-2014 Texas Instruments Incorporated
C:\Users\wmj\AppData\Local\Temp\1398010                              PAGE  118

    6155                      .dwattr $C$DW$738, DW_AT_TI_symbol_name("_rsvd_6")
    6156                      .dwattr $C$DW$738, DW_AT_data_member_location[DW_OP_plus_uconst 0x6616]
    6157                      .dwattr $C$DW$738, DW_AT_accessibility(DW_ACCESS_public)
    6158              $C$DW$739       .dwtag  DW_TAG_member
    6159                      .dwattr $C$DW$739, DW_AT_type(*$C$DW$T$23)
    6160                      .dwattr $C$DW$739, DW_AT_name("ADCSOCFLG1")
    6161                      .dwattr $C$DW$739, DW_AT_TI_symbol_name("_ADCSOCFLG1")
    6162                      .dwattr $C$DW$739, DW_AT_data_member_location[DW_OP_plus_uconst 0x6618]
    6163                      .dwattr $C$DW$739, DW_AT_accessibility(DW_ACCESS_public)
    6164              $C$DW$740       .dwtag  DW_TAG_member
    6165                      .dwattr $C$DW$740, DW_AT_type(*$C$DW$T$23)
    6166                      .dwattr $C$DW$740, DW_AT_name("rsvd_7")
    6167                      .dwattr $C$DW$740, DW_AT_TI_symbol_name("_rsvd_7")
    6168                      .dwattr $C$DW$740, DW_AT_data_member_location[DW_OP_plus_uconst 0x6619]
    6169                      .dwattr $C$DW$740, DW_AT_accessibility(DW_ACCESS_public)
    6170              $C$DW$741       .dwtag  DW_TAG_member
    6171                      .dwattr $C$DW$741, DW_AT_type(*$C$DW$T$23)
    6172                      .dwattr $C$DW$741, DW_AT_name("ADCSOCFRC1")
    6173                      .dwattr $C$DW$741, DW_AT_TI_symbol_name("_ADCSOCFRC1")
    6174                      .dwattr $C$DW$741, DW_AT_data_member_location[DW_OP_plus_uconst 0x661a]
    6175                      .dwattr $C$DW$741, DW_AT_accessibility(DW_ACCESS_public)
    6176              $C$DW$742       .dwtag  DW_TAG_member
    6177                      .dwattr $C$DW$742, DW_AT_type(*$C$DW$T$23)
    6178                      .dwattr $C$DW$742, DW_AT_name("rsvd_8")
    6179                      .dwattr $C$DW$742, DW_AT_TI_symbol_name("_rsvd_8")
    6180                      .dwattr $C$DW$742, DW_AT_data_member_location[DW_OP_plus_uconst 0x661b]
    6181                      .dwattr $C$DW$742, DW_AT_accessibility(DW_ACCESS_public)
    6182              $C$DW$743       .dwtag  DW_TAG_member
    6183                      .dwattr $C$DW$743, DW_AT_type(*$C$DW$T$23)
    6184                      .dwattr $C$DW$743, DW_AT_name("ADCSOCOVF1")
    6185                      .dwattr $C$DW$743, DW_AT_TI_symbol_name("_ADCSOCOVF1")
    6186                      .dwattr $C$DW$743, DW_AT_data_member_location[DW_OP_plus_uconst 0x661c]
    6187                      .dwattr $C$DW$743, DW_AT_accessibility(DW_ACCESS_public)
    6188              $C$DW$744       .dwtag  DW_TAG_member
    6189                      .dwattr $C$DW$744, DW_AT_type(*$C$DW$T$23)
    6190                      .dwattr $C$DW$744, DW_AT_name("rsvd_9")
    6191                      .dwattr $C$DW$744, DW_AT_TI_symbol_name("_rsvd_9")
    6192                      .dwattr $C$DW$744, DW_AT_data_member_location[DW_OP_plus_uconst 0x661d]
    6193                      .dwattr $C$DW$744, DW_AT_accessibility(DW_ACCESS_public)
    6194              $C$DW$745       .dwtag  DW_TAG_member
    6195                      .dwattr $C$DW$745, DW_AT_type(*$C$DW$T$23)
    6196                      .dwattr $C$DW$745, DW_AT_name("ADCSOCOVFCLR1")
    6197                      .dwattr $C$DW$745, DW_AT_TI_symbol_name("_ADCSOCOVFCLR1")
    6198                      .dwattr $C$DW$745, DW_AT_data_member_location[DW_OP_plus_uconst 0x661e]
    6199                      .dwattr $C$DW$745, DW_AT_accessibility(DW_ACCESS_public)
    6200              $C$DW$746       .dwtag  DW_TAG_member
    6201                      .dwattr $C$DW$746, DW_AT_type(*$C$DW$T$23)
    6202                      .dwattr $C$DW$746, DW_AT_name("rsvd_10")
    6203                      .dwattr $C$DW$746, DW_AT_TI_symbol_name("_rsvd_10")
    6204                      .dwattr $C$DW$746, DW_AT_data_member_location[DW_OP_plus_uconst 0x661f]
    6205                      .dwattr $C$DW$746, DW_AT_accessibility(DW_ACCESS_public)
    6206              $C$DW$747       .dwtag  DW_TAG_member
    6207                      .dwattr $C$DW$747, DW_AT_type(*$C$DW$T$24)
    6208                      .dwattr $C$DW$747, DW_AT_name("ADCSOCxCTL")
    6209                      .dwattr $C$DW$747, DW_AT_TI_symbol_name("_ADCSOCxCTL")
TMS320C2000 Assembler PC v6.2.5 Wed Nov 22 14:48:17 2017

Tools Copyright (c) 1996-2014 Texas Instruments Incorporated
C:\Users\wmj\AppData\Local\Temp\1398010                              PAGE  119

    6210                      .dwattr $C$DW$747, DW_AT_data_member_location[DW_OP_plus_uconst 0x6620]
    6211                      .dwattr $C$DW$747, DW_AT_accessibility(DW_ACCESS_public)
    6212              $C$DW$748       .dwtag  DW_TAG_member
    6213                      .dwattr $C$DW$748, DW_AT_type(*$C$DW$T$24)
    6214                      .dwattr $C$DW$748, DW_AT_name("rsvd_11")
    6215                      .dwattr $C$DW$748, DW_AT_TI_symbol_name("_rsvd_11")
    6216                      .dwattr $C$DW$748, DW_AT_data_member_location[DW_OP_plus_uconst 0x6630]
    6217                      .dwattr $C$DW$748, DW_AT_accessibility(DW_ACCESS_public)
    6218              $C$DW$749       .dwtag  DW_TAG_member
    6219                      .dwattr $C$DW$749, DW_AT_type(*$C$DW$T$23)
    6220                      .dwattr $C$DW$749, DW_AT_name("ADCREFTRIM")
    6221                      .dwattr $C$DW$749, DW_AT_TI_symbol_name("_ADCREFTRIM")
    6222                      .dwattr $C$DW$749, DW_AT_data_member_location[DW_OP_plus_uconst 0x6640]
    6223                      .dwattr $C$DW$749, DW_AT_accessibility(DW_ACCESS_public)
    6224              $C$DW$750       .dwtag  DW_TAG_member
    6225                      .dwattr $C$DW$750, DW_AT_type(*$C$DW$T$23)
    6226                      .dwattr $C$DW$750, DW_AT_name("ADCOFFTRIM")
    6227                      .dwattr $C$DW$750, DW_AT_TI_symbol_name("_ADCOFFTRIM")
    6228                      .dwattr $C$DW$750, DW_AT_data_member_location[DW_OP_plus_uconst 0x6641]
    6229                      .dwattr $C$DW$750, DW_AT_accessibility(DW_ACCESS_public)
    6230              $C$DW$751       .dwtag  DW_TAG_member
    6231                      .dwattr $C$DW$751, DW_AT_type(*$C$DW$T$29)
    6232                      .dwattr $C$DW$751, DW_AT_name("resvd_12")
    6233                      .dwattr $C$DW$751, DW_AT_TI_symbol_name("_resvd_12")
    6234                      .dwattr $C$DW$751, DW_AT_data_member_location[DW_OP_plus_uconst 0x6642]
    6235                      .dwattr $C$DW$751, DW_AT_accessibility(DW_ACCESS_public)
    6236              $C$DW$752       .dwtag  DW_TAG_member
    6237                      .dwattr $C$DW$752, DW_AT_type(*$C$DW$T$23)
    6238                      .dwattr $C$DW$752, DW_AT_name("ADCREV")
    6239                      .dwattr $C$DW$752, DW_AT_TI_symbol_name("_ADCREV")
    6240                      .dwattr $C$DW$752, DW_AT_data_member_location[DW_OP_plus_uconst 0x664f]
    6241                      .dwattr $C$DW$752, DW_AT_accessibility(DW_ACCESS_public)
    6242                      .dwendtag $C$DW$T$30
    6243              
    6244              $C$DW$T$118     .dwtag  DW_TAG_pointer_type
    6245                      .dwattr $C$DW$T$118, DW_AT_type(*$C$DW$T$30)
    6246                      .dwattr $C$DW$T$118, DW_AT_address_class(0x16)
    6247              $C$DW$T$119     .dwtag  DW_TAG_typedef, DW_AT_name("ADC_Handle")
    6248                      .dwattr $C$DW$T$119, DW_AT_type(*$C$DW$T$118)
    6249                      .dwattr $C$DW$T$119, DW_AT_language(DW_LANG_C)
    6250              
    6251              $C$DW$T$34      .dwtag  DW_TAG_structure_type
    6252                      .dwattr $C$DW$T$34, DW_AT_name("_BRAKE_Obj_")
    6253                      .dwattr $C$DW$T$34, DW_AT_byte_size(0x08)
    6254              $C$DW$753       .dwtag  DW_TAG_member
    6255                      .dwattr $C$DW$753, DW_AT_type(*$C$DW$T$31)
    6256                      .dwattr $C$DW$753, DW_AT_name("angle_pu")
    6257                      .dwattr $C$DW$753, DW_AT_TI_symbol_name("_angle_pu")
    6258                      .dwattr $C$DW$753, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    6259                      .dwattr $C$DW$753, DW_AT_accessibility(DW_ACCESS_public)
    6260              $C$DW$754       .dwtag  DW_TAG_member
    6261                      .dwattr $C$DW$754, DW_AT_type(*$C$DW$T$32)
    6262                      .dwattr $C$DW$754, DW_AT_name("Idq_brake")
    6263                      .dwattr $C$DW$754, DW_AT_TI_symbol_name("_Idq_brake")
    6264                      .dwattr $C$DW$754, DW_AT_data_member_location[DW_OP_plus_uconst 0x2]
TMS320C2000 Assembler PC v6.2.5 Wed Nov 22 14:48:17 2017

Tools Copyright (c) 1996-2014 Texas Instruments Incorporated
C:\Users\wmj\AppData\Local\Temp\1398010                              PAGE  120

    6265                      .dwattr $C$DW$754, DW_AT_accessibility(DW_ACCESS_public)
    6266              $C$DW$755       .dwtag  DW_TAG_member
    6267                      .dwattr $C$DW$755, DW_AT_type(*$C$DW$T$33)
    6268                      .dwattr $C$DW$755, DW_AT_name("brake_enable")
    6269                      .dwattr $C$DW$755, DW_AT_TI_symbol_name("_brake_enable")
    6270                      .dwattr $C$DW$755, DW_AT_data_member_location[DW_OP_plus_uconst 0x6]
    6271                      .dwattr $C$DW$755, DW_AT_accessibility(DW_ACCESS_public)
    6272                      .dwendtag $C$DW$T$34
    6273              
    6274              $C$DW$T$73      .dwtag  DW_TAG_typedef, DW_AT_name("BRAKE_Obj")
    6275                      .dwattr $C$DW$T$73, DW_AT_type(*$C$DW$T$34)
    6276                      .dwattr $C$DW$T$73, DW_AT_language(DW_LANG_C)
    6277              $C$DW$T$71      .dwtag  DW_TAG_pointer_type
    6278                      .dwattr $C$DW$T$71, DW_AT_type(*$C$DW$T$34)
    6279                      .dwattr $C$DW$T$71, DW_AT_address_class(0x16)
    6280              $C$DW$T$72      .dwtag  DW_TAG_typedef, DW_AT_name("BRAKE_Handle")
    6281                      .dwattr $C$DW$T$72, DW_AT_type(*$C$DW$T$71)
    6282                      .dwattr $C$DW$T$72, DW_AT_language(DW_LANG_C)
    6283              
    6284              $C$DW$T$36      .dwtag  DW_TAG_structure_type
    6285                      .dwattr $C$DW$T$36, DW_AT_name("_CLARKE_Obj_")
    6286                      .dwattr $C$DW$T$36, DW_AT_byte_size(0x06)
    6287              $C$DW$756       .dwtag  DW_TAG_member
    6288                      .dwattr $C$DW$756, DW_AT_type(*$C$DW$T$31)
    6289                      .dwattr $C$DW$756, DW_AT_name("alpha_sf")
    6290                      .dwattr $C$DW$756, DW_AT_TI_symbol_name("_alpha_sf")
    6291                      .dwattr $C$DW$756, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    6292                      .dwattr $C$DW$756, DW_AT_accessibility(DW_ACCESS_public)
    6293              $C$DW$757       .dwtag  DW_TAG_member
    6294                      .dwattr $C$DW$757, DW_AT_type(*$C$DW$T$31)
    6295                      .dwattr $C$DW$757, DW_AT_name("beta_sf")
    6296                      .dwattr $C$DW$757, DW_AT_TI_symbol_name("_beta_sf")
    6297                      .dwattr $C$DW$757, DW_AT_data_member_location[DW_OP_plus_uconst 0x2]
    6298                      .dwattr $C$DW$757, DW_AT_accessibility(DW_ACCESS_public)
    6299              $C$DW$758       .dwtag  DW_TAG_member
    6300                      .dwattr $C$DW$758, DW_AT_type(*$C$DW$T$35)
    6301                      .dwattr $C$DW$758, DW_AT_name("numSensors")
    6302                      .dwattr $C$DW$758, DW_AT_TI_symbol_name("_numSensors")
    6303                      .dwattr $C$DW$758, DW_AT_data_member_location[DW_OP_plus_uconst 0x4]
    6304                      .dwattr $C$DW$758, DW_AT_accessibility(DW_ACCESS_public)
    6305                      .dwendtag $C$DW$T$36
    6306              
    6307              $C$DW$T$47      .dwtag  DW_TAG_typedef, DW_AT_name("CLARKE_Obj")
    6308                      .dwattr $C$DW$T$47, DW_AT_type(*$C$DW$T$36)
    6309                      .dwattr $C$DW$T$47, DW_AT_language(DW_LANG_C)
    6310              $C$DW$T$45      .dwtag  DW_TAG_pointer_type
    6311                      .dwattr $C$DW$T$45, DW_AT_type(*$C$DW$T$36)
    6312                      .dwattr $C$DW$T$45, DW_AT_address_class(0x16)
    6313              $C$DW$T$46      .dwtag  DW_TAG_typedef, DW_AT_name("CLARKE_Handle")
    6314                      .dwattr $C$DW$T$46, DW_AT_type(*$C$DW$T$45)
    6315                      .dwattr $C$DW$T$46, DW_AT_language(DW_LANG_C)
    6316              
    6317              $C$DW$T$38      .dwtag  DW_TAG_structure_type
    6318                      .dwattr $C$DW$T$38, DW_AT_name("_CLK_Obj_")
    6319                      .dwattr $C$DW$T$38, DW_AT_byte_size(0x11)
TMS320C2000 Assembler PC v6.2.5 Wed Nov 22 14:48:17 2017

Tools Copyright (c) 1996-2014 Texas Instruments Incorporated
C:\Users\wmj\AppData\Local\Temp\1398010                              PAGE  121

    6320              $C$DW$759       .dwtag  DW_TAG_member
    6321                      .dwattr $C$DW$759, DW_AT_type(*$C$DW$T$23)
    6322                      .dwattr $C$DW$759, DW_AT_name("XCLK")
    6323                      .dwattr $C$DW$759, DW_AT_TI_symbol_name("_XCLK")
    6324                      .dwattr $C$DW$759, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    6325                      .dwattr $C$DW$759, DW_AT_accessibility(DW_ACCESS_public)
    6326              $C$DW$760       .dwtag  DW_TAG_member
    6327                      .dwattr $C$DW$760, DW_AT_type(*$C$DW$T$23)
    6328                      .dwattr $C$DW$760, DW_AT_name("rsvd_1")
    6329                      .dwattr $C$DW$760, DW_AT_TI_symbol_name("_rsvd_1")
    6330                      .dwattr $C$DW$760, DW_AT_data_member_location[DW_OP_plus_uconst 0x1]
    6331                      .dwattr $C$DW$760, DW_AT_accessibility(DW_ACCESS_public)
    6332              $C$DW$761       .dwtag  DW_TAG_member
    6333                      .dwattr $C$DW$761, DW_AT_type(*$C$DW$T$23)
    6334                      .dwattr $C$DW$761, DW_AT_name("CLKCTL")
    6335                      .dwattr $C$DW$761, DW_AT_TI_symbol_name("_CLKCTL")
    6336                      .dwattr $C$DW$761, DW_AT_data_member_location[DW_OP_plus_uconst 0x2]
    6337                      .dwattr $C$DW$761, DW_AT_accessibility(DW_ACCESS_public)
    6338              $C$DW$762       .dwtag  DW_TAG_member
    6339                      .dwattr $C$DW$762, DW_AT_type(*$C$DW$T$37)
    6340                      .dwattr $C$DW$762, DW_AT_name("rsvd_2")
    6341                      .dwattr $C$DW$762, DW_AT_TI_symbol_name("_rsvd_2")
    6342                      .dwattr $C$DW$762, DW_AT_data_member_location[DW_OP_plus_uconst 0x3]
    6343                      .dwattr $C$DW$762, DW_AT_accessibility(DW_ACCESS_public)
    6344              $C$DW$763       .dwtag  DW_TAG_member
    6345                      .dwattr $C$DW$763, DW_AT_type(*$C$DW$T$23)
    6346                      .dwattr $C$DW$763, DW_AT_name("LOSPCP")
    6347                      .dwattr $C$DW$763, DW_AT_TI_symbol_name("_LOSPCP")
    6348                      .dwattr $C$DW$763, DW_AT_data_member_location[DW_OP_plus_uconst 0xb]
    6349                      .dwattr $C$DW$763, DW_AT_accessibility(DW_ACCESS_public)
    6350              $C$DW$764       .dwtag  DW_TAG_member
    6351                      .dwattr $C$DW$764, DW_AT_type(*$C$DW$T$23)
    6352                      .dwattr $C$DW$764, DW_AT_name("PCLKCR0")
    6353                      .dwattr $C$DW$764, DW_AT_TI_symbol_name("_PCLKCR0")
    6354                      .dwattr $C$DW$764, DW_AT_data_member_location[DW_OP_plus_uconst 0xc]
    6355                      .dwattr $C$DW$764, DW_AT_accessibility(DW_ACCESS_public)
    6356              $C$DW$765       .dwtag  DW_TAG_member
    6357                      .dwattr $C$DW$765, DW_AT_type(*$C$DW$T$23)
    6358                      .dwattr $C$DW$765, DW_AT_name("PCLKCR1")
    6359                      .dwattr $C$DW$765, DW_AT_TI_symbol_name("_PCLKCR1")
    6360                      .dwattr $C$DW$765, DW_AT_data_member_location[DW_OP_plus_uconst 0xd]
    6361                      .dwattr $C$DW$765, DW_AT_accessibility(DW_ACCESS_public)
    6362              $C$DW$766       .dwtag  DW_TAG_member
    6363                      .dwattr $C$DW$766, DW_AT_type(*$C$DW$T$26)
    6364                      .dwattr $C$DW$766, DW_AT_name("rsvd_3")
    6365                      .dwattr $C$DW$766, DW_AT_TI_symbol_name("_rsvd_3")
    6366                      .dwattr $C$DW$766, DW_AT_data_member_location[DW_OP_plus_uconst 0xe]
    6367                      .dwattr $C$DW$766, DW_AT_accessibility(DW_ACCESS_public)
    6368              $C$DW$767       .dwtag  DW_TAG_member
    6369                      .dwattr $C$DW$767, DW_AT_type(*$C$DW$T$23)
    6370                      .dwattr $C$DW$767, DW_AT_name("PCLKCR3")
    6371                      .dwattr $C$DW$767, DW_AT_TI_symbol_name("_PCLKCR3")
    6372                      .dwattr $C$DW$767, DW_AT_data_member_location[DW_OP_plus_uconst 0x10]
    6373                      .dwattr $C$DW$767, DW_AT_accessibility(DW_ACCESS_public)
    6374                      .dwendtag $C$DW$T$38
TMS320C2000 Assembler PC v6.2.5 Wed Nov 22 14:48:17 2017

Tools Copyright (c) 1996-2014 Texas Instruments Incorporated
C:\Users\wmj\AppData\Local\Temp\1398010                              PAGE  122

    6375              
    6376              $C$DW$T$120     .dwtag  DW_TAG_pointer_type
    6377                      .dwattr $C$DW$T$120, DW_AT_type(*$C$DW$T$38)
    6378                      .dwattr $C$DW$T$120, DW_AT_address_class(0x16)
    6379              $C$DW$T$121     .dwtag  DW_TAG_typedef, DW_AT_name("CLK_Handle")
    6380                      .dwattr $C$DW$T$121, DW_AT_type(*$C$DW$T$120)
    6381                      .dwattr $C$DW$T$121, DW_AT_language(DW_LANG_C)
    6382              
    6383              $C$DW$T$39      .dwtag  DW_TAG_structure_type
    6384                      .dwattr $C$DW$T$39, DW_AT_name("_CPU_Obj_")
    6385                      .dwattr $C$DW$T$39, DW_AT_byte_size(0x01)
    6386              $C$DW$768       .dwtag  DW_TAG_member
    6387                      .dwattr $C$DW$768, DW_AT_type(*$C$DW$T$35)
    6388                      .dwattr $C$DW$768, DW_AT_name("tmp")
    6389                      .dwattr $C$DW$768, DW_AT_TI_symbol_name("_tmp")
    6390                      .dwattr $C$DW$768, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    6391                      .dwattr $C$DW$768, DW_AT_accessibility(DW_ACCESS_public)
    6392                      .dwendtag $C$DW$T$39
    6393              
    6394              $C$DW$T$122     .dwtag  DW_TAG_pointer_type
    6395                      .dwattr $C$DW$T$122, DW_AT_type(*$C$DW$T$39)
    6396                      .dwattr $C$DW$T$122, DW_AT_address_class(0x16)
    6397              $C$DW$T$123     .dwtag  DW_TAG_typedef, DW_AT_name("CPU_Handle")
    6398                      .dwattr $C$DW$T$123, DW_AT_type(*$C$DW$T$122)
    6399                      .dwattr $C$DW$T$123, DW_AT_language(DW_LANG_C)
    6400              
    6401              $C$DW$T$74      .dwtag  DW_TAG_structure_type
    6402                      .dwattr $C$DW$T$74, DW_AT_name("_CTRL_Obj_")
    6403                      .dwattr $C$DW$T$74, DW_AT_byte_size(0x108)
    6404              $C$DW$769       .dwtag  DW_TAG_member
    6405                      .dwattr $C$DW$769, DW_AT_type(*$C$DW$T$40)
    6406                      .dwattr $C$DW$769, DW_AT_name("version")
    6407                      .dwattr $C$DW$769, DW_AT_TI_symbol_name("_version")
    6408                      .dwattr $C$DW$769, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    6409                      .dwattr $C$DW$769, DW_AT_accessibility(DW_ACCESS_public)
    6410              $C$DW$770       .dwtag  DW_TAG_member
    6411                      .dwattr $C$DW$770, DW_AT_type(*$C$DW$T$42)
    6412                      .dwattr $C$DW$770, DW_AT_name("state")
    6413                      .dwattr $C$DW$770, DW_AT_TI_symbol_name("_state")
    6414                      .dwattr $C$DW$770, DW_AT_data_member_location[DW_OP_plus_uconst 0x4]
    6415                      .dwattr $C$DW$770, DW_AT_accessibility(DW_ACCESS_public)
    6416              $C$DW$771       .dwtag  DW_TAG_member
    6417                      .dwattr $C$DW$771, DW_AT_type(*$C$DW$T$42)
    6418                      .dwattr $C$DW$771, DW_AT_name("prevState")
    6419                      .dwattr $C$DW$771, DW_AT_TI_symbol_name("_prevState")
    6420                      .dwattr $C$DW$771, DW_AT_data_member_location[DW_OP_plus_uconst 0x5]
    6421                      .dwattr $C$DW$771, DW_AT_accessibility(DW_ACCESS_public)
    6422              $C$DW$772       .dwtag  DW_TAG_member
    6423                      .dwattr $C$DW$772, DW_AT_type(*$C$DW$T$44)
    6424                      .dwattr $C$DW$772, DW_AT_name("errorCode")
    6425                      .dwattr $C$DW$772, DW_AT_TI_symbol_name("_errorCode")
    6426                      .dwattr $C$DW$772, DW_AT_data_member_location[DW_OP_plus_uconst 0x6]
    6427                      .dwattr $C$DW$772, DW_AT_accessibility(DW_ACCESS_public)
    6428              $C$DW$773       .dwtag  DW_TAG_member
    6429                      .dwattr $C$DW$773, DW_AT_type(*$C$DW$T$46)
TMS320C2000 Assembler PC v6.2.5 Wed Nov 22 14:48:17 2017

Tools Copyright (c) 1996-2014 Texas Instruments Incorporated
C:\Users\wmj\AppData\Local\Temp\1398010                              PAGE  123

    6430                      .dwattr $C$DW$773, DW_AT_name("clarkeHandle_I")
    6431                      .dwattr $C$DW$773, DW_AT_TI_symbol_name("_clarkeHandle_I")
    6432                      .dwattr $C$DW$773, DW_AT_data_member_location[DW_OP_plus_uconst 0x8]
    6433                      .dwattr $C$DW$773, DW_AT_accessibility(DW_ACCESS_public)
    6434              $C$DW$774       .dwtag  DW_TAG_member
    6435                      .dwattr $C$DW$774, DW_AT_type(*$C$DW$T$47)
    6436                      .dwattr $C$DW$774, DW_AT_name("clarke_I")
    6437                      .dwattr $C$DW$774, DW_AT_TI_symbol_name("_clarke_I")
    6438                      .dwattr $C$DW$774, DW_AT_data_member_location[DW_OP_plus_uconst 0xa]
    6439                      .dwattr $C$DW$774, DW_AT_accessibility(DW_ACCESS_public)
    6440              $C$DW$775       .dwtag  DW_TAG_member
    6441                      .dwattr $C$DW$775, DW_AT_type(*$C$DW$T$46)
    6442                      .dwattr $C$DW$775, DW_AT_name("clarkeHandle_V")
    6443                      .dwattr $C$DW$775, DW_AT_TI_symbol_name("_clarkeHandle_V")
    6444                      .dwattr $C$DW$775, DW_AT_data_member_location[DW_OP_plus_uconst 0x10]
    6445                      .dwattr $C$DW$775, DW_AT_accessibility(DW_ACCESS_public)
    6446              $C$DW$776       .dwtag  DW_TAG_member
    6447                      .dwattr $C$DW$776, DW_AT_type(*$C$DW$T$47)
    6448                      .dwattr $C$DW$776, DW_AT_name("clarke_V")
    6449                      .dwattr $C$DW$776, DW_AT_TI_symbol_name("_clarke_V")
    6450                      .dwattr $C$DW$776, DW_AT_data_member_location[DW_OP_plus_uconst 0x12]
    6451                      .dwattr $C$DW$776, DW_AT_accessibility(DW_ACCESS_public)
    6452              $C$DW$777       .dwtag  DW_TAG_member
    6453                      .dwattr $C$DW$777, DW_AT_type(*$C$DW$T$49)
    6454                      .dwattr $C$DW$777, DW_AT_name("estHandle")
    6455                      .dwattr $C$DW$777, DW_AT_TI_symbol_name("_estHandle")
    6456                      .dwattr $C$DW$777, DW_AT_data_member_location[DW_OP_plus_uconst 0x18]
    6457                      .dwattr $C$DW$777, DW_AT_accessibility(DW_ACCESS_public)
    6458              $C$DW$778       .dwtag  DW_TAG_member
    6459                      .dwattr $C$DW$778, DW_AT_type(*$C$DW$T$51)
    6460                      .dwattr $C$DW$778, DW_AT_name("parkHandle")
    6461                      .dwattr $C$DW$778, DW_AT_TI_symbol_name("_parkHandle")
    6462                      .dwattr $C$DW$778, DW_AT_data_member_location[DW_OP_plus_uconst 0x1a]
    6463                      .dwattr $C$DW$778, DW_AT_accessibility(DW_ACCESS_public)
    6464              $C$DW$779       .dwtag  DW_TAG_member
    6465                      .dwattr $C$DW$779, DW_AT_type(*$C$DW$T$52)
    6466                      .dwattr $C$DW$779, DW_AT_name("park")
    6467                      .dwattr $C$DW$779, DW_AT_TI_symbol_name("_park")
    6468                      .dwattr $C$DW$779, DW_AT_data_member_location[DW_OP_plus_uconst 0x1c]
    6469                      .dwattr $C$DW$779, DW_AT_accessibility(DW_ACCESS_public)
    6470              $C$DW$780       .dwtag  DW_TAG_member
    6471                      .dwattr $C$DW$780, DW_AT_type(*$C$DW$T$54)
    6472                      .dwattr $C$DW$780, DW_AT_name("pidHandle_Id")
    6473                      .dwattr $C$DW$780, DW_AT_TI_symbol_name("_pidHandle_Id")
    6474                      .dwattr $C$DW$780, DW_AT_data_member_location[DW_OP_plus_uconst 0x20]
    6475                      .dwattr $C$DW$780, DW_AT_accessibility(DW_ACCESS_public)
    6476              $C$DW$781       .dwtag  DW_TAG_member
    6477                      .dwattr $C$DW$781, DW_AT_type(*$C$DW$T$55)
    6478                      .dwattr $C$DW$781, DW_AT_name("pid_Id")
    6479                      .dwattr $C$DW$781, DW_AT_TI_symbol_name("_pid_Id")
    6480                      .dwattr $C$DW$781, DW_AT_data_member_location[DW_OP_plus_uconst 0x22]
    6481                      .dwattr $C$DW$781, DW_AT_accessibility(DW_ACCESS_public)
    6482              $C$DW$782       .dwtag  DW_TAG_member
    6483                      .dwattr $C$DW$782, DW_AT_type(*$C$DW$T$54)
    6484                      .dwattr $C$DW$782, DW_AT_name("pidHandle_Iq")
TMS320C2000 Assembler PC v6.2.5 Wed Nov 22 14:48:17 2017

Tools Copyright (c) 1996-2014 Texas Instruments Incorporated
C:\Users\wmj\AppData\Local\Temp\1398010                              PAGE  124

    6485                      .dwattr $C$DW$782, DW_AT_TI_symbol_name("_pidHandle_Iq")
    6486                      .dwattr $C$DW$782, DW_AT_data_member_location[DW_OP_plus_uconst 0x32]
    6487                      .dwattr $C$DW$782, DW_AT_accessibility(DW_ACCESS_public)
    6488              $C$DW$783       .dwtag  DW_TAG_member
    6489                      .dwattr $C$DW$783, DW_AT_type(*$C$DW$T$55)
    6490                      .dwattr $C$DW$783, DW_AT_name("pid_Iq")
    6491                      .dwattr $C$DW$783, DW_AT_TI_symbol_name("_pid_Iq")
    6492                      .dwattr $C$DW$783, DW_AT_data_member_location[DW_OP_plus_uconst 0x34]
    6493                      .dwattr $C$DW$783, DW_AT_accessibility(DW_ACCESS_public)
    6494              $C$DW$784       .dwtag  DW_TAG_member
    6495                      .dwattr $C$DW$784, DW_AT_type(*$C$DW$T$54)
    6496                      .dwattr $C$DW$784, DW_AT_name("pidHandle_spd")
    6497                      .dwattr $C$DW$784, DW_AT_TI_symbol_name("_pidHandle_spd")
    6498                      .dwattr $C$DW$784, DW_AT_data_member_location[DW_OP_plus_uconst 0x44]
    6499                      .dwattr $C$DW$784, DW_AT_accessibility(DW_ACCESS_public)
    6500              $C$DW$785       .dwtag  DW_TAG_member
    6501                      .dwattr $C$DW$785, DW_AT_type(*$C$DW$T$55)
    6502                      .dwattr $C$DW$785, DW_AT_name("pid_spd")
    6503                      .dwattr $C$DW$785, DW_AT_TI_symbol_name("_pid_spd")
    6504                      .dwattr $C$DW$785, DW_AT_data_member_location[DW_OP_plus_uconst 0x46]
    6505                      .dwattr $C$DW$785, DW_AT_accessibility(DW_ACCESS_public)
    6506              $C$DW$786       .dwtag  DW_TAG_member
    6507                      .dwattr $C$DW$786, DW_AT_type(*$C$DW$T$57)
    6508                      .dwattr $C$DW$786, DW_AT_name("iparkHandle")
    6509                      .dwattr $C$DW$786, DW_AT_TI_symbol_name("_iparkHandle")
    6510                      .dwattr $C$DW$786, DW_AT_data_member_location[DW_OP_plus_uconst 0x56]
    6511                      .dwattr $C$DW$786, DW_AT_accessibility(DW_ACCESS_public)
    6512              $C$DW$787       .dwtag  DW_TAG_member
    6513                      .dwattr $C$DW$787, DW_AT_type(*$C$DW$T$58)
    6514                      .dwattr $C$DW$787, DW_AT_name("ipark")
    6515                      .dwattr $C$DW$787, DW_AT_TI_symbol_name("_ipark")
    6516                      .dwattr $C$DW$787, DW_AT_data_member_location[DW_OP_plus_uconst 0x58]
    6517                      .dwattr $C$DW$787, DW_AT_accessibility(DW_ACCESS_public)
    6518              $C$DW$788       .dwtag  DW_TAG_member
    6519                      .dwattr $C$DW$788, DW_AT_type(*$C$DW$T$60)
    6520                      .dwattr $C$DW$788, DW_AT_name("svgenHandle")
    6521                      .dwattr $C$DW$788, DW_AT_TI_symbol_name("_svgenHandle")
    6522                      .dwattr $C$DW$788, DW_AT_data_member_location[DW_OP_plus_uconst 0x5c]
    6523                      .dwattr $C$DW$788, DW_AT_accessibility(DW_ACCESS_public)
    6524              $C$DW$789       .dwtag  DW_TAG_member
    6525                      .dwattr $C$DW$789, DW_AT_type(*$C$DW$T$61)
    6526                      .dwattr $C$DW$789, DW_AT_name("svgen")
    6527                      .dwattr $C$DW$789, DW_AT_TI_symbol_name("_svgen")
    6528                      .dwattr $C$DW$789, DW_AT_data_member_location[DW_OP_plus_uconst 0x5e]
    6529                      .dwattr $C$DW$789, DW_AT_accessibility(DW_ACCESS_public)
    6530              $C$DW$790       .dwtag  DW_TAG_member
    6531                      .dwattr $C$DW$790, DW_AT_type(*$C$DW$T$63)
    6532                      .dwattr $C$DW$790, DW_AT_name("trajHandle_Id")
    6533                      .dwattr $C$DW$790, DW_AT_TI_symbol_name("_trajHandle_Id")
    6534                      .dwattr $C$DW$790, DW_AT_data_member_location[DW_OP_plus_uconst 0x60]
    6535                      .dwattr $C$DW$790, DW_AT_accessibility(DW_ACCESS_public)
    6536              $C$DW$791       .dwtag  DW_TAG_member
    6537                      .dwattr $C$DW$791, DW_AT_type(*$C$DW$T$64)
    6538                      .dwattr $C$DW$791, DW_AT_name("traj_Id")
    6539                      .dwattr $C$DW$791, DW_AT_TI_symbol_name("_traj_Id")
TMS320C2000 Assembler PC v6.2.5 Wed Nov 22 14:48:17 2017

Tools Copyright (c) 1996-2014 Texas Instruments Incorporated
C:\Users\wmj\AppData\Local\Temp\1398010                              PAGE  125

    6540                      .dwattr $C$DW$791, DW_AT_data_member_location[DW_OP_plus_uconst 0x62]
    6541                      .dwattr $C$DW$791, DW_AT_accessibility(DW_ACCESS_public)
    6542              $C$DW$792       .dwtag  DW_TAG_member
    6543                      .dwattr $C$DW$792, DW_AT_type(*$C$DW$T$63)
    6544                      .dwattr $C$DW$792, DW_AT_name("trajHandle_spd")
    6545                      .dwattr $C$DW$792, DW_AT_TI_symbol_name("_trajHandle_spd")
    6546                      .dwattr $C$DW$792, DW_AT_data_member_location[DW_OP_plus_uconst 0x6c]
    6547                      .dwattr $C$DW$792, DW_AT_accessibility(DW_ACCESS_public)
    6548              $C$DW$793       .dwtag  DW_TAG_member
    6549                      .dwattr $C$DW$793, DW_AT_type(*$C$DW$T$64)
    6550                      .dwattr $C$DW$793, DW_AT_name("traj_spd")
    6551                      .dwattr $C$DW$793, DW_AT_TI_symbol_name("_traj_spd")
    6552                      .dwattr $C$DW$793, DW_AT_data_member_location[DW_OP_plus_uconst 0x6e]
    6553                      .dwattr $C$DW$793, DW_AT_accessibility(DW_ACCESS_public)
    6554              $C$DW$794       .dwtag  DW_TAG_member
    6555                      .dwattr $C$DW$794, DW_AT_type(*$C$DW$T$63)
    6556                      .dwattr $C$DW$794, DW_AT_name("trajHandle_spdMax")
    6557                      .dwattr $C$DW$794, DW_AT_TI_symbol_name("_trajHandle_spdMax")
    6558                      .dwattr $C$DW$794, DW_AT_data_member_location[DW_OP_plus_uconst 0x78]
    6559                      .dwattr $C$DW$794, DW_AT_accessibility(DW_ACCESS_public)
    6560              $C$DW$795       .dwtag  DW_TAG_member
    6561                      .dwattr $C$DW$795, DW_AT_type(*$C$DW$T$64)
    6562                      .dwattr $C$DW$795, DW_AT_name("traj_spdMax")
    6563                      .dwattr $C$DW$795, DW_AT_TI_symbol_name("_traj_spdMax")
    6564                      .dwattr $C$DW$795, DW_AT_data_member_location[DW_OP_plus_uconst 0x7a]
    6565                      .dwattr $C$DW$795, DW_AT_accessibility(DW_ACCESS_public)
    6566              $C$DW$796       .dwtag  DW_TAG_member
    6567                      .dwattr $C$DW$796, DW_AT_type(*$C$DW$T$65)
    6568                      .dwattr $C$DW$796, DW_AT_name("motorParams")
    6569                      .dwattr $C$DW$796, DW_AT_TI_symbol_name("_motorParams")
    6570                      .dwattr $C$DW$796, DW_AT_data_member_location[DW_OP_plus_uconst 0x84]
    6571                      .dwattr $C$DW$796, DW_AT_accessibility(DW_ACCESS_public)
    6572              $C$DW$797       .dwtag  DW_TAG_member
    6573                      .dwattr $C$DW$797, DW_AT_type(*$C$DW$T$68)
    6574                      .dwattr $C$DW$797, DW_AT_name("waitTimes")
    6575                      .dwattr $C$DW$797, DW_AT_TI_symbol_name("_waitTimes")
    6576                      .dwattr $C$DW$797, DW_AT_data_member_location[DW_OP_plus_uconst 0x92]
    6577                      .dwattr $C$DW$797, DW_AT_accessibility(DW_ACCESS_public)
    6578              $C$DW$798       .dwtag  DW_TAG_member
    6579                      .dwattr $C$DW$798, DW_AT_type(*$C$DW$T$67)
    6580                      .dwattr $C$DW$798, DW_AT_name("counter_state")
    6581                      .dwattr $C$DW$798, DW_AT_TI_symbol_name("_counter_state")
    6582                      .dwattr $C$DW$798, DW_AT_data_member_location[DW_OP_plus_uconst 0x9a]
    6583                      .dwattr $C$DW$798, DW_AT_accessibility(DW_ACCESS_public)
    6584              $C$DW$799       .dwtag  DW_TAG_member
    6585                      .dwattr $C$DW$799, DW_AT_type(*$C$DW$T$69)
    6586                      .dwattr $C$DW$799, DW_AT_name("numIsrTicksPerCtrlTick")
    6587                      .dwattr $C$DW$799, DW_AT_TI_symbol_name("_numIsrTicksPerCtrlTick")
    6588                      .dwattr $C$DW$799, DW_AT_data_member_location[DW_OP_plus_uconst 0x9c]
    6589                      .dwattr $C$DW$799, DW_AT_accessibility(DW_ACCESS_public)
    6590              $C$DW$800       .dwtag  DW_TAG_member
    6591                      .dwattr $C$DW$800, DW_AT_type(*$C$DW$T$69)
    6592                      .dwattr $C$DW$800, DW_AT_name("numCtrlTicksPerCurrentTick")
    6593                      .dwattr $C$DW$800, DW_AT_TI_symbol_name("_numCtrlTicksPerCurrentTick")
    6594                      .dwattr $C$DW$800, DW_AT_data_member_location[DW_OP_plus_uconst 0x9d]
TMS320C2000 Assembler PC v6.2.5 Wed Nov 22 14:48:17 2017

Tools Copyright (c) 1996-2014 Texas Instruments Incorporated
C:\Users\wmj\AppData\Local\Temp\1398010                              PAGE  126

    6595                      .dwattr $C$DW$800, DW_AT_accessibility(DW_ACCESS_public)
    6596              $C$DW$801       .dwtag  DW_TAG_member
    6597                      .dwattr $C$DW$801, DW_AT_type(*$C$DW$T$69)
    6598                      .dwattr $C$DW$801, DW_AT_name("numCtrlTicksPerSpeedTick")
    6599                      .dwattr $C$DW$801, DW_AT_TI_symbol_name("_numCtrlTicksPerSpeedTick")
    6600                      .dwattr $C$DW$801, DW_AT_data_member_location[DW_OP_plus_uconst 0x9e]
    6601                      .dwattr $C$DW$801, DW_AT_accessibility(DW_ACCESS_public)
    6602              $C$DW$802       .dwtag  DW_TAG_member
    6603                      .dwattr $C$DW$802, DW_AT_type(*$C$DW$T$69)
    6604                      .dwattr $C$DW$802, DW_AT_name("numCtrlTicksPerTrajTick")
    6605                      .dwattr $C$DW$802, DW_AT_TI_symbol_name("_numCtrlTicksPerTrajTick")
    6606                      .dwattr $C$DW$802, DW_AT_data_member_location[DW_OP_plus_uconst 0x9f]
    6607                      .dwattr $C$DW$802, DW_AT_accessibility(DW_ACCESS_public)
    6608              $C$DW$803       .dwtag  DW_TAG_member
    6609                      .dwattr $C$DW$803, DW_AT_type(*$C$DW$T$67)
    6610                      .dwattr $C$DW$803, DW_AT_name("ctrlFreq_Hz")
    6611                      .dwattr $C$DW$803, DW_AT_TI_symbol_name("_ctrlFreq_Hz")
    6612                      .dwattr $C$DW$803, DW_AT_data_member_location[DW_OP_plus_uconst 0xa0]
    6613                      .dwattr $C$DW$803, DW_AT_accessibility(DW_ACCESS_public)
    6614              $C$DW$804       .dwtag  DW_TAG_member
    6615                      .dwattr $C$DW$804, DW_AT_type(*$C$DW$T$67)
    6616                      .dwattr $C$DW$804, DW_AT_name("trajFreq_Hz")
    6617                      .dwattr $C$DW$804, DW_AT_TI_symbol_name("_trajFreq_Hz")
    6618                      .dwattr $C$DW$804, DW_AT_data_member_location[DW_OP_plus_uconst 0xa2]
    6619                      .dwattr $C$DW$804, DW_AT_accessibility(DW_ACCESS_public)
    6620              $C$DW$805       .dwtag  DW_TAG_member
    6621                      .dwattr $C$DW$805, DW_AT_type(*$C$DW$T$31)
    6622                      .dwattr $C$DW$805, DW_AT_name("trajPeriod_sec")
    6623                      .dwattr $C$DW$805, DW_AT_TI_symbol_name("_trajPeriod_sec")
    6624                      .dwattr $C$DW$805, DW_AT_data_member_location[DW_OP_plus_uconst 0xa4]
    6625                      .dwattr $C$DW$805, DW_AT_accessibility(DW_ACCESS_public)
    6626              $C$DW$806       .dwtag  DW_TAG_member
    6627                      .dwattr $C$DW$806, DW_AT_type(*$C$DW$T$70)
    6628                      .dwattr $C$DW$806, DW_AT_name("ctrlPeriod_sec")
    6629                      .dwattr $C$DW$806, DW_AT_TI_symbol_name("_ctrlPeriod_sec")
    6630                      .dwattr $C$DW$806, DW_AT_data_member_location[DW_OP_plus_uconst 0xa6]
    6631                      .dwattr $C$DW$806, DW_AT_accessibility(DW_ACCESS_public)
    6632              $C$DW$807       .dwtag  DW_TAG_member
    6633                      .dwattr $C$DW$807, DW_AT_type(*$C$DW$T$31)
    6634                      .dwattr $C$DW$807, DW_AT_name("maxVsMag_pu")
    6635                      .dwattr $C$DW$807, DW_AT_TI_symbol_name("_maxVsMag_pu")
    6636                      .dwattr $C$DW$807, DW_AT_data_member_location[DW_OP_plus_uconst 0xa8]
    6637                      .dwattr $C$DW$807, DW_AT_accessibility(DW_ACCESS_public)
    6638              $C$DW$808       .dwtag  DW_TAG_member
    6639                      .dwattr $C$DW$808, DW_AT_type(*$C$DW$T$32)
    6640                      .dwattr $C$DW$808, DW_AT_name("Iab_in")
    6641                      .dwattr $C$DW$808, DW_AT_TI_symbol_name("_Iab_in")
    6642                      .dwattr $C$DW$808, DW_AT_data_member_location[DW_OP_plus_uconst 0xaa]
    6643                      .dwattr $C$DW$808, DW_AT_accessibility(DW_ACCESS_public)
    6644              $C$DW$809       .dwtag  DW_TAG_member
    6645                      .dwattr $C$DW$809, DW_AT_type(*$C$DW$T$32)
    6646                      .dwattr $C$DW$809, DW_AT_name("Iab_filt")
    6647                      .dwattr $C$DW$809, DW_AT_TI_symbol_name("_Iab_filt")
    6648                      .dwattr $C$DW$809, DW_AT_data_member_location[DW_OP_plus_uconst 0xae]
    6649                      .dwattr $C$DW$809, DW_AT_accessibility(DW_ACCESS_public)
TMS320C2000 Assembler PC v6.2.5 Wed Nov 22 14:48:17 2017

Tools Copyright (c) 1996-2014 Texas Instruments Incorporated
C:\Users\wmj\AppData\Local\Temp\1398010                              PAGE  127

    6650              $C$DW$810       .dwtag  DW_TAG_member
    6651                      .dwattr $C$DW$810, DW_AT_type(*$C$DW$T$32)
    6652                      .dwattr $C$DW$810, DW_AT_name("Idq_in")
    6653                      .dwattr $C$DW$810, DW_AT_TI_symbol_name("_Idq_in")
    6654                      .dwattr $C$DW$810, DW_AT_data_member_location[DW_OP_plus_uconst 0xb2]
    6655                      .dwattr $C$DW$810, DW_AT_accessibility(DW_ACCESS_public)
    6656              $C$DW$811       .dwtag  DW_TAG_member
    6657                      .dwattr $C$DW$811, DW_AT_type(*$C$DW$T$32)
    6658                      .dwattr $C$DW$811, DW_AT_name("Vab_in")
    6659                      .dwattr $C$DW$811, DW_AT_TI_symbol_name("_Vab_in")
    6660                      .dwattr $C$DW$811, DW_AT_data_member_location[DW_OP_plus_uconst 0xb6]
    6661                      .dwattr $C$DW$811, DW_AT_accessibility(DW_ACCESS_public)
    6662              $C$DW$812       .dwtag  DW_TAG_member
    6663                      .dwattr $C$DW$812, DW_AT_type(*$C$DW$T$31)
    6664                      .dwattr $C$DW$812, DW_AT_name("spd_out")
    6665                      .dwattr $C$DW$812, DW_AT_TI_symbol_name("_spd_out")
    6666                      .dwattr $C$DW$812, DW_AT_data_member_location[DW_OP_plus_uconst 0xba]
    6667                      .dwattr $C$DW$812, DW_AT_accessibility(DW_ACCESS_public)
    6668              $C$DW$813       .dwtag  DW_TAG_member
    6669                      .dwattr $C$DW$813, DW_AT_type(*$C$DW$T$32)
    6670                      .dwattr $C$DW$813, DW_AT_name("Vab_out")
    6671                      .dwattr $C$DW$813, DW_AT_TI_symbol_name("_Vab_out")
    6672                      .dwattr $C$DW$813, DW_AT_data_member_location[DW_OP_plus_uconst 0xbc]
    6673                      .dwattr $C$DW$813, DW_AT_accessibility(DW_ACCESS_public)
    6674              $C$DW$814       .dwtag  DW_TAG_member
    6675                      .dwattr $C$DW$814, DW_AT_type(*$C$DW$T$32)
    6676                      .dwattr $C$DW$814, DW_AT_name("Vdq_out")
    6677                      .dwattr $C$DW$814, DW_AT_TI_symbol_name("_Vdq_out")
    6678                      .dwattr $C$DW$814, DW_AT_data_member_location[DW_OP_plus_uconst 0xc0]
    6679                      .dwattr $C$DW$814, DW_AT_accessibility(DW_ACCESS_public)
    6680              $C$DW$815       .dwtag  DW_TAG_member
    6681                      .dwattr $C$DW$815, DW_AT_type(*$C$DW$T$70)
    6682                      .dwattr $C$DW$815, DW_AT_name("Rhf")
    6683                      .dwattr $C$DW$815, DW_AT_TI_symbol_name("_Rhf")
    6684                      .dwattr $C$DW$815, DW_AT_data_member_location[DW_OP_plus_uconst 0xc4]
    6685                      .dwattr $C$DW$815, DW_AT_accessibility(DW_ACCESS_public)
    6686              $C$DW$816       .dwtag  DW_TAG_member
    6687                      .dwattr $C$DW$816, DW_AT_type(*$C$DW$T$70)
    6688                      .dwattr $C$DW$816, DW_AT_name("Lhf")
    6689                      .dwattr $C$DW$816, DW_AT_TI_symbol_name("_Lhf")
    6690                      .dwattr $C$DW$816, DW_AT_data_member_location[DW_OP_plus_uconst 0xc6]
    6691                      .dwattr $C$DW$816, DW_AT_accessibility(DW_ACCESS_public)
    6692              $C$DW$817       .dwtag  DW_TAG_member
    6693                      .dwattr $C$DW$817, DW_AT_type(*$C$DW$T$70)
    6694                      .dwattr $C$DW$817, DW_AT_name("RoverL")
    6695                      .dwattr $C$DW$817, DW_AT_TI_symbol_name("_RoverL")
    6696                      .dwattr $C$DW$817, DW_AT_data_member_location[DW_OP_plus_uconst 0xc8]
    6697                      .dwattr $C$DW$817, DW_AT_accessibility(DW_ACCESS_public)
    6698              $C$DW$818       .dwtag  DW_TAG_member
    6699                      .dwattr $C$DW$818, DW_AT_type(*$C$DW$T$31)
    6700                      .dwattr $C$DW$818, DW_AT_name("Kp_Id")
    6701                      .dwattr $C$DW$818, DW_AT_TI_symbol_name("_Kp_Id")
    6702                      .dwattr $C$DW$818, DW_AT_data_member_location[DW_OP_plus_uconst 0xca]
    6703                      .dwattr $C$DW$818, DW_AT_accessibility(DW_ACCESS_public)
    6704              $C$DW$819       .dwtag  DW_TAG_member
TMS320C2000 Assembler PC v6.2.5 Wed Nov 22 14:48:17 2017

Tools Copyright (c) 1996-2014 Texas Instruments Incorporated
C:\Users\wmj\AppData\Local\Temp\1398010                              PAGE  128

    6705                      .dwattr $C$DW$819, DW_AT_type(*$C$DW$T$31)
    6706                      .dwattr $C$DW$819, DW_AT_name("Kp_Iq")
    6707                      .dwattr $C$DW$819, DW_AT_TI_symbol_name("_Kp_Iq")
    6708                      .dwattr $C$DW$819, DW_AT_data_member_location[DW_OP_plus_uconst 0xcc]
    6709                      .dwattr $C$DW$819, DW_AT_accessibility(DW_ACCESS_public)
    6710              $C$DW$820       .dwtag  DW_TAG_member
    6711                      .dwattr $C$DW$820, DW_AT_type(*$C$DW$T$31)
    6712                      .dwattr $C$DW$820, DW_AT_name("Kp_spd")
    6713                      .dwattr $C$DW$820, DW_AT_TI_symbol_name("_Kp_spd")
    6714                      .dwattr $C$DW$820, DW_AT_data_member_location[DW_OP_plus_uconst 0xce]
    6715                      .dwattr $C$DW$820, DW_AT_accessibility(DW_ACCESS_public)
    6716              $C$DW$821       .dwtag  DW_TAG_member
    6717                      .dwattr $C$DW$821, DW_AT_type(*$C$DW$T$31)
    6718                      .dwattr $C$DW$821, DW_AT_name("Ki_Id")
    6719                      .dwattr $C$DW$821, DW_AT_TI_symbol_name("_Ki_Id")
    6720                      .dwattr $C$DW$821, DW_AT_data_member_location[DW_OP_plus_uconst 0xd0]
    6721                      .dwattr $C$DW$821, DW_AT_accessibility(DW_ACCESS_public)
    6722              $C$DW$822       .dwtag  DW_TAG_member
    6723                      .dwattr $C$DW$822, DW_AT_type(*$C$DW$T$31)
    6724                      .dwattr $C$DW$822, DW_AT_name("Ki_Iq")
    6725                      .dwattr $C$DW$822, DW_AT_TI_symbol_name("_Ki_Iq")
    6726                      .dwattr $C$DW$822, DW_AT_data_member_location[DW_OP_plus_uconst 0xd2]
    6727                      .dwattr $C$DW$822, DW_AT_accessibility(DW_ACCESS_public)
    6728              $C$DW$823       .dwtag  DW_TAG_member
    6729                      .dwattr $C$DW$823, DW_AT_type(*$C$DW$T$31)
    6730                      .dwattr $C$DW$823, DW_AT_name("Ki_spd")
    6731                      .dwattr $C$DW$823, DW_AT_TI_symbol_name("_Ki_spd")
    6732                      .dwattr $C$DW$823, DW_AT_data_member_location[DW_OP_plus_uconst 0xd4]
    6733                      .dwattr $C$DW$823, DW_AT_accessibility(DW_ACCESS_public)
    6734              $C$DW$824       .dwtag  DW_TAG_member
    6735                      .dwattr $C$DW$824, DW_AT_type(*$C$DW$T$31)
    6736                      .dwattr $C$DW$824, DW_AT_name("Kd_Id")
    6737                      .dwattr $C$DW$824, DW_AT_TI_symbol_name("_Kd_Id")
    6738                      .dwattr $C$DW$824, DW_AT_data_member_location[DW_OP_plus_uconst 0xd6]
    6739                      .dwattr $C$DW$824, DW_AT_accessibility(DW_ACCESS_public)
    6740              $C$DW$825       .dwtag  DW_TAG_member
    6741                      .dwattr $C$DW$825, DW_AT_type(*$C$DW$T$31)
    6742                      .dwattr $C$DW$825, DW_AT_name("Kd_Iq")
    6743                      .dwattr $C$DW$825, DW_AT_TI_symbol_name("_Kd_Iq")
    6744                      .dwattr $C$DW$825, DW_AT_data_member_location[DW_OP_plus_uconst 0xd8]
    6745                      .dwattr $C$DW$825, DW_AT_accessibility(DW_ACCESS_public)
    6746              $C$DW$826       .dwtag  DW_TAG_member
    6747                      .dwattr $C$DW$826, DW_AT_type(*$C$DW$T$31)
    6748                      .dwattr $C$DW$826, DW_AT_name("Kd_spd")
    6749                      .dwattr $C$DW$826, DW_AT_TI_symbol_name("_Kd_spd")
    6750                      .dwattr $C$DW$826, DW_AT_data_member_location[DW_OP_plus_uconst 0xda]
    6751                      .dwattr $C$DW$826, DW_AT_accessibility(DW_ACCESS_public)
    6752              $C$DW$827       .dwtag  DW_TAG_member
    6753                      .dwattr $C$DW$827, DW_AT_type(*$C$DW$T$31)
    6754                      .dwattr $C$DW$827, DW_AT_name("Ui_Id")
    6755                      .dwattr $C$DW$827, DW_AT_TI_symbol_name("_Ui_Id")
    6756                      .dwattr $C$DW$827, DW_AT_data_member_location[DW_OP_plus_uconst 0xdc]
    6757                      .dwattr $C$DW$827, DW_AT_accessibility(DW_ACCESS_public)
    6758              $C$DW$828       .dwtag  DW_TAG_member
    6759                      .dwattr $C$DW$828, DW_AT_type(*$C$DW$T$31)
TMS320C2000 Assembler PC v6.2.5 Wed Nov 22 14:48:17 2017

Tools Copyright (c) 1996-2014 Texas Instruments Incorporated
C:\Users\wmj\AppData\Local\Temp\1398010                              PAGE  129

    6760                      .dwattr $C$DW$828, DW_AT_name("Ui_Iq")
    6761                      .dwattr $C$DW$828, DW_AT_TI_symbol_name("_Ui_Iq")
    6762                      .dwattr $C$DW$828, DW_AT_data_member_location[DW_OP_plus_uconst 0xde]
    6763                      .dwattr $C$DW$828, DW_AT_accessibility(DW_ACCESS_public)
    6764              $C$DW$829       .dwtag  DW_TAG_member
    6765                      .dwattr $C$DW$829, DW_AT_type(*$C$DW$T$31)
    6766                      .dwattr $C$DW$829, DW_AT_name("Ui_spd")
    6767                      .dwattr $C$DW$829, DW_AT_TI_symbol_name("_Ui_spd")
    6768                      .dwattr $C$DW$829, DW_AT_data_member_location[DW_OP_plus_uconst 0xe0]
    6769                      .dwattr $C$DW$829, DW_AT_accessibility(DW_ACCESS_public)
    6770              $C$DW$830       .dwtag  DW_TAG_member
    6771                      .dwattr $C$DW$830, DW_AT_type(*$C$DW$T$32)
    6772                      .dwattr $C$DW$830, DW_AT_name("Idq_ref")
    6773                      .dwattr $C$DW$830, DW_AT_TI_symbol_name("_Idq_ref")
    6774                      .dwattr $C$DW$830, DW_AT_data_member_location[DW_OP_plus_uconst 0xe2]
    6775                      .dwattr $C$DW$830, DW_AT_accessibility(DW_ACCESS_public)
    6776              $C$DW$831       .dwtag  DW_TAG_member
    6777                      .dwattr $C$DW$831, DW_AT_type(*$C$DW$T$31)
    6778                      .dwattr $C$DW$831, DW_AT_name("IdRated")
    6779                      .dwattr $C$DW$831, DW_AT_TI_symbol_name("_IdRated")
    6780                      .dwattr $C$DW$831, DW_AT_data_member_location[DW_OP_plus_uconst 0xe6]
    6781                      .dwattr $C$DW$831, DW_AT_accessibility(DW_ACCESS_public)
    6782              $C$DW$832       .dwtag  DW_TAG_member
    6783                      .dwattr $C$DW$832, DW_AT_type(*$C$DW$T$31)
    6784                      .dwattr $C$DW$832, DW_AT_name("spd_ref")
    6785                      .dwattr $C$DW$832, DW_AT_TI_symbol_name("_spd_ref")
    6786                      .dwattr $C$DW$832, DW_AT_data_member_location[DW_OP_plus_uconst 0xe8]
    6787                      .dwattr $C$DW$832, DW_AT_accessibility(DW_ACCESS_public)
    6788              $C$DW$833       .dwtag  DW_TAG_member
    6789                      .dwattr $C$DW$833, DW_AT_type(*$C$DW$T$31)
    6790                      .dwattr $C$DW$833, DW_AT_name("spd_max")
    6791                      .dwattr $C$DW$833, DW_AT_TI_symbol_name("_spd_max")
    6792                      .dwattr $C$DW$833, DW_AT_data_member_location[DW_OP_plus_uconst 0xea]
    6793                      .dwattr $C$DW$833, DW_AT_accessibility(DW_ACCESS_public)
    6794              $C$DW$834       .dwtag  DW_TAG_member
    6795                      .dwattr $C$DW$834, DW_AT_type(*$C$DW$T$69)
    6796                      .dwattr $C$DW$834, DW_AT_name("counter_current")
    6797                      .dwattr $C$DW$834, DW_AT_TI_symbol_name("_counter_current")
    6798                      .dwattr $C$DW$834, DW_AT_data_member_location[DW_OP_plus_uconst 0xec]
    6799                      .dwattr $C$DW$834, DW_AT_accessibility(DW_ACCESS_public)
    6800              $C$DW$835       .dwtag  DW_TAG_member
    6801                      .dwattr $C$DW$835, DW_AT_type(*$C$DW$T$69)
    6802                      .dwattr $C$DW$835, DW_AT_name("counter_isr")
    6803                      .dwattr $C$DW$835, DW_AT_TI_symbol_name("_counter_isr")
    6804                      .dwattr $C$DW$835, DW_AT_data_member_location[DW_OP_plus_uconst 0xed]
    6805                      .dwattr $C$DW$835, DW_AT_accessibility(DW_ACCESS_public)
    6806              $C$DW$836       .dwtag  DW_TAG_member
    6807                      .dwattr $C$DW$836, DW_AT_type(*$C$DW$T$69)
    6808                      .dwattr $C$DW$836, DW_AT_name("counter_speed")
    6809                      .dwattr $C$DW$836, DW_AT_TI_symbol_name("_counter_speed")
    6810                      .dwattr $C$DW$836, DW_AT_data_member_location[DW_OP_plus_uconst 0xee]
    6811                      .dwattr $C$DW$836, DW_AT_accessibility(DW_ACCESS_public)
    6812              $C$DW$837       .dwtag  DW_TAG_member
    6813                      .dwattr $C$DW$837, DW_AT_type(*$C$DW$T$69)
    6814                      .dwattr $C$DW$837, DW_AT_name("counter_traj")
TMS320C2000 Assembler PC v6.2.5 Wed Nov 22 14:48:17 2017

Tools Copyright (c) 1996-2014 Texas Instruments Incorporated
C:\Users\wmj\AppData\Local\Temp\1398010                              PAGE  130

    6815                      .dwattr $C$DW$837, DW_AT_TI_symbol_name("_counter_traj")
    6816                      .dwattr $C$DW$837, DW_AT_data_member_location[DW_OP_plus_uconst 0xef]
    6817                      .dwattr $C$DW$837, DW_AT_accessibility(DW_ACCESS_public)
    6818              $C$DW$838       .dwtag  DW_TAG_member
    6819                      .dwattr $C$DW$838, DW_AT_type(*$C$DW$T$33)
    6820                      .dwattr $C$DW$838, DW_AT_name("flag_enableCtrl")
    6821                      .dwattr $C$DW$838, DW_AT_TI_symbol_name("_flag_enableCtrl")
    6822                      .dwattr $C$DW$838, DW_AT_data_member_location[DW_OP_plus_uconst 0xf0]
    6823                      .dwattr $C$DW$838, DW_AT_accessibility(DW_ACCESS_public)
    6824              $C$DW$839       .dwtag  DW_TAG_member
    6825                      .dwattr $C$DW$839, DW_AT_type(*$C$DW$T$33)
    6826                      .dwattr $C$DW$839, DW_AT_name("flag_enableDcBusComp")
    6827                      .dwattr $C$DW$839, DW_AT_TI_symbol_name("_flag_enableDcBusComp")
    6828                      .dwattr $C$DW$839, DW_AT_data_member_location[DW_OP_plus_uconst 0xf1]
    6829                      .dwattr $C$DW$839, DW_AT_accessibility(DW_ACCESS_public)
    6830              $C$DW$840       .dwtag  DW_TAG_member
    6831                      .dwattr $C$DW$840, DW_AT_type(*$C$DW$T$33)
    6832                      .dwattr $C$DW$840, DW_AT_name("flag_enablePowerWarp")
    6833                      .dwattr $C$DW$840, DW_AT_TI_symbol_name("_flag_enablePowerWarp")
    6834                      .dwattr $C$DW$840, DW_AT_data_member_location[DW_OP_plus_uconst 0xf2]
    6835                      .dwattr $C$DW$840, DW_AT_accessibility(DW_ACCESS_public)
    6836              $C$DW$841       .dwtag  DW_TAG_member
    6837                      .dwattr $C$DW$841, DW_AT_type(*$C$DW$T$33)
    6838                      .dwattr $C$DW$841, DW_AT_name("flag_enableOffset")
    6839                      .dwattr $C$DW$841, DW_AT_TI_symbol_name("_flag_enableOffset")
    6840                      .dwattr $C$DW$841, DW_AT_data_member_location[DW_OP_plus_uconst 0xf3]
    6841                      .dwattr $C$DW$841, DW_AT_accessibility(DW_ACCESS_public)
    6842              $C$DW$842       .dwtag  DW_TAG_member
    6843                      .dwattr $C$DW$842, DW_AT_type(*$C$DW$T$33)
    6844                      .dwattr $C$DW$842, DW_AT_name("flag_enableSpeedCtrl")
    6845                      .dwattr $C$DW$842, DW_AT_TI_symbol_name("_flag_enableSpeedCtrl")
    6846                      .dwattr $C$DW$842, DW_AT_data_member_location[DW_OP_plus_uconst 0xf4]
    6847                      .dwattr $C$DW$842, DW_AT_accessibility(DW_ACCESS_public)
    6848              $C$DW$843       .dwtag  DW_TAG_member
    6849                      .dwattr $C$DW$843, DW_AT_type(*$C$DW$T$33)
    6850                      .dwattr $C$DW$843, DW_AT_name("flag_enableUserMotorParams")
    6851                      .dwattr $C$DW$843, DW_AT_TI_symbol_name("_flag_enableUserMotorParams")
    6852                      .dwattr $C$DW$843, DW_AT_data_member_location[DW_OP_plus_uconst 0xf5]
    6853                      .dwattr $C$DW$843, DW_AT_accessibility(DW_ACCESS_public)
    6854              $C$DW$844       .dwtag  DW_TAG_member
    6855                      .dwattr $C$DW$844, DW_AT_type(*$C$DW$T$33)
    6856                      .dwattr $C$DW$844, DW_AT_name("flag_enableCurrentCtrl")
    6857                      .dwattr $C$DW$844, DW_AT_TI_symbol_name("_flag_enableCurrentCtrl")
    6858                      .dwattr $C$DW$844, DW_AT_data_member_location[DW_OP_plus_uconst 0xf6]
    6859                      .dwattr $C$DW$844, DW_AT_accessibility(DW_ACCESS_public)
    6860              $C$DW$845       .dwtag  DW_TAG_member
    6861                      .dwattr $C$DW$845, DW_AT_type(*$C$DW$T$31)
    6862                      .dwattr $C$DW$845, DW_AT_name("spd_outMaxRatio_pu")
    6863                      .dwattr $C$DW$845, DW_AT_TI_symbol_name("_spd_outMaxRatio_pu")
    6864                      .dwattr $C$DW$845, DW_AT_data_member_location[DW_OP_plus_uconst 0xf8]
    6865                      .dwattr $C$DW$845, DW_AT_accessibility(DW_ACCESS_public)
    6866              $C$DW$846       .dwtag  DW_TAG_member
    6867                      .dwattr $C$DW$846, DW_AT_type(*$C$DW$T$31)
    6868                      .dwattr $C$DW$846, DW_AT_name("enc_Angle")
    6869                      .dwattr $C$DW$846, DW_AT_TI_symbol_name("_enc_Angle")
TMS320C2000 Assembler PC v6.2.5 Wed Nov 22 14:48:17 2017

Tools Copyright (c) 1996-2014 Texas Instruments Incorporated
C:\Users\wmj\AppData\Local\Temp\1398010                              PAGE  131

    6870                      .dwattr $C$DW$846, DW_AT_data_member_location[DW_OP_plus_uconst 0xfa]
    6871                      .dwattr $C$DW$846, DW_AT_accessibility(DW_ACCESS_public)
    6872              $C$DW$847       .dwtag  DW_TAG_member
    6873                      .dwattr $C$DW$847, DW_AT_type(*$C$DW$T$33)
    6874                      .dwattr $C$DW$847, DW_AT_name("flag_enableEncAngle")
    6875                      .dwattr $C$DW$847, DW_AT_TI_symbol_name("_flag_enableEncAngle")
    6876                      .dwattr $C$DW$847, DW_AT_data_member_location[DW_OP_plus_uconst 0xfc]
    6877                      .dwattr $C$DW$847, DW_AT_accessibility(DW_ACCESS_public)
    6878              $C$DW$848       .dwtag  DW_TAG_member
    6879                      .dwattr $C$DW$848, DW_AT_type(*$C$DW$T$72)
    6880                      .dwattr $C$DW$848, DW_AT_name("brakeHandle")
    6881                      .dwattr $C$DW$848, DW_AT_TI_symbol_name("_brakeHandle")
    6882                      .dwattr $C$DW$848, DW_AT_data_member_location[DW_OP_plus_uconst 0xfe]
    6883                      .dwattr $C$DW$848, DW_AT_accessibility(DW_ACCESS_public)
    6884              $C$DW$849       .dwtag  DW_TAG_member
    6885                      .dwattr $C$DW$849, DW_AT_type(*$C$DW$T$73)
    6886                      .dwattr $C$DW$849, DW_AT_name("brake")
    6887                      .dwattr $C$DW$849, DW_AT_TI_symbol_name("_brake")
    6888                      .dwattr $C$DW$849, DW_AT_data_member_location[DW_OP_plus_uconst 0x100]
    6889                      .dwattr $C$DW$849, DW_AT_accessibility(DW_ACCESS_public)
    6890                      .dwendtag $C$DW$T$74
    6891              
    6892              $C$DW$T$248     .dwtag  DW_TAG_typedef, DW_AT_name("CTRL_Obj")
    6893                      .dwattr $C$DW$T$248, DW_AT_type(*$C$DW$T$74)
    6894                      .dwattr $C$DW$T$248, DW_AT_language(DW_LANG_C)
    6895              $C$DW$T$210     .dwtag  DW_TAG_pointer_type
    6896                      .dwattr $C$DW$T$210, DW_AT_type(*$C$DW$T$74)
    6897                      .dwattr $C$DW$T$210, DW_AT_address_class(0x16)
    6898              $C$DW$T$211     .dwtag  DW_TAG_typedef, DW_AT_name("CTRL_Handle")
    6899                      .dwattr $C$DW$T$211, DW_AT_type(*$C$DW$T$210)
    6900                      .dwattr $C$DW$T$211, DW_AT_language(DW_LANG_C)
    6901              $C$DW$850       .dwtag  DW_TAG_TI_far_type
    6902                      .dwattr $C$DW$850, DW_AT_type(*$C$DW$T$211)
    6903              $C$DW$T$249     .dwtag  DW_TAG_const_type
    6904                      .dwattr $C$DW$T$249, DW_AT_type(*$C$DW$850)
    6905              
    6906              $C$DW$T$77      .dwtag  DW_TAG_structure_type
    6907                      .dwattr $C$DW$T$77, DW_AT_name("_CTRL_Version_")
    6908                      .dwattr $C$DW$T$77, DW_AT_byte_size(0x04)
    6909              $C$DW$851       .dwtag  DW_TAG_member
    6910                      .dwattr $C$DW$851, DW_AT_type(*$C$DW$T$22)
    6911                      .dwattr $C$DW$851, DW_AT_name("rsvd")
    6912                      .dwattr $C$DW$851, DW_AT_TI_symbol_name("_rsvd")
    6913                      .dwattr $C$DW$851, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    6914                      .dwattr $C$DW$851, DW_AT_accessibility(DW_ACCESS_public)
    6915              $C$DW$852       .dwtag  DW_TAG_member
    6916                      .dwattr $C$DW$852, DW_AT_type(*$C$DW$T$76)
    6917                      .dwattr $C$DW$852, DW_AT_name("targetProc")
    6918                      .dwattr $C$DW$852, DW_AT_TI_symbol_name("_targetProc")
    6919                      .dwattr $C$DW$852, DW_AT_data_member_location[DW_OP_plus_uconst 0x1]
    6920                      .dwattr $C$DW$852, DW_AT_accessibility(DW_ACCESS_public)
    6921              $C$DW$853       .dwtag  DW_TAG_member
    6922                      .dwattr $C$DW$853, DW_AT_type(*$C$DW$T$22)
    6923                      .dwattr $C$DW$853, DW_AT_name("major")
    6924                      .dwattr $C$DW$853, DW_AT_TI_symbol_name("_major")
TMS320C2000 Assembler PC v6.2.5 Wed Nov 22 14:48:17 2017

Tools Copyright (c) 1996-2014 Texas Instruments Incorporated
C:\Users\wmj\AppData\Local\Temp\1398010                              PAGE  132

    6925                      .dwattr $C$DW$853, DW_AT_data_member_location[DW_OP_plus_uconst 0x2]
    6926                      .dwattr $C$DW$853, DW_AT_accessibility(DW_ACCESS_public)
    6927              $C$DW$854       .dwtag  DW_TAG_member
    6928                      .dwattr $C$DW$854, DW_AT_type(*$C$DW$T$22)
    6929                      .dwattr $C$DW$854, DW_AT_name("minor")
    6930                      .dwattr $C$DW$854, DW_AT_TI_symbol_name("_minor")
    6931                      .dwattr $C$DW$854, DW_AT_data_member_location[DW_OP_plus_uconst 0x3]
    6932                      .dwattr $C$DW$854, DW_AT_accessibility(DW_ACCESS_public)
    6933                      .dwendtag $C$DW$T$77
    6934              
    6935              $C$DW$T$40      .dwtag  DW_TAG_typedef, DW_AT_name("CTRL_Version")
    6936                      .dwattr $C$DW$T$40, DW_AT_type(*$C$DW$T$77)
    6937                      .dwattr $C$DW$T$40, DW_AT_language(DW_LANG_C)
    6938              
    6939              $C$DW$T$19      .dwtag  DW_TAG_structure_type
    6940                      .dwattr $C$DW$T$19, DW_AT_name("_EST_Obj_")
    6941                      .dwattr $C$DW$T$19, DW_AT_declaration
    6942                      .dwendtag $C$DW$T$19
    6943              
    6944              $C$DW$T$48      .dwtag  DW_TAG_pointer_type
    6945                      .dwattr $C$DW$T$48, DW_AT_type(*$C$DW$T$19)
    6946                      .dwattr $C$DW$T$48, DW_AT_address_class(0x16)
    6947              $C$DW$T$49      .dwtag  DW_TAG_typedef, DW_AT_name("EST_Handle")
    6948                      .dwattr $C$DW$T$49, DW_AT_type(*$C$DW$T$48)
    6949                      .dwattr $C$DW$T$49, DW_AT_language(DW_LANG_C)
    6950              
    6951              $C$DW$T$78      .dwtag  DW_TAG_structure_type
    6952                      .dwattr $C$DW$T$78, DW_AT_name("_FILTER_FO_")
    6953                      .dwattr $C$DW$T$78, DW_AT_byte_size(0x0a)
    6954              $C$DW$855       .dwtag  DW_TAG_member
    6955                      .dwattr $C$DW$855, DW_AT_type(*$C$DW$T$31)
    6956                      .dwattr $C$DW$855, DW_AT_name("a1")
    6957                      .dwattr $C$DW$855, DW_AT_TI_symbol_name("_a1")
    6958                      .dwattr $C$DW$855, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    6959                      .dwattr $C$DW$855, DW_AT_accessibility(DW_ACCESS_public)
    6960              $C$DW$856       .dwtag  DW_TAG_member
    6961                      .dwattr $C$DW$856, DW_AT_type(*$C$DW$T$31)
    6962                      .dwattr $C$DW$856, DW_AT_name("b0")
    6963                      .dwattr $C$DW$856, DW_AT_TI_symbol_name("_b0")
    6964                      .dwattr $C$DW$856, DW_AT_data_member_location[DW_OP_plus_uconst 0x2]
    6965                      .dwattr $C$DW$856, DW_AT_accessibility(DW_ACCESS_public)
    6966              $C$DW$857       .dwtag  DW_TAG_member
    6967                      .dwattr $C$DW$857, DW_AT_type(*$C$DW$T$31)
    6968                      .dwattr $C$DW$857, DW_AT_name("b1")
    6969                      .dwattr $C$DW$857, DW_AT_TI_symbol_name("_b1")
    6970                      .dwattr $C$DW$857, DW_AT_data_member_location[DW_OP_plus_uconst 0x4]
    6971                      .dwattr $C$DW$857, DW_AT_accessibility(DW_ACCESS_public)
    6972              $C$DW$858       .dwtag  DW_TAG_member
    6973                      .dwattr $C$DW$858, DW_AT_type(*$C$DW$T$31)
    6974                      .dwattr $C$DW$858, DW_AT_name("x1")
    6975                      .dwattr $C$DW$858, DW_AT_TI_symbol_name("_x1")
    6976                      .dwattr $C$DW$858, DW_AT_data_member_location[DW_OP_plus_uconst 0x6]
    6977                      .dwattr $C$DW$858, DW_AT_accessibility(DW_ACCESS_public)
    6978              $C$DW$859       .dwtag  DW_TAG_member
    6979                      .dwattr $C$DW$859, DW_AT_type(*$C$DW$T$31)
TMS320C2000 Assembler PC v6.2.5 Wed Nov 22 14:48:17 2017

Tools Copyright (c) 1996-2014 Texas Instruments Incorporated
C:\Users\wmj\AppData\Local\Temp\1398010                              PAGE  133

    6980                      .dwattr $C$DW$859, DW_AT_name("y1")
    6981                      .dwattr $C$DW$859, DW_AT_TI_symbol_name("_y1")
    6982                      .dwattr $C$DW$859, DW_AT_data_member_location[DW_OP_plus_uconst 0x8]
    6983                      .dwattr $C$DW$859, DW_AT_accessibility(DW_ACCESS_public)
    6984                      .dwendtag $C$DW$T$78
    6985              
    6986              $C$DW$T$191     .dwtag  DW_TAG_typedef, DW_AT_name("FILTER_FO_Obj")
    6987                      .dwattr $C$DW$T$191, DW_AT_type(*$C$DW$T$78)
    6988                      .dwattr $C$DW$T$191, DW_AT_language(DW_LANG_C)
    6989              
    6990              $C$DW$T$20      .dwtag  DW_TAG_structure_type
    6991                      .dwattr $C$DW$T$20, DW_AT_name("_FILTER_FO_Obj_")
    6992                      .dwattr $C$DW$T$20, DW_AT_declaration
    6993                      .dwendtag $C$DW$T$20
    6994              
    6995              $C$DW$T$192     .dwtag  DW_TAG_pointer_type
    6996                      .dwattr $C$DW$T$192, DW_AT_type(*$C$DW$T$20)
    6997                      .dwattr $C$DW$T$192, DW_AT_address_class(0x16)
    6998              $C$DW$T$193     .dwtag  DW_TAG_typedef, DW_AT_name("FILTER_FO_Handle")
    6999                      .dwattr $C$DW$T$193, DW_AT_type(*$C$DW$T$192)
    7000                      .dwattr $C$DW$T$193, DW_AT_language(DW_LANG_C)
    7001              
    7002              $C$DW$T$79      .dwtag  DW_TAG_structure_type
    7003                      .dwattr $C$DW$T$79, DW_AT_name("_FLASH_Obj_")
    7004                      .dwattr $C$DW$T$79, DW_AT_byte_size(0x08)
    7005              $C$DW$860       .dwtag  DW_TAG_member
    7006                      .dwattr $C$DW$860, DW_AT_type(*$C$DW$T$23)
    7007                      .dwattr $C$DW$860, DW_AT_name("FOPT")
    7008                      .dwattr $C$DW$860, DW_AT_TI_symbol_name("_FOPT")
    7009                      .dwattr $C$DW$860, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    7010                      .dwattr $C$DW$860, DW_AT_accessibility(DW_ACCESS_public)
    7011              $C$DW$861       .dwtag  DW_TAG_member
    7012                      .dwattr $C$DW$861, DW_AT_type(*$C$DW$T$23)
    7013                      .dwattr $C$DW$861, DW_AT_name("rsvd_1")
    7014                      .dwattr $C$DW$861, DW_AT_TI_symbol_name("_rsvd_1")
    7015                      .dwattr $C$DW$861, DW_AT_data_member_location[DW_OP_plus_uconst 0x1]
    7016                      .dwattr $C$DW$861, DW_AT_accessibility(DW_ACCESS_public)
    7017              $C$DW$862       .dwtag  DW_TAG_member
    7018                      .dwattr $C$DW$862, DW_AT_type(*$C$DW$T$23)
    7019                      .dwattr $C$DW$862, DW_AT_name("FPWR")
    7020                      .dwattr $C$DW$862, DW_AT_TI_symbol_name("_FPWR")
    7021                      .dwattr $C$DW$862, DW_AT_data_member_location[DW_OP_plus_uconst 0x2]
    7022                      .dwattr $C$DW$862, DW_AT_accessibility(DW_ACCESS_public)
    7023              $C$DW$863       .dwtag  DW_TAG_member
    7024                      .dwattr $C$DW$863, DW_AT_type(*$C$DW$T$23)
    7025                      .dwattr $C$DW$863, DW_AT_name("FSTATUS")
    7026                      .dwattr $C$DW$863, DW_AT_TI_symbol_name("_FSTATUS")
    7027                      .dwattr $C$DW$863, DW_AT_data_member_location[DW_OP_plus_uconst 0x3]
    7028                      .dwattr $C$DW$863, DW_AT_accessibility(DW_ACCESS_public)
    7029              $C$DW$864       .dwtag  DW_TAG_member
    7030                      .dwattr $C$DW$864, DW_AT_type(*$C$DW$T$23)
    7031                      .dwattr $C$DW$864, DW_AT_name("FSTDBYWAIT")
    7032                      .dwattr $C$DW$864, DW_AT_TI_symbol_name("_FSTDBYWAIT")
    7033                      .dwattr $C$DW$864, DW_AT_data_member_location[DW_OP_plus_uconst 0x4]
    7034                      .dwattr $C$DW$864, DW_AT_accessibility(DW_ACCESS_public)
TMS320C2000 Assembler PC v6.2.5 Wed Nov 22 14:48:17 2017

Tools Copyright (c) 1996-2014 Texas Instruments Incorporated
C:\Users\wmj\AppData\Local\Temp\1398010                              PAGE  134

    7035              $C$DW$865       .dwtag  DW_TAG_member
    7036                      .dwattr $C$DW$865, DW_AT_type(*$C$DW$T$23)
    7037                      .dwattr $C$DW$865, DW_AT_name("FACTIVEWAIT")
    7038                      .dwattr $C$DW$865, DW_AT_TI_symbol_name("_FACTIVEWAIT")
    7039                      .dwattr $C$DW$865, DW_AT_data_member_location[DW_OP_plus_uconst 0x5]
    7040                      .dwattr $C$DW$865, DW_AT_accessibility(DW_ACCESS_public)
    7041              $C$DW$866       .dwtag  DW_TAG_member
    7042                      .dwattr $C$DW$866, DW_AT_type(*$C$DW$T$23)
    7043                      .dwattr $C$DW$866, DW_AT_name("FBANKWAIT")
    7044                      .dwattr $C$DW$866, DW_AT_TI_symbol_name("_FBANKWAIT")
    7045                      .dwattr $C$DW$866, DW_AT_data_member_location[DW_OP_plus_uconst 0x6]
    7046                      .dwattr $C$DW$866, DW_AT_accessibility(DW_ACCESS_public)
    7047              $C$DW$867       .dwtag  DW_TAG_member
    7048                      .dwattr $C$DW$867, DW_AT_type(*$C$DW$T$23)
    7049                      .dwattr $C$DW$867, DW_AT_name("FOTPWAIT")
    7050                      .dwattr $C$DW$867, DW_AT_TI_symbol_name("_FOTPWAIT")
    7051                      .dwattr $C$DW$867, DW_AT_data_member_location[DW_OP_plus_uconst 0x7]
    7052                      .dwattr $C$DW$867, DW_AT_accessibility(DW_ACCESS_public)
    7053                      .dwendtag $C$DW$T$79
    7054              
    7055              $C$DW$T$124     .dwtag  DW_TAG_pointer_type
    7056                      .dwattr $C$DW$T$124, DW_AT_type(*$C$DW$T$79)
    7057                      .dwattr $C$DW$T$124, DW_AT_address_class(0x16)
    7058              $C$DW$T$125     .dwtag  DW_TAG_typedef, DW_AT_name("FLASH_Handle")
    7059                      .dwattr $C$DW$T$125, DW_AT_type(*$C$DW$T$124)
    7060                      .dwattr $C$DW$T$125, DW_AT_language(DW_LANG_C)
    7061              
    7062              $C$DW$T$99      .dwtag  DW_TAG_structure_type
    7063                      .dwattr $C$DW$T$99, DW_AT_name("_FSM_Obj_")
    7064                      .dwattr $C$DW$T$99, DW_AT_byte_size(0x26)
    7065              $C$DW$868       .dwtag  DW_TAG_member
    7066                      .dwattr $C$DW$868, DW_AT_type(*$C$DW$T$81)
    7067                      .dwattr $C$DW$868, DW_AT_name("motorHandle")
    7068                      .dwattr $C$DW$868, DW_AT_TI_symbol_name("_motorHandle")
    7069                      .dwattr $C$DW$868, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    7070                      .dwattr $C$DW$868, DW_AT_accessibility(DW_ACCESS_public)
    7071              $C$DW$869       .dwtag  DW_TAG_member
    7072                      .dwattr $C$DW$869, DW_AT_type(*$C$DW$T$83)
    7073                      .dwattr $C$DW$869, DW_AT_name("halHandle")
    7074                      .dwattr $C$DW$869, DW_AT_TI_symbol_name("_halHandle")
    7075                      .dwattr $C$DW$869, DW_AT_data_member_location[DW_OP_plus_uconst 0x2]
    7076                      .dwattr $C$DW$869, DW_AT_accessibility(DW_ACCESS_public)
    7077              $C$DW$870       .dwtag  DW_TAG_member
    7078                      .dwattr $C$DW$870, DW_AT_type(*$C$DW$T$85)
    7079                      .dwattr $C$DW$870, DW_AT_name("StBoxHandle")
    7080                      .dwattr $C$DW$870, DW_AT_TI_symbol_name("_StBoxHandle")
    7081                      .dwattr $C$DW$870, DW_AT_data_member_location[DW_OP_plus_uconst 0x4]
    7082                      .dwattr $C$DW$870, DW_AT_accessibility(DW_ACCESS_public)
    7083              $C$DW$871       .dwtag  DW_TAG_member
    7084                      .dwattr $C$DW$871, DW_AT_type(*$C$DW$T$87)
    7085                      .dwattr $C$DW$871, DW_AT_name("FSM_State")
    7086                      .dwattr $C$DW$871, DW_AT_TI_symbol_name("_FSM_State")
    7087                      .dwattr $C$DW$871, DW_AT_data_member_location[DW_OP_plus_uconst 0x6]
    7088                      .dwattr $C$DW$871, DW_AT_accessibility(DW_ACCESS_public)
    7089              $C$DW$872       .dwtag  DW_TAG_member
TMS320C2000 Assembler PC v6.2.5 Wed Nov 22 14:48:17 2017

Tools Copyright (c) 1996-2014 Texas Instruments Incorporated
C:\Users\wmj\AppData\Local\Temp\1398010                              PAGE  135

    7090                      .dwattr $C$DW$872, DW_AT_type(*$C$DW$T$87)
    7091                      .dwattr $C$DW$872, DW_AT_name("FSM_CurState")
    7092                      .dwattr $C$DW$872, DW_AT_TI_symbol_name("_FSM_CurState")
    7093                      .dwattr $C$DW$872, DW_AT_data_member_location[DW_OP_plus_uconst 0x7]
    7094                      .dwattr $C$DW$872, DW_AT_accessibility(DW_ACCESS_public)
    7095              $C$DW$873       .dwtag  DW_TAG_member
    7096                      .dwattr $C$DW$873, DW_AT_type(*$C$DW$T$89)
    7097                      .dwattr $C$DW$873, DW_AT_name("FSM_Trans")
    7098                      .dwattr $C$DW$873, DW_AT_TI_symbol_name("_FSM_Trans")
    7099                      .dwattr $C$DW$873, DW_AT_data_member_location[DW_OP_plus_uconst 0x8]
    7100                      .dwattr $C$DW$873, DW_AT_accessibility(DW_ACCESS_public)
    7101              $C$DW$874       .dwtag  DW_TAG_member
    7102                      .dwattr $C$DW$874, DW_AT_type(*$C$DW$T$91)
    7103                      .dwattr $C$DW$874, DW_AT_name("FSM_Event")
    7104                      .dwattr $C$DW$874, DW_AT_TI_symbol_name("_FSM_Event")
    7105                      .dwattr $C$DW$874, DW_AT_data_member_location[DW_OP_plus_uconst 0x9]
    7106                      .dwattr $C$DW$874, DW_AT_accessibility(DW_ACCESS_public)
    7107              $C$DW$875       .dwtag  DW_TAG_member
    7108                      .dwattr $C$DW$875, DW_AT_type(*$C$DW$T$93)
    7109                      .dwattr $C$DW$875, DW_AT_name("FSM_StMode")
    7110                      .dwattr $C$DW$875, DW_AT_TI_symbol_name("_FSM_StMode")
    7111                      .dwattr $C$DW$875, DW_AT_data_member_location[DW_OP_plus_uconst 0xa]
    7112                      .dwattr $C$DW$875, DW_AT_accessibility(DW_ACCESS_public)
    7113              $C$DW$876       .dwtag  DW_TAG_member
    7114                      .dwattr $C$DW$876, DW_AT_type(*$C$DW$T$22)
    7115                      .dwattr $C$DW$876, DW_AT_name("FSM_ErrFlg")
    7116                      .dwattr $C$DW$876, DW_AT_TI_symbol_name("_FSM_ErrFlg")
    7117                      .dwattr $C$DW$876, DW_AT_data_member_location[DW_OP_plus_uconst 0xb]
    7118                      .dwattr $C$DW$876, DW_AT_accessibility(DW_ACCESS_public)
    7119              $C$DW$877       .dwtag  DW_TAG_member
    7120                      .dwattr $C$DW$877, DW_AT_type(*$C$DW$T$22)
    7121                      .dwattr $C$DW$877, DW_AT_name("FSM_ErrMask")
    7122                      .dwattr $C$DW$877, DW_AT_TI_symbol_name("_FSM_ErrMask")
    7123                      .dwattr $C$DW$877, DW_AT_data_member_location[DW_OP_plus_uconst 0xc]
    7124                      .dwattr $C$DW$877, DW_AT_accessibility(DW_ACCESS_public)
    7125              $C$DW$878       .dwtag  DW_TAG_member
    7126                      .dwattr $C$DW$878, DW_AT_type(*$C$DW$T$22)
    7127                      .dwattr $C$DW$878, DW_AT_name("FSM_runTime")
    7128                      .dwattr $C$DW$878, DW_AT_TI_symbol_name("_FSM_runTime")
    7129                      .dwattr $C$DW$878, DW_AT_data_member_location[DW_OP_plus_uconst 0xd]
    7130                      .dwattr $C$DW$878, DW_AT_accessibility(DW_ACCESS_public)
    7131              $C$DW$879       .dwtag  DW_TAG_member
    7132                      .dwattr $C$DW$879, DW_AT_type(*$C$DW$T$22)
    7133                      .dwattr $C$DW$879, DW_AT_name("FSM_485Cmd")
    7134                      .dwattr $C$DW$879, DW_AT_TI_symbol_name("_FSM_485Cmd")
    7135                      .dwattr $C$DW$879, DW_AT_data_member_location[DW_OP_plus_uconst 0xe]
    7136                      .dwattr $C$DW$879, DW_AT_accessibility(DW_ACCESS_public)
    7137              $C$DW$880       .dwtag  DW_TAG_member
    7138                      .dwattr $C$DW$880, DW_AT_type(*$C$DW$T$87)
    7139                      .dwattr $C$DW$880, DW_AT_name("FSM_485EditState")
    7140                      .dwattr $C$DW$880, DW_AT_TI_symbol_name("_FSM_485EditState")
    7141                      .dwattr $C$DW$880, DW_AT_data_member_location[DW_OP_plus_uconst 0xf]
    7142                      .dwattr $C$DW$880, DW_AT_accessibility(DW_ACCESS_public)
    7143              $C$DW$881       .dwtag  DW_TAG_member
    7144                      .dwattr $C$DW$881, DW_AT_type(*$C$DW$T$95)
TMS320C2000 Assembler PC v6.2.5 Wed Nov 22 14:48:17 2017

Tools Copyright (c) 1996-2014 Texas Instruments Incorporated
C:\Users\wmj\AppData\Local\Temp\1398010                              PAGE  136

    7145                      .dwattr $C$DW$881, DW_AT_name("FSM_485EditOpt")
    7146                      .dwattr $C$DW$881, DW_AT_TI_symbol_name("_FSM_485EditOpt")
    7147                      .dwattr $C$DW$881, DW_AT_data_member_location[DW_OP_plus_uconst 0x10]
    7148                      .dwattr $C$DW$881, DW_AT_accessibility(DW_ACCESS_public)
    7149              $C$DW$882       .dwtag  DW_TAG_member
    7150                      .dwattr $C$DW$882, DW_AT_type(*$C$DW$T$22)
    7151                      .dwattr $C$DW$882, DW_AT_name("FSM_485RefSpeed")
    7152                      .dwattr $C$DW$882, DW_AT_TI_symbol_name("_FSM_485RefSpeed")
    7153                      .dwattr $C$DW$882, DW_AT_data_member_location[DW_OP_plus_uconst 0x11]
    7154                      .dwattr $C$DW$882, DW_AT_accessibility(DW_ACCESS_public)
    7155              $C$DW$883       .dwtag  DW_TAG_member
    7156                      .dwattr $C$DW$883, DW_AT_type(*$C$DW$T$31)
    7157                      .dwattr $C$DW$883, DW_AT_name("MaxTorque_Nm")
    7158                      .dwattr $C$DW$883, DW_AT_TI_symbol_name("_MaxTorque_Nm")
    7159                      .dwattr $C$DW$883, DW_AT_data_member_location[DW_OP_plus_uconst 0x12]
    7160                      .dwattr $C$DW$883, DW_AT_accessibility(DW_ACCESS_public)
    7161              $C$DW$884       .dwtag  DW_TAG_member
    7162                      .dwattr $C$DW$884, DW_AT_type(*$C$DW$T$97)
    7163                      .dwattr $C$DW$884, DW_AT_name("FSM_CheckCond")
    7164                      .dwattr $C$DW$884, DW_AT_TI_symbol_name("_FSM_CheckCond")
    7165                      .dwattr $C$DW$884, DW_AT_data_member_location[DW_OP_plus_uconst 0x14]
    7166                      .dwattr $C$DW$884, DW_AT_accessibility(DW_ACCESS_public)
    7167              $C$DW$885       .dwtag  DW_TAG_member
    7168                      .dwattr $C$DW$885, DW_AT_type(*$C$DW$T$22)
    7169                      .dwattr $C$DW$885, DW_AT_name("FSM_CondValue")
    7170                      .dwattr $C$DW$885, DW_AT_TI_symbol_name("_FSM_CondValue")
    7171                      .dwattr $C$DW$885, DW_AT_data_member_location[DW_OP_plus_uconst 0x15]
    7172                      .dwattr $C$DW$885, DW_AT_accessibility(DW_ACCESS_public)
    7173              $C$DW$886       .dwtag  DW_TAG_member
    7174                      .dwattr $C$DW$886, DW_AT_type(*$C$DW$T$98)
