TMS320C2000 Assembler PC v6.2.5 Thu Nov 23 20:51:04 2017

Tools Copyright (c) 1996-2014 Texas Instruments Incorporated
C:\Users\wmj\AppData\Local\Temp\0582810                              PAGE    1

       1              ;***************************************************************
       2              ;* TMS320C2000 C/C++ Codegen                         PC v6.2.5 *
       3              ;* Date/Time created: Thu Nov 23 20:51:03 2017                 *
       4              ;***************************************************************
       5                      .compiler_opts --float_support=softlib --hll_source=on --mem_model:code=flat --mem_model:data=large -
       6        0002  FP      .set    XAR2
       7              
       8              $C$DW$CU        .dwtag  DW_TAG_compile_unit
       9                      .dwattr $C$DW$CU, DW_AT_name("D:/BM1000_v1.1/sw/solutions/instaspin/src/proj_bm1000.c")
      10                      .dwattr $C$DW$CU, DW_AT_producer("TMS320C2000 C/C++ Codegen PC v6.2.5 Copyright (c) 1996-2014 Texas I
      11                      .dwattr $C$DW$CU, DW_AT_TI_version(0x01)
      12                      .dwattr $C$DW$CU, DW_AT_comp_dir("D:\BM1000_v1.1\sw\solutions\instaspin_foc\boards\hvkit_rev1p1\f28x\
      13              ;**************************************************************
      14              ;* CINIT RECORDS                                              *

    3081              $C$DW$553       .dwtag  DW_TAG_enumerator, DW_AT_name("GPIO_Number_17"), DW_AT_const_value(0x11)
    3082              $C$DW$554       .dwtag  DW_TAG_enumerator, DW_AT_name("GPIO_Number_18"), DW_AT_const_value(0x12)
    3083              $C$DW$555       .dwtag  DW_TAG_enumerator, DW_AT_name("GPIO_Number_19"), DW_AT_const_value(0x13)
    3084              $C$DW$556       .dwtag  DW_TAG_enumerator, DW_AT_name("GPIO_Rsvd_20"), DW_AT_const_value(0x14)
    3085              $C$DW$557       .dwtag  DW_TAG_enumerator, DW_AT_name("GPIO_Rsvd_21"), DW_AT_const_value(0x15)
    3086              $C$DW$558       .dwtag  DW_TAG_enumerator, DW_AT_name("GPIO_Rsvd_22"), DW_AT_const_value(0x16)
    3087              $C$DW$559       .dwtag  DW_TAG_enumerator, DW_AT_name("GPIO_Rsvd_23"), DW_AT_const_value(0x17)
    3088              $C$DW$560       .dwtag  DW_TAG_enumerator, DW_AT_name("GPIO_Rsvd_24"), DW_AT_const_value(0x18)
    3089              $C$DW$561       .dwtag  DW_TAG_enumerator, DW_AT_name("GPIO_Rsvd_25"), DW_AT_const_value(0x19)
    3090              $C$DW$562       .dwtag  DW_TAG_enumerator, DW_AT_name("GPIO_Rsvd_26"), DW_AT_const_value(0x1a)
    3091              $C$DW$563       .dwtag  DW_TAG_enumerator, DW_AT_name("GPIO_Rsvd_27"), DW_AT_const_value(0x1b)
    3092              $C$DW$564       .dwtag  DW_TAG_enumerator, DW_AT_name("GPIO_Number_28"), DW_AT_const_value(0x1c)
    3093              $C$DW$565       .dwtag  DW_TAG_enumerator, DW_AT_name("GPIO_Number_29"), DW_AT_const_value(0x1d)
    3094              $C$DW$566       .dwtag  DW_TAG_enumerator, DW_AT_name("GPIO_Rsvd_30"), DW_AT_const_value(0x1e)
    3095              $C$DW$567       .dwtag  DW_TAG_enumerator, DW_AT_name("GPIO_Rsvd_31"), DW_AT_const_value(0x1f)
    3096              $C$DW$568       .dwtag  DW_TAG_enumerator, DW_AT_name("GPIO_Number_32"), DW_AT_const_value(0x20)
    3097              $C$DW$569       .dwtag  DW_TAG_enumerator, DW_AT_name("GPIO_Number_33"), DW_AT_const_value(0x21)
    3098              $C$DW$570       .dwtag  DW_TAG_enumerator, DW_AT_name("GPIO_Number_34"), DW_AT_const_value(0x22)
    3099              $C$DW$571       .dwtag  DW_TAG_enumerator, DW_AT_name("GPIO_Number_35"), DW_AT_const_value(0x23)
    3100              $C$DW$572       .dwtag  DW_TAG_enumerator, DW_AT_name("GPIO_Number_36"), DW_AT_const_value(0x24)
    3101              $C$DW$573       .dwtag  DW_TAG_enumerator, DW_AT_name("GPIO_Number_37"), DW_AT_const_value(0x25)
    3102              $C$DW$574       .dwtag  DW_TAG_enumerator, DW_AT_name("GPIO_Number_38"), DW_AT_const_value(0x26)
    3103              $C$DW$575       .dwtag  DW_TAG_enumerator, DW_AT_name("GPIO_numGpios"), DW_AT_const_value(0x27)
    3104                      .dwendtag $C$DW$T$251
    3105              
    3106              $C$DW$T$252     .dwtag  DW_TAG_typedef, DW_AT_name("GPIO_Number_e")
    3107                      .dwattr $C$DW$T$252, DW_AT_type(*$C$DW$T$251)
    3108                      .dwattr $C$DW$T$252, DW_AT_language(DW_LANG_C)
    3109              $C$DW$576       .dwtag  DW_TAG_TI_far_type
    3110                      .dwattr $C$DW$576, DW_AT_type(*$C$DW$T$252)
    3111              $C$DW$T$253     .dwtag  DW_TAG_const_type
    3112                      .dwattr $C$DW$T$253, DW_AT_type(*$C$DW$576)
    3113              
    3114              $C$DW$T$254     .dwtag  DW_TAG_enumeration_type
    3115                      .dwattr $C$DW$T$254, DW_AT_byte_size(0x01)
    3116              $C$DW$577       .dwtag  DW_TAG_enumerator, DW_AT_name("PIE_GroupNumber_1"), DW_AT_const_value(0x00)
    3117              $C$DW$578       .dwtag  DW_TAG_enumerator, DW_AT_name("PIE_GroupNumber_2"), DW_AT_const_value(0x01)
    3118              $C$DW$579       .dwtag  DW_TAG_enumerator, DW_AT_name("PIE_GroupNumber_3"), DW_AT_const_value(0x02)
    3119              $C$DW$580       .dwtag  DW_TAG_enumerator, DW_AT_name("PIE_GroupNumber_4"), DW_AT_const_value(0x03)
    3120              $C$DW$581       .dwtag  DW_TAG_enumerator, DW_AT_name("PIE_GroupNumber_5"), DW_AT_const_value(0x04)
    3121              $C$DW$582       .dwtag  DW_TAG_enumerator, DW_AT_name("PIE_GroupNumber_6"), DW_AT_const_value(0x05)
    3122              $C$DW$583       .dwtag  DW_TAG_enumerator, DW_AT_name("PIE_GroupNumber_7"), DW_AT_const_value(0x06)
    3123              $C$DW$584       .dwtag  DW_TAG_enumerator, DW_AT_name("PIE_GroupNumber_8"), DW_AT_const_value(0x07)
    3124              $C$DW$585       .dwtag  DW_TAG_enumerator, DW_AT_name("PIE_GroupNumber_9"), DW_AT_const_value(0x08)
TMS320C2000 Assembler PC v6.2.5 Thu Nov 23 20:51:04 2017

Tools Copyright (c) 1996-2014 Texas Instruments Incorporated
C:\Users\wmj\AppData\Local\Temp\0582810                              PAGE   61

    3125              $C$DW$586       .dwtag  DW_TAG_enumerator, DW_AT_name("PIE_GroupNumber_10"), DW_AT_const_value(0x09)
    3126              $C$DW$587       .dwtag  DW_TAG_enumerator, DW_AT_name("PIE_GroupNumber_11"), DW_AT_const_value(0x0a)
    3127              $C$DW$588       .dwtag  DW_TAG_enumerator, DW_AT_name("PIE_GroupNumber_12"), DW_AT_const_value(0x0b)
    3128                      .dwendtag $C$DW$T$254
    3129              
    3130              $C$DW$T$255     .dwtag  DW_TAG_typedef, DW_AT_name("PIE_GroupNumber_e")
    3131                      .dwattr $C$DW$T$255, DW_AT_type(*$C$DW$T$254)
    3132                      .dwattr $C$DW$T$255, DW_AT_language(DW_LANG_C)
    3133              
    3134              $C$DW$T$30      .dwtag  DW_TAG_structure_type
    3135                      .dwattr $C$DW$T$30, DW_AT_name("_ADC_Obj_")
    3136                      .dwattr $C$DW$T$30, DW_AT_byte_size(0x6650)
    3137              $C$DW$589       .dwtag  DW_TAG_member
    3138                      .dwattr $C$DW$589, DW_AT_type(*$C$DW$T$24)
    3139                      .dwattr $C$DW$589, DW_AT_name("ADCRESULT")
    3140                      .dwattr $C$DW$589, DW_AT_TI_symbol_name("_ADCRESULT")
    3141                      .dwattr $C$DW$589, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    3142                      .dwattr $C$DW$589, DW_AT_accessibility(DW_ACCESS_public)
    3143              $C$DW$590       .dwtag  DW_TAG_member
    3144                      .dwattr $C$DW$590, DW_AT_type(*$C$DW$T$25)
    3145                      .dwattr $C$DW$590, DW_AT_name("resvd_1")
    3146                      .dwattr $C$DW$590, DW_AT_TI_symbol_name("_resvd_1")
    3147                      .dwattr $C$DW$590, DW_AT_data_member_location[DW_OP_plus_uconst 0x10]
    3148                      .dwattr $C$DW$590, DW_AT_accessibility(DW_ACCESS_public)
    3149              $C$DW$591       .dwtag  DW_TAG_member
    3150                      .dwattr $C$DW$591, DW_AT_type(*$C$DW$T$23)
    3151                      .dwattr $C$DW$591, DW_AT_name("ADCCTL1")
    3152                      .dwattr $C$DW$591, DW_AT_TI_symbol_name("_ADCCTL1")
    3153                      .dwattr $C$DW$591, DW_AT_data_member_location[DW_OP_plus_uconst 0x6600]
    3154                      .dwattr $C$DW$591, DW_AT_accessibility(DW_ACCESS_public)
    3155              $C$DW$592       .dwtag  DW_TAG_member
    3156                      .dwattr $C$DW$592, DW_AT_type(*$C$DW$T$23)
    3157                      .dwattr $C$DW$592, DW_AT_name("ADCCTL2")
    3158                      .dwattr $C$DW$592, DW_AT_TI_symbol_name("_ADCCTL2")
    3159                      .dwattr $C$DW$592, DW_AT_data_member_location[DW_OP_plus_uconst 0x6601]
    3160                      .dwattr $C$DW$592, DW_AT_accessibility(DW_ACCESS_public)
    3161              $C$DW$593       .dwtag  DW_TAG_member
    3162                      .dwattr $C$DW$593, DW_AT_type(*$C$DW$T$26)
    3163                      .dwattr $C$DW$593, DW_AT_name("rsvd_2")
    3164                      .dwattr $C$DW$593, DW_AT_TI_symbol_name("_rsvd_2")
    3165                      .dwattr $C$DW$593, DW_AT_data_member_location[DW_OP_plus_uconst 0x6602]
    3166                      .dwattr $C$DW$593, DW_AT_accessibility(DW_ACCESS_public)
    3167              $C$DW$594       .dwtag  DW_TAG_member
    3168                      .dwattr $C$DW$594, DW_AT_type(*$C$DW$T$23)
    3169                      .dwattr $C$DW$594, DW_AT_name("ADCINTFLG")
    3170                      .dwattr $C$DW$594, DW_AT_TI_symbol_name("_ADCINTFLG")
    3171                      .dwattr $C$DW$594, DW_AT_data_member_location[DW_OP_plus_uconst 0x6604]
    3172                      .dwattr $C$DW$594, DW_AT_accessibility(DW_ACCESS_public)
    3173              $C$DW$595       .dwtag  DW_TAG_member
    3174                      .dwattr $C$DW$595, DW_AT_type(*$C$DW$T$23)
    3175                      .dwattr $C$DW$595, DW_AT_name("ADCINTFLGCLR")
    3176                      .dwattr $C$DW$595, DW_AT_TI_symbol_name("_ADCINTFLGCLR")
    3177                      .dwattr $C$DW$595, DW_AT_data_member_location[DW_OP_plus_uconst 0x6605]
    3178                      .dwattr $C$DW$595, DW_AT_accessibility(DW_ACCESS_public)
    3179              $C$DW$596       .dwtag  DW_TAG_member
TMS320C2000 Assembler PC v6.2.5 Thu Nov 23 20:51:04 2017

Tools Copyright (c) 1996-2014 Texas Instruments Incorporated
C:\Users\wmj\AppData\Local\Temp\0582810                              PAGE   62

    3180                      .dwattr $C$DW$596, DW_AT_type(*$C$DW$T$23)
    3181                      .dwattr $C$DW$596, DW_AT_name("ADCINTOVF")
    3182                      .dwattr $C$DW$596, DW_AT_TI_symbol_name("_ADCINTOVF")
    3183                      .dwattr $C$DW$596, DW_AT_data_member_location[DW_OP_plus_uconst 0x6606]
    3184                      .dwattr $C$DW$596, DW_AT_accessibility(DW_ACCESS_public)
    3185              $C$DW$597       .dwtag  DW_TAG_member
    3186                      .dwattr $C$DW$597, DW_AT_type(*$C$DW$T$23)
    3187                      .dwattr $C$DW$597, DW_AT_name("ADCINTOVFCLR")
    3188                      .dwattr $C$DW$597, DW_AT_TI_symbol_name("_ADCINTOVFCLR")
    3189                      .dwattr $C$DW$597, DW_AT_data_member_location[DW_OP_plus_uconst 0x6607]
    3190                      .dwattr $C$DW$597, DW_AT_accessibility(DW_ACCESS_public)
    3191              $C$DW$598       .dwtag  DW_TAG_member
    3192                      .dwattr $C$DW$598, DW_AT_type(*$C$DW$T$27)
    3193                      .dwattr $C$DW$598, DW_AT_name("INTSELxNy")
    3194                      .dwattr $C$DW$598, DW_AT_TI_symbol_name("_INTSELxNy")
    3195                      .dwattr $C$DW$598, DW_AT_data_member_location[DW_OP_plus_uconst 0x6608]
    3196                      .dwattr $C$DW$598, DW_AT_accessibility(DW_ACCESS_public)
    3197              $C$DW$599       .dwtag  DW_TAG_member
    3198                      .dwattr $C$DW$599, DW_AT_type(*$C$DW$T$28)
    3199                      .dwattr $C$DW$599, DW_AT_name("rsvd_3")
    3200                      .dwattr $C$DW$599, DW_AT_TI_symbol_name("_rsvd_3")
    3201                      .dwattr $C$DW$599, DW_AT_data_member_location[DW_OP_plus_uconst 0x660d]
    3202                      .dwattr $C$DW$599, DW_AT_accessibility(DW_ACCESS_public)
    3203              $C$DW$600       .dwtag  DW_TAG_member
    3204                      .dwattr $C$DW$600, DW_AT_type(*$C$DW$T$23)
    3205                      .dwattr $C$DW$600, DW_AT_name("SOCPRICTRL")
    3206                      .dwattr $C$DW$600, DW_AT_TI_symbol_name("_SOCPRICTRL")
    3207                      .dwattr $C$DW$600, DW_AT_data_member_location[DW_OP_plus_uconst 0x6610]
    3208                      .dwattr $C$DW$600, DW_AT_accessibility(DW_ACCESS_public)
    3209              $C$DW$601       .dwtag  DW_TAG_member
    3210                      .dwattr $C$DW$601, DW_AT_type(*$C$DW$T$23)
    3211                      .dwattr $C$DW$601, DW_AT_name("rsvd_4")
    3212                      .dwattr $C$DW$601, DW_AT_TI_symbol_name("_rsvd_4")
    3213                      .dwattr $C$DW$601, DW_AT_data_member_location[DW_OP_plus_uconst 0x6611]
    3214                      .dwattr $C$DW$601, DW_AT_accessibility(DW_ACCESS_public)
    3215              $C$DW$602       .dwtag  DW_TAG_member
    3216                      .dwattr $C$DW$602, DW_AT_type(*$C$DW$T$23)
    3217                      .dwattr $C$DW$602, DW_AT_name("ADCSAMPLEMODE")
    3218                      .dwattr $C$DW$602, DW_AT_TI_symbol_name("_ADCSAMPLEMODE")
    3219                      .dwattr $C$DW$602, DW_AT_data_member_location[DW_OP_plus_uconst 0x6612]
    3220                      .dwattr $C$DW$602, DW_AT_accessibility(DW_ACCESS_public)
    3221              $C$DW$603       .dwtag  DW_TAG_member
    3222                      .dwattr $C$DW$603, DW_AT_type(*$C$DW$T$23)
    3223                      .dwattr $C$DW$603, DW_AT_name("rsvd_5")
    3224                      .dwattr $C$DW$603, DW_AT_TI_symbol_name("_rsvd_5")
    3225                      .dwattr $C$DW$603, DW_AT_data_member_location[DW_OP_plus_uconst 0x6613]
    3226                      .dwattr $C$DW$603, DW_AT_accessibility(DW_ACCESS_public)
    3227              $C$DW$604       .dwtag  DW_TAG_member
    3228                      .dwattr $C$DW$604, DW_AT_type(*$C$DW$T$23)
    3229                      .dwattr $C$DW$604, DW_AT_name("ADCINTSOCSEL1")
    3230                      .dwattr $C$DW$604, DW_AT_TI_symbol_name("_ADCINTSOCSEL1")
    3231                      .dwattr $C$DW$604, DW_AT_data_member_location[DW_OP_plus_uconst 0x6614]
    3232                      .dwattr $C$DW$604, DW_AT_accessibility(DW_ACCESS_public)
    3233              $C$DW$605       .dwtag  DW_TAG_member
    3234                      .dwattr $C$DW$605, DW_AT_type(*$C$DW$T$23)
TMS320C2000 Assembler PC v6.2.5 Thu Nov 23 20:51:04 2017

Tools Copyright (c) 1996-2014 Texas Instruments Incorporated
C:\Users\wmj\AppData\Local\Temp\0582810                              PAGE   63

    3235                      .dwattr $C$DW$605, DW_AT_name("ADCINTSOCSEL2")
    3236                      .dwattr $C$DW$605, DW_AT_TI_symbol_name("_ADCINTSOCSEL2")
    3237                      .dwattr $C$DW$605, DW_AT_data_member_location[DW_OP_plus_uconst 0x6615]
    3238                      .dwattr $C$DW$605, DW_AT_accessibility(DW_ACCESS_public)
    3239              $C$DW$606       .dwtag  DW_TAG_member
    3240                      .dwattr $C$DW$606, DW_AT_type(*$C$DW$T$26)
    3241                      .dwattr $C$DW$606, DW_AT_name("rsvd_6")
    3242                      .dwattr $C$DW$606, DW_AT_TI_symbol_name("_rsvd_6")
    3243                      .dwattr $C$DW$606, DW_AT_data_member_location[DW_OP_plus_uconst 0x6616]
    3244                      .dwattr $C$DW$606, DW_AT_accessibility(DW_ACCESS_public)
    3245              $C$DW$607       .dwtag  DW_TAG_member
    3246                      .dwattr $C$DW$607, DW_AT_type(*$C$DW$T$23)
    3247                      .dwattr $C$DW$607, DW_AT_name("ADCSOCFLG1")
    3248                      .dwattr $C$DW$607, DW_AT_TI_symbol_name("_ADCSOCFLG1")
    3249                      .dwattr $C$DW$607, DW_AT_data_member_location[DW_OP_plus_uconst 0x6618]
    3250                      .dwattr $C$DW$607, DW_AT_accessibility(DW_ACCESS_public)
    3251              $C$DW$608       .dwtag  DW_TAG_member
    3252                      .dwattr $C$DW$608, DW_AT_type(*$C$DW$T$23)
    3253                      .dwattr $C$DW$608, DW_AT_name("rsvd_7")
    3254                      .dwattr $C$DW$608, DW_AT_TI_symbol_name("_rsvd_7")
    3255                      .dwattr $C$DW$608, DW_AT_data_member_location[DW_OP_plus_uconst 0x6619]
    3256                      .dwattr $C$DW$608, DW_AT_accessibility(DW_ACCESS_public)
    3257              $C$DW$609       .dwtag  DW_TAG_member
    3258                      .dwattr $C$DW$609, DW_AT_type(*$C$DW$T$23)
    3259                      .dwattr $C$DW$609, DW_AT_name("ADCSOCFRC1")
    3260                      .dwattr $C$DW$609, DW_AT_TI_symbol_name("_ADCSOCFRC1")
    3261                      .dwattr $C$DW$609, DW_AT_data_member_location[DW_OP_plus_uconst 0x661a]
    3262                      .dwattr $C$DW$609, DW_AT_accessibility(DW_ACCESS_public)
    3263              $C$DW$610       .dwtag  DW_TAG_member
    3264                      .dwattr $C$DW$610, DW_AT_type(*$C$DW$T$23)
    3265                      .dwattr $C$DW$610, DW_AT_name("rsvd_8")
    3266                      .dwattr $C$DW$610, DW_AT_TI_symbol_name("_rsvd_8")
    3267                      .dwattr $C$DW$610, DW_AT_data_member_location[DW_OP_plus_uconst 0x661b]
    3268                      .dwattr $C$DW$610, DW_AT_accessibility(DW_ACCESS_public)
    3269              $C$DW$611       .dwtag  DW_TAG_member
    3270                      .dwattr $C$DW$611, DW_AT_type(*$C$DW$T$23)
    3271                      .dwattr $C$DW$611, DW_AT_name("ADCSOCOVF1")
    3272                      .dwattr $C$DW$611, DW_AT_TI_symbol_name("_ADCSOCOVF1")
    3273                      .dwattr $C$DW$611, DW_AT_data_member_location[DW_OP_plus_uconst 0x661c]
    3274                      .dwattr $C$DW$611, DW_AT_accessibility(DW_ACCESS_public)
    3275              $C$DW$612       .dwtag  DW_TAG_member
    3276                      .dwattr $C$DW$612, DW_AT_type(*$C$DW$T$23)
    3277                      .dwattr $C$DW$612, DW_AT_name("rsvd_9")
    3278                      .dwattr $C$DW$612, DW_AT_TI_symbol_name("_rsvd_9")
    3279                      .dwattr $C$DW$612, DW_AT_data_member_location[DW_OP_plus_uconst 0x661d]
    3280                      .dwattr $C$DW$612, DW_AT_accessibility(DW_ACCESS_public)
    3281              $C$DW$613       .dwtag  DW_TAG_member
    3282                      .dwattr $C$DW$613, DW_AT_type(*$C$DW$T$23)
    3283                      .dwattr $C$DW$613, DW_AT_name("ADCSOCOVFCLR1")
    3284                      .dwattr $C$DW$613, DW_AT_TI_symbol_name("_ADCSOCOVFCLR1")
    3285                      .dwattr $C$DW$613, DW_AT_data_member_location[DW_OP_plus_uconst 0x661e]
    3286                      .dwattr $C$DW$613, DW_AT_accessibility(DW_ACCESS_public)
    3287              $C$DW$614       .dwtag  DW_TAG_member
    3288                      .dwattr $C$DW$614, DW_AT_type(*$C$DW$T$23)
    3289                      .dwattr $C$DW$614, DW_AT_name("rsvd_10")
TMS320C2000 Assembler PC v6.2.5 Thu Nov 23 20:51:04 2017

Tools Copyright (c) 1996-2014 Texas Instruments Incorporated
C:\Users\wmj\AppData\Local\Temp\0582810                              PAGE   64

    3290                      .dwattr $C$DW$614, DW_AT_TI_symbol_name("_rsvd_10")
    3291                      .dwattr $C$DW$614, DW_AT_data_member_location[DW_OP_plus_uconst 0x661f]
    3292                      .dwattr $C$DW$614, DW_AT_accessibility(DW_ACCESS_public)
    3293              $C$DW$615       .dwtag  DW_TAG_member
    3294                      .dwattr $C$DW$615, DW_AT_type(*$C$DW$T$24)
    3295                      .dwattr $C$DW$615, DW_AT_name("ADCSOCxCTL")
    3296                      .dwattr $C$DW$615, DW_AT_TI_symbol_name("_ADCSOCxCTL")
    3297                      .dwattr $C$DW$615, DW_AT_data_member_location[DW_OP_plus_uconst 0x6620]
    3298                      .dwattr $C$DW$615, DW_AT_accessibility(DW_ACCESS_public)
    3299              $C$DW$616       .dwtag  DW_TAG_member
    3300                      .dwattr $C$DW$616, DW_AT_type(*$C$DW$T$24)
    3301                      .dwattr $C$DW$616, DW_AT_name("rsvd_11")
    3302                      .dwattr $C$DW$616, DW_AT_TI_symbol_name("_rsvd_11")
    3303                      .dwattr $C$DW$616, DW_AT_data_member_location[DW_OP_plus_uconst 0x6630]
    3304                      .dwattr $C$DW$616, DW_AT_accessibility(DW_ACCESS_public)
    3305              $C$DW$617       .dwtag  DW_TAG_member
    3306                      .dwattr $C$DW$617, DW_AT_type(*$C$DW$T$23)
    3307                      .dwattr $C$DW$617, DW_AT_name("ADCREFTRIM")
    3308                      .dwattr $C$DW$617, DW_AT_TI_symbol_name("_ADCREFTRIM")
    3309                      .dwattr $C$DW$617, DW_AT_data_member_location[DW_OP_plus_uconst 0x6640]
    3310                      .dwattr $C$DW$617, DW_AT_accessibility(DW_ACCESS_public)
    3311              $C$DW$618       .dwtag  DW_TAG_member
    3312                      .dwattr $C$DW$618, DW_AT_type(*$C$DW$T$23)
    3313                      .dwattr $C$DW$618, DW_AT_name("ADCOFFTRIM")
    3314                      .dwattr $C$DW$618, DW_AT_TI_symbol_name("_ADCOFFTRIM")
    3315                      .dwattr $C$DW$618, DW_AT_data_member_location[DW_OP_plus_uconst 0x6641]
    3316                      .dwattr $C$DW$618, DW_AT_accessibility(DW_ACCESS_public)
    3317              $C$DW$619       .dwtag  DW_TAG_member
    3318                      .dwattr $C$DW$619, DW_AT_type(*$C$DW$T$29)
    3319                      .dwattr $C$DW$619, DW_AT_name("resvd_12")
    3320                      .dwattr $C$DW$619, DW_AT_TI_symbol_name("_resvd_12")
    3321                      .dwattr $C$DW$619, DW_AT_data_member_location[DW_OP_plus_uconst 0x6642]
    3322                      .dwattr $C$DW$619, DW_AT_accessibility(DW_ACCESS_public)
    3323              $C$DW$620       .dwtag  DW_TAG_member
    3324                      .dwattr $C$DW$620, DW_AT_type(*$C$DW$T$23)
    3325                      .dwattr $C$DW$620, DW_AT_name("ADCREV")
    3326                      .dwattr $C$DW$620, DW_AT_TI_symbol_name("_ADCREV")
    3327                      .dwattr $C$DW$620, DW_AT_data_member_location[DW_OP_plus_uconst 0x664f]
    3328                      .dwattr $C$DW$620, DW_AT_accessibility(DW_ACCESS_public)
    3329                      .dwendtag $C$DW$T$30
    3330              
    3331              $C$DW$T$257     .dwtag  DW_TAG_typedef, DW_AT_name("ADC_Obj")
    3332                      .dwattr $C$DW$T$257, DW_AT_type(*$C$DW$T$30)
    3333                      .dwattr $C$DW$T$257, DW_AT_language(DW_LANG_C)
    3334              $C$DW$T$118     .dwtag  DW_TAG_pointer_type
    3335                      .dwattr $C$DW$T$118, DW_AT_type(*$C$DW$T$30)
    3336                      .dwattr $C$DW$T$118, DW_AT_address_class(0x16)
    3337              $C$DW$T$119     .dwtag  DW_TAG_typedef, DW_AT_name("ADC_Handle")
    3338                      .dwattr $C$DW$T$119, DW_AT_type(*$C$DW$T$118)
    3339                      .dwattr $C$DW$T$119, DW_AT_language(DW_LANG_C)
    3340              
    3341              $C$DW$T$34      .dwtag  DW_TAG_structure_type
    3342                      .dwattr $C$DW$T$34, DW_AT_name("_BRAKE_Obj_")
    3343                      .dwattr $C$DW$T$34, DW_AT_byte_size(0x08)
    3344              $C$DW$621       .dwtag  DW_TAG_member
TMS320C2000 Assembler PC v6.2.5 Thu Nov 23 20:51:04 2017

Tools Copyright (c) 1996-2014 Texas Instruments Incorporated
C:\Users\wmj\AppData\Local\Temp\0582810                              PAGE   65

    3345                      .dwattr $C$DW$621, DW_AT_type(*$C$DW$T$31)
    3346                      .dwattr $C$DW$621, DW_AT_name("angle_pu")
    3347                      .dwattr $C$DW$621, DW_AT_TI_symbol_name("_angle_pu")
    3348                      .dwattr $C$DW$621, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    3349                      .dwattr $C$DW$621, DW_AT_accessibility(DW_ACCESS_public)
    3350              $C$DW$622       .dwtag  DW_TAG_member
    3351                      .dwattr $C$DW$622, DW_AT_type(*$C$DW$T$32)
    3352                      .dwattr $C$DW$622, DW_AT_name("Idq_brake")
    3353                      .dwattr $C$DW$622, DW_AT_TI_symbol_name("_Idq_brake")
    3354                      .dwattr $C$DW$622, DW_AT_data_member_location[DW_OP_plus_uconst 0x2]
    3355                      .dwattr $C$DW$622, DW_AT_accessibility(DW_ACCESS_public)
    3356              $C$DW$623       .dwtag  DW_TAG_member
    3357                      .dwattr $C$DW$623, DW_AT_type(*$C$DW$T$33)
    3358                      .dwattr $C$DW$623, DW_AT_name("brake_enable")
    3359                      .dwattr $C$DW$623, DW_AT_TI_symbol_name("_brake_enable")
    3360                      .dwattr $C$DW$623, DW_AT_data_member_location[DW_OP_plus_uconst 0x6]
    3361                      .dwattr $C$DW$623, DW_AT_accessibility(DW_ACCESS_public)
    3362                      .dwendtag $C$DW$T$34
    3363              
    3364              $C$DW$T$73      .dwtag  DW_TAG_typedef, DW_AT_name("BRAKE_Obj")
    3365                      .dwattr $C$DW$T$73, DW_AT_type(*$C$DW$T$34)
    3366                      .dwattr $C$DW$T$73, DW_AT_language(DW_LANG_C)
    3367              $C$DW$T$71      .dwtag  DW_TAG_pointer_type
    3368                      .dwattr $C$DW$T$71, DW_AT_type(*$C$DW$T$34)
    3369                      .dwattr $C$DW$T$71, DW_AT_address_class(0x16)
    3370              $C$DW$T$72      .dwtag  DW_TAG_typedef, DW_AT_name("BRAKE_Handle")
    3371                      .dwattr $C$DW$T$72, DW_AT_type(*$C$DW$T$71)
    3372                      .dwattr $C$DW$T$72, DW_AT_language(DW_LANG_C)
    3373              
    3374              $C$DW$T$36      .dwtag  DW_TAG_structure_type
    3375                      .dwattr $C$DW$T$36, DW_AT_name("_CLARKE_Obj_")
    3376                      .dwattr $C$DW$T$36, DW_AT_byte_size(0x06)
    3377              $C$DW$624       .dwtag  DW_TAG_member
    3378                      .dwattr $C$DW$624, DW_AT_type(*$C$DW$T$31)
    3379                      .dwattr $C$DW$624, DW_AT_name("alpha_sf")
    3380                      .dwattr $C$DW$624, DW_AT_TI_symbol_name("_alpha_sf")
    3381                      .dwattr $C$DW$624, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    3382                      .dwattr $C$DW$624, DW_AT_accessibility(DW_ACCESS_public)
    3383              $C$DW$625       .dwtag  DW_TAG_member
    3384                      .dwattr $C$DW$625, DW_AT_type(*$C$DW$T$31)
    3385                      .dwattr $C$DW$625, DW_AT_name("beta_sf")
    3386                      .dwattr $C$DW$625, DW_AT_TI_symbol_name("_beta_sf")
    3387                      .dwattr $C$DW$625, DW_AT_data_member_location[DW_OP_plus_uconst 0x2]
    3388                      .dwattr $C$DW$625, DW_AT_accessibility(DW_ACCESS_public)
    3389              $C$DW$626       .dwtag  DW_TAG_member
    3390                      .dwattr $C$DW$626, DW_AT_type(*$C$DW$T$35)
    3391                      .dwattr $C$DW$626, DW_AT_name("numSensors")
    3392                      .dwattr $C$DW$626, DW_AT_TI_symbol_name("_numSensors")
    3393                      .dwattr $C$DW$626, DW_AT_data_member_location[DW_OP_plus_uconst 0x4]
    3394                      .dwattr $C$DW$626, DW_AT_accessibility(DW_ACCESS_public)
    3395                      .dwendtag $C$DW$T$36
    3396              
    3397              $C$DW$T$47      .dwtag  DW_TAG_typedef, DW_AT_name("CLARKE_Obj")
    3398                      .dwattr $C$DW$T$47, DW_AT_type(*$C$DW$T$36)
    3399                      .dwattr $C$DW$T$47, DW_AT_language(DW_LANG_C)
TMS320C2000 Assembler PC v6.2.5 Thu Nov 23 20:51:04 2017

Tools Copyright (c) 1996-2014 Texas Instruments Incorporated
C:\Users\wmj\AppData\Local\Temp\0582810                              PAGE   66

    3400              $C$DW$T$45      .dwtag  DW_TAG_pointer_type
    3401                      .dwattr $C$DW$T$45, DW_AT_type(*$C$DW$T$36)
    3402                      .dwattr $C$DW$T$45, DW_AT_address_class(0x16)
    3403              $C$DW$T$46      .dwtag  DW_TAG_typedef, DW_AT_name("CLARKE_Handle")
    3404                      .dwattr $C$DW$T$46, DW_AT_type(*$C$DW$T$45)
    3405                      .dwattr $C$DW$T$46, DW_AT_language(DW_LANG_C)
    3406              
    3407              $C$DW$T$38      .dwtag  DW_TAG_structure_type
    3408                      .dwattr $C$DW$T$38, DW_AT_name("_CLK_Obj_")
    3409                      .dwattr $C$DW$T$38, DW_AT_byte_size(0x11)
    3410              $C$DW$627       .dwtag  DW_TAG_member
    3411                      .dwattr $C$DW$627, DW_AT_type(*$C$DW$T$23)
    3412                      .dwattr $C$DW$627, DW_AT_name("XCLK")
    3413                      .dwattr $C$DW$627, DW_AT_TI_symbol_name("_XCLK")
    3414                      .dwattr $C$DW$627, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    3415                      .dwattr $C$DW$627, DW_AT_accessibility(DW_ACCESS_public)
    3416              $C$DW$628       .dwtag  DW_TAG_member
    3417                      .dwattr $C$DW$628, DW_AT_type(*$C$DW$T$23)
    3418                      .dwattr $C$DW$628, DW_AT_name("rsvd_1")
    3419                      .dwattr $C$DW$628, DW_AT_TI_symbol_name("_rsvd_1")
    3420                      .dwattr $C$DW$628, DW_AT_data_member_location[DW_OP_plus_uconst 0x1]
    3421                      .dwattr $C$DW$628, DW_AT_accessibility(DW_ACCESS_public)
    3422              $C$DW$629       .dwtag  DW_TAG_member
    3423                      .dwattr $C$DW$629, DW_AT_type(*$C$DW$T$23)
    3424                      .dwattr $C$DW$629, DW_AT_name("CLKCTL")
    3425                      .dwattr $C$DW$629, DW_AT_TI_symbol_name("_CLKCTL")
    3426                      .dwattr $C$DW$629, DW_AT_data_member_location[DW_OP_plus_uconst 0x2]
    3427                      .dwattr $C$DW$629, DW_AT_accessibility(DW_ACCESS_public)
    3428              $C$DW$630       .dwtag  DW_TAG_member
    3429                      .dwattr $C$DW$630, DW_AT_type(*$C$DW$T$37)
    3430                      .dwattr $C$DW$630, DW_AT_name("rsvd_2")
    3431                      .dwattr $C$DW$630, DW_AT_TI_symbol_name("_rsvd_2")
    3432                      .dwattr $C$DW$630, DW_AT_data_member_location[DW_OP_plus_uconst 0x3]
    3433                      .dwattr $C$DW$630, DW_AT_accessibility(DW_ACCESS_public)
    3434              $C$DW$631       .dwtag  DW_TAG_member
    3435                      .dwattr $C$DW$631, DW_AT_type(*$C$DW$T$23)
    3436                      .dwattr $C$DW$631, DW_AT_name("LOSPCP")
    3437                      .dwattr $C$DW$631, DW_AT_TI_symbol_name("_LOSPCP")
    3438                      .dwattr $C$DW$631, DW_AT_data_member_location[DW_OP_plus_uconst 0xb]
    3439                      .dwattr $C$DW$631, DW_AT_accessibility(DW_ACCESS_public)
    3440              $C$DW$632       .dwtag  DW_TAG_member
    3441                      .dwattr $C$DW$632, DW_AT_type(*$C$DW$T$23)
    3442                      .dwattr $C$DW$632, DW_AT_name("PCLKCR0")
    3443                      .dwattr $C$DW$632, DW_AT_TI_symbol_name("_PCLKCR0")
    3444                      .dwattr $C$DW$632, DW_AT_data_member_location[DW_OP_plus_uconst 0xc]
    3445                      .dwattr $C$DW$632, DW_AT_accessibility(DW_ACCESS_public)
    3446              $C$DW$633       .dwtag  DW_TAG_member
    3447                      .dwattr $C$DW$633, DW_AT_type(*$C$DW$T$23)
    3448                      .dwattr $C$DW$633, DW_AT_name("PCLKCR1")
    3449                      .dwattr $C$DW$633, DW_AT_TI_symbol_name("_PCLKCR1")
    3450                      .dwattr $C$DW$633, DW_AT_data_member_location[DW_OP_plus_uconst 0xd]
    3451                      .dwattr $C$DW$633, DW_AT_accessibility(DW_ACCESS_public)
    3452              $C$DW$634       .dwtag  DW_TAG_member
    3453                      .dwattr $C$DW$634, DW_AT_type(*$C$DW$T$26)
    3454                      .dwattr $C$DW$634, DW_AT_name("rsvd_3")
TMS320C2000 Assembler PC v6.2.5 Thu Nov 23 20:51:04 2017

Tools Copyright (c) 1996-2014 Texas Instruments Incorporated
C:\Users\wmj\AppData\Local\Temp\0582810                              PAGE   67

    3455                      .dwattr $C$DW$634, DW_AT_TI_symbol_name("_rsvd_3")
    3456                      .dwattr $C$DW$634, DW_AT_data_member_location[DW_OP_plus_uconst 0xe]
    3457                      .dwattr $C$DW$634, DW_AT_accessibility(DW_ACCESS_public)
    3458              $C$DW$635       .dwtag  DW_TAG_member
    3459                      .dwattr $C$DW$635, DW_AT_type(*$C$DW$T$23)
    3460                      .dwattr $C$DW$635, DW_AT_name("PCLKCR3")
    3461                      .dwattr $C$DW$635, DW_AT_TI_symbol_name("_PCLKCR3")
    3462                      .dwattr $C$DW$635, DW_AT_data_member_location[DW_OP_plus_uconst 0x10]
    3463                      .dwattr $C$DW$635, DW_AT_accessibility(DW_ACCESS_public)
    3464                      .dwendtag $C$DW$T$38
    3465              
    3466              $C$DW$T$120     .dwtag  DW_TAG_pointer_type
    3467                      .dwattr $C$DW$T$120, DW_AT_type(*$C$DW$T$38)
    3468                      .dwattr $C$DW$T$120, DW_AT_address_class(0x16)
    3469              $C$DW$T$121     .dwtag  DW_TAG_typedef, DW_AT_name("CLK_Handle")
    3470                      .dwattr $C$DW$T$121, DW_AT_type(*$C$DW$T$120)
    3471                      .dwattr $C$DW$T$121, DW_AT_language(DW_LANG_C)
    3472              
    3473              $C$DW$T$39      .dwtag  DW_TAG_structure_type
    3474                      .dwattr $C$DW$T$39, DW_AT_name("_CPU_Obj_")
    3475                      .dwattr $C$DW$T$39, DW_AT_byte_size(0x01)
    3476              $C$DW$636       .dwtag  DW_TAG_member
    3477                      .dwattr $C$DW$636, DW_AT_type(*$C$DW$T$35)
    3478                      .dwattr $C$DW$636, DW_AT_name("tmp")
    3479                      .dwattr $C$DW$636, DW_AT_TI_symbol_name("_tmp")
    3480                      .dwattr $C$DW$636, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    3481                      .dwattr $C$DW$636, DW_AT_accessibility(DW_ACCESS_public)
    3482                      .dwendtag $C$DW$T$39
    3483              
    3484              $C$DW$T$122     .dwtag  DW_TAG_pointer_type
    3485                      .dwattr $C$DW$T$122, DW_AT_type(*$C$DW$T$39)
    3486                      .dwattr $C$DW$T$122, DW_AT_address_class(0x16)
    3487              $C$DW$T$123     .dwtag  DW_TAG_typedef, DW_AT_name("CPU_Handle")
    3488                      .dwattr $C$DW$T$123, DW_AT_type(*$C$DW$T$122)
    3489                      .dwattr $C$DW$T$123, DW_AT_language(DW_LANG_C)
    3490              
    3491              $C$DW$T$74      .dwtag  DW_TAG_structure_type
    3492                      .dwattr $C$DW$T$74, DW_AT_name("_CTRL_Obj_")
    3493                      .dwattr $C$DW$T$74, DW_AT_byte_size(0x10a)
    3494              $C$DW$637       .dwtag  DW_TAG_member
    3495                      .dwattr $C$DW$637, DW_AT_type(*$C$DW$T$40)
    3496                      .dwattr $C$DW$637, DW_AT_name("version")
    3497                      .dwattr $C$DW$637, DW_AT_TI_symbol_name("_version")
    3498                      .dwattr $C$DW$637, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    3499                      .dwattr $C$DW$637, DW_AT_accessibility(DW_ACCESS_public)
    3500              $C$DW$638       .dwtag  DW_TAG_member
    3501                      .dwattr $C$DW$638, DW_AT_type(*$C$DW$T$42)
    3502                      .dwattr $C$DW$638, DW_AT_name("state")
    3503                      .dwattr $C$DW$638, DW_AT_TI_symbol_name("_state")
    3504                      .dwattr $C$DW$638, DW_AT_data_member_location[DW_OP_plus_uconst 0x4]
    3505                      .dwattr $C$DW$638, DW_AT_accessibility(DW_ACCESS_public)
    3506              $C$DW$639       .dwtag  DW_TAG_member
    3507                      .dwattr $C$DW$639, DW_AT_type(*$C$DW$T$42)
    3508                      .dwattr $C$DW$639, DW_AT_name("prevState")
    3509                      .dwattr $C$DW$639, DW_AT_TI_symbol_name("_prevState")
TMS320C2000 Assembler PC v6.2.5 Thu Nov 23 20:51:04 2017

Tools Copyright (c) 1996-2014 Texas Instruments Incorporated
C:\Users\wmj\AppData\Local\Temp\0582810                              PAGE   68

    3510                      .dwattr $C$DW$639, DW_AT_data_member_location[DW_OP_plus_uconst 0x5]
    3511                      .dwattr $C$DW$639, DW_AT_accessibility(DW_ACCESS_public)
    3512              $C$DW$640       .dwtag  DW_TAG_member
    3513                      .dwattr $C$DW$640, DW_AT_type(*$C$DW$T$44)
    3514                      .dwattr $C$DW$640, DW_AT_name("errorCode")
    3515                      .dwattr $C$DW$640, DW_AT_TI_symbol_name("_errorCode")
    3516                      .dwattr $C$DW$640, DW_AT_data_member_location[DW_OP_plus_uconst 0x6]
    3517                      .dwattr $C$DW$640, DW_AT_accessibility(DW_ACCESS_public)
    3518              $C$DW$641       .dwtag  DW_TAG_member
    3519                      .dwattr $C$DW$641, DW_AT_type(*$C$DW$T$46)
    3520                      .dwattr $C$DW$641, DW_AT_name("clarkeHandle_I")
    3521                      .dwattr $C$DW$641, DW_AT_TI_symbol_name("_clarkeHandle_I")
    3522                      .dwattr $C$DW$641, DW_AT_data_member_location[DW_OP_plus_uconst 0x8]
    3523                      .dwattr $C$DW$641, DW_AT_accessibility(DW_ACCESS_public)
    3524              $C$DW$642       .dwtag  DW_TAG_member
    3525                      .dwattr $C$DW$642, DW_AT_type(*$C$DW$T$47)
    3526                      .dwattr $C$DW$642, DW_AT_name("clarke_I")
    3527                      .dwattr $C$DW$642, DW_AT_TI_symbol_name("_clarke_I")
    3528                      .dwattr $C$DW$642, DW_AT_data_member_location[DW_OP_plus_uconst 0xa]
    3529                      .dwattr $C$DW$642, DW_AT_accessibility(DW_ACCESS_public)
    3530              $C$DW$643       .dwtag  DW_TAG_member
    3531                      .dwattr $C$DW$643, DW_AT_type(*$C$DW$T$46)
    3532                      .dwattr $C$DW$643, DW_AT_name("clarkeHandle_V")
    3533                      .dwattr $C$DW$643, DW_AT_TI_symbol_name("_clarkeHandle_V")
    3534                      .dwattr $C$DW$643, DW_AT_data_member_location[DW_OP_plus_uconst 0x10]
    3535                      .dwattr $C$DW$643, DW_AT_accessibility(DW_ACCESS_public)
    3536              $C$DW$644       .dwtag  DW_TAG_member
    3537                      .dwattr $C$DW$644, DW_AT_type(*$C$DW$T$47)
    3538                      .dwattr $C$DW$644, DW_AT_name("clarke_V")
    3539                      .dwattr $C$DW$644, DW_AT_TI_symbol_name("_clarke_V")
    3540                      .dwattr $C$DW$644, DW_AT_data_member_location[DW_OP_plus_uconst 0x12]
    3541                      .dwattr $C$DW$644, DW_AT_accessibility(DW_ACCESS_public)
    3542              $C$DW$645       .dwtag  DW_TAG_member
    3543                      .dwattr $C$DW$645, DW_AT_type(*$C$DW$T$49)
    3544                      .dwattr $C$DW$645, DW_AT_name("estHandle")
    3545                      .dwattr $C$DW$645, DW_AT_TI_symbol_name("_estHandle")
    3546                      .dwattr $C$DW$645, DW_AT_data_member_location[DW_OP_plus_uconst 0x18]
    3547                      .dwattr $C$DW$645, DW_AT_accessibility(DW_ACCESS_public)
    3548              $C$DW$646       .dwtag  DW_TAG_member
    3549                      .dwattr $C$DW$646, DW_AT_type(*$C$DW$T$51)
    3550                      .dwattr $C$DW$646, DW_AT_name("parkHandle")
    3551                      .dwattr $C$DW$646, DW_AT_TI_symbol_name("_parkHandle")
    3552                      .dwattr $C$DW$646, DW_AT_data_member_location[DW_OP_plus_uconst 0x1a]
    3553                      .dwattr $C$DW$646, DW_AT_accessibility(DW_ACCESS_public)
    3554              $C$DW$647       .dwtag  DW_TAG_member
    3555                      .dwattr $C$DW$647, DW_AT_type(*$C$DW$T$52)
    3556                      .dwattr $C$DW$647, DW_AT_name("park")
    3557                      .dwattr $C$DW$647, DW_AT_TI_symbol_name("_park")
    3558                      .dwattr $C$DW$647, DW_AT_data_member_location[DW_OP_plus_uconst 0x1c]
    3559                      .dwattr $C$DW$647, DW_AT_accessibility(DW_ACCESS_public)
    3560              $C$DW$648       .dwtag  DW_TAG_member
    3561                      .dwattr $C$DW$648, DW_AT_type(*$C$DW$T$54)
    3562                      .dwattr $C$DW$648, DW_AT_name("pidHandle_Id")
    3563                      .dwattr $C$DW$648, DW_AT_TI_symbol_name("_pidHandle_Id")
    3564                      .dwattr $C$DW$648, DW_AT_data_member_location[DW_OP_plus_uconst 0x20]
TMS320C2000 Assembler PC v6.2.5 Thu Nov 23 20:51:04 2017

Tools Copyright (c) 1996-2014 Texas Instruments Incorporated
C:\Users\wmj\AppData\Local\Temp\0582810                              PAGE   69

    3565                      .dwattr $C$DW$648, DW_AT_accessibility(DW_ACCESS_public)
    3566              $C$DW$649       .dwtag  DW_TAG_member
    3567                      .dwattr $C$DW$649, DW_AT_type(*$C$DW$T$55)
    3568                      .dwattr $C$DW$649, DW_AT_name("pid_Id")
    3569                      .dwattr $C$DW$649, DW_AT_TI_symbol_name("_pid_Id")
    3570                      .dwattr $C$DW$649, DW_AT_data_member_location[DW_OP_plus_uconst 0x22]
    3571                      .dwattr $C$DW$649, DW_AT_accessibility(DW_ACCESS_public)
    3572              $C$DW$650       .dwtag  DW_TAG_member
    3573                      .dwattr $C$DW$650, DW_AT_type(*$C$DW$T$54)
    3574                      .dwattr $C$DW$650, DW_AT_name("pidHandle_Iq")
    3575                      .dwattr $C$DW$650, DW_AT_TI_symbol_name("_pidHandle_Iq")
    3576                      .dwattr $C$DW$650, DW_AT_data_member_location[DW_OP_plus_uconst 0x32]
    3577                      .dwattr $C$DW$650, DW_AT_accessibility(DW_ACCESS_public)
    3578              $C$DW$651       .dwtag  DW_TAG_member
    3579                      .dwattr $C$DW$651, DW_AT_type(*$C$DW$T$55)
    3580                      .dwattr $C$DW$651, DW_AT_name("pid_Iq")
    3581                      .dwattr $C$DW$651, DW_AT_TI_symbol_name("_pid_Iq")
    3582                      .dwattr $C$DW$651, DW_AT_data_member_location[DW_OP_plus_uconst 0x34]
    3583                      .dwattr $C$DW$651, DW_AT_accessibility(DW_ACCESS_public)
    3584              $C$DW$652       .dwtag  DW_TAG_member
    3585                      .dwattr $C$DW$652, DW_AT_type(*$C$DW$T$54)
    3586                      .dwattr $C$DW$652, DW_AT_name("pidHandle_spd")
    3587                      .dwattr $C$DW$652, DW_AT_TI_symbol_name("_pidHandle_spd")
    3588                      .dwattr $C$DW$652, DW_AT_data_member_location[DW_OP_plus_uconst 0x44]
    3589                      .dwattr $C$DW$652, DW_AT_accessibility(DW_ACCESS_public)
    3590              $C$DW$653       .dwtag  DW_TAG_member
    3591                      .dwattr $C$DW$653, DW_AT_type(*$C$DW$T$55)
    3592                      .dwattr $C$DW$653, DW_AT_name("pid_spd")
    3593                      .dwattr $C$DW$653, DW_AT_TI_symbol_name("_pid_spd")
    3594                      .dwattr $C$DW$653, DW_AT_data_member_location[DW_OP_plus_uconst 0x46]
    3595                      .dwattr $C$DW$653, DW_AT_accessibility(DW_ACCESS_public)
    3596              $C$DW$654       .dwtag  DW_TAG_member
    3597                      .dwattr $C$DW$654, DW_AT_type(*$C$DW$T$57)
    3598                      .dwattr $C$DW$654, DW_AT_name("iparkHandle")
    3599                      .dwattr $C$DW$654, DW_AT_TI_symbol_name("_iparkHandle")
    3600                      .dwattr $C$DW$654, DW_AT_data_member_location[DW_OP_plus_uconst 0x56]
    3601                      .dwattr $C$DW$654, DW_AT_accessibility(DW_ACCESS_public)
    3602              $C$DW$655       .dwtag  DW_TAG_member
    3603                      .dwattr $C$DW$655, DW_AT_type(*$C$DW$T$58)
    3604                      .dwattr $C$DW$655, DW_AT_name("ipark")
    3605                      .dwattr $C$DW$655, DW_AT_TI_symbol_name("_ipark")
    3606                      .dwattr $C$DW$655, DW_AT_data_member_location[DW_OP_plus_uconst 0x58]
    3607                      .dwattr $C$DW$655, DW_AT_accessibility(DW_ACCESS_public)
    3608              $C$DW$656       .dwtag  DW_TAG_member
    3609                      .dwattr $C$DW$656, DW_AT_type(*$C$DW$T$60)
    3610                      .dwattr $C$DW$656, DW_AT_name("svgenHandle")
    3611                      .dwattr $C$DW$656, DW_AT_TI_symbol_name("_svgenHandle")
    3612                      .dwattr $C$DW$656, DW_AT_data_member_location[DW_OP_plus_uconst 0x5c]
    3613                      .dwattr $C$DW$656, DW_AT_accessibility(DW_ACCESS_public)
    3614              $C$DW$657       .dwtag  DW_TAG_member
    3615                      .dwattr $C$DW$657, DW_AT_type(*$C$DW$T$61)
    3616                      .dwattr $C$DW$657, DW_AT_name("svgen")
    3617                      .dwattr $C$DW$657, DW_AT_TI_symbol_name("_svgen")
    3618                      .dwattr $C$DW$657, DW_AT_data_member_location[DW_OP_plus_uconst 0x5e]
    3619                      .dwattr $C$DW$657, DW_AT_accessibility(DW_ACCESS_public)
TMS320C2000 Assembler PC v6.2.5 Thu Nov 23 20:51:04 2017

Tools Copyright (c) 1996-2014 Texas Instruments Incorporated
C:\Users\wmj\AppData\Local\Temp\0582810                              PAGE   70

    3620              $C$DW$658       .dwtag  DW_TAG_member
    3621                      .dwattr $C$DW$658, DW_AT_type(*$C$DW$T$63)
    3622                      .dwattr $C$DW$658, DW_AT_name("trajHandle_Id")
    3623                      .dwattr $C$DW$658, DW_AT_TI_symbol_name("_trajHandle_Id")
    3624                      .dwattr $C$DW$658, DW_AT_data_member_location[DW_OP_plus_uconst 0x60]
    3625                      .dwattr $C$DW$658, DW_AT_accessibility(DW_ACCESS_public)
    3626              $C$DW$659       .dwtag  DW_TAG_member
    3627                      .dwattr $C$DW$659, DW_AT_type(*$C$DW$T$64)
    3628                      .dwattr $C$DW$659, DW_AT_name("traj_Id")
    3629                      .dwattr $C$DW$659, DW_AT_TI_symbol_name("_traj_Id")
    3630                      .dwattr $C$DW$659, DW_AT_data_member_location[DW_OP_plus_uconst 0x62]
    3631                      .dwattr $C$DW$659, DW_AT_accessibility(DW_ACCESS_public)
    3632              $C$DW$660       .dwtag  DW_TAG_member
    3633                      .dwattr $C$DW$660, DW_AT_type(*$C$DW$T$63)
    3634                      .dwattr $C$DW$660, DW_AT_name("trajHandle_spd")
    3635                      .dwattr $C$DW$660, DW_AT_TI_symbol_name("_trajHandle_spd")
    3636                      .dwattr $C$DW$660, DW_AT_data_member_location[DW_OP_plus_uconst 0x6c]
    3637                      .dwattr $C$DW$660, DW_AT_accessibility(DW_ACCESS_public)
    3638              $C$DW$661       .dwtag  DW_TAG_member
    3639                      .dwattr $C$DW$661, DW_AT_type(*$C$DW$T$64)
    3640                      .dwattr $C$DW$661, DW_AT_name("traj_spd")
    3641                      .dwattr $C$DW$661, DW_AT_TI_symbol_name("_traj_spd")
    3642                      .dwattr $C$DW$661, DW_AT_data_member_location[DW_OP_plus_uconst 0x6e]
    3643                      .dwattr $C$DW$661, DW_AT_accessibility(DW_ACCESS_public)
    3644              $C$DW$662       .dwtag  DW_TAG_member
    3645                      .dwattr $C$DW$662, DW_AT_type(*$C$DW$T$63)
    3646                      .dwattr $C$DW$662, DW_AT_name("trajHandle_spdMax")
    3647                      .dwattr $C$DW$662, DW_AT_TI_symbol_name("_trajHandle_spdMax")
    3648                      .dwattr $C$DW$662, DW_AT_data_member_location[DW_OP_plus_uconst 0x78]
    3649                      .dwattr $C$DW$662, DW_AT_accessibility(DW_ACCESS_public)
    3650              $C$DW$663       .dwtag  DW_TAG_member
    3651                      .dwattr $C$DW$663, DW_AT_type(*$C$DW$T$64)
    3652                      .dwattr $C$DW$663, DW_AT_name("traj_spdMax")
    3653                      .dwattr $C$DW$663, DW_AT_TI_symbol_name("_traj_spdMax")
    3654                      .dwattr $C$DW$663, DW_AT_data_member_location[DW_OP_plus_uconst 0x7a]
    3655                      .dwattr $C$DW$663, DW_AT_accessibility(DW_ACCESS_public)
    3656              $C$DW$664       .dwtag  DW_TAG_member
    3657                      .dwattr $C$DW$664, DW_AT_type(*$C$DW$T$65)
    3658                      .dwattr $C$DW$664, DW_AT_name("motorParams")
    3659                      .dwattr $C$DW$664, DW_AT_TI_symbol_name("_motorParams")
    3660                      .dwattr $C$DW$664, DW_AT_data_member_location[DW_OP_plus_uconst 0x84]
    3661                      .dwattr $C$DW$664, DW_AT_accessibility(DW_ACCESS_public)
    3662              $C$DW$665       .dwtag  DW_TAG_member
    3663                      .dwattr $C$DW$665, DW_AT_type(*$C$DW$T$68)
    3664                      .dwattr $C$DW$665, DW_AT_name("waitTimes")
    3665                      .dwattr $C$DW$665, DW_AT_TI_symbol_name("_waitTimes")
    3666                      .dwattr $C$DW$665, DW_AT_data_member_location[DW_OP_plus_uconst 0x92]
    3667                      .dwattr $C$DW$665, DW_AT_accessibility(DW_ACCESS_public)
    3668              $C$DW$666       .dwtag  DW_TAG_member
    3669                      .dwattr $C$DW$666, DW_AT_type(*$C$DW$T$67)
    3670                      .dwattr $C$DW$666, DW_AT_name("counter_state")
    3671                      .dwattr $C$DW$666, DW_AT_TI_symbol_name("_counter_state")
    3672                      .dwattr $C$DW$666, DW_AT_data_member_location[DW_OP_plus_uconst 0x9a]
    3673                      .dwattr $C$DW$666, DW_AT_accessibility(DW_ACCESS_public)
    3674              $C$DW$667       .dwtag  DW_TAG_member
TMS320C2000 Assembler PC v6.2.5 Thu Nov 23 20:51:04 2017

Tools Copyright (c) 1996-2014 Texas Instruments Incorporated
C:\Users\wmj\AppData\Local\Temp\0582810                              PAGE   71

    3675                      .dwattr $C$DW$667, DW_AT_type(*$C$DW$T$69)
    3676                      .dwattr $C$DW$667, DW_AT_name("numIsrTicksPerCtrlTick")
    3677                      .dwattr $C$DW$667, DW_AT_TI_symbol_name("_numIsrTicksPerCtrlTick")
    3678                      .dwattr $C$DW$667, DW_AT_data_member_location[DW_OP_plus_uconst 0x9c]
    3679                      .dwattr $C$DW$667, DW_AT_accessibility(DW_ACCESS_public)
    3680              $C$DW$668       .dwtag  DW_TAG_member
    3681                      .dwattr $C$DW$668, DW_AT_type(*$C$DW$T$69)
    3682                      .dwattr $C$DW$668, DW_AT_name("numCtrlTicksPerCurrentTick")
    3683                      .dwattr $C$DW$668, DW_AT_TI_symbol_name("_numCtrlTicksPerCurrentTick")
    3684                      .dwattr $C$DW$668, DW_AT_data_member_location[DW_OP_plus_uconst 0x9d]
    3685                      .dwattr $C$DW$668, DW_AT_accessibility(DW_ACCESS_public)
    3686              $C$DW$669       .dwtag  DW_TAG_member
    3687                      .dwattr $C$DW$669, DW_AT_type(*$C$DW$T$69)
    3688                      .dwattr $C$DW$669, DW_AT_name("numCtrlTicksPerSpeedTick")
    3689                      .dwattr $C$DW$669, DW_AT_TI_symbol_name("_numCtrlTicksPerSpeedTick")
    3690                      .dwattr $C$DW$669, DW_AT_data_member_location[DW_OP_plus_uconst 0x9e]
    3691                      .dwattr $C$DW$669, DW_AT_accessibility(DW_ACCESS_public)
    3692              $C$DW$670       .dwtag  DW_TAG_member
    3693                      .dwattr $C$DW$670, DW_AT_type(*$C$DW$T$69)
    3694                      .dwattr $C$DW$670, DW_AT_name("numCtrlTicksPerTrajTick")
    3695                      .dwattr $C$DW$670, DW_AT_TI_symbol_name("_numCtrlTicksPerTrajTick")
    3696                      .dwattr $C$DW$670, DW_AT_data_member_location[DW_OP_plus_uconst 0x9f]
    3697                      .dwattr $C$DW$670, DW_AT_accessibility(DW_ACCESS_public)
    3698              $C$DW$671       .dwtag  DW_TAG_member
    3699                      .dwattr $C$DW$671, DW_AT_type(*$C$DW$T$67)
    3700                      .dwattr $C$DW$671, DW_AT_name("ctrlFreq_Hz")
    3701                      .dwattr $C$DW$671, DW_AT_TI_symbol_name("_ctrlFreq_Hz")
    3702                      .dwattr $C$DW$671, DW_AT_data_member_location[DW_OP_plus_uconst 0xa0]
    3703                      .dwattr $C$DW$671, DW_AT_accessibility(DW_ACCESS_public)
    3704              $C$DW$672       .dwtag  DW_TAG_member
    3705                      .dwattr $C$DW$672, DW_AT_type(*$C$DW$T$67)
    3706                      .dwattr $C$DW$672, DW_AT_name("trajFreq_Hz")
    3707                      .dwattr $C$DW$672, DW_AT_TI_symbol_name("_trajFreq_Hz")
    3708                      .dwattr $C$DW$672, DW_AT_data_member_location[DW_OP_plus_uconst 0xa2]
    3709                      .dwattr $C$DW$672, DW_AT_accessibility(DW_ACCESS_public)
    3710              $C$DW$673       .dwtag  DW_TAG_member
    3711                      .dwattr $C$DW$673, DW_AT_type(*$C$DW$T$31)
    3712                      .dwattr $C$DW$673, DW_AT_name("trajPeriod_sec")
    3713                      .dwattr $C$DW$673, DW_AT_TI_symbol_name("_trajPeriod_sec")
    3714                      .dwattr $C$DW$673, DW_AT_data_member_location[DW_OP_plus_uconst 0xa4]
    3715                      .dwattr $C$DW$673, DW_AT_accessibility(DW_ACCESS_public)
    3716              $C$DW$674       .dwtag  DW_TAG_member
    3717                      .dwattr $C$DW$674, DW_AT_type(*$C$DW$T$70)
    3718                      .dwattr $C$DW$674, DW_AT_name("ctrlPeriod_sec")
    3719                      .dwattr $C$DW$674, DW_AT_TI_symbol_name("_ctrlPeriod_sec")
    3720                      .dwattr $C$DW$674, DW_AT_data_member_location[DW_OP_plus_uconst 0xa6]
    3721                      .dwattr $C$DW$674, DW_AT_accessibility(DW_ACCESS_public)
    3722              $C$DW$675       .dwtag  DW_TAG_member
    3723                      .dwattr $C$DW$675, DW_AT_type(*$C$DW$T$31)
    3724                      .dwattr $C$DW$675, DW_AT_name("maxVsMag_pu")
    3725                      .dwattr $C$DW$675, DW_AT_TI_symbol_name("_maxVsMag_pu")
    3726                      .dwattr $C$DW$675, DW_AT_data_member_location[DW_OP_plus_uconst 0xa8]
    3727                      .dwattr $C$DW$675, DW_AT_accessibility(DW_ACCESS_public)
    3728              $C$DW$676       .dwtag  DW_TAG_member
    3729                      .dwattr $C$DW$676, DW_AT_type(*$C$DW$T$32)
TMS320C2000 Assembler PC v6.2.5 Thu Nov 23 20:51:04 2017

Tools Copyright (c) 1996-2014 Texas Instruments Incorporated
C:\Users\wmj\AppData\Local\Temp\0582810                              PAGE   72

    3730                      .dwattr $C$DW$676, DW_AT_name("Iab_in")
    3731                      .dwattr $C$DW$676, DW_AT_TI_symbol_name("_Iab_in")
    3732                      .dwattr $C$DW$676, DW_AT_data_member_location[DW_OP_plus_uconst 0xaa]
    3733                      .dwattr $C$DW$676, DW_AT_accessibility(DW_ACCESS_public)
    3734              $C$DW$677       .dwtag  DW_TAG_member
    3735                      .dwattr $C$DW$677, DW_AT_type(*$C$DW$T$32)
    3736                      .dwattr $C$DW$677, DW_AT_name("Iab_filt")
    3737                      .dwattr $C$DW$677, DW_AT_TI_symbol_name("_Iab_filt")
    3738                      .dwattr $C$DW$677, DW_AT_data_member_location[DW_OP_plus_uconst 0xae]
    3739                      .dwattr $C$DW$677, DW_AT_accessibility(DW_ACCESS_public)
    3740              $C$DW$678       .dwtag  DW_TAG_member
    3741                      .dwattr $C$DW$678, DW_AT_type(*$C$DW$T$32)
    3742                      .dwattr $C$DW$678, DW_AT_name("Idq_in")
    3743                      .dwattr $C$DW$678, DW_AT_TI_symbol_name("_Idq_in")
    3744                      .dwattr $C$DW$678, DW_AT_data_member_location[DW_OP_plus_uconst 0xb2]
    3745                      .dwattr $C$DW$678, DW_AT_accessibility(DW_ACCESS_public)
    3746              $C$DW$679       .dwtag  DW_TAG_member
    3747                      .dwattr $C$DW$679, DW_AT_type(*$C$DW$T$32)
    3748                      .dwattr $C$DW$679, DW_AT_name("Vab_in")
    3749                      .dwattr $C$DW$679, DW_AT_TI_symbol_name("_Vab_in")
    3750                      .dwattr $C$DW$679, DW_AT_data_member_location[DW_OP_plus_uconst 0xb6]
    3751                      .dwattr $C$DW$679, DW_AT_accessibility(DW_ACCESS_public)
    3752              $C$DW$680       .dwtag  DW_TAG_member
    3753                      .dwattr $C$DW$680, DW_AT_type(*$C$DW$T$31)
    3754                      .dwattr $C$DW$680, DW_AT_name("spd_out")
    3755                      .dwattr $C$DW$680, DW_AT_TI_symbol_name("_spd_out")
    3756                      .dwattr $C$DW$680, DW_AT_data_member_location[DW_OP_plus_uconst 0xba]
    3757                      .dwattr $C$DW$680, DW_AT_accessibility(DW_ACCESS_public)
    3758              $C$DW$681       .dwtag  DW_TAG_member
    3759                      .dwattr $C$DW$681, DW_AT_type(*$C$DW$T$32)
    3760                      .dwattr $C$DW$681, DW_AT_name("Vab_out")
    3761                      .dwattr $C$DW$681, DW_AT_TI_symbol_name("_Vab_out")
    3762                      .dwattr $C$DW$681, DW_AT_data_member_location[DW_OP_plus_uconst 0xbc]
    3763                      .dwattr $C$DW$681, DW_AT_accessibility(DW_ACCESS_public)
    3764              $C$DW$682       .dwtag  DW_TAG_member
    3765                      .dwattr $C$DW$682, DW_AT_type(*$C$DW$T$32)
    3766                      .dwattr $C$DW$682, DW_AT_name("Vdq_out")
    3767                      .dwattr $C$DW$682, DW_AT_TI_symbol_name("_Vdq_out")
    3768                      .dwattr $C$DW$682, DW_AT_data_member_location[DW_OP_plus_uconst 0xc0]
    3769                      .dwattr $C$DW$682, DW_AT_accessibility(DW_ACCESS_public)
    3770              $C$DW$683       .dwtag  DW_TAG_member
    3771                      .dwattr $C$DW$683, DW_AT_type(*$C$DW$T$70)
    3772                      .dwattr $C$DW$683, DW_AT_name("Rhf")
    3773                      .dwattr $C$DW$683, DW_AT_TI_symbol_name("_Rhf")
    3774                      .dwattr $C$DW$683, DW_AT_data_member_location[DW_OP_plus_uconst 0xc4]
    3775                      .dwattr $C$DW$683, DW_AT_accessibility(DW_ACCESS_public)
    3776              $C$DW$684       .dwtag  DW_TAG_member
    3777                      .dwattr $C$DW$684, DW_AT_type(*$C$DW$T$70)
    3778                      .dwattr $C$DW$684, DW_AT_name("Lhf")
    3779                      .dwattr $C$DW$684, DW_AT_TI_symbol_name("_Lhf")
    3780                      .dwattr $C$DW$684, DW_AT_data_member_location[DW_OP_plus_uconst 0xc6]
    3781                      .dwattr $C$DW$684, DW_AT_accessibility(DW_ACCESS_public)
    3782              $C$DW$685       .dwtag  DW_TAG_member
    3783                      .dwattr $C$DW$685, DW_AT_type(*$C$DW$T$70)
    3784                      .dwattr $C$DW$685, DW_AT_name("RoverL")
TMS320C2000 Assembler PC v6.2.5 Thu Nov 23 20:51:04 2017

Tools Copyright (c) 1996-2014 Texas Instruments Incorporated
C:\Users\wmj\AppData\Local\Temp\0582810                              PAGE   73

    3785                      .dwattr $C$DW$685, DW_AT_TI_symbol_name("_RoverL")
    3786                      .dwattr $C$DW$685, DW_AT_data_member_location[DW_OP_plus_uconst 0xc8]
    3787                      .dwattr $C$DW$685, DW_AT_accessibility(DW_ACCESS_public)
    3788              $C$DW$686       .dwtag  DW_TAG_member
    3789                      .dwattr $C$DW$686, DW_AT_type(*$C$DW$T$31)
    3790                      .dwattr $C$DW$686, DW_AT_name("Kp_Id")
    3791                      .dwattr $C$DW$686, DW_AT_TI_symbol_name("_Kp_Id")
    3792                      .dwattr $C$DW$686, DW_AT_data_member_location[DW_OP_plus_uconst 0xca]
    3793                      .dwattr $C$DW$686, DW_AT_accessibility(DW_ACCESS_public)
    3794              $C$DW$687       .dwtag  DW_TAG_member
    3795                      .dwattr $C$DW$687, DW_AT_type(*$C$DW$T$31)
    3796                      .dwattr $C$DW$687, DW_AT_name("Kp_Iq")
    3797                      .dwattr $C$DW$687, DW_AT_TI_symbol_name("_Kp_Iq")
    3798                      .dwattr $C$DW$687, DW_AT_data_member_location[DW_OP_plus_uconst 0xcc]
    3799                      .dwattr $C$DW$687, DW_AT_accessibility(DW_ACCESS_public)
    3800              $C$DW$688       .dwtag  DW_TAG_member
    3801                      .dwattr $C$DW$688, DW_AT_type(*$C$DW$T$31)
    3802                      .dwattr $C$DW$688, DW_AT_name("Kp_spd")
    3803                      .dwattr $C$DW$688, DW_AT_TI_symbol_name("_Kp_spd")
    3804                      .dwattr $C$DW$688, DW_AT_data_member_location[DW_OP_plus_uconst 0xce]
    3805                      .dwattr $C$DW$688, DW_AT_accessibility(DW_ACCESS_public)
    3806              $C$DW$689       .dwtag  DW_TAG_member
    3807                      .dwattr $C$DW$689, DW_AT_type(*$C$DW$T$31)
    3808                      .dwattr $C$DW$689, DW_AT_name("Ki_Id")
    3809                      .dwattr $C$DW$689, DW_AT_TI_symbol_name("_Ki_Id")
    3810                      .dwattr $C$DW$689, DW_AT_data_member_location[DW_OP_plus_uconst 0xd0]
    3811                      .dwattr $C$DW$689, DW_AT_accessibility(DW_ACCESS_public)
    3812              $C$DW$690       .dwtag  DW_TAG_member
    3813                      .dwattr $C$DW$690, DW_AT_type(*$C$DW$T$31)
    3814                      .dwattr $C$DW$690, DW_AT_name("Ki_Iq")
    3815                      .dwattr $C$DW$690, DW_AT_TI_symbol_name("_Ki_Iq")
    3816                      .dwattr $C$DW$690, DW_AT_data_member_location[DW_OP_plus_uconst 0xd2]
    3817                      .dwattr $C$DW$690, DW_AT_accessibility(DW_ACCESS_public)
    3818              $C$DW$691       .dwtag  DW_TAG_member
    3819                      .dwattr $C$DW$691, DW_AT_type(*$C$DW$T$31)
    3820                      .dwattr $C$DW$691, DW_AT_name("Ki_spd")
    3821                      .dwattr $C$DW$691, DW_AT_TI_symbol_name("_Ki_spd")
    3822                      .dwattr $C$DW$691, DW_AT_data_member_location[DW_OP_plus_uconst 0xd4]
    3823                      .dwattr $C$DW$691, DW_AT_accessibility(DW_ACCESS_public)
    3824              $C$DW$692       .dwtag  DW_TAG_member
    3825                      .dwattr $C$DW$692, DW_AT_type(*$C$DW$T$31)
    3826                      .dwattr $C$DW$692, DW_AT_name("Kd_Id")
    3827                      .dwattr $C$DW$692, DW_AT_TI_symbol_name("_Kd_Id")
    3828                      .dwattr $C$DW$692, DW_AT_data_member_location[DW_OP_plus_uconst 0xd6]
    3829                      .dwattr $C$DW$692, DW_AT_accessibility(DW_ACCESS_public)
    3830              $C$DW$693       .dwtag  DW_TAG_member
    3831                      .dwattr $C$DW$693, DW_AT_type(*$C$DW$T$31)
    3832                      .dwattr $C$DW$693, DW_AT_name("Kd_Iq")
    3833                      .dwattr $C$DW$693, DW_AT_TI_symbol_name("_Kd_Iq")
    3834                      .dwattr $C$DW$693, DW_AT_data_member_location[DW_OP_plus_uconst 0xd8]
    3835                      .dwattr $C$DW$693, DW_AT_accessibility(DW_ACCESS_public)
    3836              $C$DW$694       .dwtag  DW_TAG_member
    3837                      .dwattr $C$DW$694, DW_AT_type(*$C$DW$T$31)
    3838                      .dwattr $C$DW$694, DW_AT_name("Kd_spd")
    3839                      .dwattr $C$DW$694, DW_AT_TI_symbol_name("_Kd_spd")
TMS320C2000 Assembler PC v6.2.5 Thu Nov 23 20:51:04 2017

Tools Copyright (c) 1996-2014 Texas Instruments Incorporated
C:\Users\wmj\AppData\Local\Temp\0582810                              PAGE   74

    3840                      .dwattr $C$DW$694, DW_AT_data_member_location[DW_OP_plus_uconst 0xda]
    3841                      .dwattr $C$DW$694, DW_AT_accessibility(DW_ACCESS_public)
    3842              $C$DW$695       .dwtag  DW_TAG_member
    3843                      .dwattr $C$DW$695, DW_AT_type(*$C$DW$T$31)
    3844                      .dwattr $C$DW$695, DW_AT_name("Ui_Id")
    3845                      .dwattr $C$DW$695, DW_AT_TI_symbol_name("_Ui_Id")
    3846                      .dwattr $C$DW$695, DW_AT_data_member_location[DW_OP_plus_uconst 0xdc]
    3847                      .dwattr $C$DW$695, DW_AT_accessibility(DW_ACCESS_public)
    3848              $C$DW$696       .dwtag  DW_TAG_member
    3849                      .dwattr $C$DW$696, DW_AT_type(*$C$DW$T$31)
    3850                      .dwattr $C$DW$696, DW_AT_name("Ui_Iq")
    3851                      .dwattr $C$DW$696, DW_AT_TI_symbol_name("_Ui_Iq")
    3852                      .dwattr $C$DW$696, DW_AT_data_member_location[DW_OP_plus_uconst 0xde]
    3853                      .dwattr $C$DW$696, DW_AT_accessibility(DW_ACCESS_public)
    3854              $C$DW$697       .dwtag  DW_TAG_member
    3855                      .dwattr $C$DW$697, DW_AT_type(*$C$DW$T$31)
    3856                      .dwattr $C$DW$697, DW_AT_name("Ui_spd")
    3857                      .dwattr $C$DW$697, DW_AT_TI_symbol_name("_Ui_spd")
    3858                      .dwattr $C$DW$697, DW_AT_data_member_location[DW_OP_plus_uconst 0xe0]
    3859                      .dwattr $C$DW$697, DW_AT_accessibility(DW_ACCESS_public)
    3860              $C$DW$698       .dwtag  DW_TAG_member
    3861                      .dwattr $C$DW$698, DW_AT_type(*$C$DW$T$32)
    3862                      .dwattr $C$DW$698, DW_AT_name("Idq_ref")
    3863                      .dwattr $C$DW$698, DW_AT_TI_symbol_name("_Idq_ref")
    3864                      .dwattr $C$DW$698, DW_AT_data_member_location[DW_OP_plus_uconst 0xe2]
    3865                      .dwattr $C$DW$698, DW_AT_accessibility(DW_ACCESS_public)
    3866              $C$DW$699       .dwtag  DW_TAG_member
    3867                      .dwattr $C$DW$699, DW_AT_type(*$C$DW$T$31)
    3868                      .dwattr $C$DW$699, DW_AT_name("IdRated")
    3869                      .dwattr $C$DW$699, DW_AT_TI_symbol_name("_IdRated")
    3870                      .dwattr $C$DW$699, DW_AT_data_member_location[DW_OP_plus_uconst 0xe6]
    3871                      .dwattr $C$DW$699, DW_AT_accessibility(DW_ACCESS_public)
    3872              $C$DW$700       .dwtag  DW_TAG_member
    3873                      .dwattr $C$DW$700, DW_AT_type(*$C$DW$T$31)
    3874                      .dwattr $C$DW$700, DW_AT_name("spd_ref")
    3875                      .dwattr $C$DW$700, DW_AT_TI_symbol_name("_spd_ref")
    3876                      .dwattr $C$DW$700, DW_AT_data_member_location[DW_OP_plus_uconst 0xe8]
    3877                      .dwattr $C$DW$700, DW_AT_accessibility(DW_ACCESS_public)
    3878              $C$DW$701       .dwtag  DW_TAG_member
    3879                      .dwattr $C$DW$701, DW_AT_type(*$C$DW$T$31)
    3880                      .dwattr $C$DW$701, DW_AT_name("spd_max")
    3881                      .dwattr $C$DW$701, DW_AT_TI_symbol_name("_spd_max")
    3882                      .dwattr $C$DW$701, DW_AT_data_member_location[DW_OP_plus_uconst 0xea]
    3883                      .dwattr $C$DW$701, DW_AT_accessibility(DW_ACCESS_public)
    3884              $C$DW$702       .dwtag  DW_TAG_member
    3885                      .dwattr $C$DW$702, DW_AT_type(*$C$DW$T$69)
    3886                      .dwattr $C$DW$702, DW_AT_name("counter_current")
    3887                      .dwattr $C$DW$702, DW_AT_TI_symbol_name("_counter_current")
    3888                      .dwattr $C$DW$702, DW_AT_data_member_location[DW_OP_plus_uconst 0xec]
    3889                      .dwattr $C$DW$702, DW_AT_accessibility(DW_ACCESS_public)
    3890              $C$DW$703       .dwtag  DW_TAG_member
    3891                      .dwattr $C$DW$703, DW_AT_type(*$C$DW$T$69)
    3892                      .dwattr $C$DW$703, DW_AT_name("counter_isr")
    3893                      .dwattr $C$DW$703, DW_AT_TI_symbol_name("_counter_isr")
    3894                      .dwattr $C$DW$703, DW_AT_data_member_location[DW_OP_plus_uconst 0xed]
TMS320C2000 Assembler PC v6.2.5 Thu Nov 23 20:51:04 2017

Tools Copyright (c) 1996-2014 Texas Instruments Incorporated
C:\Users\wmj\AppData\Local\Temp\0582810                              PAGE   75

    3895                      .dwattr $C$DW$703, DW_AT_accessibility(DW_ACCESS_public)
    3896              $C$DW$704       .dwtag  DW_TAG_member
    3897                      .dwattr $C$DW$704, DW_AT_type(*$C$DW$T$69)
    3898                      .dwattr $C$DW$704, DW_AT_name("counter_speed")
    3899                      .dwattr $C$DW$704, DW_AT_TI_symbol_name("_counter_speed")
    3900                      .dwattr $C$DW$704, DW_AT_data_member_location[DW_OP_plus_uconst 0xee]
    3901                      .dwattr $C$DW$704, DW_AT_accessibility(DW_ACCESS_public)
    3902              $C$DW$705       .dwtag  DW_TAG_member
    3903                      .dwattr $C$DW$705, DW_AT_type(*$C$DW$T$69)
    3904                      .dwattr $C$DW$705, DW_AT_name("counter_traj")
    3905                      .dwattr $C$DW$705, DW_AT_TI_symbol_name("_counter_traj")
    3906                      .dwattr $C$DW$705, DW_AT_data_member_location[DW_OP_plus_uconst 0xef]
    3907                      .dwattr $C$DW$705, DW_AT_accessibility(DW_ACCESS_public)
    3908              $C$DW$706       .dwtag  DW_TAG_member
    3909                      .dwattr $C$DW$706, DW_AT_type(*$C$DW$T$33)
    3910                      .dwattr $C$DW$706, DW_AT_name("flag_enableCtrl")
    3911                      .dwattr $C$DW$706, DW_AT_TI_symbol_name("_flag_enableCtrl")
    3912                      .dwattr $C$DW$706, DW_AT_data_member_location[DW_OP_plus_uconst 0xf0]
    3913                      .dwattr $C$DW$706, DW_AT_accessibility(DW_ACCESS_public)
    3914              $C$DW$707       .dwtag  DW_TAG_member
    3915                      .dwattr $C$DW$707, DW_AT_type(*$C$DW$T$33)
    3916                      .dwattr $C$DW$707, DW_AT_name("flag_enableDcBusComp")
    3917                      .dwattr $C$DW$707, DW_AT_TI_symbol_name("_flag_enableDcBusComp")
    3918                      .dwattr $C$DW$707, DW_AT_data_member_location[DW_OP_plus_uconst 0xf1]
    3919                      .dwattr $C$DW$707, DW_AT_accessibility(DW_ACCESS_public)
    3920              $C$DW$708       .dwtag  DW_TAG_member
    3921                      .dwattr $C$DW$708, DW_AT_type(*$C$DW$T$33)
    3922                      .dwattr $C$DW$708, DW_AT_name("flag_enablePowerWarp")
    3923                      .dwattr $C$DW$708, DW_AT_TI_symbol_name("_flag_enablePowerWarp")
    3924                      .dwattr $C$DW$708, DW_AT_data_member_location[DW_OP_plus_uconst 0xf2]
    3925                      .dwattr $C$DW$708, DW_AT_accessibility(DW_ACCESS_public)
    3926              $C$DW$709       .dwtag  DW_TAG_member
    3927                      .dwattr $C$DW$709, DW_AT_type(*$C$DW$T$33)
    3928                      .dwattr $C$DW$709, DW_AT_name("flag_enableOffset")
    3929                      .dwattr $C$DW$709, DW_AT_TI_symbol_name("_flag_enableOffset")
    3930                      .dwattr $C$DW$709, DW_AT_data_member_location[DW_OP_plus_uconst 0xf3]
    3931                      .dwattr $C$DW$709, DW_AT_accessibility(DW_ACCESS_public)
    3932              $C$DW$710       .dwtag  DW_TAG_member
    3933                      .dwattr $C$DW$710, DW_AT_type(*$C$DW$T$33)
    3934                      .dwattr $C$DW$710, DW_AT_name("flag_enableSpeedCtrl")
    3935                      .dwattr $C$DW$710, DW_AT_TI_symbol_name("_flag_enableSpeedCtrl")
    3936                      .dwattr $C$DW$710, DW_AT_data_member_location[DW_OP_plus_uconst 0xf4]
    3937                      .dwattr $C$DW$710, DW_AT_accessibility(DW_ACCESS_public)
    3938              $C$DW$711       .dwtag  DW_TAG_member
    3939                      .dwattr $C$DW$711, DW_AT_type(*$C$DW$T$33)
    3940                      .dwattr $C$DW$711, DW_AT_name("flag_enableUserMotorParams")
    3941                      .dwattr $C$DW$711, DW_AT_TI_symbol_name("_flag_enableUserMotorParams")
    3942                      .dwattr $C$DW$711, DW_AT_data_member_location[DW_OP_plus_uconst 0xf5]
    3943                      .dwattr $C$DW$711, DW_AT_accessibility(DW_ACCESS_public)
    3944              $C$DW$712       .dwtag  DW_TAG_member
    3945                      .dwattr $C$DW$712, DW_AT_type(*$C$DW$T$33)
    3946                      .dwattr $C$DW$712, DW_AT_name("flag_enableCurrentCtrl")
    3947                      .dwattr $C$DW$712, DW_AT_TI_symbol_name("_flag_enableCurrentCtrl")
    3948                      .dwattr $C$DW$712, DW_AT_data_member_location[DW_OP_plus_uconst 0xf6]
    3949                      .dwattr $C$DW$712, DW_AT_accessibility(DW_ACCESS_public)
TMS320C2000 Assembler PC v6.2.5 Thu Nov 23 20:51:04 2017

Tools Copyright (c) 1996-2014 Texas Instruments Incorporated
C:\Users\wmj\AppData\Local\Temp\0582810                              PAGE   76

    3950              $C$DW$713       .dwtag  DW_TAG_member
    3951                      .dwattr $C$DW$713, DW_AT_type(*$C$DW$T$31)
    3952                      .dwattr $C$DW$713, DW_AT_name("spd_outMaxRatio_pu")
    3953                      .dwattr $C$DW$713, DW_AT_TI_symbol_name("_spd_outMaxRatio_pu")
    3954                      .dwattr $C$DW$713, DW_AT_data_member_location[DW_OP_plus_uconst 0xf8]
    3955                      .dwattr $C$DW$713, DW_AT_accessibility(DW_ACCESS_public)
    3956              $C$DW$714       .dwtag  DW_TAG_member
    3957                      .dwattr $C$DW$714, DW_AT_type(*$C$DW$T$31)
    3958                      .dwattr $C$DW$714, DW_AT_name("enc_Angle")
    3959                      .dwattr $C$DW$714, DW_AT_TI_symbol_name("_enc_Angle")
    3960                      .dwattr $C$DW$714, DW_AT_data_member_location[DW_OP_plus_uconst 0xfa]
    3961                      .dwattr $C$DW$714, DW_AT_accessibility(DW_ACCESS_public)
    3962              $C$DW$715       .dwtag  DW_TAG_member
    3963                      .dwattr $C$DW$715, DW_AT_type(*$C$DW$T$33)
    3964                      .dwattr $C$DW$715, DW_AT_name("flag_enableEncAngle")
    3965                      .dwattr $C$DW$715, DW_AT_TI_symbol_name("_flag_enableEncAngle")
    3966                      .dwattr $C$DW$715, DW_AT_data_member_location[DW_OP_plus_uconst 0xfc]
    3967                      .dwattr $C$DW$715, DW_AT_accessibility(DW_ACCESS_public)
    3968              $C$DW$716       .dwtag  DW_TAG_member
    3969                      .dwattr $C$DW$716, DW_AT_type(*$C$DW$T$72)
    3970                      .dwattr $C$DW$716, DW_AT_name("brakeHandle")
    3971                      .dwattr $C$DW$716, DW_AT_TI_symbol_name("_brakeHandle")
    3972                      .dwattr $C$DW$716, DW_AT_data_member_location[DW_OP_plus_uconst 0xfe]
    3973                      .dwattr $C$DW$716, DW_AT_accessibility(DW_ACCESS_public)
    3974              $C$DW$717       .dwtag  DW_TAG_member
    3975                      .dwattr $C$DW$717, DW_AT_type(*$C$DW$T$73)
    3976                      .dwattr $C$DW$717, DW_AT_name("brake")
    3977                      .dwattr $C$DW$717, DW_AT_TI_symbol_name("_brake")
    3978                      .dwattr $C$DW$717, DW_AT_data_member_location[DW_OP_plus_uconst 0x100]
    3979                      .dwattr $C$DW$717, DW_AT_accessibility(DW_ACCESS_public)
    3980              $C$DW$718       .dwtag  DW_TAG_member
    3981                      .dwattr $C$DW$718, DW_AT_type(*$C$DW$T$31)
    3982                      .dwattr $C$DW$718, DW_AT_name("Freq_Hz_PerPwmPeriod")
    3983                      .dwattr $C$DW$718, DW_AT_TI_symbol_name("_Freq_Hz_PerPwmPeriod")
    3984                      .dwattr $C$DW$718, DW_AT_data_member_location[DW_OP_plus_uconst 0x108]
    3985                      .dwattr $C$DW$718, DW_AT_accessibility(DW_ACCESS_public)
    3986                      .dwendtag $C$DW$T$74
    3987              
    3988              $C$DW$T$258     .dwtag  DW_TAG_typedef, DW_AT_name("CTRL_Obj")
    3989                      .dwattr $C$DW$T$258, DW_AT_type(*$C$DW$T$74)
    3990                      .dwattr $C$DW$T$258, DW_AT_language(DW_LANG_C)
    3991              $C$DW$T$259     .dwtag  DW_TAG_pointer_type
    3992                      .dwattr $C$DW$T$259, DW_AT_type(*$C$DW$T$258)
    3993                      .dwattr $C$DW$T$259, DW_AT_address_class(0x16)
    3994              $C$DW$T$210     .dwtag  DW_TAG_pointer_type
    3995                      .dwattr $C$DW$T$210, DW_AT_type(*$C$DW$T$74)
    3996                      .dwattr $C$DW$T$210, DW_AT_address_class(0x16)
    3997              $C$DW$T$211     .dwtag  DW_TAG_typedef, DW_AT_name("CTRL_Handle")
    3998                      .dwattr $C$DW$T$211, DW_AT_type(*$C$DW$T$210)
    3999                      .dwattr $C$DW$T$211, DW_AT_language(DW_LANG_C)
    4000              
    4001              $C$DW$T$77      .dwtag  DW_TAG_structure_type
    4002                      .dwattr $C$DW$T$77, DW_AT_name("_CTRL_Version_")
    4003                      .dwattr $C$DW$T$77, DW_AT_byte_size(0x04)
    4004              $C$DW$719       .dwtag  DW_TAG_member
TMS320C2000 Assembler PC v6.2.5 Thu Nov 23 20:51:04 2017

Tools Copyright (c) 1996-2014 Texas Instruments Incorporated
C:\Users\wmj\AppData\Local\Temp\0582810                              PAGE   77

    4005                      .dwattr $C$DW$719, DW_AT_type(*$C$DW$T$22)
    4006                      .dwattr $C$DW$719, DW_AT_name("rsvd")
    4007                      .dwattr $C$DW$719, DW_AT_TI_symbol_name("_rsvd")
    4008                      .dwattr $C$DW$719, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    4009                      .dwattr $C$DW$719, DW_AT_accessibility(DW_ACCESS_public)
    4010              $C$DW$720       .dwtag  DW_TAG_member
    4011                      .dwattr $C$DW$720, DW_AT_type(*$C$DW$T$76)
    4012                      .dwattr $C$DW$720, DW_AT_name("targetProc")
    4013                      .dwattr $C$DW$720, DW_AT_TI_symbol_name("_targetProc")
    4014                      .dwattr $C$DW$720, DW_AT_data_member_location[DW_OP_plus_uconst 0x1]
    4015                      .dwattr $C$DW$720, DW_AT_accessibility(DW_ACCESS_public)
    4016              $C$DW$721       .dwtag  DW_TAG_member
    4017                      .dwattr $C$DW$721, DW_AT_type(*$C$DW$T$22)
    4018                      .dwattr $C$DW$721, DW_AT_name("major")
    4019                      .dwattr $C$DW$721, DW_AT_TI_symbol_name("_major")
    4020                      .dwattr $C$DW$721, DW_AT_data_member_location[DW_OP_plus_uconst 0x2]
    4021                      .dwattr $C$DW$721, DW_AT_accessibility(DW_ACCESS_public)
    4022              $C$DW$722       .dwtag  DW_TAG_member
    4023                      .dwattr $C$DW$722, DW_AT_type(*$C$DW$T$22)
    4024                      .dwattr $C$DW$722, DW_AT_name("minor")
    4025                      .dwattr $C$DW$722, DW_AT_TI_symbol_name("_minor")
    4026                      .dwattr $C$DW$722, DW_AT_data_member_location[DW_OP_plus_uconst 0x3]
    4027                      .dwattr $C$DW$722, DW_AT_accessibility(DW_ACCESS_public)
    4028                      .dwendtag $C$DW$T$77
    4029              
    4030              $C$DW$T$40      .dwtag  DW_TAG_typedef, DW_AT_name("CTRL_Version")
    4031                      .dwattr $C$DW$T$40, DW_AT_type(*$C$DW$T$77)
    4032                      .dwattr $C$DW$T$40, DW_AT_language(DW_LANG_C)
    4033              $C$DW$T$266     .dwtag  DW_TAG_pointer_type
    4034                      .dwattr $C$DW$T$266, DW_AT_type(*$C$DW$T$40)
    4035                      .dwattr $C$DW$T$266, DW_AT_address_class(0x16)
    4036              
    4037              $C$DW$T$19      .dwtag  DW_TAG_structure_type
    4038                      .dwattr $C$DW$T$19, DW_AT_name("_EST_Obj_")
    4039                      .dwattr $C$DW$T$19, DW_AT_declaration
    4040                      .dwendtag $C$DW$T$19
    4041              
    4042              $C$DW$T$48      .dwtag  DW_TAG_pointer_type
    4043                      .dwattr $C$DW$T$48, DW_AT_type(*$C$DW$T$19)
    4044                      .dwattr $C$DW$T$48, DW_AT_address_class(0x16)
    4045              $C$DW$T$49      .dwtag  DW_TAG_typedef, DW_AT_name("EST_Handle")
    4046                      .dwattr $C$DW$T$49, DW_AT_type(*$C$DW$T$48)
    4047                      .dwattr $C$DW$T$49, DW_AT_language(DW_LANG_C)
    4048              
    4049              $C$DW$T$78      .dwtag  DW_TAG_structure_type
    4050                      .dwattr $C$DW$T$78, DW_AT_name("_FILTER_FO_")
    4051                      .dwattr $C$DW$T$78, DW_AT_byte_size(0x0a)
    4052              $C$DW$723       .dwtag  DW_TAG_member
    4053                      .dwattr $C$DW$723, DW_AT_type(*$C$DW$T$31)
    4054                      .dwattr $C$DW$723, DW_AT_name("a1")
    4055                      .dwattr $C$DW$723, DW_AT_TI_symbol_name("_a1")
    4056                      .dwattr $C$DW$723, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    4057                      .dwattr $C$DW$723, DW_AT_accessibility(DW_ACCESS_public)
    4058              $C$DW$724       .dwtag  DW_TAG_member
    4059                      .dwattr $C$DW$724, DW_AT_type(*$C$DW$T$31)
TMS320C2000 Assembler PC v6.2.5 Thu Nov 23 20:51:04 2017

Tools Copyright (c) 1996-2014 Texas Instruments Incorporated
C:\Users\wmj\AppData\Local\Temp\0582810                              PAGE   78

    4060                      .dwattr $C$DW$724, DW_AT_name("b0")
    4061                      .dwattr $C$DW$724, DW_AT_TI_symbol_name("_b0")
    4062                      .dwattr $C$DW$724, DW_AT_data_member_location[DW_OP_plus_uconst 0x2]
    4063                      .dwattr $C$DW$724, DW_AT_accessibility(DW_ACCESS_public)
    4064              $C$DW$725       .dwtag  DW_TAG_member
    4065                      .dwattr $C$DW$725, DW_AT_type(*$C$DW$T$31)
    4066                      .dwattr $C$DW$725, DW_AT_name("b1")
    4067                      .dwattr $C$DW$725, DW_AT_TI_symbol_name("_b1")
    4068                      .dwattr $C$DW$725, DW_AT_data_member_location[DW_OP_plus_uconst 0x4]
    4069                      .dwattr $C$DW$725, DW_AT_accessibility(DW_ACCESS_public)
    4070              $C$DW$726       .dwtag  DW_TAG_member
    4071                      .dwattr $C$DW$726, DW_AT_type(*$C$DW$T$31)
    4072                      .dwattr $C$DW$726, DW_AT_name("x1")
    4073                      .dwattr $C$DW$726, DW_AT_TI_symbol_name("_x1")
    4074                      .dwattr $C$DW$726, DW_AT_data_member_location[DW_OP_plus_uconst 0x6]
    4075                      .dwattr $C$DW$726, DW_AT_accessibility(DW_ACCESS_public)
    4076              $C$DW$727       .dwtag  DW_TAG_member
    4077                      .dwattr $C$DW$727, DW_AT_type(*$C$DW$T$31)
    4078                      .dwattr $C$DW$727, DW_AT_name("y1")
    4079                      .dwattr $C$DW$727, DW_AT_TI_symbol_name("_y1")
    4080                      .dwattr $C$DW$727, DW_AT_data_member_location[DW_OP_plus_uconst 0x8]
    4081                      .dwattr $C$DW$727, DW_AT_accessibility(DW_ACCESS_public)
    4082                      .dwendtag $C$DW$T$78
    4083              
    4084              $C$DW$T$191     .dwtag  DW_TAG_typedef, DW_AT_name("FILTER_FO_Obj")
    4085                      .dwattr $C$DW$T$191, DW_AT_type(*$C$DW$T$78)
    4086                      .dwattr $C$DW$T$191, DW_AT_language(DW_LANG_C)
    4087              
    4088              $C$DW$T$20      .dwtag  DW_TAG_structure_type
    4089                      .dwattr $C$DW$T$20, DW_AT_name("_FILTER_FO_Obj_")
    4090                      .dwattr $C$DW$T$20, DW_AT_declaration
    4091                      .dwendtag $C$DW$T$20
    4092              
    4093              $C$DW$T$192     .dwtag  DW_TAG_pointer_type
    4094                      .dwattr $C$DW$T$192, DW_AT_type(*$C$DW$T$20)
    4095                      .dwattr $C$DW$T$192, DW_AT_address_class(0x16)
    4096              $C$DW$T$193     .dwtag  DW_TAG_typedef, DW_AT_name("FILTER_FO_Handle")
    4097                      .dwattr $C$DW$T$193, DW_AT_type(*$C$DW$T$192)
    4098                      .dwattr $C$DW$T$193, DW_AT_language(DW_LANG_C)
    4099              
    4100              $C$DW$T$79      .dwtag  DW_TAG_structure_type
    4101                      .dwattr $C$DW$T$79, DW_AT_name("_FLASH_Obj_")
    4102                      .dwattr $C$DW$T$79, DW_AT_byte_size(0x08)
    4103              $C$DW$728       .dwtag  DW_TAG_member
    4104                      .dwattr $C$DW$728, DW_AT_type(*$C$DW$T$23)
    4105                      .dwattr $C$DW$728, DW_AT_name("FOPT")
    4106                      .dwattr $C$DW$728, DW_AT_TI_symbol_name("_FOPT")
    4107                      .dwattr $C$DW$728, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    4108                      .dwattr $C$DW$728, DW_AT_accessibility(DW_ACCESS_public)
    4109              $C$DW$729       .dwtag  DW_TAG_member
    4110                      .dwattr $C$DW$729, DW_AT_type(*$C$DW$T$23)
    4111                      .dwattr $C$DW$729, DW_AT_name("rsvd_1")
    4112                      .dwattr $C$DW$729, DW_AT_TI_symbol_name("_rsvd_1")
    4113                      .dwattr $C$DW$729, DW_AT_data_member_location[DW_OP_plus_uconst 0x1]
    4114                      .dwattr $C$DW$729, DW_AT_accessibility(DW_ACCESS_public)
TMS320C2000 Assembler PC v6.2.5 Thu Nov 23 20:51:04 2017

Tools Copyright (c) 1996-2014 Texas Instruments Incorporated
C:\Users\wmj\AppData\Local\Temp\0582810                              PAGE   79

    4115              $C$DW$730       .dwtag  DW_TAG_member
    4116                      .dwattr $C$DW$730, DW_AT_type(*$C$DW$T$23)
    4117                      .dwattr $C$DW$730, DW_AT_name("FPWR")
    4118                      .dwattr $C$DW$730, DW_AT_TI_symbol_name("_FPWR")
    4119                      .dwattr $C$DW$730, DW_AT_data_member_location[DW_OP_plus_uconst 0x2]
    4120                      .dwattr $C$DW$730, DW_AT_accessibility(DW_ACCESS_public)
    4121              $C$DW$731       .dwtag  DW_TAG_member
    4122                      .dwattr $C$DW$731, DW_AT_type(*$C$DW$T$23)
    4123                      .dwattr $C$DW$731, DW_AT_name("FSTATUS")
    4124                      .dwattr $C$DW$731, DW_AT_TI_symbol_name("_FSTATUS")
    4125                      .dwattr $C$DW$731, DW_AT_data_member_location[DW_OP_plus_uconst 0x3]
    4126                      .dwattr $C$DW$731, DW_AT_accessibility(DW_ACCESS_public)
    4127              $C$DW$732       .dwtag  DW_TAG_member
    4128                      .dwattr $C$DW$732, DW_AT_type(*$C$DW$T$23)
    4129                      .dwattr $C$DW$732, DW_AT_name("FSTDBYWAIT")
    4130                      .dwattr $C$DW$732, DW_AT_TI_symbol_name("_FSTDBYWAIT")
    4131                      .dwattr $C$DW$732, DW_AT_data_member_location[DW_OP_plus_uconst 0x4]
    4132                      .dwattr $C$DW$732, DW_AT_accessibility(DW_ACCESS_public)
    4133              $C$DW$733       .dwtag  DW_TAG_member
    4134                      .dwattr $C$DW$733, DW_AT_type(*$C$DW$T$23)
    4135                      .dwattr $C$DW$733, DW_AT_name("FACTIVEWAIT")
    4136                      .dwattr $C$DW$733, DW_AT_TI_symbol_name("_FACTIVEWAIT")
    4137                      .dwattr $C$DW$733, DW_AT_data_member_location[DW_OP_plus_uconst 0x5]
    4138                      .dwattr $C$DW$733, DW_AT_accessibility(DW_ACCESS_public)
    4139              $C$DW$734       .dwtag  DW_TAG_member
    4140                      .dwattr $C$DW$734, DW_AT_type(*$C$DW$T$23)
    4141                      .dwattr $C$DW$734, DW_AT_name("FBANKWAIT")
    4142                      .dwattr $C$DW$734, DW_AT_TI_symbol_name("_FBANKWAIT")
    4143                      .dwattr $C$DW$734, DW_AT_data_member_location[DW_OP_plus_uconst 0x6]
    4144                      .dwattr $C$DW$734, DW_AT_accessibility(DW_ACCESS_public)
    4145              $C$DW$735       .dwtag  DW_TAG_member
    4146                      .dwattr $C$DW$735, DW_AT_type(*$C$DW$T$23)
    4147                      .dwattr $C$DW$735, DW_AT_name("FOTPWAIT")
    4148                      .dwattr $C$DW$735, DW_AT_TI_symbol_name("_FOTPWAIT")
    4149                      .dwattr $C$DW$735, DW_AT_data_member_location[DW_OP_plus_uconst 0x7]
    4150                      .dwattr $C$DW$735, DW_AT_accessibility(DW_ACCESS_public)
    4151                      .dwendtag $C$DW$T$79
    4152              
    4153              $C$DW$T$124     .dwtag  DW_TAG_pointer_type
    4154                      .dwattr $C$DW$T$124, DW_AT_type(*$C$DW$T$79)
    4155                      .dwattr $C$DW$T$124, DW_AT_address_class(0x16)
    4156              $C$DW$T$125     .dwtag  DW_TAG_typedef, DW_AT_name("FLASH_Handle")
    4157                      .dwattr $C$DW$T$125, DW_AT_type(*$C$DW$T$124)
    4158                      .dwattr $C$DW$T$125, DW_AT_language(DW_LANG_C)
    4159              
    4160              $C$DW$T$99      .dwtag  DW_TAG_structure_type
    4161                      .dwattr $C$DW$T$99, DW_AT_name("_FSM_Obj_")
    4162                      .dwattr $C$DW$T$99, DW_AT_byte_size(0x26)
    4163              $C$DW$736       .dwtag  DW_TAG_member
    4164                      .dwattr $C$DW$736, DW_AT_type(*$C$DW$T$81)
    4165                      .dwattr $C$DW$736, DW_AT_name("motorHandle")
    4166                      .dwattr $C$DW$736, DW_AT_TI_symbol_name("_motorHandle")
    4167                      .dwattr $C$DW$736, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    4168                      .dwattr $C$DW$736, DW_AT_accessibility(DW_ACCESS_public)
    4169              $C$DW$737       .dwtag  DW_TAG_member
TMS320C2000 Assembler PC v6.2.5 Thu Nov 23 20:51:04 2017

Tools Copyright (c) 1996-2014 Texas Instruments Incorporated
C:\Users\wmj\AppData\Local\Temp\0582810                              PAGE   80

    4170                      .dwattr $C$DW$737, DW_AT_type(*$C$DW$T$83)
    4171                      .dwattr $C$DW$737, DW_AT_name("halHandle")
    4172                      .dwattr $C$DW$737, DW_AT_TI_symbol_name("_halHandle")
    4173                      .dwattr $C$DW$737, DW_AT_data_member_location[DW_OP_plus_uconst 0x2]
    4174                      .dwattr $C$DW$737, DW_AT_accessibility(DW_ACCESS_public)
    4175              $C$DW$738       .dwtag  DW_TAG_member
    4176                      .dwattr $C$DW$738, DW_AT_type(*$C$DW$T$85)
    4177                      .dwattr $C$DW$738, DW_AT_name("StBoxHandle")
    4178                      .dwattr $C$DW$738, DW_AT_TI_symbol_name("_StBoxHandle")
    4179                      .dwattr $C$DW$738, DW_AT_data_member_location[DW_OP_plus_uconst 0x4]
    4180                      .dwattr $C$DW$738, DW_AT_accessibility(DW_ACCESS_public)
    4181              $C$DW$739       .dwtag  DW_TAG_member
    4182                      .dwattr $C$DW$739, DW_AT_type(*$C$DW$T$87)
    4183                      .dwattr $C$DW$739, DW_AT_name("FSM_State")
    4184                      .dwattr $C$DW$739, DW_AT_TI_symbol_name("_FSM_State")
    4185                      .dwattr $C$DW$739, DW_AT_data_member_location[DW_OP_plus_uconst 0x6]
    4186                      .dwattr $C$DW$739, DW_AT_accessibility(DW_ACCESS_public)
    4187              $C$DW$740       .dwtag  DW_TAG_member
    4188                      .dwattr $C$DW$740, DW_AT_type(*$C$DW$T$87)
    4189                      .dwattr $C$DW$740, DW_AT_name("FSM_CurState")
    4190                      .dwattr $C$DW$740, DW_AT_TI_symbol_name("_FSM_CurState")
    4191                      .dwattr $C$DW$740, DW_AT_data_member_location[DW_OP_plus_uconst 0x7]
    4192                      .dwattr $C$DW$740, DW_AT_accessibility(DW_ACCESS_public)
    4193              $C$DW$741       .dwtag  DW_TAG_member
    4194                      .dwattr $C$DW$741, DW_AT_type(*$C$DW$T$89)
    4195                      .dwattr $C$DW$741, DW_AT_name("FSM_Trans")
    4196                      .dwattr $C$DW$741, DW_AT_TI_symbol_name("_FSM_Trans")
    4197                      .dwattr $C$DW$741, DW_AT_data_member_location[DW_OP_plus_uconst 0x8]
    4198                      .dwattr $C$DW$741, DW_AT_accessibility(DW_ACCESS_public)
    4199              $C$DW$742       .dwtag  DW_TAG_member
    4200                      .dwattr $C$DW$742, DW_AT_type(*$C$DW$T$91)
    4201                      .dwattr $C$DW$742, DW_AT_name("FSM_Event")
    4202                      .dwattr $C$DW$742, DW_AT_TI_symbol_name("_FSM_Event")
    4203                      .dwattr $C$DW$742, DW_AT_data_member_location[DW_OP_plus_uconst 0x9]
    4204                      .dwattr $C$DW$742, DW_AT_accessibility(DW_ACCESS_public)
    4205              $C$DW$743       .dwtag  DW_TAG_member
    4206                      .dwattr $C$DW$743, DW_AT_type(*$C$DW$T$93)
    4207                      .dwattr $C$DW$743, DW_AT_name("FSM_StMode")
    4208                      .dwattr $C$DW$743, DW_AT_TI_symbol_name("_FSM_StMode")
    4209                      .dwattr $C$DW$743, DW_AT_data_member_location[DW_OP_plus_uconst 0xa]
    4210                      .dwattr $C$DW$743, DW_AT_accessibility(DW_ACCESS_public)
    4211              $C$DW$744       .dwtag  DW_TAG_member
    4212                      .dwattr $C$DW$744, DW_AT_type(*$C$DW$T$22)
    4213                      .dwattr $C$DW$744, DW_AT_name("FSM_ErrFlg")
    4214                      .dwattr $C$DW$744, DW_AT_TI_symbol_name("_FSM_ErrFlg")
    4215                      .dwattr $C$DW$744, DW_AT_data_member_location[DW_OP_plus_uconst 0xb]
    4216                      .dwattr $C$DW$744, DW_AT_accessibility(DW_ACCESS_public)
    4217              $C$DW$745       .dwtag  DW_TAG_member
    4218                      .dwattr $C$DW$745, DW_AT_type(*$C$DW$T$22)
    4219                      .dwattr $C$DW$745, DW_AT_name("FSM_ErrMask")
    4220                      .dwattr $C$DW$745, DW_AT_TI_symbol_name("_FSM_ErrMask")
    4221                      .dwattr $C$DW$745, DW_AT_data_member_location[DW_OP_plus_uconst 0xc]
    4222                      .dwattr $C$DW$745, DW_AT_accessibility(DW_ACCESS_public)
    4223              $C$DW$746       .dwtag  DW_TAG_member
    4224                      .dwattr $C$DW$746, DW_AT_type(*$C$DW$T$22)
TMS320C2000 Assembler PC v6.2.5 Thu Nov 23 20:51:04 2017

Tools Copyright (c) 1996-2014 Texas Instruments Incorporated
C:\Users\wmj\AppData\Local\Temp\0582810                              PAGE   81

    4225                      .dwattr $C$DW$746, DW_AT_name("FSM_runTime")
    4226                      .dwattr $C$DW$746, DW_AT_TI_symbol_name("_FSM_runTime")
    4227                      .dwattr $C$DW$746, DW_AT_data_member_location[DW_OP_plus_uconst 0xd]
    4228                      .dwattr $C$DW$746, DW_AT_accessibility(DW_ACCESS_public)
    4229              $C$DW$747       .dwtag  DW_TAG_member
    4230                      .dwattr $C$DW$747, DW_AT_type(*$C$DW$T$22)
    4231                      .dwattr $C$DW$747, DW_AT_name("FSM_485Cmd")
    4232                      .dwattr $C$DW$747, DW_AT_TI_symbol_name("_FSM_485Cmd")
    4233                      .dwattr $C$DW$747, DW_AT_data_member_location[DW_OP_plus_uconst 0xe]
    4234                      .dwattr $C$DW$747, DW_AT_accessibility(DW_ACCESS_public)
    4235              $C$DW$748       .dwtag  DW_TAG_member
    4236                      .dwattr $C$DW$748, DW_AT_type(*$C$DW$T$87)
    4237                      .dwattr $C$DW$748, DW_AT_name("FSM_485EditState")
    4238                      .dwattr $C$DW$748, DW_AT_TI_symbol_name("_FSM_485EditState")
    4239                      .dwattr $C$DW$748, DW_AT_data_member_location[DW_OP_plus_uconst 0xf]
    4240                      .dwattr $C$DW$748, DW_AT_accessibility(DW_ACCESS_public)
    4241              $C$DW$749       .dwtag  DW_TAG_member
    4242                      .dwattr $C$DW$749, DW_AT_type(*$C$DW$T$95)
    4243                      .dwattr $C$DW$749, DW_AT_name("FSM_485EditOpt")
    4244                      .dwattr $C$DW$749, DW_AT_TI_symbol_name("_FSM_485EditOpt")
    4245                      .dwattr $C$DW$749, DW_AT_data_member_location[DW_OP_plus_uconst 0x10]
    4246                      .dwattr $C$DW$749, DW_AT_accessibility(DW_ACCESS_public)
    4247              $C$DW$750       .dwtag  DW_TAG_member
    4248                      .dwattr $C$DW$750, DW_AT_type(*$C$DW$T$22)
    4249                      .dwattr $C$DW$750, DW_AT_name("FSM_485RefSpeed")
    4250                      .dwattr $C$DW$750, DW_AT_TI_symbol_name("_FSM_485RefSpeed")
    4251                      .dwattr $C$DW$750, DW_AT_data_member_location[DW_OP_plus_uconst 0x11]
    4252                      .dwattr $C$DW$750, DW_AT_accessibility(DW_ACCESS_public)
    4253              $C$DW$751       .dwtag  DW_TAG_member
    4254                      .dwattr $C$DW$751, DW_AT_type(*$C$DW$T$31)
    4255                      .dwattr $C$DW$751, DW_AT_name("MaxTorque_Nm")
    4256                      .dwattr $C$DW$751, DW_AT_TI_symbol_name("_MaxTorque_Nm")
    4257                      .dwattr $C$DW$751, DW_AT_data_member_location[DW_OP_plus_uconst 0x12]
    4258                      .dwattr $C$DW$751, DW_AT_accessibility(DW_ACCESS_public)
    4259              $C$DW$752       .dwtag  DW_TAG_member
    4260                      .dwattr $C$DW$752, DW_AT_type(*$C$DW$T$97)
    4261                      .dwattr $C$DW$752, DW_AT_name("FSM_CheckCond")
    4262                      .dwattr $C$DW$752, DW_AT_TI_symbol_name("_FSM_CheckCond")
    4263                      .dwattr $C$DW$752, DW_AT_data_member_location[DW_OP_plus_uconst 0x14]
    4264                      .dwattr $C$DW$752, DW_AT_accessibility(DW_ACCESS_public)
    4265              $C$DW$753       .dwtag  DW_TAG_member
    4266                      .dwattr $C$DW$753, DW_AT_type(*$C$DW$T$22)
    4267                      .dwattr $C$DW$753, DW_AT_name("FSM_CondValue")
    4268                      .dwattr $C$DW$753, DW_AT_TI_symbol_name("_FSM_CondValue")
    4269                      .dwattr $C$DW$753, DW_AT_data_member_location[DW_OP_plus_uconst 0x15]
    4270                      .dwattr $C$DW$753, DW_AT_accessibility(DW_ACCESS_public)
    4271              $C$DW$754       .dwtag  DW_TAG_member
    4272                      .dwattr $C$DW$754, DW_AT_type(*$C$DW$T$98)
    4273                      .dwattr $C$DW$754, DW_AT_name("OldAbsPos")
    4274                      .dwattr $C$DW$754, DW_AT_TI_symbol_name("_OldAbsPos")
    4275                      .dwattr $C$DW$754, DW_AT_data_member_location[DW_OP_plus_uconst 0x16]
    4276                      .dwattr $C$DW$754, DW_AT_accessibility(DW_ACCESS_public)
    4277              $C$DW$755       .dwtag  DW_TAG_member
