TMS320C2000 Assembler PC v6.2.5 Sat Sep 16 14:59:17 2017

Tools Copyright (c) 1996-2014 Texas Instruments Incorporated
C:\Users\wmj\AppData\Local\Temp\0328410                              PAGE    1

       1              ;***************************************************************
       2              ;* TMS320C2000 C/C++ Codegen                         PC v6.2.5 *
       3              ;* Date/Time created: Sat Sep 16 14:59:16 2017                 *
       4              ;***************************************************************
       5                      .compiler_opts --float_support=softlib --hll_source=on --mem_model:code=flat --mem_model:data=large -
       6        0002  FP      .set    XAR2
       7              
       8              $C$DW$CU        .dwtag  DW_TAG_compile_unit
       9                      .dwattr $C$DW$CU, DW_AT_name("D:/BM1000/sw/solutions/instaspin_foc/src/proj_lab10e.c")
      10                      .dwattr $C$DW$CU, DW_AT_producer("TMS320C2000 C/C++ Codegen PC v6.2.5 Copyright (c) 1996-2014 Texas I
      11                      .dwattr $C$DW$CU, DW_AT_TI_version(0x01)
      12                      .dwattr $C$DW$CU, DW_AT_comp_dir("D:\BM1000\sw\solutions\instaspin_foc\boards\hvkit_rev1p1\f28x\f2802
      13              ;**************************************************************
      14              ;* CINIT RECORDS                                              *

    6381                      .dwattr $C$DW$T$305, DW_AT_language(DW_LANG_C)
    6382              
    6383              $C$DW$T$307     .dwtag  DW_TAG_enumeration_type
    6384                      .dwattr $C$DW$T$307, DW_AT_byte_size(0x01)
    6385              $C$DW$788       .dwtag  DW_TAG_enumerator, DW_AT_name("CTRL_Type_PID_spd"), DW_AT_const_value(0x00)
    6386              $C$DW$789       .dwtag  DW_TAG_enumerator, DW_AT_name("CTRL_Type_PID_Id"), DW_AT_const_value(0x01)
    6387              $C$DW$790       .dwtag  DW_TAG_enumerator, DW_AT_name("CTRL_Type_PID_Iq"), DW_AT_const_value(0x02)
    6388                      .dwendtag $C$DW$T$307
    6389              
    6390              $C$DW$T$308     .dwtag  DW_TAG_typedef, DW_AT_name("CTRL_Type_e")
    6391                      .dwattr $C$DW$T$308, DW_AT_type(*$C$DW$T$307)
    6392                      .dwattr $C$DW$T$308, DW_AT_language(DW_LANG_C)
    6393              
    6394              $C$DW$T$310     .dwtag  DW_TAG_enumeration_type
    6395                      .dwattr $C$DW$T$310, DW_AT_byte_size(0x01)
    6396              $C$DW$791       .dwtag  DW_TAG_enumerator, DW_AT_name("LDC161x_ChNum_CH0"), DW_AT_const_value(0x00)
    6397              $C$DW$792       .dwtag  DW_TAG_enumerator, DW_AT_name("LDC161x_ChNum_CH1"), DW_AT_const_value(0x01)
    6398              $C$DW$793       .dwtag  DW_TAG_enumerator, DW_AT_name("LDC161x_ChNum_CH2"), DW_AT_const_value(0x02)
    6399              $C$DW$794       .dwtag  DW_TAG_enumerator, DW_AT_name("LDC161x_ChNum_CH3"), DW_AT_const_value(0x03)
    6400                      .dwendtag $C$DW$T$310
    6401              
    6402              $C$DW$T$311     .dwtag  DW_TAG_typedef, DW_AT_name("LDC161x_ChNum_e")
    6403                      .dwattr $C$DW$T$311, DW_AT_type(*$C$DW$T$310)
    6404                      .dwattr $C$DW$T$311, DW_AT_language(DW_LANG_C)
    6405              $C$DW$795       .dwtag  DW_TAG_TI_far_type
    6406                      .dwattr $C$DW$795, DW_AT_type(*$C$DW$T$311)
    6407              $C$DW$T$312     .dwtag  DW_TAG_const_type
    6408                      .dwattr $C$DW$T$312, DW_AT_type(*$C$DW$795)
    6409              
    6410              $C$DW$T$313     .dwtag  DW_TAG_enumeration_type
    6411                      .dwattr $C$DW$T$313, DW_AT_byte_size(0x01)
    6412              $C$DW$796       .dwtag  DW_TAG_enumerator, DW_AT_name("PCA955x_PortNum_Port0"), DW_AT_const_value(0x00)
    6413              $C$DW$797       .dwtag  DW_TAG_enumerator, DW_AT_name("PCA955x_PortNum_Port1"), DW_AT_const_value(0x01)
    6414                      .dwendtag $C$DW$T$313
    6415              
    6416              $C$DW$T$314     .dwtag  DW_TAG_typedef, DW_AT_name("PCA955x_PortNum_e")
    6417                      .dwattr $C$DW$T$314, DW_AT_type(*$C$DW$T$313)
    6418                      .dwattr $C$DW$T$314, DW_AT_language(DW_LANG_C)
    6419              
TMS320C2000 Assembler PC v6.2.5 Sat Sep 16 14:59:17 2017

Tools Copyright (c) 1996-2014 Texas Instruments Incorporated
C:\Users\wmj\AppData\Local\Temp\0328410                              PAGE  127

    6420              $C$DW$T$315     .dwtag  DW_TAG_enumeration_type
    6421                      .dwattr $C$DW$T$315, DW_AT_byte_size(0x01)
    6422              $C$DW$798       .dwtag  DW_TAG_enumerator, DW_AT_name("HAL_SensorType_Current"), DW_AT_const_value(0x00)
    6423              $C$DW$799       .dwtag  DW_TAG_enumerator, DW_AT_name("HAL_SensorType_Voltage"), DW_AT_const_value(0x01)
    6424                      .dwendtag $C$DW$T$315
    6425              
    6426              $C$DW$T$316     .dwtag  DW_TAG_typedef, DW_AT_name("HAL_SensorType_e")
    6427                      .dwattr $C$DW$T$316, DW_AT_type(*$C$DW$T$315)
    6428                      .dwattr $C$DW$T$316, DW_AT_language(DW_LANG_C)
    6429              
    6430              $C$DW$T$19      .dwtag  DW_TAG_structure_type
    6431                      .dwattr $C$DW$T$19, DW_AT_name("I2C_Obj")
    6432                      .dwattr $C$DW$T$19, DW_AT_declaration
    6433                      .dwendtag $C$DW$T$19
    6434              
    6435              $C$DW$T$127     .dwtag  DW_TAG_pointer_type
    6436                      .dwattr $C$DW$T$127, DW_AT_type(*$C$DW$T$19)
    6437                      .dwattr $C$DW$T$127, DW_AT_address_class(0x16)
    6438              $C$DW$T$128     .dwtag  DW_TAG_typedef, DW_AT_name("I2C_Handle")
    6439                      .dwattr $C$DW$T$128, DW_AT_type(*$C$DW$T$127)
    6440                      .dwattr $C$DW$T$128, DW_AT_language(DW_LANG_C)
    6441              
    6442              $C$DW$T$20      .dwtag  DW_TAG_structure_type
    6443                      .dwattr $C$DW$T$20, DW_AT_name("LDC161x_REG_Obj")
    6444                      .dwattr $C$DW$T$20, DW_AT_declaration
    6445                      .dwendtag $C$DW$T$20
    6446              
    6447              $C$DW$T$146     .dwtag  DW_TAG_pointer_type
    6448                      .dwattr $C$DW$T$146, DW_AT_type(*$C$DW$T$20)
    6449                      .dwattr $C$DW$T$146, DW_AT_address_class(0x16)
    6450              $C$DW$T$147     .dwtag  DW_TAG_typedef, DW_AT_name("LDC_Handle")
    6451                      .dwattr $C$DW$T$147, DW_AT_type(*$C$DW$T$146)
    6452                      .dwattr $C$DW$T$147, DW_AT_language(DW_LANG_C)
    6453              
    6454              $C$DW$T$32      .dwtag  DW_TAG_structure_type
    6455                      .dwattr $C$DW$T$32, DW_AT_name("_ADC_Obj_")
    6456                      .dwattr $C$DW$T$32, DW_AT_byte_size(0x6650)
    6457              $C$DW$800       .dwtag  DW_TAG_member
    6458                      .dwattr $C$DW$800, DW_AT_type(*$C$DW$T$26)
    6459                      .dwattr $C$DW$800, DW_AT_name("ADCRESULT")
    6460                      .dwattr $C$DW$800, DW_AT_TI_symbol_name("_ADCRESULT")
    6461                      .dwattr $C$DW$800, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    6462                      .dwattr $C$DW$800, DW_AT_accessibility(DW_ACCESS_public)
    6463              $C$DW$801       .dwtag  DW_TAG_member
    6464                      .dwattr $C$DW$801, DW_AT_type(*$C$DW$T$27)
    6465                      .dwattr $C$DW$801, DW_AT_name("resvd_1")
    6466                      .dwattr $C$DW$801, DW_AT_TI_symbol_name("_resvd_1")
    6467                      .dwattr $C$DW$801, DW_AT_data_member_location[DW_OP_plus_uconst 0x10]
    6468                      .dwattr $C$DW$801, DW_AT_accessibility(DW_ACCESS_public)
    6469              $C$DW$802       .dwtag  DW_TAG_member
    6470                      .dwattr $C$DW$802, DW_AT_type(*$C$DW$T$25)
    6471                      .dwattr $C$DW$802, DW_AT_name("ADCCTL1")
    6472                      .dwattr $C$DW$802, DW_AT_TI_symbol_name("_ADCCTL1")
    6473                      .dwattr $C$DW$802, DW_AT_data_member_location[DW_OP_plus_uconst 0x6600]
    6474                      .dwattr $C$DW$802, DW_AT_accessibility(DW_ACCESS_public)
TMS320C2000 Assembler PC v6.2.5 Sat Sep 16 14:59:17 2017

Tools Copyright (c) 1996-2014 Texas Instruments Incorporated
C:\Users\wmj\AppData\Local\Temp\0328410                              PAGE  128

    6475              $C$DW$803       .dwtag  DW_TAG_member
    6476                      .dwattr $C$DW$803, DW_AT_type(*$C$DW$T$25)
    6477                      .dwattr $C$DW$803, DW_AT_name("ADCCTL2")
    6478                      .dwattr $C$DW$803, DW_AT_TI_symbol_name("_ADCCTL2")
    6479                      .dwattr $C$DW$803, DW_AT_data_member_location[DW_OP_plus_uconst 0x6601]
    6480                      .dwattr $C$DW$803, DW_AT_accessibility(DW_ACCESS_public)
    6481              $C$DW$804       .dwtag  DW_TAG_member
    6482                      .dwattr $C$DW$804, DW_AT_type(*$C$DW$T$28)
    6483                      .dwattr $C$DW$804, DW_AT_name("rsvd_2")
    6484                      .dwattr $C$DW$804, DW_AT_TI_symbol_name("_rsvd_2")
    6485                      .dwattr $C$DW$804, DW_AT_data_member_location[DW_OP_plus_uconst 0x6602]
    6486                      .dwattr $C$DW$804, DW_AT_accessibility(DW_ACCESS_public)
    6487              $C$DW$805       .dwtag  DW_TAG_member
    6488                      .dwattr $C$DW$805, DW_AT_type(*$C$DW$T$25)
    6489                      .dwattr $C$DW$805, DW_AT_name("ADCINTFLG")
    6490                      .dwattr $C$DW$805, DW_AT_TI_symbol_name("_ADCINTFLG")
    6491                      .dwattr $C$DW$805, DW_AT_data_member_location[DW_OP_plus_uconst 0x6604]
    6492                      .dwattr $C$DW$805, DW_AT_accessibility(DW_ACCESS_public)
    6493              $C$DW$806       .dwtag  DW_TAG_member
    6494                      .dwattr $C$DW$806, DW_AT_type(*$C$DW$T$25)
    6495                      .dwattr $C$DW$806, DW_AT_name("ADCINTFLGCLR")
    6496                      .dwattr $C$DW$806, DW_AT_TI_symbol_name("_ADCINTFLGCLR")
    6497                      .dwattr $C$DW$806, DW_AT_data_member_location[DW_OP_plus_uconst 0x6605]
    6498                      .dwattr $C$DW$806, DW_AT_accessibility(DW_ACCESS_public)
    6499              $C$DW$807       .dwtag  DW_TAG_member
    6500                      .dwattr $C$DW$807, DW_AT_type(*$C$DW$T$25)
    6501                      .dwattr $C$DW$807, DW_AT_name("ADCINTOVF")
    6502                      .dwattr $C$DW$807, DW_AT_TI_symbol_name("_ADCINTOVF")
    6503                      .dwattr $C$DW$807, DW_AT_data_member_location[DW_OP_plus_uconst 0x6606]
    6504                      .dwattr $C$DW$807, DW_AT_accessibility(DW_ACCESS_public)
    6505              $C$DW$808       .dwtag  DW_TAG_member
    6506                      .dwattr $C$DW$808, DW_AT_type(*$C$DW$T$25)
    6507                      .dwattr $C$DW$808, DW_AT_name("ADCINTOVFCLR")
    6508                      .dwattr $C$DW$808, DW_AT_TI_symbol_name("_ADCINTOVFCLR")
    6509                      .dwattr $C$DW$808, DW_AT_data_member_location[DW_OP_plus_uconst 0x6607]
    6510                      .dwattr $C$DW$808, DW_AT_accessibility(DW_ACCESS_public)
    6511              $C$DW$809       .dwtag  DW_TAG_member
    6512                      .dwattr $C$DW$809, DW_AT_type(*$C$DW$T$29)
    6513                      .dwattr $C$DW$809, DW_AT_name("INTSELxNy")
    6514                      .dwattr $C$DW$809, DW_AT_TI_symbol_name("_INTSELxNy")
    6515                      .dwattr $C$DW$809, DW_AT_data_member_location[DW_OP_plus_uconst 0x6608]
    6516                      .dwattr $C$DW$809, DW_AT_accessibility(DW_ACCESS_public)
    6517              $C$DW$810       .dwtag  DW_TAG_member
    6518                      .dwattr $C$DW$810, DW_AT_type(*$C$DW$T$30)
    6519                      .dwattr $C$DW$810, DW_AT_name("rsvd_3")
    6520                      .dwattr $C$DW$810, DW_AT_TI_symbol_name("_rsvd_3")
    6521                      .dwattr $C$DW$810, DW_AT_data_member_location[DW_OP_plus_uconst 0x660d]
    6522                      .dwattr $C$DW$810, DW_AT_accessibility(DW_ACCESS_public)
    6523              $C$DW$811       .dwtag  DW_TAG_member
    6524                      .dwattr $C$DW$811, DW_AT_type(*$C$DW$T$25)
    6525                      .dwattr $C$DW$811, DW_AT_name("SOCPRICTRL")
    6526                      .dwattr $C$DW$811, DW_AT_TI_symbol_name("_SOCPRICTRL")
    6527                      .dwattr $C$DW$811, DW_AT_data_member_location[DW_OP_plus_uconst 0x6610]
    6528                      .dwattr $C$DW$811, DW_AT_accessibility(DW_ACCESS_public)
    6529              $C$DW$812       .dwtag  DW_TAG_member
TMS320C2000 Assembler PC v6.2.5 Sat Sep 16 14:59:17 2017

Tools Copyright (c) 1996-2014 Texas Instruments Incorporated
C:\Users\wmj\AppData\Local\Temp\0328410                              PAGE  129

    6530                      .dwattr $C$DW$812, DW_AT_type(*$C$DW$T$25)
    6531                      .dwattr $C$DW$812, DW_AT_name("rsvd_4")
    6532                      .dwattr $C$DW$812, DW_AT_TI_symbol_name("_rsvd_4")
    6533                      .dwattr $C$DW$812, DW_AT_data_member_location[DW_OP_plus_uconst 0x6611]
    6534                      .dwattr $C$DW$812, DW_AT_accessibility(DW_ACCESS_public)
    6535              $C$DW$813       .dwtag  DW_TAG_member
    6536                      .dwattr $C$DW$813, DW_AT_type(*$C$DW$T$25)
    6537                      .dwattr $C$DW$813, DW_AT_name("ADCSAMPLEMODE")
    6538                      .dwattr $C$DW$813, DW_AT_TI_symbol_name("_ADCSAMPLEMODE")
    6539                      .dwattr $C$DW$813, DW_AT_data_member_location[DW_OP_plus_uconst 0x6612]
    6540                      .dwattr $C$DW$813, DW_AT_accessibility(DW_ACCESS_public)
    6541              $C$DW$814       .dwtag  DW_TAG_member
    6542                      .dwattr $C$DW$814, DW_AT_type(*$C$DW$T$25)
    6543                      .dwattr $C$DW$814, DW_AT_name("rsvd_5")
    6544                      .dwattr $C$DW$814, DW_AT_TI_symbol_name("_rsvd_5")
    6545                      .dwattr $C$DW$814, DW_AT_data_member_location[DW_OP_plus_uconst 0x6613]
    6546                      .dwattr $C$DW$814, DW_AT_accessibility(DW_ACCESS_public)
    6547              $C$DW$815       .dwtag  DW_TAG_member
    6548                      .dwattr $C$DW$815, DW_AT_type(*$C$DW$T$25)
    6549                      .dwattr $C$DW$815, DW_AT_name("ADCINTSOCSEL1")
    6550                      .dwattr $C$DW$815, DW_AT_TI_symbol_name("_ADCINTSOCSEL1")
    6551                      .dwattr $C$DW$815, DW_AT_data_member_location[DW_OP_plus_uconst 0x6614]
    6552                      .dwattr $C$DW$815, DW_AT_accessibility(DW_ACCESS_public)
    6553              $C$DW$816       .dwtag  DW_TAG_member
    6554                      .dwattr $C$DW$816, DW_AT_type(*$C$DW$T$25)
    6555                      .dwattr $C$DW$816, DW_AT_name("ADCINTSOCSEL2")
    6556                      .dwattr $C$DW$816, DW_AT_TI_symbol_name("_ADCINTSOCSEL2")
    6557                      .dwattr $C$DW$816, DW_AT_data_member_location[DW_OP_plus_uconst 0x6615]
    6558                      .dwattr $C$DW$816, DW_AT_accessibility(DW_ACCESS_public)
    6559              $C$DW$817       .dwtag  DW_TAG_member
    6560                      .dwattr $C$DW$817, DW_AT_type(*$C$DW$T$28)
    6561                      .dwattr $C$DW$817, DW_AT_name("rsvd_6")
    6562                      .dwattr $C$DW$817, DW_AT_TI_symbol_name("_rsvd_6")
    6563                      .dwattr $C$DW$817, DW_AT_data_member_location[DW_OP_plus_uconst 0x6616]
    6564                      .dwattr $C$DW$817, DW_AT_accessibility(DW_ACCESS_public)
    6565              $C$DW$818       .dwtag  DW_TAG_member
    6566                      .dwattr $C$DW$818, DW_AT_type(*$C$DW$T$25)
    6567                      .dwattr $C$DW$818, DW_AT_name("ADCSOCFLG1")
    6568                      .dwattr $C$DW$818, DW_AT_TI_symbol_name("_ADCSOCFLG1")
    6569                      .dwattr $C$DW$818, DW_AT_data_member_location[DW_OP_plus_uconst 0x6618]
    6570                      .dwattr $C$DW$818, DW_AT_accessibility(DW_ACCESS_public)
    6571              $C$DW$819       .dwtag  DW_TAG_member
    6572                      .dwattr $C$DW$819, DW_AT_type(*$C$DW$T$25)
    6573                      .dwattr $C$DW$819, DW_AT_name("rsvd_7")
    6574                      .dwattr $C$DW$819, DW_AT_TI_symbol_name("_rsvd_7")
    6575                      .dwattr $C$DW$819, DW_AT_data_member_location[DW_OP_plus_uconst 0x6619]
    6576                      .dwattr $C$DW$819, DW_AT_accessibility(DW_ACCESS_public)
    6577              $C$DW$820       .dwtag  DW_TAG_member
    6578                      .dwattr $C$DW$820, DW_AT_type(*$C$DW$T$25)
    6579                      .dwattr $C$DW$820, DW_AT_name("ADCSOCFRC1")
    6580                      .dwattr $C$DW$820, DW_AT_TI_symbol_name("_ADCSOCFRC1")
    6581                      .dwattr $C$DW$820, DW_AT_data_member_location[DW_OP_plus_uconst 0x661a]
    6582                      .dwattr $C$DW$820, DW_AT_accessibility(DW_ACCESS_public)
    6583              $C$DW$821       .dwtag  DW_TAG_member
    6584                      .dwattr $C$DW$821, DW_AT_type(*$C$DW$T$25)
TMS320C2000 Assembler PC v6.2.5 Sat Sep 16 14:59:17 2017

Tools Copyright (c) 1996-2014 Texas Instruments Incorporated
C:\Users\wmj\AppData\Local\Temp\0328410                              PAGE  130

    6585                      .dwattr $C$DW$821, DW_AT_name("rsvd_8")
    6586                      .dwattr $C$DW$821, DW_AT_TI_symbol_name("_rsvd_8")
    6587                      .dwattr $C$DW$821, DW_AT_data_member_location[DW_OP_plus_uconst 0x661b]
    6588                      .dwattr $C$DW$821, DW_AT_accessibility(DW_ACCESS_public)
    6589              $C$DW$822       .dwtag  DW_TAG_member
    6590                      .dwattr $C$DW$822, DW_AT_type(*$C$DW$T$25)
    6591                      .dwattr $C$DW$822, DW_AT_name("ADCSOCOVF1")
    6592                      .dwattr $C$DW$822, DW_AT_TI_symbol_name("_ADCSOCOVF1")
    6593                      .dwattr $C$DW$822, DW_AT_data_member_location[DW_OP_plus_uconst 0x661c]
    6594                      .dwattr $C$DW$822, DW_AT_accessibility(DW_ACCESS_public)
    6595              $C$DW$823       .dwtag  DW_TAG_member
    6596                      .dwattr $C$DW$823, DW_AT_type(*$C$DW$T$25)
    6597                      .dwattr $C$DW$823, DW_AT_name("rsvd_9")
    6598                      .dwattr $C$DW$823, DW_AT_TI_symbol_name("_rsvd_9")
    6599                      .dwattr $C$DW$823, DW_AT_data_member_location[DW_OP_plus_uconst 0x661d]
    6600                      .dwattr $C$DW$823, DW_AT_accessibility(DW_ACCESS_public)
    6601              $C$DW$824       .dwtag  DW_TAG_member
    6602                      .dwattr $C$DW$824, DW_AT_type(*$C$DW$T$25)
    6603                      .dwattr $C$DW$824, DW_AT_name("ADCSOCOVFCLR1")
    6604                      .dwattr $C$DW$824, DW_AT_TI_symbol_name("_ADCSOCOVFCLR1")
    6605                      .dwattr $C$DW$824, DW_AT_data_member_location[DW_OP_plus_uconst 0x661e]
    6606                      .dwattr $C$DW$824, DW_AT_accessibility(DW_ACCESS_public)
    6607              $C$DW$825       .dwtag  DW_TAG_member
    6608                      .dwattr $C$DW$825, DW_AT_type(*$C$DW$T$25)
    6609                      .dwattr $C$DW$825, DW_AT_name("rsvd_10")
    6610                      .dwattr $C$DW$825, DW_AT_TI_symbol_name("_rsvd_10")
    6611                      .dwattr $C$DW$825, DW_AT_data_member_location[DW_OP_plus_uconst 0x661f]
    6612                      .dwattr $C$DW$825, DW_AT_accessibility(DW_ACCESS_public)
    6613              $C$DW$826       .dwtag  DW_TAG_member
    6614                      .dwattr $C$DW$826, DW_AT_type(*$C$DW$T$26)
    6615                      .dwattr $C$DW$826, DW_AT_name("ADCSOCxCTL")
    6616                      .dwattr $C$DW$826, DW_AT_TI_symbol_name("_ADCSOCxCTL")
    6617                      .dwattr $C$DW$826, DW_AT_data_member_location[DW_OP_plus_uconst 0x6620]
    6618                      .dwattr $C$DW$826, DW_AT_accessibility(DW_ACCESS_public)
    6619              $C$DW$827       .dwtag  DW_TAG_member
    6620                      .dwattr $C$DW$827, DW_AT_type(*$C$DW$T$26)
    6621                      .dwattr $C$DW$827, DW_AT_name("rsvd_11")
    6622                      .dwattr $C$DW$827, DW_AT_TI_symbol_name("_rsvd_11")
    6623                      .dwattr $C$DW$827, DW_AT_data_member_location[DW_OP_plus_uconst 0x6630]
    6624                      .dwattr $C$DW$827, DW_AT_accessibility(DW_ACCESS_public)
    6625              $C$DW$828       .dwtag  DW_TAG_member
    6626                      .dwattr $C$DW$828, DW_AT_type(*$C$DW$T$25)
    6627                      .dwattr $C$DW$828, DW_AT_name("ADCREFTRIM")
    6628                      .dwattr $C$DW$828, DW_AT_TI_symbol_name("_ADCREFTRIM")
    6629                      .dwattr $C$DW$828, DW_AT_data_member_location[DW_OP_plus_uconst 0x6640]
    6630                      .dwattr $C$DW$828, DW_AT_accessibility(DW_ACCESS_public)
    6631              $C$DW$829       .dwtag  DW_TAG_member
    6632                      .dwattr $C$DW$829, DW_AT_type(*$C$DW$T$25)
    6633                      .dwattr $C$DW$829, DW_AT_name("ADCOFFTRIM")
    6634                      .dwattr $C$DW$829, DW_AT_TI_symbol_name("_ADCOFFTRIM")
    6635                      .dwattr $C$DW$829, DW_AT_data_member_location[DW_OP_plus_uconst 0x6641]
    6636                      .dwattr $C$DW$829, DW_AT_accessibility(DW_ACCESS_public)
    6637              $C$DW$830       .dwtag  DW_TAG_member
    6638                      .dwattr $C$DW$830, DW_AT_type(*$C$DW$T$31)
    6639                      .dwattr $C$DW$830, DW_AT_name("resvd_12")
TMS320C2000 Assembler PC v6.2.5 Sat Sep 16 14:59:17 2017

Tools Copyright (c) 1996-2014 Texas Instruments Incorporated
C:\Users\wmj\AppData\Local\Temp\0328410                              PAGE  131

    6640                      .dwattr $C$DW$830, DW_AT_TI_symbol_name("_resvd_12")
    6641                      .dwattr $C$DW$830, DW_AT_data_member_location[DW_OP_plus_uconst 0x6642]
    6642                      .dwattr $C$DW$830, DW_AT_accessibility(DW_ACCESS_public)
    6643              $C$DW$831       .dwtag  DW_TAG_member
    6644                      .dwattr $C$DW$831, DW_AT_type(*$C$DW$T$25)
    6645                      .dwattr $C$DW$831, DW_AT_name("ADCREV")
    6646                      .dwattr $C$DW$831, DW_AT_TI_symbol_name("_ADCREV")
    6647                      .dwattr $C$DW$831, DW_AT_data_member_location[DW_OP_plus_uconst 0x664f]
    6648                      .dwattr $C$DW$831, DW_AT_accessibility(DW_ACCESS_public)
    6649                      .dwendtag $C$DW$T$32
    6650              
    6651              $C$DW$T$318     .dwtag  DW_TAG_typedef, DW_AT_name("ADC_Obj")
    6652                      .dwattr $C$DW$T$318, DW_AT_type(*$C$DW$T$32)
    6653                      .dwattr $C$DW$T$318, DW_AT_language(DW_LANG_C)
    6654              $C$DW$T$100     .dwtag  DW_TAG_pointer_type
    6655                      .dwattr $C$DW$T$100, DW_AT_type(*$C$DW$T$32)
    6656                      .dwattr $C$DW$T$100, DW_AT_address_class(0x16)
    6657              $C$DW$T$101     .dwtag  DW_TAG_typedef, DW_AT_name("ADC_Handle")
    6658                      .dwattr $C$DW$T$101, DW_AT_type(*$C$DW$T$100)
    6659                      .dwattr $C$DW$T$101, DW_AT_language(DW_LANG_C)
    6660              
    6661              $C$DW$T$35      .dwtag  DW_TAG_structure_type
    6662                      .dwattr $C$DW$T$35, DW_AT_name("_CLARKE_Obj_")
    6663                      .dwattr $C$DW$T$35, DW_AT_byte_size(0x06)
    6664              $C$DW$832       .dwtag  DW_TAG_member
    6665                      .dwattr $C$DW$832, DW_AT_type(*$C$DW$T$33)
    6666                      .dwattr $C$DW$832, DW_AT_name("alpha_sf")
    6667                      .dwattr $C$DW$832, DW_AT_TI_symbol_name("_alpha_sf")
    6668                      .dwattr $C$DW$832, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    6669                      .dwattr $C$DW$832, DW_AT_accessibility(DW_ACCESS_public)
    6670              $C$DW$833       .dwtag  DW_TAG_member
    6671                      .dwattr $C$DW$833, DW_AT_type(*$C$DW$T$33)
    6672                      .dwattr $C$DW$833, DW_AT_name("beta_sf")
    6673                      .dwattr $C$DW$833, DW_AT_TI_symbol_name("_beta_sf")
    6674                      .dwattr $C$DW$833, DW_AT_data_member_location[DW_OP_plus_uconst 0x2]
    6675                      .dwattr $C$DW$833, DW_AT_accessibility(DW_ACCESS_public)
    6676              $C$DW$834       .dwtag  DW_TAG_member
    6677                      .dwattr $C$DW$834, DW_AT_type(*$C$DW$T$34)
    6678                      .dwattr $C$DW$834, DW_AT_name("numSensors")
    6679                      .dwattr $C$DW$834, DW_AT_TI_symbol_name("_numSensors")
    6680                      .dwattr $C$DW$834, DW_AT_data_member_location[DW_OP_plus_uconst 0x4]
    6681                      .dwattr $C$DW$834, DW_AT_accessibility(DW_ACCESS_public)
    6682                      .dwendtag $C$DW$T$35
    6683              
    6684              $C$DW$T$50      .dwtag  DW_TAG_typedef, DW_AT_name("CLARKE_Obj")
    6685                      .dwattr $C$DW$T$50, DW_AT_type(*$C$DW$T$35)
    6686                      .dwattr $C$DW$T$50, DW_AT_language(DW_LANG_C)
    6687              $C$DW$T$48      .dwtag  DW_TAG_pointer_type
    6688                      .dwattr $C$DW$T$48, DW_AT_type(*$C$DW$T$35)
    6689                      .dwattr $C$DW$T$48, DW_AT_address_class(0x16)
    6690              $C$DW$T$49      .dwtag  DW_TAG_typedef, DW_AT_name("CLARKE_Handle")
    6691                      .dwattr $C$DW$T$49, DW_AT_type(*$C$DW$T$48)
    6692                      .dwattr $C$DW$T$49, DW_AT_language(DW_LANG_C)
    6693              
    6694              $C$DW$T$36      .dwtag  DW_TAG_structure_type
TMS320C2000 Assembler PC v6.2.5 Sat Sep 16 14:59:17 2017

Tools Copyright (c) 1996-2014 Texas Instruments Incorporated
C:\Users\wmj\AppData\Local\Temp\0328410                              PAGE  132

    6695                      .dwattr $C$DW$T$36, DW_AT_name("_CLK_DIV_t_")
    6696                      .dwattr $C$DW$T$36, DW_AT_byte_size(0x02)
    6697              $C$DW$835       .dwtag  DW_TAG_member
    6698                      .dwattr $C$DW$835, DW_AT_type(*$C$DW$T$24)
    6699                      .dwattr $C$DW$835, DW_AT_name("FREF_DIVIDER")
    6700                      .dwattr $C$DW$835, DW_AT_TI_symbol_name("_FREF_DIVIDER")
    6701                      .dwattr $C$DW$835, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    6702                      .dwattr $C$DW$835, DW_AT_accessibility(DW_ACCESS_public)
    6703              $C$DW$836       .dwtag  DW_TAG_member
    6704                      .dwattr $C$DW$836, DW_AT_type(*$C$DW$T$24)
    6705                      .dwattr $C$DW$836, DW_AT_name("FIN_DIVIDER")
    6706                      .dwattr $C$DW$836, DW_AT_TI_symbol_name("_FIN_DIVIDER")
    6707                      .dwattr $C$DW$836, DW_AT_data_member_location[DW_OP_plus_uconst 0x1]
    6708                      .dwattr $C$DW$836, DW_AT_accessibility(DW_ACCESS_public)
    6709                      .dwendtag $C$DW$T$36
    6710              
    6711              $C$DW$T$140     .dwtag  DW_TAG_typedef, DW_AT_name("CLK_DIV_t_")
    6712                      .dwattr $C$DW$T$140, DW_AT_type(*$C$DW$T$36)
    6713                      .dwattr $C$DW$T$140, DW_AT_language(DW_LANG_C)
    6714              
    6715              $C$DW$T$38      .dwtag  DW_TAG_structure_type
    6716                      .dwattr $C$DW$T$38, DW_AT_name("_CLK_Obj_")
    6717                      .dwattr $C$DW$T$38, DW_AT_byte_size(0x11)
    6718              $C$DW$837       .dwtag  DW_TAG_member
    6719                      .dwattr $C$DW$837, DW_AT_type(*$C$DW$T$25)
    6720                      .dwattr $C$DW$837, DW_AT_name("XCLK")
    6721                      .dwattr $C$DW$837, DW_AT_TI_symbol_name("_XCLK")
    6722                      .dwattr $C$DW$837, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    6723                      .dwattr $C$DW$837, DW_AT_accessibility(DW_ACCESS_public)
    6724              $C$DW$838       .dwtag  DW_TAG_member
    6725                      .dwattr $C$DW$838, DW_AT_type(*$C$DW$T$25)
    6726                      .dwattr $C$DW$838, DW_AT_name("rsvd_1")
    6727                      .dwattr $C$DW$838, DW_AT_TI_symbol_name("_rsvd_1")
    6728                      .dwattr $C$DW$838, DW_AT_data_member_location[DW_OP_plus_uconst 0x1]
    6729                      .dwattr $C$DW$838, DW_AT_accessibility(DW_ACCESS_public)
    6730              $C$DW$839       .dwtag  DW_TAG_member
    6731                      .dwattr $C$DW$839, DW_AT_type(*$C$DW$T$25)
    6732                      .dwattr $C$DW$839, DW_AT_name("CLKCTL")
    6733                      .dwattr $C$DW$839, DW_AT_TI_symbol_name("_CLKCTL")
    6734                      .dwattr $C$DW$839, DW_AT_data_member_location[DW_OP_plus_uconst 0x2]
    6735                      .dwattr $C$DW$839, DW_AT_accessibility(DW_ACCESS_public)
    6736              $C$DW$840       .dwtag  DW_TAG_member
    6737                      .dwattr $C$DW$840, DW_AT_type(*$C$DW$T$37)
    6738                      .dwattr $C$DW$840, DW_AT_name("rsvd_2")
    6739                      .dwattr $C$DW$840, DW_AT_TI_symbol_name("_rsvd_2")
    6740                      .dwattr $C$DW$840, DW_AT_data_member_location[DW_OP_plus_uconst 0x3]
    6741                      .dwattr $C$DW$840, DW_AT_accessibility(DW_ACCESS_public)
    6742              $C$DW$841       .dwtag  DW_TAG_member
    6743                      .dwattr $C$DW$841, DW_AT_type(*$C$DW$T$25)
    6744                      .dwattr $C$DW$841, DW_AT_name("LOSPCP")
    6745                      .dwattr $C$DW$841, DW_AT_TI_symbol_name("_LOSPCP")
    6746                      .dwattr $C$DW$841, DW_AT_data_member_location[DW_OP_plus_uconst 0xb]
    6747                      .dwattr $C$DW$841, DW_AT_accessibility(DW_ACCESS_public)
    6748              $C$DW$842       .dwtag  DW_TAG_member
    6749                      .dwattr $C$DW$842, DW_AT_type(*$C$DW$T$25)
TMS320C2000 Assembler PC v6.2.5 Sat Sep 16 14:59:17 2017

Tools Copyright (c) 1996-2014 Texas Instruments Incorporated
C:\Users\wmj\AppData\Local\Temp\0328410                              PAGE  133

    6750                      .dwattr $C$DW$842, DW_AT_name("PCLKCR0")
    6751                      .dwattr $C$DW$842, DW_AT_TI_symbol_name("_PCLKCR0")
    6752                      .dwattr $C$DW$842, DW_AT_data_member_location[DW_OP_plus_uconst 0xc]
    6753                      .dwattr $C$DW$842, DW_AT_accessibility(DW_ACCESS_public)
    6754              $C$DW$843       .dwtag  DW_TAG_member
    6755                      .dwattr $C$DW$843, DW_AT_type(*$C$DW$T$25)
    6756                      .dwattr $C$DW$843, DW_AT_name("PCLKCR1")
    6757                      .dwattr $C$DW$843, DW_AT_TI_symbol_name("_PCLKCR1")
    6758                      .dwattr $C$DW$843, DW_AT_data_member_location[DW_OP_plus_uconst 0xd]
    6759                      .dwattr $C$DW$843, DW_AT_accessibility(DW_ACCESS_public)
    6760              $C$DW$844       .dwtag  DW_TAG_member
    6761                      .dwattr $C$DW$844, DW_AT_type(*$C$DW$T$28)
    6762                      .dwattr $C$DW$844, DW_AT_name("rsvd_3")
    6763                      .dwattr $C$DW$844, DW_AT_TI_symbol_name("_rsvd_3")
    6764                      .dwattr $C$DW$844, DW_AT_data_member_location[DW_OP_plus_uconst 0xe]
    6765                      .dwattr $C$DW$844, DW_AT_accessibility(DW_ACCESS_public)
    6766              $C$DW$845       .dwtag  DW_TAG_member
    6767                      .dwattr $C$DW$845, DW_AT_type(*$C$DW$T$25)
    6768                      .dwattr $C$DW$845, DW_AT_name("PCLKCR3")
    6769                      .dwattr $C$DW$845, DW_AT_TI_symbol_name("_PCLKCR3")
    6770                      .dwattr $C$DW$845, DW_AT_data_member_location[DW_OP_plus_uconst 0x10]
    6771                      .dwattr $C$DW$845, DW_AT_accessibility(DW_ACCESS_public)
    6772                      .dwendtag $C$DW$T$38
    6773              
    6774              $C$DW$T$102     .dwtag  DW_TAG_pointer_type
    6775                      .dwattr $C$DW$T$102, DW_AT_type(*$C$DW$T$38)
    6776                      .dwattr $C$DW$T$102, DW_AT_address_class(0x16)
    6777              $C$DW$T$103     .dwtag  DW_TAG_typedef, DW_AT_name("CLK_Handle")
    6778                      .dwattr $C$DW$T$103, DW_AT_type(*$C$DW$T$102)
    6779                      .dwattr $C$DW$T$103, DW_AT_language(DW_LANG_C)
    6780              
    6781              $C$DW$T$39      .dwtag  DW_TAG_structure_type
    6782                      .dwattr $C$DW$T$39, DW_AT_name("_CPU_Obj_")
    6783                      .dwattr $C$DW$T$39, DW_AT_byte_size(0x01)
    6784              $C$DW$846       .dwtag  DW_TAG_member
    6785                      .dwattr $C$DW$846, DW_AT_type(*$C$DW$T$34)
    6786                      .dwattr $C$DW$846, DW_AT_name("tmp")
    6787                      .dwattr $C$DW$846, DW_AT_TI_symbol_name("_tmp")
    6788                      .dwattr $C$DW$846, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    6789                      .dwattr $C$DW$846, DW_AT_accessibility(DW_ACCESS_public)
    6790                      .dwendtag $C$DW$T$39
    6791              
    6792              $C$DW$T$104     .dwtag  DW_TAG_pointer_type
    6793                      .dwattr $C$DW$T$104, DW_AT_type(*$C$DW$T$39)
    6794                      .dwattr $C$DW$T$104, DW_AT_address_class(0x16)
    6795              $C$DW$T$105     .dwtag  DW_TAG_typedef, DW_AT_name("CPU_Handle")
    6796                      .dwattr $C$DW$T$105, DW_AT_type(*$C$DW$T$104)
    6797                      .dwattr $C$DW$T$105, DW_AT_language(DW_LANG_C)
    6798              
    6799              $C$DW$T$42      .dwtag  DW_TAG_structure_type
    6800                      .dwattr $C$DW$T$42, DW_AT_name("_CPU_TIME_Obj_")
    6801                      .dwattr $C$DW$T$42, DW_AT_byte_size(0x18)
    6802              $C$DW$847       .dwtag  DW_TAG_member
    6803                      .dwattr $C$DW$847, DW_AT_type(*$C$DW$T$24)
    6804                      .dwattr $C$DW$847, DW_AT_name("pwm_period")
TMS320C2000 Assembler PC v6.2.5 Sat Sep 16 14:59:17 2017

Tools Copyright (c) 1996-2014 Texas Instruments Incorporated
C:\Users\wmj\AppData\Local\Temp\0328410                              PAGE  134

    6805                      .dwattr $C$DW$847, DW_AT_TI_symbol_name("_pwm_period")
    6806                      .dwattr $C$DW$847, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    6807                      .dwattr $C$DW$847, DW_AT_accessibility(DW_ACCESS_public)
    6808              $C$DW$848       .dwtag  DW_TAG_member
    6809                      .dwattr $C$DW$848, DW_AT_type(*$C$DW$T$40)
    6810                      .dwattr $C$DW$848, DW_AT_name("timer_cnt_now")
    6811                      .dwattr $C$DW$848, DW_AT_TI_symbol_name("_timer_cnt_now")
    6812                      .dwattr $C$DW$848, DW_AT_data_member_location[DW_OP_plus_uconst 0x2]
    6813                      .dwattr $C$DW$848, DW_AT_accessibility(DW_ACCESS_public)
    6814              $C$DW$849       .dwtag  DW_TAG_member
    6815                      .dwattr $C$DW$849, DW_AT_type(*$C$DW$T$40)
    6816                      .dwattr $C$DW$849, DW_AT_name("timer_cnt_prev")
    6817                      .dwattr $C$DW$849, DW_AT_TI_symbol_name("_timer_cnt_prev")
    6818                      .dwattr $C$DW$849, DW_AT_data_member_location[DW_OP_plus_uconst 0x4]
    6819                      .dwattr $C$DW$849, DW_AT_accessibility(DW_ACCESS_public)
    6820              $C$DW$850       .dwtag  DW_TAG_member
    6821                      .dwattr $C$DW$850, DW_AT_type(*$C$DW$T$40)
    6822                      .dwattr $C$DW$850, DW_AT_name("timer_delta_now")
    6823                      .dwattr $C$DW$850, DW_AT_TI_symbol_name("_timer_delta_now")
    6824                      .dwattr $C$DW$850, DW_AT_data_member_location[DW_OP_plus_uconst 0x6]
    6825                      .dwattr $C$DW$850, DW_AT_accessibility(DW_ACCESS_public)
    6826              $C$DW$851       .dwtag  DW_TAG_member
    6827                      .dwattr $C$DW$851, DW_AT_type(*$C$DW$T$40)
    6828                      .dwattr $C$DW$851, DW_AT_name("timer_delta_prev")
    6829                      .dwattr $C$DW$851, DW_AT_TI_symbol_name("_timer_delta_prev")
    6830                      .dwattr $C$DW$851, DW_AT_data_member_location[DW_OP_plus_uconst 0x8]
    6831                      .dwattr $C$DW$851, DW_AT_accessibility(DW_ACCESS_public)
    6832              $C$DW$852       .dwtag  DW_TAG_member
    6833                      .dwattr $C$DW$852, DW_AT_type(*$C$DW$T$40)
    6834                      .dwattr $C$DW$852, DW_AT_name("timer_delta_min")
    6835                      .dwattr $C$DW$852, DW_AT_TI_symbol_name("_timer_delta_min")
    6836                      .dwattr $C$DW$852, DW_AT_data_member_location[DW_OP_plus_uconst 0xa]
    6837                      .dwattr $C$DW$852, DW_AT_accessibility(DW_ACCESS_public)
    6838              $C$DW$853       .dwtag  DW_TAG_member
    6839                      .dwattr $C$DW$853, DW_AT_type(*$C$DW$T$40)
    6840                      .dwattr $C$DW$853, DW_AT_name("timer_delta_max")
    6841                      .dwattr $C$DW$853, DW_AT_TI_symbol_name("_timer_delta_max")
    6842                      .dwattr $C$DW$853, DW_AT_data_member_location[DW_OP_plus_uconst 0xc]
    6843                      .dwattr $C$DW$853, DW_AT_accessibility(DW_ACCESS_public)
    6844              $C$DW$854       .dwtag  DW_TAG_member
    6845                      .dwattr $C$DW$854, DW_AT_type(*$C$DW$T$40)
    6846                      .dwattr $C$DW$854, DW_AT_name("timer_delta_avg")
    6847                      .dwattr $C$DW$854, DW_AT_TI_symbol_name("_timer_delta_avg")
    6848                      .dwattr $C$DW$854, DW_AT_data_member_location[DW_OP_plus_uconst 0xe]
    6849                      .dwattr $C$DW$854, DW_AT_accessibility(DW_ACCESS_public)
    6850              $C$DW$855       .dwtag  DW_TAG_member
    6851                      .dwattr $C$DW$855, DW_AT_type(*$C$DW$T$40)
    6852                      .dwattr $C$DW$855, DW_AT_name("timer_band_max")
    6853                      .dwattr $C$DW$855, DW_AT_TI_symbol_name("_timer_band_max")
    6854                      .dwattr $C$DW$855, DW_AT_data_member_location[DW_OP_plus_uconst 0x10]
    6855                      .dwattr $C$DW$855, DW_AT_accessibility(DW_ACCESS_public)
    6856              $C$DW$856       .dwtag  DW_TAG_member
    6857                      .dwattr $C$DW$856, DW_AT_type(*$C$DW$T$40)
    6858                      .dwattr $C$DW$856, DW_AT_name("timer_delta_CntAcc")
    6859                      .dwattr $C$DW$856, DW_AT_TI_symbol_name("_timer_delta_CntAcc")
TMS320C2000 Assembler PC v6.2.5 Sat Sep 16 14:59:17 2017

Tools Copyright (c) 1996-2014 Texas Instruments Incorporated
C:\Users\wmj\AppData\Local\Temp\0328410                              PAGE  135

    6860                      .dwattr $C$DW$856, DW_AT_data_member_location[DW_OP_plus_uconst 0x12]
    6861                      .dwattr $C$DW$856, DW_AT_accessibility(DW_ACCESS_public)
    6862              $C$DW$857       .dwtag  DW_TAG_member
    6863                      .dwattr $C$DW$857, DW_AT_type(*$C$DW$T$40)
    6864                      .dwattr $C$DW$857, DW_AT_name("timer_delta_AccNum")
    6865                      .dwattr $C$DW$857, DW_AT_TI_symbol_name("_timer_delta_AccNum")
    6866                      .dwattr $C$DW$857, DW_AT_data_member_location[DW_OP_plus_uconst 0x14]
    6867                      .dwattr $C$DW$857, DW_AT_accessibility(DW_ACCESS_public)
    6868              $C$DW$858       .dwtag  DW_TAG_member
    6869                      .dwattr $C$DW$858, DW_AT_type(*$C$DW$T$41)
    6870                      .dwattr $C$DW$858, DW_AT_name("flag_resetStatus")
    6871                      .dwattr $C$DW$858, DW_AT_TI_symbol_name("_flag_resetStatus")
    6872                      .dwattr $C$DW$858, DW_AT_data_member_location[DW_OP_plus_uconst 0x16]
    6873                      .dwattr $C$DW$858, DW_AT_accessibility(DW_ACCESS_public)
    6874                      .dwendtag $C$DW$T$42
    6875              
    6876              $C$DW$T$319     .dwtag  DW_TAG_typedef, DW_AT_name("CPU_TIME_Obj")
    6877                      .dwattr $C$DW$T$319, DW_AT_type(*$C$DW$T$42)
    6878                      .dwattr $C$DW$T$319, DW_AT_language(DW_LANG_C)
    6879              $C$DW$T$320     .dwtag  DW_TAG_pointer_type
    6880                      .dwattr $C$DW$T$320, DW_AT_type(*$C$DW$T$319)
    6881                      .dwattr $C$DW$T$320, DW_AT_address_class(0x16)
    6882              $C$DW$T$321     .dwtag  DW_TAG_pointer_type
    6883                      .dwattr $C$DW$T$321, DW_AT_type(*$C$DW$T$42)
    6884                      .dwattr $C$DW$T$321, DW_AT_address_class(0x16)
    6885              $C$DW$T$322     .dwtag  DW_TAG_typedef, DW_AT_name("CPU_TIME_Handle")
    6886                      .dwattr $C$DW$T$322, DW_AT_type(*$C$DW$T$321)
    6887                      .dwattr $C$DW$T$322, DW_AT_language(DW_LANG_C)
    6888              
    6889              $C$DW$T$74      .dwtag  DW_TAG_structure_type
    6890                      .dwattr $C$DW$T$74, DW_AT_name("_CTRL_Obj_")
    6891                      .dwattr $C$DW$T$74, DW_AT_byte_size(0x108)
    6892              $C$DW$859       .dwtag  DW_TAG_member
    6893                      .dwattr $C$DW$859, DW_AT_type(*$C$DW$T$43)
    6894                      .dwattr $C$DW$859, DW_AT_name("version")
    6895                      .dwattr $C$DW$859, DW_AT_TI_symbol_name("_version")
    6896                      .dwattr $C$DW$859, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    6897                      .dwattr $C$DW$859, DW_AT_accessibility(DW_ACCESS_public)
    6898              $C$DW$860       .dwtag  DW_TAG_member
    6899                      .dwattr $C$DW$860, DW_AT_type(*$C$DW$T$45)
    6900                      .dwattr $C$DW$860, DW_AT_name("state")
    6901                      .dwattr $C$DW$860, DW_AT_TI_symbol_name("_state")
    6902                      .dwattr $C$DW$860, DW_AT_data_member_location[DW_OP_plus_uconst 0x4]
    6903                      .dwattr $C$DW$860, DW_AT_accessibility(DW_ACCESS_public)
    6904              $C$DW$861       .dwtag  DW_TAG_member
    6905                      .dwattr $C$DW$861, DW_AT_type(*$C$DW$T$45)
    6906                      .dwattr $C$DW$861, DW_AT_name("prevState")
    6907                      .dwattr $C$DW$861, DW_AT_TI_symbol_name("_prevState")
    6908                      .dwattr $C$DW$861, DW_AT_data_member_location[DW_OP_plus_uconst 0x5]
    6909                      .dwattr $C$DW$861, DW_AT_accessibility(DW_ACCESS_public)
    6910              $C$DW$862       .dwtag  DW_TAG_member
    6911                      .dwattr $C$DW$862, DW_AT_type(*$C$DW$T$47)
    6912                      .dwattr $C$DW$862, DW_AT_name("errorCode")
    6913                      .dwattr $C$DW$862, DW_AT_TI_symbol_name("_errorCode")
    6914                      .dwattr $C$DW$862, DW_AT_data_member_location[DW_OP_plus_uconst 0x6]
TMS320C2000 Assembler PC v6.2.5 Sat Sep 16 14:59:17 2017

Tools Copyright (c) 1996-2014 Texas Instruments Incorporated
C:\Users\wmj\AppData\Local\Temp\0328410                              PAGE  136

    6915                      .dwattr $C$DW$862, DW_AT_accessibility(DW_ACCESS_public)
    6916              $C$DW$863       .dwtag  DW_TAG_member
    6917                      .dwattr $C$DW$863, DW_AT_type(*$C$DW$T$49)
    6918                      .dwattr $C$DW$863, DW_AT_name("clarkeHandle_I")
    6919                      .dwattr $C$DW$863, DW_AT_TI_symbol_name("_clarkeHandle_I")
    6920                      .dwattr $C$DW$863, DW_AT_data_member_location[DW_OP_plus_uconst 0x8]
    6921                      .dwattr $C$DW$863, DW_AT_accessibility(DW_ACCESS_public)
    6922              $C$DW$864       .dwtag  DW_TAG_member
    6923                      .dwattr $C$DW$864, DW_AT_type(*$C$DW$T$50)
    6924                      .dwattr $C$DW$864, DW_AT_name("clarke_I")
    6925                      .dwattr $C$DW$864, DW_AT_TI_symbol_name("_clarke_I")
    6926                      .dwattr $C$DW$864, DW_AT_data_member_location[DW_OP_plus_uconst 0xa]
    6927                      .dwattr $C$DW$864, DW_AT_accessibility(DW_ACCESS_public)
    6928              $C$DW$865       .dwtag  DW_TAG_member
    6929                      .dwattr $C$DW$865, DW_AT_type(*$C$DW$T$49)
    6930                      .dwattr $C$DW$865, DW_AT_name("clarkeHandle_V")
    6931                      .dwattr $C$DW$865, DW_AT_TI_symbol_name("_clarkeHandle_V")
    6932                      .dwattr $C$DW$865, DW_AT_data_member_location[DW_OP_plus_uconst 0x10]
    6933                      .dwattr $C$DW$865, DW_AT_accessibility(DW_ACCESS_public)
    6934              $C$DW$866       .dwtag  DW_TAG_member
    6935                      .dwattr $C$DW$866, DW_AT_type(*$C$DW$T$50)
    6936                      .dwattr $C$DW$866, DW_AT_name("clarke_V")
    6937                      .dwattr $C$DW$866, DW_AT_TI_symbol_name("_clarke_V")
    6938                      .dwattr $C$DW$866, DW_AT_data_member_location[DW_OP_plus_uconst 0x12]
    6939                      .dwattr $C$DW$866, DW_AT_accessibility(DW_ACCESS_public)
    6940              $C$DW$867       .dwtag  DW_TAG_member
    6941                      .dwattr $C$DW$867, DW_AT_type(*$C$DW$T$52)
    6942                      .dwattr $C$DW$867, DW_AT_name("estHandle")
    6943                      .dwattr $C$DW$867, DW_AT_TI_symbol_name("_estHandle")
    6944                      .dwattr $C$DW$867, DW_AT_data_member_location[DW_OP_plus_uconst 0x18]
    6945                      .dwattr $C$DW$867, DW_AT_accessibility(DW_ACCESS_public)
    6946              $C$DW$868       .dwtag  DW_TAG_member
    6947                      .dwattr $C$DW$868, DW_AT_type(*$C$DW$T$54)
    6948                      .dwattr $C$DW$868, DW_AT_name("parkHandle")
    6949                      .dwattr $C$DW$868, DW_AT_TI_symbol_name("_parkHandle")
    6950                      .dwattr $C$DW$868, DW_AT_data_member_location[DW_OP_plus_uconst 0x1a]
    6951                      .dwattr $C$DW$868, DW_AT_accessibility(DW_ACCESS_public)
    6952              $C$DW$869       .dwtag  DW_TAG_member
    6953                      .dwattr $C$DW$869, DW_AT_type(*$C$DW$T$55)
    6954                      .dwattr $C$DW$869, DW_AT_name("park")
    6955                      .dwattr $C$DW$869, DW_AT_TI_symbol_name("_park")
    6956                      .dwattr $C$DW$869, DW_AT_data_member_location[DW_OP_plus_uconst 0x1c]
    6957                      .dwattr $C$DW$869, DW_AT_accessibility(DW_ACCESS_public)
    6958              $C$DW$870       .dwtag  DW_TAG_member
    6959                      .dwattr $C$DW$870, DW_AT_type(*$C$DW$T$57)
    6960                      .dwattr $C$DW$870, DW_AT_name("pidHandle_Id")
    6961                      .dwattr $C$DW$870, DW_AT_TI_symbol_name("_pidHandle_Id")
    6962                      .dwattr $C$DW$870, DW_AT_data_member_location[DW_OP_plus_uconst 0x20]
    6963                      .dwattr $C$DW$870, DW_AT_accessibility(DW_ACCESS_public)
    6964              $C$DW$871       .dwtag  DW_TAG_member
    6965                      .dwattr $C$DW$871, DW_AT_type(*$C$DW$T$58)
    6966                      .dwattr $C$DW$871, DW_AT_name("pid_Id")
    6967                      .dwattr $C$DW$871, DW_AT_TI_symbol_name("_pid_Id")
    6968                      .dwattr $C$DW$871, DW_AT_data_member_location[DW_OP_plus_uconst 0x22]
    6969                      .dwattr $C$DW$871, DW_AT_accessibility(DW_ACCESS_public)
TMS320C2000 Assembler PC v6.2.5 Sat Sep 16 14:59:17 2017

Tools Copyright (c) 1996-2014 Texas Instruments Incorporated
C:\Users\wmj\AppData\Local\Temp\0328410                              PAGE  137

    6970              $C$DW$872       .dwtag  DW_TAG_member
    6971                      .dwattr $C$DW$872, DW_AT_type(*$C$DW$T$57)
    6972                      .dwattr $C$DW$872, DW_AT_name("pidHandle_Iq")
    6973                      .dwattr $C$DW$872, DW_AT_TI_symbol_name("_pidHandle_Iq")
    6974                      .dwattr $C$DW$872, DW_AT_data_member_location[DW_OP_plus_uconst 0x32]
    6975                      .dwattr $C$DW$872, DW_AT_accessibility(DW_ACCESS_public)
    6976              $C$DW$873       .dwtag  DW_TAG_member
    6977                      .dwattr $C$DW$873, DW_AT_type(*$C$DW$T$58)
    6978                      .dwattr $C$DW$873, DW_AT_name("pid_Iq")
    6979                      .dwattr $C$DW$873, DW_AT_TI_symbol_name("_pid_Iq")
    6980                      .dwattr $C$DW$873, DW_AT_data_member_location[DW_OP_plus_uconst 0x34]
    6981                      .dwattr $C$DW$873, DW_AT_accessibility(DW_ACCESS_public)
    6982              $C$DW$874       .dwtag  DW_TAG_member
    6983                      .dwattr $C$DW$874, DW_AT_type(*$C$DW$T$57)
    6984                      .dwattr $C$DW$874, DW_AT_name("pidHandle_spd")
    6985                      .dwattr $C$DW$874, DW_AT_TI_symbol_name("_pidHandle_spd")
    6986                      .dwattr $C$DW$874, DW_AT_data_member_location[DW_OP_plus_uconst 0x44]
    6987                      .dwattr $C$DW$874, DW_AT_accessibility(DW_ACCESS_public)
    6988              $C$DW$875       .dwtag  DW_TAG_member
    6989                      .dwattr $C$DW$875, DW_AT_type(*$C$DW$T$58)
    6990                      .dwattr $C$DW$875, DW_AT_name("pid_spd")
    6991                      .dwattr $C$DW$875, DW_AT_TI_symbol_name("_pid_spd")
    6992                      .dwattr $C$DW$875, DW_AT_data_member_location[DW_OP_plus_uconst 0x46]
    6993                      .dwattr $C$DW$875, DW_AT_accessibility(DW_ACCESS_public)
    6994              $C$DW$876       .dwtag  DW_TAG_member
    6995                      .dwattr $C$DW$876, DW_AT_type(*$C$DW$T$60)
    6996                      .dwattr $C$DW$876, DW_AT_name("iparkHandle")
    6997                      .dwattr $C$DW$876, DW_AT_TI_symbol_name("_iparkHandle")
    6998                      .dwattr $C$DW$876, DW_AT_data_member_location[DW_OP_plus_uconst 0x56]
    6999                      .dwattr $C$DW$876, DW_AT_accessibility(DW_ACCESS_public)
    7000              $C$DW$877       .dwtag  DW_TAG_member
    7001                      .dwattr $C$DW$877, DW_AT_type(*$C$DW$T$61)
    7002                      .dwattr $C$DW$877, DW_AT_name("ipark")
    7003                      .dwattr $C$DW$877, DW_AT_TI_symbol_name("_ipark")
    7004                      .dwattr $C$DW$877, DW_AT_data_member_location[DW_OP_plus_uconst 0x58]
    7005                      .dwattr $C$DW$877, DW_AT_accessibility(DW_ACCESS_public)
    7006              $C$DW$878       .dwtag  DW_TAG_member
    7007                      .dwattr $C$DW$878, DW_AT_type(*$C$DW$T$63)
    7008                      .dwattr $C$DW$878, DW_AT_name("svgenHandle")
    7009                      .dwattr $C$DW$878, DW_AT_TI_symbol_name("_svgenHandle")
    7010                      .dwattr $C$DW$878, DW_AT_data_member_location[DW_OP_plus_uconst 0x5c]
    7011                      .dwattr $C$DW$878, DW_AT_accessibility(DW_ACCESS_public)
    7012              $C$DW$879       .dwtag  DW_TAG_member
    7013                      .dwattr $C$DW$879, DW_AT_type(*$C$DW$T$64)
    7014                      .dwattr $C$DW$879, DW_AT_name("svgen")
    7015                      .dwattr $C$DW$879, DW_AT_TI_symbol_name("_svgen")
    7016                      .dwattr $C$DW$879, DW_AT_data_member_location[DW_OP_plus_uconst 0x5e]
    7017                      .dwattr $C$DW$879, DW_AT_accessibility(DW_ACCESS_public)
    7018              $C$DW$880       .dwtag  DW_TAG_member
    7019                      .dwattr $C$DW$880, DW_AT_type(*$C$DW$T$66)
    7020                      .dwattr $C$DW$880, DW_AT_name("trajHandle_Id")
    7021                      .dwattr $C$DW$880, DW_AT_TI_symbol_name("_trajHandle_Id")
    7022                      .dwattr $C$DW$880, DW_AT_data_member_location[DW_OP_plus_uconst 0x60]
    7023                      .dwattr $C$DW$880, DW_AT_accessibility(DW_ACCESS_public)
    7024              $C$DW$881       .dwtag  DW_TAG_member
TMS320C2000 Assembler PC v6.2.5 Sat Sep 16 14:59:17 2017

Tools Copyright (c) 1996-2014 Texas Instruments Incorporated
C:\Users\wmj\AppData\Local\Temp\0328410                              PAGE  138

    7025                      .dwattr $C$DW$881, DW_AT_type(*$C$DW$T$67)
    7026                      .dwattr $C$DW$881, DW_AT_name("traj_Id")
    7027                      .dwattr $C$DW$881, DW_AT_TI_symbol_name("_traj_Id")
    7028                      .dwattr $C$DW$881, DW_AT_data_member_location[DW_OP_plus_uconst 0x62]
    7029                      .dwattr $C$DW$881, DW_AT_accessibility(DW_ACCESS_public)
    7030              $C$DW$882       .dwtag  DW_TAG_member
    7031                      .dwattr $C$DW$882, DW_AT_type(*$C$DW$T$66)
    7032                      .dwattr $C$DW$882, DW_AT_name("trajHandle_spd")
    7033                      .dwattr $C$DW$882, DW_AT_TI_symbol_name("_trajHandle_spd")
    7034                      .dwattr $C$DW$882, DW_AT_data_member_location[DW_OP_plus_uconst 0x6c]
    7035                      .dwattr $C$DW$882, DW_AT_accessibility(DW_ACCESS_public)
    7036              $C$DW$883       .dwtag  DW_TAG_member
    7037                      .dwattr $C$DW$883, DW_AT_type(*$C$DW$T$67)
    7038                      .dwattr $C$DW$883, DW_AT_name("traj_spd")
    7039                      .dwattr $C$DW$883, DW_AT_TI_symbol_name("_traj_spd")
    7040                      .dwattr $C$DW$883, DW_AT_data_member_location[DW_OP_plus_uconst 0x6e]
    7041                      .dwattr $C$DW$883, DW_AT_accessibility(DW_ACCESS_public)
    7042              $C$DW$884       .dwtag  DW_TAG_member
    7043                      .dwattr $C$DW$884, DW_AT_type(*$C$DW$T$66)
    7044                      .dwattr $C$DW$884, DW_AT_name("trajHandle_spdMax")
    7045                      .dwattr $C$DW$884, DW_AT_TI_symbol_name("_trajHandle_spdMax")
    7046                      .dwattr $C$DW$884, DW_AT_data_member_location[DW_OP_plus_uconst 0x78]
    7047                      .dwattr $C$DW$884, DW_AT_accessibility(DW_ACCESS_public)
    7048              $C$DW$885       .dwtag  DW_TAG_member
    7049                      .dwattr $C$DW$885, DW_AT_type(*$C$DW$T$67)
    7050                      .dwattr $C$DW$885, DW_AT_name("traj_spdMax")
    7051                      .dwattr $C$DW$885, DW_AT_TI_symbol_name("_traj_spdMax")
    7052                      .dwattr $C$DW$885, DW_AT_data_member_location[DW_OP_plus_uconst 0x7a]
    7053                      .dwattr $C$DW$885, DW_AT_accessibility(DW_ACCESS_public)
    7054              $C$DW$886       .dwtag  DW_TAG_member
    7055                      .dwattr $C$DW$886, DW_AT_type(*$C$DW$T$68)
    7056                      .dwattr $C$DW$886, DW_AT_name("motorParams")
    7057                      .dwattr $C$DW$886, DW_AT_TI_symbol_name("_motorParams")
    7058                      .dwattr $C$DW$886, DW_AT_data_member_location[DW_OP_plus_uconst 0x84]
    7059                      .dwattr $C$DW$886, DW_AT_accessibility(DW_ACCESS_public)
    7060              $C$DW$887       .dwtag  DW_TAG_member
    7061                      .dwattr $C$DW$887, DW_AT_type(*$C$DW$T$70)
    7062                      .dwattr $C$DW$887, DW_AT_name("waitTimes")
    7063                      .dwattr $C$DW$887, DW_AT_TI_symbol_name("_waitTimes")
    7064                      .dwattr $C$DW$887, DW_AT_data_member_location[DW_OP_plus_uconst 0x92]
    7065                      .dwattr $C$DW$887, DW_AT_accessibility(DW_ACCESS_public)
    7066              $C$DW$888       .dwtag  DW_TAG_member
    7067                      .dwattr $C$DW$888, DW_AT_type(*$C$DW$T$69)
    7068                      .dwattr $C$DW$888, DW_AT_name("counter_state")
    7069                      .dwattr $C$DW$888, DW_AT_TI_symbol_name("_counter_state")
    7070                      .dwattr $C$DW$888, DW_AT_data_member_location[DW_OP_plus_uconst 0x9a]
    7071                      .dwattr $C$DW$888, DW_AT_accessibility(DW_ACCESS_public)
    7072              $C$DW$889       .dwtag  DW_TAG_member
    7073                      .dwattr $C$DW$889, DW_AT_type(*$C$DW$T$71)
    7074                      .dwattr $C$DW$889, DW_AT_name("numIsrTicksPerCtrlTick")
    7075                      .dwattr $C$DW$889, DW_AT_TI_symbol_name("_numIsrTicksPerCtrlTick")
    7076                      .dwattr $C$DW$889, DW_AT_data_member_location[DW_OP_plus_uconst 0x9c]
    7077                      .dwattr $C$DW$889, DW_AT_accessibility(DW_ACCESS_public)
    7078              $C$DW$890       .dwtag  DW_TAG_member
    7079                      .dwattr $C$DW$890, DW_AT_type(*$C$DW$T$71)
TMS320C2000 Assembler PC v6.2.5 Sat Sep 16 14:59:17 2017

Tools Copyright (c) 1996-2014 Texas Instruments Incorporated
C:\Users\wmj\AppData\Local\Temp\0328410                              PAGE  139

    7080                      .dwattr $C$DW$890, DW_AT_name("numCtrlTicksPerCurrentTick")
    7081                      .dwattr $C$DW$890, DW_AT_TI_symbol_name("_numCtrlTicksPerCurrentTick")
    7082                      .dwattr $C$DW$890, DW_AT_data_member_location[DW_OP_plus_uconst 0x9d]
    7083                      .dwattr $C$DW$890, DW_AT_accessibility(DW_ACCESS_public)
    7084              $C$DW$891       .dwtag  DW_TAG_member
    7085                      .dwattr $C$DW$891, DW_AT_type(*$C$DW$T$71)
    7086                      .dwattr $C$DW$891, DW_AT_name("numCtrlTicksPerSpeedTick")
    7087                      .dwattr $C$DW$891, DW_AT_TI_symbol_name("_numCtrlTicksPerSpeedTick")
    7088                      .dwattr $C$DW$891, DW_AT_data_member_location[DW_OP_plus_uconst 0x9e]
    7089                      .dwattr $C$DW$891, DW_AT_accessibility(DW_ACCESS_public)
    7090              $C$DW$892       .dwtag  DW_TAG_member
    7091                      .dwattr $C$DW$892, DW_AT_type(*$C$DW$T$71)
    7092                      .dwattr $C$DW$892, DW_AT_name("numCtrlTicksPerTrajTick")
    7093                      .dwattr $C$DW$892, DW_AT_TI_symbol_name("_numCtrlTicksPerTrajTick")
    7094                      .dwattr $C$DW$892, DW_AT_data_member_location[DW_OP_plus_uconst 0x9f]
    7095                      .dwattr $C$DW$892, DW_AT_accessibility(DW_ACCESS_public)
    7096              $C$DW$893       .dwtag  DW_TAG_member
    7097                      .dwattr $C$DW$893, DW_AT_type(*$C$DW$T$69)
    7098                      .dwattr $C$DW$893, DW_AT_name("ctrlFreq_Hz")
    7099                      .dwattr $C$DW$893, DW_AT_TI_symbol_name("_ctrlFreq_Hz")
    7100                      .dwattr $C$DW$893, DW_AT_data_member_location[DW_OP_plus_uconst 0xa0]
    7101                      .dwattr $C$DW$893, DW_AT_accessibility(DW_ACCESS_public)
    7102              $C$DW$894       .dwtag  DW_TAG_member
    7103                      .dwattr $C$DW$894, DW_AT_type(*$C$DW$T$69)
    7104                      .dwattr $C$DW$894, DW_AT_name("trajFreq_Hz")
    7105                      .dwattr $C$DW$894, DW_AT_TI_symbol_name("_trajFreq_Hz")
    7106                      .dwattr $C$DW$894, DW_AT_data_member_location[DW_OP_plus_uconst 0xa2]
    7107                      .dwattr $C$DW$894, DW_AT_accessibility(DW_ACCESS_public)
    7108              $C$DW$895       .dwtag  DW_TAG_member
    7109                      .dwattr $C$DW$895, DW_AT_type(*$C$DW$T$33)
    7110                      .dwattr $C$DW$895, DW_AT_name("trajPeriod_sec")
    7111                      .dwattr $C$DW$895, DW_AT_TI_symbol_name("_trajPeriod_sec")
    7112                      .dwattr $C$DW$895, DW_AT_data_member_location[DW_OP_plus_uconst 0xa4]
    7113                      .dwattr $C$DW$895, DW_AT_accessibility(DW_ACCESS_public)
    7114              $C$DW$896       .dwtag  DW_TAG_member
    7115                      .dwattr $C$DW$896, DW_AT_type(*$C$DW$T$72)
    7116                      .dwattr $C$DW$896, DW_AT_name("ctrlPeriod_sec")
    7117                      .dwattr $C$DW$896, DW_AT_TI_symbol_name("_ctrlPeriod_sec")
    7118                      .dwattr $C$DW$896, DW_AT_data_member_location[DW_OP_plus_uconst 0xa6]
    7119                      .dwattr $C$DW$896, DW_AT_accessibility(DW_ACCESS_public)
    7120              $C$DW$897       .dwtag  DW_TAG_member
    7121                      .dwattr $C$DW$897, DW_AT_type(*$C$DW$T$33)
    7122                      .dwattr $C$DW$897, DW_AT_name("maxVsMag_pu")
    7123                      .dwattr $C$DW$897, DW_AT_TI_symbol_name("_maxVsMag_pu")
    7124                      .dwattr $C$DW$897, DW_AT_data_member_location[DW_OP_plus_uconst 0xa8]
    7125                      .dwattr $C$DW$897, DW_AT_accessibility(DW_ACCESS_public)
    7126              $C$DW$898       .dwtag  DW_TAG_member
    7127                      .dwattr $C$DW$898, DW_AT_type(*$C$DW$T$73)
    7128                      .dwattr $C$DW$898, DW_AT_name("Iab_in")
    7129                      .dwattr $C$DW$898, DW_AT_TI_symbol_name("_Iab_in")
    7130                      .dwattr $C$DW$898, DW_AT_data_member_location[DW_OP_plus_uconst 0xaa]
    7131                      .dwattr $C$DW$898, DW_AT_accessibility(DW_ACCESS_public)
    7132              $C$DW$899       .dwtag  DW_TAG_member
    7133                      .dwattr $C$DW$899, DW_AT_type(*$C$DW$T$73)
    7134                      .dwattr $C$DW$899, DW_AT_name("Iab_filt")
TMS320C2000 Assembler PC v6.2.5 Sat Sep 16 14:59:17 2017

Tools Copyright (c) 1996-2014 Texas Instruments Incorporated
C:\Users\wmj\AppData\Local\Temp\0328410                              PAGE  140

    7135                      .dwattr $C$DW$899, DW_AT_TI_symbol_name("_Iab_filt")
    7136                      .dwattr $C$DW$899, DW_AT_data_member_location[DW_OP_plus_uconst 0xae]
    7137                      .dwattr $C$DW$899, DW_AT_accessibility(DW_ACCESS_public)
    7138              $C$DW$900       .dwtag  DW_TAG_member
    7139                      .dwattr $C$DW$900, DW_AT_type(*$C$DW$T$73)
    7140                      .dwattr $C$DW$900, DW_AT_name("Idq_in")
    7141                      .dwattr $C$DW$900, DW_AT_TI_symbol_name("_Idq_in")
    7142                      .dwattr $C$DW$900, DW_AT_data_member_location[DW_OP_plus_uconst 0xb2]
    7143                      .dwattr $C$DW$900, DW_AT_accessibility(DW_ACCESS_public)
    7144              $C$DW$901       .dwtag  DW_TAG_member
    7145                      .dwattr $C$DW$901, DW_AT_type(*$C$DW$T$73)
    7146                      .dwattr $C$DW$901, DW_AT_name("Vab_in")
    7147                      .dwattr $C$DW$901, DW_AT_TI_symbol_name("_Vab_in")
    7148                      .dwattr $C$DW$901, DW_AT_data_member_location[DW_OP_plus_uconst 0xb6]
    7149                      .dwattr $C$DW$901, DW_AT_accessibility(DW_ACCESS_public)
    7150              $C$DW$902       .dwtag  DW_TAG_member
    7151                      .dwattr $C$DW$902, DW_AT_type(*$C$DW$T$33)
    7152                      .dwattr $C$DW$902, DW_AT_name("spd_out")
    7153                      .dwattr $C$DW$902, DW_AT_TI_symbol_name("_spd_out")
    7154                      .dwattr $C$DW$902, DW_AT_data_member_location[DW_OP_plus_uconst 0xba]
    7155                      .dwattr $C$DW$902, DW_AT_accessibility(DW_ACCESS_public)
    7156              $C$DW$903       .dwtag  DW_TAG_member
    7157                      .dwattr $C$DW$903, DW_AT_type(*$C$DW$T$73)
    7158                      .dwattr $C$DW$903, DW_AT_name("Vab_out")
    7159                      .dwattr $C$DW$903, DW_AT_TI_symbol_name("_Vab_out")
    7160                      .dwattr $C$DW$903, DW_AT_data_member_location[DW_OP_plus_uconst 0xbc]
    7161                      .dwattr $C$DW$903, DW_AT_accessibility(DW_ACCESS_public)
    7162              $C$DW$904       .dwtag  DW_TAG_member
    7163                      .dwattr $C$DW$904, DW_AT_type(*$C$DW$T$73)
    7164                      .dwattr $C$DW$904, DW_AT_name("Vdq_out")
    7165                      .dwattr $C$DW$904, DW_AT_TI_symbol_name("_Vdq_out")
    7166                      .dwattr $C$DW$904, DW_AT_data_member_location[DW_OP_plus_uconst 0xc0]
    7167                      .dwattr $C$DW$904, DW_AT_accessibility(DW_ACCESS_public)
    7168              $C$DW$905       .dwtag  DW_TAG_member
    7169                      .dwattr $C$DW$905, DW_AT_type(*$C$DW$T$72)
    7170                      .dwattr $C$DW$905, DW_AT_name("Rhf")
    7171                      .dwattr $C$DW$905, DW_AT_TI_symbol_name("_Rhf")
    7172                      .dwattr $C$DW$905, DW_AT_data_member_location[DW_OP_plus_uconst 0xc4]
    7173                      .dwattr $C$DW$905, DW_AT_accessibility(DW_ACCESS_public)
    7174              $C$DW$906       .dwtag  DW_TAG_member
    7175                      .dwattr $C$DW$906, DW_AT_type(*$C$DW$T$72)
    7176                      .dwattr $C$DW$906, DW_AT_name("Lhf")
    7177                      .dwattr $C$DW$906, DW_AT_TI_symbol_name("_Lhf")
    7178                      .dwattr $C$DW$906, DW_AT_data_member_location[DW_OP_plus_uconst 0xc6]
    7179                      .dwattr $C$DW$906, DW_AT_accessibility(DW_ACCESS_public)
    7180              $C$DW$907       .dwtag  DW_TAG_member
    7181                      .dwattr $C$DW$907, DW_AT_type(*$C$DW$T$72)
    7182                      .dwattr $C$DW$907, DW_AT_name("RoverL")
    7183                      .dwattr $C$DW$907, DW_AT_TI_symbol_name("_RoverL")
    7184                      .dwattr $C$DW$907, DW_AT_data_member_location[DW_OP_plus_uconst 0xc8]
    7185                      .dwattr $C$DW$907, DW_AT_accessibility(DW_ACCESS_public)
    7186              $C$DW$908       .dwtag  DW_TAG_member
    7187                      .dwattr $C$DW$908, DW_AT_type(*$C$DW$T$33)
    7188                      .dwattr $C$DW$908, DW_AT_name("Kp_Id")
    7189                      .dwattr $C$DW$908, DW_AT_TI_symbol_name("_Kp_Id")
TMS320C2000 Assembler PC v6.2.5 Sat Sep 16 14:59:17 2017

Tools Copyright (c) 1996-2014 Texas Instruments Incorporated
C:\Users\wmj\AppData\Local\Temp\0328410                              PAGE  141

    7190                      .dwattr $C$DW$908, DW_AT_data_member_location[DW_OP_plus_uconst 0xca]
    7191                      .dwattr $C$DW$908, DW_AT_accessibility(DW_ACCESS_public)
    7192              $C$DW$909       .dwtag  DW_TAG_member
    7193                      .dwattr $C$DW$909, DW_AT_type(*$C$DW$T$33)
    7194                      .dwattr $C$DW$909, DW_AT_name("Kp_Iq")
    7195                      .dwattr $C$DW$909, DW_AT_TI_symbol_name("_Kp_Iq")
    7196                      .dwattr $C$DW$909, DW_AT_data_member_location[DW_OP_plus_uconst 0xcc]
    7197                      .dwattr $C$DW$909, DW_AT_accessibility(DW_ACCESS_public)
    7198              $C$DW$910       .dwtag  DW_TAG_member
    7199                      .dwattr $C$DW$910, DW_AT_type(*$C$DW$T$33)
    7200                      .dwattr $C$DW$910, DW_AT_name("Kp_spd")
    7201                      .dwattr $C$DW$910, DW_AT_TI_symbol_name("_Kp_spd")
    7202                      .dwattr $C$DW$910, DW_AT_data_member_location[DW_OP_plus_uconst 0xce]
    7203                      .dwattr $C$DW$910, DW_AT_accessibility(DW_ACCESS_public)
    7204              $C$DW$911       .dwtag  DW_TAG_member
    7205                      .dwattr $C$DW$911, DW_AT_type(*$C$DW$T$33)
    7206                      .dwattr $C$DW$911, DW_AT_name("Ki_Id")
    7207                      .dwattr $C$DW$911, DW_AT_TI_symbol_name("_Ki_Id")
    7208                      .dwattr $C$DW$911, DW_AT_data_member_location[DW_OP_plus_uconst 0xd0]
    7209                      .dwattr $C$DW$911, DW_AT_accessibility(DW_ACCESS_public)
    7210              $C$DW$912       .dwtag  DW_TAG_member
    7211                      .dwattr $C$DW$912, DW_AT_type(*$C$DW$T$33)
    7212                      .dwattr $C$DW$912, DW_AT_name("Ki_Iq")
    7213                      .dwattr $C$DW$912, DW_AT_TI_symbol_name("_Ki_Iq")
    7214                      .dwattr $C$DW$912, DW_AT_data_member_location[DW_OP_plus_uconst 0xd2]
    7215                      .dwattr $C$DW$912, DW_AT_accessibility(DW_ACCESS_public)
    7216              $C$DW$913       .dwtag  DW_TAG_member
    7217                      .dwattr $C$DW$913, DW_AT_type(*$C$DW$T$33)
    7218                      .dwattr $C$DW$913, DW_AT_name("Ki_spd")
    7219                      .dwattr $C$DW$913, DW_AT_TI_symbol_name("_Ki_spd")
    7220                      .dwattr $C$DW$913, DW_AT_data_member_location[DW_OP_plus_uconst 0xd4]
    7221                      .dwattr $C$DW$913, DW_AT_accessibility(DW_ACCESS_public)
    7222              $C$DW$914       .dwtag  DW_TAG_member
    7223                      .dwattr $C$DW$914, DW_AT_type(*$C$DW$T$33)
    7224                      .dwattr $C$DW$914, DW_AT_name("Kd_Id")
    7225                      .dwattr $C$DW$914, DW_AT_TI_symbol_name("_Kd_Id")
    7226                      .dwattr $C$DW$914, DW_AT_data_member_location[DW_OP_plus_uconst 0xd6]
    7227                      .dwattr $C$DW$914, DW_AT_accessibility(DW_ACCESS_public)
    7228              $C$DW$915       .dwtag  DW_TAG_member
    7229                      .dwattr $C$DW$915, DW_AT_type(*$C$DW$T$33)
    7230                      .dwattr $C$DW$915, DW_AT_name("Kd_Iq")
    7231                      .dwattr $C$DW$915, DW_AT_TI_symbol_name("_Kd_Iq")
    7232                      .dwattr $C$DW$915, DW_AT_data_member_location[DW_OP_plus_uconst 0xd8]
    7233                      .dwattr $C$DW$915, DW_AT_accessibility(DW_ACCESS_public)
    7234              $C$DW$916       .dwtag  DW_TAG_member
    7235                      .dwattr $C$DW$916, DW_AT_type(*$C$DW$T$33)
    7236                      .dwattr $C$DW$916, DW_AT_name("Kd_spd")
    7237                      .dwattr $C$DW$916, DW_AT_TI_symbol_name("_Kd_spd")
    7238                      .dwattr $C$DW$916, DW_AT_data_member_location[DW_OP_plus_uconst 0xda]
    7239                      .dwattr $C$DW$916, DW_AT_accessibility(DW_ACCESS_public)
    7240              $C$DW$917       .dwtag  DW_TAG_member
    7241                      .dwattr $C$DW$917, DW_AT_type(*$C$DW$T$33)
    7242                      .dwattr $C$DW$917, DW_AT_name("Ui_Id")
    7243                      .dwattr $C$DW$917, DW_AT_TI_symbol_name("_Ui_Id")
    7244                      .dwattr $C$DW$917, DW_AT_data_member_location[DW_OP_plus_uconst 0xdc]
TMS320C2000 Assembler PC v6.2.5 Sat Sep 16 14:59:17 2017

Tools Copyright (c) 1996-2014 Texas Instruments Incorporated
C:\Users\wmj\AppData\Local\Temp\0328410                              PAGE  142

    7245                      .dwattr $C$DW$917, DW_AT_accessibility(DW_ACCESS_public)
    7246              $C$DW$918       .dwtag  DW_TAG_member
    7247                      .dwattr $C$DW$918, DW_AT_type(*$C$DW$T$33)
    7248                      .dwattr $C$DW$918, DW_AT_name("Ui_Iq")
    7249                      .dwattr $C$DW$918, DW_AT_TI_symbol_name("_Ui_Iq")
    7250                      .dwattr $C$DW$918, DW_AT_data_member_location[DW_OP_plus_uconst 0xde]
    7251                      .dwattr $C$DW$918, DW_AT_accessibility(DW_ACCESS_public)
    7252              $C$DW$919       .dwtag  DW_TAG_member
    7253                      .dwattr $C$DW$919, DW_AT_type(*$C$DW$T$33)
    7254                      .dwattr $C$DW$919, DW_AT_name("Ui_spd")
    7255                      .dwattr $C$DW$919, DW_AT_TI_symbol_name("_Ui_spd")
    7256                      .dwattr $C$DW$919, DW_AT_data_member_location[DW_OP_plus_uconst 0xe0]
    7257                      .dwattr $C$DW$919, DW_AT_accessibility(DW_ACCESS_public)
    7258              $C$DW$920       .dwtag  DW_TAG_member
    7259                      .dwattr $C$DW$920, DW_AT_type(*$C$DW$T$73)
    7260                      .dwattr $C$DW$920, DW_AT_name("Idq_ref")
    7261                      .dwattr $C$DW$920, DW_AT_TI_symbol_name("_Idq_ref")
    7262                      .dwattr $C$DW$920, DW_AT_data_member_location[DW_OP_plus_uconst 0xe2]
    7263                      .dwattr $C$DW$920, DW_AT_accessibility(DW_ACCESS_public)
    7264              $C$DW$921       .dwtag  DW_TAG_member
    7265                      .dwattr $C$DW$921, DW_AT_type(*$C$DW$T$33)
    7266                      .dwattr $C$DW$921, DW_AT_name("IdRated")
    7267                      .dwattr $C$DW$921, DW_AT_TI_symbol_name("_IdRated")
    7268                      .dwattr $C$DW$921, DW_AT_data_member_location[DW_OP_plus_uconst 0xe6]
    7269                      .dwattr $C$DW$921, DW_AT_accessibility(DW_ACCESS_public)
    7270              $C$DW$922       .dwtag  DW_TAG_member
    7271                      .dwattr $C$DW$922, DW_AT_type(*$C$DW$T$33)
    7272                      .dwattr $C$DW$922, DW_AT_name("spd_ref")
    7273                      .dwattr $C$DW$922, DW_AT_TI_symbol_name("_spd_ref")
    7274                      .dwattr $C$DW$922, DW_AT_data_member_location[DW_OP_plus_uconst 0xe8]
    7275                      .dwattr $C$DW$922, DW_AT_accessibility(DW_ACCESS_public)
    7276              $C$DW$923       .dwtag  DW_TAG_member
    7277                      .dwattr $C$DW$923, DW_AT_type(*$C$DW$T$33)
    7278                      .dwattr $C$DW$923, DW_AT_name("spd_max")
    7279                      .dwattr $C$DW$923, DW_AT_TI_symbol_name("_spd_max")
    7280                      .dwattr $C$DW$923, DW_AT_data_member_location[DW_OP_plus_uconst 0xea]
    7281                      .dwattr $C$DW$923, DW_AT_accessibility(DW_ACCESS_public)
    7282              $C$DW$924       .dwtag  DW_TAG_member
    7283                      .dwattr $C$DW$924, DW_AT_type(*$C$DW$T$71)
    7284                      .dwattr $C$DW$924, DW_AT_name("counter_current")
    7285                      .dwattr $C$DW$924, DW_AT_TI_symbol_name("_counter_current")
    7286                      .dwattr $C$DW$924, DW_AT_data_member_location[DW_OP_plus_uconst 0xec]
    7287                      .dwattr $C$DW$924, DW_AT_accessibility(DW_ACCESS_public)
    7288              $C$DW$925       .dwtag  DW_TAG_member
    7289                      .dwattr $C$DW$925, DW_AT_type(*$C$DW$T$71)
    7290                      .dwattr $C$DW$925, DW_AT_name("counter_isr")
    7291                      .dwattr $C$DW$925, DW_AT_TI_symbol_name("_counter_isr")
    7292                      .dwattr $C$DW$925, DW_AT_data_member_location[DW_OP_plus_uconst 0xed]
    7293                      .dwattr $C$DW$925, DW_AT_accessibility(DW_ACCESS_public)
    7294              $C$DW$926       .dwtag  DW_TAG_member
    7295                      .dwattr $C$DW$926, DW_AT_type(*$C$DW$T$71)
    7296                      .dwattr $C$DW$926, DW_AT_name("counter_speed")
    7297                      .dwattr $C$DW$926, DW_AT_TI_symbol_name("_counter_speed")
    7298                      .dwattr $C$DW$926, DW_AT_data_member_location[DW_OP_plus_uconst 0xee]
    7299                      .dwattr $C$DW$926, DW_AT_accessibility(DW_ACCESS_public)
TMS320C2000 Assembler PC v6.2.5 Sat Sep 16 14:59:17 2017

Tools Copyright (c) 1996-2014 Texas Instruments Incorporated
C:\Users\wmj\AppData\Local\Temp\0328410                              PAGE  143

    7300              $C$DW$927       .dwtag  DW_TAG_member
    7301                      .dwattr $C$DW$927, DW_AT_type(*$C$DW$T$71)
    7302                      .dwattr $C$DW$927, DW_AT_name("counter_traj")
    7303                      .dwattr $C$DW$927, DW_AT_TI_symbol_name("_counter_traj")
    7304                      .dwattr $C$DW$927, DW_AT_data_member_location[DW_OP_plus_uconst 0xef]
    7305                      .dwattr $C$DW$927, DW_AT_accessibility(DW_ACCESS_public)
    7306              $C$DW$928       .dwtag  DW_TAG_member
    7307                      .dwattr $C$DW$928, DW_AT_type(*$C$DW$T$41)
    7308                      .dwattr $C$DW$928, DW_AT_name("flag_enableCtrl")
    7309                      .dwattr $C$DW$928, DW_AT_TI_symbol_name("_flag_enableCtrl")
    7310                      .dwattr $C$DW$928, DW_AT_data_member_location[DW_OP_plus_uconst 0xf0]
    7311                      .dwattr $C$DW$928, DW_AT_accessibility(DW_ACCESS_public)
    7312              $C$DW$929       .dwtag  DW_TAG_member
    7313                      .dwattr $C$DW$929, DW_AT_type(*$C$DW$T$41)
    7314                      .dwattr $C$DW$929, DW_AT_name("flag_enableDcBusComp")
    7315                      .dwattr $C$DW$929, DW_AT_TI_symbol_name("_flag_enableDcBusComp")
    7316                      .dwattr $C$DW$929, DW_AT_data_member_location[DW_OP_plus_uconst 0xf1]
    7317                      .dwattr $C$DW$929, DW_AT_accessibility(DW_ACCESS_public)
    7318              $C$DW$930       .dwtag  DW_TAG_member
    7319                      .dwattr $C$DW$930, DW_AT_type(*$C$DW$T$41)
    7320                      .dwattr $C$DW$930, DW_AT_name("flag_enablePowerWarp")
    7321                      .dwattr $C$DW$930, DW_AT_TI_symbol_name("_flag_enablePowerWarp")
    7322                      .dwattr $C$DW$930, DW_AT_data_member_location[DW_OP_plus_uconst 0xf2]
    7323                      .dwattr $C$DW$930, DW_AT_accessibility(DW_ACCESS_public)
    7324              $C$DW$931       .dwtag  DW_TAG_member
    7325                      .dwattr $C$DW$931, DW_AT_type(*$C$DW$T$41)
    7326                      .dwattr $C$DW$931, DW_AT_name("flag_enableOffset")
    7327                      .dwattr $C$DW$931, DW_AT_TI_symbol_name("_flag_enableOffset")
    7328                      .dwattr $C$DW$931, DW_AT_data_member_location[DW_OP_plus_uconst 0xf3]
    7329                      .dwattr $C$DW$931, DW_AT_accessibility(DW_ACCESS_public)
    7330              $C$DW$932       .dwtag  DW_TAG_member
    7331                      .dwattr $C$DW$932, DW_AT_type(*$C$DW$T$41)
    7332                      .dwattr $C$DW$932, DW_AT_name("flag_enableSpeedCtrl")
    7333                      .dwattr $C$DW$932, DW_AT_TI_symbol_name("_flag_enableSpeedCtrl")
    7334                      .dwattr $C$DW$932, DW_AT_data_member_location[DW_OP_plus_uconst 0xf4]
    7335                      .dwattr $C$DW$932, DW_AT_accessibility(DW_ACCESS_public)
    7336              $C$DW$933       .dwtag  DW_TAG_member
    7337                      .dwattr $C$DW$933, DW_AT_type(*$C$DW$T$41)
    7338                      .dwattr $C$DW$933, DW_AT_name("flag_enableUserMotorParams")
    7339                      .dwattr $C$DW$933, DW_AT_TI_symbol_name("_flag_enableUserMotorParams")
    7340                      .dwattr $C$DW$933, DW_AT_data_member_location[DW_OP_plus_uconst 0xf5]
    7341                      .dwattr $C$DW$933, DW_AT_accessibility(DW_ACCESS_public)
    7342              $C$DW$934       .dwtag  DW_TAG_member
    7343                      .dwattr $C$DW$934, DW_AT_type(*$C$DW$T$73)
    7344                      .dwattr $C$DW$934, DW_AT_name("Idq_offset_pu")
    7345                      .dwattr $C$DW$934, DW_AT_TI_symbol_name("_Idq_offset_pu")
    7346                      .dwattr $C$DW$934, DW_AT_data_member_location[DW_OP_plus_uconst 0xf6]
    7347                      .dwattr $C$DW$934, DW_AT_accessibility(DW_ACCESS_public)
    7348              $C$DW$935       .dwtag  DW_TAG_member
    7349                      .dwattr $C$DW$935, DW_AT_type(*$C$DW$T$73)
    7350                      .dwattr $C$DW$935, DW_AT_name("Vdq_offset_pu")
    7351                      .dwattr $C$DW$935, DW_AT_TI_symbol_name("_Vdq_offset_pu")
    7352                      .dwattr $C$DW$935, DW_AT_data_member_location[DW_OP_plus_uconst 0xfa]
    7353                      .dwattr $C$DW$935, DW_AT_accessibility(DW_ACCESS_public)
    7354              $C$DW$936       .dwtag  DW_TAG_member
TMS320C2000 Assembler PC v6.2.5 Sat Sep 16 14:59:17 2017

Tools Copyright (c) 1996-2014 Texas Instruments Incorporated
C:\Users\wmj\AppData\Local\Temp\0328410                              PAGE  144

    7355                      .dwattr $C$DW$936, DW_AT_type(*$C$DW$T$33)
    7356                      .dwattr $C$DW$936, DW_AT_name("angle_pu")
    7357                      .dwattr $C$DW$936, DW_AT_TI_symbol_name("_angle_pu")
    7358                      .dwattr $C$DW$936, DW_AT_data_member_location[DW_OP_plus_uconst 0xfe]
    7359                      .dwattr $C$DW$936, DW_AT_accessibility(DW_ACCESS_public)
    7360              $C$DW$937       .dwtag  DW_TAG_member
    7361                      .dwattr $C$DW$937, DW_AT_type(*$C$DW$T$33)
    7362                      .dwattr $C$DW$937, DW_AT_name("speed_ref_pu")
    7363                      .dwattr $C$DW$937, DW_AT_TI_symbol_name("_speed_ref_pu")
    7364                      .dwattr $C$DW$937, DW_AT_data_member_location[DW_OP_plus_uconst 0x100]
    7365                      .dwattr $C$DW$937, DW_AT_accessibility(DW_ACCESS_public)
    7366              $C$DW$938       .dwtag  DW_TAG_member
    7367                      .dwattr $C$DW$938, DW_AT_type(*$C$DW$T$33)
    7368                      .dwattr $C$DW$938, DW_AT_name("speed_fb_pu")
    7369                      .dwattr $C$DW$938, DW_AT_TI_symbol_name("_speed_fb_pu")
    7370                      .dwattr $C$DW$938, DW_AT_data_member_location[DW_OP_plus_uconst 0x102]
    7371                      .dwattr $C$DW$938, DW_AT_accessibility(DW_ACCESS_public)
    7372              $C$DW$939       .dwtag  DW_TAG_member
    7373                      .dwattr $C$DW$939, DW_AT_type(*$C$DW$T$33)
    7374                      .dwattr $C$DW$939, DW_AT_name("speed_outMax_pu")
    7375                      .dwattr $C$DW$939, DW_AT_TI_symbol_name("_speed_outMax_pu")
    7376                      .dwattr $C$DW$939, DW_AT_data_member_location[DW_OP_plus_uconst 0x104]
    7377                      .dwattr $C$DW$939, DW_AT_accessibility(DW_ACCESS_public)
    7378              $C$DW$940       .dwtag  DW_TAG_member
    7379                      .dwattr $C$DW$940, DW_AT_type(*$C$DW$T$41)
    7380                      .dwattr $C$DW$940, DW_AT_name("flag_enableCurrentCtrl")
    7381                      .dwattr $C$DW$940, DW_AT_TI_symbol_name("_flag_enableCurrentCtrl")
    7382                      .dwattr $C$DW$940, DW_AT_data_member_location[DW_OP_plus_uconst 0x106]
    7383                      .dwattr $C$DW$940, DW_AT_accessibility(DW_ACCESS_public)
    7384                      .dwendtag $C$DW$T$74
    7385              
    7386              $C$DW$T$328     .dwtag  DW_TAG_typedef, DW_AT_name("CTRL_Obj")
    7387                      .dwattr $C$DW$T$328, DW_AT_type(*$C$DW$T$74)
    7388                      .dwattr $C$DW$T$328, DW_AT_language(DW_LANG_C)
    7389              $C$DW$T$329     .dwtag  DW_TAG_pointer_type
    7390                      .dwattr $C$DW$T$329, DW_AT_type(*$C$DW$T$328)
    7391                      .dwattr $C$DW$T$329, DW_AT_address_class(0x16)
    7392              $C$DW$T$275     .dwtag  DW_TAG_pointer_type
    7393                      .dwattr $C$DW$T$275, DW_AT_type(*$C$DW$T$74)
    7394                      .dwattr $C$DW$T$275, DW_AT_address_class(0x16)
    7395              $C$DW$T$276     .dwtag  DW_TAG_typedef, DW_AT_name("CTRL_Handle")
    7396                      .dwattr $C$DW$T$276, DW_AT_type(*$C$DW$T$275)
    7397                      .dwattr $C$DW$T$276, DW_AT_language(DW_LANG_C)
    7398              $C$DW$941       .dwtag  DW_TAG_TI_far_type
    7399                      .dwattr $C$DW$941, DW_AT_type(*$C$DW$T$276)
    7400              $C$DW$T$330     .dwtag  DW_TAG_const_type
    7401                      .dwattr $C$DW$T$330, DW_AT_type(*$C$DW$941)
    7402              
    7403              $C$DW$T$77      .dwtag  DW_TAG_structure_type
    7404                      .dwattr $C$DW$T$77, DW_AT_name("_CTRL_Version_")
    7405                      .dwattr $C$DW$T$77, DW_AT_byte_size(0x04)
    7406              $C$DW$942       .dwtag  DW_TAG_member
    7407                      .dwattr $C$DW$942, DW_AT_type(*$C$DW$T$24)
    7408                      .dwattr $C$DW$942, DW_AT_name("rsvd")
    7409                      .dwattr $C$DW$942, DW_AT_TI_symbol_name("_rsvd")
TMS320C2000 Assembler PC v6.2.5 Sat Sep 16 14:59:17 2017

Tools Copyright (c) 1996-2014 Texas Instruments Incorporated
C:\Users\wmj\AppData\Local\Temp\0328410                              PAGE  145

    7410                      .dwattr $C$DW$942, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    7411                      .dwattr $C$DW$942, DW_AT_accessibility(DW_ACCESS_public)
    7412              $C$DW$943       .dwtag  DW_TAG_member
    7413                      .dwattr $C$DW$943, DW_AT_type(*$C$DW$T$76)
    7414                      .dwattr $C$DW$943, DW_AT_name("targetProc")
    7415                      .dwattr $C$DW$943, DW_AT_TI_symbol_name("_targetProc")
    7416                      .dwattr $C$DW$943, DW_AT_data_member_location[DW_OP_plus_uconst 0x1]
    7417                      .dwattr $C$DW$943, DW_AT_accessibility(DW_ACCESS_public)
    7418              $C$DW$944       .dwtag  DW_TAG_member
    7419                      .dwattr $C$DW$944, DW_AT_type(*$C$DW$T$24)
    7420                      .dwattr $C$DW$944, DW_AT_name("major")
    7421                      .dwattr $C$DW$944, DW_AT_TI_symbol_name("_major")
    7422                      .dwattr $C$DW$944, DW_AT_data_member_location[DW_OP_plus_uconst 0x2]
    7423                      .dwattr $C$DW$944, DW_AT_accessibility(DW_ACCESS_public)
    7424              $C$DW$945       .dwtag  DW_TAG_member
    7425                      .dwattr $C$DW$945, DW_AT_type(*$C$DW$T$24)
    7426                      .dwattr $C$DW$945, DW_AT_name("minor")
    7427                      .dwattr $C$DW$945, DW_AT_TI_symbol_name("_minor")
    7428                      .dwattr $C$DW$945, DW_AT_data_member_location[DW_OP_plus_uconst 0x3]
    7429                      .dwattr $C$DW$945, DW_AT_accessibility(DW_ACCESS_public)
    7430                      .dwendtag $C$DW$T$77
    7431              
    7432              $C$DW$T$43      .dwtag  DW_TAG_typedef, DW_AT_name("CTRL_Version")
    7433                      .dwattr $C$DW$T$43, DW_AT_type(*$C$DW$T$77)
    7434                      .dwattr $C$DW$T$43, DW_AT_language(DW_LANG_C)
    7435              $C$DW$T$336     .dwtag  DW_TAG_pointer_type
    7436                      .dwattr $C$DW$T$336, DW_AT_type(*$C$DW$T$43)
    7437                      .dwattr $C$DW$T$336, DW_AT_address_class(0x16)
    7438              
    7439              $C$DW$T$84      .dwtag  DW_TAG_structure_type
    7440                      .dwattr $C$DW$T$84, DW_AT_name("_DECODER_Obj_")
    7441                      .dwattr $C$DW$T$84, DW_AT_byte_size(0x06)
    7442              $C$DW$946       .dwtag  DW_TAG_member
    7443                      .dwattr $C$DW$946, DW_AT_type(*$C$DW$T$79)
    7444                      .dwattr $C$DW$946, DW_AT_name("spiHandle")
    7445                      .dwattr $C$DW$946, DW_AT_TI_symbol_name("_spiHandle")
    7446                      .dwattr $C$DW$946, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    7447                      .dwattr $C$DW$946, DW_AT_accessibility(DW_ACCESS_public)
    7448              $C$DW$947       .dwtag  DW_TAG_member
    7449                      .dwattr $C$DW$947, DW_AT_type(*$C$DW$T$81)
    7450                      .dwattr $C$DW$947, DW_AT_name("gpioHandle")
    7451                      .dwattr $C$DW$947, DW_AT_TI_symbol_name("_gpioHandle")
    7452                      .dwattr $C$DW$947, DW_AT_data_member_location[DW_OP_plus_uconst 0x2]
    7453                      .dwattr $C$DW$947, DW_AT_accessibility(DW_ACCESS_public)
    7454              $C$DW$948       .dwtag  DW_TAG_member
    7455                      .dwattr $C$DW$948, DW_AT_type(*$C$DW$T$83)
    7456                      .dwattr $C$DW$948, DW_AT_name("gpioNumber")
    7457                      .dwattr $C$DW$948, DW_AT_TI_symbol_name("_gpioNumber")
    7458                      .dwattr $C$DW$948, DW_AT_data_member_location[DW_OP_plus_uconst 0x4]
    7459                      .dwattr $C$DW$948, DW_AT_accessibility(DW_ACCESS_public)
    7460              $C$DW$949       .dwtag  DW_TAG_member
    7461                      .dwattr $C$DW$949, DW_AT_type(*$C$DW$T$41)
    7462                      .dwattr $C$DW$949, DW_AT_name("RxTimeOut")
    7463                      .dwattr $C$DW$949, DW_AT_TI_symbol_name("_RxTimeOut")
    7464                      .dwattr $C$DW$949, DW_AT_data_member_location[DW_OP_plus_uconst 0x5]
TMS320C2000 Assembler PC v6.2.5 Sat Sep 16 14:59:17 2017

Tools Copyright (c) 1996-2014 Texas Instruments Incorporated
C:\Users\wmj\AppData\Local\Temp\0328410                              PAGE  146

    7465                      .dwattr $C$DW$949, DW_AT_accessibility(DW_ACCESS_public)
    7466                      .dwendtag $C$DW$T$84
    7467              
    7468              $C$DW$T$244     .dwtag  DW_TAG_typedef, DW_AT_name("DECODER_Obj")
    7469                      .dwattr $C$DW$T$244, DW_AT_type(*$C$DW$T$84)
    7470                      .dwattr $C$DW$T$244, DW_AT_language(DW_LANG_C)
    7471              $C$DW$T$242     .dwtag  DW_TAG_pointer_type
    7472                      .dwattr $C$DW$T$242, DW_AT_type(*$C$DW$T$84)
    7473                      .dwattr $C$DW$T$242, DW_AT_address_class(0x16)
    7474              $C$DW$T$243     .dwtag  DW_TAG_typedef, DW_AT_name("DECODER_Handle")
    7475                      .dwattr $C$DW$T$243, DW_AT_type(*$C$DW$T$242)
    7476                      .dwattr $C$DW$T$243, DW_AT_language(DW_LANG_C)
    7477              
    7478              $C$DW$T$85      .dwtag  DW_TAG_structure_type
    7479                      .dwattr $C$DW$T$85, DW_AT_name("_DRIVE_CURRENT_t_")
    7480                      .dwattr $C$DW$T$85, DW_AT_byte_size(0x02)
    7481              $C$DW$950       .dwtag  DW_TAG_member
    7482                      .dwattr $C$DW$950, DW_AT_type(*$C$DW$T$24)
    7483                      .dwattr $C$DW$950, DW_AT_name("IDRIVE")
    7484                      .dwattr $C$DW$950, DW_AT_TI_symbol_name("_IDRIVE")
    7485                      .dwattr $C$DW$950, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    7486                      .dwattr $C$DW$950, DW_AT_accessibility(DW_ACCESS_public)
    7487              $C$DW$951       .dwtag  DW_TAG_member
    7488                      .dwattr $C$DW$951, DW_AT_type(*$C$DW$T$24)
    7489                      .dwattr $C$DW$951, DW_AT_name("INIT_IDRIVE")
    7490                      .dwattr $C$DW$951, DW_AT_TI_symbol_name("_INIT_IDRIVE")
    7491                      .dwattr $C$DW$951, DW_AT_data_member_location[DW_OP_plus_uconst 0x1]
    7492                      .dwattr $C$DW$951, DW_AT_accessibility(DW_ACCESS_public)
    7493                      .dwendtag $C$DW$T$85
    7494              
    7495              $C$DW$T$160     .dwtag  DW_TAG_typedef, DW_AT_name("DRIVE_CURRENT_t_")
    7496                      .dwattr $C$DW$T$160, DW_AT_type(*$C$DW$T$85)
    7497                      .dwattr $C$DW$T$160, DW_AT_language(DW_LANG_C)
    7498              
    7499              $C$DW$T$21      .dwtag  DW_TAG_structure_type
    7500                      .dwattr $C$DW$T$21, DW_AT_name("_EST_Obj_")
    7501                      .dwattr $C$DW$T$21, DW_AT_declaration
    7502                      .dwendtag $C$DW$T$21
    7503              
    7504              $C$DW$T$51      .dwtag  DW_TAG_pointer_type
    7505                      .dwattr $C$DW$T$51, DW_AT_type(*$C$DW$T$21)
    7506                      .dwattr $C$DW$T$51, DW_AT_address_class(0x16)
    7507              $C$DW$T$52      .dwtag  DW_TAG_typedef, DW_AT_name("EST_Handle")
    7508                      .dwattr $C$DW$T$52, DW_AT_type(*$C$DW$T$51)
    7509                      .dwattr $C$DW$T$52, DW_AT_language(DW_LANG_C)
    7510              
    7511              $C$DW$T$86      .dwtag  DW_TAG_structure_type
    7512                      .dwattr $C$DW$T$86, DW_AT_name("_FILTER_FO_")
    7513                      .dwattr $C$DW$T$86, DW_AT_byte_size(0x0a)
    7514              $C$DW$952       .dwtag  DW_TAG_member
    7515                      .dwattr $C$DW$952, DW_AT_type(*$C$DW$T$33)
    7516                      .dwattr $C$DW$952, DW_AT_name("a1")
    7517                      .dwattr $C$DW$952, DW_AT_TI_symbol_name("_a1")
    7518                      .dwattr $C$DW$952, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    7519                      .dwattr $C$DW$952, DW_AT_accessibility(DW_ACCESS_public)
TMS320C2000 Assembler PC v6.2.5 Sat Sep 16 14:59:17 2017

Tools Copyright (c) 1996-2014 Texas Instruments Incorporated
C:\Users\wmj\AppData\Local\Temp\0328410                              PAGE  147

    7520              $C$DW$953       .dwtag  DW_TAG_member
    7521                      .dwattr $C$DW$953, DW_AT_type(*$C$DW$T$33)
    7522                      .dwattr $C$DW$953, DW_AT_name("b0")
    7523                      .dwattr $C$DW$953, DW_AT_TI_symbol_name("_b0")
    7524                      .dwattr $C$DW$953, DW_AT_data_member_location[DW_OP_plus_uconst 0x2]
    7525                      .dwattr $C$DW$953, DW_AT_accessibility(DW_ACCESS_public)
    7526              $C$DW$954       .dwtag  DW_TAG_member
    7527                      .dwattr $C$DW$954, DW_AT_type(*$C$DW$T$33)
    7528                      .dwattr $C$DW$954, DW_AT_name("b1")
    7529                      .dwattr $C$DW$954, DW_AT_TI_symbol_name("_b1")
    7530                      .dwattr $C$DW$954, DW_AT_data_member_location[DW_OP_plus_uconst 0x4]
    7531                      .dwattr $C$DW$954, DW_AT_accessibility(DW_ACCESS_public)
    7532              $C$DW$955       .dwtag  DW_TAG_member
    7533                      .dwattr $C$DW$955, DW_AT_type(*$C$DW$T$33)
    7534                      .dwattr $C$DW$955, DW_AT_name("x1")
    7535                      .dwattr $C$DW$955, DW_AT_TI_symbol_name("_x1")
    7536                      .dwattr $C$DW$955, DW_AT_data_member_location[DW_OP_plus_uconst 0x6]
    7537                      .dwattr $C$DW$955, DW_AT_accessibility(DW_ACCESS_public)
    7538              $C$DW$956       .dwtag  DW_TAG_member
    7539                      .dwattr $C$DW$956, DW_AT_type(*$C$DW$T$33)
    7540                      .dwattr $C$DW$956, DW_AT_name("y1")
    7541                      .dwattr $C$DW$956, DW_AT_TI_symbol_name("_y1")
    7542                      .dwattr $C$DW$956, DW_AT_data_member_location[DW_OP_plus_uconst 0x8]
    7543                      .dwattr $C$DW$956, DW_AT_accessibility(DW_ACCESS_public)
    7544                      .dwendtag $C$DW$T$86
    7545              
    7546              $C$DW$T$203     .dwtag  DW_TAG_typedef, DW_AT_name("FILTER_FO_Obj")
    7547                      .dwattr $C$DW$T$203, DW_AT_type(*$C$DW$T$86)
    7548                      .dwattr $C$DW$T$203, DW_AT_language(DW_LANG_C)
    7549              
    7550              $C$DW$T$22      .dwtag  DW_TAG_structure_type
    7551                      .dwattr $C$DW$T$22, DW_AT_name("_FILTER_FO_Obj_")
    7552                      .dwattr $C$DW$T$22, DW_AT_declaration
    7553                      .dwendtag $C$DW$T$22
    7554              
    7555              $C$DW$T$204     .dwtag  DW_TAG_pointer_type
    7556                      .dwattr $C$DW$T$204, DW_AT_type(*$C$DW$T$22)
    7557                      .dwattr $C$DW$T$204, DW_AT_address_class(0x16)
    7558              $C$DW$T$205     .dwtag  DW_TAG_typedef, DW_AT_name("FILTER_FO_Handle")
    7559                      .dwattr $C$DW$T$205, DW_AT_type(*$C$DW$T$204)
    7560                      .dwattr $C$DW$T$205, DW_AT_language(DW_LANG_C)
    7561              
    7562              $C$DW$T$87      .dwtag  DW_TAG_structure_type
    7563                      .dwattr $C$DW$T$87, DW_AT_name("_FLASH_Obj_")
    7564                      .dwattr $C$DW$T$87, DW_AT_byte_size(0x08)
    7565              $C$DW$957       .dwtag  DW_TAG_member
    7566                      .dwattr $C$DW$957, DW_AT_type(*$C$DW$T$25)
    7567                      .dwattr $C$DW$957, DW_AT_name("FOPT")
    7568                      .dwattr $C$DW$957, DW_AT_TI_symbol_name("_FOPT")
    7569                      .dwattr $C$DW$957, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    7570                      .dwattr $C$DW$957, DW_AT_accessibility(DW_ACCESS_public)
    7571              $C$DW$958       .dwtag  DW_TAG_member
    7572                      .dwattr $C$DW$958, DW_AT_type(*$C$DW$T$25)
    7573                      .dwattr $C$DW$958, DW_AT_name("rsvd_1")
    7574                      .dwattr $C$DW$958, DW_AT_TI_symbol_name("_rsvd_1")
TMS320C2000 Assembler PC v6.2.5 Sat Sep 16 14:59:17 2017

Tools Copyright (c) 1996-2014 Texas Instruments Incorporated
C:\Users\wmj\AppData\Local\Temp\0328410                              PAGE  148

    7575                      .dwattr $C$DW$958, DW_AT_data_member_location[DW_OP_plus_uconst 0x1]
    7576                      .dwattr $C$DW$958, DW_AT_accessibility(DW_ACCESS_public)
    7577              $C$DW$959       .dwtag  DW_TAG_member
    7578                      .dwattr $C$DW$959, DW_AT_type(*$C$DW$T$25)
    7579                      .dwattr $C$DW$959, DW_AT_name("FPWR")
    7580                      .dwattr $C$DW$959, DW_AT_TI_symbol_name("_FPWR")
    7581                      .dwattr $C$DW$959, DW_AT_data_member_location[DW_OP_plus_uconst 0x2]
    7582                      .dwattr $C$DW$959, DW_AT_accessibility(DW_ACCESS_public)
    7583              $C$DW$960       .dwtag  DW_TAG_member
