TMS320C2000 Assembler PC v15.12.3 Wed Nov 22 01:55:17 2017

Tools Copyright (c) 1996-2015 Texas Instruments Incorporated
C:\Users\wmj\AppData\Local\Temp\1727610                              PAGE    1

       1              ;***************************************************************
       2              ;* TMS320C2000 C/C++ Codegen                   PC v15.12.3.LTS *
       3              ;* Date/Time created: Wed Nov 22 01:55:17 2017                 *
       4              ;***************************************************************
       5                      .compiler_opts --abi=coffabi --float_support=softlib --hll_source=on --mem_model:code=flat --mem_mode
       6        0002  FP      .set    XAR2
       7              
       8              $C$DW$CU        .dwtag  DW_TAG_compile_unit
       9                      .dwattr $C$DW$CU, DW_AT_name("C:/Users/wmj/Desktop/BM1000_v1.1/sw/solutions/instaspin/src/proj_bm1000
      10                      .dwattr $C$DW$CU, DW_AT_producer("TI TMS320C2000 C/C++ Codegen PC v15.12.3.LTS Copyright (c) 1996-201
      11                      .dwattr $C$DW$CU, DW_AT_TI_version(0x01)
      12                      .dwattr $C$DW$CU, DW_AT_comp_dir("C:\Users\wmj\Desktop\BM1000_v1.1\sw\solutions\instaspin_foc\boards\
      13              ;**************************************************************
      14              ;* CINIT RECORDS                                              *

C:\Users\wmj\AppData\Local\Temp\1727610                              PAGE   82

    4278              
    4279              $C$DW$560       .dwtag  DW_TAG_enumerator
    4280                      .dwattr $C$DW$560, DW_AT_name("GPIO_Number_36")
    4281                      .dwattr $C$DW$560, DW_AT_const_value(0x24)
    4282              
    4283              $C$DW$561       .dwtag  DW_TAG_enumerator
    4284                      .dwattr $C$DW$561, DW_AT_name("GPIO_Number_37")
    4285                      .dwattr $C$DW$561, DW_AT_const_value(0x25)
    4286              
    4287              $C$DW$562       .dwtag  DW_TAG_enumerator
    4288                      .dwattr $C$DW$562, DW_AT_name("GPIO_Number_38")
    4289                      .dwattr $C$DW$562, DW_AT_const_value(0x26)
    4290              
    4291              $C$DW$563       .dwtag  DW_TAG_enumerator
    4292                      .dwattr $C$DW$563, DW_AT_name("GPIO_numGpios")
    4293                      .dwattr $C$DW$563, DW_AT_const_value(0x27)
    4294              
    4295                      .dwendtag $C$DW$T$251
    4296              
    4297              $C$DW$T$252     .dwtag  DW_TAG_typedef
    4298                      .dwattr $C$DW$T$252, DW_AT_name("GPIO_Number_e")
    4299                      .dwattr $C$DW$T$252, DW_AT_type(*$C$DW$T$251)
    4300                      .dwattr $C$DW$T$252, DW_AT_language(DW_LANG_C)
    4301              
    4302              $C$DW$564       .dwtag  DW_TAG_TI_far_type
    4303                      .dwattr $C$DW$564, DW_AT_type(*$C$DW$T$252)
    4304              
    4305              $C$DW$T$253     .dwtag  DW_TAG_const_type
    4306                      .dwattr $C$DW$T$253, DW_AT_type(*$C$DW$564)
    4307              
    4308              
    4309              $C$DW$T$254     .dwtag  DW_TAG_enumeration_type
    4310                      .dwattr $C$DW$T$254, DW_AT_byte_size(0x01)
    4311              $C$DW$565       .dwtag  DW_TAG_enumerator
    4312                      .dwattr $C$DW$565, DW_AT_name("PIE_GroupNumber_1")
    4313                      .dwattr $C$DW$565, DW_AT_const_value(0x00)
    4314              
    4315              $C$DW$566       .dwtag  DW_TAG_enumerator
    4316                      .dwattr $C$DW$566, DW_AT_name("PIE_GroupNumber_2")
    4317                      .dwattr $C$DW$566, DW_AT_const_value(0x01)
    4318              
    4319              $C$DW$567       .dwtag  DW_TAG_enumerator
    4320                      .dwattr $C$DW$567, DW_AT_name("PIE_GroupNumber_3")
    4321                      .dwattr $C$DW$567, DW_AT_const_value(0x02)
    4322              
    4323              $C$DW$568       .dwtag  DW_TAG_enumerator
    4324                      .dwattr $C$DW$568, DW_AT_name("PIE_GroupNumber_4")
    4325                      .dwattr $C$DW$568, DW_AT_const_value(0x03)
    4326              
    4327              $C$DW$569       .dwtag  DW_TAG_enumerator
    4328                      .dwattr $C$DW$569, DW_AT_name("PIE_GroupNumber_5")
    4329                      .dwattr $C$DW$569, DW_AT_const_value(0x04)
    4330              
    4331              $C$DW$570       .dwtag  DW_TAG_enumerator
    4332                      .dwattr $C$DW$570, DW_AT_name("PIE_GroupNumber_6")
TMS320C2000 Assembler PC v15.12.3 Wed Nov 22 01:55:17 2017

Tools Copyright (c) 1996-2015 Texas Instruments Incorporated
C:\Users\wmj\AppData\Local\Temp\1727610                              PAGE   83

    4333                      .dwattr $C$DW$570, DW_AT_const_value(0x05)
    4334              
    4335              $C$DW$571       .dwtag  DW_TAG_enumerator
    4336                      .dwattr $C$DW$571, DW_AT_name("PIE_GroupNumber_7")
    4337                      .dwattr $C$DW$571, DW_AT_const_value(0x06)
    4338              
    4339              $C$DW$572       .dwtag  DW_TAG_enumerator
    4340                      .dwattr $C$DW$572, DW_AT_name("PIE_GroupNumber_8")
    4341                      .dwattr $C$DW$572, DW_AT_const_value(0x07)
    4342              
    4343              $C$DW$573       .dwtag  DW_TAG_enumerator
    4344                      .dwattr $C$DW$573, DW_AT_name("PIE_GroupNumber_9")
    4345                      .dwattr $C$DW$573, DW_AT_const_value(0x08)
    4346              
    4347              $C$DW$574       .dwtag  DW_TAG_enumerator
    4348                      .dwattr $C$DW$574, DW_AT_name("PIE_GroupNumber_10")
    4349                      .dwattr $C$DW$574, DW_AT_const_value(0x09)
    4350              
    4351              $C$DW$575       .dwtag  DW_TAG_enumerator
    4352                      .dwattr $C$DW$575, DW_AT_name("PIE_GroupNumber_11")
    4353                      .dwattr $C$DW$575, DW_AT_const_value(0x0a)
    4354              
    4355              $C$DW$576       .dwtag  DW_TAG_enumerator
    4356                      .dwattr $C$DW$576, DW_AT_name("PIE_GroupNumber_12")
    4357                      .dwattr $C$DW$576, DW_AT_const_value(0x0b)
    4358              
    4359                      .dwendtag $C$DW$T$254
    4360              
    4361              $C$DW$T$255     .dwtag  DW_TAG_typedef
    4362                      .dwattr $C$DW$T$255, DW_AT_name("PIE_GroupNumber_e")
    4363                      .dwattr $C$DW$T$255, DW_AT_type(*$C$DW$T$254)
    4364                      .dwattr $C$DW$T$255, DW_AT_language(DW_LANG_C)
    4365              
    4366              
    4367              $C$DW$T$30      .dwtag  DW_TAG_structure_type
    4368                      .dwattr $C$DW$T$30, DW_AT_name("_ADC_Obj_")
    4369                      .dwattr $C$DW$T$30, DW_AT_byte_size(0x6650)
    4370              $C$DW$577       .dwtag  DW_TAG_member
    4371                      .dwattr $C$DW$577, DW_AT_type(*$C$DW$T$24)
    4372                      .dwattr $C$DW$577, DW_AT_name("ADCRESULT")
    4373                      .dwattr $C$DW$577, DW_AT_TI_symbol_name("_ADCRESULT")
    4374                      .dwattr $C$DW$577, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    4375                      .dwattr $C$DW$577, DW_AT_accessibility(DW_ACCESS_public)
    4376              
    4377              $C$DW$578       .dwtag  DW_TAG_member
    4378                      .dwattr $C$DW$578, DW_AT_type(*$C$DW$T$25)
    4379                      .dwattr $C$DW$578, DW_AT_name("resvd_1")
    4380                      .dwattr $C$DW$578, DW_AT_TI_symbol_name("_resvd_1")
    4381                      .dwattr $C$DW$578, DW_AT_data_member_location[DW_OP_plus_uconst 0x10]
    4382                      .dwattr $C$DW$578, DW_AT_accessibility(DW_ACCESS_public)
    4383              
    4384              $C$DW$579       .dwtag  DW_TAG_member
    4385                      .dwattr $C$DW$579, DW_AT_type(*$C$DW$T$23)
    4386                      .dwattr $C$DW$579, DW_AT_name("ADCCTL1")
    4387                      .dwattr $C$DW$579, DW_AT_TI_symbol_name("_ADCCTL1")
TMS320C2000 Assembler PC v15.12.3 Wed Nov 22 01:55:17 2017

Tools Copyright (c) 1996-2015 Texas Instruments Incorporated
C:\Users\wmj\AppData\Local\Temp\1727610                              PAGE   84

    4388                      .dwattr $C$DW$579, DW_AT_data_member_location[DW_OP_plus_uconst 0x6600]
    4389                      .dwattr $C$DW$579, DW_AT_accessibility(DW_ACCESS_public)
    4390              
    4391              $C$DW$580       .dwtag  DW_TAG_member
    4392                      .dwattr $C$DW$580, DW_AT_type(*$C$DW$T$23)
    4393                      .dwattr $C$DW$580, DW_AT_name("ADCCTL2")
    4394                      .dwattr $C$DW$580, DW_AT_TI_symbol_name("_ADCCTL2")
    4395                      .dwattr $C$DW$580, DW_AT_data_member_location[DW_OP_plus_uconst 0x6601]
    4396                      .dwattr $C$DW$580, DW_AT_accessibility(DW_ACCESS_public)
    4397              
    4398              $C$DW$581       .dwtag  DW_TAG_member
    4399                      .dwattr $C$DW$581, DW_AT_type(*$C$DW$T$26)
    4400                      .dwattr $C$DW$581, DW_AT_name("rsvd_2")
    4401                      .dwattr $C$DW$581, DW_AT_TI_symbol_name("_rsvd_2")
    4402                      .dwattr $C$DW$581, DW_AT_data_member_location[DW_OP_plus_uconst 0x6602]
    4403                      .dwattr $C$DW$581, DW_AT_accessibility(DW_ACCESS_public)
    4404              
    4405              $C$DW$582       .dwtag  DW_TAG_member
    4406                      .dwattr $C$DW$582, DW_AT_type(*$C$DW$T$23)
    4407                      .dwattr $C$DW$582, DW_AT_name("ADCINTFLG")
    4408                      .dwattr $C$DW$582, DW_AT_TI_symbol_name("_ADCINTFLG")
    4409                      .dwattr $C$DW$582, DW_AT_data_member_location[DW_OP_plus_uconst 0x6604]
    4410                      .dwattr $C$DW$582, DW_AT_accessibility(DW_ACCESS_public)
    4411              
    4412              $C$DW$583       .dwtag  DW_TAG_member
    4413                      .dwattr $C$DW$583, DW_AT_type(*$C$DW$T$23)
    4414                      .dwattr $C$DW$583, DW_AT_name("ADCINTFLGCLR")
    4415                      .dwattr $C$DW$583, DW_AT_TI_symbol_name("_ADCINTFLGCLR")
    4416                      .dwattr $C$DW$583, DW_AT_data_member_location[DW_OP_plus_uconst 0x6605]
    4417                      .dwattr $C$DW$583, DW_AT_accessibility(DW_ACCESS_public)
    4418              
    4419              $C$DW$584       .dwtag  DW_TAG_member
    4420                      .dwattr $C$DW$584, DW_AT_type(*$C$DW$T$23)
    4421                      .dwattr $C$DW$584, DW_AT_name("ADCINTOVF")
    4422                      .dwattr $C$DW$584, DW_AT_TI_symbol_name("_ADCINTOVF")
    4423                      .dwattr $C$DW$584, DW_AT_data_member_location[DW_OP_plus_uconst 0x6606]
    4424                      .dwattr $C$DW$584, DW_AT_accessibility(DW_ACCESS_public)
    4425              
    4426              $C$DW$585       .dwtag  DW_TAG_member
    4427                      .dwattr $C$DW$585, DW_AT_type(*$C$DW$T$23)
    4428                      .dwattr $C$DW$585, DW_AT_name("ADCINTOVFCLR")
    4429                      .dwattr $C$DW$585, DW_AT_TI_symbol_name("_ADCINTOVFCLR")
    4430                      .dwattr $C$DW$585, DW_AT_data_member_location[DW_OP_plus_uconst 0x6607]
    4431                      .dwattr $C$DW$585, DW_AT_accessibility(DW_ACCESS_public)
    4432              
    4433              $C$DW$586       .dwtag  DW_TAG_member
    4434                      .dwattr $C$DW$586, DW_AT_type(*$C$DW$T$27)
    4435                      .dwattr $C$DW$586, DW_AT_name("INTSELxNy")
    4436                      .dwattr $C$DW$586, DW_AT_TI_symbol_name("_INTSELxNy")
    4437                      .dwattr $C$DW$586, DW_AT_data_member_location[DW_OP_plus_uconst 0x6608]
    4438                      .dwattr $C$DW$586, DW_AT_accessibility(DW_ACCESS_public)
    4439              
    4440              $C$DW$587       .dwtag  DW_TAG_member
    4441                      .dwattr $C$DW$587, DW_AT_type(*$C$DW$T$28)
    4442                      .dwattr $C$DW$587, DW_AT_name("rsvd_3")
TMS320C2000 Assembler PC v15.12.3 Wed Nov 22 01:55:17 2017

Tools Copyright (c) 1996-2015 Texas Instruments Incorporated
C:\Users\wmj\AppData\Local\Temp\1727610                              PAGE   85

    4443                      .dwattr $C$DW$587, DW_AT_TI_symbol_name("_rsvd_3")
    4444                      .dwattr $C$DW$587, DW_AT_data_member_location[DW_OP_plus_uconst 0x660d]
    4445                      .dwattr $C$DW$587, DW_AT_accessibility(DW_ACCESS_public)
    4446              
    4447              $C$DW$588       .dwtag  DW_TAG_member
    4448                      .dwattr $C$DW$588, DW_AT_type(*$C$DW$T$23)
    4449                      .dwattr $C$DW$588, DW_AT_name("SOCPRICTRL")
    4450                      .dwattr $C$DW$588, DW_AT_TI_symbol_name("_SOCPRICTRL")
    4451                      .dwattr $C$DW$588, DW_AT_data_member_location[DW_OP_plus_uconst 0x6610]
    4452                      .dwattr $C$DW$588, DW_AT_accessibility(DW_ACCESS_public)
    4453              
    4454              $C$DW$589       .dwtag  DW_TAG_member
    4455                      .dwattr $C$DW$589, DW_AT_type(*$C$DW$T$23)
    4456                      .dwattr $C$DW$589, DW_AT_name("rsvd_4")
    4457                      .dwattr $C$DW$589, DW_AT_TI_symbol_name("_rsvd_4")
    4458                      .dwattr $C$DW$589, DW_AT_data_member_location[DW_OP_plus_uconst 0x6611]
    4459                      .dwattr $C$DW$589, DW_AT_accessibility(DW_ACCESS_public)
    4460              
    4461              $C$DW$590       .dwtag  DW_TAG_member
    4462                      .dwattr $C$DW$590, DW_AT_type(*$C$DW$T$23)
    4463                      .dwattr $C$DW$590, DW_AT_name("ADCSAMPLEMODE")
    4464                      .dwattr $C$DW$590, DW_AT_TI_symbol_name("_ADCSAMPLEMODE")
    4465                      .dwattr $C$DW$590, DW_AT_data_member_location[DW_OP_plus_uconst 0x6612]
    4466                      .dwattr $C$DW$590, DW_AT_accessibility(DW_ACCESS_public)
    4467              
    4468              $C$DW$591       .dwtag  DW_TAG_member
    4469                      .dwattr $C$DW$591, DW_AT_type(*$C$DW$T$23)
    4470                      .dwattr $C$DW$591, DW_AT_name("rsvd_5")
    4471                      .dwattr $C$DW$591, DW_AT_TI_symbol_name("_rsvd_5")
    4472                      .dwattr $C$DW$591, DW_AT_data_member_location[DW_OP_plus_uconst 0x6613]
    4473                      .dwattr $C$DW$591, DW_AT_accessibility(DW_ACCESS_public)
    4474              
    4475              $C$DW$592       .dwtag  DW_TAG_member
    4476                      .dwattr $C$DW$592, DW_AT_type(*$C$DW$T$23)
    4477                      .dwattr $C$DW$592, DW_AT_name("ADCINTSOCSEL1")
    4478                      .dwattr $C$DW$592, DW_AT_TI_symbol_name("_ADCINTSOCSEL1")
    4479                      .dwattr $C$DW$592, DW_AT_data_member_location[DW_OP_plus_uconst 0x6614]
    4480                      .dwattr $C$DW$592, DW_AT_accessibility(DW_ACCESS_public)
    4481              
    4482              $C$DW$593       .dwtag  DW_TAG_member
    4483                      .dwattr $C$DW$593, DW_AT_type(*$C$DW$T$23)
    4484                      .dwattr $C$DW$593, DW_AT_name("ADCINTSOCSEL2")
    4485                      .dwattr $C$DW$593, DW_AT_TI_symbol_name("_ADCINTSOCSEL2")
    4486                      .dwattr $C$DW$593, DW_AT_data_member_location[DW_OP_plus_uconst 0x6615]
    4487                      .dwattr $C$DW$593, DW_AT_accessibility(DW_ACCESS_public)
    4488              
    4489              $C$DW$594       .dwtag  DW_TAG_member
    4490                      .dwattr $C$DW$594, DW_AT_type(*$C$DW$T$26)
    4491                      .dwattr $C$DW$594, DW_AT_name("rsvd_6")
    4492                      .dwattr $C$DW$594, DW_AT_TI_symbol_name("_rsvd_6")
    4493                      .dwattr $C$DW$594, DW_AT_data_member_location[DW_OP_plus_uconst 0x6616]
    4494                      .dwattr $C$DW$594, DW_AT_accessibility(DW_ACCESS_public)
    4495              
    4496              $C$DW$595       .dwtag  DW_TAG_member
    4497                      .dwattr $C$DW$595, DW_AT_type(*$C$DW$T$23)
TMS320C2000 Assembler PC v15.12.3 Wed Nov 22 01:55:17 2017

Tools Copyright (c) 1996-2015 Texas Instruments Incorporated
C:\Users\wmj\AppData\Local\Temp\1727610                              PAGE   86

    4498                      .dwattr $C$DW$595, DW_AT_name("ADCSOCFLG1")
    4499                      .dwattr $C$DW$595, DW_AT_TI_symbol_name("_ADCSOCFLG1")
    4500                      .dwattr $C$DW$595, DW_AT_data_member_location[DW_OP_plus_uconst 0x6618]
    4501                      .dwattr $C$DW$595, DW_AT_accessibility(DW_ACCESS_public)
    4502              
    4503              $C$DW$596       .dwtag  DW_TAG_member
    4504                      .dwattr $C$DW$596, DW_AT_type(*$C$DW$T$23)
    4505                      .dwattr $C$DW$596, DW_AT_name("rsvd_7")
    4506                      .dwattr $C$DW$596, DW_AT_TI_symbol_name("_rsvd_7")
    4507                      .dwattr $C$DW$596, DW_AT_data_member_location[DW_OP_plus_uconst 0x6619]
    4508                      .dwattr $C$DW$596, DW_AT_accessibility(DW_ACCESS_public)
    4509              
    4510              $C$DW$597       .dwtag  DW_TAG_member
    4511                      .dwattr $C$DW$597, DW_AT_type(*$C$DW$T$23)
    4512                      .dwattr $C$DW$597, DW_AT_name("ADCSOCFRC1")
    4513                      .dwattr $C$DW$597, DW_AT_TI_symbol_name("_ADCSOCFRC1")
    4514                      .dwattr $C$DW$597, DW_AT_data_member_location[DW_OP_plus_uconst 0x661a]
    4515                      .dwattr $C$DW$597, DW_AT_accessibility(DW_ACCESS_public)
    4516              
    4517              $C$DW$598       .dwtag  DW_TAG_member
    4518                      .dwattr $C$DW$598, DW_AT_type(*$C$DW$T$23)
    4519                      .dwattr $C$DW$598, DW_AT_name("rsvd_8")
    4520                      .dwattr $C$DW$598, DW_AT_TI_symbol_name("_rsvd_8")
    4521                      .dwattr $C$DW$598, DW_AT_data_member_location[DW_OP_plus_uconst 0x661b]
    4522                      .dwattr $C$DW$598, DW_AT_accessibility(DW_ACCESS_public)
    4523              
    4524              $C$DW$599       .dwtag  DW_TAG_member
    4525                      .dwattr $C$DW$599, DW_AT_type(*$C$DW$T$23)
    4526                      .dwattr $C$DW$599, DW_AT_name("ADCSOCOVF1")
    4527                      .dwattr $C$DW$599, DW_AT_TI_symbol_name("_ADCSOCOVF1")
    4528                      .dwattr $C$DW$599, DW_AT_data_member_location[DW_OP_plus_uconst 0x661c]
    4529                      .dwattr $C$DW$599, DW_AT_accessibility(DW_ACCESS_public)
    4530              
    4531              $C$DW$600       .dwtag  DW_TAG_member
    4532                      .dwattr $C$DW$600, DW_AT_type(*$C$DW$T$23)
    4533                      .dwattr $C$DW$600, DW_AT_name("rsvd_9")
    4534                      .dwattr $C$DW$600, DW_AT_TI_symbol_name("_rsvd_9")
    4535                      .dwattr $C$DW$600, DW_AT_data_member_location[DW_OP_plus_uconst 0x661d]
    4536                      .dwattr $C$DW$600, DW_AT_accessibility(DW_ACCESS_public)
    4537              
    4538              $C$DW$601       .dwtag  DW_TAG_member
    4539                      .dwattr $C$DW$601, DW_AT_type(*$C$DW$T$23)
    4540                      .dwattr $C$DW$601, DW_AT_name("ADCSOCOVFCLR1")
    4541                      .dwattr $C$DW$601, DW_AT_TI_symbol_name("_ADCSOCOVFCLR1")
    4542                      .dwattr $C$DW$601, DW_AT_data_member_location[DW_OP_plus_uconst 0x661e]
    4543                      .dwattr $C$DW$601, DW_AT_accessibility(DW_ACCESS_public)
    4544              
    4545              $C$DW$602       .dwtag  DW_TAG_member
    4546                      .dwattr $C$DW$602, DW_AT_type(*$C$DW$T$23)
    4547                      .dwattr $C$DW$602, DW_AT_name("rsvd_10")
    4548                      .dwattr $C$DW$602, DW_AT_TI_symbol_name("_rsvd_10")
    4549                      .dwattr $C$DW$602, DW_AT_data_member_location[DW_OP_plus_uconst 0x661f]
    4550                      .dwattr $C$DW$602, DW_AT_accessibility(DW_ACCESS_public)
    4551              
    4552              $C$DW$603       .dwtag  DW_TAG_member
TMS320C2000 Assembler PC v15.12.3 Wed Nov 22 01:55:17 2017

Tools Copyright (c) 1996-2015 Texas Instruments Incorporated
C:\Users\wmj\AppData\Local\Temp\1727610                              PAGE   87

    4553                      .dwattr $C$DW$603, DW_AT_type(*$C$DW$T$24)
    4554                      .dwattr $C$DW$603, DW_AT_name("ADCSOCxCTL")
    4555                      .dwattr $C$DW$603, DW_AT_TI_symbol_name("_ADCSOCxCTL")
    4556                      .dwattr $C$DW$603, DW_AT_data_member_location[DW_OP_plus_uconst 0x6620]
    4557                      .dwattr $C$DW$603, DW_AT_accessibility(DW_ACCESS_public)
    4558              
    4559              $C$DW$604       .dwtag  DW_TAG_member
    4560                      .dwattr $C$DW$604, DW_AT_type(*$C$DW$T$24)
    4561                      .dwattr $C$DW$604, DW_AT_name("rsvd_11")
    4562                      .dwattr $C$DW$604, DW_AT_TI_symbol_name("_rsvd_11")
    4563                      .dwattr $C$DW$604, DW_AT_data_member_location[DW_OP_plus_uconst 0x6630]
    4564                      .dwattr $C$DW$604, DW_AT_accessibility(DW_ACCESS_public)
    4565              
    4566              $C$DW$605       .dwtag  DW_TAG_member
    4567                      .dwattr $C$DW$605, DW_AT_type(*$C$DW$T$23)
    4568                      .dwattr $C$DW$605, DW_AT_name("ADCREFTRIM")
    4569                      .dwattr $C$DW$605, DW_AT_TI_symbol_name("_ADCREFTRIM")
    4570                      .dwattr $C$DW$605, DW_AT_data_member_location[DW_OP_plus_uconst 0x6640]
    4571                      .dwattr $C$DW$605, DW_AT_accessibility(DW_ACCESS_public)
    4572              
    4573              $C$DW$606       .dwtag  DW_TAG_member
    4574                      .dwattr $C$DW$606, DW_AT_type(*$C$DW$T$23)
    4575                      .dwattr $C$DW$606, DW_AT_name("ADCOFFTRIM")
    4576                      .dwattr $C$DW$606, DW_AT_TI_symbol_name("_ADCOFFTRIM")
    4577                      .dwattr $C$DW$606, DW_AT_data_member_location[DW_OP_plus_uconst 0x6641]
    4578                      .dwattr $C$DW$606, DW_AT_accessibility(DW_ACCESS_public)
    4579              
    4580              $C$DW$607       .dwtag  DW_TAG_member
    4581                      .dwattr $C$DW$607, DW_AT_type(*$C$DW$T$29)
    4582                      .dwattr $C$DW$607, DW_AT_name("resvd_12")
    4583                      .dwattr $C$DW$607, DW_AT_TI_symbol_name("_resvd_12")
    4584                      .dwattr $C$DW$607, DW_AT_data_member_location[DW_OP_plus_uconst 0x6642]
    4585                      .dwattr $C$DW$607, DW_AT_accessibility(DW_ACCESS_public)
    4586              
    4587              $C$DW$608       .dwtag  DW_TAG_member
    4588                      .dwattr $C$DW$608, DW_AT_type(*$C$DW$T$23)
    4589                      .dwattr $C$DW$608, DW_AT_name("ADCREV")
    4590                      .dwattr $C$DW$608, DW_AT_TI_symbol_name("_ADCREV")
    4591                      .dwattr $C$DW$608, DW_AT_data_member_location[DW_OP_plus_uconst 0x664f]
    4592                      .dwattr $C$DW$608, DW_AT_accessibility(DW_ACCESS_public)
    4593              
    4594                      .dwendtag $C$DW$T$30
    4595              
    4596              $C$DW$T$257     .dwtag  DW_TAG_typedef
    4597                      .dwattr $C$DW$T$257, DW_AT_name("ADC_Obj")
    4598                      .dwattr $C$DW$T$257, DW_AT_type(*$C$DW$T$30)
    4599                      .dwattr $C$DW$T$257, DW_AT_language(DW_LANG_C)
    4600              
    4601              $C$DW$T$118     .dwtag  DW_TAG_pointer_type
    4602                      .dwattr $C$DW$T$118, DW_AT_type(*$C$DW$T$30)
    4603                      .dwattr $C$DW$T$118, DW_AT_address_class(0x20)
    4604              
    4605              $C$DW$T$119     .dwtag  DW_TAG_typedef
    4606                      .dwattr $C$DW$T$119, DW_AT_name("ADC_Handle")
    4607                      .dwattr $C$DW$T$119, DW_AT_type(*$C$DW$T$118)
TMS320C2000 Assembler PC v15.12.3 Wed Nov 22 01:55:17 2017

Tools Copyright (c) 1996-2015 Texas Instruments Incorporated
C:\Users\wmj\AppData\Local\Temp\1727610                              PAGE   88

    4608                      .dwattr $C$DW$T$119, DW_AT_language(DW_LANG_C)
    4609              
    4610              
    4611              $C$DW$T$34      .dwtag  DW_TAG_structure_type
    4612                      .dwattr $C$DW$T$34, DW_AT_name("_BRAKE_Obj_")
    4613                      .dwattr $C$DW$T$34, DW_AT_byte_size(0x08)
    4614              $C$DW$609       .dwtag  DW_TAG_member
    4615                      .dwattr $C$DW$609, DW_AT_type(*$C$DW$T$31)
    4616                      .dwattr $C$DW$609, DW_AT_name("angle_pu")
    4617                      .dwattr $C$DW$609, DW_AT_TI_symbol_name("_angle_pu")
    4618                      .dwattr $C$DW$609, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    4619                      .dwattr $C$DW$609, DW_AT_accessibility(DW_ACCESS_public)
    4620              
    4621              $C$DW$610       .dwtag  DW_TAG_member
    4622                      .dwattr $C$DW$610, DW_AT_type(*$C$DW$T$32)
    4623                      .dwattr $C$DW$610, DW_AT_name("Idq_brake")
    4624                      .dwattr $C$DW$610, DW_AT_TI_symbol_name("_Idq_brake")
    4625                      .dwattr $C$DW$610, DW_AT_data_member_location[DW_OP_plus_uconst 0x2]
    4626                      .dwattr $C$DW$610, DW_AT_accessibility(DW_ACCESS_public)
    4627              
    4628              $C$DW$611       .dwtag  DW_TAG_member
    4629                      .dwattr $C$DW$611, DW_AT_type(*$C$DW$T$33)
    4630                      .dwattr $C$DW$611, DW_AT_name("brake_enable")
    4631                      .dwattr $C$DW$611, DW_AT_TI_symbol_name("_brake_enable")
    4632                      .dwattr $C$DW$611, DW_AT_data_member_location[DW_OP_plus_uconst 0x6]
    4633                      .dwattr $C$DW$611, DW_AT_accessibility(DW_ACCESS_public)
    4634              
    4635                      .dwendtag $C$DW$T$34
    4636              
    4637              $C$DW$T$73      .dwtag  DW_TAG_typedef
    4638                      .dwattr $C$DW$T$73, DW_AT_name("BRAKE_Obj")
    4639                      .dwattr $C$DW$T$73, DW_AT_type(*$C$DW$T$34)
    4640                      .dwattr $C$DW$T$73, DW_AT_language(DW_LANG_C)
    4641              
    4642              $C$DW$T$71      .dwtag  DW_TAG_pointer_type
    4643                      .dwattr $C$DW$T$71, DW_AT_type(*$C$DW$T$34)
    4644                      .dwattr $C$DW$T$71, DW_AT_address_class(0x20)
    4645              
    4646              $C$DW$T$72      .dwtag  DW_TAG_typedef
    4647                      .dwattr $C$DW$T$72, DW_AT_name("BRAKE_Handle")
    4648                      .dwattr $C$DW$T$72, DW_AT_type(*$C$DW$T$71)
    4649                      .dwattr $C$DW$T$72, DW_AT_language(DW_LANG_C)
    4650              
    4651              
    4652              $C$DW$T$36      .dwtag  DW_TAG_structure_type
    4653                      .dwattr $C$DW$T$36, DW_AT_name("_CLARKE_Obj_")
    4654                      .dwattr $C$DW$T$36, DW_AT_byte_size(0x06)
    4655              $C$DW$612       .dwtag  DW_TAG_member
    4656                      .dwattr $C$DW$612, DW_AT_type(*$C$DW$T$31)
    4657                      .dwattr $C$DW$612, DW_AT_name("alpha_sf")
    4658                      .dwattr $C$DW$612, DW_AT_TI_symbol_name("_alpha_sf")
    4659                      .dwattr $C$DW$612, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    4660                      .dwattr $C$DW$612, DW_AT_accessibility(DW_ACCESS_public)
    4661              
    4662              $C$DW$613       .dwtag  DW_TAG_member
TMS320C2000 Assembler PC v15.12.3 Wed Nov 22 01:55:17 2017

Tools Copyright (c) 1996-2015 Texas Instruments Incorporated
C:\Users\wmj\AppData\Local\Temp\1727610                              PAGE   89

    4663                      .dwattr $C$DW$613, DW_AT_type(*$C$DW$T$31)
    4664                      .dwattr $C$DW$613, DW_AT_name("beta_sf")
    4665                      .dwattr $C$DW$613, DW_AT_TI_symbol_name("_beta_sf")
    4666                      .dwattr $C$DW$613, DW_AT_data_member_location[DW_OP_plus_uconst 0x2]
    4667                      .dwattr $C$DW$613, DW_AT_accessibility(DW_ACCESS_public)
    4668              
    4669              $C$DW$614       .dwtag  DW_TAG_member
    4670                      .dwattr $C$DW$614, DW_AT_type(*$C$DW$T$35)
    4671                      .dwattr $C$DW$614, DW_AT_name("numSensors")
    4672                      .dwattr $C$DW$614, DW_AT_TI_symbol_name("_numSensors")
    4673                      .dwattr $C$DW$614, DW_AT_data_member_location[DW_OP_plus_uconst 0x4]
    4674                      .dwattr $C$DW$614, DW_AT_accessibility(DW_ACCESS_public)
    4675              
    4676                      .dwendtag $C$DW$T$36
    4677              
    4678              $C$DW$T$47      .dwtag  DW_TAG_typedef
    4679                      .dwattr $C$DW$T$47, DW_AT_name("CLARKE_Obj")
    4680                      .dwattr $C$DW$T$47, DW_AT_type(*$C$DW$T$36)
    4681                      .dwattr $C$DW$T$47, DW_AT_language(DW_LANG_C)
    4682              
    4683              $C$DW$T$45      .dwtag  DW_TAG_pointer_type
    4684                      .dwattr $C$DW$T$45, DW_AT_type(*$C$DW$T$36)
    4685                      .dwattr $C$DW$T$45, DW_AT_address_class(0x20)
    4686              
    4687              $C$DW$T$46      .dwtag  DW_TAG_typedef
    4688                      .dwattr $C$DW$T$46, DW_AT_name("CLARKE_Handle")
    4689                      .dwattr $C$DW$T$46, DW_AT_type(*$C$DW$T$45)
    4690                      .dwattr $C$DW$T$46, DW_AT_language(DW_LANG_C)
    4691              
    4692              
    4693              $C$DW$T$38      .dwtag  DW_TAG_structure_type
    4694                      .dwattr $C$DW$T$38, DW_AT_name("_CLK_Obj_")
    4695                      .dwattr $C$DW$T$38, DW_AT_byte_size(0x11)
    4696              $C$DW$615       .dwtag  DW_TAG_member
    4697                      .dwattr $C$DW$615, DW_AT_type(*$C$DW$T$23)
    4698                      .dwattr $C$DW$615, DW_AT_name("XCLK")
    4699                      .dwattr $C$DW$615, DW_AT_TI_symbol_name("_XCLK")
    4700                      .dwattr $C$DW$615, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    4701                      .dwattr $C$DW$615, DW_AT_accessibility(DW_ACCESS_public)
    4702              
    4703              $C$DW$616       .dwtag  DW_TAG_member
    4704                      .dwattr $C$DW$616, DW_AT_type(*$C$DW$T$23)
    4705                      .dwattr $C$DW$616, DW_AT_name("rsvd_1")
    4706                      .dwattr $C$DW$616, DW_AT_TI_symbol_name("_rsvd_1")
    4707                      .dwattr $C$DW$616, DW_AT_data_member_location[DW_OP_plus_uconst 0x1]
    4708                      .dwattr $C$DW$616, DW_AT_accessibility(DW_ACCESS_public)
    4709              
    4710              $C$DW$617       .dwtag  DW_TAG_member
    4711                      .dwattr $C$DW$617, DW_AT_type(*$C$DW$T$23)
    4712                      .dwattr $C$DW$617, DW_AT_name("CLKCTL")
    4713                      .dwattr $C$DW$617, DW_AT_TI_symbol_name("_CLKCTL")
    4714                      .dwattr $C$DW$617, DW_AT_data_member_location[DW_OP_plus_uconst 0x2]
    4715                      .dwattr $C$DW$617, DW_AT_accessibility(DW_ACCESS_public)
    4716              
    4717              $C$DW$618       .dwtag  DW_TAG_member
TMS320C2000 Assembler PC v15.12.3 Wed Nov 22 01:55:17 2017

Tools Copyright (c) 1996-2015 Texas Instruments Incorporated
C:\Users\wmj\AppData\Local\Temp\1727610                              PAGE   90

    4718                      .dwattr $C$DW$618, DW_AT_type(*$C$DW$T$37)
    4719                      .dwattr $C$DW$618, DW_AT_name("rsvd_2")
    4720                      .dwattr $C$DW$618, DW_AT_TI_symbol_name("_rsvd_2")
    4721                      .dwattr $C$DW$618, DW_AT_data_member_location[DW_OP_plus_uconst 0x3]
    4722                      .dwattr $C$DW$618, DW_AT_accessibility(DW_ACCESS_public)
    4723              
    4724              $C$DW$619       .dwtag  DW_TAG_member
    4725                      .dwattr $C$DW$619, DW_AT_type(*$C$DW$T$23)
    4726                      .dwattr $C$DW$619, DW_AT_name("LOSPCP")
    4727                      .dwattr $C$DW$619, DW_AT_TI_symbol_name("_LOSPCP")
    4728                      .dwattr $C$DW$619, DW_AT_data_member_location[DW_OP_plus_uconst 0xb]
    4729                      .dwattr $C$DW$619, DW_AT_accessibility(DW_ACCESS_public)
    4730              
    4731              $C$DW$620       .dwtag  DW_TAG_member
    4732                      .dwattr $C$DW$620, DW_AT_type(*$C$DW$T$23)
    4733                      .dwattr $C$DW$620, DW_AT_name("PCLKCR0")
    4734                      .dwattr $C$DW$620, DW_AT_TI_symbol_name("_PCLKCR0")
    4735                      .dwattr $C$DW$620, DW_AT_data_member_location[DW_OP_plus_uconst 0xc]
    4736                      .dwattr $C$DW$620, DW_AT_accessibility(DW_ACCESS_public)
    4737              
    4738              $C$DW$621       .dwtag  DW_TAG_member
    4739                      .dwattr $C$DW$621, DW_AT_type(*$C$DW$T$23)
    4740                      .dwattr $C$DW$621, DW_AT_name("PCLKCR1")
    4741                      .dwattr $C$DW$621, DW_AT_TI_symbol_name("_PCLKCR1")
    4742                      .dwattr $C$DW$621, DW_AT_data_member_location[DW_OP_plus_uconst 0xd]
    4743                      .dwattr $C$DW$621, DW_AT_accessibility(DW_ACCESS_public)
    4744              
    4745              $C$DW$622       .dwtag  DW_TAG_member
    4746                      .dwattr $C$DW$622, DW_AT_type(*$C$DW$T$26)
    4747                      .dwattr $C$DW$622, DW_AT_name("rsvd_3")
    4748                      .dwattr $C$DW$622, DW_AT_TI_symbol_name("_rsvd_3")
    4749                      .dwattr $C$DW$622, DW_AT_data_member_location[DW_OP_plus_uconst 0xe]
    4750                      .dwattr $C$DW$622, DW_AT_accessibility(DW_ACCESS_public)
    4751              
    4752              $C$DW$623       .dwtag  DW_TAG_member
    4753                      .dwattr $C$DW$623, DW_AT_type(*$C$DW$T$23)
    4754                      .dwattr $C$DW$623, DW_AT_name("PCLKCR3")
    4755                      .dwattr $C$DW$623, DW_AT_TI_symbol_name("_PCLKCR3")
    4756                      .dwattr $C$DW$623, DW_AT_data_member_location[DW_OP_plus_uconst 0x10]
    4757                      .dwattr $C$DW$623, DW_AT_accessibility(DW_ACCESS_public)
    4758              
    4759                      .dwendtag $C$DW$T$38
    4760              
    4761              $C$DW$T$120     .dwtag  DW_TAG_pointer_type
    4762                      .dwattr $C$DW$T$120, DW_AT_type(*$C$DW$T$38)
    4763                      .dwattr $C$DW$T$120, DW_AT_address_class(0x20)
    4764              
    4765              $C$DW$T$121     .dwtag  DW_TAG_typedef
    4766                      .dwattr $C$DW$T$121, DW_AT_name("CLK_Handle")
    4767                      .dwattr $C$DW$T$121, DW_AT_type(*$C$DW$T$120)
    4768                      .dwattr $C$DW$T$121, DW_AT_language(DW_LANG_C)
    4769              
    4770              
    4771              $C$DW$T$39      .dwtag  DW_TAG_structure_type
    4772                      .dwattr $C$DW$T$39, DW_AT_name("_CPU_Obj_")
TMS320C2000 Assembler PC v15.12.3 Wed Nov 22 01:55:17 2017

Tools Copyright (c) 1996-2015 Texas Instruments Incorporated
C:\Users\wmj\AppData\Local\Temp\1727610                              PAGE   91

    4773                      .dwattr $C$DW$T$39, DW_AT_byte_size(0x01)
    4774              $C$DW$624       .dwtag  DW_TAG_member
    4775                      .dwattr $C$DW$624, DW_AT_type(*$C$DW$T$35)
    4776                      .dwattr $C$DW$624, DW_AT_name("tmp")
    4777                      .dwattr $C$DW$624, DW_AT_TI_symbol_name("_tmp")
    4778                      .dwattr $C$DW$624, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    4779                      .dwattr $C$DW$624, DW_AT_accessibility(DW_ACCESS_public)
    4780              
    4781                      .dwendtag $C$DW$T$39
    4782              
    4783              $C$DW$T$122     .dwtag  DW_TAG_pointer_type
    4784                      .dwattr $C$DW$T$122, DW_AT_type(*$C$DW$T$39)
    4785                      .dwattr $C$DW$T$122, DW_AT_address_class(0x20)
    4786              
    4787              $C$DW$T$123     .dwtag  DW_TAG_typedef
    4788                      .dwattr $C$DW$T$123, DW_AT_name("CPU_Handle")
    4789                      .dwattr $C$DW$T$123, DW_AT_type(*$C$DW$T$122)
    4790                      .dwattr $C$DW$T$123, DW_AT_language(DW_LANG_C)
    4791              
    4792              
    4793              $C$DW$T$74      .dwtag  DW_TAG_structure_type
    4794                      .dwattr $C$DW$T$74, DW_AT_name("_CTRL_Obj_")
    4795                      .dwattr $C$DW$T$74, DW_AT_byte_size(0x108)
    4796              $C$DW$625       .dwtag  DW_TAG_member
    4797                      .dwattr $C$DW$625, DW_AT_type(*$C$DW$T$40)
    4798                      .dwattr $C$DW$625, DW_AT_name("version")
    4799                      .dwattr $C$DW$625, DW_AT_TI_symbol_name("_version")
    4800                      .dwattr $C$DW$625, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    4801                      .dwattr $C$DW$625, DW_AT_accessibility(DW_ACCESS_public)
    4802              
    4803              $C$DW$626       .dwtag  DW_TAG_member
    4804                      .dwattr $C$DW$626, DW_AT_type(*$C$DW$T$42)
    4805                      .dwattr $C$DW$626, DW_AT_name("state")
    4806                      .dwattr $C$DW$626, DW_AT_TI_symbol_name("_state")
    4807                      .dwattr $C$DW$626, DW_AT_data_member_location[DW_OP_plus_uconst 0x4]
    4808                      .dwattr $C$DW$626, DW_AT_accessibility(DW_ACCESS_public)
    4809              
    4810              $C$DW$627       .dwtag  DW_TAG_member
    4811                      .dwattr $C$DW$627, DW_AT_type(*$C$DW$T$42)
    4812                      .dwattr $C$DW$627, DW_AT_name("prevState")
    4813                      .dwattr $C$DW$627, DW_AT_TI_symbol_name("_prevState")
    4814                      .dwattr $C$DW$627, DW_AT_data_member_location[DW_OP_plus_uconst 0x5]
    4815                      .dwattr $C$DW$627, DW_AT_accessibility(DW_ACCESS_public)
    4816              
    4817              $C$DW$628       .dwtag  DW_TAG_member
    4818                      .dwattr $C$DW$628, DW_AT_type(*$C$DW$T$44)
    4819                      .dwattr $C$DW$628, DW_AT_name("errorCode")
    4820                      .dwattr $C$DW$628, DW_AT_TI_symbol_name("_errorCode")
    4821                      .dwattr $C$DW$628, DW_AT_data_member_location[DW_OP_plus_uconst 0x6]
    4822                      .dwattr $C$DW$628, DW_AT_accessibility(DW_ACCESS_public)
    4823              
    4824              $C$DW$629       .dwtag  DW_TAG_member
    4825                      .dwattr $C$DW$629, DW_AT_type(*$C$DW$T$46)
    4826                      .dwattr $C$DW$629, DW_AT_name("clarkeHandle_I")
    4827                      .dwattr $C$DW$629, DW_AT_TI_symbol_name("_clarkeHandle_I")
TMS320C2000 Assembler PC v15.12.3 Wed Nov 22 01:55:17 2017

Tools Copyright (c) 1996-2015 Texas Instruments Incorporated
C:\Users\wmj\AppData\Local\Temp\1727610                              PAGE   92

    4828                      .dwattr $C$DW$629, DW_AT_data_member_location[DW_OP_plus_uconst 0x8]
    4829                      .dwattr $C$DW$629, DW_AT_accessibility(DW_ACCESS_public)
    4830              
    4831              $C$DW$630       .dwtag  DW_TAG_member
    4832                      .dwattr $C$DW$630, DW_AT_type(*$C$DW$T$47)
    4833                      .dwattr $C$DW$630, DW_AT_name("clarke_I")
    4834                      .dwattr $C$DW$630, DW_AT_TI_symbol_name("_clarke_I")
    4835                      .dwattr $C$DW$630, DW_AT_data_member_location[DW_OP_plus_uconst 0xa]
    4836                      .dwattr $C$DW$630, DW_AT_accessibility(DW_ACCESS_public)
    4837              
    4838              $C$DW$631       .dwtag  DW_TAG_member
    4839                      .dwattr $C$DW$631, DW_AT_type(*$C$DW$T$46)
    4840                      .dwattr $C$DW$631, DW_AT_name("clarkeHandle_V")
    4841                      .dwattr $C$DW$631, DW_AT_TI_symbol_name("_clarkeHandle_V")
    4842                      .dwattr $C$DW$631, DW_AT_data_member_location[DW_OP_plus_uconst 0x10]
    4843                      .dwattr $C$DW$631, DW_AT_accessibility(DW_ACCESS_public)
    4844              
    4845              $C$DW$632       .dwtag  DW_TAG_member
    4846                      .dwattr $C$DW$632, DW_AT_type(*$C$DW$T$47)
    4847                      .dwattr $C$DW$632, DW_AT_name("clarke_V")
    4848                      .dwattr $C$DW$632, DW_AT_TI_symbol_name("_clarke_V")
    4849                      .dwattr $C$DW$632, DW_AT_data_member_location[DW_OP_plus_uconst 0x12]
    4850                      .dwattr $C$DW$632, DW_AT_accessibility(DW_ACCESS_public)
    4851              
    4852              $C$DW$633       .dwtag  DW_TAG_member
    4853                      .dwattr $C$DW$633, DW_AT_type(*$C$DW$T$49)
    4854                      .dwattr $C$DW$633, DW_AT_name("estHandle")
    4855                      .dwattr $C$DW$633, DW_AT_TI_symbol_name("_estHandle")
    4856                      .dwattr $C$DW$633, DW_AT_data_member_location[DW_OP_plus_uconst 0x18]
    4857                      .dwattr $C$DW$633, DW_AT_accessibility(DW_ACCESS_public)
    4858              
    4859              $C$DW$634       .dwtag  DW_TAG_member
    4860                      .dwattr $C$DW$634, DW_AT_type(*$C$DW$T$51)
    4861                      .dwattr $C$DW$634, DW_AT_name("parkHandle")
    4862                      .dwattr $C$DW$634, DW_AT_TI_symbol_name("_parkHandle")
    4863                      .dwattr $C$DW$634, DW_AT_data_member_location[DW_OP_plus_uconst 0x1a]
    4864                      .dwattr $C$DW$634, DW_AT_accessibility(DW_ACCESS_public)
    4865              
    4866              $C$DW$635       .dwtag  DW_TAG_member
    4867                      .dwattr $C$DW$635, DW_AT_type(*$C$DW$T$52)
    4868                      .dwattr $C$DW$635, DW_AT_name("park")
    4869                      .dwattr $C$DW$635, DW_AT_TI_symbol_name("_park")
    4870                      .dwattr $C$DW$635, DW_AT_data_member_location[DW_OP_plus_uconst 0x1c]
    4871                      .dwattr $C$DW$635, DW_AT_accessibility(DW_ACCESS_public)
    4872              
    4873              $C$DW$636       .dwtag  DW_TAG_member
    4874                      .dwattr $C$DW$636, DW_AT_type(*$C$DW$T$54)
    4875                      .dwattr $C$DW$636, DW_AT_name("pidHandle_Id")
    4876                      .dwattr $C$DW$636, DW_AT_TI_symbol_name("_pidHandle_Id")
    4877                      .dwattr $C$DW$636, DW_AT_data_member_location[DW_OP_plus_uconst 0x20]
    4878                      .dwattr $C$DW$636, DW_AT_accessibility(DW_ACCESS_public)
    4879              
    4880              $C$DW$637       .dwtag  DW_TAG_member
    4881                      .dwattr $C$DW$637, DW_AT_type(*$C$DW$T$55)
    4882                      .dwattr $C$DW$637, DW_AT_name("pid_Id")
TMS320C2000 Assembler PC v15.12.3 Wed Nov 22 01:55:17 2017

Tools Copyright (c) 1996-2015 Texas Instruments Incorporated
C:\Users\wmj\AppData\Local\Temp\1727610                              PAGE   93

    4883                      .dwattr $C$DW$637, DW_AT_TI_symbol_name("_pid_Id")
    4884                      .dwattr $C$DW$637, DW_AT_data_member_location[DW_OP_plus_uconst 0x22]
    4885                      .dwattr $C$DW$637, DW_AT_accessibility(DW_ACCESS_public)
    4886              
    4887              $C$DW$638       .dwtag  DW_TAG_member
    4888                      .dwattr $C$DW$638, DW_AT_type(*$C$DW$T$54)
    4889                      .dwattr $C$DW$638, DW_AT_name("pidHandle_Iq")
    4890                      .dwattr $C$DW$638, DW_AT_TI_symbol_name("_pidHandle_Iq")
    4891                      .dwattr $C$DW$638, DW_AT_data_member_location[DW_OP_plus_uconst 0x32]
    4892                      .dwattr $C$DW$638, DW_AT_accessibility(DW_ACCESS_public)
    4893              
    4894              $C$DW$639       .dwtag  DW_TAG_member
    4895                      .dwattr $C$DW$639, DW_AT_type(*$C$DW$T$55)
    4896                      .dwattr $C$DW$639, DW_AT_name("pid_Iq")
    4897                      .dwattr $C$DW$639, DW_AT_TI_symbol_name("_pid_Iq")
    4898                      .dwattr $C$DW$639, DW_AT_data_member_location[DW_OP_plus_uconst 0x34]
    4899                      .dwattr $C$DW$639, DW_AT_accessibility(DW_ACCESS_public)
    4900              
    4901              $C$DW$640       .dwtag  DW_TAG_member
    4902                      .dwattr $C$DW$640, DW_AT_type(*$C$DW$T$54)
    4903                      .dwattr $C$DW$640, DW_AT_name("pidHandle_spd")
    4904                      .dwattr $C$DW$640, DW_AT_TI_symbol_name("_pidHandle_spd")
    4905                      .dwattr $C$DW$640, DW_AT_data_member_location[DW_OP_plus_uconst 0x44]
    4906                      .dwattr $C$DW$640, DW_AT_accessibility(DW_ACCESS_public)
    4907              
    4908              $C$DW$641       .dwtag  DW_TAG_member
    4909                      .dwattr $C$DW$641, DW_AT_type(*$C$DW$T$55)
    4910                      .dwattr $C$DW$641, DW_AT_name("pid_spd")
    4911                      .dwattr $C$DW$641, DW_AT_TI_symbol_name("_pid_spd")
    4912                      .dwattr $C$DW$641, DW_AT_data_member_location[DW_OP_plus_uconst 0x46]
    4913                      .dwattr $C$DW$641, DW_AT_accessibility(DW_ACCESS_public)
    4914              
    4915              $C$DW$642       .dwtag  DW_TAG_member
    4916                      .dwattr $C$DW$642, DW_AT_type(*$C$DW$T$57)
    4917                      .dwattr $C$DW$642, DW_AT_name("iparkHandle")
    4918                      .dwattr $C$DW$642, DW_AT_TI_symbol_name("_iparkHandle")
    4919                      .dwattr $C$DW$642, DW_AT_data_member_location[DW_OP_plus_uconst 0x56]
    4920                      .dwattr $C$DW$642, DW_AT_accessibility(DW_ACCESS_public)
    4921              
    4922              $C$DW$643       .dwtag  DW_TAG_member
    4923                      .dwattr $C$DW$643, DW_AT_type(*$C$DW$T$58)
    4924                      .dwattr $C$DW$643, DW_AT_name("ipark")
    4925                      .dwattr $C$DW$643, DW_AT_TI_symbol_name("_ipark")
    4926                      .dwattr $C$DW$643, DW_AT_data_member_location[DW_OP_plus_uconst 0x58]
    4927                      .dwattr $C$DW$643, DW_AT_accessibility(DW_ACCESS_public)
    4928              
    4929              $C$DW$644       .dwtag  DW_TAG_member
    4930                      .dwattr $C$DW$644, DW_AT_type(*$C$DW$T$60)
    4931                      .dwattr $C$DW$644, DW_AT_name("svgenHandle")
    4932                      .dwattr $C$DW$644, DW_AT_TI_symbol_name("_svgenHandle")
    4933                      .dwattr $C$DW$644, DW_AT_data_member_location[DW_OP_plus_uconst 0x5c]
    4934                      .dwattr $C$DW$644, DW_AT_accessibility(DW_ACCESS_public)
    4935              
    4936              $C$DW$645       .dwtag  DW_TAG_member
    4937                      .dwattr $C$DW$645, DW_AT_type(*$C$DW$T$61)
TMS320C2000 Assembler PC v15.12.3 Wed Nov 22 01:55:17 2017

Tools Copyright (c) 1996-2015 Texas Instruments Incorporated
C:\Users\wmj\AppData\Local\Temp\1727610                              PAGE   94

    4938                      .dwattr $C$DW$645, DW_AT_name("svgen")
    4939                      .dwattr $C$DW$645, DW_AT_TI_symbol_name("_svgen")
    4940                      .dwattr $C$DW$645, DW_AT_data_member_location[DW_OP_plus_uconst 0x5e]
    4941                      .dwattr $C$DW$645, DW_AT_accessibility(DW_ACCESS_public)
    4942              
    4943              $C$DW$646       .dwtag  DW_TAG_member
    4944                      .dwattr $C$DW$646, DW_AT_type(*$C$DW$T$63)
    4945                      .dwattr $C$DW$646, DW_AT_name("trajHandle_Id")
    4946                      .dwattr $C$DW$646, DW_AT_TI_symbol_name("_trajHandle_Id")
    4947                      .dwattr $C$DW$646, DW_AT_data_member_location[DW_OP_plus_uconst 0x60]
    4948                      .dwattr $C$DW$646, DW_AT_accessibility(DW_ACCESS_public)
    4949              
    4950              $C$DW$647       .dwtag  DW_TAG_member
    4951                      .dwattr $C$DW$647, DW_AT_type(*$C$DW$T$64)
    4952                      .dwattr $C$DW$647, DW_AT_name("traj_Id")
    4953                      .dwattr $C$DW$647, DW_AT_TI_symbol_name("_traj_Id")
    4954                      .dwattr $C$DW$647, DW_AT_data_member_location[DW_OP_plus_uconst 0x62]
    4955                      .dwattr $C$DW$647, DW_AT_accessibility(DW_ACCESS_public)
    4956              
    4957              $C$DW$648       .dwtag  DW_TAG_member
    4958                      .dwattr $C$DW$648, DW_AT_type(*$C$DW$T$63)
    4959                      .dwattr $C$DW$648, DW_AT_name("trajHandle_spd")
    4960                      .dwattr $C$DW$648, DW_AT_TI_symbol_name("_trajHandle_spd")
    4961                      .dwattr $C$DW$648, DW_AT_data_member_location[DW_OP_plus_uconst 0x6c]
    4962                      .dwattr $C$DW$648, DW_AT_accessibility(DW_ACCESS_public)
    4963              
    4964              $C$DW$649       .dwtag  DW_TAG_member
    4965                      .dwattr $C$DW$649, DW_AT_type(*$C$DW$T$64)
    4966                      .dwattr $C$DW$649, DW_AT_name("traj_spd")
    4967                      .dwattr $C$DW$649, DW_AT_TI_symbol_name("_traj_spd")
    4968                      .dwattr $C$DW$649, DW_AT_data_member_location[DW_OP_plus_uconst 0x6e]
    4969                      .dwattr $C$DW$649, DW_AT_accessibility(DW_ACCESS_public)
    4970              
    4971              $C$DW$650       .dwtag  DW_TAG_member
    4972                      .dwattr $C$DW$650, DW_AT_type(*$C$DW$T$63)
    4973                      .dwattr $C$DW$650, DW_AT_name("trajHandle_spdMax")
    4974                      .dwattr $C$DW$650, DW_AT_TI_symbol_name("_trajHandle_spdMax")
    4975                      .dwattr $C$DW$650, DW_AT_data_member_location[DW_OP_plus_uconst 0x78]
    4976                      .dwattr $C$DW$650, DW_AT_accessibility(DW_ACCESS_public)
    4977              
    4978              $C$DW$651       .dwtag  DW_TAG_member
    4979                      .dwattr $C$DW$651, DW_AT_type(*$C$DW$T$64)
    4980                      .dwattr $C$DW$651, DW_AT_name("traj_spdMax")
    4981                      .dwattr $C$DW$651, DW_AT_TI_symbol_name("_traj_spdMax")
    4982                      .dwattr $C$DW$651, DW_AT_data_member_location[DW_OP_plus_uconst 0x7a]
    4983                      .dwattr $C$DW$651, DW_AT_accessibility(DW_ACCESS_public)
    4984              
    4985              $C$DW$652       .dwtag  DW_TAG_member
    4986                      .dwattr $C$DW$652, DW_AT_type(*$C$DW$T$65)
    4987                      .dwattr $C$DW$652, DW_AT_name("motorParams")
    4988                      .dwattr $C$DW$652, DW_AT_TI_symbol_name("_motorParams")
    4989                      .dwattr $C$DW$652, DW_AT_data_member_location[DW_OP_plus_uconst 0x84]
    4990                      .dwattr $C$DW$652, DW_AT_accessibility(DW_ACCESS_public)
    4991              
    4992              $C$DW$653       .dwtag  DW_TAG_member
TMS320C2000 Assembler PC v15.12.3 Wed Nov 22 01:55:17 2017

Tools Copyright (c) 1996-2015 Texas Instruments Incorporated
C:\Users\wmj\AppData\Local\Temp\1727610                              PAGE   95

    4993                      .dwattr $C$DW$653, DW_AT_type(*$C$DW$T$68)
    4994                      .dwattr $C$DW$653, DW_AT_name("waitTimes")
    4995                      .dwattr $C$DW$653, DW_AT_TI_symbol_name("_waitTimes")
    4996                      .dwattr $C$DW$653, DW_AT_data_member_location[DW_OP_plus_uconst 0x92]
    4997                      .dwattr $C$DW$653, DW_AT_accessibility(DW_ACCESS_public)
    4998              
    4999              $C$DW$654       .dwtag  DW_TAG_member
    5000                      .dwattr $C$DW$654, DW_AT_type(*$C$DW$T$67)
    5001                      .dwattr $C$DW$654, DW_AT_name("counter_state")
    5002                      .dwattr $C$DW$654, DW_AT_TI_symbol_name("_counter_state")
    5003                      .dwattr $C$DW$654, DW_AT_data_member_location[DW_OP_plus_uconst 0x9a]
    5004                      .dwattr $C$DW$654, DW_AT_accessibility(DW_ACCESS_public)
    5005              
    5006              $C$DW$655       .dwtag  DW_TAG_member
    5007                      .dwattr $C$DW$655, DW_AT_type(*$C$DW$T$69)
    5008                      .dwattr $C$DW$655, DW_AT_name("numIsrTicksPerCtrlTick")
    5009                      .dwattr $C$DW$655, DW_AT_TI_symbol_name("_numIsrTicksPerCtrlTick")
    5010                      .dwattr $C$DW$655, DW_AT_data_member_location[DW_OP_plus_uconst 0x9c]
    5011                      .dwattr $C$DW$655, DW_AT_accessibility(DW_ACCESS_public)
    5012              
    5013              $C$DW$656       .dwtag  DW_TAG_member
    5014                      .dwattr $C$DW$656, DW_AT_type(*$C$DW$T$69)
    5015                      .dwattr $C$DW$656, DW_AT_name("numCtrlTicksPerCurrentTick")
    5016                      .dwattr $C$DW$656, DW_AT_TI_symbol_name("_numCtrlTicksPerCurrentTick")
    5017                      .dwattr $C$DW$656, DW_AT_data_member_location[DW_OP_plus_uconst 0x9d]
    5018                      .dwattr $C$DW$656, DW_AT_accessibility(DW_ACCESS_public)
    5019              
    5020              $C$DW$657       .dwtag  DW_TAG_member
    5021                      .dwattr $C$DW$657, DW_AT_type(*$C$DW$T$69)
    5022                      .dwattr $C$DW$657, DW_AT_name("numCtrlTicksPerSpeedTick")
    5023                      .dwattr $C$DW$657, DW_AT_TI_symbol_name("_numCtrlTicksPerSpeedTick")
    5024                      .dwattr $C$DW$657, DW_AT_data_member_location[DW_OP_plus_uconst 0x9e]
    5025                      .dwattr $C$DW$657, DW_AT_accessibility(DW_ACCESS_public)
    5026              
    5027              $C$DW$658       .dwtag  DW_TAG_member
    5028                      .dwattr $C$DW$658, DW_AT_type(*$C$DW$T$69)
    5029                      .dwattr $C$DW$658, DW_AT_name("numCtrlTicksPerTrajTick")
    5030                      .dwattr $C$DW$658, DW_AT_TI_symbol_name("_numCtrlTicksPerTrajTick")
    5031                      .dwattr $C$DW$658, DW_AT_data_member_location[DW_OP_plus_uconst 0x9f]
    5032                      .dwattr $C$DW$658, DW_AT_accessibility(DW_ACCESS_public)
    5033              
    5034              $C$DW$659       .dwtag  DW_TAG_member
    5035                      .dwattr $C$DW$659, DW_AT_type(*$C$DW$T$67)
    5036                      .dwattr $C$DW$659, DW_AT_name("ctrlFreq_Hz")
    5037                      .dwattr $C$DW$659, DW_AT_TI_symbol_name("_ctrlFreq_Hz")
    5038                      .dwattr $C$DW$659, DW_AT_data_member_location[DW_OP_plus_uconst 0xa0]
    5039                      .dwattr $C$DW$659, DW_AT_accessibility(DW_ACCESS_public)
    5040              
    5041              $C$DW$660       .dwtag  DW_TAG_member
    5042                      .dwattr $C$DW$660, DW_AT_type(*$C$DW$T$67)
    5043                      .dwattr $C$DW$660, DW_AT_name("trajFreq_Hz")
    5044                      .dwattr $C$DW$660, DW_AT_TI_symbol_name("_trajFreq_Hz")
    5045                      .dwattr $C$DW$660, DW_AT_data_member_location[DW_OP_plus_uconst 0xa2]
    5046                      .dwattr $C$DW$660, DW_AT_accessibility(DW_ACCESS_public)
    5047              
TMS320C2000 Assembler PC v15.12.3 Wed Nov 22 01:55:17 2017

Tools Copyright (c) 1996-2015 Texas Instruments Incorporated
C:\Users\wmj\AppData\Local\Temp\1727610                              PAGE   96

    5048              $C$DW$661       .dwtag  DW_TAG_member
    5049                      .dwattr $C$DW$661, DW_AT_type(*$C$DW$T$31)
    5050                      .dwattr $C$DW$661, DW_AT_name("trajPeriod_sec")
    5051                      .dwattr $C$DW$661, DW_AT_TI_symbol_name("_trajPeriod_sec")
    5052                      .dwattr $C$DW$661, DW_AT_data_member_location[DW_OP_plus_uconst 0xa4]
    5053                      .dwattr $C$DW$661, DW_AT_accessibility(DW_ACCESS_public)
    5054              
    5055              $C$DW$662       .dwtag  DW_TAG_member
    5056                      .dwattr $C$DW$662, DW_AT_type(*$C$DW$T$70)
    5057                      .dwattr $C$DW$662, DW_AT_name("ctrlPeriod_sec")
    5058                      .dwattr $C$DW$662, DW_AT_TI_symbol_name("_ctrlPeriod_sec")
    5059                      .dwattr $C$DW$662, DW_AT_data_member_location[DW_OP_plus_uconst 0xa6]
    5060                      .dwattr $C$DW$662, DW_AT_accessibility(DW_ACCESS_public)
    5061              
    5062              $C$DW$663       .dwtag  DW_TAG_member
    5063                      .dwattr $C$DW$663, DW_AT_type(*$C$DW$T$31)
    5064                      .dwattr $C$DW$663, DW_AT_name("maxVsMag_pu")
    5065                      .dwattr $C$DW$663, DW_AT_TI_symbol_name("_maxVsMag_pu")
    5066                      .dwattr $C$DW$663, DW_AT_data_member_location[DW_OP_plus_uconst 0xa8]
    5067                      .dwattr $C$DW$663, DW_AT_accessibility(DW_ACCESS_public)
    5068              
    5069              $C$DW$664       .dwtag  DW_TAG_member
    5070                      .dwattr $C$DW$664, DW_AT_type(*$C$DW$T$32)
    5071                      .dwattr $C$DW$664, DW_AT_name("Iab_in")
    5072                      .dwattr $C$DW$664, DW_AT_TI_symbol_name("_Iab_in")
    5073                      .dwattr $C$DW$664, DW_AT_data_member_location[DW_OP_plus_uconst 0xaa]
    5074                      .dwattr $C$DW$664, DW_AT_accessibility(DW_ACCESS_public)
    5075              
    5076              $C$DW$665       .dwtag  DW_TAG_member
    5077                      .dwattr $C$DW$665, DW_AT_type(*$C$DW$T$32)
    5078                      .dwattr $C$DW$665, DW_AT_name("Iab_filt")
    5079                      .dwattr $C$DW$665, DW_AT_TI_symbol_name("_Iab_filt")
    5080                      .dwattr $C$DW$665, DW_AT_data_member_location[DW_OP_plus_uconst 0xae]
    5081                      .dwattr $C$DW$665, DW_AT_accessibility(DW_ACCESS_public)
    5082              
    5083              $C$DW$666       .dwtag  DW_TAG_member
    5084                      .dwattr $C$DW$666, DW_AT_type(*$C$DW$T$32)
    5085                      .dwattr $C$DW$666, DW_AT_name("Idq_in")
    5086                      .dwattr $C$DW$666, DW_AT_TI_symbol_name("_Idq_in")
    5087                      .dwattr $C$DW$666, DW_AT_data_member_location[DW_OP_plus_uconst 0xb2]
    5088                      .dwattr $C$DW$666, DW_AT_accessibility(DW_ACCESS_public)
    5089              
    5090              $C$DW$667       .dwtag  DW_TAG_member
    5091                      .dwattr $C$DW$667, DW_AT_type(*$C$DW$T$32)
    5092                      .dwattr $C$DW$667, DW_AT_name("Vab_in")
    5093                      .dwattr $C$DW$667, DW_AT_TI_symbol_name("_Vab_in")
    5094                      .dwattr $C$DW$667, DW_AT_data_member_location[DW_OP_plus_uconst 0xb6]
    5095                      .dwattr $C$DW$667, DW_AT_accessibility(DW_ACCESS_public)
    5096              
    5097              $C$DW$668       .dwtag  DW_TAG_member
    5098                      .dwattr $C$DW$668, DW_AT_type(*$C$DW$T$31)
    5099                      .dwattr $C$DW$668, DW_AT_name("spd_out")
    5100                      .dwattr $C$DW$668, DW_AT_TI_symbol_name("_spd_out")
    5101                      .dwattr $C$DW$668, DW_AT_data_member_location[DW_OP_plus_uconst 0xba]
    5102                      .dwattr $C$DW$668, DW_AT_accessibility(DW_ACCESS_public)
TMS320C2000 Assembler PC v15.12.3 Wed Nov 22 01:55:17 2017

Tools Copyright (c) 1996-2015 Texas Instruments Incorporated
C:\Users\wmj\AppData\Local\Temp\1727610                              PAGE   97

    5103              
    5104              $C$DW$669       .dwtag  DW_TAG_member
    5105                      .dwattr $C$DW$669, DW_AT_type(*$C$DW$T$32)
    5106                      .dwattr $C$DW$669, DW_AT_name("Vab_out")
    5107                      .dwattr $C$DW$669, DW_AT_TI_symbol_name("_Vab_out")
    5108                      .dwattr $C$DW$669, DW_AT_data_member_location[DW_OP_plus_uconst 0xbc]
    5109                      .dwattr $C$DW$669, DW_AT_accessibility(DW_ACCESS_public)
    5110              
    5111              $C$DW$670       .dwtag  DW_TAG_member
    5112                      .dwattr $C$DW$670, DW_AT_type(*$C$DW$T$32)
    5113                      .dwattr $C$DW$670, DW_AT_name("Vdq_out")
    5114                      .dwattr $C$DW$670, DW_AT_TI_symbol_name("_Vdq_out")
    5115                      .dwattr $C$DW$670, DW_AT_data_member_location[DW_OP_plus_uconst 0xc0]
    5116                      .dwattr $C$DW$670, DW_AT_accessibility(DW_ACCESS_public)
    5117              
    5118              $C$DW$671       .dwtag  DW_TAG_member
    5119                      .dwattr $C$DW$671, DW_AT_type(*$C$DW$T$70)
    5120                      .dwattr $C$DW$671, DW_AT_name("Rhf")
    5121                      .dwattr $C$DW$671, DW_AT_TI_symbol_name("_Rhf")
    5122                      .dwattr $C$DW$671, DW_AT_data_member_location[DW_OP_plus_uconst 0xc4]
    5123                      .dwattr $C$DW$671, DW_AT_accessibility(DW_ACCESS_public)
    5124              
    5125              $C$DW$672       .dwtag  DW_TAG_member
    5126                      .dwattr $C$DW$672, DW_AT_type(*$C$DW$T$70)
    5127                      .dwattr $C$DW$672, DW_AT_name("Lhf")
    5128                      .dwattr $C$DW$672, DW_AT_TI_symbol_name("_Lhf")
    5129                      .dwattr $C$DW$672, DW_AT_data_member_location[DW_OP_plus_uconst 0xc6]
    5130                      .dwattr $C$DW$672, DW_AT_accessibility(DW_ACCESS_public)
    5131              
    5132              $C$DW$673       .dwtag  DW_TAG_member
    5133                      .dwattr $C$DW$673, DW_AT_type(*$C$DW$T$70)
    5134                      .dwattr $C$DW$673, DW_AT_name("RoverL")
    5135                      .dwattr $C$DW$673, DW_AT_TI_symbol_name("_RoverL")
    5136                      .dwattr $C$DW$673, DW_AT_data_member_location[DW_OP_plus_uconst 0xc8]
    5137                      .dwattr $C$DW$673, DW_AT_accessibility(DW_ACCESS_public)
    5138              
    5139              $C$DW$674       .dwtag  DW_TAG_member
    5140                      .dwattr $C$DW$674, DW_AT_type(*$C$DW$T$31)
    5141                      .dwattr $C$DW$674, DW_AT_name("Kp_Id")
    5142                      .dwattr $C$DW$674, DW_AT_TI_symbol_name("_Kp_Id")
    5143                      .dwattr $C$DW$674, DW_AT_data_member_location[DW_OP_plus_uconst 0xca]
    5144                      .dwattr $C$DW$674, DW_AT_accessibility(DW_ACCESS_public)
    5145              
    5146              $C$DW$675       .dwtag  DW_TAG_member
    5147                      .dwattr $C$DW$675, DW_AT_type(*$C$DW$T$31)
    5148                      .dwattr $C$DW$675, DW_AT_name("Kp_Iq")
    5149                      .dwattr $C$DW$675, DW_AT_TI_symbol_name("_Kp_Iq")
    5150                      .dwattr $C$DW$675, DW_AT_data_member_location[DW_OP_plus_uconst 0xcc]
    5151                      .dwattr $C$DW$675, DW_AT_accessibility(DW_ACCESS_public)
    5152              
    5153              $C$DW$676       .dwtag  DW_TAG_member
    5154                      .dwattr $C$DW$676, DW_AT_type(*$C$DW$T$31)
    5155                      .dwattr $C$DW$676, DW_AT_name("Kp_spd")
    5156                      .dwattr $C$DW$676, DW_AT_TI_symbol_name("_Kp_spd")
    5157                      .dwattr $C$DW$676, DW_AT_data_member_location[DW_OP_plus_uconst 0xce]
TMS320C2000 Assembler PC v15.12.3 Wed Nov 22 01:55:17 2017

Tools Copyright (c) 1996-2015 Texas Instruments Incorporated
C:\Users\wmj\AppData\Local\Temp\1727610                              PAGE   98

    5158                      .dwattr $C$DW$676, DW_AT_accessibility(DW_ACCESS_public)
    5159              
    5160              $C$DW$677       .dwtag  DW_TAG_member
    5161                      .dwattr $C$DW$677, DW_AT_type(*$C$DW$T$31)
    5162                      .dwattr $C$DW$677, DW_AT_name("Ki_Id")
    5163                      .dwattr $C$DW$677, DW_AT_TI_symbol_name("_Ki_Id")
    5164                      .dwattr $C$DW$677, DW_AT_data_member_location[DW_OP_plus_uconst 0xd0]
    5165                      .dwattr $C$DW$677, DW_AT_accessibility(DW_ACCESS_public)
    5166              
    5167              $C$DW$678       .dwtag  DW_TAG_member
    5168                      .dwattr $C$DW$678, DW_AT_type(*$C$DW$T$31)
    5169                      .dwattr $C$DW$678, DW_AT_name("Ki_Iq")
    5170                      .dwattr $C$DW$678, DW_AT_TI_symbol_name("_Ki_Iq")
    5171                      .dwattr $C$DW$678, DW_AT_data_member_location[DW_OP_plus_uconst 0xd2]
    5172                      .dwattr $C$DW$678, DW_AT_accessibility(DW_ACCESS_public)
    5173              
    5174              $C$DW$679       .dwtag  DW_TAG_member
    5175                      .dwattr $C$DW$679, DW_AT_type(*$C$DW$T$31)
    5176                      .dwattr $C$DW$679, DW_AT_name("Ki_spd")
    5177                      .dwattr $C$DW$679, DW_AT_TI_symbol_name("_Ki_spd")
    5178                      .dwattr $C$DW$679, DW_AT_data_member_location[DW_OP_plus_uconst 0xd4]
    5179                      .dwattr $C$DW$679, DW_AT_accessibility(DW_ACCESS_public)
    5180              
    5181              $C$DW$680       .dwtag  DW_TAG_member
    5182                      .dwattr $C$DW$680, DW_AT_type(*$C$DW$T$31)
    5183                      .dwattr $C$DW$680, DW_AT_name("Kd_Id")
    5184                      .dwattr $C$DW$680, DW_AT_TI_symbol_name("_Kd_Id")
    5185                      .dwattr $C$DW$680, DW_AT_data_member_location[DW_OP_plus_uconst 0xd6]
    5186                      .dwattr $C$DW$680, DW_AT_accessibility(DW_ACCESS_public)
    5187              
    5188              $C$DW$681       .dwtag  DW_TAG_member
    5189                      .dwattr $C$DW$681, DW_AT_type(*$C$DW$T$31)
    5190                      .dwattr $C$DW$681, DW_AT_name("Kd_Iq")
    5191                      .dwattr $C$DW$681, DW_AT_TI_symbol_name("_Kd_Iq")
    5192                      .dwattr $C$DW$681, DW_AT_data_member_location[DW_OP_plus_uconst 0xd8]
    5193                      .dwattr $C$DW$681, DW_AT_accessibility(DW_ACCESS_public)
    5194              
    5195              $C$DW$682       .dwtag  DW_TAG_member
    5196                      .dwattr $C$DW$682, DW_AT_type(*$C$DW$T$31)
    5197                      .dwattr $C$DW$682, DW_AT_name("Kd_spd")
    5198                      .dwattr $C$DW$682, DW_AT_TI_symbol_name("_Kd_spd")
    5199                      .dwattr $C$DW$682, DW_AT_data_member_location[DW_OP_plus_uconst 0xda]
    5200                      .dwattr $C$DW$682, DW_AT_accessibility(DW_ACCESS_public)
    5201              
    5202              $C$DW$683       .dwtag  DW_TAG_member
    5203                      .dwattr $C$DW$683, DW_AT_type(*$C$DW$T$31)
    5204                      .dwattr $C$DW$683, DW_AT_name("Ui_Id")
    5205                      .dwattr $C$DW$683, DW_AT_TI_symbol_name("_Ui_Id")
    5206                      .dwattr $C$DW$683, DW_AT_data_member_location[DW_OP_plus_uconst 0xdc]
    5207                      .dwattr $C$DW$683, DW_AT_accessibility(DW_ACCESS_public)
    5208              
    5209              $C$DW$684       .dwtag  DW_TAG_member
    5210                      .dwattr $C$DW$684, DW_AT_type(*$C$DW$T$31)
    5211                      .dwattr $C$DW$684, DW_AT_name("Ui_Iq")
    5212                      .dwattr $C$DW$684, DW_AT_TI_symbol_name("_Ui_Iq")
TMS320C2000 Assembler PC v15.12.3 Wed Nov 22 01:55:17 2017

Tools Copyright (c) 1996-2015 Texas Instruments Incorporated
C:\Users\wmj\AppData\Local\Temp\1727610                              PAGE   99

    5213                      .dwattr $C$DW$684, DW_AT_data_member_location[DW_OP_plus_uconst 0xde]
    5214                      .dwattr $C$DW$684, DW_AT_accessibility(DW_ACCESS_public)
    5215              
    5216              $C$DW$685       .dwtag  DW_TAG_member
    5217                      .dwattr $C$DW$685, DW_AT_type(*$C$DW$T$31)
    5218                      .dwattr $C$DW$685, DW_AT_name("Ui_spd")
    5219                      .dwattr $C$DW$685, DW_AT_TI_symbol_name("_Ui_spd")
    5220                      .dwattr $C$DW$685, DW_AT_data_member_location[DW_OP_plus_uconst 0xe0]
    5221                      .dwattr $C$DW$685, DW_AT_accessibility(DW_ACCESS_public)
    5222              
    5223              $C$DW$686       .dwtag  DW_TAG_member
    5224                      .dwattr $C$DW$686, DW_AT_type(*$C$DW$T$32)
    5225                      .dwattr $C$DW$686, DW_AT_name("Idq_ref")
    5226                      .dwattr $C$DW$686, DW_AT_TI_symbol_name("_Idq_ref")
    5227                      .dwattr $C$DW$686, DW_AT_data_member_location[DW_OP_plus_uconst 0xe2]
    5228                      .dwattr $C$DW$686, DW_AT_accessibility(DW_ACCESS_public)
    5229              
    5230              $C$DW$687       .dwtag  DW_TAG_member
    5231                      .dwattr $C$DW$687, DW_AT_type(*$C$DW$T$31)
    5232                      .dwattr $C$DW$687, DW_AT_name("IdRated")
    5233                      .dwattr $C$DW$687, DW_AT_TI_symbol_name("_IdRated")
    5234                      .dwattr $C$DW$687, DW_AT_data_member_location[DW_OP_plus_uconst 0xe6]
    5235                      .dwattr $C$DW$687, DW_AT_accessibility(DW_ACCESS_public)
    5236              
    5237              $C$DW$688       .dwtag  DW_TAG_member
    5238                      .dwattr $C$DW$688, DW_AT_type(*$C$DW$T$31)
    5239                      .dwattr $C$DW$688, DW_AT_name("spd_ref")
    5240                      .dwattr $C$DW$688, DW_AT_TI_symbol_name("_spd_ref")
    5241                      .dwattr $C$DW$688, DW_AT_data_member_location[DW_OP_plus_uconst 0xe8]
    5242                      .dwattr $C$DW$688, DW_AT_accessibility(DW_ACCESS_public)
    5243              
    5244              $C$DW$689       .dwtag  DW_TAG_member
    5245                      .dwattr $C$DW$689, DW_AT_type(*$C$DW$T$31)
    5246                      .dwattr $C$DW$689, DW_AT_name("spd_max")
    5247                      .dwattr $C$DW$689, DW_AT_TI_symbol_name("_spd_max")
    5248                      .dwattr $C$DW$689, DW_AT_data_member_location[DW_OP_plus_uconst 0xea]
    5249                      .dwattr $C$DW$689, DW_AT_accessibility(DW_ACCESS_public)
    5250              
    5251              $C$DW$690       .dwtag  DW_TAG_member
    5252                      .dwattr $C$DW$690, DW_AT_type(*$C$DW$T$69)
    5253                      .dwattr $C$DW$690, DW_AT_name("counter_current")
    5254                      .dwattr $C$DW$690, DW_AT_TI_symbol_name("_counter_current")
    5255                      .dwattr $C$DW$690, DW_AT_data_member_location[DW_OP_plus_uconst 0xec]
    5256                      .dwattr $C$DW$690, DW_AT_accessibility(DW_ACCESS_public)
    5257              
    5258              $C$DW$691       .dwtag  DW_TAG_member
    5259                      .dwattr $C$DW$691, DW_AT_type(*$C$DW$T$69)
    5260                      .dwattr $C$DW$691, DW_AT_name("counter_isr")
    5261                      .dwattr $C$DW$691, DW_AT_TI_symbol_name("_counter_isr")
    5262                      .dwattr $C$DW$691, DW_AT_data_member_location[DW_OP_plus_uconst 0xed]
    5263                      .dwattr $C$DW$691, DW_AT_accessibility(DW_ACCESS_public)
    5264              
    5265              $C$DW$692       .dwtag  DW_TAG_member
    5266                      .dwattr $C$DW$692, DW_AT_type(*$C$DW$T$69)
    5267                      .dwattr $C$DW$692, DW_AT_name("counter_speed")
TMS320C2000 Assembler PC v15.12.3 Wed Nov 22 01:55:17 2017

Tools Copyright (c) 1996-2015 Texas Instruments Incorporated
C:\Users\wmj\AppData\Local\Temp\1727610                              PAGE  100

    5268                      .dwattr $C$DW$692, DW_AT_TI_symbol_name("_counter_speed")
    5269                      .dwattr $C$DW$692, DW_AT_data_member_location[DW_OP_plus_uconst 0xee]
    5270                      .dwattr $C$DW$692, DW_AT_accessibility(DW_ACCESS_public)
    5271              
    5272              $C$DW$693       .dwtag  DW_TAG_member
    5273                      .dwattr $C$DW$693, DW_AT_type(*$C$DW$T$69)
    5274                      .dwattr $C$DW$693, DW_AT_name("counter_traj")
    5275                      .dwattr $C$DW$693, DW_AT_TI_symbol_name("_counter_traj")
    5276                      .dwattr $C$DW$693, DW_AT_data_member_location[DW_OP_plus_uconst 0xef]
    5277                      .dwattr $C$DW$693, DW_AT_accessibility(DW_ACCESS_public)
    5278              
    5279              $C$DW$694       .dwtag  DW_TAG_member
    5280                      .dwattr $C$DW$694, DW_AT_type(*$C$DW$T$33)
    5281                      .dwattr $C$DW$694, DW_AT_name("flag_enableCtrl")
    5282                      .dwattr $C$DW$694, DW_AT_TI_symbol_name("_flag_enableCtrl")
    5283                      .dwattr $C$DW$694, DW_AT_data_member_location[DW_OP_plus_uconst 0xf0]
    5284                      .dwattr $C$DW$694, DW_AT_accessibility(DW_ACCESS_public)
    5285              
    5286              $C$DW$695       .dwtag  DW_TAG_member
    5287                      .dwattr $C$DW$695, DW_AT_type(*$C$DW$T$33)
    5288                      .dwattr $C$DW$695, DW_AT_name("flag_enableDcBusComp")
    5289                      .dwattr $C$DW$695, DW_AT_TI_symbol_name("_flag_enableDcBusComp")
    5290                      .dwattr $C$DW$695, DW_AT_data_member_location[DW_OP_plus_uconst 0xf1]
    5291                      .dwattr $C$DW$695, DW_AT_accessibility(DW_ACCESS_public)
    5292              
    5293              $C$DW$696       .dwtag  DW_TAG_member
    5294                      .dwattr $C$DW$696, DW_AT_type(*$C$DW$T$33)
    5295                      .dwattr $C$DW$696, DW_AT_name("flag_enablePowerWarp")
    5296                      .dwattr $C$DW$696, DW_AT_TI_symbol_name("_flag_enablePowerWarp")
    5297                      .dwattr $C$DW$696, DW_AT_data_member_location[DW_OP_plus_uconst 0xf2]
    5298                      .dwattr $C$DW$696, DW_AT_accessibility(DW_ACCESS_public)
    5299              
    5300              $C$DW$697       .dwtag  DW_TAG_member
    5301                      .dwattr $C$DW$697, DW_AT_type(*$C$DW$T$33)
    5302                      .dwattr $C$DW$697, DW_AT_name("flag_enableOffset")
    5303                      .dwattr $C$DW$697, DW_AT_TI_symbol_name("_flag_enableOffset")
    5304                      .dwattr $C$DW$697, DW_AT_data_member_location[DW_OP_plus_uconst 0xf3]
    5305                      .dwattr $C$DW$697, DW_AT_accessibility(DW_ACCESS_public)
    5306              
    5307              $C$DW$698       .dwtag  DW_TAG_member
    5308                      .dwattr $C$DW$698, DW_AT_type(*$C$DW$T$33)
    5309                      .dwattr $C$DW$698, DW_AT_name("flag_enableSpeedCtrl")
    5310                      .dwattr $C$DW$698, DW_AT_TI_symbol_name("_flag_enableSpeedCtrl")
    5311                      .dwattr $C$DW$698, DW_AT_data_member_location[DW_OP_plus_uconst 0xf4]
    5312                      .dwattr $C$DW$698, DW_AT_accessibility(DW_ACCESS_public)
    5313              
    5314              $C$DW$699       .dwtag  DW_TAG_member
    5315                      .dwattr $C$DW$699, DW_AT_type(*$C$DW$T$33)
    5316                      .dwattr $C$DW$699, DW_AT_name("flag_enableUserMotorParams")
    5317                      .dwattr $C$DW$699, DW_AT_TI_symbol_name("_flag_enableUserMotorParams")
    5318                      .dwattr $C$DW$699, DW_AT_data_member_location[DW_OP_plus_uconst 0xf5]
    5319                      .dwattr $C$DW$699, DW_AT_accessibility(DW_ACCESS_public)
    5320              
    5321              $C$DW$700       .dwtag  DW_TAG_member
    5322                      .dwattr $C$DW$700, DW_AT_type(*$C$DW$T$33)
TMS320C2000 Assembler PC v15.12.3 Wed Nov 22 01:55:17 2017

Tools Copyright (c) 1996-2015 Texas Instruments Incorporated
C:\Users\wmj\AppData\Local\Temp\1727610                              PAGE  101

    5323                      .dwattr $C$DW$700, DW_AT_name("flag_enableCurrentCtrl")
    5324                      .dwattr $C$DW$700, DW_AT_TI_symbol_name("_flag_enableCurrentCtrl")
    5325                      .dwattr $C$DW$700, DW_AT_data_member_location[DW_OP_plus_uconst 0xf6]
    5326                      .dwattr $C$DW$700, DW_AT_accessibility(DW_ACCESS_public)
    5327              
    5328              $C$DW$701       .dwtag  DW_TAG_member
    5329                      .dwattr $C$DW$701, DW_AT_type(*$C$DW$T$31)
    5330                      .dwattr $C$DW$701, DW_AT_name("spd_outMaxRatio_pu")
    5331                      .dwattr $C$DW$701, DW_AT_TI_symbol_name("_spd_outMaxRatio_pu")
    5332                      .dwattr $C$DW$701, DW_AT_data_member_location[DW_OP_plus_uconst 0xf8]
    5333                      .dwattr $C$DW$701, DW_AT_accessibility(DW_ACCESS_public)
    5334              
    5335              $C$DW$702       .dwtag  DW_TAG_member
    5336                      .dwattr $C$DW$702, DW_AT_type(*$C$DW$T$31)
    5337                      .dwattr $C$DW$702, DW_AT_name("enc_Angle")
    5338                      .dwattr $C$DW$702, DW_AT_TI_symbol_name("_enc_Angle")
    5339                      .dwattr $C$DW$702, DW_AT_data_member_location[DW_OP_plus_uconst 0xfa]
    5340                      .dwattr $C$DW$702, DW_AT_accessibility(DW_ACCESS_public)
    5341              
    5342              $C$DW$703       .dwtag  DW_TAG_member
    5343                      .dwattr $C$DW$703, DW_AT_type(*$C$DW$T$33)
    5344                      .dwattr $C$DW$703, DW_AT_name("flag_enableEncAngle")
    5345                      .dwattr $C$DW$703, DW_AT_TI_symbol_name("_flag_enableEncAngle")
    5346                      .dwattr $C$DW$703, DW_AT_data_member_location[DW_OP_plus_uconst 0xfc]
    5347                      .dwattr $C$DW$703, DW_AT_accessibility(DW_ACCESS_public)
    5348              
    5349              $C$DW$704       .dwtag  DW_TAG_member
    5350                      .dwattr $C$DW$704, DW_AT_type(*$C$DW$T$72)
    5351                      .dwattr $C$DW$704, DW_AT_name("brakeHandle")
    5352                      .dwattr $C$DW$704, DW_AT_TI_symbol_name("_brakeHandle")
    5353                      .dwattr $C$DW$704, DW_AT_data_member_location[DW_OP_plus_uconst 0xfe]
    5354                      .dwattr $C$DW$704, DW_AT_accessibility(DW_ACCESS_public)
    5355              
    5356              $C$DW$705       .dwtag  DW_TAG_member
    5357                      .dwattr $C$DW$705, DW_AT_type(*$C$DW$T$73)
    5358                      .dwattr $C$DW$705, DW_AT_name("brake")
    5359                      .dwattr $C$DW$705, DW_AT_TI_symbol_name("_brake")
    5360                      .dwattr $C$DW$705, DW_AT_data_member_location[DW_OP_plus_uconst 0x100]
    5361                      .dwattr $C$DW$705, DW_AT_accessibility(DW_ACCESS_public)
    5362              
    5363                      .dwendtag $C$DW$T$74
    5364              
    5365              $C$DW$T$258     .dwtag  DW_TAG_typedef
    5366                      .dwattr $C$DW$T$258, DW_AT_name("CTRL_Obj")
    5367                      .dwattr $C$DW$T$258, DW_AT_type(*$C$DW$T$74)
    5368                      .dwattr $C$DW$T$258, DW_AT_language(DW_LANG_C)
    5369              
    5370              $C$DW$T$259     .dwtag  DW_TAG_pointer_type
    5371                      .dwattr $C$DW$T$259, DW_AT_type(*$C$DW$T$258)
    5372                      .dwattr $C$DW$T$259, DW_AT_address_class(0x20)
    5373              
    5374              $C$DW$T$210     .dwtag  DW_TAG_pointer_type
    5375                      .dwattr $C$DW$T$210, DW_AT_type(*$C$DW$T$74)
    5376                      .dwattr $C$DW$T$210, DW_AT_address_class(0x20)
    5377              
TMS320C2000 Assembler PC v15.12.3 Wed Nov 22 01:55:17 2017

Tools Copyright (c) 1996-2015 Texas Instruments Incorporated
C:\Users\wmj\AppData\Local\Temp\1727610                              PAGE  102

    5378              $C$DW$T$211     .dwtag  DW_TAG_typedef
    5379                      .dwattr $C$DW$T$211, DW_AT_name("CTRL_Handle")
    5380                      .dwattr $C$DW$T$211, DW_AT_type(*$C$DW$T$210)
    5381                      .dwattr $C$DW$T$211, DW_AT_language(DW_LANG_C)
    5382              
    5383              
    5384              $C$DW$T$77      .dwtag  DW_TAG_structure_type
    5385                      .dwattr $C$DW$T$77, DW_AT_name("_CTRL_Version_")
    5386                      .dwattr $C$DW$T$77, DW_AT_byte_size(0x04)
    5387              $C$DW$706       .dwtag  DW_TAG_member
    5388                      .dwattr $C$DW$706, DW_AT_type(*$C$DW$T$22)
    5389                      .dwattr $C$DW$706, DW_AT_name("rsvd")
    5390                      .dwattr $C$DW$706, DW_AT_TI_symbol_name("_rsvd")
    5391                      .dwattr $C$DW$706, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    5392                      .dwattr $C$DW$706, DW_AT_accessibility(DW_ACCESS_public)
    5393              
    5394              $C$DW$707       .dwtag  DW_TAG_member
    5395                      .dwattr $C$DW$707, DW_AT_type(*$C$DW$T$76)
    5396                      .dwattr $C$DW$707, DW_AT_name("targetProc")
    5397                      .dwattr $C$DW$707, DW_AT_TI_symbol_name("_targetProc")
    5398                      .dwattr $C$DW$707, DW_AT_data_member_location[DW_OP_plus_uconst 0x1]
    5399                      .dwattr $C$DW$707, DW_AT_accessibility(DW_ACCESS_public)
    5400              
    5401              $C$DW$708       .dwtag  DW_TAG_member
    5402                      .dwattr $C$DW$708, DW_AT_type(*$C$DW$T$22)
    5403                      .dwattr $C$DW$708, DW_AT_name("major")
    5404                      .dwattr $C$DW$708, DW_AT_TI_symbol_name("_major")
    5405                      .dwattr $C$DW$708, DW_AT_data_member_location[DW_OP_plus_uconst 0x2]
    5406                      .dwattr $C$DW$708, DW_AT_accessibility(DW_ACCESS_public)
    5407              
    5408              $C$DW$709       .dwtag  DW_TAG_member
    5409                      .dwattr $C$DW$709, DW_AT_type(*$C$DW$T$22)
    5410                      .dwattr $C$DW$709, DW_AT_name("minor")
    5411                      .dwattr $C$DW$709, DW_AT_TI_symbol_name("_minor")
    5412                      .dwattr $C$DW$709, DW_AT_data_member_location[DW_OP_plus_uconst 0x3]
    5413                      .dwattr $C$DW$709, DW_AT_accessibility(DW_ACCESS_public)
    5414              
    5415                      .dwendtag $C$DW$T$77
    5416              
    5417              $C$DW$T$40      .dwtag  DW_TAG_typedef
    5418                      .dwattr $C$DW$T$40, DW_AT_name("CTRL_Version")
    5419                      .dwattr $C$DW$T$40, DW_AT_type(*$C$DW$T$77)
    5420                      .dwattr $C$DW$T$40, DW_AT_language(DW_LANG_C)
    5421              
    5422              $C$DW$T$266     .dwtag  DW_TAG_pointer_type
    5423                      .dwattr $C$DW$T$266, DW_AT_type(*$C$DW$T$40)
    5424                      .dwattr $C$DW$T$266, DW_AT_address_class(0x20)
    5425              
    5426              
    5427              $C$DW$T$19      .dwtag  DW_TAG_structure_type
    5428                      .dwattr $C$DW$T$19, DW_AT_name("_EST_Obj_")
    5429                      .dwattr $C$DW$T$19, DW_AT_declaration
    5430                      .dwendtag $C$DW$T$19
    5431              
    5432              $C$DW$T$48      .dwtag  DW_TAG_pointer_type
TMS320C2000 Assembler PC v15.12.3 Wed Nov 22 01:55:17 2017

Tools Copyright (c) 1996-2015 Texas Instruments Incorporated
C:\Users\wmj\AppData\Local\Temp\1727610                              PAGE  103

    5433                      .dwattr $C$DW$T$48, DW_AT_type(*$C$DW$T$19)
    5434                      .dwattr $C$DW$T$48, DW_AT_address_class(0x20)
    5435              
    5436              $C$DW$T$49      .dwtag  DW_TAG_typedef
    5437                      .dwattr $C$DW$T$49, DW_AT_name("EST_Handle")
    5438                      .dwattr $C$DW$T$49, DW_AT_type(*$C$DW$T$48)
    5439                      .dwattr $C$DW$T$49, DW_AT_language(DW_LANG_C)
    5440              
    5441              
    5442              $C$DW$T$78      .dwtag  DW_TAG_structure_type
    5443                      .dwattr $C$DW$T$78, DW_AT_name("_FILTER_FO_")
    5444                      .dwattr $C$DW$T$78, DW_AT_byte_size(0x0a)
    5445              $C$DW$710       .dwtag  DW_TAG_member
    5446                      .dwattr $C$DW$710, DW_AT_type(*$C$DW$T$31)
    5447                      .dwattr $C$DW$710, DW_AT_name("a1")
    5448                      .dwattr $C$DW$710, DW_AT_TI_symbol_name("_a1")
    5449                      .dwattr $C$DW$710, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    5450                      .dwattr $C$DW$710, DW_AT_accessibility(DW_ACCESS_public)
    5451              
    5452              $C$DW$711       .dwtag  DW_TAG_member
    5453                      .dwattr $C$DW$711, DW_AT_type(*$C$DW$T$31)
    5454                      .dwattr $C$DW$711, DW_AT_name("b0")
    5455                      .dwattr $C$DW$711, DW_AT_TI_symbol_name("_b0")
    5456                      .dwattr $C$DW$711, DW_AT_data_member_location[DW_OP_plus_uconst 0x2]
    5457                      .dwattr $C$DW$711, DW_AT_accessibility(DW_ACCESS_public)
    5458              
    5459              $C$DW$712       .dwtag  DW_TAG_member
    5460                      .dwattr $C$DW$712, DW_AT_type(*$C$DW$T$31)
    5461                      .dwattr $C$DW$712, DW_AT_name("b1")
    5462                      .dwattr $C$DW$712, DW_AT_TI_symbol_name("_b1")
    5463                      .dwattr $C$DW$712, DW_AT_data_member_location[DW_OP_plus_uconst 0x4]
    5464                      .dwattr $C$DW$712, DW_AT_accessibility(DW_ACCESS_public)
    5465              
    5466              $C$DW$713       .dwtag  DW_TAG_member
    5467                      .dwattr $C$DW$713, DW_AT_type(*$C$DW$T$31)
    5468                      .dwattr $C$DW$713, DW_AT_name("x1")
    5469                      .dwattr $C$DW$713, DW_AT_TI_symbol_name("_x1")
    5470                      .dwattr $C$DW$713, DW_AT_data_member_location[DW_OP_plus_uconst 0x6]
    5471                      .dwattr $C$DW$713, DW_AT_accessibility(DW_ACCESS_public)
    5472              
    5473              $C$DW$714       .dwtag  DW_TAG_member
    5474                      .dwattr $C$DW$714, DW_AT_type(*$C$DW$T$31)
    5475                      .dwattr $C$DW$714, DW_AT_name("y1")
    5476                      .dwattr $C$DW$714, DW_AT_TI_symbol_name("_y1")
    5477                      .dwattr $C$DW$714, DW_AT_data_member_location[DW_OP_plus_uconst 0x8]
    5478                      .dwattr $C$DW$714, DW_AT_accessibility(DW_ACCESS_public)
    5479              
    5480                      .dwendtag $C$DW$T$78
    5481              
    5482              $C$DW$T$191     .dwtag  DW_TAG_typedef
    5483                      .dwattr $C$DW$T$191, DW_AT_name("FILTER_FO_Obj")
    5484                      .dwattr $C$DW$T$191, DW_AT_type(*$C$DW$T$78)
    5485                      .dwattr $C$DW$T$191, DW_AT_language(DW_LANG_C)
    5486              
    5487              
TMS320C2000 Assembler PC v15.12.3 Wed Nov 22 01:55:17 2017

Tools Copyright (c) 1996-2015 Texas Instruments Incorporated
C:\Users\wmj\AppData\Local\Temp\1727610                              PAGE  104

    5488              $C$DW$T$20      .dwtag  DW_TAG_structure_type
    5489                      .dwattr $C$DW$T$20, DW_AT_name("_FILTER_FO_Obj_")
    5490                      .dwattr $C$DW$T$20, DW_AT_declaration
    5491                      .dwendtag $C$DW$T$20
    5492              
    5493              $C$DW$T$192     .dwtag  DW_TAG_pointer_type
    5494                      .dwattr $C$DW$T$192, DW_AT_type(*$C$DW$T$20)
    5495                      .dwattr $C$DW$T$192, DW_AT_address_class(0x20)
    5496              
    5497              $C$DW$T$193     .dwtag  DW_TAG_typedef
    5498                      .dwattr $C$DW$T$193, DW_AT_name("FILTER_FO_Handle")
    5499                      .dwattr $C$DW$T$193, DW_AT_type(*$C$DW$T$192)
    5500                      .dwattr $C$DW$T$193, DW_AT_language(DW_LANG_C)
    5501              
    5502              
    5503              $C$DW$T$79      .dwtag  DW_TAG_structure_type
    5504                      .dwattr $C$DW$T$79, DW_AT_name("_FLASH_Obj_")
    5505                      .dwattr $C$DW$T$79, DW_AT_byte_size(0x08)
    5506              $C$DW$715       .dwtag  DW_TAG_member
    5507                      .dwattr $C$DW$715, DW_AT_type(*$C$DW$T$23)
    5508                      .dwattr $C$DW$715, DW_AT_name("FOPT")
    5509                      .dwattr $C$DW$715, DW_AT_TI_symbol_name("_FOPT")
    5510                      .dwattr $C$DW$715, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    5511                      .dwattr $C$DW$715, DW_AT_accessibility(DW_ACCESS_public)
    5512              
    5513              $C$DW$716       .dwtag  DW_TAG_member
    5514                      .dwattr $C$DW$716, DW_AT_type(*$C$DW$T$23)
    5515                      .dwattr $C$DW$716, DW_AT_name("rsvd_1")
    5516                      .dwattr $C$DW$716, DW_AT_TI_symbol_name("_rsvd_1")
    5517                      .dwattr $C$DW$716, DW_AT_data_member_location[DW_OP_plus_uconst 0x1]
    5518                      .dwattr $C$DW$716, DW_AT_accessibility(DW_ACCESS_public)
    5519              
    5520              $C$DW$717       .dwtag  DW_TAG_member
    5521                      .dwattr $C$DW$717, DW_AT_type(*$C$DW$T$23)
    5522                      .dwattr $C$DW$717, DW_AT_name("FPWR")
    5523                      .dwattr $C$DW$717, DW_AT_TI_symbol_name("_FPWR")
    5524                      .dwattr $C$DW$717, DW_AT_data_member_location[DW_OP_plus_uconst 0x2]
    5525                      .dwattr $C$DW$717, DW_AT_accessibility(DW_ACCESS_public)
    5526              
    5527              $C$DW$718       .dwtag  DW_TAG_member
    5528                      .dwattr $C$DW$718, DW_AT_type(*$C$DW$T$23)
    5529                      .dwattr $C$DW$718, DW_AT_name("FSTATUS")
    5530                      .dwattr $C$DW$718, DW_AT_TI_symbol_name("_FSTATUS")
    5531                      .dwattr $C$DW$718, DW_AT_data_member_location[DW_OP_plus_uconst 0x3]
    5532                      .dwattr $C$DW$718, DW_AT_accessibility(DW_ACCESS_public)
    5533              
    5534              $C$DW$719       .dwtag  DW_TAG_member
    5535                      .dwattr $C$DW$719, DW_AT_type(*$C$DW$T$23)
    5536                      .dwattr $C$DW$719, DW_AT_name("FSTDBYWAIT")
    5537                      .dwattr $C$DW$719, DW_AT_TI_symbol_name("_FSTDBYWAIT")
    5538                      .dwattr $C$DW$719, DW_AT_data_member_location[DW_OP_plus_uconst 0x4]
    5539                      .dwattr $C$DW$719, DW_AT_accessibility(DW_ACCESS_public)
    5540              
    5541              $C$DW$720       .dwtag  DW_TAG_member
    5542                      .dwattr $C$DW$720, DW_AT_type(*$C$DW$T$23)
TMS320C2000 Assembler PC v15.12.3 Wed Nov 22 01:55:17 2017

Tools Copyright (c) 1996-2015 Texas Instruments Incorporated
C:\Users\wmj\AppData\Local\Temp\1727610                              PAGE  105

    5543                      .dwattr $C$DW$720, DW_AT_name("FACTIVEWAIT")
    5544                      .dwattr $C$DW$720, DW_AT_TI_symbol_name("_FACTIVEWAIT")
    5545                      .dwattr $C$DW$720, DW_AT_data_member_location[DW_OP_plus_uconst 0x5]
    5546                      .dwattr $C$DW$720, DW_AT_accessibility(DW_ACCESS_public)
    5547              
    5548              $C$DW$721       .dwtag  DW_TAG_member
    5549                      .dwattr $C$DW$721, DW_AT_type(*$C$DW$T$23)
    5550                      .dwattr $C$DW$721, DW_AT_name("FBANKWAIT")
    5551                      .dwattr $C$DW$721, DW_AT_TI_symbol_name("_FBANKWAIT")
    5552                      .dwattr $C$DW$721, DW_AT_data_member_location[DW_OP_plus_uconst 0x6]
    5553                      .dwattr $C$DW$721, DW_AT_accessibility(DW_ACCESS_public)
    5554              
    5555              $C$DW$722       .dwtag  DW_TAG_member
    5556                      .dwattr $C$DW$722, DW_AT_type(*$C$DW$T$23)
    5557                      .dwattr $C$DW$722, DW_AT_name("FOTPWAIT")
    5558                      .dwattr $C$DW$722, DW_AT_TI_symbol_name("_FOTPWAIT")
    5559                      .dwattr $C$DW$722, DW_AT_data_member_location[DW_OP_plus_uconst 0x7]
    5560                      .dwattr $C$DW$722, DW_AT_accessibility(DW_ACCESS_public)
    5561              
    5562                      .dwendtag $C$DW$T$79
    5563              
    5564              $C$DW$T$124     .dwtag  DW_TAG_pointer_type
    5565                      .dwattr $C$DW$T$124, DW_AT_type(*$C$DW$T$79)
    5566                      .dwattr $C$DW$T$124, DW_AT_address_class(0x20)
    5567              
    5568              $C$DW$T$125     .dwtag  DW_TAG_typedef
    5569                      .dwattr $C$DW$T$125, DW_AT_name("FLASH_Handle")
    5570                      .dwattr $C$DW$T$125, DW_AT_type(*$C$DW$T$124)
    5571                      .dwattr $C$DW$T$125, DW_AT_language(DW_LANG_C)
    5572              
    5573              
    5574              $C$DW$T$99      .dwtag  DW_TAG_structure_type
    5575                      .dwattr $C$DW$T$99, DW_AT_name("_FSM_Obj_")
    5576                      .dwattr $C$DW$T$99, DW_AT_byte_size(0x26)
    5577              $C$DW$723       .dwtag  DW_TAG_member
    5578                      .dwattr $C$DW$723, DW_AT_type(*$C$DW$T$81)
    5579                      .dwattr $C$DW$723, DW_AT_name("motorHandle")
    5580                      .dwattr $C$DW$723, DW_AT_TI_symbol_name("_motorHandle")
    5581                      .dwattr $C$DW$723, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    5582                      .dwattr $C$DW$723, DW_AT_accessibility(DW_ACCESS_public)
    5583              
    5584              $C$DW$724       .dwtag  DW_TAG_member
    5585                      .dwattr $C$DW$724, DW_AT_type(*$C$DW$T$83)
    5586                      .dwattr $C$DW$724, DW_AT_name("halHandle")
    5587                      .dwattr $C$DW$724, DW_AT_TI_symbol_name("_halHandle")
    5588                      .dwattr $C$DW$724, DW_AT_data_member_location[DW_OP_plus_uconst 0x2]
    5589                      .dwattr $C$DW$724, DW_AT_accessibility(DW_ACCESS_public)
    5590              
    5591              $C$DW$725       .dwtag  DW_TAG_member
    5592                      .dwattr $C$DW$725, DW_AT_type(*$C$DW$T$85)
    5593                      .dwattr $C$DW$725, DW_AT_name("StBoxHandle")
    5594                      .dwattr $C$DW$725, DW_AT_TI_symbol_name("_StBoxHandle")
    5595                      .dwattr $C$DW$725, DW_AT_data_member_location[DW_OP_plus_uconst 0x4]
    5596                      .dwattr $C$DW$725, DW_AT_accessibility(DW_ACCESS_public)
    5597              
TMS320C2000 Assembler PC v15.12.3 Wed Nov 22 01:55:17 2017

Tools Copyright (c) 1996-2015 Texas Instruments Incorporated
C:\Users\wmj\AppData\Local\Temp\1727610                              PAGE  106

    5598              $C$DW$726       .dwtag  DW_TAG_member
    5599                      .dwattr $C$DW$726, DW_AT_type(*$C$DW$T$87)
    5600                      .dwattr $C$DW$726, DW_AT_name("FSM_State")
    5601                      .dwattr $C$DW$726, DW_AT_TI_symbol_name("_FSM_State")
    5602                      .dwattr $C$DW$726, DW_AT_data_member_location[DW_OP_plus_uconst 0x6]
    5603                      .dwattr $C$DW$726, DW_AT_accessibility(DW_ACCESS_public)
    5604              
    5605              $C$DW$727       .dwtag  DW_TAG_member
    5606                      .dwattr $C$DW$727, DW_AT_type(*$C$DW$T$87)
    5607                      .dwattr $C$DW$727, DW_AT_name("FSM_CurState")
    5608                      .dwattr $C$DW$727, DW_AT_TI_symbol_name("_FSM_CurState")
    5609                      .dwattr $C$DW$727, DW_AT_data_member_location[DW_OP_plus_uconst 0x7]
    5610                      .dwattr $C$DW$727, DW_AT_accessibility(DW_ACCESS_public)
    5611              
    5612              $C$DW$728       .dwtag  DW_TAG_member
    5613                      .dwattr $C$DW$728, DW_AT_type(*$C$DW$T$89)
    5614                      .dwattr $C$DW$728, DW_AT_name("FSM_Trans")
    5615                      .dwattr $C$DW$728, DW_AT_TI_symbol_name("_FSM_Trans")
    5616                      .dwattr $C$DW$728, DW_AT_data_member_location[DW_OP_plus_uconst 0x8]
    5617                      .dwattr $C$DW$728, DW_AT_accessibility(DW_ACCESS_public)
    5618              
    5619              $C$DW$729       .dwtag  DW_TAG_member
    5620                      .dwattr $C$DW$729, DW_AT_type(*$C$DW$T$91)
    5621                      .dwattr $C$DW$729, DW_AT_name("FSM_Event")
    5622                      .dwattr $C$DW$729, DW_AT_TI_symbol_name("_FSM_Event")
    5623                      .dwattr $C$DW$729, DW_AT_data_member_location[DW_OP_plus_uconst 0x9]
    5624                      .dwattr $C$DW$729, DW_AT_accessibility(DW_ACCESS_public)
    5625              
    5626              $C$DW$730       .dwtag  DW_TAG_member
    5627                      .dwattr $C$DW$730, DW_AT_type(*$C$DW$T$93)
    5628                      .dwattr $C$DW$730, DW_AT_name("FSM_StMode")
    5629                      .dwattr $C$DW$730, DW_AT_TI_symbol_name("_FSM_StMode")
    5630                      .dwattr $C$DW$730, DW_AT_data_member_location[DW_OP_plus_uconst 0xa]
    5631                      .dwattr $C$DW$730, DW_AT_accessibility(DW_ACCESS_public)
    5632              
    5633              $C$DW$731       .dwtag  DW_TAG_member
    5634                      .dwattr $C$DW$731, DW_AT_type(*$C$DW$T$22)
    5635                      .dwattr $C$DW$731, DW_AT_name("FSM_ErrFlg")
    5636                      .dwattr $C$DW$731, DW_AT_TI_symbol_name("_FSM_ErrFlg")
    5637                      .dwattr $C$DW$731, DW_AT_data_member_location[DW_OP_plus_uconst 0xb]
