TMS320C2000 Assembler PC v6.2.5 Mon Oct 30 13:30:06 2017

Tools Copyright (c) 1996-2014 Texas Instruments Incorporated
C:\Users\wmj\AppData\Local\Temp\0833611                              PAGE    1

       1              ;***************************************************************
       2              ;* TMS320C2000 C/C++ Codegen                         PC v6.2.5 *
       3              ;* Date/Time created: Mon Oct 30 13:30:06 2017                 *
       4              ;***************************************************************
       5                      .compiler_opts --float_support=softlib --hll_source=on --mem_model:code=flat --mem_model:data=large -
       6        0002  FP      .set    XAR2
       7              
       8              $C$DW$CU        .dwtag  DW_TAG_compile_unit
       9                      .dwattr $C$DW$CU, DW_AT_name("D:/BM1000/sw/solutions/instaspin_foc/src/proj_lab10e.c")
      10                      .dwattr $C$DW$CU, DW_AT_producer("TMS320C2000 C/C++ Codegen PC v6.2.5 Copyright (c) 1996-2014 Texas I
      11                      .dwattr $C$DW$CU, DW_AT_TI_version(0x01)
      12                      .dwattr $C$DW$CU, DW_AT_comp_dir("D:\BM1000\sw\solutions\instaspin_foc\boards\hvkit_rev1p1\f28x\f2802
      13              ;**************************************************************
      14              ;* CINIT RECORDS                                              *

    3064              $C$DW$578       .dwtag  DW_TAG_enumerator, DW_AT_name("GPIO_Rsvd_30"), DW_AT_const_value(0x1e)
    3065              $C$DW$579       .dwtag  DW_TAG_enumerator, DW_AT_name("GPIO_Rsvd_31"), DW_AT_const_value(0x1f)
    3066              $C$DW$580       .dwtag  DW_TAG_enumerator, DW_AT_name("GPIO_Number_32"), DW_AT_const_value(0x20)
    3067              $C$DW$581       .dwtag  DW_TAG_enumerator, DW_AT_name("GPIO_Number_33"), DW_AT_const_value(0x21)
    3068              $C$DW$582       .dwtag  DW_TAG_enumerator, DW_AT_name("GPIO_Number_34"), DW_AT_const_value(0x22)
    3069              $C$DW$583       .dwtag  DW_TAG_enumerator, DW_AT_name("GPIO_Number_35"), DW_AT_const_value(0x23)
    3070              $C$DW$584       .dwtag  DW_TAG_enumerator, DW_AT_name("GPIO_Number_36"), DW_AT_const_value(0x24)
    3071              $C$DW$585       .dwtag  DW_TAG_enumerator, DW_AT_name("GPIO_Number_37"), DW_AT_const_value(0x25)
    3072              $C$DW$586       .dwtag  DW_TAG_enumerator, DW_AT_name("GPIO_Number_38"), DW_AT_const_value(0x26)
    3073              $C$DW$587       .dwtag  DW_TAG_enumerator, DW_AT_name("GPIO_numGpios"), DW_AT_const_value(0x27)
    3074                      .dwendtag $C$DW$T$259
    3075              
    3076              $C$DW$T$260     .dwtag  DW_TAG_typedef, DW_AT_name("GPIO_Number_e")
    3077                      .dwattr $C$DW$T$260, DW_AT_type(*$C$DW$T$259)
    3078                      .dwattr $C$DW$T$260, DW_AT_language(DW_LANG_C)
    3079              $C$DW$588       .dwtag  DW_TAG_TI_far_type
    3080                      .dwattr $C$DW$588, DW_AT_type(*$C$DW$T$260)
    3081              $C$DW$T$261     .dwtag  DW_TAG_const_type
    3082                      .dwattr $C$DW$T$261, DW_AT_type(*$C$DW$588)
    3083              
    3084              $C$DW$T$262     .dwtag  DW_TAG_enumeration_type
    3085                      .dwattr $C$DW$T$262, DW_AT_byte_size(0x01)
    3086              $C$DW$589       .dwtag  DW_TAG_enumerator, DW_AT_name("PIE_GroupNumber_1"), DW_AT_const_value(0x00)
    3087              $C$DW$590       .dwtag  DW_TAG_enumerator, DW_AT_name("PIE_GroupNumber_2"), DW_AT_const_value(0x01)
    3088              $C$DW$591       .dwtag  DW_TAG_enumerator, DW_AT_name("PIE_GroupNumber_3"), DW_AT_const_value(0x02)
    3089              $C$DW$592       .dwtag  DW_TAG_enumerator, DW_AT_name("PIE_GroupNumber_4"), DW_AT_const_value(0x03)
    3090              $C$DW$593       .dwtag  DW_TAG_enumerator, DW_AT_name("PIE_GroupNumber_5"), DW_AT_const_value(0x04)
    3091              $C$DW$594       .dwtag  DW_TAG_enumerator, DW_AT_name("PIE_GroupNumber_6"), DW_AT_const_value(0x05)
    3092              $C$DW$595       .dwtag  DW_TAG_enumerator, DW_AT_name("PIE_GroupNumber_7"), DW_AT_const_value(0x06)
    3093              $C$DW$596       .dwtag  DW_TAG_enumerator, DW_AT_name("PIE_GroupNumber_8"), DW_AT_const_value(0x07)
    3094              $C$DW$597       .dwtag  DW_TAG_enumerator, DW_AT_name("PIE_GroupNumber_9"), DW_AT_const_value(0x08)
    3095              $C$DW$598       .dwtag  DW_TAG_enumerator, DW_AT_name("PIE_GroupNumber_10"), DW_AT_const_value(0x09)
    3096              $C$DW$599       .dwtag  DW_TAG_enumerator, DW_AT_name("PIE_GroupNumber_11"), DW_AT_const_value(0x0a)
    3097              $C$DW$600       .dwtag  DW_TAG_enumerator, DW_AT_name("PIE_GroupNumber_12"), DW_AT_const_value(0x0b)
    3098                      .dwendtag $C$DW$T$262
    3099              
    3100              $C$DW$T$263     .dwtag  DW_TAG_typedef, DW_AT_name("PIE_GroupNumber_e")
    3101                      .dwattr $C$DW$T$263, DW_AT_type(*$C$DW$T$262)
    3102                      .dwattr $C$DW$T$263, DW_AT_language(DW_LANG_C)
    3103              
    3104              $C$DW$T$265     .dwtag  DW_TAG_enumeration_type
    3105                      .dwattr $C$DW$T$265, DW_AT_byte_size(0x01)
    3106              $C$DW$601       .dwtag  DW_TAG_enumerator, DW_AT_name("PCA955x_PortNum_Port0"), DW_AT_const_value(0x00)
    3107              $C$DW$602       .dwtag  DW_TAG_enumerator, DW_AT_name("PCA955x_PortNum_Port1"), DW_AT_const_value(0x01)
    3108                      .dwendtag $C$DW$T$265
    3109              
    3110              $C$DW$T$266     .dwtag  DW_TAG_typedef, DW_AT_name("PCA955x_PortNum_e")
    3111                      .dwattr $C$DW$T$266, DW_AT_type(*$C$DW$T$265)
    3112                      .dwattr $C$DW$T$266, DW_AT_language(DW_LANG_C)
    3113              
TMS320C2000 Assembler PC v6.2.5 Mon Oct 30 13:30:06 2017

Tools Copyright (c) 1996-2014 Texas Instruments Incorporated
C:\Users\wmj\AppData\Local\Temp\0833611                              PAGE   61

    3114              $C$DW$T$19      .dwtag  DW_TAG_structure_type
    3115                      .dwattr $C$DW$T$19, DW_AT_name("I2C_Obj")
    3116                      .dwattr $C$DW$T$19, DW_AT_declaration
    3117                      .dwendtag $C$DW$T$19
    3118              
    3119              $C$DW$T$149     .dwtag  DW_TAG_pointer_type
    3120                      .dwattr $C$DW$T$149, DW_AT_type(*$C$DW$T$19)
    3121                      .dwattr $C$DW$T$149, DW_AT_address_class(0x16)
    3122              $C$DW$T$150     .dwtag  DW_TAG_typedef, DW_AT_name("I2C_Handle")
    3123                      .dwattr $C$DW$T$150, DW_AT_type(*$C$DW$T$149)
    3124                      .dwattr $C$DW$T$150, DW_AT_language(DW_LANG_C)
    3125              
    3126              $C$DW$T$31      .dwtag  DW_TAG_structure_type
    3127                      .dwattr $C$DW$T$31, DW_AT_name("_ADC_Obj_")
    3128                      .dwattr $C$DW$T$31, DW_AT_byte_size(0x6650)
    3129              $C$DW$603       .dwtag  DW_TAG_member
    3130                      .dwattr $C$DW$603, DW_AT_type(*$C$DW$T$25)
    3131                      .dwattr $C$DW$603, DW_AT_name("ADCRESULT")
    3132                      .dwattr $C$DW$603, DW_AT_TI_symbol_name("_ADCRESULT")
    3133                      .dwattr $C$DW$603, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    3134                      .dwattr $C$DW$603, DW_AT_accessibility(DW_ACCESS_public)
    3135              $C$DW$604       .dwtag  DW_TAG_member
    3136                      .dwattr $C$DW$604, DW_AT_type(*$C$DW$T$26)
    3137                      .dwattr $C$DW$604, DW_AT_name("resvd_1")
    3138                      .dwattr $C$DW$604, DW_AT_TI_symbol_name("_resvd_1")
    3139                      .dwattr $C$DW$604, DW_AT_data_member_location[DW_OP_plus_uconst 0x10]
    3140                      .dwattr $C$DW$604, DW_AT_accessibility(DW_ACCESS_public)
    3141              $C$DW$605       .dwtag  DW_TAG_member
    3142                      .dwattr $C$DW$605, DW_AT_type(*$C$DW$T$24)
    3143                      .dwattr $C$DW$605, DW_AT_name("ADCCTL1")
    3144                      .dwattr $C$DW$605, DW_AT_TI_symbol_name("_ADCCTL1")
    3145                      .dwattr $C$DW$605, DW_AT_data_member_location[DW_OP_plus_uconst 0x6600]
    3146                      .dwattr $C$DW$605, DW_AT_accessibility(DW_ACCESS_public)
    3147              $C$DW$606       .dwtag  DW_TAG_member
    3148                      .dwattr $C$DW$606, DW_AT_type(*$C$DW$T$24)
    3149                      .dwattr $C$DW$606, DW_AT_name("ADCCTL2")
    3150                      .dwattr $C$DW$606, DW_AT_TI_symbol_name("_ADCCTL2")
    3151                      .dwattr $C$DW$606, DW_AT_data_member_location[DW_OP_plus_uconst 0x6601]
    3152                      .dwattr $C$DW$606, DW_AT_accessibility(DW_ACCESS_public)
    3153              $C$DW$607       .dwtag  DW_TAG_member
    3154                      .dwattr $C$DW$607, DW_AT_type(*$C$DW$T$27)
    3155                      .dwattr $C$DW$607, DW_AT_name("rsvd_2")
    3156                      .dwattr $C$DW$607, DW_AT_TI_symbol_name("_rsvd_2")
    3157                      .dwattr $C$DW$607, DW_AT_data_member_location[DW_OP_plus_uconst 0x6602]
    3158                      .dwattr $C$DW$607, DW_AT_accessibility(DW_ACCESS_public)
    3159              $C$DW$608       .dwtag  DW_TAG_member
    3160                      .dwattr $C$DW$608, DW_AT_type(*$C$DW$T$24)
    3161                      .dwattr $C$DW$608, DW_AT_name("ADCINTFLG")
    3162                      .dwattr $C$DW$608, DW_AT_TI_symbol_name("_ADCINTFLG")
    3163                      .dwattr $C$DW$608, DW_AT_data_member_location[DW_OP_plus_uconst 0x6604]
    3164                      .dwattr $C$DW$608, DW_AT_accessibility(DW_ACCESS_public)
    3165              $C$DW$609       .dwtag  DW_TAG_member
    3166                      .dwattr $C$DW$609, DW_AT_type(*$C$DW$T$24)
    3167                      .dwattr $C$DW$609, DW_AT_name("ADCINTFLGCLR")
    3168                      .dwattr $C$DW$609, DW_AT_TI_symbol_name("_ADCINTFLGCLR")
TMS320C2000 Assembler PC v6.2.5 Mon Oct 30 13:30:06 2017

Tools Copyright (c) 1996-2014 Texas Instruments Incorporated
C:\Users\wmj\AppData\Local\Temp\0833611                              PAGE   62

    3169                      .dwattr $C$DW$609, DW_AT_data_member_location[DW_OP_plus_uconst 0x6605]
    3170                      .dwattr $C$DW$609, DW_AT_accessibility(DW_ACCESS_public)
    3171              $C$DW$610       .dwtag  DW_TAG_member
    3172                      .dwattr $C$DW$610, DW_AT_type(*$C$DW$T$24)
    3173                      .dwattr $C$DW$610, DW_AT_name("ADCINTOVF")
    3174                      .dwattr $C$DW$610, DW_AT_TI_symbol_name("_ADCINTOVF")
    3175                      .dwattr $C$DW$610, DW_AT_data_member_location[DW_OP_plus_uconst 0x6606]
    3176                      .dwattr $C$DW$610, DW_AT_accessibility(DW_ACCESS_public)
    3177              $C$DW$611       .dwtag  DW_TAG_member
    3178                      .dwattr $C$DW$611, DW_AT_type(*$C$DW$T$24)
    3179                      .dwattr $C$DW$611, DW_AT_name("ADCINTOVFCLR")
    3180                      .dwattr $C$DW$611, DW_AT_TI_symbol_name("_ADCINTOVFCLR")
    3181                      .dwattr $C$DW$611, DW_AT_data_member_location[DW_OP_plus_uconst 0x6607]
    3182                      .dwattr $C$DW$611, DW_AT_accessibility(DW_ACCESS_public)
    3183              $C$DW$612       .dwtag  DW_TAG_member
    3184                      .dwattr $C$DW$612, DW_AT_type(*$C$DW$T$28)
    3185                      .dwattr $C$DW$612, DW_AT_name("INTSELxNy")
    3186                      .dwattr $C$DW$612, DW_AT_TI_symbol_name("_INTSELxNy")
    3187                      .dwattr $C$DW$612, DW_AT_data_member_location[DW_OP_plus_uconst 0x6608]
    3188                      .dwattr $C$DW$612, DW_AT_accessibility(DW_ACCESS_public)
    3189              $C$DW$613       .dwtag  DW_TAG_member
    3190                      .dwattr $C$DW$613, DW_AT_type(*$C$DW$T$29)
    3191                      .dwattr $C$DW$613, DW_AT_name("rsvd_3")
    3192                      .dwattr $C$DW$613, DW_AT_TI_symbol_name("_rsvd_3")
    3193                      .dwattr $C$DW$613, DW_AT_data_member_location[DW_OP_plus_uconst 0x660d]
    3194                      .dwattr $C$DW$613, DW_AT_accessibility(DW_ACCESS_public)
    3195              $C$DW$614       .dwtag  DW_TAG_member
    3196                      .dwattr $C$DW$614, DW_AT_type(*$C$DW$T$24)
    3197                      .dwattr $C$DW$614, DW_AT_name("SOCPRICTRL")
    3198                      .dwattr $C$DW$614, DW_AT_TI_symbol_name("_SOCPRICTRL")
    3199                      .dwattr $C$DW$614, DW_AT_data_member_location[DW_OP_plus_uconst 0x6610]
    3200                      .dwattr $C$DW$614, DW_AT_accessibility(DW_ACCESS_public)
    3201              $C$DW$615       .dwtag  DW_TAG_member
    3202                      .dwattr $C$DW$615, DW_AT_type(*$C$DW$T$24)
    3203                      .dwattr $C$DW$615, DW_AT_name("rsvd_4")
    3204                      .dwattr $C$DW$615, DW_AT_TI_symbol_name("_rsvd_4")
    3205                      .dwattr $C$DW$615, DW_AT_data_member_location[DW_OP_plus_uconst 0x6611]
    3206                      .dwattr $C$DW$615, DW_AT_accessibility(DW_ACCESS_public)
    3207              $C$DW$616       .dwtag  DW_TAG_member
    3208                      .dwattr $C$DW$616, DW_AT_type(*$C$DW$T$24)
    3209                      .dwattr $C$DW$616, DW_AT_name("ADCSAMPLEMODE")
    3210                      .dwattr $C$DW$616, DW_AT_TI_symbol_name("_ADCSAMPLEMODE")
    3211                      .dwattr $C$DW$616, DW_AT_data_member_location[DW_OP_plus_uconst 0x6612]
    3212                      .dwattr $C$DW$616, DW_AT_accessibility(DW_ACCESS_public)
    3213              $C$DW$617       .dwtag  DW_TAG_member
    3214                      .dwattr $C$DW$617, DW_AT_type(*$C$DW$T$24)
    3215                      .dwattr $C$DW$617, DW_AT_name("rsvd_5")
    3216                      .dwattr $C$DW$617, DW_AT_TI_symbol_name("_rsvd_5")
    3217                      .dwattr $C$DW$617, DW_AT_data_member_location[DW_OP_plus_uconst 0x6613]
    3218                      .dwattr $C$DW$617, DW_AT_accessibility(DW_ACCESS_public)
    3219              $C$DW$618       .dwtag  DW_TAG_member
    3220                      .dwattr $C$DW$618, DW_AT_type(*$C$DW$T$24)
    3221                      .dwattr $C$DW$618, DW_AT_name("ADCINTSOCSEL1")
    3222                      .dwattr $C$DW$618, DW_AT_TI_symbol_name("_ADCINTSOCSEL1")
    3223                      .dwattr $C$DW$618, DW_AT_data_member_location[DW_OP_plus_uconst 0x6614]
TMS320C2000 Assembler PC v6.2.5 Mon Oct 30 13:30:06 2017

Tools Copyright (c) 1996-2014 Texas Instruments Incorporated
C:\Users\wmj\AppData\Local\Temp\0833611                              PAGE   63

    3224                      .dwattr $C$DW$618, DW_AT_accessibility(DW_ACCESS_public)
    3225              $C$DW$619       .dwtag  DW_TAG_member
    3226                      .dwattr $C$DW$619, DW_AT_type(*$C$DW$T$24)
    3227                      .dwattr $C$DW$619, DW_AT_name("ADCINTSOCSEL2")
    3228                      .dwattr $C$DW$619, DW_AT_TI_symbol_name("_ADCINTSOCSEL2")
    3229                      .dwattr $C$DW$619, DW_AT_data_member_location[DW_OP_plus_uconst 0x6615]
    3230                      .dwattr $C$DW$619, DW_AT_accessibility(DW_ACCESS_public)
    3231              $C$DW$620       .dwtag  DW_TAG_member
    3232                      .dwattr $C$DW$620, DW_AT_type(*$C$DW$T$27)
    3233                      .dwattr $C$DW$620, DW_AT_name("rsvd_6")
    3234                      .dwattr $C$DW$620, DW_AT_TI_symbol_name("_rsvd_6")
    3235                      .dwattr $C$DW$620, DW_AT_data_member_location[DW_OP_plus_uconst 0x6616]
    3236                      .dwattr $C$DW$620, DW_AT_accessibility(DW_ACCESS_public)
    3237              $C$DW$621       .dwtag  DW_TAG_member
    3238                      .dwattr $C$DW$621, DW_AT_type(*$C$DW$T$24)
    3239                      .dwattr $C$DW$621, DW_AT_name("ADCSOCFLG1")
    3240                      .dwattr $C$DW$621, DW_AT_TI_symbol_name("_ADCSOCFLG1")
    3241                      .dwattr $C$DW$621, DW_AT_data_member_location[DW_OP_plus_uconst 0x6618]
    3242                      .dwattr $C$DW$621, DW_AT_accessibility(DW_ACCESS_public)
    3243              $C$DW$622       .dwtag  DW_TAG_member
    3244                      .dwattr $C$DW$622, DW_AT_type(*$C$DW$T$24)
    3245                      .dwattr $C$DW$622, DW_AT_name("rsvd_7")
    3246                      .dwattr $C$DW$622, DW_AT_TI_symbol_name("_rsvd_7")
    3247                      .dwattr $C$DW$622, DW_AT_data_member_location[DW_OP_plus_uconst 0x6619]
    3248                      .dwattr $C$DW$622, DW_AT_accessibility(DW_ACCESS_public)
    3249              $C$DW$623       .dwtag  DW_TAG_member
    3250                      .dwattr $C$DW$623, DW_AT_type(*$C$DW$T$24)
    3251                      .dwattr $C$DW$623, DW_AT_name("ADCSOCFRC1")
    3252                      .dwattr $C$DW$623, DW_AT_TI_symbol_name("_ADCSOCFRC1")
    3253                      .dwattr $C$DW$623, DW_AT_data_member_location[DW_OP_plus_uconst 0x661a]
    3254                      .dwattr $C$DW$623, DW_AT_accessibility(DW_ACCESS_public)
    3255              $C$DW$624       .dwtag  DW_TAG_member
    3256                      .dwattr $C$DW$624, DW_AT_type(*$C$DW$T$24)
    3257                      .dwattr $C$DW$624, DW_AT_name("rsvd_8")
    3258                      .dwattr $C$DW$624, DW_AT_TI_symbol_name("_rsvd_8")
    3259                      .dwattr $C$DW$624, DW_AT_data_member_location[DW_OP_plus_uconst 0x661b]
    3260                      .dwattr $C$DW$624, DW_AT_accessibility(DW_ACCESS_public)
    3261              $C$DW$625       .dwtag  DW_TAG_member
    3262                      .dwattr $C$DW$625, DW_AT_type(*$C$DW$T$24)
    3263                      .dwattr $C$DW$625, DW_AT_name("ADCSOCOVF1")
    3264                      .dwattr $C$DW$625, DW_AT_TI_symbol_name("_ADCSOCOVF1")
    3265                      .dwattr $C$DW$625, DW_AT_data_member_location[DW_OP_plus_uconst 0x661c]
    3266                      .dwattr $C$DW$625, DW_AT_accessibility(DW_ACCESS_public)
    3267              $C$DW$626       .dwtag  DW_TAG_member
    3268                      .dwattr $C$DW$626, DW_AT_type(*$C$DW$T$24)
    3269                      .dwattr $C$DW$626, DW_AT_name("rsvd_9")
    3270                      .dwattr $C$DW$626, DW_AT_TI_symbol_name("_rsvd_9")
    3271                      .dwattr $C$DW$626, DW_AT_data_member_location[DW_OP_plus_uconst 0x661d]
    3272                      .dwattr $C$DW$626, DW_AT_accessibility(DW_ACCESS_public)
    3273              $C$DW$627       .dwtag  DW_TAG_member
    3274                      .dwattr $C$DW$627, DW_AT_type(*$C$DW$T$24)
    3275                      .dwattr $C$DW$627, DW_AT_name("ADCSOCOVFCLR1")
    3276                      .dwattr $C$DW$627, DW_AT_TI_symbol_name("_ADCSOCOVFCLR1")
    3277                      .dwattr $C$DW$627, DW_AT_data_member_location[DW_OP_plus_uconst 0x661e]
    3278                      .dwattr $C$DW$627, DW_AT_accessibility(DW_ACCESS_public)
TMS320C2000 Assembler PC v6.2.5 Mon Oct 30 13:30:06 2017

Tools Copyright (c) 1996-2014 Texas Instruments Incorporated
C:\Users\wmj\AppData\Local\Temp\0833611                              PAGE   64

    3279              $C$DW$628       .dwtag  DW_TAG_member
    3280                      .dwattr $C$DW$628, DW_AT_type(*$C$DW$T$24)
    3281                      .dwattr $C$DW$628, DW_AT_name("rsvd_10")
    3282                      .dwattr $C$DW$628, DW_AT_TI_symbol_name("_rsvd_10")
    3283                      .dwattr $C$DW$628, DW_AT_data_member_location[DW_OP_plus_uconst 0x661f]
    3284                      .dwattr $C$DW$628, DW_AT_accessibility(DW_ACCESS_public)
    3285              $C$DW$629       .dwtag  DW_TAG_member
    3286                      .dwattr $C$DW$629, DW_AT_type(*$C$DW$T$25)
    3287                      .dwattr $C$DW$629, DW_AT_name("ADCSOCxCTL")
    3288                      .dwattr $C$DW$629, DW_AT_TI_symbol_name("_ADCSOCxCTL")
    3289                      .dwattr $C$DW$629, DW_AT_data_member_location[DW_OP_plus_uconst 0x6620]
    3290                      .dwattr $C$DW$629, DW_AT_accessibility(DW_ACCESS_public)
    3291              $C$DW$630       .dwtag  DW_TAG_member
    3292                      .dwattr $C$DW$630, DW_AT_type(*$C$DW$T$25)
    3293                      .dwattr $C$DW$630, DW_AT_name("rsvd_11")
    3294                      .dwattr $C$DW$630, DW_AT_TI_symbol_name("_rsvd_11")
    3295                      .dwattr $C$DW$630, DW_AT_data_member_location[DW_OP_plus_uconst 0x6630]
    3296                      .dwattr $C$DW$630, DW_AT_accessibility(DW_ACCESS_public)
    3297              $C$DW$631       .dwtag  DW_TAG_member
    3298                      .dwattr $C$DW$631, DW_AT_type(*$C$DW$T$24)
    3299                      .dwattr $C$DW$631, DW_AT_name("ADCREFTRIM")
    3300                      .dwattr $C$DW$631, DW_AT_TI_symbol_name("_ADCREFTRIM")
    3301                      .dwattr $C$DW$631, DW_AT_data_member_location[DW_OP_plus_uconst 0x6640]
    3302                      .dwattr $C$DW$631, DW_AT_accessibility(DW_ACCESS_public)
    3303              $C$DW$632       .dwtag  DW_TAG_member
    3304                      .dwattr $C$DW$632, DW_AT_type(*$C$DW$T$24)
    3305                      .dwattr $C$DW$632, DW_AT_name("ADCOFFTRIM")
    3306                      .dwattr $C$DW$632, DW_AT_TI_symbol_name("_ADCOFFTRIM")
    3307                      .dwattr $C$DW$632, DW_AT_data_member_location[DW_OP_plus_uconst 0x6641]
    3308                      .dwattr $C$DW$632, DW_AT_accessibility(DW_ACCESS_public)
    3309              $C$DW$633       .dwtag  DW_TAG_member
    3310                      .dwattr $C$DW$633, DW_AT_type(*$C$DW$T$30)
    3311                      .dwattr $C$DW$633, DW_AT_name("resvd_12")
    3312                      .dwattr $C$DW$633, DW_AT_TI_symbol_name("_resvd_12")
    3313                      .dwattr $C$DW$633, DW_AT_data_member_location[DW_OP_plus_uconst 0x6642]
    3314                      .dwattr $C$DW$633, DW_AT_accessibility(DW_ACCESS_public)
    3315              $C$DW$634       .dwtag  DW_TAG_member
    3316                      .dwattr $C$DW$634, DW_AT_type(*$C$DW$T$24)
    3317                      .dwattr $C$DW$634, DW_AT_name("ADCREV")
    3318                      .dwattr $C$DW$634, DW_AT_TI_symbol_name("_ADCREV")
    3319                      .dwattr $C$DW$634, DW_AT_data_member_location[DW_OP_plus_uconst 0x664f]
    3320                      .dwattr $C$DW$634, DW_AT_accessibility(DW_ACCESS_public)
    3321                      .dwendtag $C$DW$T$31
    3322              
    3323              $C$DW$T$267     .dwtag  DW_TAG_typedef, DW_AT_name("ADC_Obj")
    3324                      .dwattr $C$DW$T$267, DW_AT_type(*$C$DW$T$31)
    3325                      .dwattr $C$DW$T$267, DW_AT_language(DW_LANG_C)
    3326              $C$DW$T$120     .dwtag  DW_TAG_pointer_type
    3327                      .dwattr $C$DW$T$120, DW_AT_type(*$C$DW$T$31)
    3328                      .dwattr $C$DW$T$120, DW_AT_address_class(0x16)
    3329              $C$DW$T$121     .dwtag  DW_TAG_typedef, DW_AT_name("ADC_Handle")
    3330                      .dwattr $C$DW$T$121, DW_AT_type(*$C$DW$T$120)
    3331                      .dwattr $C$DW$T$121, DW_AT_language(DW_LANG_C)
    3332              
    3333              $C$DW$T$35      .dwtag  DW_TAG_structure_type
TMS320C2000 Assembler PC v6.2.5 Mon Oct 30 13:30:06 2017

Tools Copyright (c) 1996-2014 Texas Instruments Incorporated
C:\Users\wmj\AppData\Local\Temp\0833611                              PAGE   65

    3334                      .dwattr $C$DW$T$35, DW_AT_name("_BRAKE_Obj_")
    3335                      .dwattr $C$DW$T$35, DW_AT_byte_size(0x08)
    3336              $C$DW$635       .dwtag  DW_TAG_member
    3337                      .dwattr $C$DW$635, DW_AT_type(*$C$DW$T$32)
    3338                      .dwattr $C$DW$635, DW_AT_name("angle_pu")
    3339                      .dwattr $C$DW$635, DW_AT_TI_symbol_name("_angle_pu")
    3340                      .dwattr $C$DW$635, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    3341                      .dwattr $C$DW$635, DW_AT_accessibility(DW_ACCESS_public)
    3342              $C$DW$636       .dwtag  DW_TAG_member
    3343                      .dwattr $C$DW$636, DW_AT_type(*$C$DW$T$33)
    3344                      .dwattr $C$DW$636, DW_AT_name("Idq_brake")
    3345                      .dwattr $C$DW$636, DW_AT_TI_symbol_name("_Idq_brake")
    3346                      .dwattr $C$DW$636, DW_AT_data_member_location[DW_OP_plus_uconst 0x2]
    3347                      .dwattr $C$DW$636, DW_AT_accessibility(DW_ACCESS_public)
    3348              $C$DW$637       .dwtag  DW_TAG_member
    3349                      .dwattr $C$DW$637, DW_AT_type(*$C$DW$T$34)
    3350                      .dwattr $C$DW$637, DW_AT_name("brake_enable")
    3351                      .dwattr $C$DW$637, DW_AT_TI_symbol_name("_brake_enable")
    3352                      .dwattr $C$DW$637, DW_AT_data_member_location[DW_OP_plus_uconst 0x6]
    3353                      .dwattr $C$DW$637, DW_AT_accessibility(DW_ACCESS_public)
    3354                      .dwendtag $C$DW$T$35
    3355              
    3356              $C$DW$T$75      .dwtag  DW_TAG_typedef, DW_AT_name("BRAKE_Obj")
    3357                      .dwattr $C$DW$T$75, DW_AT_type(*$C$DW$T$35)
    3358                      .dwattr $C$DW$T$75, DW_AT_language(DW_LANG_C)
    3359              $C$DW$T$73      .dwtag  DW_TAG_pointer_type
    3360                      .dwattr $C$DW$T$73, DW_AT_type(*$C$DW$T$35)
    3361                      .dwattr $C$DW$T$73, DW_AT_address_class(0x16)
    3362              $C$DW$T$74      .dwtag  DW_TAG_typedef, DW_AT_name("BRAKE_Handle")
    3363                      .dwattr $C$DW$T$74, DW_AT_type(*$C$DW$T$73)
    3364                      .dwattr $C$DW$T$74, DW_AT_language(DW_LANG_C)
    3365              
    3366              $C$DW$T$37      .dwtag  DW_TAG_structure_type
    3367                      .dwattr $C$DW$T$37, DW_AT_name("_CLARKE_Obj_")
    3368                      .dwattr $C$DW$T$37, DW_AT_byte_size(0x06)
    3369              $C$DW$638       .dwtag  DW_TAG_member
    3370                      .dwattr $C$DW$638, DW_AT_type(*$C$DW$T$32)
    3371                      .dwattr $C$DW$638, DW_AT_name("alpha_sf")
    3372                      .dwattr $C$DW$638, DW_AT_TI_symbol_name("_alpha_sf")
    3373                      .dwattr $C$DW$638, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    3374                      .dwattr $C$DW$638, DW_AT_accessibility(DW_ACCESS_public)
    3375              $C$DW$639       .dwtag  DW_TAG_member
    3376                      .dwattr $C$DW$639, DW_AT_type(*$C$DW$T$32)
    3377                      .dwattr $C$DW$639, DW_AT_name("beta_sf")
    3378                      .dwattr $C$DW$639, DW_AT_TI_symbol_name("_beta_sf")
    3379                      .dwattr $C$DW$639, DW_AT_data_member_location[DW_OP_plus_uconst 0x2]
    3380                      .dwattr $C$DW$639, DW_AT_accessibility(DW_ACCESS_public)
    3381              $C$DW$640       .dwtag  DW_TAG_member
    3382                      .dwattr $C$DW$640, DW_AT_type(*$C$DW$T$36)
    3383                      .dwattr $C$DW$640, DW_AT_name("numSensors")
    3384                      .dwattr $C$DW$640, DW_AT_TI_symbol_name("_numSensors")
    3385                      .dwattr $C$DW$640, DW_AT_data_member_location[DW_OP_plus_uconst 0x4]
    3386                      .dwattr $C$DW$640, DW_AT_accessibility(DW_ACCESS_public)
    3387                      .dwendtag $C$DW$T$37
    3388              
TMS320C2000 Assembler PC v6.2.5 Mon Oct 30 13:30:06 2017

Tools Copyright (c) 1996-2014 Texas Instruments Incorporated
C:\Users\wmj\AppData\Local\Temp\0833611                              PAGE   66

    3389              $C$DW$T$48      .dwtag  DW_TAG_typedef, DW_AT_name("CLARKE_Obj")
    3390                      .dwattr $C$DW$T$48, DW_AT_type(*$C$DW$T$37)
    3391                      .dwattr $C$DW$T$48, DW_AT_language(DW_LANG_C)
    3392              $C$DW$T$46      .dwtag  DW_TAG_pointer_type
    3393                      .dwattr $C$DW$T$46, DW_AT_type(*$C$DW$T$37)
    3394                      .dwattr $C$DW$T$46, DW_AT_address_class(0x16)
    3395              $C$DW$T$47      .dwtag  DW_TAG_typedef, DW_AT_name("CLARKE_Handle")
    3396                      .dwattr $C$DW$T$47, DW_AT_type(*$C$DW$T$46)
    3397                      .dwattr $C$DW$T$47, DW_AT_language(DW_LANG_C)
    3398              
    3399              $C$DW$T$39      .dwtag  DW_TAG_structure_type
    3400                      .dwattr $C$DW$T$39, DW_AT_name("_CLK_Obj_")
    3401                      .dwattr $C$DW$T$39, DW_AT_byte_size(0x11)
    3402              $C$DW$641       .dwtag  DW_TAG_member
    3403                      .dwattr $C$DW$641, DW_AT_type(*$C$DW$T$24)
    3404                      .dwattr $C$DW$641, DW_AT_name("XCLK")
    3405                      .dwattr $C$DW$641, DW_AT_TI_symbol_name("_XCLK")
    3406                      .dwattr $C$DW$641, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    3407                      .dwattr $C$DW$641, DW_AT_accessibility(DW_ACCESS_public)
    3408              $C$DW$642       .dwtag  DW_TAG_member
    3409                      .dwattr $C$DW$642, DW_AT_type(*$C$DW$T$24)
    3410                      .dwattr $C$DW$642, DW_AT_name("rsvd_1")
    3411                      .dwattr $C$DW$642, DW_AT_TI_symbol_name("_rsvd_1")
    3412                      .dwattr $C$DW$642, DW_AT_data_member_location[DW_OP_plus_uconst 0x1]
    3413                      .dwattr $C$DW$642, DW_AT_accessibility(DW_ACCESS_public)
    3414              $C$DW$643       .dwtag  DW_TAG_member
    3415                      .dwattr $C$DW$643, DW_AT_type(*$C$DW$T$24)
    3416                      .dwattr $C$DW$643, DW_AT_name("CLKCTL")
    3417                      .dwattr $C$DW$643, DW_AT_TI_symbol_name("_CLKCTL")
    3418                      .dwattr $C$DW$643, DW_AT_data_member_location[DW_OP_plus_uconst 0x2]
    3419                      .dwattr $C$DW$643, DW_AT_accessibility(DW_ACCESS_public)
    3420              $C$DW$644       .dwtag  DW_TAG_member
    3421                      .dwattr $C$DW$644, DW_AT_type(*$C$DW$T$38)
    3422                      .dwattr $C$DW$644, DW_AT_name("rsvd_2")
    3423                      .dwattr $C$DW$644, DW_AT_TI_symbol_name("_rsvd_2")
    3424                      .dwattr $C$DW$644, DW_AT_data_member_location[DW_OP_plus_uconst 0x3]
    3425                      .dwattr $C$DW$644, DW_AT_accessibility(DW_ACCESS_public)
    3426              $C$DW$645       .dwtag  DW_TAG_member
    3427                      .dwattr $C$DW$645, DW_AT_type(*$C$DW$T$24)
    3428                      .dwattr $C$DW$645, DW_AT_name("LOSPCP")
    3429                      .dwattr $C$DW$645, DW_AT_TI_symbol_name("_LOSPCP")
    3430                      .dwattr $C$DW$645, DW_AT_data_member_location[DW_OP_plus_uconst 0xb]
    3431                      .dwattr $C$DW$645, DW_AT_accessibility(DW_ACCESS_public)
    3432              $C$DW$646       .dwtag  DW_TAG_member
    3433                      .dwattr $C$DW$646, DW_AT_type(*$C$DW$T$24)
    3434                      .dwattr $C$DW$646, DW_AT_name("PCLKCR0")
    3435                      .dwattr $C$DW$646, DW_AT_TI_symbol_name("_PCLKCR0")
    3436                      .dwattr $C$DW$646, DW_AT_data_member_location[DW_OP_plus_uconst 0xc]
    3437                      .dwattr $C$DW$646, DW_AT_accessibility(DW_ACCESS_public)
    3438              $C$DW$647       .dwtag  DW_TAG_member
    3439                      .dwattr $C$DW$647, DW_AT_type(*$C$DW$T$24)
    3440                      .dwattr $C$DW$647, DW_AT_name("PCLKCR1")
    3441                      .dwattr $C$DW$647, DW_AT_TI_symbol_name("_PCLKCR1")
    3442                      .dwattr $C$DW$647, DW_AT_data_member_location[DW_OP_plus_uconst 0xd]
    3443                      .dwattr $C$DW$647, DW_AT_accessibility(DW_ACCESS_public)
TMS320C2000 Assembler PC v6.2.5 Mon Oct 30 13:30:06 2017

Tools Copyright (c) 1996-2014 Texas Instruments Incorporated
C:\Users\wmj\AppData\Local\Temp\0833611                              PAGE   67

    3444              $C$DW$648       .dwtag  DW_TAG_member
    3445                      .dwattr $C$DW$648, DW_AT_type(*$C$DW$T$27)
    3446                      .dwattr $C$DW$648, DW_AT_name("rsvd_3")
    3447                      .dwattr $C$DW$648, DW_AT_TI_symbol_name("_rsvd_3")
    3448                      .dwattr $C$DW$648, DW_AT_data_member_location[DW_OP_plus_uconst 0xe]
    3449                      .dwattr $C$DW$648, DW_AT_accessibility(DW_ACCESS_public)
    3450              $C$DW$649       .dwtag  DW_TAG_member
    3451                      .dwattr $C$DW$649, DW_AT_type(*$C$DW$T$24)
    3452                      .dwattr $C$DW$649, DW_AT_name("PCLKCR3")
    3453                      .dwattr $C$DW$649, DW_AT_TI_symbol_name("_PCLKCR3")
    3454                      .dwattr $C$DW$649, DW_AT_data_member_location[DW_OP_plus_uconst 0x10]
    3455                      .dwattr $C$DW$649, DW_AT_accessibility(DW_ACCESS_public)
    3456                      .dwendtag $C$DW$T$39
    3457              
    3458              $C$DW$T$122     .dwtag  DW_TAG_pointer_type
    3459                      .dwattr $C$DW$T$122, DW_AT_type(*$C$DW$T$39)
    3460                      .dwattr $C$DW$T$122, DW_AT_address_class(0x16)
    3461              $C$DW$T$123     .dwtag  DW_TAG_typedef, DW_AT_name("CLK_Handle")
    3462                      .dwattr $C$DW$T$123, DW_AT_type(*$C$DW$T$122)
    3463                      .dwattr $C$DW$T$123, DW_AT_language(DW_LANG_C)
    3464              
    3465              $C$DW$T$40      .dwtag  DW_TAG_structure_type
    3466                      .dwattr $C$DW$T$40, DW_AT_name("_CPU_Obj_")
    3467                      .dwattr $C$DW$T$40, DW_AT_byte_size(0x01)
    3468              $C$DW$650       .dwtag  DW_TAG_member
    3469                      .dwattr $C$DW$650, DW_AT_type(*$C$DW$T$36)
    3470                      .dwattr $C$DW$650, DW_AT_name("tmp")
    3471                      .dwattr $C$DW$650, DW_AT_TI_symbol_name("_tmp")
    3472                      .dwattr $C$DW$650, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    3473                      .dwattr $C$DW$650, DW_AT_accessibility(DW_ACCESS_public)
    3474                      .dwendtag $C$DW$T$40
    3475              
    3476              $C$DW$T$124     .dwtag  DW_TAG_pointer_type
    3477                      .dwattr $C$DW$T$124, DW_AT_type(*$C$DW$T$40)
    3478                      .dwattr $C$DW$T$124, DW_AT_address_class(0x16)
    3479              $C$DW$T$125     .dwtag  DW_TAG_typedef, DW_AT_name("CPU_Handle")
    3480                      .dwattr $C$DW$T$125, DW_AT_type(*$C$DW$T$124)
    3481                      .dwattr $C$DW$T$125, DW_AT_language(DW_LANG_C)
    3482              
    3483              $C$DW$T$76      .dwtag  DW_TAG_structure_type
    3484                      .dwattr $C$DW$T$76, DW_AT_name("_CTRL_Obj_")
    3485                      .dwattr $C$DW$T$76, DW_AT_byte_size(0x112)
    3486              $C$DW$651       .dwtag  DW_TAG_member
    3487                      .dwattr $C$DW$651, DW_AT_type(*$C$DW$T$41)
    3488                      .dwattr $C$DW$651, DW_AT_name("version")
    3489                      .dwattr $C$DW$651, DW_AT_TI_symbol_name("_version")
    3490                      .dwattr $C$DW$651, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    3491                      .dwattr $C$DW$651, DW_AT_accessibility(DW_ACCESS_public)
    3492              $C$DW$652       .dwtag  DW_TAG_member
    3493                      .dwattr $C$DW$652, DW_AT_type(*$C$DW$T$43)
    3494                      .dwattr $C$DW$652, DW_AT_name("state")
    3495                      .dwattr $C$DW$652, DW_AT_TI_symbol_name("_state")
    3496                      .dwattr $C$DW$652, DW_AT_data_member_location[DW_OP_plus_uconst 0x4]
    3497                      .dwattr $C$DW$652, DW_AT_accessibility(DW_ACCESS_public)
    3498              $C$DW$653       .dwtag  DW_TAG_member
TMS320C2000 Assembler PC v6.2.5 Mon Oct 30 13:30:06 2017

Tools Copyright (c) 1996-2014 Texas Instruments Incorporated
C:\Users\wmj\AppData\Local\Temp\0833611                              PAGE   68

    3499                      .dwattr $C$DW$653, DW_AT_type(*$C$DW$T$43)
    3500                      .dwattr $C$DW$653, DW_AT_name("prevState")
    3501                      .dwattr $C$DW$653, DW_AT_TI_symbol_name("_prevState")
    3502                      .dwattr $C$DW$653, DW_AT_data_member_location[DW_OP_plus_uconst 0x5]
    3503                      .dwattr $C$DW$653, DW_AT_accessibility(DW_ACCESS_public)
    3504              $C$DW$654       .dwtag  DW_TAG_member
    3505                      .dwattr $C$DW$654, DW_AT_type(*$C$DW$T$45)
    3506                      .dwattr $C$DW$654, DW_AT_name("errorCode")
    3507                      .dwattr $C$DW$654, DW_AT_TI_symbol_name("_errorCode")
    3508                      .dwattr $C$DW$654, DW_AT_data_member_location[DW_OP_plus_uconst 0x6]
    3509                      .dwattr $C$DW$654, DW_AT_accessibility(DW_ACCESS_public)
    3510              $C$DW$655       .dwtag  DW_TAG_member
    3511                      .dwattr $C$DW$655, DW_AT_type(*$C$DW$T$47)
    3512                      .dwattr $C$DW$655, DW_AT_name("clarkeHandle_I")
    3513                      .dwattr $C$DW$655, DW_AT_TI_symbol_name("_clarkeHandle_I")
    3514                      .dwattr $C$DW$655, DW_AT_data_member_location[DW_OP_plus_uconst 0x8]
    3515                      .dwattr $C$DW$655, DW_AT_accessibility(DW_ACCESS_public)
    3516              $C$DW$656       .dwtag  DW_TAG_member
    3517                      .dwattr $C$DW$656, DW_AT_type(*$C$DW$T$48)
    3518                      .dwattr $C$DW$656, DW_AT_name("clarke_I")
    3519                      .dwattr $C$DW$656, DW_AT_TI_symbol_name("_clarke_I")
    3520                      .dwattr $C$DW$656, DW_AT_data_member_location[DW_OP_plus_uconst 0xa]
    3521                      .dwattr $C$DW$656, DW_AT_accessibility(DW_ACCESS_public)
    3522              $C$DW$657       .dwtag  DW_TAG_member
    3523                      .dwattr $C$DW$657, DW_AT_type(*$C$DW$T$47)
    3524                      .dwattr $C$DW$657, DW_AT_name("clarkeHandle_V")
    3525                      .dwattr $C$DW$657, DW_AT_TI_symbol_name("_clarkeHandle_V")
    3526                      .dwattr $C$DW$657, DW_AT_data_member_location[DW_OP_plus_uconst 0x10]
    3527                      .dwattr $C$DW$657, DW_AT_accessibility(DW_ACCESS_public)
    3528              $C$DW$658       .dwtag  DW_TAG_member
    3529                      .dwattr $C$DW$658, DW_AT_type(*$C$DW$T$48)
    3530                      .dwattr $C$DW$658, DW_AT_name("clarke_V")
    3531                      .dwattr $C$DW$658, DW_AT_TI_symbol_name("_clarke_V")
    3532                      .dwattr $C$DW$658, DW_AT_data_member_location[DW_OP_plus_uconst 0x12]
    3533                      .dwattr $C$DW$658, DW_AT_accessibility(DW_ACCESS_public)
    3534              $C$DW$659       .dwtag  DW_TAG_member
    3535                      .dwattr $C$DW$659, DW_AT_type(*$C$DW$T$50)
    3536                      .dwattr $C$DW$659, DW_AT_name("estHandle")
    3537                      .dwattr $C$DW$659, DW_AT_TI_symbol_name("_estHandle")
    3538                      .dwattr $C$DW$659, DW_AT_data_member_location[DW_OP_plus_uconst 0x18]
    3539                      .dwattr $C$DW$659, DW_AT_accessibility(DW_ACCESS_public)
    3540              $C$DW$660       .dwtag  DW_TAG_member
    3541                      .dwattr $C$DW$660, DW_AT_type(*$C$DW$T$52)
    3542                      .dwattr $C$DW$660, DW_AT_name("parkHandle")
    3543                      .dwattr $C$DW$660, DW_AT_TI_symbol_name("_parkHandle")
    3544                      .dwattr $C$DW$660, DW_AT_data_member_location[DW_OP_plus_uconst 0x1a]
    3545                      .dwattr $C$DW$660, DW_AT_accessibility(DW_ACCESS_public)
    3546              $C$DW$661       .dwtag  DW_TAG_member
    3547                      .dwattr $C$DW$661, DW_AT_type(*$C$DW$T$53)
    3548                      .dwattr $C$DW$661, DW_AT_name("park")
    3549                      .dwattr $C$DW$661, DW_AT_TI_symbol_name("_park")
    3550                      .dwattr $C$DW$661, DW_AT_data_member_location[DW_OP_plus_uconst 0x1c]
    3551                      .dwattr $C$DW$661, DW_AT_accessibility(DW_ACCESS_public)
    3552              $C$DW$662       .dwtag  DW_TAG_member
    3553                      .dwattr $C$DW$662, DW_AT_type(*$C$DW$T$55)
TMS320C2000 Assembler PC v6.2.5 Mon Oct 30 13:30:06 2017

Tools Copyright (c) 1996-2014 Texas Instruments Incorporated
C:\Users\wmj\AppData\Local\Temp\0833611                              PAGE   69

    3554                      .dwattr $C$DW$662, DW_AT_name("pidHandle_Id")
    3555                      .dwattr $C$DW$662, DW_AT_TI_symbol_name("_pidHandle_Id")
    3556                      .dwattr $C$DW$662, DW_AT_data_member_location[DW_OP_plus_uconst 0x20]
    3557                      .dwattr $C$DW$662, DW_AT_accessibility(DW_ACCESS_public)
    3558              $C$DW$663       .dwtag  DW_TAG_member
    3559                      .dwattr $C$DW$663, DW_AT_type(*$C$DW$T$56)
    3560                      .dwattr $C$DW$663, DW_AT_name("pid_Id")
    3561                      .dwattr $C$DW$663, DW_AT_TI_symbol_name("_pid_Id")
    3562                      .dwattr $C$DW$663, DW_AT_data_member_location[DW_OP_plus_uconst 0x22]
    3563                      .dwattr $C$DW$663, DW_AT_accessibility(DW_ACCESS_public)
    3564              $C$DW$664       .dwtag  DW_TAG_member
    3565                      .dwattr $C$DW$664, DW_AT_type(*$C$DW$T$55)
    3566                      .dwattr $C$DW$664, DW_AT_name("pidHandle_Iq")
    3567                      .dwattr $C$DW$664, DW_AT_TI_symbol_name("_pidHandle_Iq")
    3568                      .dwattr $C$DW$664, DW_AT_data_member_location[DW_OP_plus_uconst 0x32]
    3569                      .dwattr $C$DW$664, DW_AT_accessibility(DW_ACCESS_public)
    3570              $C$DW$665       .dwtag  DW_TAG_member
    3571                      .dwattr $C$DW$665, DW_AT_type(*$C$DW$T$56)
    3572                      .dwattr $C$DW$665, DW_AT_name("pid_Iq")
    3573                      .dwattr $C$DW$665, DW_AT_TI_symbol_name("_pid_Iq")
    3574                      .dwattr $C$DW$665, DW_AT_data_member_location[DW_OP_plus_uconst 0x34]
    3575                      .dwattr $C$DW$665, DW_AT_accessibility(DW_ACCESS_public)
    3576              $C$DW$666       .dwtag  DW_TAG_member
    3577                      .dwattr $C$DW$666, DW_AT_type(*$C$DW$T$55)
    3578                      .dwattr $C$DW$666, DW_AT_name("pidHandle_spd")
    3579                      .dwattr $C$DW$666, DW_AT_TI_symbol_name("_pidHandle_spd")
    3580                      .dwattr $C$DW$666, DW_AT_data_member_location[DW_OP_plus_uconst 0x44]
    3581                      .dwattr $C$DW$666, DW_AT_accessibility(DW_ACCESS_public)
    3582              $C$DW$667       .dwtag  DW_TAG_member
    3583                      .dwattr $C$DW$667, DW_AT_type(*$C$DW$T$56)
    3584                      .dwattr $C$DW$667, DW_AT_name("pid_spd")
    3585                      .dwattr $C$DW$667, DW_AT_TI_symbol_name("_pid_spd")
    3586                      .dwattr $C$DW$667, DW_AT_data_member_location[DW_OP_plus_uconst 0x46]
    3587                      .dwattr $C$DW$667, DW_AT_accessibility(DW_ACCESS_public)
    3588              $C$DW$668       .dwtag  DW_TAG_member
    3589                      .dwattr $C$DW$668, DW_AT_type(*$C$DW$T$58)
    3590                      .dwattr $C$DW$668, DW_AT_name("iparkHandle")
    3591                      .dwattr $C$DW$668, DW_AT_TI_symbol_name("_iparkHandle")
    3592                      .dwattr $C$DW$668, DW_AT_data_member_location[DW_OP_plus_uconst 0x56]
    3593                      .dwattr $C$DW$668, DW_AT_accessibility(DW_ACCESS_public)
    3594              $C$DW$669       .dwtag  DW_TAG_member
    3595                      .dwattr $C$DW$669, DW_AT_type(*$C$DW$T$59)
    3596                      .dwattr $C$DW$669, DW_AT_name("ipark")
    3597                      .dwattr $C$DW$669, DW_AT_TI_symbol_name("_ipark")
    3598                      .dwattr $C$DW$669, DW_AT_data_member_location[DW_OP_plus_uconst 0x58]
    3599                      .dwattr $C$DW$669, DW_AT_accessibility(DW_ACCESS_public)
    3600              $C$DW$670       .dwtag  DW_TAG_member
    3601                      .dwattr $C$DW$670, DW_AT_type(*$C$DW$T$61)
    3602                      .dwattr $C$DW$670, DW_AT_name("svgenHandle")
    3603                      .dwattr $C$DW$670, DW_AT_TI_symbol_name("_svgenHandle")
    3604                      .dwattr $C$DW$670, DW_AT_data_member_location[DW_OP_plus_uconst 0x5c]
    3605                      .dwattr $C$DW$670, DW_AT_accessibility(DW_ACCESS_public)
    3606              $C$DW$671       .dwtag  DW_TAG_member
    3607                      .dwattr $C$DW$671, DW_AT_type(*$C$DW$T$62)
    3608                      .dwattr $C$DW$671, DW_AT_name("svgen")
TMS320C2000 Assembler PC v6.2.5 Mon Oct 30 13:30:06 2017

Tools Copyright (c) 1996-2014 Texas Instruments Incorporated
C:\Users\wmj\AppData\Local\Temp\0833611                              PAGE   70

    3609                      .dwattr $C$DW$671, DW_AT_TI_symbol_name("_svgen")
    3610                      .dwattr $C$DW$671, DW_AT_data_member_location[DW_OP_plus_uconst 0x5e]
    3611                      .dwattr $C$DW$671, DW_AT_accessibility(DW_ACCESS_public)
    3612              $C$DW$672       .dwtag  DW_TAG_member
    3613                      .dwattr $C$DW$672, DW_AT_type(*$C$DW$T$64)
    3614                      .dwattr $C$DW$672, DW_AT_name("trajHandle_Id")
    3615                      .dwattr $C$DW$672, DW_AT_TI_symbol_name("_trajHandle_Id")
    3616                      .dwattr $C$DW$672, DW_AT_data_member_location[DW_OP_plus_uconst 0x60]
    3617                      .dwattr $C$DW$672, DW_AT_accessibility(DW_ACCESS_public)
    3618              $C$DW$673       .dwtag  DW_TAG_member
    3619                      .dwattr $C$DW$673, DW_AT_type(*$C$DW$T$65)
    3620                      .dwattr $C$DW$673, DW_AT_name("traj_Id")
    3621                      .dwattr $C$DW$673, DW_AT_TI_symbol_name("_traj_Id")
    3622                      .dwattr $C$DW$673, DW_AT_data_member_location[DW_OP_plus_uconst 0x62]
    3623                      .dwattr $C$DW$673, DW_AT_accessibility(DW_ACCESS_public)
    3624              $C$DW$674       .dwtag  DW_TAG_member
    3625                      .dwattr $C$DW$674, DW_AT_type(*$C$DW$T$64)
    3626                      .dwattr $C$DW$674, DW_AT_name("trajHandle_spd")
    3627                      .dwattr $C$DW$674, DW_AT_TI_symbol_name("_trajHandle_spd")
    3628                      .dwattr $C$DW$674, DW_AT_data_member_location[DW_OP_plus_uconst 0x6c]
    3629                      .dwattr $C$DW$674, DW_AT_accessibility(DW_ACCESS_public)
    3630              $C$DW$675       .dwtag  DW_TAG_member
    3631                      .dwattr $C$DW$675, DW_AT_type(*$C$DW$T$65)
    3632                      .dwattr $C$DW$675, DW_AT_name("traj_spd")
    3633                      .dwattr $C$DW$675, DW_AT_TI_symbol_name("_traj_spd")
    3634                      .dwattr $C$DW$675, DW_AT_data_member_location[DW_OP_plus_uconst 0x6e]
    3635                      .dwattr $C$DW$675, DW_AT_accessibility(DW_ACCESS_public)
    3636              $C$DW$676       .dwtag  DW_TAG_member
    3637                      .dwattr $C$DW$676, DW_AT_type(*$C$DW$T$64)
    3638                      .dwattr $C$DW$676, DW_AT_name("trajHandle_spdMax")
    3639                      .dwattr $C$DW$676, DW_AT_TI_symbol_name("_trajHandle_spdMax")
    3640                      .dwattr $C$DW$676, DW_AT_data_member_location[DW_OP_plus_uconst 0x78]
    3641                      .dwattr $C$DW$676, DW_AT_accessibility(DW_ACCESS_public)
    3642              $C$DW$677       .dwtag  DW_TAG_member
    3643                      .dwattr $C$DW$677, DW_AT_type(*$C$DW$T$65)
    3644                      .dwattr $C$DW$677, DW_AT_name("traj_spdMax")
    3645                      .dwattr $C$DW$677, DW_AT_TI_symbol_name("_traj_spdMax")
    3646                      .dwattr $C$DW$677, DW_AT_data_member_location[DW_OP_plus_uconst 0x7a]
    3647                      .dwattr $C$DW$677, DW_AT_accessibility(DW_ACCESS_public)
    3648              $C$DW$678       .dwtag  DW_TAG_member
    3649                      .dwattr $C$DW$678, DW_AT_type(*$C$DW$T$66)
    3650                      .dwattr $C$DW$678, DW_AT_name("motorParams")
    3651                      .dwattr $C$DW$678, DW_AT_TI_symbol_name("_motorParams")
    3652                      .dwattr $C$DW$678, DW_AT_data_member_location[DW_OP_plus_uconst 0x84]
    3653                      .dwattr $C$DW$678, DW_AT_accessibility(DW_ACCESS_public)
    3654              $C$DW$679       .dwtag  DW_TAG_member
    3655                      .dwattr $C$DW$679, DW_AT_type(*$C$DW$T$69)
    3656                      .dwattr $C$DW$679, DW_AT_name("waitTimes")
    3657                      .dwattr $C$DW$679, DW_AT_TI_symbol_name("_waitTimes")
    3658                      .dwattr $C$DW$679, DW_AT_data_member_location[DW_OP_plus_uconst 0x92]
    3659                      .dwattr $C$DW$679, DW_AT_accessibility(DW_ACCESS_public)
    3660              $C$DW$680       .dwtag  DW_TAG_member
    3661                      .dwattr $C$DW$680, DW_AT_type(*$C$DW$T$68)
    3662                      .dwattr $C$DW$680, DW_AT_name("counter_state")
    3663                      .dwattr $C$DW$680, DW_AT_TI_symbol_name("_counter_state")
TMS320C2000 Assembler PC v6.2.5 Mon Oct 30 13:30:06 2017

Tools Copyright (c) 1996-2014 Texas Instruments Incorporated
C:\Users\wmj\AppData\Local\Temp\0833611                              PAGE   71

    3664                      .dwattr $C$DW$680, DW_AT_data_member_location[DW_OP_plus_uconst 0x9a]
    3665                      .dwattr $C$DW$680, DW_AT_accessibility(DW_ACCESS_public)
    3666              $C$DW$681       .dwtag  DW_TAG_member
    3667                      .dwattr $C$DW$681, DW_AT_type(*$C$DW$T$70)
    3668                      .dwattr $C$DW$681, DW_AT_name("numIsrTicksPerCtrlTick")
    3669                      .dwattr $C$DW$681, DW_AT_TI_symbol_name("_numIsrTicksPerCtrlTick")
    3670                      .dwattr $C$DW$681, DW_AT_data_member_location[DW_OP_plus_uconst 0x9c]
    3671                      .dwattr $C$DW$681, DW_AT_accessibility(DW_ACCESS_public)
    3672              $C$DW$682       .dwtag  DW_TAG_member
    3673                      .dwattr $C$DW$682, DW_AT_type(*$C$DW$T$70)
    3674                      .dwattr $C$DW$682, DW_AT_name("numCtrlTicksPerCurrentTick")
    3675                      .dwattr $C$DW$682, DW_AT_TI_symbol_name("_numCtrlTicksPerCurrentTick")
    3676                      .dwattr $C$DW$682, DW_AT_data_member_location[DW_OP_plus_uconst 0x9d]
    3677                      .dwattr $C$DW$682, DW_AT_accessibility(DW_ACCESS_public)
    3678              $C$DW$683       .dwtag  DW_TAG_member
    3679                      .dwattr $C$DW$683, DW_AT_type(*$C$DW$T$70)
    3680                      .dwattr $C$DW$683, DW_AT_name("numCtrlTicksPerSpeedTick")
    3681                      .dwattr $C$DW$683, DW_AT_TI_symbol_name("_numCtrlTicksPerSpeedTick")
    3682                      .dwattr $C$DW$683, DW_AT_data_member_location[DW_OP_plus_uconst 0x9e]
    3683                      .dwattr $C$DW$683, DW_AT_accessibility(DW_ACCESS_public)
    3684              $C$DW$684       .dwtag  DW_TAG_member
    3685                      .dwattr $C$DW$684, DW_AT_type(*$C$DW$T$70)
    3686                      .dwattr $C$DW$684, DW_AT_name("numCtrlTicksPerTrajTick")
    3687                      .dwattr $C$DW$684, DW_AT_TI_symbol_name("_numCtrlTicksPerTrajTick")
    3688                      .dwattr $C$DW$684, DW_AT_data_member_location[DW_OP_plus_uconst 0x9f]
    3689                      .dwattr $C$DW$684, DW_AT_accessibility(DW_ACCESS_public)
    3690              $C$DW$685       .dwtag  DW_TAG_member
    3691                      .dwattr $C$DW$685, DW_AT_type(*$C$DW$T$68)
    3692                      .dwattr $C$DW$685, DW_AT_name("ctrlFreq_Hz")
    3693                      .dwattr $C$DW$685, DW_AT_TI_symbol_name("_ctrlFreq_Hz")
    3694                      .dwattr $C$DW$685, DW_AT_data_member_location[DW_OP_plus_uconst 0xa0]
    3695                      .dwattr $C$DW$685, DW_AT_accessibility(DW_ACCESS_public)
    3696              $C$DW$686       .dwtag  DW_TAG_member
    3697                      .dwattr $C$DW$686, DW_AT_type(*$C$DW$T$68)
    3698                      .dwattr $C$DW$686, DW_AT_name("trajFreq_Hz")
    3699                      .dwattr $C$DW$686, DW_AT_TI_symbol_name("_trajFreq_Hz")
    3700                      .dwattr $C$DW$686, DW_AT_data_member_location[DW_OP_plus_uconst 0xa2]
    3701                      .dwattr $C$DW$686, DW_AT_accessibility(DW_ACCESS_public)
    3702              $C$DW$687       .dwtag  DW_TAG_member
    3703                      .dwattr $C$DW$687, DW_AT_type(*$C$DW$T$32)
    3704                      .dwattr $C$DW$687, DW_AT_name("trajPeriod_sec")
    3705                      .dwattr $C$DW$687, DW_AT_TI_symbol_name("_trajPeriod_sec")
    3706                      .dwattr $C$DW$687, DW_AT_data_member_location[DW_OP_plus_uconst 0xa4]
    3707                      .dwattr $C$DW$687, DW_AT_accessibility(DW_ACCESS_public)
    3708              $C$DW$688       .dwtag  DW_TAG_member
    3709                      .dwattr $C$DW$688, DW_AT_type(*$C$DW$T$71)
    3710                      .dwattr $C$DW$688, DW_AT_name("ctrlPeriod_sec")
    3711                      .dwattr $C$DW$688, DW_AT_TI_symbol_name("_ctrlPeriod_sec")
    3712                      .dwattr $C$DW$688, DW_AT_data_member_location[DW_OP_plus_uconst 0xa6]
    3713                      .dwattr $C$DW$688, DW_AT_accessibility(DW_ACCESS_public)
    3714              $C$DW$689       .dwtag  DW_TAG_member
    3715                      .dwattr $C$DW$689, DW_AT_type(*$C$DW$T$32)
    3716                      .dwattr $C$DW$689, DW_AT_name("maxVsMag_pu")
    3717                      .dwattr $C$DW$689, DW_AT_TI_symbol_name("_maxVsMag_pu")
    3718                      .dwattr $C$DW$689, DW_AT_data_member_location[DW_OP_plus_uconst 0xa8]
TMS320C2000 Assembler PC v6.2.5 Mon Oct 30 13:30:06 2017

Tools Copyright (c) 1996-2014 Texas Instruments Incorporated
C:\Users\wmj\AppData\Local\Temp\0833611                              PAGE   72

    3719                      .dwattr $C$DW$689, DW_AT_accessibility(DW_ACCESS_public)
    3720              $C$DW$690       .dwtag  DW_TAG_member
    3721                      .dwattr $C$DW$690, DW_AT_type(*$C$DW$T$33)
    3722                      .dwattr $C$DW$690, DW_AT_name("Iab_in")
    3723                      .dwattr $C$DW$690, DW_AT_TI_symbol_name("_Iab_in")
    3724                      .dwattr $C$DW$690, DW_AT_data_member_location[DW_OP_plus_uconst 0xaa]
    3725                      .dwattr $C$DW$690, DW_AT_accessibility(DW_ACCESS_public)
    3726              $C$DW$691       .dwtag  DW_TAG_member
    3727                      .dwattr $C$DW$691, DW_AT_type(*$C$DW$T$33)
    3728                      .dwattr $C$DW$691, DW_AT_name("Iab_filt")
    3729                      .dwattr $C$DW$691, DW_AT_TI_symbol_name("_Iab_filt")
    3730                      .dwattr $C$DW$691, DW_AT_data_member_location[DW_OP_plus_uconst 0xae]
    3731                      .dwattr $C$DW$691, DW_AT_accessibility(DW_ACCESS_public)
    3732              $C$DW$692       .dwtag  DW_TAG_member
    3733                      .dwattr $C$DW$692, DW_AT_type(*$C$DW$T$33)
    3734                      .dwattr $C$DW$692, DW_AT_name("Idq_in")
    3735                      .dwattr $C$DW$692, DW_AT_TI_symbol_name("_Idq_in")
    3736                      .dwattr $C$DW$692, DW_AT_data_member_location[DW_OP_plus_uconst 0xb2]
    3737                      .dwattr $C$DW$692, DW_AT_accessibility(DW_ACCESS_public)
    3738              $C$DW$693       .dwtag  DW_TAG_member
    3739                      .dwattr $C$DW$693, DW_AT_type(*$C$DW$T$33)
    3740                      .dwattr $C$DW$693, DW_AT_name("Vab_in")
    3741                      .dwattr $C$DW$693, DW_AT_TI_symbol_name("_Vab_in")
    3742                      .dwattr $C$DW$693, DW_AT_data_member_location[DW_OP_plus_uconst 0xb6]
    3743                      .dwattr $C$DW$693, DW_AT_accessibility(DW_ACCESS_public)
    3744              $C$DW$694       .dwtag  DW_TAG_member
    3745                      .dwattr $C$DW$694, DW_AT_type(*$C$DW$T$32)
    3746                      .dwattr $C$DW$694, DW_AT_name("spd_out")
    3747                      .dwattr $C$DW$694, DW_AT_TI_symbol_name("_spd_out")
    3748                      .dwattr $C$DW$694, DW_AT_data_member_location[DW_OP_plus_uconst 0xba]
    3749                      .dwattr $C$DW$694, DW_AT_accessibility(DW_ACCESS_public)
    3750              $C$DW$695       .dwtag  DW_TAG_member
    3751                      .dwattr $C$DW$695, DW_AT_type(*$C$DW$T$33)
    3752                      .dwattr $C$DW$695, DW_AT_name("Vab_out")
    3753                      .dwattr $C$DW$695, DW_AT_TI_symbol_name("_Vab_out")
    3754                      .dwattr $C$DW$695, DW_AT_data_member_location[DW_OP_plus_uconst 0xbc]
    3755                      .dwattr $C$DW$695, DW_AT_accessibility(DW_ACCESS_public)
    3756              $C$DW$696       .dwtag  DW_TAG_member
    3757                      .dwattr $C$DW$696, DW_AT_type(*$C$DW$T$33)
    3758                      .dwattr $C$DW$696, DW_AT_name("Vdq_out")
    3759                      .dwattr $C$DW$696, DW_AT_TI_symbol_name("_Vdq_out")
    3760                      .dwattr $C$DW$696, DW_AT_data_member_location[DW_OP_plus_uconst 0xc0]
    3761                      .dwattr $C$DW$696, DW_AT_accessibility(DW_ACCESS_public)
    3762              $C$DW$697       .dwtag  DW_TAG_member
    3763                      .dwattr $C$DW$697, DW_AT_type(*$C$DW$T$71)
    3764                      .dwattr $C$DW$697, DW_AT_name("Rhf")
    3765                      .dwattr $C$DW$697, DW_AT_TI_symbol_name("_Rhf")
    3766                      .dwattr $C$DW$697, DW_AT_data_member_location[DW_OP_plus_uconst 0xc4]
    3767                      .dwattr $C$DW$697, DW_AT_accessibility(DW_ACCESS_public)
    3768              $C$DW$698       .dwtag  DW_TAG_member
    3769                      .dwattr $C$DW$698, DW_AT_type(*$C$DW$T$71)
    3770                      .dwattr $C$DW$698, DW_AT_name("Lhf")
    3771                      .dwattr $C$DW$698, DW_AT_TI_symbol_name("_Lhf")
    3772                      .dwattr $C$DW$698, DW_AT_data_member_location[DW_OP_plus_uconst 0xc6]
    3773                      .dwattr $C$DW$698, DW_AT_accessibility(DW_ACCESS_public)
TMS320C2000 Assembler PC v6.2.5 Mon Oct 30 13:30:06 2017

Tools Copyright (c) 1996-2014 Texas Instruments Incorporated
C:\Users\wmj\AppData\Local\Temp\0833611                              PAGE   73

    3774              $C$DW$699       .dwtag  DW_TAG_member
    3775                      .dwattr $C$DW$699, DW_AT_type(*$C$DW$T$71)
    3776                      .dwattr $C$DW$699, DW_AT_name("RoverL")
    3777                      .dwattr $C$DW$699, DW_AT_TI_symbol_name("_RoverL")
    3778                      .dwattr $C$DW$699, DW_AT_data_member_location[DW_OP_plus_uconst 0xc8]
    3779                      .dwattr $C$DW$699, DW_AT_accessibility(DW_ACCESS_public)
    3780              $C$DW$700       .dwtag  DW_TAG_member
    3781                      .dwattr $C$DW$700, DW_AT_type(*$C$DW$T$32)
    3782                      .dwattr $C$DW$700, DW_AT_name("Kp_Id")
    3783                      .dwattr $C$DW$700, DW_AT_TI_symbol_name("_Kp_Id")
    3784                      .dwattr $C$DW$700, DW_AT_data_member_location[DW_OP_plus_uconst 0xca]
    3785                      .dwattr $C$DW$700, DW_AT_accessibility(DW_ACCESS_public)
    3786              $C$DW$701       .dwtag  DW_TAG_member
    3787                      .dwattr $C$DW$701, DW_AT_type(*$C$DW$T$32)
    3788                      .dwattr $C$DW$701, DW_AT_name("Kp_Iq")
    3789                      .dwattr $C$DW$701, DW_AT_TI_symbol_name("_Kp_Iq")
    3790                      .dwattr $C$DW$701, DW_AT_data_member_location[DW_OP_plus_uconst 0xcc]
    3791                      .dwattr $C$DW$701, DW_AT_accessibility(DW_ACCESS_public)
    3792              $C$DW$702       .dwtag  DW_TAG_member
    3793                      .dwattr $C$DW$702, DW_AT_type(*$C$DW$T$32)
    3794                      .dwattr $C$DW$702, DW_AT_name("Kp_spd")
    3795                      .dwattr $C$DW$702, DW_AT_TI_symbol_name("_Kp_spd")
    3796                      .dwattr $C$DW$702, DW_AT_data_member_location[DW_OP_plus_uconst 0xce]
    3797                      .dwattr $C$DW$702, DW_AT_accessibility(DW_ACCESS_public)
    3798              $C$DW$703       .dwtag  DW_TAG_member
    3799                      .dwattr $C$DW$703, DW_AT_type(*$C$DW$T$32)
    3800                      .dwattr $C$DW$703, DW_AT_name("Ki_Id")
    3801                      .dwattr $C$DW$703, DW_AT_TI_symbol_name("_Ki_Id")
    3802                      .dwattr $C$DW$703, DW_AT_data_member_location[DW_OP_plus_uconst 0xd0]
    3803                      .dwattr $C$DW$703, DW_AT_accessibility(DW_ACCESS_public)
    3804              $C$DW$704       .dwtag  DW_TAG_member
    3805                      .dwattr $C$DW$704, DW_AT_type(*$C$DW$T$32)
    3806                      .dwattr $C$DW$704, DW_AT_name("Ki_Iq")
    3807                      .dwattr $C$DW$704, DW_AT_TI_symbol_name("_Ki_Iq")
    3808                      .dwattr $C$DW$704, DW_AT_data_member_location[DW_OP_plus_uconst 0xd2]
    3809                      .dwattr $C$DW$704, DW_AT_accessibility(DW_ACCESS_public)
    3810              $C$DW$705       .dwtag  DW_TAG_member
    3811                      .dwattr $C$DW$705, DW_AT_type(*$C$DW$T$32)
    3812                      .dwattr $C$DW$705, DW_AT_name("Ki_spd")
    3813                      .dwattr $C$DW$705, DW_AT_TI_symbol_name("_Ki_spd")
    3814                      .dwattr $C$DW$705, DW_AT_data_member_location[DW_OP_plus_uconst 0xd4]
    3815                      .dwattr $C$DW$705, DW_AT_accessibility(DW_ACCESS_public)
    3816              $C$DW$706       .dwtag  DW_TAG_member
    3817                      .dwattr $C$DW$706, DW_AT_type(*$C$DW$T$32)
    3818                      .dwattr $C$DW$706, DW_AT_name("Kd_Id")
    3819                      .dwattr $C$DW$706, DW_AT_TI_symbol_name("_Kd_Id")
    3820                      .dwattr $C$DW$706, DW_AT_data_member_location[DW_OP_plus_uconst 0xd6]
    3821                      .dwattr $C$DW$706, DW_AT_accessibility(DW_ACCESS_public)
    3822              $C$DW$707       .dwtag  DW_TAG_member
    3823                      .dwattr $C$DW$707, DW_AT_type(*$C$DW$T$32)
    3824                      .dwattr $C$DW$707, DW_AT_name("Kd_Iq")
    3825                      .dwattr $C$DW$707, DW_AT_TI_symbol_name("_Kd_Iq")
    3826                      .dwattr $C$DW$707, DW_AT_data_member_location[DW_OP_plus_uconst 0xd8]
    3827                      .dwattr $C$DW$707, DW_AT_accessibility(DW_ACCESS_public)
    3828              $C$DW$708       .dwtag  DW_TAG_member
TMS320C2000 Assembler PC v6.2.5 Mon Oct 30 13:30:06 2017

Tools Copyright (c) 1996-2014 Texas Instruments Incorporated
C:\Users\wmj\AppData\Local\Temp\0833611                              PAGE   74

    3829                      .dwattr $C$DW$708, DW_AT_type(*$C$DW$T$32)
    3830                      .dwattr $C$DW$708, DW_AT_name("Kd_spd")
    3831                      .dwattr $C$DW$708, DW_AT_TI_symbol_name("_Kd_spd")
    3832                      .dwattr $C$DW$708, DW_AT_data_member_location[DW_OP_plus_uconst 0xda]
    3833                      .dwattr $C$DW$708, DW_AT_accessibility(DW_ACCESS_public)
    3834              $C$DW$709       .dwtag  DW_TAG_member
    3835                      .dwattr $C$DW$709, DW_AT_type(*$C$DW$T$32)
    3836                      .dwattr $C$DW$709, DW_AT_name("Ui_Id")
    3837                      .dwattr $C$DW$709, DW_AT_TI_symbol_name("_Ui_Id")
    3838                      .dwattr $C$DW$709, DW_AT_data_member_location[DW_OP_plus_uconst 0xdc]
    3839                      .dwattr $C$DW$709, DW_AT_accessibility(DW_ACCESS_public)
    3840              $C$DW$710       .dwtag  DW_TAG_member
    3841                      .dwattr $C$DW$710, DW_AT_type(*$C$DW$T$32)
    3842                      .dwattr $C$DW$710, DW_AT_name("Ui_Iq")
    3843                      .dwattr $C$DW$710, DW_AT_TI_symbol_name("_Ui_Iq")
    3844                      .dwattr $C$DW$710, DW_AT_data_member_location[DW_OP_plus_uconst 0xde]
    3845                      .dwattr $C$DW$710, DW_AT_accessibility(DW_ACCESS_public)
    3846              $C$DW$711       .dwtag  DW_TAG_member
    3847                      .dwattr $C$DW$711, DW_AT_type(*$C$DW$T$32)
    3848                      .dwattr $C$DW$711, DW_AT_name("Ui_spd")
    3849                      .dwattr $C$DW$711, DW_AT_TI_symbol_name("_Ui_spd")
    3850                      .dwattr $C$DW$711, DW_AT_data_member_location[DW_OP_plus_uconst 0xe0]
    3851                      .dwattr $C$DW$711, DW_AT_accessibility(DW_ACCESS_public)
    3852              $C$DW$712       .dwtag  DW_TAG_member
    3853                      .dwattr $C$DW$712, DW_AT_type(*$C$DW$T$33)
    3854                      .dwattr $C$DW$712, DW_AT_name("Idq_ref")
    3855                      .dwattr $C$DW$712, DW_AT_TI_symbol_name("_Idq_ref")
    3856                      .dwattr $C$DW$712, DW_AT_data_member_location[DW_OP_plus_uconst 0xe2]
    3857                      .dwattr $C$DW$712, DW_AT_accessibility(DW_ACCESS_public)
    3858              $C$DW$713       .dwtag  DW_TAG_member
    3859                      .dwattr $C$DW$713, DW_AT_type(*$C$DW$T$32)
    3860                      .dwattr $C$DW$713, DW_AT_name("IdRated")
    3861                      .dwattr $C$DW$713, DW_AT_TI_symbol_name("_IdRated")
    3862                      .dwattr $C$DW$713, DW_AT_data_member_location[DW_OP_plus_uconst 0xe6]
    3863                      .dwattr $C$DW$713, DW_AT_accessibility(DW_ACCESS_public)
    3864              $C$DW$714       .dwtag  DW_TAG_member
    3865                      .dwattr $C$DW$714, DW_AT_type(*$C$DW$T$32)
    3866                      .dwattr $C$DW$714, DW_AT_name("spd_ref")
    3867                      .dwattr $C$DW$714, DW_AT_TI_symbol_name("_spd_ref")
    3868                      .dwattr $C$DW$714, DW_AT_data_member_location[DW_OP_plus_uconst 0xe8]
    3869                      .dwattr $C$DW$714, DW_AT_accessibility(DW_ACCESS_public)
    3870              $C$DW$715       .dwtag  DW_TAG_member
    3871                      .dwattr $C$DW$715, DW_AT_type(*$C$DW$T$32)
    3872                      .dwattr $C$DW$715, DW_AT_name("spd_max")
    3873                      .dwattr $C$DW$715, DW_AT_TI_symbol_name("_spd_max")
    3874                      .dwattr $C$DW$715, DW_AT_data_member_location[DW_OP_plus_uconst 0xea]
    3875                      .dwattr $C$DW$715, DW_AT_accessibility(DW_ACCESS_public)
    3876              $C$DW$716       .dwtag  DW_TAG_member
    3877                      .dwattr $C$DW$716, DW_AT_type(*$C$DW$T$70)
    3878                      .dwattr $C$DW$716, DW_AT_name("counter_current")
    3879                      .dwattr $C$DW$716, DW_AT_TI_symbol_name("_counter_current")
    3880                      .dwattr $C$DW$716, DW_AT_data_member_location[DW_OP_plus_uconst 0xec]
    3881                      .dwattr $C$DW$716, DW_AT_accessibility(DW_ACCESS_public)
    3882              $C$DW$717       .dwtag  DW_TAG_member
    3883                      .dwattr $C$DW$717, DW_AT_type(*$C$DW$T$70)
TMS320C2000 Assembler PC v6.2.5 Mon Oct 30 13:30:06 2017

Tools Copyright (c) 1996-2014 Texas Instruments Incorporated
C:\Users\wmj\AppData\Local\Temp\0833611                              PAGE   75

    3884                      .dwattr $C$DW$717, DW_AT_name("counter_isr")
    3885                      .dwattr $C$DW$717, DW_AT_TI_symbol_name("_counter_isr")
    3886                      .dwattr $C$DW$717, DW_AT_data_member_location[DW_OP_plus_uconst 0xed]
    3887                      .dwattr $C$DW$717, DW_AT_accessibility(DW_ACCESS_public)
    3888              $C$DW$718       .dwtag  DW_TAG_member
    3889                      .dwattr $C$DW$718, DW_AT_type(*$C$DW$T$70)
    3890                      .dwattr $C$DW$718, DW_AT_name("counter_speed")
    3891                      .dwattr $C$DW$718, DW_AT_TI_symbol_name("_counter_speed")
    3892                      .dwattr $C$DW$718, DW_AT_data_member_location[DW_OP_plus_uconst 0xee]
    3893                      .dwattr $C$DW$718, DW_AT_accessibility(DW_ACCESS_public)
    3894              $C$DW$719       .dwtag  DW_TAG_member
    3895                      .dwattr $C$DW$719, DW_AT_type(*$C$DW$T$70)
    3896                      .dwattr $C$DW$719, DW_AT_name("counter_traj")
    3897                      .dwattr $C$DW$719, DW_AT_TI_symbol_name("_counter_traj")
    3898                      .dwattr $C$DW$719, DW_AT_data_member_location[DW_OP_plus_uconst 0xef]
    3899                      .dwattr $C$DW$719, DW_AT_accessibility(DW_ACCESS_public)
    3900              $C$DW$720       .dwtag  DW_TAG_member
    3901                      .dwattr $C$DW$720, DW_AT_type(*$C$DW$T$34)
    3902                      .dwattr $C$DW$720, DW_AT_name("flag_enableCtrl")
    3903                      .dwattr $C$DW$720, DW_AT_TI_symbol_name("_flag_enableCtrl")
    3904                      .dwattr $C$DW$720, DW_AT_data_member_location[DW_OP_plus_uconst 0xf0]
    3905                      .dwattr $C$DW$720, DW_AT_accessibility(DW_ACCESS_public)
    3906              $C$DW$721       .dwtag  DW_TAG_member
    3907                      .dwattr $C$DW$721, DW_AT_type(*$C$DW$T$34)
    3908                      .dwattr $C$DW$721, DW_AT_name("flag_enableDcBusComp")
    3909                      .dwattr $C$DW$721, DW_AT_TI_symbol_name("_flag_enableDcBusComp")
    3910                      .dwattr $C$DW$721, DW_AT_data_member_location[DW_OP_plus_uconst 0xf1]
    3911                      .dwattr $C$DW$721, DW_AT_accessibility(DW_ACCESS_public)
    3912              $C$DW$722       .dwtag  DW_TAG_member
    3913                      .dwattr $C$DW$722, DW_AT_type(*$C$DW$T$34)
    3914                      .dwattr $C$DW$722, DW_AT_name("flag_enablePowerWarp")
    3915                      .dwattr $C$DW$722, DW_AT_TI_symbol_name("_flag_enablePowerWarp")
    3916                      .dwattr $C$DW$722, DW_AT_data_member_location[DW_OP_plus_uconst 0xf2]
    3917                      .dwattr $C$DW$722, DW_AT_accessibility(DW_ACCESS_public)
    3918              $C$DW$723       .dwtag  DW_TAG_member
    3919                      .dwattr $C$DW$723, DW_AT_type(*$C$DW$T$34)
    3920                      .dwattr $C$DW$723, DW_AT_name("flag_enableOffset")
    3921                      .dwattr $C$DW$723, DW_AT_TI_symbol_name("_flag_enableOffset")
    3922                      .dwattr $C$DW$723, DW_AT_data_member_location[DW_OP_plus_uconst 0xf3]
    3923                      .dwattr $C$DW$723, DW_AT_accessibility(DW_ACCESS_public)
    3924              $C$DW$724       .dwtag  DW_TAG_member
    3925                      .dwattr $C$DW$724, DW_AT_type(*$C$DW$T$34)
    3926                      .dwattr $C$DW$724, DW_AT_name("flag_enableSpeedCtrl")
    3927                      .dwattr $C$DW$724, DW_AT_TI_symbol_name("_flag_enableSpeedCtrl")
    3928                      .dwattr $C$DW$724, DW_AT_data_member_location[DW_OP_plus_uconst 0xf4]
    3929                      .dwattr $C$DW$724, DW_AT_accessibility(DW_ACCESS_public)
    3930              $C$DW$725       .dwtag  DW_TAG_member
    3931                      .dwattr $C$DW$725, DW_AT_type(*$C$DW$T$34)
    3932                      .dwattr $C$DW$725, DW_AT_name("flag_enableUserMotorParams")
    3933                      .dwattr $C$DW$725, DW_AT_TI_symbol_name("_flag_enableUserMotorParams")
    3934                      .dwattr $C$DW$725, DW_AT_data_member_location[DW_OP_plus_uconst 0xf5]
    3935                      .dwattr $C$DW$725, DW_AT_accessibility(DW_ACCESS_public)
    3936              $C$DW$726       .dwtag  DW_TAG_member
    3937                      .dwattr $C$DW$726, DW_AT_type(*$C$DW$T$34)
    3938                      .dwattr $C$DW$726, DW_AT_name("flag_enableCurrentCtrl")
TMS320C2000 Assembler PC v6.2.5 Mon Oct 30 13:30:06 2017

Tools Copyright (c) 1996-2014 Texas Instruments Incorporated
C:\Users\wmj\AppData\Local\Temp\0833611                              PAGE   76

    3939                      .dwattr $C$DW$726, DW_AT_TI_symbol_name("_flag_enableCurrentCtrl")
    3940                      .dwattr $C$DW$726, DW_AT_data_member_location[DW_OP_plus_uconst 0xf6]
    3941                      .dwattr $C$DW$726, DW_AT_accessibility(DW_ACCESS_public)
    3942              $C$DW$727       .dwtag  DW_TAG_member
    3943                      .dwattr $C$DW$727, DW_AT_type(*$C$DW$T$32)
    3944                      .dwattr $C$DW$727, DW_AT_name("spd_outMaxRatio_pu")
    3945                      .dwattr $C$DW$727, DW_AT_TI_symbol_name("_spd_outMaxRatio_pu")
    3946                      .dwattr $C$DW$727, DW_AT_data_member_location[DW_OP_plus_uconst 0xf8]
    3947                      .dwattr $C$DW$727, DW_AT_accessibility(DW_ACCESS_public)
    3948              $C$DW$728       .dwtag  DW_TAG_member
    3949                      .dwattr $C$DW$728, DW_AT_type(*$C$DW$T$32)
    3950                      .dwattr $C$DW$728, DW_AT_name("Angle_mech_poles")
    3951                      .dwattr $C$DW$728, DW_AT_TI_symbol_name("_Angle_mech_poles")
    3952                      .dwattr $C$DW$728, DW_AT_data_member_location[DW_OP_plus_uconst 0xfa]
    3953                      .dwattr $C$DW$728, DW_AT_accessibility(DW_ACCESS_public)
    3954              $C$DW$729       .dwtag  DW_TAG_member
    3955                      .dwattr $C$DW$729, DW_AT_type(*$C$DW$T$32)
    3956                      .dwattr $C$DW$729, DW_AT_name("Angle_z1_pu")
    3957                      .dwattr $C$DW$729, DW_AT_TI_symbol_name("_Angle_z1_pu")
    3958                      .dwattr $C$DW$729, DW_AT_data_member_location[DW_OP_plus_uconst 0xfc]
    3959                      .dwattr $C$DW$729, DW_AT_accessibility(DW_ACCESS_public)
    3960              $C$DW$730       .dwtag  DW_TAG_member
    3961                      .dwattr $C$DW$730, DW_AT_type(*$C$DW$T$32)
    3962                      .dwattr $C$DW$730, DW_AT_name("AbsAngle_mech_pu")
    3963                      .dwattr $C$DW$730, DW_AT_TI_symbol_name("_AbsAngle_mech_pu")
    3964                      .dwattr $C$DW$730, DW_AT_data_member_location[DW_OP_plus_uconst 0xfe]
    3965                      .dwattr $C$DW$730, DW_AT_accessibility(DW_ACCESS_public)
    3966              $C$DW$731       .dwtag  DW_TAG_member
    3967                      .dwattr $C$DW$731, DW_AT_type(*$C$DW$T$32)
    3968                      .dwattr $C$DW$731, DW_AT_name("AbsAngle_elec_pu")
    3969                      .dwattr $C$DW$731, DW_AT_TI_symbol_name("_AbsAngle_elec_pu")
    3970                      .dwattr $C$DW$731, DW_AT_data_member_location[DW_OP_plus_uconst 0x100]
    3971                      .dwattr $C$DW$731, DW_AT_accessibility(DW_ACCESS_public)
    3972              $C$DW$732       .dwtag  DW_TAG_member
    3973                      .dwattr $C$DW$732, DW_AT_type(*$C$DW$T$72)
    3974                      .dwattr $C$DW$732, DW_AT_name("Cycle_mech_cnt")
    3975                      .dwattr $C$DW$732, DW_AT_TI_symbol_name("_Cycle_mech_cnt")
    3976                      .dwattr $C$DW$732, DW_AT_data_member_location[DW_OP_plus_uconst 0x102]
    3977                      .dwattr $C$DW$732, DW_AT_accessibility(DW_ACCESS_public)
    3978              $C$DW$733       .dwtag  DW_TAG_member
    3979                      .dwattr $C$DW$733, DW_AT_type(*$C$DW$T$32)
    3980                      .dwattr $C$DW$733, DW_AT_name("enc_Angle")
    3981                      .dwattr $C$DW$733, DW_AT_TI_symbol_name("_enc_Angle")
    3982                      .dwattr $C$DW$733, DW_AT_data_member_location[DW_OP_plus_uconst 0x104]
    3983                      .dwattr $C$DW$733, DW_AT_accessibility(DW_ACCESS_public)
    3984              $C$DW$734       .dwtag  DW_TAG_member
    3985                      .dwattr $C$DW$734, DW_AT_type(*$C$DW$T$34)
    3986                      .dwattr $C$DW$734, DW_AT_name("flag_enableEncAngle")
    3987                      .dwattr $C$DW$734, DW_AT_TI_symbol_name("_flag_enableEncAngle")
    3988                      .dwattr $C$DW$734, DW_AT_data_member_location[DW_OP_plus_uconst 0x106]
    3989                      .dwattr $C$DW$734, DW_AT_accessibility(DW_ACCESS_public)
    3990              $C$DW$735       .dwtag  DW_TAG_member
    3991                      .dwattr $C$DW$735, DW_AT_type(*$C$DW$T$74)
    3992                      .dwattr $C$DW$735, DW_AT_name("brakeHandle")
    3993                      .dwattr $C$DW$735, DW_AT_TI_symbol_name("_brakeHandle")
TMS320C2000 Assembler PC v6.2.5 Mon Oct 30 13:30:06 2017

Tools Copyright (c) 1996-2014 Texas Instruments Incorporated
C:\Users\wmj\AppData\Local\Temp\0833611                              PAGE   77

    3994                      .dwattr $C$DW$735, DW_AT_data_member_location[DW_OP_plus_uconst 0x108]
    3995                      .dwattr $C$DW$735, DW_AT_accessibility(DW_ACCESS_public)
    3996              $C$DW$736       .dwtag  DW_TAG_member
    3997                      .dwattr $C$DW$736, DW_AT_type(*$C$DW$T$75)
    3998                      .dwattr $C$DW$736, DW_AT_name("brake")
    3999                      .dwattr $C$DW$736, DW_AT_TI_symbol_name("_brake")
    4000                      .dwattr $C$DW$736, DW_AT_data_member_location[DW_OP_plus_uconst 0x10a]
    4001                      .dwattr $C$DW$736, DW_AT_accessibility(DW_ACCESS_public)
    4002                      .dwendtag $C$DW$T$76
    4003              
    4004              $C$DW$T$268     .dwtag  DW_TAG_typedef, DW_AT_name("CTRL_Obj")
    4005                      .dwattr $C$DW$T$268, DW_AT_type(*$C$DW$T$76)
    4006                      .dwattr $C$DW$T$268, DW_AT_language(DW_LANG_C)
    4007              $C$DW$T$269     .dwtag  DW_TAG_pointer_type
    4008                      .dwattr $C$DW$T$269, DW_AT_type(*$C$DW$T$268)
    4009                      .dwattr $C$DW$T$269, DW_AT_address_class(0x16)
    4010              $C$DW$T$219     .dwtag  DW_TAG_pointer_type
    4011                      .dwattr $C$DW$T$219, DW_AT_type(*$C$DW$T$76)
    4012                      .dwattr $C$DW$T$219, DW_AT_address_class(0x16)
    4013              $C$DW$T$220     .dwtag  DW_TAG_typedef, DW_AT_name("CTRL_Handle")
    4014                      .dwattr $C$DW$T$220, DW_AT_type(*$C$DW$T$219)
    4015                      .dwattr $C$DW$T$220, DW_AT_language(DW_LANG_C)
    4016              
    4017              $C$DW$T$79      .dwtag  DW_TAG_structure_type
    4018                      .dwattr $C$DW$T$79, DW_AT_name("_CTRL_Version_")
    4019                      .dwattr $C$DW$T$79, DW_AT_byte_size(0x04)
    4020              $C$DW$737       .dwtag  DW_TAG_member
    4021                      .dwattr $C$DW$737, DW_AT_type(*$C$DW$T$23)
    4022                      .dwattr $C$DW$737, DW_AT_name("rsvd")
    4023                      .dwattr $C$DW$737, DW_AT_TI_symbol_name("_rsvd")
    4024                      .dwattr $C$DW$737, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    4025                      .dwattr $C$DW$737, DW_AT_accessibility(DW_ACCESS_public)
    4026              $C$DW$738       .dwtag  DW_TAG_member
    4027                      .dwattr $C$DW$738, DW_AT_type(*$C$DW$T$78)
    4028                      .dwattr $C$DW$738, DW_AT_name("targetProc")
    4029                      .dwattr $C$DW$738, DW_AT_TI_symbol_name("_targetProc")
    4030                      .dwattr $C$DW$738, DW_AT_data_member_location[DW_OP_plus_uconst 0x1]
    4031                      .dwattr $C$DW$738, DW_AT_accessibility(DW_ACCESS_public)
    4032              $C$DW$739       .dwtag  DW_TAG_member
    4033                      .dwattr $C$DW$739, DW_AT_type(*$C$DW$T$23)
    4034                      .dwattr $C$DW$739, DW_AT_name("major")
    4035                      .dwattr $C$DW$739, DW_AT_TI_symbol_name("_major")
    4036                      .dwattr $C$DW$739, DW_AT_data_member_location[DW_OP_plus_uconst 0x2]
    4037                      .dwattr $C$DW$739, DW_AT_accessibility(DW_ACCESS_public)
    4038              $C$DW$740       .dwtag  DW_TAG_member
    4039                      .dwattr $C$DW$740, DW_AT_type(*$C$DW$T$23)
    4040                      .dwattr $C$DW$740, DW_AT_name("minor")
    4041                      .dwattr $C$DW$740, DW_AT_TI_symbol_name("_minor")
    4042                      .dwattr $C$DW$740, DW_AT_data_member_location[DW_OP_plus_uconst 0x3]
    4043                      .dwattr $C$DW$740, DW_AT_accessibility(DW_ACCESS_public)
    4044                      .dwendtag $C$DW$T$79
    4045              
    4046              $C$DW$T$41      .dwtag  DW_TAG_typedef, DW_AT_name("CTRL_Version")
    4047                      .dwattr $C$DW$T$41, DW_AT_type(*$C$DW$T$79)
    4048                      .dwattr $C$DW$T$41, DW_AT_language(DW_LANG_C)
TMS320C2000 Assembler PC v6.2.5 Mon Oct 30 13:30:06 2017

Tools Copyright (c) 1996-2014 Texas Instruments Incorporated
C:\Users\wmj\AppData\Local\Temp\0833611                              PAGE   78

    4049              $C$DW$T$276     .dwtag  DW_TAG_pointer_type
    4050                      .dwattr $C$DW$T$276, DW_AT_type(*$C$DW$T$41)
    4051                      .dwattr $C$DW$T$276, DW_AT_address_class(0x16)
    4052              
    4053              $C$DW$T$20      .dwtag  DW_TAG_structure_type
    4054                      .dwattr $C$DW$T$20, DW_AT_name("_EST_Obj_")
    4055                      .dwattr $C$DW$T$20, DW_AT_declaration
    4056                      .dwendtag $C$DW$T$20
    4057              
    4058              $C$DW$T$49      .dwtag  DW_TAG_pointer_type
    4059                      .dwattr $C$DW$T$49, DW_AT_type(*$C$DW$T$20)
    4060                      .dwattr $C$DW$T$49, DW_AT_address_class(0x16)
    4061              $C$DW$T$50      .dwtag  DW_TAG_typedef, DW_AT_name("EST_Handle")
    4062                      .dwattr $C$DW$T$50, DW_AT_type(*$C$DW$T$49)
    4063                      .dwattr $C$DW$T$50, DW_AT_language(DW_LANG_C)
    4064              
    4065              $C$DW$T$80      .dwtag  DW_TAG_structure_type
    4066                      .dwattr $C$DW$T$80, DW_AT_name("_FILTER_FO_")
    4067                      .dwattr $C$DW$T$80, DW_AT_byte_size(0x0a)
    4068              $C$DW$741       .dwtag  DW_TAG_member
    4069                      .dwattr $C$DW$741, DW_AT_type(*$C$DW$T$32)
    4070                      .dwattr $C$DW$741, DW_AT_name("a1")
    4071                      .dwattr $C$DW$741, DW_AT_TI_symbol_name("_a1")
    4072                      .dwattr $C$DW$741, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    4073                      .dwattr $C$DW$741, DW_AT_accessibility(DW_ACCESS_public)
    4074              $C$DW$742       .dwtag  DW_TAG_member
    4075                      .dwattr $C$DW$742, DW_AT_type(*$C$DW$T$32)
    4076                      .dwattr $C$DW$742, DW_AT_name("b0")
    4077                      .dwattr $C$DW$742, DW_AT_TI_symbol_name("_b0")
    4078                      .dwattr $C$DW$742, DW_AT_data_member_location[DW_OP_plus_uconst 0x2]
    4079                      .dwattr $C$DW$742, DW_AT_accessibility(DW_ACCESS_public)
    4080              $C$DW$743       .dwtag  DW_TAG_member
    4081                      .dwattr $C$DW$743, DW_AT_type(*$C$DW$T$32)
    4082                      .dwattr $C$DW$743, DW_AT_name("b1")
    4083                      .dwattr $C$DW$743, DW_AT_TI_symbol_name("_b1")
    4084                      .dwattr $C$DW$743, DW_AT_data_member_location[DW_OP_plus_uconst 0x4]
    4085                      .dwattr $C$DW$743, DW_AT_accessibility(DW_ACCESS_public)
    4086              $C$DW$744       .dwtag  DW_TAG_member
    4087                      .dwattr $C$DW$744, DW_AT_type(*$C$DW$T$32)
    4088                      .dwattr $C$DW$744, DW_AT_name("x1")
    4089                      .dwattr $C$DW$744, DW_AT_TI_symbol_name("_x1")
    4090                      .dwattr $C$DW$744, DW_AT_data_member_location[DW_OP_plus_uconst 0x6]
    4091                      .dwattr $C$DW$744, DW_AT_accessibility(DW_ACCESS_public)
    4092              $C$DW$745       .dwtag  DW_TAG_member
    4093                      .dwattr $C$DW$745, DW_AT_type(*$C$DW$T$32)
    4094                      .dwattr $C$DW$745, DW_AT_name("y1")
    4095                      .dwattr $C$DW$745, DW_AT_TI_symbol_name("_y1")
    4096                      .dwattr $C$DW$745, DW_AT_data_member_location[DW_OP_plus_uconst 0x8]
    4097                      .dwattr $C$DW$745, DW_AT_accessibility(DW_ACCESS_public)
    4098                      .dwendtag $C$DW$T$80
    4099              
    4100              $C$DW$T$197     .dwtag  DW_TAG_typedef, DW_AT_name("FILTER_FO_Obj")
    4101                      .dwattr $C$DW$T$197, DW_AT_type(*$C$DW$T$80)
    4102                      .dwattr $C$DW$T$197, DW_AT_language(DW_LANG_C)
    4103              
TMS320C2000 Assembler PC v6.2.5 Mon Oct 30 13:30:06 2017

Tools Copyright (c) 1996-2014 Texas Instruments Incorporated
C:\Users\wmj\AppData\Local\Temp\0833611                              PAGE   79

    4104              $C$DW$T$21      .dwtag  DW_TAG_structure_type
    4105                      .dwattr $C$DW$T$21, DW_AT_name("_FILTER_FO_Obj_")
    4106                      .dwattr $C$DW$T$21, DW_AT_declaration
    4107                      .dwendtag $C$DW$T$21
    4108              
    4109              $C$DW$T$198     .dwtag  DW_TAG_pointer_type
    4110                      .dwattr $C$DW$T$198, DW_AT_type(*$C$DW$T$21)
    4111                      .dwattr $C$DW$T$198, DW_AT_address_class(0x16)
    4112              $C$DW$T$199     .dwtag  DW_TAG_typedef, DW_AT_name("FILTER_FO_Handle")
    4113                      .dwattr $C$DW$T$199, DW_AT_type(*$C$DW$T$198)
    4114                      .dwattr $C$DW$T$199, DW_AT_language(DW_LANG_C)
    4115              
    4116              $C$DW$T$81      .dwtag  DW_TAG_structure_type
    4117                      .dwattr $C$DW$T$81, DW_AT_name("_FLASH_Obj_")
    4118                      .dwattr $C$DW$T$81, DW_AT_byte_size(0x08)
    4119              $C$DW$746       .dwtag  DW_TAG_member
    4120                      .dwattr $C$DW$746, DW_AT_type(*$C$DW$T$24)
    4121                      .dwattr $C$DW$746, DW_AT_name("FOPT")
    4122                      .dwattr $C$DW$746, DW_AT_TI_symbol_name("_FOPT")
    4123                      .dwattr $C$DW$746, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    4124                      .dwattr $C$DW$746, DW_AT_accessibility(DW_ACCESS_public)
    4125              $C$DW$747       .dwtag  DW_TAG_member
    4126                      .dwattr $C$DW$747, DW_AT_type(*$C$DW$T$24)
    4127                      .dwattr $C$DW$747, DW_AT_name("rsvd_1")
    4128                      .dwattr $C$DW$747, DW_AT_TI_symbol_name("_rsvd_1")
    4129                      .dwattr $C$DW$747, DW_AT_data_member_location[DW_OP_plus_uconst 0x1]
    4130                      .dwattr $C$DW$747, DW_AT_accessibility(DW_ACCESS_public)
    4131              $C$DW$748       .dwtag  DW_TAG_member
    4132                      .dwattr $C$DW$748, DW_AT_type(*$C$DW$T$24)
    4133                      .dwattr $C$DW$748, DW_AT_name("FPWR")
    4134                      .dwattr $C$DW$748, DW_AT_TI_symbol_name("_FPWR")
    4135                      .dwattr $C$DW$748, DW_AT_data_member_location[DW_OP_plus_uconst 0x2]
    4136                      .dwattr $C$DW$748, DW_AT_accessibility(DW_ACCESS_public)
    4137              $C$DW$749       .dwtag  DW_TAG_member
    4138                      .dwattr $C$DW$749, DW_AT_type(*$C$DW$T$24)
    4139                      .dwattr $C$DW$749, DW_AT_name("FSTATUS")
    4140                      .dwattr $C$DW$749, DW_AT_TI_symbol_name("_FSTATUS")
    4141                      .dwattr $C$DW$749, DW_AT_data_member_location[DW_OP_plus_uconst 0x3]
    4142                      .dwattr $C$DW$749, DW_AT_accessibility(DW_ACCESS_public)
    4143              $C$DW$750       .dwtag  DW_TAG_member
    4144                      .dwattr $C$DW$750, DW_AT_type(*$C$DW$T$24)
    4145                      .dwattr $C$DW$750, DW_AT_name("FSTDBYWAIT")
    4146                      .dwattr $C$DW$750, DW_AT_TI_symbol_name("_FSTDBYWAIT")
    4147                      .dwattr $C$DW$750, DW_AT_data_member_location[DW_OP_plus_uconst 0x4]
    4148                      .dwattr $C$DW$750, DW_AT_accessibility(DW_ACCESS_public)
    4149              $C$DW$751       .dwtag  DW_TAG_member
    4150                      .dwattr $C$DW$751, DW_AT_type(*$C$DW$T$24)
    4151                      .dwattr $C$DW$751, DW_AT_name("FACTIVEWAIT")
    4152                      .dwattr $C$DW$751, DW_AT_TI_symbol_name("_FACTIVEWAIT")
    4153                      .dwattr $C$DW$751, DW_AT_data_member_location[DW_OP_plus_uconst 0x5]
    4154                      .dwattr $C$DW$751, DW_AT_accessibility(DW_ACCESS_public)
    4155              $C$DW$752       .dwtag  DW_TAG_member
    4156                      .dwattr $C$DW$752, DW_AT_type(*$C$DW$T$24)
    4157                      .dwattr $C$DW$752, DW_AT_name("FBANKWAIT")
    4158                      .dwattr $C$DW$752, DW_AT_TI_symbol_name("_FBANKWAIT")
TMS320C2000 Assembler PC v6.2.5 Mon Oct 30 13:30:06 2017

Tools Copyright (c) 1996-2014 Texas Instruments Incorporated
C:\Users\wmj\AppData\Local\Temp\0833611                              PAGE   80

    4159                      .dwattr $C$DW$752, DW_AT_data_member_location[DW_OP_plus_uconst 0x6]
    4160                      .dwattr $C$DW$752, DW_AT_accessibility(DW_ACCESS_public)
    4161              $C$DW$753       .dwtag  DW_TAG_member
    4162                      .dwattr $C$DW$753, DW_AT_type(*$C$DW$T$24)
    4163                      .dwattr $C$DW$753, DW_AT_name("FOTPWAIT")
    4164                      .dwattr $C$DW$753, DW_AT_TI_symbol_name("_FOTPWAIT")
    4165                      .dwattr $C$DW$753, DW_AT_data_member_location[DW_OP_plus_uconst 0x7]
    4166                      .dwattr $C$DW$753, DW_AT_accessibility(DW_ACCESS_public)
    4167                      .dwendtag $C$DW$T$81
    4168              
    4169              $C$DW$T$126     .dwtag  DW_TAG_pointer_type
    4170                      .dwattr $C$DW$T$126, DW_AT_type(*$C$DW$T$81)
    4171                      .dwattr $C$DW$T$126, DW_AT_address_class(0x16)
    4172              $C$DW$T$127     .dwtag  DW_TAG_typedef, DW_AT_name("FLASH_Handle")
    4173                      .dwattr $C$DW$T$127, DW_AT_type(*$C$DW$T$126)
    4174                      .dwattr $C$DW$T$127, DW_AT_language(DW_LANG_C)
    4175              
    4176              $C$DW$T$101     .dwtag  DW_TAG_structure_type
    4177                      .dwattr $C$DW$T$101, DW_AT_name("_FSM_Obj_")
    4178                      .dwattr $C$DW$T$101, DW_AT_byte_size(0x24)
    4179              $C$DW$754       .dwtag  DW_TAG_member
    4180                      .dwattr $C$DW$754, DW_AT_type(*$C$DW$T$83)
    4181                      .dwattr $C$DW$754, DW_AT_name("motorHandle")
    4182                      .dwattr $C$DW$754, DW_AT_TI_symbol_name("_motorHandle")
    4183                      .dwattr $C$DW$754, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    4184                      .dwattr $C$DW$754, DW_AT_accessibility(DW_ACCESS_public)
    4185              $C$DW$755       .dwtag  DW_TAG_member
    4186                      .dwattr $C$DW$755, DW_AT_type(*$C$DW$T$85)
    4187                      .dwattr $C$DW$755, DW_AT_name("halHandle")
    4188                      .dwattr $C$DW$755, DW_AT_TI_symbol_name("_halHandle")
    4189                      .dwattr $C$DW$755, DW_AT_data_member_location[DW_OP_plus_uconst 0x2]
    4190                      .dwattr $C$DW$755, DW_AT_accessibility(DW_ACCESS_public)
    4191              $C$DW$756       .dwtag  DW_TAG_member
    4192                      .dwattr $C$DW$756, DW_AT_type(*$C$DW$T$87)
    4193                      .dwattr $C$DW$756, DW_AT_name("StBoxHandle")
    4194                      .dwattr $C$DW$756, DW_AT_TI_symbol_name("_StBoxHandle")
    4195                      .dwattr $C$DW$756, DW_AT_data_member_location[DW_OP_plus_uconst 0x4]
    4196                      .dwattr $C$DW$756, DW_AT_accessibility(DW_ACCESS_public)
    4197              $C$DW$757       .dwtag  DW_TAG_member
    4198                      .dwattr $C$DW$757, DW_AT_type(*$C$DW$T$89)
    4199                      .dwattr $C$DW$757, DW_AT_name("FSM_State")
    4200                      .dwattr $C$DW$757, DW_AT_TI_symbol_name("_FSM_State")
    4201                      .dwattr $C$DW$757, DW_AT_data_member_location[DW_OP_plus_uconst 0x6]
    4202                      .dwattr $C$DW$757, DW_AT_accessibility(DW_ACCESS_public)
    4203              $C$DW$758       .dwtag  DW_TAG_member
    4204                      .dwattr $C$DW$758, DW_AT_type(*$C$DW$T$89)
    4205                      .dwattr $C$DW$758, DW_AT_name("FSM_CurState")
    4206                      .dwattr $C$DW$758, DW_AT_TI_symbol_name("_FSM_CurState")
    4207                      .dwattr $C$DW$758, DW_AT_data_member_location[DW_OP_plus_uconst 0x7]
    4208                      .dwattr $C$DW$758, DW_AT_accessibility(DW_ACCESS_public)
    4209              $C$DW$759       .dwtag  DW_TAG_member
    4210                      .dwattr $C$DW$759, DW_AT_type(*$C$DW$T$91)
    4211                      .dwattr $C$DW$759, DW_AT_name("FSM_Trans")
    4212                      .dwattr $C$DW$759, DW_AT_TI_symbol_name("_FSM_Trans")
    4213                      .dwattr $C$DW$759, DW_AT_data_member_location[DW_OP_plus_uconst 0x8]
TMS320C2000 Assembler PC v6.2.5 Mon Oct 30 13:30:06 2017

Tools Copyright (c) 1996-2014 Texas Instruments Incorporated
C:\Users\wmj\AppData\Local\Temp\0833611                              PAGE   81

    4214                      .dwattr $C$DW$759, DW_AT_accessibility(DW_ACCESS_public)
    4215              $C$DW$760       .dwtag  DW_TAG_member
    4216                      .dwattr $C$DW$760, DW_AT_type(*$C$DW$T$93)
    4217                      .dwattr $C$DW$760, DW_AT_name("FSM_Event")
    4218                      .dwattr $C$DW$760, DW_AT_TI_symbol_name("_FSM_Event")
    4219                      .dwattr $C$DW$760, DW_AT_data_member_location[DW_OP_plus_uconst 0x9]
    4220                      .dwattr $C$DW$760, DW_AT_accessibility(DW_ACCESS_public)
    4221              $C$DW$761       .dwtag  DW_TAG_member
    4222                      .dwattr $C$DW$761, DW_AT_type(*$C$DW$T$95)
    4223                      .dwattr $C$DW$761, DW_AT_name("FSM_StMode")
    4224                      .dwattr $C$DW$761, DW_AT_TI_symbol_name("_FSM_StMode")
    4225                      .dwattr $C$DW$761, DW_AT_data_member_location[DW_OP_plus_uconst 0xa]
    4226                      .dwattr $C$DW$761, DW_AT_accessibility(DW_ACCESS_public)
    4227              $C$DW$762       .dwtag  DW_TAG_member
    4228                      .dwattr $C$DW$762, DW_AT_type(*$C$DW$T$23)
    4229                      .dwattr $C$DW$762, DW_AT_name("FSM_ErrFlg")
    4230                      .dwattr $C$DW$762, DW_AT_TI_symbol_name("_FSM_ErrFlg")
    4231                      .dwattr $C$DW$762, DW_AT_data_member_location[DW_OP_plus_uconst 0xb]
    4232                      .dwattr $C$DW$762, DW_AT_accessibility(DW_ACCESS_public)
    4233              $C$DW$763       .dwtag  DW_TAG_member
    4234                      .dwattr $C$DW$763, DW_AT_type(*$C$DW$T$23)
    4235                      .dwattr $C$DW$763, DW_AT_name("FSM_runTime")
    4236                      .dwattr $C$DW$763, DW_AT_TI_symbol_name("_FSM_runTime")
    4237                      .dwattr $C$DW$763, DW_AT_data_member_location[DW_OP_plus_uconst 0xc]
    4238                      .dwattr $C$DW$763, DW_AT_accessibility(DW_ACCESS_public)
    4239              $C$DW$764       .dwtag  DW_TAG_member
    4240                      .dwattr $C$DW$764, DW_AT_type(*$C$DW$T$23)
    4241                      .dwattr $C$DW$764, DW_AT_name("FSM_485Cmd")
    4242                      .dwattr $C$DW$764, DW_AT_TI_symbol_name("_FSM_485Cmd")
    4243                      .dwattr $C$DW$764, DW_AT_data_member_location[DW_OP_plus_uconst 0xd]
    4244                      .dwattr $C$DW$764, DW_AT_accessibility(DW_ACCESS_public)
    4245              $C$DW$765       .dwtag  DW_TAG_member
    4246                      .dwattr $C$DW$765, DW_AT_type(*$C$DW$T$89)
    4247                      .dwattr $C$DW$765, DW_AT_name("FSM_485EditState")
    4248                      .dwattr $C$DW$765, DW_AT_TI_symbol_name("_FSM_485EditState")
    4249                      .dwattr $C$DW$765, DW_AT_data_member_location[DW_OP_plus_uconst 0xe]
    4250                      .dwattr $C$DW$765, DW_AT_accessibility(DW_ACCESS_public)
    4251              $C$DW$766       .dwtag  DW_TAG_member
    4252                      .dwattr $C$DW$766, DW_AT_type(*$C$DW$T$97)
    4253                      .dwattr $C$DW$766, DW_AT_name("FSM_485EditOpt")
