TMS320C2000 Assembler PC v6.2.5 Mon Sep 11 15:13:22 2017

Tools Copyright (c) 1996-2014 Texas Instruments Incorporated
C:\Users\wmj\AppData\Local\Temp\1124010                              PAGE    1

       1              ;***************************************************************
       2              ;* TMS320C2000 C/C++ Codegen                         PC v6.2.5 *
       3              ;* Date/Time created: Mon Sep 11 15:13:22 2017                 *
       4              ;***************************************************************
       5                      .compiler_opts --float_support=softlib --hll_source=on --mem_model:code=flat --mem_model:data=large -
       6        0002  FP      .set    XAR2
       7              
       8              $C$DW$CU        .dwtag  DW_TAG_compile_unit
       9                      .dwattr $C$DW$CU, DW_AT_name("D:/FOC_27/sw/solutions/instaspin_foc/src/proj_lab10e.c")
      10                      .dwattr $C$DW$CU, DW_AT_producer("TMS320C2000 C/C++ Codegen PC v6.2.5 Copyright (c) 1996-2014 Texas I
      11                      .dwattr $C$DW$CU, DW_AT_TI_version(0x01)
      12                      .dwattr $C$DW$CU, DW_AT_comp_dir("D:\FOC_27\sw\solutions\instaspin_foc\boards\hvkit_rev1p1\f28x\f2802
      13              ;**************************************************************
      14              ;* CINIT RECORDS                                              *

    6185                      .dwattr $C$DW$T$303, DW_AT_type(*$C$DW$T$302)
    6186                      .dwattr $C$DW$T$303, DW_AT_language(DW_LANG_C)
    6187              
    6188              $C$DW$T$305     .dwtag  DW_TAG_enumeration_type
    6189                      .dwattr $C$DW$T$305, DW_AT_byte_size(0x01)
    6190              $C$DW$756       .dwtag  DW_TAG_enumerator, DW_AT_name("CTRL_Type_PID_spd"), DW_AT_const_value(0x00)
    6191              $C$DW$757       .dwtag  DW_TAG_enumerator, DW_AT_name("CTRL_Type_PID_Id"), DW_AT_const_value(0x01)
    6192              $C$DW$758       .dwtag  DW_TAG_enumerator, DW_AT_name("CTRL_Type_PID_Iq"), DW_AT_const_value(0x02)
    6193                      .dwendtag $C$DW$T$305
    6194              
    6195              $C$DW$T$306     .dwtag  DW_TAG_typedef, DW_AT_name("CTRL_Type_e")
    6196                      .dwattr $C$DW$T$306, DW_AT_type(*$C$DW$T$305)
    6197                      .dwattr $C$DW$T$306, DW_AT_language(DW_LANG_C)
    6198              
    6199              $C$DW$T$308     .dwtag  DW_TAG_enumeration_type
    6200                      .dwattr $C$DW$T$308, DW_AT_byte_size(0x01)
    6201              $C$DW$759       .dwtag  DW_TAG_enumerator, DW_AT_name("LDC161x_ChNum_CH0"), DW_AT_const_value(0x00)
    6202              $C$DW$760       .dwtag  DW_TAG_enumerator, DW_AT_name("LDC161x_ChNum_CH1"), DW_AT_const_value(0x01)
    6203              $C$DW$761       .dwtag  DW_TAG_enumerator, DW_AT_name("LDC161x_ChNum_CH2"), DW_AT_const_value(0x02)
    6204              $C$DW$762       .dwtag  DW_TAG_enumerator, DW_AT_name("LDC161x_ChNum_CH3"), DW_AT_const_value(0x03)
    6205                      .dwendtag $C$DW$T$308
    6206              
    6207              $C$DW$T$309     .dwtag  DW_TAG_typedef, DW_AT_name("LDC161x_ChNum_e")
    6208                      .dwattr $C$DW$T$309, DW_AT_type(*$C$DW$T$308)
    6209                      .dwattr $C$DW$T$309, DW_AT_language(DW_LANG_C)
    6210              $C$DW$763       .dwtag  DW_TAG_TI_far_type
    6211                      .dwattr $C$DW$763, DW_AT_type(*$C$DW$T$309)
    6212              $C$DW$T$310     .dwtag  DW_TAG_const_type
    6213                      .dwattr $C$DW$T$310, DW_AT_type(*$C$DW$763)
    6214              
    6215              $C$DW$T$311     .dwtag  DW_TAG_enumeration_type
    6216                      .dwattr $C$DW$T$311, DW_AT_byte_size(0x01)
    6217              $C$DW$764       .dwtag  DW_TAG_enumerator, DW_AT_name("PCA955x_PortNum_Port0"), DW_AT_const_value(0x00)
    6218              $C$DW$765       .dwtag  DW_TAG_enumerator, DW_AT_name("PCA955x_PortNum_Port1"), DW_AT_const_value(0x01)
    6219                      .dwendtag $C$DW$T$311
    6220              
TMS320C2000 Assembler PC v6.2.5 Mon Sep 11 15:13:22 2017

Tools Copyright (c) 1996-2014 Texas Instruments Incorporated
C:\Users\wmj\AppData\Local\Temp\1124010                              PAGE  123

    6221              $C$DW$T$312     .dwtag  DW_TAG_typedef, DW_AT_name("PCA955x_PortNum_e")
    6222                      .dwattr $C$DW$T$312, DW_AT_type(*$C$DW$T$311)
    6223                      .dwattr $C$DW$T$312, DW_AT_language(DW_LANG_C)
    6224              
    6225              $C$DW$T$313     .dwtag  DW_TAG_enumeration_type
    6226                      .dwattr $C$DW$T$313, DW_AT_byte_size(0x01)
    6227              $C$DW$766       .dwtag  DW_TAG_enumerator, DW_AT_name("HAL_SensorType_Current"), DW_AT_const_value(0x00)
    6228              $C$DW$767       .dwtag  DW_TAG_enumerator, DW_AT_name("HAL_SensorType_Voltage"), DW_AT_const_value(0x01)
    6229                      .dwendtag $C$DW$T$313
    6230              
    6231              $C$DW$T$314     .dwtag  DW_TAG_typedef, DW_AT_name("HAL_SensorType_e")
    6232                      .dwattr $C$DW$T$314, DW_AT_type(*$C$DW$T$313)
    6233                      .dwattr $C$DW$T$314, DW_AT_language(DW_LANG_C)
    6234              
    6235              $C$DW$T$19      .dwtag  DW_TAG_structure_type
    6236                      .dwattr $C$DW$T$19, DW_AT_name("I2C_Obj")
    6237                      .dwattr $C$DW$T$19, DW_AT_declaration
    6238                      .dwendtag $C$DW$T$19
    6239              
    6240              $C$DW$T$127     .dwtag  DW_TAG_pointer_type
    6241                      .dwattr $C$DW$T$127, DW_AT_type(*$C$DW$T$19)
    6242                      .dwattr $C$DW$T$127, DW_AT_address_class(0x16)
    6243              $C$DW$T$128     .dwtag  DW_TAG_typedef, DW_AT_name("I2C_Handle")
    6244                      .dwattr $C$DW$T$128, DW_AT_type(*$C$DW$T$127)
    6245                      .dwattr $C$DW$T$128, DW_AT_language(DW_LANG_C)
    6246              
    6247              $C$DW$T$20      .dwtag  DW_TAG_structure_type
    6248                      .dwattr $C$DW$T$20, DW_AT_name("LDC161x_REG_Obj")
    6249                      .dwattr $C$DW$T$20, DW_AT_declaration
    6250                      .dwendtag $C$DW$T$20
    6251              
    6252              $C$DW$T$144     .dwtag  DW_TAG_pointer_type
    6253                      .dwattr $C$DW$T$144, DW_AT_type(*$C$DW$T$20)
    6254                      .dwattr $C$DW$T$144, DW_AT_address_class(0x16)
    6255              $C$DW$T$145     .dwtag  DW_TAG_typedef, DW_AT_name("LDC_Handle")
    6256                      .dwattr $C$DW$T$145, DW_AT_type(*$C$DW$T$144)
    6257                      .dwattr $C$DW$T$145, DW_AT_language(DW_LANG_C)
    6258              
    6259              $C$DW$T$32      .dwtag  DW_TAG_structure_type
    6260                      .dwattr $C$DW$T$32, DW_AT_name("_ADC_Obj_")
    6261                      .dwattr $C$DW$T$32, DW_AT_byte_size(0x6650)
    6262              $C$DW$768       .dwtag  DW_TAG_member
    6263                      .dwattr $C$DW$768, DW_AT_type(*$C$DW$T$26)
    6264                      .dwattr $C$DW$768, DW_AT_name("ADCRESULT")
    6265                      .dwattr $C$DW$768, DW_AT_TI_symbol_name("_ADCRESULT")
    6266                      .dwattr $C$DW$768, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    6267                      .dwattr $C$DW$768, DW_AT_accessibility(DW_ACCESS_public)
    6268              $C$DW$769       .dwtag  DW_TAG_member
    6269                      .dwattr $C$DW$769, DW_AT_type(*$C$DW$T$27)
    6270                      .dwattr $C$DW$769, DW_AT_name("resvd_1")
    6271                      .dwattr $C$DW$769, DW_AT_TI_symbol_name("_resvd_1")
    6272                      .dwattr $C$DW$769, DW_AT_data_member_location[DW_OP_plus_uconst 0x10]
    6273                      .dwattr $C$DW$769, DW_AT_accessibility(DW_ACCESS_public)
    6274              $C$DW$770       .dwtag  DW_TAG_member
    6275                      .dwattr $C$DW$770, DW_AT_type(*$C$DW$T$25)
TMS320C2000 Assembler PC v6.2.5 Mon Sep 11 15:13:22 2017

Tools Copyright (c) 1996-2014 Texas Instruments Incorporated
C:\Users\wmj\AppData\Local\Temp\1124010                              PAGE  124

    6276                      .dwattr $C$DW$770, DW_AT_name("ADCCTL1")
    6277                      .dwattr $C$DW$770, DW_AT_TI_symbol_name("_ADCCTL1")
    6278                      .dwattr $C$DW$770, DW_AT_data_member_location[DW_OP_plus_uconst 0x6600]
    6279                      .dwattr $C$DW$770, DW_AT_accessibility(DW_ACCESS_public)
    6280              $C$DW$771       .dwtag  DW_TAG_member
    6281                      .dwattr $C$DW$771, DW_AT_type(*$C$DW$T$25)
    6282                      .dwattr $C$DW$771, DW_AT_name("ADCCTL2")
    6283                      .dwattr $C$DW$771, DW_AT_TI_symbol_name("_ADCCTL2")
    6284                      .dwattr $C$DW$771, DW_AT_data_member_location[DW_OP_plus_uconst 0x6601]
    6285                      .dwattr $C$DW$771, DW_AT_accessibility(DW_ACCESS_public)
    6286              $C$DW$772       .dwtag  DW_TAG_member
    6287                      .dwattr $C$DW$772, DW_AT_type(*$C$DW$T$28)
    6288                      .dwattr $C$DW$772, DW_AT_name("rsvd_2")
    6289                      .dwattr $C$DW$772, DW_AT_TI_symbol_name("_rsvd_2")
    6290                      .dwattr $C$DW$772, DW_AT_data_member_location[DW_OP_plus_uconst 0x6602]
    6291                      .dwattr $C$DW$772, DW_AT_accessibility(DW_ACCESS_public)
    6292              $C$DW$773       .dwtag  DW_TAG_member
    6293                      .dwattr $C$DW$773, DW_AT_type(*$C$DW$T$25)
    6294                      .dwattr $C$DW$773, DW_AT_name("ADCINTFLG")
    6295                      .dwattr $C$DW$773, DW_AT_TI_symbol_name("_ADCINTFLG")
    6296                      .dwattr $C$DW$773, DW_AT_data_member_location[DW_OP_plus_uconst 0x6604]
    6297                      .dwattr $C$DW$773, DW_AT_accessibility(DW_ACCESS_public)
    6298              $C$DW$774       .dwtag  DW_TAG_member
    6299                      .dwattr $C$DW$774, DW_AT_type(*$C$DW$T$25)
    6300                      .dwattr $C$DW$774, DW_AT_name("ADCINTFLGCLR")
    6301                      .dwattr $C$DW$774, DW_AT_TI_symbol_name("_ADCINTFLGCLR")
    6302                      .dwattr $C$DW$774, DW_AT_data_member_location[DW_OP_plus_uconst 0x6605]
    6303                      .dwattr $C$DW$774, DW_AT_accessibility(DW_ACCESS_public)
    6304              $C$DW$775       .dwtag  DW_TAG_member
    6305                      .dwattr $C$DW$775, DW_AT_type(*$C$DW$T$25)
    6306                      .dwattr $C$DW$775, DW_AT_name("ADCINTOVF")
    6307                      .dwattr $C$DW$775, DW_AT_TI_symbol_name("_ADCINTOVF")
    6308                      .dwattr $C$DW$775, DW_AT_data_member_location[DW_OP_plus_uconst 0x6606]
    6309                      .dwattr $C$DW$775, DW_AT_accessibility(DW_ACCESS_public)
    6310              $C$DW$776       .dwtag  DW_TAG_member
    6311                      .dwattr $C$DW$776, DW_AT_type(*$C$DW$T$25)
    6312                      .dwattr $C$DW$776, DW_AT_name("ADCINTOVFCLR")
    6313                      .dwattr $C$DW$776, DW_AT_TI_symbol_name("_ADCINTOVFCLR")
    6314                      .dwattr $C$DW$776, DW_AT_data_member_location[DW_OP_plus_uconst 0x6607]
    6315                      .dwattr $C$DW$776, DW_AT_accessibility(DW_ACCESS_public)
    6316              $C$DW$777       .dwtag  DW_TAG_member
    6317                      .dwattr $C$DW$777, DW_AT_type(*$C$DW$T$29)
    6318                      .dwattr $C$DW$777, DW_AT_name("INTSELxNy")
    6319                      .dwattr $C$DW$777, DW_AT_TI_symbol_name("_INTSELxNy")
    6320                      .dwattr $C$DW$777, DW_AT_data_member_location[DW_OP_plus_uconst 0x6608]
    6321                      .dwattr $C$DW$777, DW_AT_accessibility(DW_ACCESS_public)
    6322              $C$DW$778       .dwtag  DW_TAG_member
    6323                      .dwattr $C$DW$778, DW_AT_type(*$C$DW$T$30)
    6324                      .dwattr $C$DW$778, DW_AT_name("rsvd_3")
    6325                      .dwattr $C$DW$778, DW_AT_TI_symbol_name("_rsvd_3")
    6326                      .dwattr $C$DW$778, DW_AT_data_member_location[DW_OP_plus_uconst 0x660d]
    6327                      .dwattr $C$DW$778, DW_AT_accessibility(DW_ACCESS_public)
    6328              $C$DW$779       .dwtag  DW_TAG_member
    6329                      .dwattr $C$DW$779, DW_AT_type(*$C$DW$T$25)
    6330                      .dwattr $C$DW$779, DW_AT_name("SOCPRICTRL")
TMS320C2000 Assembler PC v6.2.5 Mon Sep 11 15:13:22 2017

Tools Copyright (c) 1996-2014 Texas Instruments Incorporated
C:\Users\wmj\AppData\Local\Temp\1124010                              PAGE  125

    6331                      .dwattr $C$DW$779, DW_AT_TI_symbol_name("_SOCPRICTRL")
    6332                      .dwattr $C$DW$779, DW_AT_data_member_location[DW_OP_plus_uconst 0x6610]
    6333                      .dwattr $C$DW$779, DW_AT_accessibility(DW_ACCESS_public)
    6334              $C$DW$780       .dwtag  DW_TAG_member
    6335                      .dwattr $C$DW$780, DW_AT_type(*$C$DW$T$25)
    6336                      .dwattr $C$DW$780, DW_AT_name("rsvd_4")
    6337                      .dwattr $C$DW$780, DW_AT_TI_symbol_name("_rsvd_4")
    6338                      .dwattr $C$DW$780, DW_AT_data_member_location[DW_OP_plus_uconst 0x6611]
    6339                      .dwattr $C$DW$780, DW_AT_accessibility(DW_ACCESS_public)
    6340              $C$DW$781       .dwtag  DW_TAG_member
    6341                      .dwattr $C$DW$781, DW_AT_type(*$C$DW$T$25)
    6342                      .dwattr $C$DW$781, DW_AT_name("ADCSAMPLEMODE")
    6343                      .dwattr $C$DW$781, DW_AT_TI_symbol_name("_ADCSAMPLEMODE")
    6344                      .dwattr $C$DW$781, DW_AT_data_member_location[DW_OP_plus_uconst 0x6612]
    6345                      .dwattr $C$DW$781, DW_AT_accessibility(DW_ACCESS_public)
    6346              $C$DW$782       .dwtag  DW_TAG_member
    6347                      .dwattr $C$DW$782, DW_AT_type(*$C$DW$T$25)
    6348                      .dwattr $C$DW$782, DW_AT_name("rsvd_5")
    6349                      .dwattr $C$DW$782, DW_AT_TI_symbol_name("_rsvd_5")
    6350                      .dwattr $C$DW$782, DW_AT_data_member_location[DW_OP_plus_uconst 0x6613]
    6351                      .dwattr $C$DW$782, DW_AT_accessibility(DW_ACCESS_public)
    6352              $C$DW$783       .dwtag  DW_TAG_member
    6353                      .dwattr $C$DW$783, DW_AT_type(*$C$DW$T$25)
    6354                      .dwattr $C$DW$783, DW_AT_name("ADCINTSOCSEL1")
    6355                      .dwattr $C$DW$783, DW_AT_TI_symbol_name("_ADCINTSOCSEL1")
    6356                      .dwattr $C$DW$783, DW_AT_data_member_location[DW_OP_plus_uconst 0x6614]
    6357                      .dwattr $C$DW$783, DW_AT_accessibility(DW_ACCESS_public)
    6358              $C$DW$784       .dwtag  DW_TAG_member
    6359                      .dwattr $C$DW$784, DW_AT_type(*$C$DW$T$25)
    6360                      .dwattr $C$DW$784, DW_AT_name("ADCINTSOCSEL2")
    6361                      .dwattr $C$DW$784, DW_AT_TI_symbol_name("_ADCINTSOCSEL2")
    6362                      .dwattr $C$DW$784, DW_AT_data_member_location[DW_OP_plus_uconst 0x6615]
    6363                      .dwattr $C$DW$784, DW_AT_accessibility(DW_ACCESS_public)
    6364              $C$DW$785       .dwtag  DW_TAG_member
    6365                      .dwattr $C$DW$785, DW_AT_type(*$C$DW$T$28)
    6366                      .dwattr $C$DW$785, DW_AT_name("rsvd_6")
    6367                      .dwattr $C$DW$785, DW_AT_TI_symbol_name("_rsvd_6")
    6368                      .dwattr $C$DW$785, DW_AT_data_member_location[DW_OP_plus_uconst 0x6616]
    6369                      .dwattr $C$DW$785, DW_AT_accessibility(DW_ACCESS_public)
    6370              $C$DW$786       .dwtag  DW_TAG_member
    6371                      .dwattr $C$DW$786, DW_AT_type(*$C$DW$T$25)
    6372                      .dwattr $C$DW$786, DW_AT_name("ADCSOCFLG1")
    6373                      .dwattr $C$DW$786, DW_AT_TI_symbol_name("_ADCSOCFLG1")
    6374                      .dwattr $C$DW$786, DW_AT_data_member_location[DW_OP_plus_uconst 0x6618]
    6375                      .dwattr $C$DW$786, DW_AT_accessibility(DW_ACCESS_public)
    6376              $C$DW$787       .dwtag  DW_TAG_member
    6377                      .dwattr $C$DW$787, DW_AT_type(*$C$DW$T$25)
    6378                      .dwattr $C$DW$787, DW_AT_name("rsvd_7")
    6379                      .dwattr $C$DW$787, DW_AT_TI_symbol_name("_rsvd_7")
    6380                      .dwattr $C$DW$787, DW_AT_data_member_location[DW_OP_plus_uconst 0x6619]
    6381                      .dwattr $C$DW$787, DW_AT_accessibility(DW_ACCESS_public)
    6382              $C$DW$788       .dwtag  DW_TAG_member
    6383                      .dwattr $C$DW$788, DW_AT_type(*$C$DW$T$25)
    6384                      .dwattr $C$DW$788, DW_AT_name("ADCSOCFRC1")
    6385                      .dwattr $C$DW$788, DW_AT_TI_symbol_name("_ADCSOCFRC1")
TMS320C2000 Assembler PC v6.2.5 Mon Sep 11 15:13:22 2017

Tools Copyright (c) 1996-2014 Texas Instruments Incorporated
C:\Users\wmj\AppData\Local\Temp\1124010                              PAGE  126

    6386                      .dwattr $C$DW$788, DW_AT_data_member_location[DW_OP_plus_uconst 0x661a]
    6387                      .dwattr $C$DW$788, DW_AT_accessibility(DW_ACCESS_public)
    6388              $C$DW$789       .dwtag  DW_TAG_member
    6389                      .dwattr $C$DW$789, DW_AT_type(*$C$DW$T$25)
    6390                      .dwattr $C$DW$789, DW_AT_name("rsvd_8")
    6391                      .dwattr $C$DW$789, DW_AT_TI_symbol_name("_rsvd_8")
    6392                      .dwattr $C$DW$789, DW_AT_data_member_location[DW_OP_plus_uconst 0x661b]
    6393                      .dwattr $C$DW$789, DW_AT_accessibility(DW_ACCESS_public)
    6394              $C$DW$790       .dwtag  DW_TAG_member
    6395                      .dwattr $C$DW$790, DW_AT_type(*$C$DW$T$25)
    6396                      .dwattr $C$DW$790, DW_AT_name("ADCSOCOVF1")
    6397                      .dwattr $C$DW$790, DW_AT_TI_symbol_name("_ADCSOCOVF1")
    6398                      .dwattr $C$DW$790, DW_AT_data_member_location[DW_OP_plus_uconst 0x661c]
    6399                      .dwattr $C$DW$790, DW_AT_accessibility(DW_ACCESS_public)
    6400              $C$DW$791       .dwtag  DW_TAG_member
    6401                      .dwattr $C$DW$791, DW_AT_type(*$C$DW$T$25)
    6402                      .dwattr $C$DW$791, DW_AT_name("rsvd_9")
    6403                      .dwattr $C$DW$791, DW_AT_TI_symbol_name("_rsvd_9")
    6404                      .dwattr $C$DW$791, DW_AT_data_member_location[DW_OP_plus_uconst 0x661d]
    6405                      .dwattr $C$DW$791, DW_AT_accessibility(DW_ACCESS_public)
    6406              $C$DW$792       .dwtag  DW_TAG_member
    6407                      .dwattr $C$DW$792, DW_AT_type(*$C$DW$T$25)
    6408                      .dwattr $C$DW$792, DW_AT_name("ADCSOCOVFCLR1")
    6409                      .dwattr $C$DW$792, DW_AT_TI_symbol_name("_ADCSOCOVFCLR1")
    6410                      .dwattr $C$DW$792, DW_AT_data_member_location[DW_OP_plus_uconst 0x661e]
    6411                      .dwattr $C$DW$792, DW_AT_accessibility(DW_ACCESS_public)
    6412              $C$DW$793       .dwtag  DW_TAG_member
    6413                      .dwattr $C$DW$793, DW_AT_type(*$C$DW$T$25)
    6414                      .dwattr $C$DW$793, DW_AT_name("rsvd_10")
    6415                      .dwattr $C$DW$793, DW_AT_TI_symbol_name("_rsvd_10")
    6416                      .dwattr $C$DW$793, DW_AT_data_member_location[DW_OP_plus_uconst 0x661f]
    6417                      .dwattr $C$DW$793, DW_AT_accessibility(DW_ACCESS_public)
    6418              $C$DW$794       .dwtag  DW_TAG_member
    6419                      .dwattr $C$DW$794, DW_AT_type(*$C$DW$T$26)
    6420                      .dwattr $C$DW$794, DW_AT_name("ADCSOCxCTL")
    6421                      .dwattr $C$DW$794, DW_AT_TI_symbol_name("_ADCSOCxCTL")
    6422                      .dwattr $C$DW$794, DW_AT_data_member_location[DW_OP_plus_uconst 0x6620]
    6423                      .dwattr $C$DW$794, DW_AT_accessibility(DW_ACCESS_public)
    6424              $C$DW$795       .dwtag  DW_TAG_member
    6425                      .dwattr $C$DW$795, DW_AT_type(*$C$DW$T$26)
    6426                      .dwattr $C$DW$795, DW_AT_name("rsvd_11")
    6427                      .dwattr $C$DW$795, DW_AT_TI_symbol_name("_rsvd_11")
    6428                      .dwattr $C$DW$795, DW_AT_data_member_location[DW_OP_plus_uconst 0x6630]
    6429                      .dwattr $C$DW$795, DW_AT_accessibility(DW_ACCESS_public)
    6430              $C$DW$796       .dwtag  DW_TAG_member
    6431                      .dwattr $C$DW$796, DW_AT_type(*$C$DW$T$25)
    6432                      .dwattr $C$DW$796, DW_AT_name("ADCREFTRIM")
    6433                      .dwattr $C$DW$796, DW_AT_TI_symbol_name("_ADCREFTRIM")
    6434                      .dwattr $C$DW$796, DW_AT_data_member_location[DW_OP_plus_uconst 0x6640]
    6435                      .dwattr $C$DW$796, DW_AT_accessibility(DW_ACCESS_public)
    6436              $C$DW$797       .dwtag  DW_TAG_member
    6437                      .dwattr $C$DW$797, DW_AT_type(*$C$DW$T$25)
    6438                      .dwattr $C$DW$797, DW_AT_name("ADCOFFTRIM")
    6439                      .dwattr $C$DW$797, DW_AT_TI_symbol_name("_ADCOFFTRIM")
    6440                      .dwattr $C$DW$797, DW_AT_data_member_location[DW_OP_plus_uconst 0x6641]
TMS320C2000 Assembler PC v6.2.5 Mon Sep 11 15:13:22 2017

Tools Copyright (c) 1996-2014 Texas Instruments Incorporated
C:\Users\wmj\AppData\Local\Temp\1124010                              PAGE  127

    6441                      .dwattr $C$DW$797, DW_AT_accessibility(DW_ACCESS_public)
    6442              $C$DW$798       .dwtag  DW_TAG_member
    6443                      .dwattr $C$DW$798, DW_AT_type(*$C$DW$T$31)
    6444                      .dwattr $C$DW$798, DW_AT_name("resvd_12")
    6445                      .dwattr $C$DW$798, DW_AT_TI_symbol_name("_resvd_12")
    6446                      .dwattr $C$DW$798, DW_AT_data_member_location[DW_OP_plus_uconst 0x6642]
    6447                      .dwattr $C$DW$798, DW_AT_accessibility(DW_ACCESS_public)
    6448              $C$DW$799       .dwtag  DW_TAG_member
    6449                      .dwattr $C$DW$799, DW_AT_type(*$C$DW$T$25)
    6450                      .dwattr $C$DW$799, DW_AT_name("ADCREV")
    6451                      .dwattr $C$DW$799, DW_AT_TI_symbol_name("_ADCREV")
    6452                      .dwattr $C$DW$799, DW_AT_data_member_location[DW_OP_plus_uconst 0x664f]
    6453                      .dwattr $C$DW$799, DW_AT_accessibility(DW_ACCESS_public)
    6454                      .dwendtag $C$DW$T$32
    6455              
    6456              $C$DW$T$316     .dwtag  DW_TAG_typedef, DW_AT_name("ADC_Obj")
    6457                      .dwattr $C$DW$T$316, DW_AT_type(*$C$DW$T$32)
    6458                      .dwattr $C$DW$T$316, DW_AT_language(DW_LANG_C)
    6459              $C$DW$T$100     .dwtag  DW_TAG_pointer_type
    6460                      .dwattr $C$DW$T$100, DW_AT_type(*$C$DW$T$32)
    6461                      .dwattr $C$DW$T$100, DW_AT_address_class(0x16)
    6462              $C$DW$T$101     .dwtag  DW_TAG_typedef, DW_AT_name("ADC_Handle")
    6463                      .dwattr $C$DW$T$101, DW_AT_type(*$C$DW$T$100)
    6464                      .dwattr $C$DW$T$101, DW_AT_language(DW_LANG_C)
    6465              
    6466              $C$DW$T$35      .dwtag  DW_TAG_structure_type
    6467                      .dwattr $C$DW$T$35, DW_AT_name("_CLARKE_Obj_")
    6468                      .dwattr $C$DW$T$35, DW_AT_byte_size(0x06)
    6469              $C$DW$800       .dwtag  DW_TAG_member
    6470                      .dwattr $C$DW$800, DW_AT_type(*$C$DW$T$33)
    6471                      .dwattr $C$DW$800, DW_AT_name("alpha_sf")
    6472                      .dwattr $C$DW$800, DW_AT_TI_symbol_name("_alpha_sf")
    6473                      .dwattr $C$DW$800, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    6474                      .dwattr $C$DW$800, DW_AT_accessibility(DW_ACCESS_public)
    6475              $C$DW$801       .dwtag  DW_TAG_member
    6476                      .dwattr $C$DW$801, DW_AT_type(*$C$DW$T$33)
    6477                      .dwattr $C$DW$801, DW_AT_name("beta_sf")
    6478                      .dwattr $C$DW$801, DW_AT_TI_symbol_name("_beta_sf")
    6479                      .dwattr $C$DW$801, DW_AT_data_member_location[DW_OP_plus_uconst 0x2]
    6480                      .dwattr $C$DW$801, DW_AT_accessibility(DW_ACCESS_public)
    6481              $C$DW$802       .dwtag  DW_TAG_member
    6482                      .dwattr $C$DW$802, DW_AT_type(*$C$DW$T$34)
    6483                      .dwattr $C$DW$802, DW_AT_name("numSensors")
    6484                      .dwattr $C$DW$802, DW_AT_TI_symbol_name("_numSensors")
    6485                      .dwattr $C$DW$802, DW_AT_data_member_location[DW_OP_plus_uconst 0x4]
    6486                      .dwattr $C$DW$802, DW_AT_accessibility(DW_ACCESS_public)
    6487                      .dwendtag $C$DW$T$35
    6488              
    6489              $C$DW$T$50      .dwtag  DW_TAG_typedef, DW_AT_name("CLARKE_Obj")
    6490                      .dwattr $C$DW$T$50, DW_AT_type(*$C$DW$T$35)
    6491                      .dwattr $C$DW$T$50, DW_AT_language(DW_LANG_C)
    6492              $C$DW$T$48      .dwtag  DW_TAG_pointer_type
    6493                      .dwattr $C$DW$T$48, DW_AT_type(*$C$DW$T$35)
    6494                      .dwattr $C$DW$T$48, DW_AT_address_class(0x16)
    6495              $C$DW$T$49      .dwtag  DW_TAG_typedef, DW_AT_name("CLARKE_Handle")
TMS320C2000 Assembler PC v6.2.5 Mon Sep 11 15:13:22 2017

Tools Copyright (c) 1996-2014 Texas Instruments Incorporated
C:\Users\wmj\AppData\Local\Temp\1124010                              PAGE  128

    6496                      .dwattr $C$DW$T$49, DW_AT_type(*$C$DW$T$48)
    6497                      .dwattr $C$DW$T$49, DW_AT_language(DW_LANG_C)
    6498              
    6499              $C$DW$T$36      .dwtag  DW_TAG_structure_type
    6500                      .dwattr $C$DW$T$36, DW_AT_name("_CLK_DIV_t_")
    6501                      .dwattr $C$DW$T$36, DW_AT_byte_size(0x02)
    6502              $C$DW$803       .dwtag  DW_TAG_member
    6503                      .dwattr $C$DW$803, DW_AT_type(*$C$DW$T$24)
    6504                      .dwattr $C$DW$803, DW_AT_name("FREF_DIVIDER")
    6505                      .dwattr $C$DW$803, DW_AT_TI_symbol_name("_FREF_DIVIDER")
    6506                      .dwattr $C$DW$803, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    6507                      .dwattr $C$DW$803, DW_AT_accessibility(DW_ACCESS_public)
    6508              $C$DW$804       .dwtag  DW_TAG_member
    6509                      .dwattr $C$DW$804, DW_AT_type(*$C$DW$T$24)
    6510                      .dwattr $C$DW$804, DW_AT_name("FIN_DIVIDER")
    6511                      .dwattr $C$DW$804, DW_AT_TI_symbol_name("_FIN_DIVIDER")
    6512                      .dwattr $C$DW$804, DW_AT_data_member_location[DW_OP_plus_uconst 0x1]
    6513                      .dwattr $C$DW$804, DW_AT_accessibility(DW_ACCESS_public)
    6514                      .dwendtag $C$DW$T$36
    6515              
    6516              $C$DW$T$138     .dwtag  DW_TAG_typedef, DW_AT_name("CLK_DIV_t_")
    6517                      .dwattr $C$DW$T$138, DW_AT_type(*$C$DW$T$36)
    6518                      .dwattr $C$DW$T$138, DW_AT_language(DW_LANG_C)
    6519              
    6520              $C$DW$T$38      .dwtag  DW_TAG_structure_type
    6521                      .dwattr $C$DW$T$38, DW_AT_name("_CLK_Obj_")
    6522                      .dwattr $C$DW$T$38, DW_AT_byte_size(0x11)
    6523              $C$DW$805       .dwtag  DW_TAG_member
    6524                      .dwattr $C$DW$805, DW_AT_type(*$C$DW$T$25)
    6525                      .dwattr $C$DW$805, DW_AT_name("XCLK")
    6526                      .dwattr $C$DW$805, DW_AT_TI_symbol_name("_XCLK")
    6527                      .dwattr $C$DW$805, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    6528                      .dwattr $C$DW$805, DW_AT_accessibility(DW_ACCESS_public)
    6529              $C$DW$806       .dwtag  DW_TAG_member
    6530                      .dwattr $C$DW$806, DW_AT_type(*$C$DW$T$25)
    6531                      .dwattr $C$DW$806, DW_AT_name("rsvd_1")
    6532                      .dwattr $C$DW$806, DW_AT_TI_symbol_name("_rsvd_1")
    6533                      .dwattr $C$DW$806, DW_AT_data_member_location[DW_OP_plus_uconst 0x1]
    6534                      .dwattr $C$DW$806, DW_AT_accessibility(DW_ACCESS_public)
    6535              $C$DW$807       .dwtag  DW_TAG_member
    6536                      .dwattr $C$DW$807, DW_AT_type(*$C$DW$T$25)
    6537                      .dwattr $C$DW$807, DW_AT_name("CLKCTL")
    6538                      .dwattr $C$DW$807, DW_AT_TI_symbol_name("_CLKCTL")
    6539                      .dwattr $C$DW$807, DW_AT_data_member_location[DW_OP_plus_uconst 0x2]
    6540                      .dwattr $C$DW$807, DW_AT_accessibility(DW_ACCESS_public)
    6541              $C$DW$808       .dwtag  DW_TAG_member
    6542                      .dwattr $C$DW$808, DW_AT_type(*$C$DW$T$37)
    6543                      .dwattr $C$DW$808, DW_AT_name("rsvd_2")
    6544                      .dwattr $C$DW$808, DW_AT_TI_symbol_name("_rsvd_2")
    6545                      .dwattr $C$DW$808, DW_AT_data_member_location[DW_OP_plus_uconst 0x3]
    6546                      .dwattr $C$DW$808, DW_AT_accessibility(DW_ACCESS_public)
    6547              $C$DW$809       .dwtag  DW_TAG_member
    6548                      .dwattr $C$DW$809, DW_AT_type(*$C$DW$T$25)
    6549                      .dwattr $C$DW$809, DW_AT_name("LOSPCP")
    6550                      .dwattr $C$DW$809, DW_AT_TI_symbol_name("_LOSPCP")
TMS320C2000 Assembler PC v6.2.5 Mon Sep 11 15:13:22 2017

Tools Copyright (c) 1996-2014 Texas Instruments Incorporated
C:\Users\wmj\AppData\Local\Temp\1124010                              PAGE  129

    6551                      .dwattr $C$DW$809, DW_AT_data_member_location[DW_OP_plus_uconst 0xb]
    6552                      .dwattr $C$DW$809, DW_AT_accessibility(DW_ACCESS_public)
    6553              $C$DW$810       .dwtag  DW_TAG_member
    6554                      .dwattr $C$DW$810, DW_AT_type(*$C$DW$T$25)
    6555                      .dwattr $C$DW$810, DW_AT_name("PCLKCR0")
    6556                      .dwattr $C$DW$810, DW_AT_TI_symbol_name("_PCLKCR0")
    6557                      .dwattr $C$DW$810, DW_AT_data_member_location[DW_OP_plus_uconst 0xc]
    6558                      .dwattr $C$DW$810, DW_AT_accessibility(DW_ACCESS_public)
    6559              $C$DW$811       .dwtag  DW_TAG_member
    6560                      .dwattr $C$DW$811, DW_AT_type(*$C$DW$T$25)
    6561                      .dwattr $C$DW$811, DW_AT_name("PCLKCR1")
    6562                      .dwattr $C$DW$811, DW_AT_TI_symbol_name("_PCLKCR1")
    6563                      .dwattr $C$DW$811, DW_AT_data_member_location[DW_OP_plus_uconst 0xd]
    6564                      .dwattr $C$DW$811, DW_AT_accessibility(DW_ACCESS_public)
    6565              $C$DW$812       .dwtag  DW_TAG_member
    6566                      .dwattr $C$DW$812, DW_AT_type(*$C$DW$T$28)
    6567                      .dwattr $C$DW$812, DW_AT_name("rsvd_3")
    6568                      .dwattr $C$DW$812, DW_AT_TI_symbol_name("_rsvd_3")
    6569                      .dwattr $C$DW$812, DW_AT_data_member_location[DW_OP_plus_uconst 0xe]
    6570                      .dwattr $C$DW$812, DW_AT_accessibility(DW_ACCESS_public)
    6571              $C$DW$813       .dwtag  DW_TAG_member
    6572                      .dwattr $C$DW$813, DW_AT_type(*$C$DW$T$25)
    6573                      .dwattr $C$DW$813, DW_AT_name("PCLKCR3")
    6574                      .dwattr $C$DW$813, DW_AT_TI_symbol_name("_PCLKCR3")
    6575                      .dwattr $C$DW$813, DW_AT_data_member_location[DW_OP_plus_uconst 0x10]
    6576                      .dwattr $C$DW$813, DW_AT_accessibility(DW_ACCESS_public)
    6577                      .dwendtag $C$DW$T$38
    6578              
    6579              $C$DW$T$102     .dwtag  DW_TAG_pointer_type
    6580                      .dwattr $C$DW$T$102, DW_AT_type(*$C$DW$T$38)
    6581                      .dwattr $C$DW$T$102, DW_AT_address_class(0x16)
    6582              $C$DW$T$103     .dwtag  DW_TAG_typedef, DW_AT_name("CLK_Handle")
    6583                      .dwattr $C$DW$T$103, DW_AT_type(*$C$DW$T$102)
    6584                      .dwattr $C$DW$T$103, DW_AT_language(DW_LANG_C)
    6585              
    6586              $C$DW$T$39      .dwtag  DW_TAG_structure_type
    6587                      .dwattr $C$DW$T$39, DW_AT_name("_CPU_Obj_")
    6588                      .dwattr $C$DW$T$39, DW_AT_byte_size(0x01)
    6589              $C$DW$814       .dwtag  DW_TAG_member
    6590                      .dwattr $C$DW$814, DW_AT_type(*$C$DW$T$34)
    6591                      .dwattr $C$DW$814, DW_AT_name("tmp")
    6592                      .dwattr $C$DW$814, DW_AT_TI_symbol_name("_tmp")
    6593                      .dwattr $C$DW$814, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    6594                      .dwattr $C$DW$814, DW_AT_accessibility(DW_ACCESS_public)
    6595                      .dwendtag $C$DW$T$39
    6596              
    6597              $C$DW$T$104     .dwtag  DW_TAG_pointer_type
    6598                      .dwattr $C$DW$T$104, DW_AT_type(*$C$DW$T$39)
    6599                      .dwattr $C$DW$T$104, DW_AT_address_class(0x16)
    6600              $C$DW$T$105     .dwtag  DW_TAG_typedef, DW_AT_name("CPU_Handle")
    6601                      .dwattr $C$DW$T$105, DW_AT_type(*$C$DW$T$104)
    6602                      .dwattr $C$DW$T$105, DW_AT_language(DW_LANG_C)
    6603              
    6604              $C$DW$T$42      .dwtag  DW_TAG_structure_type
    6605                      .dwattr $C$DW$T$42, DW_AT_name("_CPU_TIME_Obj_")
TMS320C2000 Assembler PC v6.2.5 Mon Sep 11 15:13:22 2017

Tools Copyright (c) 1996-2014 Texas Instruments Incorporated
C:\Users\wmj\AppData\Local\Temp\1124010                              PAGE  130

    6606                      .dwattr $C$DW$T$42, DW_AT_byte_size(0x18)
    6607              $C$DW$815       .dwtag  DW_TAG_member
    6608                      .dwattr $C$DW$815, DW_AT_type(*$C$DW$T$24)
    6609                      .dwattr $C$DW$815, DW_AT_name("pwm_period")
    6610                      .dwattr $C$DW$815, DW_AT_TI_symbol_name("_pwm_period")
    6611                      .dwattr $C$DW$815, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    6612                      .dwattr $C$DW$815, DW_AT_accessibility(DW_ACCESS_public)
    6613              $C$DW$816       .dwtag  DW_TAG_member
    6614                      .dwattr $C$DW$816, DW_AT_type(*$C$DW$T$40)
    6615                      .dwattr $C$DW$816, DW_AT_name("timer_cnt_now")
    6616                      .dwattr $C$DW$816, DW_AT_TI_symbol_name("_timer_cnt_now")
    6617                      .dwattr $C$DW$816, DW_AT_data_member_location[DW_OP_plus_uconst 0x2]
    6618                      .dwattr $C$DW$816, DW_AT_accessibility(DW_ACCESS_public)
    6619              $C$DW$817       .dwtag  DW_TAG_member
    6620                      .dwattr $C$DW$817, DW_AT_type(*$C$DW$T$40)
    6621                      .dwattr $C$DW$817, DW_AT_name("timer_cnt_prev")
    6622                      .dwattr $C$DW$817, DW_AT_TI_symbol_name("_timer_cnt_prev")
    6623                      .dwattr $C$DW$817, DW_AT_data_member_location[DW_OP_plus_uconst 0x4]
    6624                      .dwattr $C$DW$817, DW_AT_accessibility(DW_ACCESS_public)
    6625              $C$DW$818       .dwtag  DW_TAG_member
    6626                      .dwattr $C$DW$818, DW_AT_type(*$C$DW$T$40)
    6627                      .dwattr $C$DW$818, DW_AT_name("timer_delta_now")
    6628                      .dwattr $C$DW$818, DW_AT_TI_symbol_name("_timer_delta_now")
    6629                      .dwattr $C$DW$818, DW_AT_data_member_location[DW_OP_plus_uconst 0x6]
    6630                      .dwattr $C$DW$818, DW_AT_accessibility(DW_ACCESS_public)
    6631              $C$DW$819       .dwtag  DW_TAG_member
    6632                      .dwattr $C$DW$819, DW_AT_type(*$C$DW$T$40)
    6633                      .dwattr $C$DW$819, DW_AT_name("timer_delta_prev")
    6634                      .dwattr $C$DW$819, DW_AT_TI_symbol_name("_timer_delta_prev")
    6635                      .dwattr $C$DW$819, DW_AT_data_member_location[DW_OP_plus_uconst 0x8]
    6636                      .dwattr $C$DW$819, DW_AT_accessibility(DW_ACCESS_public)
    6637              $C$DW$820       .dwtag  DW_TAG_member
    6638                      .dwattr $C$DW$820, DW_AT_type(*$C$DW$T$40)
    6639                      .dwattr $C$DW$820, DW_AT_name("timer_delta_min")
    6640                      .dwattr $C$DW$820, DW_AT_TI_symbol_name("_timer_delta_min")
    6641                      .dwattr $C$DW$820, DW_AT_data_member_location[DW_OP_plus_uconst 0xa]
    6642                      .dwattr $C$DW$820, DW_AT_accessibility(DW_ACCESS_public)
    6643              $C$DW$821       .dwtag  DW_TAG_member
    6644                      .dwattr $C$DW$821, DW_AT_type(*$C$DW$T$40)
    6645                      .dwattr $C$DW$821, DW_AT_name("timer_delta_max")
    6646                      .dwattr $C$DW$821, DW_AT_TI_symbol_name("_timer_delta_max")
    6647                      .dwattr $C$DW$821, DW_AT_data_member_location[DW_OP_plus_uconst 0xc]
    6648                      .dwattr $C$DW$821, DW_AT_accessibility(DW_ACCESS_public)
    6649              $C$DW$822       .dwtag  DW_TAG_member
    6650                      .dwattr $C$DW$822, DW_AT_type(*$C$DW$T$40)
    6651                      .dwattr $C$DW$822, DW_AT_name("timer_delta_avg")
    6652                      .dwattr $C$DW$822, DW_AT_TI_symbol_name("_timer_delta_avg")
    6653                      .dwattr $C$DW$822, DW_AT_data_member_location[DW_OP_plus_uconst 0xe]
    6654                      .dwattr $C$DW$822, DW_AT_accessibility(DW_ACCESS_public)
    6655              $C$DW$823       .dwtag  DW_TAG_member
    6656                      .dwattr $C$DW$823, DW_AT_type(*$C$DW$T$40)
    6657                      .dwattr $C$DW$823, DW_AT_name("timer_band_max")
    6658                      .dwattr $C$DW$823, DW_AT_TI_symbol_name("_timer_band_max")
    6659                      .dwattr $C$DW$823, DW_AT_data_member_location[DW_OP_plus_uconst 0x10]
    6660                      .dwattr $C$DW$823, DW_AT_accessibility(DW_ACCESS_public)
TMS320C2000 Assembler PC v6.2.5 Mon Sep 11 15:13:22 2017

Tools Copyright (c) 1996-2014 Texas Instruments Incorporated
C:\Users\wmj\AppData\Local\Temp\1124010                              PAGE  131

    6661              $C$DW$824       .dwtag  DW_TAG_member
    6662                      .dwattr $C$DW$824, DW_AT_type(*$C$DW$T$40)
    6663                      .dwattr $C$DW$824, DW_AT_name("timer_delta_CntAcc")
    6664                      .dwattr $C$DW$824, DW_AT_TI_symbol_name("_timer_delta_CntAcc")
    6665                      .dwattr $C$DW$824, DW_AT_data_member_location[DW_OP_plus_uconst 0x12]
    6666                      .dwattr $C$DW$824, DW_AT_accessibility(DW_ACCESS_public)
    6667              $C$DW$825       .dwtag  DW_TAG_member
    6668                      .dwattr $C$DW$825, DW_AT_type(*$C$DW$T$40)
    6669                      .dwattr $C$DW$825, DW_AT_name("timer_delta_AccNum")
    6670                      .dwattr $C$DW$825, DW_AT_TI_symbol_name("_timer_delta_AccNum")
    6671                      .dwattr $C$DW$825, DW_AT_data_member_location[DW_OP_plus_uconst 0x14]
    6672                      .dwattr $C$DW$825, DW_AT_accessibility(DW_ACCESS_public)
    6673              $C$DW$826       .dwtag  DW_TAG_member
    6674                      .dwattr $C$DW$826, DW_AT_type(*$C$DW$T$41)
    6675                      .dwattr $C$DW$826, DW_AT_name("flag_resetStatus")
    6676                      .dwattr $C$DW$826, DW_AT_TI_symbol_name("_flag_resetStatus")
    6677                      .dwattr $C$DW$826, DW_AT_data_member_location[DW_OP_plus_uconst 0x16]
    6678                      .dwattr $C$DW$826, DW_AT_accessibility(DW_ACCESS_public)
    6679                      .dwendtag $C$DW$T$42
    6680              
    6681              $C$DW$T$317     .dwtag  DW_TAG_typedef, DW_AT_name("CPU_TIME_Obj")
    6682                      .dwattr $C$DW$T$317, DW_AT_type(*$C$DW$T$42)
    6683                      .dwattr $C$DW$T$317, DW_AT_language(DW_LANG_C)
    6684              $C$DW$T$318     .dwtag  DW_TAG_pointer_type
    6685                      .dwattr $C$DW$T$318, DW_AT_type(*$C$DW$T$317)
    6686                      .dwattr $C$DW$T$318, DW_AT_address_class(0x16)
    6687              $C$DW$T$319     .dwtag  DW_TAG_pointer_type
    6688                      .dwattr $C$DW$T$319, DW_AT_type(*$C$DW$T$42)
    6689                      .dwattr $C$DW$T$319, DW_AT_address_class(0x16)
    6690              $C$DW$T$320     .dwtag  DW_TAG_typedef, DW_AT_name("CPU_TIME_Handle")
    6691                      .dwattr $C$DW$T$320, DW_AT_type(*$C$DW$T$319)
    6692                      .dwattr $C$DW$T$320, DW_AT_language(DW_LANG_C)
    6693              
    6694              $C$DW$T$74      .dwtag  DW_TAG_structure_type
    6695                      .dwattr $C$DW$T$74, DW_AT_name("_CTRL_Obj_")
    6696                      .dwattr $C$DW$T$74, DW_AT_byte_size(0x108)
    6697              $C$DW$827       .dwtag  DW_TAG_member
    6698                      .dwattr $C$DW$827, DW_AT_type(*$C$DW$T$43)
    6699                      .dwattr $C$DW$827, DW_AT_name("version")
    6700                      .dwattr $C$DW$827, DW_AT_TI_symbol_name("_version")
    6701                      .dwattr $C$DW$827, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    6702                      .dwattr $C$DW$827, DW_AT_accessibility(DW_ACCESS_public)
    6703              $C$DW$828       .dwtag  DW_TAG_member
    6704                      .dwattr $C$DW$828, DW_AT_type(*$C$DW$T$45)
    6705                      .dwattr $C$DW$828, DW_AT_name("state")
    6706                      .dwattr $C$DW$828, DW_AT_TI_symbol_name("_state")
    6707                      .dwattr $C$DW$828, DW_AT_data_member_location[DW_OP_plus_uconst 0x4]
    6708                      .dwattr $C$DW$828, DW_AT_accessibility(DW_ACCESS_public)
    6709              $C$DW$829       .dwtag  DW_TAG_member
    6710                      .dwattr $C$DW$829, DW_AT_type(*$C$DW$T$45)
    6711                      .dwattr $C$DW$829, DW_AT_name("prevState")
    6712                      .dwattr $C$DW$829, DW_AT_TI_symbol_name("_prevState")
    6713                      .dwattr $C$DW$829, DW_AT_data_member_location[DW_OP_plus_uconst 0x5]
    6714                      .dwattr $C$DW$829, DW_AT_accessibility(DW_ACCESS_public)
    6715              $C$DW$830       .dwtag  DW_TAG_member
TMS320C2000 Assembler PC v6.2.5 Mon Sep 11 15:13:22 2017

Tools Copyright (c) 1996-2014 Texas Instruments Incorporated
C:\Users\wmj\AppData\Local\Temp\1124010                              PAGE  132

    6716                      .dwattr $C$DW$830, DW_AT_type(*$C$DW$T$47)
    6717                      .dwattr $C$DW$830, DW_AT_name("errorCode")
    6718                      .dwattr $C$DW$830, DW_AT_TI_symbol_name("_errorCode")
    6719                      .dwattr $C$DW$830, DW_AT_data_member_location[DW_OP_plus_uconst 0x6]
    6720                      .dwattr $C$DW$830, DW_AT_accessibility(DW_ACCESS_public)
    6721              $C$DW$831       .dwtag  DW_TAG_member
    6722                      .dwattr $C$DW$831, DW_AT_type(*$C$DW$T$49)
    6723                      .dwattr $C$DW$831, DW_AT_name("clarkeHandle_I")
    6724                      .dwattr $C$DW$831, DW_AT_TI_symbol_name("_clarkeHandle_I")
    6725                      .dwattr $C$DW$831, DW_AT_data_member_location[DW_OP_plus_uconst 0x8]
    6726                      .dwattr $C$DW$831, DW_AT_accessibility(DW_ACCESS_public)
    6727              $C$DW$832       .dwtag  DW_TAG_member
    6728                      .dwattr $C$DW$832, DW_AT_type(*$C$DW$T$50)
    6729                      .dwattr $C$DW$832, DW_AT_name("clarke_I")
    6730                      .dwattr $C$DW$832, DW_AT_TI_symbol_name("_clarke_I")
    6731                      .dwattr $C$DW$832, DW_AT_data_member_location[DW_OP_plus_uconst 0xa]
    6732                      .dwattr $C$DW$832, DW_AT_accessibility(DW_ACCESS_public)
    6733              $C$DW$833       .dwtag  DW_TAG_member
    6734                      .dwattr $C$DW$833, DW_AT_type(*$C$DW$T$49)
    6735                      .dwattr $C$DW$833, DW_AT_name("clarkeHandle_V")
    6736                      .dwattr $C$DW$833, DW_AT_TI_symbol_name("_clarkeHandle_V")
    6737                      .dwattr $C$DW$833, DW_AT_data_member_location[DW_OP_plus_uconst 0x10]
    6738                      .dwattr $C$DW$833, DW_AT_accessibility(DW_ACCESS_public)
    6739              $C$DW$834       .dwtag  DW_TAG_member
    6740                      .dwattr $C$DW$834, DW_AT_type(*$C$DW$T$50)
    6741                      .dwattr $C$DW$834, DW_AT_name("clarke_V")
    6742                      .dwattr $C$DW$834, DW_AT_TI_symbol_name("_clarke_V")
    6743                      .dwattr $C$DW$834, DW_AT_data_member_location[DW_OP_plus_uconst 0x12]
    6744                      .dwattr $C$DW$834, DW_AT_accessibility(DW_ACCESS_public)
    6745              $C$DW$835       .dwtag  DW_TAG_member
    6746                      .dwattr $C$DW$835, DW_AT_type(*$C$DW$T$52)
    6747                      .dwattr $C$DW$835, DW_AT_name("estHandle")
    6748                      .dwattr $C$DW$835, DW_AT_TI_symbol_name("_estHandle")
    6749                      .dwattr $C$DW$835, DW_AT_data_member_location[DW_OP_plus_uconst 0x18]
    6750                      .dwattr $C$DW$835, DW_AT_accessibility(DW_ACCESS_public)
    6751              $C$DW$836       .dwtag  DW_TAG_member
    6752                      .dwattr $C$DW$836, DW_AT_type(*$C$DW$T$54)
    6753                      .dwattr $C$DW$836, DW_AT_name("parkHandle")
    6754                      .dwattr $C$DW$836, DW_AT_TI_symbol_name("_parkHandle")
    6755                      .dwattr $C$DW$836, DW_AT_data_member_location[DW_OP_plus_uconst 0x1a]
    6756                      .dwattr $C$DW$836, DW_AT_accessibility(DW_ACCESS_public)
    6757              $C$DW$837       .dwtag  DW_TAG_member
    6758                      .dwattr $C$DW$837, DW_AT_type(*$C$DW$T$55)
    6759                      .dwattr $C$DW$837, DW_AT_name("park")
    6760                      .dwattr $C$DW$837, DW_AT_TI_symbol_name("_park")
    6761                      .dwattr $C$DW$837, DW_AT_data_member_location[DW_OP_plus_uconst 0x1c]
    6762                      .dwattr $C$DW$837, DW_AT_accessibility(DW_ACCESS_public)
    6763              $C$DW$838       .dwtag  DW_TAG_member
    6764                      .dwattr $C$DW$838, DW_AT_type(*$C$DW$T$57)
    6765                      .dwattr $C$DW$838, DW_AT_name("pidHandle_Id")
    6766                      .dwattr $C$DW$838, DW_AT_TI_symbol_name("_pidHandle_Id")
    6767                      .dwattr $C$DW$838, DW_AT_data_member_location[DW_OP_plus_uconst 0x20]
    6768                      .dwattr $C$DW$838, DW_AT_accessibility(DW_ACCESS_public)
    6769              $C$DW$839       .dwtag  DW_TAG_member
    6770                      .dwattr $C$DW$839, DW_AT_type(*$C$DW$T$58)
TMS320C2000 Assembler PC v6.2.5 Mon Sep 11 15:13:22 2017

Tools Copyright (c) 1996-2014 Texas Instruments Incorporated
C:\Users\wmj\AppData\Local\Temp\1124010                              PAGE  133

    6771                      .dwattr $C$DW$839, DW_AT_name("pid_Id")
    6772                      .dwattr $C$DW$839, DW_AT_TI_symbol_name("_pid_Id")
    6773                      .dwattr $C$DW$839, DW_AT_data_member_location[DW_OP_plus_uconst 0x22]
    6774                      .dwattr $C$DW$839, DW_AT_accessibility(DW_ACCESS_public)
    6775              $C$DW$840       .dwtag  DW_TAG_member
    6776                      .dwattr $C$DW$840, DW_AT_type(*$C$DW$T$57)
    6777                      .dwattr $C$DW$840, DW_AT_name("pidHandle_Iq")
    6778                      .dwattr $C$DW$840, DW_AT_TI_symbol_name("_pidHandle_Iq")
    6779                      .dwattr $C$DW$840, DW_AT_data_member_location[DW_OP_plus_uconst 0x32]
    6780                      .dwattr $C$DW$840, DW_AT_accessibility(DW_ACCESS_public)
    6781              $C$DW$841       .dwtag  DW_TAG_member
    6782                      .dwattr $C$DW$841, DW_AT_type(*$C$DW$T$58)
    6783                      .dwattr $C$DW$841, DW_AT_name("pid_Iq")
    6784                      .dwattr $C$DW$841, DW_AT_TI_symbol_name("_pid_Iq")
    6785                      .dwattr $C$DW$841, DW_AT_data_member_location[DW_OP_plus_uconst 0x34]
    6786                      .dwattr $C$DW$841, DW_AT_accessibility(DW_ACCESS_public)
    6787              $C$DW$842       .dwtag  DW_TAG_member
    6788                      .dwattr $C$DW$842, DW_AT_type(*$C$DW$T$57)
    6789                      .dwattr $C$DW$842, DW_AT_name("pidHandle_spd")
    6790                      .dwattr $C$DW$842, DW_AT_TI_symbol_name("_pidHandle_spd")
    6791                      .dwattr $C$DW$842, DW_AT_data_member_location[DW_OP_plus_uconst 0x44]
    6792                      .dwattr $C$DW$842, DW_AT_accessibility(DW_ACCESS_public)
    6793              $C$DW$843       .dwtag  DW_TAG_member
    6794                      .dwattr $C$DW$843, DW_AT_type(*$C$DW$T$58)
    6795                      .dwattr $C$DW$843, DW_AT_name("pid_spd")
    6796                      .dwattr $C$DW$843, DW_AT_TI_symbol_name("_pid_spd")
    6797                      .dwattr $C$DW$843, DW_AT_data_member_location[DW_OP_plus_uconst 0x46]
    6798                      .dwattr $C$DW$843, DW_AT_accessibility(DW_ACCESS_public)
    6799              $C$DW$844       .dwtag  DW_TAG_member
    6800                      .dwattr $C$DW$844, DW_AT_type(*$C$DW$T$60)
    6801                      .dwattr $C$DW$844, DW_AT_name("iparkHandle")
    6802                      .dwattr $C$DW$844, DW_AT_TI_symbol_name("_iparkHandle")
    6803                      .dwattr $C$DW$844, DW_AT_data_member_location[DW_OP_plus_uconst 0x56]
    6804                      .dwattr $C$DW$844, DW_AT_accessibility(DW_ACCESS_public)
    6805              $C$DW$845       .dwtag  DW_TAG_member
    6806                      .dwattr $C$DW$845, DW_AT_type(*$C$DW$T$61)
    6807                      .dwattr $C$DW$845, DW_AT_name("ipark")
    6808                      .dwattr $C$DW$845, DW_AT_TI_symbol_name("_ipark")
    6809                      .dwattr $C$DW$845, DW_AT_data_member_location[DW_OP_plus_uconst 0x58]
    6810                      .dwattr $C$DW$845, DW_AT_accessibility(DW_ACCESS_public)
    6811              $C$DW$846       .dwtag  DW_TAG_member
    6812                      .dwattr $C$DW$846, DW_AT_type(*$C$DW$T$63)
    6813                      .dwattr $C$DW$846, DW_AT_name("svgenHandle")
    6814                      .dwattr $C$DW$846, DW_AT_TI_symbol_name("_svgenHandle")
    6815                      .dwattr $C$DW$846, DW_AT_data_member_location[DW_OP_plus_uconst 0x5c]
    6816                      .dwattr $C$DW$846, DW_AT_accessibility(DW_ACCESS_public)
    6817              $C$DW$847       .dwtag  DW_TAG_member
    6818                      .dwattr $C$DW$847, DW_AT_type(*$C$DW$T$64)
    6819                      .dwattr $C$DW$847, DW_AT_name("svgen")
    6820                      .dwattr $C$DW$847, DW_AT_TI_symbol_name("_svgen")
    6821                      .dwattr $C$DW$847, DW_AT_data_member_location[DW_OP_plus_uconst 0x5e]
    6822                      .dwattr $C$DW$847, DW_AT_accessibility(DW_ACCESS_public)
    6823              $C$DW$848       .dwtag  DW_TAG_member
    6824                      .dwattr $C$DW$848, DW_AT_type(*$C$DW$T$66)
    6825                      .dwattr $C$DW$848, DW_AT_name("trajHandle_Id")
TMS320C2000 Assembler PC v6.2.5 Mon Sep 11 15:13:22 2017

Tools Copyright (c) 1996-2014 Texas Instruments Incorporated
C:\Users\wmj\AppData\Local\Temp\1124010                              PAGE  134

    6826                      .dwattr $C$DW$848, DW_AT_TI_symbol_name("_trajHandle_Id")
    6827                      .dwattr $C$DW$848, DW_AT_data_member_location[DW_OP_plus_uconst 0x60]
    6828                      .dwattr $C$DW$848, DW_AT_accessibility(DW_ACCESS_public)
    6829              $C$DW$849       .dwtag  DW_TAG_member
    6830                      .dwattr $C$DW$849, DW_AT_type(*$C$DW$T$67)
    6831                      .dwattr $C$DW$849, DW_AT_name("traj_Id")
    6832                      .dwattr $C$DW$849, DW_AT_TI_symbol_name("_traj_Id")
    6833                      .dwattr $C$DW$849, DW_AT_data_member_location[DW_OP_plus_uconst 0x62]
    6834                      .dwattr $C$DW$849, DW_AT_accessibility(DW_ACCESS_public)
    6835              $C$DW$850       .dwtag  DW_TAG_member
    6836                      .dwattr $C$DW$850, DW_AT_type(*$C$DW$T$66)
    6837                      .dwattr $C$DW$850, DW_AT_name("trajHandle_spd")
    6838                      .dwattr $C$DW$850, DW_AT_TI_symbol_name("_trajHandle_spd")
    6839                      .dwattr $C$DW$850, DW_AT_data_member_location[DW_OP_plus_uconst 0x6c]
    6840                      .dwattr $C$DW$850, DW_AT_accessibility(DW_ACCESS_public)
    6841              $C$DW$851       .dwtag  DW_TAG_member
    6842                      .dwattr $C$DW$851, DW_AT_type(*$C$DW$T$67)
    6843                      .dwattr $C$DW$851, DW_AT_name("traj_spd")
    6844                      .dwattr $C$DW$851, DW_AT_TI_symbol_name("_traj_spd")
    6845                      .dwattr $C$DW$851, DW_AT_data_member_location[DW_OP_plus_uconst 0x6e]
    6846                      .dwattr $C$DW$851, DW_AT_accessibility(DW_ACCESS_public)
    6847              $C$DW$852       .dwtag  DW_TAG_member
    6848                      .dwattr $C$DW$852, DW_AT_type(*$C$DW$T$66)
    6849                      .dwattr $C$DW$852, DW_AT_name("trajHandle_spdMax")
    6850                      .dwattr $C$DW$852, DW_AT_TI_symbol_name("_trajHandle_spdMax")
    6851                      .dwattr $C$DW$852, DW_AT_data_member_location[DW_OP_plus_uconst 0x78]
    6852                      .dwattr $C$DW$852, DW_AT_accessibility(DW_ACCESS_public)
    6853              $C$DW$853       .dwtag  DW_TAG_member
    6854                      .dwattr $C$DW$853, DW_AT_type(*$C$DW$T$67)
    6855                      .dwattr $C$DW$853, DW_AT_name("traj_spdMax")
    6856                      .dwattr $C$DW$853, DW_AT_TI_symbol_name("_traj_spdMax")
    6857                      .dwattr $C$DW$853, DW_AT_data_member_location[DW_OP_plus_uconst 0x7a]
    6858                      .dwattr $C$DW$853, DW_AT_accessibility(DW_ACCESS_public)
    6859              $C$DW$854       .dwtag  DW_TAG_member
    6860                      .dwattr $C$DW$854, DW_AT_type(*$C$DW$T$68)
    6861                      .dwattr $C$DW$854, DW_AT_name("motorParams")
    6862                      .dwattr $C$DW$854, DW_AT_TI_symbol_name("_motorParams")
    6863                      .dwattr $C$DW$854, DW_AT_data_member_location[DW_OP_plus_uconst 0x84]
    6864                      .dwattr $C$DW$854, DW_AT_accessibility(DW_ACCESS_public)
    6865              $C$DW$855       .dwtag  DW_TAG_member
    6866                      .dwattr $C$DW$855, DW_AT_type(*$C$DW$T$70)
    6867                      .dwattr $C$DW$855, DW_AT_name("waitTimes")
    6868                      .dwattr $C$DW$855, DW_AT_TI_symbol_name("_waitTimes")
    6869                      .dwattr $C$DW$855, DW_AT_data_member_location[DW_OP_plus_uconst 0x92]
    6870                      .dwattr $C$DW$855, DW_AT_accessibility(DW_ACCESS_public)
    6871              $C$DW$856       .dwtag  DW_TAG_member
    6872                      .dwattr $C$DW$856, DW_AT_type(*$C$DW$T$69)
    6873                      .dwattr $C$DW$856, DW_AT_name("counter_state")
    6874                      .dwattr $C$DW$856, DW_AT_TI_symbol_name("_counter_state")
    6875                      .dwattr $C$DW$856, DW_AT_data_member_location[DW_OP_plus_uconst 0x9a]
    6876                      .dwattr $C$DW$856, DW_AT_accessibility(DW_ACCESS_public)
    6877              $C$DW$857       .dwtag  DW_TAG_member
    6878                      .dwattr $C$DW$857, DW_AT_type(*$C$DW$T$71)
    6879                      .dwattr $C$DW$857, DW_AT_name("numIsrTicksPerCtrlTick")
    6880                      .dwattr $C$DW$857, DW_AT_TI_symbol_name("_numIsrTicksPerCtrlTick")
TMS320C2000 Assembler PC v6.2.5 Mon Sep 11 15:13:22 2017

Tools Copyright (c) 1996-2014 Texas Instruments Incorporated
C:\Users\wmj\AppData\Local\Temp\1124010                              PAGE  135

    6881                      .dwattr $C$DW$857, DW_AT_data_member_location[DW_OP_plus_uconst 0x9c]
    6882                      .dwattr $C$DW$857, DW_AT_accessibility(DW_ACCESS_public)
    6883              $C$DW$858       .dwtag  DW_TAG_member
    6884                      .dwattr $C$DW$858, DW_AT_type(*$C$DW$T$71)
    6885                      .dwattr $C$DW$858, DW_AT_name("numCtrlTicksPerCurrentTick")
    6886                      .dwattr $C$DW$858, DW_AT_TI_symbol_name("_numCtrlTicksPerCurrentTick")
    6887                      .dwattr $C$DW$858, DW_AT_data_member_location[DW_OP_plus_uconst 0x9d]
    6888                      .dwattr $C$DW$858, DW_AT_accessibility(DW_ACCESS_public)
    6889              $C$DW$859       .dwtag  DW_TAG_member
    6890                      .dwattr $C$DW$859, DW_AT_type(*$C$DW$T$71)
    6891                      .dwattr $C$DW$859, DW_AT_name("numCtrlTicksPerSpeedTick")
    6892                      .dwattr $C$DW$859, DW_AT_TI_symbol_name("_numCtrlTicksPerSpeedTick")
    6893                      .dwattr $C$DW$859, DW_AT_data_member_location[DW_OP_plus_uconst 0x9e]
    6894                      .dwattr $C$DW$859, DW_AT_accessibility(DW_ACCESS_public)
    6895              $C$DW$860       .dwtag  DW_TAG_member
    6896                      .dwattr $C$DW$860, DW_AT_type(*$C$DW$T$71)
    6897                      .dwattr $C$DW$860, DW_AT_name("numCtrlTicksPerTrajTick")
    6898                      .dwattr $C$DW$860, DW_AT_TI_symbol_name("_numCtrlTicksPerTrajTick")
    6899                      .dwattr $C$DW$860, DW_AT_data_member_location[DW_OP_plus_uconst 0x9f]
    6900                      .dwattr $C$DW$860, DW_AT_accessibility(DW_ACCESS_public)
    6901              $C$DW$861       .dwtag  DW_TAG_member
    6902                      .dwattr $C$DW$861, DW_AT_type(*$C$DW$T$69)
    6903                      .dwattr $C$DW$861, DW_AT_name("ctrlFreq_Hz")
    6904                      .dwattr $C$DW$861, DW_AT_TI_symbol_name("_ctrlFreq_Hz")
    6905                      .dwattr $C$DW$861, DW_AT_data_member_location[DW_OP_plus_uconst 0xa0]
    6906                      .dwattr $C$DW$861, DW_AT_accessibility(DW_ACCESS_public)
    6907              $C$DW$862       .dwtag  DW_TAG_member
    6908                      .dwattr $C$DW$862, DW_AT_type(*$C$DW$T$69)
    6909                      .dwattr $C$DW$862, DW_AT_name("trajFreq_Hz")
    6910                      .dwattr $C$DW$862, DW_AT_TI_symbol_name("_trajFreq_Hz")
    6911                      .dwattr $C$DW$862, DW_AT_data_member_location[DW_OP_plus_uconst 0xa2]
    6912                      .dwattr $C$DW$862, DW_AT_accessibility(DW_ACCESS_public)
    6913              $C$DW$863       .dwtag  DW_TAG_member
    6914                      .dwattr $C$DW$863, DW_AT_type(*$C$DW$T$33)
    6915                      .dwattr $C$DW$863, DW_AT_name("trajPeriod_sec")
    6916                      .dwattr $C$DW$863, DW_AT_TI_symbol_name("_trajPeriod_sec")
    6917                      .dwattr $C$DW$863, DW_AT_data_member_location[DW_OP_plus_uconst 0xa4]
    6918                      .dwattr $C$DW$863, DW_AT_accessibility(DW_ACCESS_public)
    6919              $C$DW$864       .dwtag  DW_TAG_member
    6920                      .dwattr $C$DW$864, DW_AT_type(*$C$DW$T$72)
    6921                      .dwattr $C$DW$864, DW_AT_name("ctrlPeriod_sec")
    6922                      .dwattr $C$DW$864, DW_AT_TI_symbol_name("_ctrlPeriod_sec")
    6923                      .dwattr $C$DW$864, DW_AT_data_member_location[DW_OP_plus_uconst 0xa6]
    6924                      .dwattr $C$DW$864, DW_AT_accessibility(DW_ACCESS_public)
    6925              $C$DW$865       .dwtag  DW_TAG_member
    6926                      .dwattr $C$DW$865, DW_AT_type(*$C$DW$T$33)
    6927                      .dwattr $C$DW$865, DW_AT_name("maxVsMag_pu")
    6928                      .dwattr $C$DW$865, DW_AT_TI_symbol_name("_maxVsMag_pu")
    6929                      .dwattr $C$DW$865, DW_AT_data_member_location[DW_OP_plus_uconst 0xa8]
    6930                      .dwattr $C$DW$865, DW_AT_accessibility(DW_ACCESS_public)
    6931              $C$DW$866       .dwtag  DW_TAG_member
    6932                      .dwattr $C$DW$866, DW_AT_type(*$C$DW$T$73)
    6933                      .dwattr $C$DW$866, DW_AT_name("Iab_in")
    6934                      .dwattr $C$DW$866, DW_AT_TI_symbol_name("_Iab_in")
    6935                      .dwattr $C$DW$866, DW_AT_data_member_location[DW_OP_plus_uconst 0xaa]
TMS320C2000 Assembler PC v6.2.5 Mon Sep 11 15:13:22 2017

Tools Copyright (c) 1996-2014 Texas Instruments Incorporated
C:\Users\wmj\AppData\Local\Temp\1124010                              PAGE  136

    6936                      .dwattr $C$DW$866, DW_AT_accessibility(DW_ACCESS_public)
    6937              $C$DW$867       .dwtag  DW_TAG_member
    6938                      .dwattr $C$DW$867, DW_AT_type(*$C$DW$T$73)
    6939                      .dwattr $C$DW$867, DW_AT_name("Iab_filt")
    6940                      .dwattr $C$DW$867, DW_AT_TI_symbol_name("_Iab_filt")
    6941                      .dwattr $C$DW$867, DW_AT_data_member_location[DW_OP_plus_uconst 0xae]
    6942                      .dwattr $C$DW$867, DW_AT_accessibility(DW_ACCESS_public)
    6943              $C$DW$868       .dwtag  DW_TAG_member
    6944                      .dwattr $C$DW$868, DW_AT_type(*$C$DW$T$73)
    6945                      .dwattr $C$DW$868, DW_AT_name("Idq_in")
    6946                      .dwattr $C$DW$868, DW_AT_TI_symbol_name("_Idq_in")
    6947                      .dwattr $C$DW$868, DW_AT_data_member_location[DW_OP_plus_uconst 0xb2]
    6948                      .dwattr $C$DW$868, DW_AT_accessibility(DW_ACCESS_public)
    6949              $C$DW$869       .dwtag  DW_TAG_member
    6950                      .dwattr $C$DW$869, DW_AT_type(*$C$DW$T$73)
    6951                      .dwattr $C$DW$869, DW_AT_name("Vab_in")
    6952                      .dwattr $C$DW$869, DW_AT_TI_symbol_name("_Vab_in")
    6953                      .dwattr $C$DW$869, DW_AT_data_member_location[DW_OP_plus_uconst 0xb6]
    6954                      .dwattr $C$DW$869, DW_AT_accessibility(DW_ACCESS_public)
    6955              $C$DW$870       .dwtag  DW_TAG_member
    6956                      .dwattr $C$DW$870, DW_AT_type(*$C$DW$T$33)
    6957                      .dwattr $C$DW$870, DW_AT_name("spd_out")
    6958                      .dwattr $C$DW$870, DW_AT_TI_symbol_name("_spd_out")
    6959                      .dwattr $C$DW$870, DW_AT_data_member_location[DW_OP_plus_uconst 0xba]
    6960                      .dwattr $C$DW$870, DW_AT_accessibility(DW_ACCESS_public)
    6961              $C$DW$871       .dwtag  DW_TAG_member
    6962                      .dwattr $C$DW$871, DW_AT_type(*$C$DW$T$73)
    6963                      .dwattr $C$DW$871, DW_AT_name("Vab_out")
    6964                      .dwattr $C$DW$871, DW_AT_TI_symbol_name("_Vab_out")
    6965                      .dwattr $C$DW$871, DW_AT_data_member_location[DW_OP_plus_uconst 0xbc]
    6966                      .dwattr $C$DW$871, DW_AT_accessibility(DW_ACCESS_public)
    6967              $C$DW$872       .dwtag  DW_TAG_member
    6968                      .dwattr $C$DW$872, DW_AT_type(*$C$DW$T$73)
    6969                      .dwattr $C$DW$872, DW_AT_name("Vdq_out")
    6970                      .dwattr $C$DW$872, DW_AT_TI_symbol_name("_Vdq_out")
    6971                      .dwattr $C$DW$872, DW_AT_data_member_location[DW_OP_plus_uconst 0xc0]
    6972                      .dwattr $C$DW$872, DW_AT_accessibility(DW_ACCESS_public)
    6973              $C$DW$873       .dwtag  DW_TAG_member
    6974                      .dwattr $C$DW$873, DW_AT_type(*$C$DW$T$72)
    6975                      .dwattr $C$DW$873, DW_AT_name("Rhf")
    6976                      .dwattr $C$DW$873, DW_AT_TI_symbol_name("_Rhf")
    6977                      .dwattr $C$DW$873, DW_AT_data_member_location[DW_OP_plus_uconst 0xc4]
    6978                      .dwattr $C$DW$873, DW_AT_accessibility(DW_ACCESS_public)
    6979              $C$DW$874       .dwtag  DW_TAG_member
    6980                      .dwattr $C$DW$874, DW_AT_type(*$C$DW$T$72)
    6981                      .dwattr $C$DW$874, DW_AT_name("Lhf")
    6982                      .dwattr $C$DW$874, DW_AT_TI_symbol_name("_Lhf")
    6983                      .dwattr $C$DW$874, DW_AT_data_member_location[DW_OP_plus_uconst 0xc6]
    6984                      .dwattr $C$DW$874, DW_AT_accessibility(DW_ACCESS_public)
    6985              $C$DW$875       .dwtag  DW_TAG_member
    6986                      .dwattr $C$DW$875, DW_AT_type(*$C$DW$T$72)
    6987                      .dwattr $C$DW$875, DW_AT_name("RoverL")
    6988                      .dwattr $C$DW$875, DW_AT_TI_symbol_name("_RoverL")
    6989                      .dwattr $C$DW$875, DW_AT_data_member_location[DW_OP_plus_uconst 0xc8]
    6990                      .dwattr $C$DW$875, DW_AT_accessibility(DW_ACCESS_public)
TMS320C2000 Assembler PC v6.2.5 Mon Sep 11 15:13:22 2017

Tools Copyright (c) 1996-2014 Texas Instruments Incorporated
C:\Users\wmj\AppData\Local\Temp\1124010                              PAGE  137

    6991              $C$DW$876       .dwtag  DW_TAG_member
    6992                      .dwattr $C$DW$876, DW_AT_type(*$C$DW$T$33)
    6993                      .dwattr $C$DW$876, DW_AT_name("Kp_Id")
    6994                      .dwattr $C$DW$876, DW_AT_TI_symbol_name("_Kp_Id")
    6995                      .dwattr $C$DW$876, DW_AT_data_member_location[DW_OP_plus_uconst 0xca]
    6996                      .dwattr $C$DW$876, DW_AT_accessibility(DW_ACCESS_public)
    6997              $C$DW$877       .dwtag  DW_TAG_member
    6998                      .dwattr $C$DW$877, DW_AT_type(*$C$DW$T$33)
    6999                      .dwattr $C$DW$877, DW_AT_name("Kp_Iq")
    7000                      .dwattr $C$DW$877, DW_AT_TI_symbol_name("_Kp_Iq")
    7001                      .dwattr $C$DW$877, DW_AT_data_member_location[DW_OP_plus_uconst 0xcc]
    7002                      .dwattr $C$DW$877, DW_AT_accessibility(DW_ACCESS_public)
    7003              $C$DW$878       .dwtag  DW_TAG_member
    7004                      .dwattr $C$DW$878, DW_AT_type(*$C$DW$T$33)
    7005                      .dwattr $C$DW$878, DW_AT_name("Kp_spd")
    7006                      .dwattr $C$DW$878, DW_AT_TI_symbol_name("_Kp_spd")
    7007                      .dwattr $C$DW$878, DW_AT_data_member_location[DW_OP_plus_uconst 0xce]
    7008                      .dwattr $C$DW$878, DW_AT_accessibility(DW_ACCESS_public)
    7009              $C$DW$879       .dwtag  DW_TAG_member
    7010                      .dwattr $C$DW$879, DW_AT_type(*$C$DW$T$33)
    7011                      .dwattr $C$DW$879, DW_AT_name("Ki_Id")
    7012                      .dwattr $C$DW$879, DW_AT_TI_symbol_name("_Ki_Id")
    7013                      .dwattr $C$DW$879, DW_AT_data_member_location[DW_OP_plus_uconst 0xd0]
    7014                      .dwattr $C$DW$879, DW_AT_accessibility(DW_ACCESS_public)
    7015              $C$DW$880       .dwtag  DW_TAG_member
    7016                      .dwattr $C$DW$880, DW_AT_type(*$C$DW$T$33)
    7017                      .dwattr $C$DW$880, DW_AT_name("Ki_Iq")
    7018                      .dwattr $C$DW$880, DW_AT_TI_symbol_name("_Ki_Iq")
    7019                      .dwattr $C$DW$880, DW_AT_data_member_location[DW_OP_plus_uconst 0xd2]
    7020                      .dwattr $C$DW$880, DW_AT_accessibility(DW_ACCESS_public)
    7021              $C$DW$881       .dwtag  DW_TAG_member
    7022                      .dwattr $C$DW$881, DW_AT_type(*$C$DW$T$33)
    7023                      .dwattr $C$DW$881, DW_AT_name("Ki_spd")
    7024                      .dwattr $C$DW$881, DW_AT_TI_symbol_name("_Ki_spd")
    7025                      .dwattr $C$DW$881, DW_AT_data_member_location[DW_OP_plus_uconst 0xd4]
    7026                      .dwattr $C$DW$881, DW_AT_accessibility(DW_ACCESS_public)
    7027              $C$DW$882       .dwtag  DW_TAG_member
    7028                      .dwattr $C$DW$882, DW_AT_type(*$C$DW$T$33)
    7029                      .dwattr $C$DW$882, DW_AT_name("Kd_Id")
    7030                      .dwattr $C$DW$882, DW_AT_TI_symbol_name("_Kd_Id")
    7031                      .dwattr $C$DW$882, DW_AT_data_member_location[DW_OP_plus_uconst 0xd6]
    7032                      .dwattr $C$DW$882, DW_AT_accessibility(DW_ACCESS_public)
    7033              $C$DW$883       .dwtag  DW_TAG_member
    7034                      .dwattr $C$DW$883, DW_AT_type(*$C$DW$T$33)
    7035                      .dwattr $C$DW$883, DW_AT_name("Kd_Iq")
    7036                      .dwattr $C$DW$883, DW_AT_TI_symbol_name("_Kd_Iq")
    7037                      .dwattr $C$DW$883, DW_AT_data_member_location[DW_OP_plus_uconst 0xd8]
    7038                      .dwattr $C$DW$883, DW_AT_accessibility(DW_ACCESS_public)
    7039              $C$DW$884       .dwtag  DW_TAG_member
    7040                      .dwattr $C$DW$884, DW_AT_type(*$C$DW$T$33)
    7041                      .dwattr $C$DW$884, DW_AT_name("Kd_spd")
    7042                      .dwattr $C$DW$884, DW_AT_TI_symbol_name("_Kd_spd")
    7043                      .dwattr $C$DW$884, DW_AT_data_member_location[DW_OP_plus_uconst 0xda]
    7044                      .dwattr $C$DW$884, DW_AT_accessibility(DW_ACCESS_public)
    7045              $C$DW$885       .dwtag  DW_TAG_member
TMS320C2000 Assembler PC v6.2.5 Mon Sep 11 15:13:22 2017

Tools Copyright (c) 1996-2014 Texas Instruments Incorporated
C:\Users\wmj\AppData\Local\Temp\1124010                              PAGE  138

    7046                      .dwattr $C$DW$885, DW_AT_type(*$C$DW$T$33)
    7047                      .dwattr $C$DW$885, DW_AT_name("Ui_Id")
    7048                      .dwattr $C$DW$885, DW_AT_TI_symbol_name("_Ui_Id")
    7049                      .dwattr $C$DW$885, DW_AT_data_member_location[DW_OP_plus_uconst 0xdc]
    7050                      .dwattr $C$DW$885, DW_AT_accessibility(DW_ACCESS_public)
    7051              $C$DW$886       .dwtag  DW_TAG_member
    7052                      .dwattr $C$DW$886, DW_AT_type(*$C$DW$T$33)
    7053                      .dwattr $C$DW$886, DW_AT_name("Ui_Iq")
    7054                      .dwattr $C$DW$886, DW_AT_TI_symbol_name("_Ui_Iq")
    7055                      .dwattr $C$DW$886, DW_AT_data_member_location[DW_OP_plus_uconst 0xde]
    7056                      .dwattr $C$DW$886, DW_AT_accessibility(DW_ACCESS_public)
    7057              $C$DW$887       .dwtag  DW_TAG_member
    7058                      .dwattr $C$DW$887, DW_AT_type(*$C$DW$T$33)
    7059                      .dwattr $C$DW$887, DW_AT_name("Ui_spd")
    7060                      .dwattr $C$DW$887, DW_AT_TI_symbol_name("_Ui_spd")
    7061                      .dwattr $C$DW$887, DW_AT_data_member_location[DW_OP_plus_uconst 0xe0]
    7062                      .dwattr $C$DW$887, DW_AT_accessibility(DW_ACCESS_public)
    7063              $C$DW$888       .dwtag  DW_TAG_member
    7064                      .dwattr $C$DW$888, DW_AT_type(*$C$DW$T$73)
    7065                      .dwattr $C$DW$888, DW_AT_name("Idq_ref")
    7066                      .dwattr $C$DW$888, DW_AT_TI_symbol_name("_Idq_ref")
    7067                      .dwattr $C$DW$888, DW_AT_data_member_location[DW_OP_plus_uconst 0xe2]
    7068                      .dwattr $C$DW$888, DW_AT_accessibility(DW_ACCESS_public)
    7069              $C$DW$889       .dwtag  DW_TAG_member
    7070                      .dwattr $C$DW$889, DW_AT_type(*$C$DW$T$33)
    7071                      .dwattr $C$DW$889, DW_AT_name("IdRated")
    7072                      .dwattr $C$DW$889, DW_AT_TI_symbol_name("_IdRated")
    7073                      .dwattr $C$DW$889, DW_AT_data_member_location[DW_OP_plus_uconst 0xe6]
    7074                      .dwattr $C$DW$889, DW_AT_accessibility(DW_ACCESS_public)
    7075              $C$DW$890       .dwtag  DW_TAG_member
    7076                      .dwattr $C$DW$890, DW_AT_type(*$C$DW$T$33)
    7077                      .dwattr $C$DW$890, DW_AT_name("spd_ref")
    7078                      .dwattr $C$DW$890, DW_AT_TI_symbol_name("_spd_ref")
    7079                      .dwattr $C$DW$890, DW_AT_data_member_location[DW_OP_plus_uconst 0xe8]
    7080                      .dwattr $C$DW$890, DW_AT_accessibility(DW_ACCESS_public)
    7081              $C$DW$891       .dwtag  DW_TAG_member
    7082                      .dwattr $C$DW$891, DW_AT_type(*$C$DW$T$33)
    7083                      .dwattr $C$DW$891, DW_AT_name("spd_max")
    7084                      .dwattr $C$DW$891, DW_AT_TI_symbol_name("_spd_max")
    7085                      .dwattr $C$DW$891, DW_AT_data_member_location[DW_OP_plus_uconst 0xea]
    7086                      .dwattr $C$DW$891, DW_AT_accessibility(DW_ACCESS_public)
    7087              $C$DW$892       .dwtag  DW_TAG_member
    7088                      .dwattr $C$DW$892, DW_AT_type(*$C$DW$T$71)
    7089                      .dwattr $C$DW$892, DW_AT_name("counter_current")
    7090                      .dwattr $C$DW$892, DW_AT_TI_symbol_name("_counter_current")
    7091                      .dwattr $C$DW$892, DW_AT_data_member_location[DW_OP_plus_uconst 0xec]
    7092                      .dwattr $C$DW$892, DW_AT_accessibility(DW_ACCESS_public)
    7093              $C$DW$893       .dwtag  DW_TAG_member
    7094                      .dwattr $C$DW$893, DW_AT_type(*$C$DW$T$71)
    7095                      .dwattr $C$DW$893, DW_AT_name("counter_isr")
    7096                      .dwattr $C$DW$893, DW_AT_TI_symbol_name("_counter_isr")
    7097                      .dwattr $C$DW$893, DW_AT_data_member_location[DW_OP_plus_uconst 0xed]
    7098                      .dwattr $C$DW$893, DW_AT_accessibility(DW_ACCESS_public)
    7099              $C$DW$894       .dwtag  DW_TAG_member
    7100                      .dwattr $C$DW$894, DW_AT_type(*$C$DW$T$71)
TMS320C2000 Assembler PC v6.2.5 Mon Sep 11 15:13:22 2017

Tools Copyright (c) 1996-2014 Texas Instruments Incorporated
C:\Users\wmj\AppData\Local\Temp\1124010                              PAGE  139

    7101                      .dwattr $C$DW$894, DW_AT_name("counter_speed")
    7102                      .dwattr $C$DW$894, DW_AT_TI_symbol_name("_counter_speed")
    7103                      .dwattr $C$DW$894, DW_AT_data_member_location[DW_OP_plus_uconst 0xee]
    7104                      .dwattr $C$DW$894, DW_AT_accessibility(DW_ACCESS_public)
    7105              $C$DW$895       .dwtag  DW_TAG_member
    7106                      .dwattr $C$DW$895, DW_AT_type(*$C$DW$T$71)
    7107                      .dwattr $C$DW$895, DW_AT_name("counter_traj")
    7108                      .dwattr $C$DW$895, DW_AT_TI_symbol_name("_counter_traj")
    7109                      .dwattr $C$DW$895, DW_AT_data_member_location[DW_OP_plus_uconst 0xef]
    7110                      .dwattr $C$DW$895, DW_AT_accessibility(DW_ACCESS_public)
    7111              $C$DW$896       .dwtag  DW_TAG_member
    7112                      .dwattr $C$DW$896, DW_AT_type(*$C$DW$T$41)
    7113                      .dwattr $C$DW$896, DW_AT_name("flag_enableCtrl")
    7114                      .dwattr $C$DW$896, DW_AT_TI_symbol_name("_flag_enableCtrl")
    7115                      .dwattr $C$DW$896, DW_AT_data_member_location[DW_OP_plus_uconst 0xf0]
    7116                      .dwattr $C$DW$896, DW_AT_accessibility(DW_ACCESS_public)
    7117              $C$DW$897       .dwtag  DW_TAG_member
    7118                      .dwattr $C$DW$897, DW_AT_type(*$C$DW$T$41)
    7119                      .dwattr $C$DW$897, DW_AT_name("flag_enableDcBusComp")
    7120                      .dwattr $C$DW$897, DW_AT_TI_symbol_name("_flag_enableDcBusComp")
    7121                      .dwattr $C$DW$897, DW_AT_data_member_location[DW_OP_plus_uconst 0xf1]
    7122                      .dwattr $C$DW$897, DW_AT_accessibility(DW_ACCESS_public)
    7123              $C$DW$898       .dwtag  DW_TAG_member
    7124                      .dwattr $C$DW$898, DW_AT_type(*$C$DW$T$41)
    7125                      .dwattr $C$DW$898, DW_AT_name("flag_enablePowerWarp")
    7126                      .dwattr $C$DW$898, DW_AT_TI_symbol_name("_flag_enablePowerWarp")
    7127                      .dwattr $C$DW$898, DW_AT_data_member_location[DW_OP_plus_uconst 0xf2]
    7128                      .dwattr $C$DW$898, DW_AT_accessibility(DW_ACCESS_public)
    7129              $C$DW$899       .dwtag  DW_TAG_member
    7130                      .dwattr $C$DW$899, DW_AT_type(*$C$DW$T$41)
    7131                      .dwattr $C$DW$899, DW_AT_name("flag_enableOffset")
    7132                      .dwattr $C$DW$899, DW_AT_TI_symbol_name("_flag_enableOffset")
    7133                      .dwattr $C$DW$899, DW_AT_data_member_location[DW_OP_plus_uconst 0xf3]
    7134                      .dwattr $C$DW$899, DW_AT_accessibility(DW_ACCESS_public)
    7135              $C$DW$900       .dwtag  DW_TAG_member
    7136                      .dwattr $C$DW$900, DW_AT_type(*$C$DW$T$41)
    7137                      .dwattr $C$DW$900, DW_AT_name("flag_enableSpeedCtrl")
    7138                      .dwattr $C$DW$900, DW_AT_TI_symbol_name("_flag_enableSpeedCtrl")
    7139                      .dwattr $C$DW$900, DW_AT_data_member_location[DW_OP_plus_uconst 0xf4]
    7140                      .dwattr $C$DW$900, DW_AT_accessibility(DW_ACCESS_public)
    7141              $C$DW$901       .dwtag  DW_TAG_member
    7142                      .dwattr $C$DW$901, DW_AT_type(*$C$DW$T$41)
    7143                      .dwattr $C$DW$901, DW_AT_name("flag_enableUserMotorParams")
    7144                      .dwattr $C$DW$901, DW_AT_TI_symbol_name("_flag_enableUserMotorParams")
    7145                      .dwattr $C$DW$901, DW_AT_data_member_location[DW_OP_plus_uconst 0xf5]
    7146                      .dwattr $C$DW$901, DW_AT_accessibility(DW_ACCESS_public)
    7147              $C$DW$902       .dwtag  DW_TAG_member
    7148                      .dwattr $C$DW$902, DW_AT_type(*$C$DW$T$73)
    7149                      .dwattr $C$DW$902, DW_AT_name("Idq_offset_pu")
    7150                      .dwattr $C$DW$902, DW_AT_TI_symbol_name("_Idq_offset_pu")
    7151                      .dwattr $C$DW$902, DW_AT_data_member_location[DW_OP_plus_uconst 0xf6]
    7152                      .dwattr $C$DW$902, DW_AT_accessibility(DW_ACCESS_public)
    7153              $C$DW$903       .dwtag  DW_TAG_member
    7154                      .dwattr $C$DW$903, DW_AT_type(*$C$DW$T$73)
    7155                      .dwattr $C$DW$903, DW_AT_name("Vdq_offset_pu")
TMS320C2000 Assembler PC v6.2.5 Mon Sep 11 15:13:22 2017

Tools Copyright (c) 1996-2014 Texas Instruments Incorporated
C:\Users\wmj\AppData\Local\Temp\1124010                              PAGE  140

    7156                      .dwattr $C$DW$903, DW_AT_TI_symbol_name("_Vdq_offset_pu")
    7157                      .dwattr $C$DW$903, DW_AT_data_member_location[DW_OP_plus_uconst 0xfa]
    7158                      .dwattr $C$DW$903, DW_AT_accessibility(DW_ACCESS_public)
    7159              $C$DW$904       .dwtag  DW_TAG_member
    7160                      .dwattr $C$DW$904, DW_AT_type(*$C$DW$T$33)
    7161                      .dwattr $C$DW$904, DW_AT_name("angle_pu")
    7162                      .dwattr $C$DW$904, DW_AT_TI_symbol_name("_angle_pu")
    7163                      .dwattr $C$DW$904, DW_AT_data_member_location[DW_OP_plus_uconst 0xfe]
    7164                      .dwattr $C$DW$904, DW_AT_accessibility(DW_ACCESS_public)
    7165              $C$DW$905       .dwtag  DW_TAG_member
    7166                      .dwattr $C$DW$905, DW_AT_type(*$C$DW$T$33)
    7167                      .dwattr $C$DW$905, DW_AT_name("speed_ref_pu")
    7168                      .dwattr $C$DW$905, DW_AT_TI_symbol_name("_speed_ref_pu")
    7169                      .dwattr $C$DW$905, DW_AT_data_member_location[DW_OP_plus_uconst 0x100]
    7170                      .dwattr $C$DW$905, DW_AT_accessibility(DW_ACCESS_public)
    7171              $C$DW$906       .dwtag  DW_TAG_member
    7172                      .dwattr $C$DW$906, DW_AT_type(*$C$DW$T$33)
    7173                      .dwattr $C$DW$906, DW_AT_name("speed_fb_pu")
    7174                      .dwattr $C$DW$906, DW_AT_TI_symbol_name("_speed_fb_pu")
    7175                      .dwattr $C$DW$906, DW_AT_data_member_location[DW_OP_plus_uconst 0x102]
    7176                      .dwattr $C$DW$906, DW_AT_accessibility(DW_ACCESS_public)
    7177              $C$DW$907       .dwtag  DW_TAG_member
    7178                      .dwattr $C$DW$907, DW_AT_type(*$C$DW$T$33)
    7179                      .dwattr $C$DW$907, DW_AT_name("speed_outMax_pu")
    7180                      .dwattr $C$DW$907, DW_AT_TI_symbol_name("_speed_outMax_pu")
    7181                      .dwattr $C$DW$907, DW_AT_data_member_location[DW_OP_plus_uconst 0x104]
    7182                      .dwattr $C$DW$907, DW_AT_accessibility(DW_ACCESS_public)
    7183              $C$DW$908       .dwtag  DW_TAG_member
    7184                      .dwattr $C$DW$908, DW_AT_type(*$C$DW$T$41)
    7185                      .dwattr $C$DW$908, DW_AT_name("flag_enableCurrentCtrl")
    7186                      .dwattr $C$DW$908, DW_AT_TI_symbol_name("_flag_enableCurrentCtrl")
    7187                      .dwattr $C$DW$908, DW_AT_data_member_location[DW_OP_plus_uconst 0x106]
    7188                      .dwattr $C$DW$908, DW_AT_accessibility(DW_ACCESS_public)
    7189                      .dwendtag $C$DW$T$74
    7190              
    7191              $C$DW$T$326     .dwtag  DW_TAG_typedef, DW_AT_name("CTRL_Obj")
    7192                      .dwattr $C$DW$T$326, DW_AT_type(*$C$DW$T$74)
    7193                      .dwattr $C$DW$T$326, DW_AT_language(DW_LANG_C)
    7194              $C$DW$T$327     .dwtag  DW_TAG_pointer_type
    7195                      .dwattr $C$DW$T$327, DW_AT_type(*$C$DW$T$326)
    7196                      .dwattr $C$DW$T$327, DW_AT_address_class(0x16)
    7197              $C$DW$T$273     .dwtag  DW_TAG_pointer_type
    7198                      .dwattr $C$DW$T$273, DW_AT_type(*$C$DW$T$74)
    7199                      .dwattr $C$DW$T$273, DW_AT_address_class(0x16)
    7200              $C$DW$T$274     .dwtag  DW_TAG_typedef, DW_AT_name("CTRL_Handle")
    7201                      .dwattr $C$DW$T$274, DW_AT_type(*$C$DW$T$273)
    7202                      .dwattr $C$DW$T$274, DW_AT_language(DW_LANG_C)
    7203              $C$DW$909       .dwtag  DW_TAG_TI_far_type
    7204                      .dwattr $C$DW$909, DW_AT_type(*$C$DW$T$274)
    7205              $C$DW$T$328     .dwtag  DW_TAG_const_type
    7206                      .dwattr $C$DW$T$328, DW_AT_type(*$C$DW$909)
    7207              
    7208              $C$DW$T$77      .dwtag  DW_TAG_structure_type
    7209                      .dwattr $C$DW$T$77, DW_AT_name("_CTRL_Version_")
    7210                      .dwattr $C$DW$T$77, DW_AT_byte_size(0x04)
TMS320C2000 Assembler PC v6.2.5 Mon Sep 11 15:13:22 2017

Tools Copyright (c) 1996-2014 Texas Instruments Incorporated
C:\Users\wmj\AppData\Local\Temp\1124010                              PAGE  141

    7211              $C$DW$910       .dwtag  DW_TAG_member
    7212                      .dwattr $C$DW$910, DW_AT_type(*$C$DW$T$24)
    7213                      .dwattr $C$DW$910, DW_AT_name("rsvd")
    7214                      .dwattr $C$DW$910, DW_AT_TI_symbol_name("_rsvd")
    7215                      .dwattr $C$DW$910, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    7216                      .dwattr $C$DW$910, DW_AT_accessibility(DW_ACCESS_public)
    7217              $C$DW$911       .dwtag  DW_TAG_member
    7218                      .dwattr $C$DW$911, DW_AT_type(*$C$DW$T$76)
    7219                      .dwattr $C$DW$911, DW_AT_name("targetProc")
    7220                      .dwattr $C$DW$911, DW_AT_TI_symbol_name("_targetProc")
    7221                      .dwattr $C$DW$911, DW_AT_data_member_location[DW_OP_plus_uconst 0x1]
    7222                      .dwattr $C$DW$911, DW_AT_accessibility(DW_ACCESS_public)
    7223              $C$DW$912       .dwtag  DW_TAG_member
    7224                      .dwattr $C$DW$912, DW_AT_type(*$C$DW$T$24)
    7225                      .dwattr $C$DW$912, DW_AT_name("major")
    7226                      .dwattr $C$DW$912, DW_AT_TI_symbol_name("_major")
    7227                      .dwattr $C$DW$912, DW_AT_data_member_location[DW_OP_plus_uconst 0x2]
    7228                      .dwattr $C$DW$912, DW_AT_accessibility(DW_ACCESS_public)
    7229              $C$DW$913       .dwtag  DW_TAG_member
    7230                      .dwattr $C$DW$913, DW_AT_type(*$C$DW$T$24)
    7231                      .dwattr $C$DW$913, DW_AT_name("minor")
    7232                      .dwattr $C$DW$913, DW_AT_TI_symbol_name("_minor")
    7233                      .dwattr $C$DW$913, DW_AT_data_member_location[DW_OP_plus_uconst 0x3]
    7234                      .dwattr $C$DW$913, DW_AT_accessibility(DW_ACCESS_public)
    7235                      .dwendtag $C$DW$T$77
    7236              
    7237              $C$DW$T$43      .dwtag  DW_TAG_typedef, DW_AT_name("CTRL_Version")
    7238                      .dwattr $C$DW$T$43, DW_AT_type(*$C$DW$T$77)
    7239                      .dwattr $C$DW$T$43, DW_AT_language(DW_LANG_C)
    7240              $C$DW$T$334     .dwtag  DW_TAG_pointer_type
    7241                      .dwattr $C$DW$T$334, DW_AT_type(*$C$DW$T$43)
    7242                      .dwattr $C$DW$T$334, DW_AT_address_class(0x16)
    7243              
    7244              $C$DW$T$84      .dwtag  DW_TAG_structure_type
    7245                      .dwattr $C$DW$T$84, DW_AT_name("_DECODER_Obj_")
    7246                      .dwattr $C$DW$T$84, DW_AT_byte_size(0x06)
    7247              $C$DW$914       .dwtag  DW_TAG_member
    7248                      .dwattr $C$DW$914, DW_AT_type(*$C$DW$T$79)
    7249                      .dwattr $C$DW$914, DW_AT_name("spiHandle")
    7250                      .dwattr $C$DW$914, DW_AT_TI_symbol_name("_spiHandle")
    7251                      .dwattr $C$DW$914, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    7252                      .dwattr $C$DW$914, DW_AT_accessibility(DW_ACCESS_public)
    7253              $C$DW$915       .dwtag  DW_TAG_member
    7254                      .dwattr $C$DW$915, DW_AT_type(*$C$DW$T$81)
    7255                      .dwattr $C$DW$915, DW_AT_name("gpioHandle")
    7256                      .dwattr $C$DW$915, DW_AT_TI_symbol_name("_gpioHandle")
    7257                      .dwattr $C$DW$915, DW_AT_data_member_location[DW_OP_plus_uconst 0x2]
    7258                      .dwattr $C$DW$915, DW_AT_accessibility(DW_ACCESS_public)
    7259              $C$DW$916       .dwtag  DW_TAG_member
    7260                      .dwattr $C$DW$916, DW_AT_type(*$C$DW$T$83)
    7261                      .dwattr $C$DW$916, DW_AT_name("gpioNumber")
    7262                      .dwattr $C$DW$916, DW_AT_TI_symbol_name("_gpioNumber")
    7263                      .dwattr $C$DW$916, DW_AT_data_member_location[DW_OP_plus_uconst 0x4]
    7264                      .dwattr $C$DW$916, DW_AT_accessibility(DW_ACCESS_public)
    7265              $C$DW$917       .dwtag  DW_TAG_member
TMS320C2000 Assembler PC v6.2.5 Mon Sep 11 15:13:22 2017

Tools Copyright (c) 1996-2014 Texas Instruments Incorporated
C:\Users\wmj\AppData\Local\Temp\1124010                              PAGE  142

    7266                      .dwattr $C$DW$917, DW_AT_type(*$C$DW$T$41)
    7267                      .dwattr $C$DW$917, DW_AT_name("RxTimeOut")
    7268                      .dwattr $C$DW$917, DW_AT_TI_symbol_name("_RxTimeOut")
    7269                      .dwattr $C$DW$917, DW_AT_data_member_location[DW_OP_plus_uconst 0x5]
    7270                      .dwattr $C$DW$917, DW_AT_accessibility(DW_ACCESS_public)
    7271                      .dwendtag $C$DW$T$84
    7272              
    7273              $C$DW$T$242     .dwtag  DW_TAG_typedef, DW_AT_name("DECODER_Obj")
    7274                      .dwattr $C$DW$T$242, DW_AT_type(*$C$DW$T$84)
    7275                      .dwattr $C$DW$T$242, DW_AT_language(DW_LANG_C)
    7276              $C$DW$T$240     .dwtag  DW_TAG_pointer_type
    7277                      .dwattr $C$DW$T$240, DW_AT_type(*$C$DW$T$84)
    7278                      .dwattr $C$DW$T$240, DW_AT_address_class(0x16)
    7279              $C$DW$T$241     .dwtag  DW_TAG_typedef, DW_AT_name("DECODER_Handle")
    7280                      .dwattr $C$DW$T$241, DW_AT_type(*$C$DW$T$240)
    7281                      .dwattr $C$DW$T$241, DW_AT_language(DW_LANG_C)
    7282              
    7283              $C$DW$T$85      .dwtag  DW_TAG_structure_type
    7284                      .dwattr $C$DW$T$85, DW_AT_name("_DRIVE_CURRENT_t_")
    7285                      .dwattr $C$DW$T$85, DW_AT_byte_size(0x02)
    7286              $C$DW$918       .dwtag  DW_TAG_member
    7287                      .dwattr $C$DW$918, DW_AT_type(*$C$DW$T$24)
    7288                      .dwattr $C$DW$918, DW_AT_name("IDRIVE")
    7289                      .dwattr $C$DW$918, DW_AT_TI_symbol_name("_IDRIVE")
    7290                      .dwattr $C$DW$918, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    7291                      .dwattr $C$DW$918, DW_AT_accessibility(DW_ACCESS_public)
    7292              $C$DW$919       .dwtag  DW_TAG_member
    7293                      .dwattr $C$DW$919, DW_AT_type(*$C$DW$T$24)
    7294                      .dwattr $C$DW$919, DW_AT_name("INIT_IDRIVE")
    7295                      .dwattr $C$DW$919, DW_AT_TI_symbol_name("_INIT_IDRIVE")
    7296                      .dwattr $C$DW$919, DW_AT_data_member_location[DW_OP_plus_uconst 0x1]
    7297                      .dwattr $C$DW$919, DW_AT_accessibility(DW_ACCESS_public)
    7298                      .dwendtag $C$DW$T$85
    7299              
    7300              $C$DW$T$158     .dwtag  DW_TAG_typedef, DW_AT_name("DRIVE_CURRENT_t_")
    7301                      .dwattr $C$DW$T$158, DW_AT_type(*$C$DW$T$85)
    7302                      .dwattr $C$DW$T$158, DW_AT_language(DW_LANG_C)
    7303              
    7304              $C$DW$T$21      .dwtag  DW_TAG_structure_type
    7305                      .dwattr $C$DW$T$21, DW_AT_name("_EST_Obj_")
    7306                      .dwattr $C$DW$T$21, DW_AT_declaration
    7307                      .dwendtag $C$DW$T$21
    7308              
    7309              $C$DW$T$51      .dwtag  DW_TAG_pointer_type
    7310                      .dwattr $C$DW$T$51, DW_AT_type(*$C$DW$T$21)
    7311                      .dwattr $C$DW$T$51, DW_AT_address_class(0x16)
    7312              $C$DW$T$52      .dwtag  DW_TAG_typedef, DW_AT_name("EST_Handle")
    7313                      .dwattr $C$DW$T$52, DW_AT_type(*$C$DW$T$51)
    7314                      .dwattr $C$DW$T$52, DW_AT_language(DW_LANG_C)
    7315              
    7316              $C$DW$T$86      .dwtag  DW_TAG_structure_type
    7317                      .dwattr $C$DW$T$86, DW_AT_name("_FILTER_FO_")
    7318                      .dwattr $C$DW$T$86, DW_AT_byte_size(0x0a)
    7319              $C$DW$920       .dwtag  DW_TAG_member
    7320                      .dwattr $C$DW$920, DW_AT_type(*$C$DW$T$33)
TMS320C2000 Assembler PC v6.2.5 Mon Sep 11 15:13:22 2017

Tools Copyright (c) 1996-2014 Texas Instruments Incorporated
C:\Users\wmj\AppData\Local\Temp\1124010                              PAGE  143

    7321                      .dwattr $C$DW$920, DW_AT_name("a1")
    7322                      .dwattr $C$DW$920, DW_AT_TI_symbol_name("_a1")
    7323                      .dwattr $C$DW$920, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    7324                      .dwattr $C$DW$920, DW_AT_accessibility(DW_ACCESS_public)
    7325              $C$DW$921       .dwtag  DW_TAG_member
    7326                      .dwattr $C$DW$921, DW_AT_type(*$C$DW$T$33)
    7327                      .dwattr $C$DW$921, DW_AT_name("b0")
    7328                      .dwattr $C$DW$921, DW_AT_TI_symbol_name("_b0")
    7329                      .dwattr $C$DW$921, DW_AT_data_member_location[DW_OP_plus_uconst 0x2]
    7330                      .dwattr $C$DW$921, DW_AT_accessibility(DW_ACCESS_public)
    7331              $C$DW$922       .dwtag  DW_TAG_member
    7332                      .dwattr $C$DW$922, DW_AT_type(*$C$DW$T$33)
    7333                      .dwattr $C$DW$922, DW_AT_name("b1")
    7334                      .dwattr $C$DW$922, DW_AT_TI_symbol_name("_b1")
    7335                      .dwattr $C$DW$922, DW_AT_data_member_location[DW_OP_plus_uconst 0x4]
    7336                      .dwattr $C$DW$922, DW_AT_accessibility(DW_ACCESS_public)
    7337              $C$DW$923       .dwtag  DW_TAG_member
    7338                      .dwattr $C$DW$923, DW_AT_type(*$C$DW$T$33)
    7339                      .dwattr $C$DW$923, DW_AT_name("x1")
    7340                      .dwattr $C$DW$923, DW_AT_TI_symbol_name("_x1")
    7341                      .dwattr $C$DW$923, DW_AT_data_member_location[DW_OP_plus_uconst 0x6]
    7342                      .dwattr $C$DW$923, DW_AT_accessibility(DW_ACCESS_public)
    7343              $C$DW$924       .dwtag  DW_TAG_member
    7344                      .dwattr $C$DW$924, DW_AT_type(*$C$DW$T$33)
    7345                      .dwattr $C$DW$924, DW_AT_name("y1")
    7346                      .dwattr $C$DW$924, DW_AT_TI_symbol_name("_y1")
    7347                      .dwattr $C$DW$924, DW_AT_data_member_location[DW_OP_plus_uconst 0x8]
    7348                      .dwattr $C$DW$924, DW_AT_accessibility(DW_ACCESS_public)
    7349                      .dwendtag $C$DW$T$86
    7350              
    7351              $C$DW$T$201     .dwtag  DW_TAG_typedef, DW_AT_name("FILTER_FO_Obj")
    7352                      .dwattr $C$DW$T$201, DW_AT_type(*$C$DW$T$86)
    7353                      .dwattr $C$DW$T$201, DW_AT_language(DW_LANG_C)
    7354              
    7355              $C$DW$T$22      .dwtag  DW_TAG_structure_type
    7356                      .dwattr $C$DW$T$22, DW_AT_name("_FILTER_FO_Obj_")
    7357                      .dwattr $C$DW$T$22, DW_AT_declaration
    7358                      .dwendtag $C$DW$T$22
    7359              
    7360              $C$DW$T$202     .dwtag  DW_TAG_pointer_type
    7361                      .dwattr $C$DW$T$202, DW_AT_type(*$C$DW$T$22)
    7362                      .dwattr $C$DW$T$202, DW_AT_address_class(0x16)
    7363              $C$DW$T$203     .dwtag  DW_TAG_typedef, DW_AT_name("FILTER_FO_Handle")
    7364                      .dwattr $C$DW$T$203, DW_AT_type(*$C$DW$T$202)
    7365                      .dwattr $C$DW$T$203, DW_AT_language(DW_LANG_C)
    7366              
    7367              $C$DW$T$87      .dwtag  DW_TAG_structure_type
    7368                      .dwattr $C$DW$T$87, DW_AT_name("_FLASH_Obj_")
    7369                      .dwattr $C$DW$T$87, DW_AT_byte_size(0x08)
    7370              $C$DW$925       .dwtag  DW_TAG_member
    7371                      .dwattr $C$DW$925, DW_AT_type(*$C$DW$T$25)
    7372                      .dwattr $C$DW$925, DW_AT_name("FOPT")
    7373                      .dwattr $C$DW$925, DW_AT_TI_symbol_name("_FOPT")
    7374                      .dwattr $C$DW$925, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    7375                      .dwattr $C$DW$925, DW_AT_accessibility(DW_ACCESS_public)
TMS320C2000 Assembler PC v6.2.5 Mon Sep 11 15:13:22 2017

Tools Copyright (c) 1996-2014 Texas Instruments Incorporated
C:\Users\wmj\AppData\Local\Temp\1124010                              PAGE  144

    7376              $C$DW$926       .dwtag  DW_TAG_member
    7377                      .dwattr $C$DW$926, DW_AT_type(*$C$DW$T$25)
    7378                      .dwattr $C$DW$926, DW_AT_name("rsvd_1")
    7379                      .dwattr $C$DW$926, DW_AT_TI_symbol_name("_rsvd_1")
    7380                      .dwattr $C$DW$926, DW_AT_data_member_location[DW_OP_plus_uconst 0x1]
    7381                      .dwattr $C$DW$926, DW_AT_accessibility(DW_ACCESS_public)
    7382              $C$DW$927       .dwtag  DW_TAG_member
    7383                      .dwattr $C$DW$927, DW_AT_type(*$C$DW$T$25)
    7384                      .dwattr $C$DW$927, DW_AT_name("FPWR")
    7385                      .dwattr $C$DW$927, DW_AT_TI_symbol_name("_FPWR")
    7386                      .dwattr $C$DW$927, DW_AT_data_member_location[DW_OP_plus_uconst 0x2]
    7387                      .dwattr $C$DW$927, DW_AT_accessibility(DW_ACCESS_public)
    7388              $C$DW$928       .dwtag  DW_TAG_member
    7389                      .dwattr $C$DW$928, DW_AT_type(*$C$DW$T$25)
    7390                      .dwattr $C$DW$928, DW_AT_name("FSTATUS")
    7391                      .dwattr $C$DW$928, DW_AT_TI_symbol_name("_FSTATUS")
    7392                      .dwattr $C$DW$928, DW_AT_data_member_location[DW_OP_plus_uconst 0x3]
    7393                      .dwattr $C$DW$928, DW_AT_accessibility(DW_ACCESS_public)
    7394              $C$DW$929       .dwtag  DW_TAG_member
    7395                      .dwattr $C$DW$929, DW_AT_type(*$C$DW$T$25)
    7396                      .dwattr $C$DW$929, DW_AT_name("FSTDBYWAIT")
    7397                      .dwattr $C$DW$929, DW_AT_TI_symbol_name("_FSTDBYWAIT")
    7398                      .dwattr $C$DW$929, DW_AT_data_member_location[DW_OP_plus_uconst 0x4]
    7399                      .dwattr $C$DW$929, DW_AT_accessibility(DW_ACCESS_public)
    7400              $C$DW$930       .dwtag  DW_TAG_member
    7401                      .dwattr $C$DW$930, DW_AT_type(*$C$DW$T$25)
    7402                      .dwattr $C$DW$930, DW_AT_name("FACTIVEWAIT")
    7403                      .dwattr $C$DW$930, DW_AT_TI_symbol_name("_FACTIVEWAIT")
