TMS320C2000 Assembler PC v6.2.5 Tue Nov 21 22:57:45 2017

Tools Copyright (c) 1996-2014 Texas Instruments Incorporated
C:\Users\wmj\AppData\Local\Temp\1055210                              PAGE    1

       1              ;***************************************************************
       2              ;* TMS320C2000 C/C++ Codegen                         PC v6.2.5 *
       3              ;* Date/Time created: Tue Nov 21 22:57:45 2017                 *
       4              ;***************************************************************
       5                      .compiler_opts --float_support=softlib --hll_source=on --mem_model:code=flat --mem_model:data=large -
       6        0002  FP      .set    XAR2
       7              
       8              $C$DW$CU        .dwtag  DW_TAG_compile_unit
       9                      .dwattr $C$DW$CU, DW_AT_name("D:/BM1000_v1.1/sw/solutions/instaspin/src/proj_bm1000.c")
      10                      .dwattr $C$DW$CU, DW_AT_producer("TMS320C2000 C/C++ Codegen PC v6.2.5 Copyright (c) 1996-2014 Texas I
      11                      .dwattr $C$DW$CU, DW_AT_TI_version(0x01)
      12                      .dwattr $C$DW$CU, DW_AT_comp_dir("D:\BM1000_v1.1\sw\solutions\instaspin_foc\boards\hvkit_rev1p1\f28x\
      13              ;**************************************************************
      14              ;* CINIT RECORDS                                              *

    3023              $C$DW$549       .dwtag  DW_TAG_enumerator, DW_AT_name("GPIO_Number_17"), DW_AT_const_value(0x11)
    3024              $C$DW$550       .dwtag  DW_TAG_enumerator, DW_AT_name("GPIO_Number_18"), DW_AT_const_value(0x12)
    3025              $C$DW$551       .dwtag  DW_TAG_enumerator, DW_AT_name("GPIO_Number_19"), DW_AT_const_value(0x13)
    3026              $C$DW$552       .dwtag  DW_TAG_enumerator, DW_AT_name("GPIO_Rsvd_20"), DW_AT_const_value(0x14)
    3027              $C$DW$553       .dwtag  DW_TAG_enumerator, DW_AT_name("GPIO_Rsvd_21"), DW_AT_const_value(0x15)
    3028              $C$DW$554       .dwtag  DW_TAG_enumerator, DW_AT_name("GPIO_Rsvd_22"), DW_AT_const_value(0x16)
    3029              $C$DW$555       .dwtag  DW_TAG_enumerator, DW_AT_name("GPIO_Rsvd_23"), DW_AT_const_value(0x17)
    3030              $C$DW$556       .dwtag  DW_TAG_enumerator, DW_AT_name("GPIO_Rsvd_24"), DW_AT_const_value(0x18)
    3031              $C$DW$557       .dwtag  DW_TAG_enumerator, DW_AT_name("GPIO_Rsvd_25"), DW_AT_const_value(0x19)
    3032              $C$DW$558       .dwtag  DW_TAG_enumerator, DW_AT_name("GPIO_Rsvd_26"), DW_AT_const_value(0x1a)
    3033              $C$DW$559       .dwtag  DW_TAG_enumerator, DW_AT_name("GPIO_Rsvd_27"), DW_AT_const_value(0x1b)
    3034              $C$DW$560       .dwtag  DW_TAG_enumerator, DW_AT_name("GPIO_Number_28"), DW_AT_const_value(0x1c)
    3035              $C$DW$561       .dwtag  DW_TAG_enumerator, DW_AT_name("GPIO_Number_29"), DW_AT_const_value(0x1d)
    3036              $C$DW$562       .dwtag  DW_TAG_enumerator, DW_AT_name("GPIO_Rsvd_30"), DW_AT_const_value(0x1e)
    3037              $C$DW$563       .dwtag  DW_TAG_enumerator, DW_AT_name("GPIO_Rsvd_31"), DW_AT_const_value(0x1f)
    3038              $C$DW$564       .dwtag  DW_TAG_enumerator, DW_AT_name("GPIO_Number_32"), DW_AT_const_value(0x20)
    3039              $C$DW$565       .dwtag  DW_TAG_enumerator, DW_AT_name("GPIO_Number_33"), DW_AT_const_value(0x21)
    3040              $C$DW$566       .dwtag  DW_TAG_enumerator, DW_AT_name("GPIO_Number_34"), DW_AT_const_value(0x22)
    3041              $C$DW$567       .dwtag  DW_TAG_enumerator, DW_AT_name("GPIO_Number_35"), DW_AT_const_value(0x23)
    3042              $C$DW$568       .dwtag  DW_TAG_enumerator, DW_AT_name("GPIO_Number_36"), DW_AT_const_value(0x24)
    3043              $C$DW$569       .dwtag  DW_TAG_enumerator, DW_AT_name("GPIO_Number_37"), DW_AT_const_value(0x25)
    3044              $C$DW$570       .dwtag  DW_TAG_enumerator, DW_AT_name("GPIO_Number_38"), DW_AT_const_value(0x26)
    3045              $C$DW$571       .dwtag  DW_TAG_enumerator, DW_AT_name("GPIO_numGpios"), DW_AT_const_value(0x27)
    3046                      .dwendtag $C$DW$T$251
    3047              
    3048              $C$DW$T$252     .dwtag  DW_TAG_typedef, DW_AT_name("GPIO_Number_e")
    3049                      .dwattr $C$DW$T$252, DW_AT_type(*$C$DW$T$251)
    3050                      .dwattr $C$DW$T$252, DW_AT_language(DW_LANG_C)
    3051              $C$DW$572       .dwtag  DW_TAG_TI_far_type
    3052                      .dwattr $C$DW$572, DW_AT_type(*$C$DW$T$252)
    3053              $C$DW$T$253     .dwtag  DW_TAG_const_type
    3054                      .dwattr $C$DW$T$253, DW_AT_type(*$C$DW$572)
    3055              
    3056              $C$DW$T$254     .dwtag  DW_TAG_enumeration_type
    3057                      .dwattr $C$DW$T$254, DW_AT_byte_size(0x01)
    3058              $C$DW$573       .dwtag  DW_TAG_enumerator, DW_AT_name("PIE_GroupNumber_1"), DW_AT_const_value(0x00)
    3059              $C$DW$574       .dwtag  DW_TAG_enumerator, DW_AT_name("PIE_GroupNumber_2"), DW_AT_const_value(0x01)
    3060              $C$DW$575       .dwtag  DW_TAG_enumerator, DW_AT_name("PIE_GroupNumber_3"), DW_AT_const_value(0x02)
    3061              $C$DW$576       .dwtag  DW_TAG_enumerator, DW_AT_name("PIE_GroupNumber_4"), DW_AT_const_value(0x03)
    3062              $C$DW$577       .dwtag  DW_TAG_enumerator, DW_AT_name("PIE_GroupNumber_5"), DW_AT_const_value(0x04)
    3063              $C$DW$578       .dwtag  DW_TAG_enumerator, DW_AT_name("PIE_GroupNumber_6"), DW_AT_const_value(0x05)
    3064              $C$DW$579       .dwtag  DW_TAG_enumerator, DW_AT_name("PIE_GroupNumber_7"), DW_AT_const_value(0x06)
    3065              $C$DW$580       .dwtag  DW_TAG_enumerator, DW_AT_name("PIE_GroupNumber_8"), DW_AT_const_value(0x07)
    3066              $C$DW$581       .dwtag  DW_TAG_enumerator, DW_AT_name("PIE_GroupNumber_9"), DW_AT_const_value(0x08)
    3067              $C$DW$582       .dwtag  DW_TAG_enumerator, DW_AT_name("PIE_GroupNumber_10"), DW_AT_const_value(0x09)
TMS320C2000 Assembler PC v6.2.5 Tue Nov 21 22:57:45 2017

Tools Copyright (c) 1996-2014 Texas Instruments Incorporated
C:\Users\wmj\AppData\Local\Temp\1055210                              PAGE   60

    3068              $C$DW$583       .dwtag  DW_TAG_enumerator, DW_AT_name("PIE_GroupNumber_11"), DW_AT_const_value(0x0a)
    3069              $C$DW$584       .dwtag  DW_TAG_enumerator, DW_AT_name("PIE_GroupNumber_12"), DW_AT_const_value(0x0b)
    3070                      .dwendtag $C$DW$T$254
    3071              
    3072              $C$DW$T$255     .dwtag  DW_TAG_typedef, DW_AT_name("PIE_GroupNumber_e")
    3073                      .dwattr $C$DW$T$255, DW_AT_type(*$C$DW$T$254)
    3074                      .dwattr $C$DW$T$255, DW_AT_language(DW_LANG_C)
    3075              
    3076              $C$DW$T$30      .dwtag  DW_TAG_structure_type
    3077                      .dwattr $C$DW$T$30, DW_AT_name("_ADC_Obj_")
    3078                      .dwattr $C$DW$T$30, DW_AT_byte_size(0x6650)
    3079              $C$DW$585       .dwtag  DW_TAG_member
    3080                      .dwattr $C$DW$585, DW_AT_type(*$C$DW$T$24)
    3081                      .dwattr $C$DW$585, DW_AT_name("ADCRESULT")
    3082                      .dwattr $C$DW$585, DW_AT_TI_symbol_name("_ADCRESULT")
    3083                      .dwattr $C$DW$585, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    3084                      .dwattr $C$DW$585, DW_AT_accessibility(DW_ACCESS_public)
    3085              $C$DW$586       .dwtag  DW_TAG_member
    3086                      .dwattr $C$DW$586, DW_AT_type(*$C$DW$T$25)
    3087                      .dwattr $C$DW$586, DW_AT_name("resvd_1")
    3088                      .dwattr $C$DW$586, DW_AT_TI_symbol_name("_resvd_1")
    3089                      .dwattr $C$DW$586, DW_AT_data_member_location[DW_OP_plus_uconst 0x10]
    3090                      .dwattr $C$DW$586, DW_AT_accessibility(DW_ACCESS_public)
    3091              $C$DW$587       .dwtag  DW_TAG_member
    3092                      .dwattr $C$DW$587, DW_AT_type(*$C$DW$T$23)
    3093                      .dwattr $C$DW$587, DW_AT_name("ADCCTL1")
    3094                      .dwattr $C$DW$587, DW_AT_TI_symbol_name("_ADCCTL1")
    3095                      .dwattr $C$DW$587, DW_AT_data_member_location[DW_OP_plus_uconst 0x6600]
    3096                      .dwattr $C$DW$587, DW_AT_accessibility(DW_ACCESS_public)
    3097              $C$DW$588       .dwtag  DW_TAG_member
    3098                      .dwattr $C$DW$588, DW_AT_type(*$C$DW$T$23)
    3099                      .dwattr $C$DW$588, DW_AT_name("ADCCTL2")
    3100                      .dwattr $C$DW$588, DW_AT_TI_symbol_name("_ADCCTL2")
    3101                      .dwattr $C$DW$588, DW_AT_data_member_location[DW_OP_plus_uconst 0x6601]
    3102                      .dwattr $C$DW$588, DW_AT_accessibility(DW_ACCESS_public)
    3103              $C$DW$589       .dwtag  DW_TAG_member
    3104                      .dwattr $C$DW$589, DW_AT_type(*$C$DW$T$26)
    3105                      .dwattr $C$DW$589, DW_AT_name("rsvd_2")
    3106                      .dwattr $C$DW$589, DW_AT_TI_symbol_name("_rsvd_2")
    3107                      .dwattr $C$DW$589, DW_AT_data_member_location[DW_OP_plus_uconst 0x6602]
    3108                      .dwattr $C$DW$589, DW_AT_accessibility(DW_ACCESS_public)
    3109              $C$DW$590       .dwtag  DW_TAG_member
    3110                      .dwattr $C$DW$590, DW_AT_type(*$C$DW$T$23)
    3111                      .dwattr $C$DW$590, DW_AT_name("ADCINTFLG")
    3112                      .dwattr $C$DW$590, DW_AT_TI_symbol_name("_ADCINTFLG")
    3113                      .dwattr $C$DW$590, DW_AT_data_member_location[DW_OP_plus_uconst 0x6604]
    3114                      .dwattr $C$DW$590, DW_AT_accessibility(DW_ACCESS_public)
    3115              $C$DW$591       .dwtag  DW_TAG_member
    3116                      .dwattr $C$DW$591, DW_AT_type(*$C$DW$T$23)
    3117                      .dwattr $C$DW$591, DW_AT_name("ADCINTFLGCLR")
    3118                      .dwattr $C$DW$591, DW_AT_TI_symbol_name("_ADCINTFLGCLR")
    3119                      .dwattr $C$DW$591, DW_AT_data_member_location[DW_OP_plus_uconst 0x6605]
    3120                      .dwattr $C$DW$591, DW_AT_accessibility(DW_ACCESS_public)
    3121              $C$DW$592       .dwtag  DW_TAG_member
    3122                      .dwattr $C$DW$592, DW_AT_type(*$C$DW$T$23)
TMS320C2000 Assembler PC v6.2.5 Tue Nov 21 22:57:45 2017

Tools Copyright (c) 1996-2014 Texas Instruments Incorporated
C:\Users\wmj\AppData\Local\Temp\1055210                              PAGE   61

    3123                      .dwattr $C$DW$592, DW_AT_name("ADCINTOVF")
    3124                      .dwattr $C$DW$592, DW_AT_TI_symbol_name("_ADCINTOVF")
    3125                      .dwattr $C$DW$592, DW_AT_data_member_location[DW_OP_plus_uconst 0x6606]
    3126                      .dwattr $C$DW$592, DW_AT_accessibility(DW_ACCESS_public)
    3127              $C$DW$593       .dwtag  DW_TAG_member
    3128                      .dwattr $C$DW$593, DW_AT_type(*$C$DW$T$23)
    3129                      .dwattr $C$DW$593, DW_AT_name("ADCINTOVFCLR")
    3130                      .dwattr $C$DW$593, DW_AT_TI_symbol_name("_ADCINTOVFCLR")
    3131                      .dwattr $C$DW$593, DW_AT_data_member_location[DW_OP_plus_uconst 0x6607]
    3132                      .dwattr $C$DW$593, DW_AT_accessibility(DW_ACCESS_public)
    3133              $C$DW$594       .dwtag  DW_TAG_member
    3134                      .dwattr $C$DW$594, DW_AT_type(*$C$DW$T$27)
    3135                      .dwattr $C$DW$594, DW_AT_name("INTSELxNy")
    3136                      .dwattr $C$DW$594, DW_AT_TI_symbol_name("_INTSELxNy")
    3137                      .dwattr $C$DW$594, DW_AT_data_member_location[DW_OP_plus_uconst 0x6608]
    3138                      .dwattr $C$DW$594, DW_AT_accessibility(DW_ACCESS_public)
    3139              $C$DW$595       .dwtag  DW_TAG_member
    3140                      .dwattr $C$DW$595, DW_AT_type(*$C$DW$T$28)
    3141                      .dwattr $C$DW$595, DW_AT_name("rsvd_3")
    3142                      .dwattr $C$DW$595, DW_AT_TI_symbol_name("_rsvd_3")
    3143                      .dwattr $C$DW$595, DW_AT_data_member_location[DW_OP_plus_uconst 0x660d]
    3144                      .dwattr $C$DW$595, DW_AT_accessibility(DW_ACCESS_public)
    3145              $C$DW$596       .dwtag  DW_TAG_member
    3146                      .dwattr $C$DW$596, DW_AT_type(*$C$DW$T$23)
    3147                      .dwattr $C$DW$596, DW_AT_name("SOCPRICTRL")
    3148                      .dwattr $C$DW$596, DW_AT_TI_symbol_name("_SOCPRICTRL")
    3149                      .dwattr $C$DW$596, DW_AT_data_member_location[DW_OP_plus_uconst 0x6610]
    3150                      .dwattr $C$DW$596, DW_AT_accessibility(DW_ACCESS_public)
    3151              $C$DW$597       .dwtag  DW_TAG_member
    3152                      .dwattr $C$DW$597, DW_AT_type(*$C$DW$T$23)
    3153                      .dwattr $C$DW$597, DW_AT_name("rsvd_4")
    3154                      .dwattr $C$DW$597, DW_AT_TI_symbol_name("_rsvd_4")
    3155                      .dwattr $C$DW$597, DW_AT_data_member_location[DW_OP_plus_uconst 0x6611]
    3156                      .dwattr $C$DW$597, DW_AT_accessibility(DW_ACCESS_public)
    3157              $C$DW$598       .dwtag  DW_TAG_member
    3158                      .dwattr $C$DW$598, DW_AT_type(*$C$DW$T$23)
    3159                      .dwattr $C$DW$598, DW_AT_name("ADCSAMPLEMODE")
    3160                      .dwattr $C$DW$598, DW_AT_TI_symbol_name("_ADCSAMPLEMODE")
    3161                      .dwattr $C$DW$598, DW_AT_data_member_location[DW_OP_plus_uconst 0x6612]
    3162                      .dwattr $C$DW$598, DW_AT_accessibility(DW_ACCESS_public)
    3163              $C$DW$599       .dwtag  DW_TAG_member
    3164                      .dwattr $C$DW$599, DW_AT_type(*$C$DW$T$23)
    3165                      .dwattr $C$DW$599, DW_AT_name("rsvd_5")
    3166                      .dwattr $C$DW$599, DW_AT_TI_symbol_name("_rsvd_5")
    3167                      .dwattr $C$DW$599, DW_AT_data_member_location[DW_OP_plus_uconst 0x6613]
    3168                      .dwattr $C$DW$599, DW_AT_accessibility(DW_ACCESS_public)
    3169              $C$DW$600       .dwtag  DW_TAG_member
    3170                      .dwattr $C$DW$600, DW_AT_type(*$C$DW$T$23)
    3171                      .dwattr $C$DW$600, DW_AT_name("ADCINTSOCSEL1")
    3172                      .dwattr $C$DW$600, DW_AT_TI_symbol_name("_ADCINTSOCSEL1")
    3173                      .dwattr $C$DW$600, DW_AT_data_member_location[DW_OP_plus_uconst 0x6614]
    3174                      .dwattr $C$DW$600, DW_AT_accessibility(DW_ACCESS_public)
    3175              $C$DW$601       .dwtag  DW_TAG_member
    3176                      .dwattr $C$DW$601, DW_AT_type(*$C$DW$T$23)
    3177                      .dwattr $C$DW$601, DW_AT_name("ADCINTSOCSEL2")
TMS320C2000 Assembler PC v6.2.5 Tue Nov 21 22:57:45 2017

Tools Copyright (c) 1996-2014 Texas Instruments Incorporated
C:\Users\wmj\AppData\Local\Temp\1055210                              PAGE   62

    3178                      .dwattr $C$DW$601, DW_AT_TI_symbol_name("_ADCINTSOCSEL2")
    3179                      .dwattr $C$DW$601, DW_AT_data_member_location[DW_OP_plus_uconst 0x6615]
    3180                      .dwattr $C$DW$601, DW_AT_accessibility(DW_ACCESS_public)
    3181              $C$DW$602       .dwtag  DW_TAG_member
    3182                      .dwattr $C$DW$602, DW_AT_type(*$C$DW$T$26)
    3183                      .dwattr $C$DW$602, DW_AT_name("rsvd_6")
    3184                      .dwattr $C$DW$602, DW_AT_TI_symbol_name("_rsvd_6")
    3185                      .dwattr $C$DW$602, DW_AT_data_member_location[DW_OP_plus_uconst 0x6616]
    3186                      .dwattr $C$DW$602, DW_AT_accessibility(DW_ACCESS_public)
    3187              $C$DW$603       .dwtag  DW_TAG_member
    3188                      .dwattr $C$DW$603, DW_AT_type(*$C$DW$T$23)
    3189                      .dwattr $C$DW$603, DW_AT_name("ADCSOCFLG1")
    3190                      .dwattr $C$DW$603, DW_AT_TI_symbol_name("_ADCSOCFLG1")
    3191                      .dwattr $C$DW$603, DW_AT_data_member_location[DW_OP_plus_uconst 0x6618]
    3192                      .dwattr $C$DW$603, DW_AT_accessibility(DW_ACCESS_public)
    3193              $C$DW$604       .dwtag  DW_TAG_member
    3194                      .dwattr $C$DW$604, DW_AT_type(*$C$DW$T$23)
    3195                      .dwattr $C$DW$604, DW_AT_name("rsvd_7")
    3196                      .dwattr $C$DW$604, DW_AT_TI_symbol_name("_rsvd_7")
    3197                      .dwattr $C$DW$604, DW_AT_data_member_location[DW_OP_plus_uconst 0x6619]
    3198                      .dwattr $C$DW$604, DW_AT_accessibility(DW_ACCESS_public)
    3199              $C$DW$605       .dwtag  DW_TAG_member
    3200                      .dwattr $C$DW$605, DW_AT_type(*$C$DW$T$23)
    3201                      .dwattr $C$DW$605, DW_AT_name("ADCSOCFRC1")
    3202                      .dwattr $C$DW$605, DW_AT_TI_symbol_name("_ADCSOCFRC1")
    3203                      .dwattr $C$DW$605, DW_AT_data_member_location[DW_OP_plus_uconst 0x661a]
    3204                      .dwattr $C$DW$605, DW_AT_accessibility(DW_ACCESS_public)
    3205              $C$DW$606       .dwtag  DW_TAG_member
    3206                      .dwattr $C$DW$606, DW_AT_type(*$C$DW$T$23)
    3207                      .dwattr $C$DW$606, DW_AT_name("rsvd_8")
    3208                      .dwattr $C$DW$606, DW_AT_TI_symbol_name("_rsvd_8")
    3209                      .dwattr $C$DW$606, DW_AT_data_member_location[DW_OP_plus_uconst 0x661b]
    3210                      .dwattr $C$DW$606, DW_AT_accessibility(DW_ACCESS_public)
    3211              $C$DW$607       .dwtag  DW_TAG_member
    3212                      .dwattr $C$DW$607, DW_AT_type(*$C$DW$T$23)
    3213                      .dwattr $C$DW$607, DW_AT_name("ADCSOCOVF1")
    3214                      .dwattr $C$DW$607, DW_AT_TI_symbol_name("_ADCSOCOVF1")
    3215                      .dwattr $C$DW$607, DW_AT_data_member_location[DW_OP_plus_uconst 0x661c]
    3216                      .dwattr $C$DW$607, DW_AT_accessibility(DW_ACCESS_public)
    3217              $C$DW$608       .dwtag  DW_TAG_member
    3218                      .dwattr $C$DW$608, DW_AT_type(*$C$DW$T$23)
    3219                      .dwattr $C$DW$608, DW_AT_name("rsvd_9")
    3220                      .dwattr $C$DW$608, DW_AT_TI_symbol_name("_rsvd_9")
    3221                      .dwattr $C$DW$608, DW_AT_data_member_location[DW_OP_plus_uconst 0x661d]
    3222                      .dwattr $C$DW$608, DW_AT_accessibility(DW_ACCESS_public)
    3223              $C$DW$609       .dwtag  DW_TAG_member
    3224                      .dwattr $C$DW$609, DW_AT_type(*$C$DW$T$23)
    3225                      .dwattr $C$DW$609, DW_AT_name("ADCSOCOVFCLR1")
    3226                      .dwattr $C$DW$609, DW_AT_TI_symbol_name("_ADCSOCOVFCLR1")
    3227                      .dwattr $C$DW$609, DW_AT_data_member_location[DW_OP_plus_uconst 0x661e]
    3228                      .dwattr $C$DW$609, DW_AT_accessibility(DW_ACCESS_public)
    3229              $C$DW$610       .dwtag  DW_TAG_member
    3230                      .dwattr $C$DW$610, DW_AT_type(*$C$DW$T$23)
    3231                      .dwattr $C$DW$610, DW_AT_name("rsvd_10")
    3232                      .dwattr $C$DW$610, DW_AT_TI_symbol_name("_rsvd_10")
TMS320C2000 Assembler PC v6.2.5 Tue Nov 21 22:57:45 2017

Tools Copyright (c) 1996-2014 Texas Instruments Incorporated
C:\Users\wmj\AppData\Local\Temp\1055210                              PAGE   63

    3233                      .dwattr $C$DW$610, DW_AT_data_member_location[DW_OP_plus_uconst 0x661f]
    3234                      .dwattr $C$DW$610, DW_AT_accessibility(DW_ACCESS_public)
    3235              $C$DW$611       .dwtag  DW_TAG_member
    3236                      .dwattr $C$DW$611, DW_AT_type(*$C$DW$T$24)
    3237                      .dwattr $C$DW$611, DW_AT_name("ADCSOCxCTL")
    3238                      .dwattr $C$DW$611, DW_AT_TI_symbol_name("_ADCSOCxCTL")
    3239                      .dwattr $C$DW$611, DW_AT_data_member_location[DW_OP_plus_uconst 0x6620]
    3240                      .dwattr $C$DW$611, DW_AT_accessibility(DW_ACCESS_public)
    3241              $C$DW$612       .dwtag  DW_TAG_member
    3242                      .dwattr $C$DW$612, DW_AT_type(*$C$DW$T$24)
    3243                      .dwattr $C$DW$612, DW_AT_name("rsvd_11")
    3244                      .dwattr $C$DW$612, DW_AT_TI_symbol_name("_rsvd_11")
    3245                      .dwattr $C$DW$612, DW_AT_data_member_location[DW_OP_plus_uconst 0x6630]
    3246                      .dwattr $C$DW$612, DW_AT_accessibility(DW_ACCESS_public)
    3247              $C$DW$613       .dwtag  DW_TAG_member
    3248                      .dwattr $C$DW$613, DW_AT_type(*$C$DW$T$23)
    3249                      .dwattr $C$DW$613, DW_AT_name("ADCREFTRIM")
    3250                      .dwattr $C$DW$613, DW_AT_TI_symbol_name("_ADCREFTRIM")
    3251                      .dwattr $C$DW$613, DW_AT_data_member_location[DW_OP_plus_uconst 0x6640]
    3252                      .dwattr $C$DW$613, DW_AT_accessibility(DW_ACCESS_public)
    3253              $C$DW$614       .dwtag  DW_TAG_member
    3254                      .dwattr $C$DW$614, DW_AT_type(*$C$DW$T$23)
    3255                      .dwattr $C$DW$614, DW_AT_name("ADCOFFTRIM")
    3256                      .dwattr $C$DW$614, DW_AT_TI_symbol_name("_ADCOFFTRIM")
    3257                      .dwattr $C$DW$614, DW_AT_data_member_location[DW_OP_plus_uconst 0x6641]
    3258                      .dwattr $C$DW$614, DW_AT_accessibility(DW_ACCESS_public)
    3259              $C$DW$615       .dwtag  DW_TAG_member
    3260                      .dwattr $C$DW$615, DW_AT_type(*$C$DW$T$29)
    3261                      .dwattr $C$DW$615, DW_AT_name("resvd_12")
    3262                      .dwattr $C$DW$615, DW_AT_TI_symbol_name("_resvd_12")
    3263                      .dwattr $C$DW$615, DW_AT_data_member_location[DW_OP_plus_uconst 0x6642]
    3264                      .dwattr $C$DW$615, DW_AT_accessibility(DW_ACCESS_public)
    3265              $C$DW$616       .dwtag  DW_TAG_member
    3266                      .dwattr $C$DW$616, DW_AT_type(*$C$DW$T$23)
    3267                      .dwattr $C$DW$616, DW_AT_name("ADCREV")
    3268                      .dwattr $C$DW$616, DW_AT_TI_symbol_name("_ADCREV")
    3269                      .dwattr $C$DW$616, DW_AT_data_member_location[DW_OP_plus_uconst 0x664f]
    3270                      .dwattr $C$DW$616, DW_AT_accessibility(DW_ACCESS_public)
    3271                      .dwendtag $C$DW$T$30
    3272              
    3273              $C$DW$T$257     .dwtag  DW_TAG_typedef, DW_AT_name("ADC_Obj")
    3274                      .dwattr $C$DW$T$257, DW_AT_type(*$C$DW$T$30)
    3275                      .dwattr $C$DW$T$257, DW_AT_language(DW_LANG_C)
    3276              $C$DW$T$118     .dwtag  DW_TAG_pointer_type
    3277                      .dwattr $C$DW$T$118, DW_AT_type(*$C$DW$T$30)
    3278                      .dwattr $C$DW$T$118, DW_AT_address_class(0x16)
    3279              $C$DW$T$119     .dwtag  DW_TAG_typedef, DW_AT_name("ADC_Handle")
    3280                      .dwattr $C$DW$T$119, DW_AT_type(*$C$DW$T$118)
    3281                      .dwattr $C$DW$T$119, DW_AT_language(DW_LANG_C)
    3282              
    3283              $C$DW$T$34      .dwtag  DW_TAG_structure_type
    3284                      .dwattr $C$DW$T$34, DW_AT_name("_BRAKE_Obj_")
    3285                      .dwattr $C$DW$T$34, DW_AT_byte_size(0x08)
    3286              $C$DW$617       .dwtag  DW_TAG_member
    3287                      .dwattr $C$DW$617, DW_AT_type(*$C$DW$T$31)
TMS320C2000 Assembler PC v6.2.5 Tue Nov 21 22:57:45 2017

Tools Copyright (c) 1996-2014 Texas Instruments Incorporated
C:\Users\wmj\AppData\Local\Temp\1055210                              PAGE   64

    3288                      .dwattr $C$DW$617, DW_AT_name("angle_pu")
    3289                      .dwattr $C$DW$617, DW_AT_TI_symbol_name("_angle_pu")
    3290                      .dwattr $C$DW$617, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    3291                      .dwattr $C$DW$617, DW_AT_accessibility(DW_ACCESS_public)
    3292              $C$DW$618       .dwtag  DW_TAG_member
    3293                      .dwattr $C$DW$618, DW_AT_type(*$C$DW$T$32)
    3294                      .dwattr $C$DW$618, DW_AT_name("Idq_brake")
    3295                      .dwattr $C$DW$618, DW_AT_TI_symbol_name("_Idq_brake")
    3296                      .dwattr $C$DW$618, DW_AT_data_member_location[DW_OP_plus_uconst 0x2]
    3297                      .dwattr $C$DW$618, DW_AT_accessibility(DW_ACCESS_public)
    3298              $C$DW$619       .dwtag  DW_TAG_member
    3299                      .dwattr $C$DW$619, DW_AT_type(*$C$DW$T$33)
    3300                      .dwattr $C$DW$619, DW_AT_name("brake_enable")
    3301                      .dwattr $C$DW$619, DW_AT_TI_symbol_name("_brake_enable")
    3302                      .dwattr $C$DW$619, DW_AT_data_member_location[DW_OP_plus_uconst 0x6]
    3303                      .dwattr $C$DW$619, DW_AT_accessibility(DW_ACCESS_public)
    3304                      .dwendtag $C$DW$T$34
    3305              
    3306              $C$DW$T$73      .dwtag  DW_TAG_typedef, DW_AT_name("BRAKE_Obj")
    3307                      .dwattr $C$DW$T$73, DW_AT_type(*$C$DW$T$34)
    3308                      .dwattr $C$DW$T$73, DW_AT_language(DW_LANG_C)
    3309              $C$DW$T$71      .dwtag  DW_TAG_pointer_type
    3310                      .dwattr $C$DW$T$71, DW_AT_type(*$C$DW$T$34)
    3311                      .dwattr $C$DW$T$71, DW_AT_address_class(0x16)
    3312              $C$DW$T$72      .dwtag  DW_TAG_typedef, DW_AT_name("BRAKE_Handle")
    3313                      .dwattr $C$DW$T$72, DW_AT_type(*$C$DW$T$71)
    3314                      .dwattr $C$DW$T$72, DW_AT_language(DW_LANG_C)
    3315              
    3316              $C$DW$T$36      .dwtag  DW_TAG_structure_type
    3317                      .dwattr $C$DW$T$36, DW_AT_name("_CLARKE_Obj_")
    3318                      .dwattr $C$DW$T$36, DW_AT_byte_size(0x06)
    3319              $C$DW$620       .dwtag  DW_TAG_member
    3320                      .dwattr $C$DW$620, DW_AT_type(*$C$DW$T$31)
    3321                      .dwattr $C$DW$620, DW_AT_name("alpha_sf")
    3322                      .dwattr $C$DW$620, DW_AT_TI_symbol_name("_alpha_sf")
    3323                      .dwattr $C$DW$620, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    3324                      .dwattr $C$DW$620, DW_AT_accessibility(DW_ACCESS_public)
    3325              $C$DW$621       .dwtag  DW_TAG_member
    3326                      .dwattr $C$DW$621, DW_AT_type(*$C$DW$T$31)
    3327                      .dwattr $C$DW$621, DW_AT_name("beta_sf")
    3328                      .dwattr $C$DW$621, DW_AT_TI_symbol_name("_beta_sf")
    3329                      .dwattr $C$DW$621, DW_AT_data_member_location[DW_OP_plus_uconst 0x2]
    3330                      .dwattr $C$DW$621, DW_AT_accessibility(DW_ACCESS_public)
    3331              $C$DW$622       .dwtag  DW_TAG_member
    3332                      .dwattr $C$DW$622, DW_AT_type(*$C$DW$T$35)
    3333                      .dwattr $C$DW$622, DW_AT_name("numSensors")
    3334                      .dwattr $C$DW$622, DW_AT_TI_symbol_name("_numSensors")
    3335                      .dwattr $C$DW$622, DW_AT_data_member_location[DW_OP_plus_uconst 0x4]
    3336                      .dwattr $C$DW$622, DW_AT_accessibility(DW_ACCESS_public)
    3337                      .dwendtag $C$DW$T$36
    3338              
    3339              $C$DW$T$47      .dwtag  DW_TAG_typedef, DW_AT_name("CLARKE_Obj")
    3340                      .dwattr $C$DW$T$47, DW_AT_type(*$C$DW$T$36)
    3341                      .dwattr $C$DW$T$47, DW_AT_language(DW_LANG_C)
    3342              $C$DW$T$45      .dwtag  DW_TAG_pointer_type
TMS320C2000 Assembler PC v6.2.5 Tue Nov 21 22:57:45 2017

Tools Copyright (c) 1996-2014 Texas Instruments Incorporated
C:\Users\wmj\AppData\Local\Temp\1055210                              PAGE   65

    3343                      .dwattr $C$DW$T$45, DW_AT_type(*$C$DW$T$36)
    3344                      .dwattr $C$DW$T$45, DW_AT_address_class(0x16)
    3345              $C$DW$T$46      .dwtag  DW_TAG_typedef, DW_AT_name("CLARKE_Handle")
    3346                      .dwattr $C$DW$T$46, DW_AT_type(*$C$DW$T$45)
    3347                      .dwattr $C$DW$T$46, DW_AT_language(DW_LANG_C)
    3348              
    3349              $C$DW$T$38      .dwtag  DW_TAG_structure_type
    3350                      .dwattr $C$DW$T$38, DW_AT_name("_CLK_Obj_")
    3351                      .dwattr $C$DW$T$38, DW_AT_byte_size(0x11)
    3352              $C$DW$623       .dwtag  DW_TAG_member
    3353                      .dwattr $C$DW$623, DW_AT_type(*$C$DW$T$23)
    3354                      .dwattr $C$DW$623, DW_AT_name("XCLK")
    3355                      .dwattr $C$DW$623, DW_AT_TI_symbol_name("_XCLK")
    3356                      .dwattr $C$DW$623, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    3357                      .dwattr $C$DW$623, DW_AT_accessibility(DW_ACCESS_public)
    3358              $C$DW$624       .dwtag  DW_TAG_member
    3359                      .dwattr $C$DW$624, DW_AT_type(*$C$DW$T$23)
    3360                      .dwattr $C$DW$624, DW_AT_name("rsvd_1")
    3361                      .dwattr $C$DW$624, DW_AT_TI_symbol_name("_rsvd_1")
    3362                      .dwattr $C$DW$624, DW_AT_data_member_location[DW_OP_plus_uconst 0x1]
    3363                      .dwattr $C$DW$624, DW_AT_accessibility(DW_ACCESS_public)
    3364              $C$DW$625       .dwtag  DW_TAG_member
    3365                      .dwattr $C$DW$625, DW_AT_type(*$C$DW$T$23)
    3366                      .dwattr $C$DW$625, DW_AT_name("CLKCTL")
    3367                      .dwattr $C$DW$625, DW_AT_TI_symbol_name("_CLKCTL")
    3368                      .dwattr $C$DW$625, DW_AT_data_member_location[DW_OP_plus_uconst 0x2]
    3369                      .dwattr $C$DW$625, DW_AT_accessibility(DW_ACCESS_public)
    3370              $C$DW$626       .dwtag  DW_TAG_member
    3371                      .dwattr $C$DW$626, DW_AT_type(*$C$DW$T$37)
    3372                      .dwattr $C$DW$626, DW_AT_name("rsvd_2")
    3373                      .dwattr $C$DW$626, DW_AT_TI_symbol_name("_rsvd_2")
    3374                      .dwattr $C$DW$626, DW_AT_data_member_location[DW_OP_plus_uconst 0x3]
    3375                      .dwattr $C$DW$626, DW_AT_accessibility(DW_ACCESS_public)
    3376              $C$DW$627       .dwtag  DW_TAG_member
    3377                      .dwattr $C$DW$627, DW_AT_type(*$C$DW$T$23)
    3378                      .dwattr $C$DW$627, DW_AT_name("LOSPCP")
    3379                      .dwattr $C$DW$627, DW_AT_TI_symbol_name("_LOSPCP")
    3380                      .dwattr $C$DW$627, DW_AT_data_member_location[DW_OP_plus_uconst 0xb]
    3381                      .dwattr $C$DW$627, DW_AT_accessibility(DW_ACCESS_public)
    3382              $C$DW$628       .dwtag  DW_TAG_member
    3383                      .dwattr $C$DW$628, DW_AT_type(*$C$DW$T$23)
    3384                      .dwattr $C$DW$628, DW_AT_name("PCLKCR0")
    3385                      .dwattr $C$DW$628, DW_AT_TI_symbol_name("_PCLKCR0")
    3386                      .dwattr $C$DW$628, DW_AT_data_member_location[DW_OP_plus_uconst 0xc]
    3387                      .dwattr $C$DW$628, DW_AT_accessibility(DW_ACCESS_public)
    3388              $C$DW$629       .dwtag  DW_TAG_member
    3389                      .dwattr $C$DW$629, DW_AT_type(*$C$DW$T$23)
    3390                      .dwattr $C$DW$629, DW_AT_name("PCLKCR1")
    3391                      .dwattr $C$DW$629, DW_AT_TI_symbol_name("_PCLKCR1")
    3392                      .dwattr $C$DW$629, DW_AT_data_member_location[DW_OP_plus_uconst 0xd]
    3393                      .dwattr $C$DW$629, DW_AT_accessibility(DW_ACCESS_public)
    3394              $C$DW$630       .dwtag  DW_TAG_member
    3395                      .dwattr $C$DW$630, DW_AT_type(*$C$DW$T$26)
    3396                      .dwattr $C$DW$630, DW_AT_name("rsvd_3")
    3397                      .dwattr $C$DW$630, DW_AT_TI_symbol_name("_rsvd_3")
TMS320C2000 Assembler PC v6.2.5 Tue Nov 21 22:57:45 2017

Tools Copyright (c) 1996-2014 Texas Instruments Incorporated
C:\Users\wmj\AppData\Local\Temp\1055210                              PAGE   66

    3398                      .dwattr $C$DW$630, DW_AT_data_member_location[DW_OP_plus_uconst 0xe]
    3399                      .dwattr $C$DW$630, DW_AT_accessibility(DW_ACCESS_public)
    3400              $C$DW$631       .dwtag  DW_TAG_member
    3401                      .dwattr $C$DW$631, DW_AT_type(*$C$DW$T$23)
    3402                      .dwattr $C$DW$631, DW_AT_name("PCLKCR3")
    3403                      .dwattr $C$DW$631, DW_AT_TI_symbol_name("_PCLKCR3")
    3404                      .dwattr $C$DW$631, DW_AT_data_member_location[DW_OP_plus_uconst 0x10]
    3405                      .dwattr $C$DW$631, DW_AT_accessibility(DW_ACCESS_public)
    3406                      .dwendtag $C$DW$T$38
    3407              
    3408              $C$DW$T$120     .dwtag  DW_TAG_pointer_type
    3409                      .dwattr $C$DW$T$120, DW_AT_type(*$C$DW$T$38)
    3410                      .dwattr $C$DW$T$120, DW_AT_address_class(0x16)
    3411              $C$DW$T$121     .dwtag  DW_TAG_typedef, DW_AT_name("CLK_Handle")
    3412                      .dwattr $C$DW$T$121, DW_AT_type(*$C$DW$T$120)
    3413                      .dwattr $C$DW$T$121, DW_AT_language(DW_LANG_C)
    3414              
    3415              $C$DW$T$39      .dwtag  DW_TAG_structure_type
    3416                      .dwattr $C$DW$T$39, DW_AT_name("_CPU_Obj_")
    3417                      .dwattr $C$DW$T$39, DW_AT_byte_size(0x01)
    3418              $C$DW$632       .dwtag  DW_TAG_member
    3419                      .dwattr $C$DW$632, DW_AT_type(*$C$DW$T$35)
    3420                      .dwattr $C$DW$632, DW_AT_name("tmp")
    3421                      .dwattr $C$DW$632, DW_AT_TI_symbol_name("_tmp")
    3422                      .dwattr $C$DW$632, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    3423                      .dwattr $C$DW$632, DW_AT_accessibility(DW_ACCESS_public)
    3424                      .dwendtag $C$DW$T$39
    3425              
    3426              $C$DW$T$122     .dwtag  DW_TAG_pointer_type
    3427                      .dwattr $C$DW$T$122, DW_AT_type(*$C$DW$T$39)
    3428                      .dwattr $C$DW$T$122, DW_AT_address_class(0x16)
    3429              $C$DW$T$123     .dwtag  DW_TAG_typedef, DW_AT_name("CPU_Handle")
    3430                      .dwattr $C$DW$T$123, DW_AT_type(*$C$DW$T$122)
    3431                      .dwattr $C$DW$T$123, DW_AT_language(DW_LANG_C)
    3432              
    3433              $C$DW$T$74      .dwtag  DW_TAG_structure_type
    3434                      .dwattr $C$DW$T$74, DW_AT_name("_CTRL_Obj_")
    3435                      .dwattr $C$DW$T$74, DW_AT_byte_size(0x108)
    3436              $C$DW$633       .dwtag  DW_TAG_member
    3437                      .dwattr $C$DW$633, DW_AT_type(*$C$DW$T$40)
    3438                      .dwattr $C$DW$633, DW_AT_name("version")
    3439                      .dwattr $C$DW$633, DW_AT_TI_symbol_name("_version")
    3440                      .dwattr $C$DW$633, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    3441                      .dwattr $C$DW$633, DW_AT_accessibility(DW_ACCESS_public)
    3442              $C$DW$634       .dwtag  DW_TAG_member
    3443                      .dwattr $C$DW$634, DW_AT_type(*$C$DW$T$42)
    3444                      .dwattr $C$DW$634, DW_AT_name("state")
    3445                      .dwattr $C$DW$634, DW_AT_TI_symbol_name("_state")
    3446                      .dwattr $C$DW$634, DW_AT_data_member_location[DW_OP_plus_uconst 0x4]
    3447                      .dwattr $C$DW$634, DW_AT_accessibility(DW_ACCESS_public)
    3448              $C$DW$635       .dwtag  DW_TAG_member
    3449                      .dwattr $C$DW$635, DW_AT_type(*$C$DW$T$42)
    3450                      .dwattr $C$DW$635, DW_AT_name("prevState")
    3451                      .dwattr $C$DW$635, DW_AT_TI_symbol_name("_prevState")
    3452                      .dwattr $C$DW$635, DW_AT_data_member_location[DW_OP_plus_uconst 0x5]
TMS320C2000 Assembler PC v6.2.5 Tue Nov 21 22:57:45 2017

Tools Copyright (c) 1996-2014 Texas Instruments Incorporated
C:\Users\wmj\AppData\Local\Temp\1055210                              PAGE   67

    3453                      .dwattr $C$DW$635, DW_AT_accessibility(DW_ACCESS_public)
    3454              $C$DW$636       .dwtag  DW_TAG_member
    3455                      .dwattr $C$DW$636, DW_AT_type(*$C$DW$T$44)
    3456                      .dwattr $C$DW$636, DW_AT_name("errorCode")
    3457                      .dwattr $C$DW$636, DW_AT_TI_symbol_name("_errorCode")
    3458                      .dwattr $C$DW$636, DW_AT_data_member_location[DW_OP_plus_uconst 0x6]
    3459                      .dwattr $C$DW$636, DW_AT_accessibility(DW_ACCESS_public)
    3460              $C$DW$637       .dwtag  DW_TAG_member
    3461                      .dwattr $C$DW$637, DW_AT_type(*$C$DW$T$46)
    3462                      .dwattr $C$DW$637, DW_AT_name("clarkeHandle_I")
    3463                      .dwattr $C$DW$637, DW_AT_TI_symbol_name("_clarkeHandle_I")
    3464                      .dwattr $C$DW$637, DW_AT_data_member_location[DW_OP_plus_uconst 0x8]
    3465                      .dwattr $C$DW$637, DW_AT_accessibility(DW_ACCESS_public)
    3466              $C$DW$638       .dwtag  DW_TAG_member
    3467                      .dwattr $C$DW$638, DW_AT_type(*$C$DW$T$47)
    3468                      .dwattr $C$DW$638, DW_AT_name("clarke_I")
    3469                      .dwattr $C$DW$638, DW_AT_TI_symbol_name("_clarke_I")
    3470                      .dwattr $C$DW$638, DW_AT_data_member_location[DW_OP_plus_uconst 0xa]
    3471                      .dwattr $C$DW$638, DW_AT_accessibility(DW_ACCESS_public)
    3472              $C$DW$639       .dwtag  DW_TAG_member
    3473                      .dwattr $C$DW$639, DW_AT_type(*$C$DW$T$46)
    3474                      .dwattr $C$DW$639, DW_AT_name("clarkeHandle_V")
    3475                      .dwattr $C$DW$639, DW_AT_TI_symbol_name("_clarkeHandle_V")
    3476                      .dwattr $C$DW$639, DW_AT_data_member_location[DW_OP_plus_uconst 0x10]
    3477                      .dwattr $C$DW$639, DW_AT_accessibility(DW_ACCESS_public)
    3478              $C$DW$640       .dwtag  DW_TAG_member
    3479                      .dwattr $C$DW$640, DW_AT_type(*$C$DW$T$47)
    3480                      .dwattr $C$DW$640, DW_AT_name("clarke_V")
    3481                      .dwattr $C$DW$640, DW_AT_TI_symbol_name("_clarke_V")
    3482                      .dwattr $C$DW$640, DW_AT_data_member_location[DW_OP_plus_uconst 0x12]
    3483                      .dwattr $C$DW$640, DW_AT_accessibility(DW_ACCESS_public)
    3484              $C$DW$641       .dwtag  DW_TAG_member
    3485                      .dwattr $C$DW$641, DW_AT_type(*$C$DW$T$49)
    3486                      .dwattr $C$DW$641, DW_AT_name("estHandle")
    3487                      .dwattr $C$DW$641, DW_AT_TI_symbol_name("_estHandle")
    3488                      .dwattr $C$DW$641, DW_AT_data_member_location[DW_OP_plus_uconst 0x18]
    3489                      .dwattr $C$DW$641, DW_AT_accessibility(DW_ACCESS_public)
    3490              $C$DW$642       .dwtag  DW_TAG_member
    3491                      .dwattr $C$DW$642, DW_AT_type(*$C$DW$T$51)
    3492                      .dwattr $C$DW$642, DW_AT_name("parkHandle")
    3493                      .dwattr $C$DW$642, DW_AT_TI_symbol_name("_parkHandle")
    3494                      .dwattr $C$DW$642, DW_AT_data_member_location[DW_OP_plus_uconst 0x1a]
    3495                      .dwattr $C$DW$642, DW_AT_accessibility(DW_ACCESS_public)
    3496              $C$DW$643       .dwtag  DW_TAG_member
    3497                      .dwattr $C$DW$643, DW_AT_type(*$C$DW$T$52)
    3498                      .dwattr $C$DW$643, DW_AT_name("park")
    3499                      .dwattr $C$DW$643, DW_AT_TI_symbol_name("_park")
    3500                      .dwattr $C$DW$643, DW_AT_data_member_location[DW_OP_plus_uconst 0x1c]
    3501                      .dwattr $C$DW$643, DW_AT_accessibility(DW_ACCESS_public)
    3502              $C$DW$644       .dwtag  DW_TAG_member
    3503                      .dwattr $C$DW$644, DW_AT_type(*$C$DW$T$54)
    3504                      .dwattr $C$DW$644, DW_AT_name("pidHandle_Id")
    3505                      .dwattr $C$DW$644, DW_AT_TI_symbol_name("_pidHandle_Id")
    3506                      .dwattr $C$DW$644, DW_AT_data_member_location[DW_OP_plus_uconst 0x20]
    3507                      .dwattr $C$DW$644, DW_AT_accessibility(DW_ACCESS_public)
TMS320C2000 Assembler PC v6.2.5 Tue Nov 21 22:57:45 2017

Tools Copyright (c) 1996-2014 Texas Instruments Incorporated
C:\Users\wmj\AppData\Local\Temp\1055210                              PAGE   68

    3508              $C$DW$645       .dwtag  DW_TAG_member
    3509                      .dwattr $C$DW$645, DW_AT_type(*$C$DW$T$55)
    3510                      .dwattr $C$DW$645, DW_AT_name("pid_Id")
    3511                      .dwattr $C$DW$645, DW_AT_TI_symbol_name("_pid_Id")
    3512                      .dwattr $C$DW$645, DW_AT_data_member_location[DW_OP_plus_uconst 0x22]
    3513                      .dwattr $C$DW$645, DW_AT_accessibility(DW_ACCESS_public)
    3514              $C$DW$646       .dwtag  DW_TAG_member
    3515                      .dwattr $C$DW$646, DW_AT_type(*$C$DW$T$54)
    3516                      .dwattr $C$DW$646, DW_AT_name("pidHandle_Iq")
    3517                      .dwattr $C$DW$646, DW_AT_TI_symbol_name("_pidHandle_Iq")
    3518                      .dwattr $C$DW$646, DW_AT_data_member_location[DW_OP_plus_uconst 0x32]
    3519                      .dwattr $C$DW$646, DW_AT_accessibility(DW_ACCESS_public)
    3520              $C$DW$647       .dwtag  DW_TAG_member
    3521                      .dwattr $C$DW$647, DW_AT_type(*$C$DW$T$55)
    3522                      .dwattr $C$DW$647, DW_AT_name("pid_Iq")
    3523                      .dwattr $C$DW$647, DW_AT_TI_symbol_name("_pid_Iq")
    3524                      .dwattr $C$DW$647, DW_AT_data_member_location[DW_OP_plus_uconst 0x34]
    3525                      .dwattr $C$DW$647, DW_AT_accessibility(DW_ACCESS_public)
    3526              $C$DW$648       .dwtag  DW_TAG_member
    3527                      .dwattr $C$DW$648, DW_AT_type(*$C$DW$T$54)
    3528                      .dwattr $C$DW$648, DW_AT_name("pidHandle_spd")
    3529                      .dwattr $C$DW$648, DW_AT_TI_symbol_name("_pidHandle_spd")
    3530                      .dwattr $C$DW$648, DW_AT_data_member_location[DW_OP_plus_uconst 0x44]
    3531                      .dwattr $C$DW$648, DW_AT_accessibility(DW_ACCESS_public)
    3532              $C$DW$649       .dwtag  DW_TAG_member
    3533                      .dwattr $C$DW$649, DW_AT_type(*$C$DW$T$55)
    3534                      .dwattr $C$DW$649, DW_AT_name("pid_spd")
    3535                      .dwattr $C$DW$649, DW_AT_TI_symbol_name("_pid_spd")
    3536                      .dwattr $C$DW$649, DW_AT_data_member_location[DW_OP_plus_uconst 0x46]
    3537                      .dwattr $C$DW$649, DW_AT_accessibility(DW_ACCESS_public)
    3538              $C$DW$650       .dwtag  DW_TAG_member
    3539                      .dwattr $C$DW$650, DW_AT_type(*$C$DW$T$57)
    3540                      .dwattr $C$DW$650, DW_AT_name("iparkHandle")
    3541                      .dwattr $C$DW$650, DW_AT_TI_symbol_name("_iparkHandle")
    3542                      .dwattr $C$DW$650, DW_AT_data_member_location[DW_OP_plus_uconst 0x56]
    3543                      .dwattr $C$DW$650, DW_AT_accessibility(DW_ACCESS_public)
    3544              $C$DW$651       .dwtag  DW_TAG_member
    3545                      .dwattr $C$DW$651, DW_AT_type(*$C$DW$T$58)
    3546                      .dwattr $C$DW$651, DW_AT_name("ipark")
    3547                      .dwattr $C$DW$651, DW_AT_TI_symbol_name("_ipark")
    3548                      .dwattr $C$DW$651, DW_AT_data_member_location[DW_OP_plus_uconst 0x58]
    3549                      .dwattr $C$DW$651, DW_AT_accessibility(DW_ACCESS_public)
    3550              $C$DW$652       .dwtag  DW_TAG_member
    3551                      .dwattr $C$DW$652, DW_AT_type(*$C$DW$T$60)
    3552                      .dwattr $C$DW$652, DW_AT_name("svgenHandle")
    3553                      .dwattr $C$DW$652, DW_AT_TI_symbol_name("_svgenHandle")
    3554                      .dwattr $C$DW$652, DW_AT_data_member_location[DW_OP_plus_uconst 0x5c]
    3555                      .dwattr $C$DW$652, DW_AT_accessibility(DW_ACCESS_public)
    3556              $C$DW$653       .dwtag  DW_TAG_member
    3557                      .dwattr $C$DW$653, DW_AT_type(*$C$DW$T$61)
    3558                      .dwattr $C$DW$653, DW_AT_name("svgen")
    3559                      .dwattr $C$DW$653, DW_AT_TI_symbol_name("_svgen")
    3560                      .dwattr $C$DW$653, DW_AT_data_member_location[DW_OP_plus_uconst 0x5e]
    3561                      .dwattr $C$DW$653, DW_AT_accessibility(DW_ACCESS_public)
    3562              $C$DW$654       .dwtag  DW_TAG_member
TMS320C2000 Assembler PC v6.2.5 Tue Nov 21 22:57:45 2017

Tools Copyright (c) 1996-2014 Texas Instruments Incorporated
C:\Users\wmj\AppData\Local\Temp\1055210                              PAGE   69

    3563                      .dwattr $C$DW$654, DW_AT_type(*$C$DW$T$63)
    3564                      .dwattr $C$DW$654, DW_AT_name("trajHandle_Id")
    3565                      .dwattr $C$DW$654, DW_AT_TI_symbol_name("_trajHandle_Id")
    3566                      .dwattr $C$DW$654, DW_AT_data_member_location[DW_OP_plus_uconst 0x60]
    3567                      .dwattr $C$DW$654, DW_AT_accessibility(DW_ACCESS_public)
    3568              $C$DW$655       .dwtag  DW_TAG_member
    3569                      .dwattr $C$DW$655, DW_AT_type(*$C$DW$T$64)
    3570                      .dwattr $C$DW$655, DW_AT_name("traj_Id")
    3571                      .dwattr $C$DW$655, DW_AT_TI_symbol_name("_traj_Id")
    3572                      .dwattr $C$DW$655, DW_AT_data_member_location[DW_OP_plus_uconst 0x62]
    3573                      .dwattr $C$DW$655, DW_AT_accessibility(DW_ACCESS_public)
    3574              $C$DW$656       .dwtag  DW_TAG_member
    3575                      .dwattr $C$DW$656, DW_AT_type(*$C$DW$T$63)
    3576                      .dwattr $C$DW$656, DW_AT_name("trajHandle_spd")
    3577                      .dwattr $C$DW$656, DW_AT_TI_symbol_name("_trajHandle_spd")
    3578                      .dwattr $C$DW$656, DW_AT_data_member_location[DW_OP_plus_uconst 0x6c]
    3579                      .dwattr $C$DW$656, DW_AT_accessibility(DW_ACCESS_public)
    3580              $C$DW$657       .dwtag  DW_TAG_member
    3581                      .dwattr $C$DW$657, DW_AT_type(*$C$DW$T$64)
    3582                      .dwattr $C$DW$657, DW_AT_name("traj_spd")
    3583                      .dwattr $C$DW$657, DW_AT_TI_symbol_name("_traj_spd")
    3584                      .dwattr $C$DW$657, DW_AT_data_member_location[DW_OP_plus_uconst 0x6e]
    3585                      .dwattr $C$DW$657, DW_AT_accessibility(DW_ACCESS_public)
    3586              $C$DW$658       .dwtag  DW_TAG_member
    3587                      .dwattr $C$DW$658, DW_AT_type(*$C$DW$T$63)
    3588                      .dwattr $C$DW$658, DW_AT_name("trajHandle_spdMax")
    3589                      .dwattr $C$DW$658, DW_AT_TI_symbol_name("_trajHandle_spdMax")
    3590                      .dwattr $C$DW$658, DW_AT_data_member_location[DW_OP_plus_uconst 0x78]
    3591                      .dwattr $C$DW$658, DW_AT_accessibility(DW_ACCESS_public)
    3592              $C$DW$659       .dwtag  DW_TAG_member
    3593                      .dwattr $C$DW$659, DW_AT_type(*$C$DW$T$64)
    3594                      .dwattr $C$DW$659, DW_AT_name("traj_spdMax")
    3595                      .dwattr $C$DW$659, DW_AT_TI_symbol_name("_traj_spdMax")
    3596                      .dwattr $C$DW$659, DW_AT_data_member_location[DW_OP_plus_uconst 0x7a]
    3597                      .dwattr $C$DW$659, DW_AT_accessibility(DW_ACCESS_public)
    3598              $C$DW$660       .dwtag  DW_TAG_member
    3599                      .dwattr $C$DW$660, DW_AT_type(*$C$DW$T$65)
    3600                      .dwattr $C$DW$660, DW_AT_name("motorParams")
    3601                      .dwattr $C$DW$660, DW_AT_TI_symbol_name("_motorParams")
    3602                      .dwattr $C$DW$660, DW_AT_data_member_location[DW_OP_plus_uconst 0x84]
    3603                      .dwattr $C$DW$660, DW_AT_accessibility(DW_ACCESS_public)
    3604              $C$DW$661       .dwtag  DW_TAG_member
    3605                      .dwattr $C$DW$661, DW_AT_type(*$C$DW$T$68)
    3606                      .dwattr $C$DW$661, DW_AT_name("waitTimes")
    3607                      .dwattr $C$DW$661, DW_AT_TI_symbol_name("_waitTimes")
    3608                      .dwattr $C$DW$661, DW_AT_data_member_location[DW_OP_plus_uconst 0x92]
    3609                      .dwattr $C$DW$661, DW_AT_accessibility(DW_ACCESS_public)
    3610              $C$DW$662       .dwtag  DW_TAG_member
    3611                      .dwattr $C$DW$662, DW_AT_type(*$C$DW$T$67)
    3612                      .dwattr $C$DW$662, DW_AT_name("counter_state")
    3613                      .dwattr $C$DW$662, DW_AT_TI_symbol_name("_counter_state")
    3614                      .dwattr $C$DW$662, DW_AT_data_member_location[DW_OP_plus_uconst 0x9a]
    3615                      .dwattr $C$DW$662, DW_AT_accessibility(DW_ACCESS_public)
    3616              $C$DW$663       .dwtag  DW_TAG_member
    3617                      .dwattr $C$DW$663, DW_AT_type(*$C$DW$T$69)
TMS320C2000 Assembler PC v6.2.5 Tue Nov 21 22:57:45 2017

Tools Copyright (c) 1996-2014 Texas Instruments Incorporated
C:\Users\wmj\AppData\Local\Temp\1055210                              PAGE   70

    3618                      .dwattr $C$DW$663, DW_AT_name("numIsrTicksPerCtrlTick")
    3619                      .dwattr $C$DW$663, DW_AT_TI_symbol_name("_numIsrTicksPerCtrlTick")
    3620                      .dwattr $C$DW$663, DW_AT_data_member_location[DW_OP_plus_uconst 0x9c]
    3621                      .dwattr $C$DW$663, DW_AT_accessibility(DW_ACCESS_public)
    3622              $C$DW$664       .dwtag  DW_TAG_member
    3623                      .dwattr $C$DW$664, DW_AT_type(*$C$DW$T$69)
    3624                      .dwattr $C$DW$664, DW_AT_name("numCtrlTicksPerCurrentTick")
    3625                      .dwattr $C$DW$664, DW_AT_TI_symbol_name("_numCtrlTicksPerCurrentTick")
    3626                      .dwattr $C$DW$664, DW_AT_data_member_location[DW_OP_plus_uconst 0x9d]
    3627                      .dwattr $C$DW$664, DW_AT_accessibility(DW_ACCESS_public)
    3628              $C$DW$665       .dwtag  DW_TAG_member
    3629                      .dwattr $C$DW$665, DW_AT_type(*$C$DW$T$69)
    3630                      .dwattr $C$DW$665, DW_AT_name("numCtrlTicksPerSpeedTick")
    3631                      .dwattr $C$DW$665, DW_AT_TI_symbol_name("_numCtrlTicksPerSpeedTick")
    3632                      .dwattr $C$DW$665, DW_AT_data_member_location[DW_OP_plus_uconst 0x9e]
    3633                      .dwattr $C$DW$665, DW_AT_accessibility(DW_ACCESS_public)
    3634              $C$DW$666       .dwtag  DW_TAG_member
    3635                      .dwattr $C$DW$666, DW_AT_type(*$C$DW$T$69)
    3636                      .dwattr $C$DW$666, DW_AT_name("numCtrlTicksPerTrajTick")
    3637                      .dwattr $C$DW$666, DW_AT_TI_symbol_name("_numCtrlTicksPerTrajTick")
    3638                      .dwattr $C$DW$666, DW_AT_data_member_location[DW_OP_plus_uconst 0x9f]
    3639                      .dwattr $C$DW$666, DW_AT_accessibility(DW_ACCESS_public)
    3640              $C$DW$667       .dwtag  DW_TAG_member
    3641                      .dwattr $C$DW$667, DW_AT_type(*$C$DW$T$67)
    3642                      .dwattr $C$DW$667, DW_AT_name("ctrlFreq_Hz")
    3643                      .dwattr $C$DW$667, DW_AT_TI_symbol_name("_ctrlFreq_Hz")
    3644                      .dwattr $C$DW$667, DW_AT_data_member_location[DW_OP_plus_uconst 0xa0]
    3645                      .dwattr $C$DW$667, DW_AT_accessibility(DW_ACCESS_public)
    3646              $C$DW$668       .dwtag  DW_TAG_member
    3647                      .dwattr $C$DW$668, DW_AT_type(*$C$DW$T$67)
    3648                      .dwattr $C$DW$668, DW_AT_name("trajFreq_Hz")
    3649                      .dwattr $C$DW$668, DW_AT_TI_symbol_name("_trajFreq_Hz")
    3650                      .dwattr $C$DW$668, DW_AT_data_member_location[DW_OP_plus_uconst 0xa2]
    3651                      .dwattr $C$DW$668, DW_AT_accessibility(DW_ACCESS_public)
    3652              $C$DW$669       .dwtag  DW_TAG_member
    3653                      .dwattr $C$DW$669, DW_AT_type(*$C$DW$T$31)
    3654                      .dwattr $C$DW$669, DW_AT_name("trajPeriod_sec")
    3655                      .dwattr $C$DW$669, DW_AT_TI_symbol_name("_trajPeriod_sec")
    3656                      .dwattr $C$DW$669, DW_AT_data_member_location[DW_OP_plus_uconst 0xa4]
    3657                      .dwattr $C$DW$669, DW_AT_accessibility(DW_ACCESS_public)
    3658              $C$DW$670       .dwtag  DW_TAG_member
    3659                      .dwattr $C$DW$670, DW_AT_type(*$C$DW$T$70)
    3660                      .dwattr $C$DW$670, DW_AT_name("ctrlPeriod_sec")
    3661                      .dwattr $C$DW$670, DW_AT_TI_symbol_name("_ctrlPeriod_sec")
    3662                      .dwattr $C$DW$670, DW_AT_data_member_location[DW_OP_plus_uconst 0xa6]
    3663                      .dwattr $C$DW$670, DW_AT_accessibility(DW_ACCESS_public)
    3664              $C$DW$671       .dwtag  DW_TAG_member
    3665                      .dwattr $C$DW$671, DW_AT_type(*$C$DW$T$31)
    3666                      .dwattr $C$DW$671, DW_AT_name("maxVsMag_pu")
    3667                      .dwattr $C$DW$671, DW_AT_TI_symbol_name("_maxVsMag_pu")
    3668                      .dwattr $C$DW$671, DW_AT_data_member_location[DW_OP_plus_uconst 0xa8]
    3669                      .dwattr $C$DW$671, DW_AT_accessibility(DW_ACCESS_public)
    3670              $C$DW$672       .dwtag  DW_TAG_member
    3671                      .dwattr $C$DW$672, DW_AT_type(*$C$DW$T$32)
    3672                      .dwattr $C$DW$672, DW_AT_name("Iab_in")
TMS320C2000 Assembler PC v6.2.5 Tue Nov 21 22:57:45 2017

Tools Copyright (c) 1996-2014 Texas Instruments Incorporated
C:\Users\wmj\AppData\Local\Temp\1055210                              PAGE   71

    3673                      .dwattr $C$DW$672, DW_AT_TI_symbol_name("_Iab_in")
    3674                      .dwattr $C$DW$672, DW_AT_data_member_location[DW_OP_plus_uconst 0xaa]
    3675                      .dwattr $C$DW$672, DW_AT_accessibility(DW_ACCESS_public)
    3676              $C$DW$673       .dwtag  DW_TAG_member
    3677                      .dwattr $C$DW$673, DW_AT_type(*$C$DW$T$32)
    3678                      .dwattr $C$DW$673, DW_AT_name("Iab_filt")
    3679                      .dwattr $C$DW$673, DW_AT_TI_symbol_name("_Iab_filt")
    3680                      .dwattr $C$DW$673, DW_AT_data_member_location[DW_OP_plus_uconst 0xae]
    3681                      .dwattr $C$DW$673, DW_AT_accessibility(DW_ACCESS_public)
    3682              $C$DW$674       .dwtag  DW_TAG_member
    3683                      .dwattr $C$DW$674, DW_AT_type(*$C$DW$T$32)
    3684                      .dwattr $C$DW$674, DW_AT_name("Idq_in")
    3685                      .dwattr $C$DW$674, DW_AT_TI_symbol_name("_Idq_in")
    3686                      .dwattr $C$DW$674, DW_AT_data_member_location[DW_OP_plus_uconst 0xb2]
    3687                      .dwattr $C$DW$674, DW_AT_accessibility(DW_ACCESS_public)
    3688              $C$DW$675       .dwtag  DW_TAG_member
    3689                      .dwattr $C$DW$675, DW_AT_type(*$C$DW$T$32)
    3690                      .dwattr $C$DW$675, DW_AT_name("Vab_in")
    3691                      .dwattr $C$DW$675, DW_AT_TI_symbol_name("_Vab_in")
    3692                      .dwattr $C$DW$675, DW_AT_data_member_location[DW_OP_plus_uconst 0xb6]
    3693                      .dwattr $C$DW$675, DW_AT_accessibility(DW_ACCESS_public)
    3694              $C$DW$676       .dwtag  DW_TAG_member
    3695                      .dwattr $C$DW$676, DW_AT_type(*$C$DW$T$31)
    3696                      .dwattr $C$DW$676, DW_AT_name("spd_out")
    3697                      .dwattr $C$DW$676, DW_AT_TI_symbol_name("_spd_out")
    3698                      .dwattr $C$DW$676, DW_AT_data_member_location[DW_OP_plus_uconst 0xba]
    3699                      .dwattr $C$DW$676, DW_AT_accessibility(DW_ACCESS_public)
    3700              $C$DW$677       .dwtag  DW_TAG_member
    3701                      .dwattr $C$DW$677, DW_AT_type(*$C$DW$T$32)
    3702                      .dwattr $C$DW$677, DW_AT_name("Vab_out")
    3703                      .dwattr $C$DW$677, DW_AT_TI_symbol_name("_Vab_out")
    3704                      .dwattr $C$DW$677, DW_AT_data_member_location[DW_OP_plus_uconst 0xbc]
    3705                      .dwattr $C$DW$677, DW_AT_accessibility(DW_ACCESS_public)
    3706              $C$DW$678       .dwtag  DW_TAG_member
    3707                      .dwattr $C$DW$678, DW_AT_type(*$C$DW$T$32)
    3708                      .dwattr $C$DW$678, DW_AT_name("Vdq_out")
    3709                      .dwattr $C$DW$678, DW_AT_TI_symbol_name("_Vdq_out")
    3710                      .dwattr $C$DW$678, DW_AT_data_member_location[DW_OP_plus_uconst 0xc0]
    3711                      .dwattr $C$DW$678, DW_AT_accessibility(DW_ACCESS_public)
    3712              $C$DW$679       .dwtag  DW_TAG_member
    3713                      .dwattr $C$DW$679, DW_AT_type(*$C$DW$T$70)
    3714                      .dwattr $C$DW$679, DW_AT_name("Rhf")
    3715                      .dwattr $C$DW$679, DW_AT_TI_symbol_name("_Rhf")
    3716                      .dwattr $C$DW$679, DW_AT_data_member_location[DW_OP_plus_uconst 0xc4]
    3717                      .dwattr $C$DW$679, DW_AT_accessibility(DW_ACCESS_public)
    3718              $C$DW$680       .dwtag  DW_TAG_member
    3719                      .dwattr $C$DW$680, DW_AT_type(*$C$DW$T$70)
    3720                      .dwattr $C$DW$680, DW_AT_name("Lhf")
    3721                      .dwattr $C$DW$680, DW_AT_TI_symbol_name("_Lhf")
    3722                      .dwattr $C$DW$680, DW_AT_data_member_location[DW_OP_plus_uconst 0xc6]
    3723                      .dwattr $C$DW$680, DW_AT_accessibility(DW_ACCESS_public)
    3724              $C$DW$681       .dwtag  DW_TAG_member
    3725                      .dwattr $C$DW$681, DW_AT_type(*$C$DW$T$70)
    3726                      .dwattr $C$DW$681, DW_AT_name("RoverL")
    3727                      .dwattr $C$DW$681, DW_AT_TI_symbol_name("_RoverL")
TMS320C2000 Assembler PC v6.2.5 Tue Nov 21 22:57:45 2017

Tools Copyright (c) 1996-2014 Texas Instruments Incorporated
C:\Users\wmj\AppData\Local\Temp\1055210                              PAGE   72

    3728                      .dwattr $C$DW$681, DW_AT_data_member_location[DW_OP_plus_uconst 0xc8]
    3729                      .dwattr $C$DW$681, DW_AT_accessibility(DW_ACCESS_public)
    3730              $C$DW$682       .dwtag  DW_TAG_member
    3731                      .dwattr $C$DW$682, DW_AT_type(*$C$DW$T$31)
    3732                      .dwattr $C$DW$682, DW_AT_name("Kp_Id")
    3733                      .dwattr $C$DW$682, DW_AT_TI_symbol_name("_Kp_Id")
    3734                      .dwattr $C$DW$682, DW_AT_data_member_location[DW_OP_plus_uconst 0xca]
    3735                      .dwattr $C$DW$682, DW_AT_accessibility(DW_ACCESS_public)
    3736              $C$DW$683       .dwtag  DW_TAG_member
    3737                      .dwattr $C$DW$683, DW_AT_type(*$C$DW$T$31)
    3738                      .dwattr $C$DW$683, DW_AT_name("Kp_Iq")
    3739                      .dwattr $C$DW$683, DW_AT_TI_symbol_name("_Kp_Iq")
    3740                      .dwattr $C$DW$683, DW_AT_data_member_location[DW_OP_plus_uconst 0xcc]
    3741                      .dwattr $C$DW$683, DW_AT_accessibility(DW_ACCESS_public)
    3742              $C$DW$684       .dwtag  DW_TAG_member
    3743                      .dwattr $C$DW$684, DW_AT_type(*$C$DW$T$31)
    3744                      .dwattr $C$DW$684, DW_AT_name("Kp_spd")
    3745                      .dwattr $C$DW$684, DW_AT_TI_symbol_name("_Kp_spd")
    3746                      .dwattr $C$DW$684, DW_AT_data_member_location[DW_OP_plus_uconst 0xce]
    3747                      .dwattr $C$DW$684, DW_AT_accessibility(DW_ACCESS_public)
    3748              $C$DW$685       .dwtag  DW_TAG_member
    3749                      .dwattr $C$DW$685, DW_AT_type(*$C$DW$T$31)
    3750                      .dwattr $C$DW$685, DW_AT_name("Ki_Id")
    3751                      .dwattr $C$DW$685, DW_AT_TI_symbol_name("_Ki_Id")
    3752                      .dwattr $C$DW$685, DW_AT_data_member_location[DW_OP_plus_uconst 0xd0]
    3753                      .dwattr $C$DW$685, DW_AT_accessibility(DW_ACCESS_public)
    3754              $C$DW$686       .dwtag  DW_TAG_member
    3755                      .dwattr $C$DW$686, DW_AT_type(*$C$DW$T$31)
    3756                      .dwattr $C$DW$686, DW_AT_name("Ki_Iq")
    3757                      .dwattr $C$DW$686, DW_AT_TI_symbol_name("_Ki_Iq")
    3758                      .dwattr $C$DW$686, DW_AT_data_member_location[DW_OP_plus_uconst 0xd2]
    3759                      .dwattr $C$DW$686, DW_AT_accessibility(DW_ACCESS_public)
    3760              $C$DW$687       .dwtag  DW_TAG_member
    3761                      .dwattr $C$DW$687, DW_AT_type(*$C$DW$T$31)
    3762                      .dwattr $C$DW$687, DW_AT_name("Ki_spd")
    3763                      .dwattr $C$DW$687, DW_AT_TI_symbol_name("_Ki_spd")
    3764                      .dwattr $C$DW$687, DW_AT_data_member_location[DW_OP_plus_uconst 0xd4]
    3765                      .dwattr $C$DW$687, DW_AT_accessibility(DW_ACCESS_public)
    3766              $C$DW$688       .dwtag  DW_TAG_member
    3767                      .dwattr $C$DW$688, DW_AT_type(*$C$DW$T$31)
    3768                      .dwattr $C$DW$688, DW_AT_name("Kd_Id")
    3769                      .dwattr $C$DW$688, DW_AT_TI_symbol_name("_Kd_Id")
    3770                      .dwattr $C$DW$688, DW_AT_data_member_location[DW_OP_plus_uconst 0xd6]
    3771                      .dwattr $C$DW$688, DW_AT_accessibility(DW_ACCESS_public)
    3772              $C$DW$689       .dwtag  DW_TAG_member
    3773                      .dwattr $C$DW$689, DW_AT_type(*$C$DW$T$31)
    3774                      .dwattr $C$DW$689, DW_AT_name("Kd_Iq")
    3775                      .dwattr $C$DW$689, DW_AT_TI_symbol_name("_Kd_Iq")
    3776                      .dwattr $C$DW$689, DW_AT_data_member_location[DW_OP_plus_uconst 0xd8]
    3777                      .dwattr $C$DW$689, DW_AT_accessibility(DW_ACCESS_public)
    3778              $C$DW$690       .dwtag  DW_TAG_member
    3779                      .dwattr $C$DW$690, DW_AT_type(*$C$DW$T$31)
    3780                      .dwattr $C$DW$690, DW_AT_name("Kd_spd")
    3781                      .dwattr $C$DW$690, DW_AT_TI_symbol_name("_Kd_spd")
    3782                      .dwattr $C$DW$690, DW_AT_data_member_location[DW_OP_plus_uconst 0xda]
TMS320C2000 Assembler PC v6.2.5 Tue Nov 21 22:57:45 2017

Tools Copyright (c) 1996-2014 Texas Instruments Incorporated
C:\Users\wmj\AppData\Local\Temp\1055210                              PAGE   73

    3783                      .dwattr $C$DW$690, DW_AT_accessibility(DW_ACCESS_public)
    3784              $C$DW$691       .dwtag  DW_TAG_member
    3785                      .dwattr $C$DW$691, DW_AT_type(*$C$DW$T$31)
    3786                      .dwattr $C$DW$691, DW_AT_name("Ui_Id")
    3787                      .dwattr $C$DW$691, DW_AT_TI_symbol_name("_Ui_Id")
    3788                      .dwattr $C$DW$691, DW_AT_data_member_location[DW_OP_plus_uconst 0xdc]
    3789                      .dwattr $C$DW$691, DW_AT_accessibility(DW_ACCESS_public)
    3790              $C$DW$692       .dwtag  DW_TAG_member
    3791                      .dwattr $C$DW$692, DW_AT_type(*$C$DW$T$31)
    3792                      .dwattr $C$DW$692, DW_AT_name("Ui_Iq")
    3793                      .dwattr $C$DW$692, DW_AT_TI_symbol_name("_Ui_Iq")
    3794                      .dwattr $C$DW$692, DW_AT_data_member_location[DW_OP_plus_uconst 0xde]
    3795                      .dwattr $C$DW$692, DW_AT_accessibility(DW_ACCESS_public)
    3796              $C$DW$693       .dwtag  DW_TAG_member
    3797                      .dwattr $C$DW$693, DW_AT_type(*$C$DW$T$31)
    3798                      .dwattr $C$DW$693, DW_AT_name("Ui_spd")
    3799                      .dwattr $C$DW$693, DW_AT_TI_symbol_name("_Ui_spd")
    3800                      .dwattr $C$DW$693, DW_AT_data_member_location[DW_OP_plus_uconst 0xe0]
    3801                      .dwattr $C$DW$693, DW_AT_accessibility(DW_ACCESS_public)
    3802              $C$DW$694       .dwtag  DW_TAG_member
    3803                      .dwattr $C$DW$694, DW_AT_type(*$C$DW$T$32)
    3804                      .dwattr $C$DW$694, DW_AT_name("Idq_ref")
    3805                      .dwattr $C$DW$694, DW_AT_TI_symbol_name("_Idq_ref")
    3806                      .dwattr $C$DW$694, DW_AT_data_member_location[DW_OP_plus_uconst 0xe2]
    3807                      .dwattr $C$DW$694, DW_AT_accessibility(DW_ACCESS_public)
    3808              $C$DW$695       .dwtag  DW_TAG_member
    3809                      .dwattr $C$DW$695, DW_AT_type(*$C$DW$T$31)
    3810                      .dwattr $C$DW$695, DW_AT_name("IdRated")
    3811                      .dwattr $C$DW$695, DW_AT_TI_symbol_name("_IdRated")
    3812                      .dwattr $C$DW$695, DW_AT_data_member_location[DW_OP_plus_uconst 0xe6]
    3813                      .dwattr $C$DW$695, DW_AT_accessibility(DW_ACCESS_public)
    3814              $C$DW$696       .dwtag  DW_TAG_member
    3815                      .dwattr $C$DW$696, DW_AT_type(*$C$DW$T$31)
    3816                      .dwattr $C$DW$696, DW_AT_name("spd_ref")
    3817                      .dwattr $C$DW$696, DW_AT_TI_symbol_name("_spd_ref")
    3818                      .dwattr $C$DW$696, DW_AT_data_member_location[DW_OP_plus_uconst 0xe8]
    3819                      .dwattr $C$DW$696, DW_AT_accessibility(DW_ACCESS_public)
    3820              $C$DW$697       .dwtag  DW_TAG_member
    3821                      .dwattr $C$DW$697, DW_AT_type(*$C$DW$T$31)
    3822                      .dwattr $C$DW$697, DW_AT_name("spd_max")
    3823                      .dwattr $C$DW$697, DW_AT_TI_symbol_name("_spd_max")
    3824                      .dwattr $C$DW$697, DW_AT_data_member_location[DW_OP_plus_uconst 0xea]
    3825                      .dwattr $C$DW$697, DW_AT_accessibility(DW_ACCESS_public)
    3826              $C$DW$698       .dwtag  DW_TAG_member
    3827                      .dwattr $C$DW$698, DW_AT_type(*$C$DW$T$69)
    3828                      .dwattr $C$DW$698, DW_AT_name("counter_current")
    3829                      .dwattr $C$DW$698, DW_AT_TI_symbol_name("_counter_current")
    3830                      .dwattr $C$DW$698, DW_AT_data_member_location[DW_OP_plus_uconst 0xec]
    3831                      .dwattr $C$DW$698, DW_AT_accessibility(DW_ACCESS_public)
    3832              $C$DW$699       .dwtag  DW_TAG_member
    3833                      .dwattr $C$DW$699, DW_AT_type(*$C$DW$T$69)
    3834                      .dwattr $C$DW$699, DW_AT_name("counter_isr")
    3835                      .dwattr $C$DW$699, DW_AT_TI_symbol_name("_counter_isr")
    3836                      .dwattr $C$DW$699, DW_AT_data_member_location[DW_OP_plus_uconst 0xed]
    3837                      .dwattr $C$DW$699, DW_AT_accessibility(DW_ACCESS_public)
TMS320C2000 Assembler PC v6.2.5 Tue Nov 21 22:57:45 2017

Tools Copyright (c) 1996-2014 Texas Instruments Incorporated
C:\Users\wmj\AppData\Local\Temp\1055210                              PAGE   74

    3838              $C$DW$700       .dwtag  DW_TAG_member
    3839                      .dwattr $C$DW$700, DW_AT_type(*$C$DW$T$69)
    3840                      .dwattr $C$DW$700, DW_AT_name("counter_speed")
    3841                      .dwattr $C$DW$700, DW_AT_TI_symbol_name("_counter_speed")
    3842                      .dwattr $C$DW$700, DW_AT_data_member_location[DW_OP_plus_uconst 0xee]
    3843                      .dwattr $C$DW$700, DW_AT_accessibility(DW_ACCESS_public)
    3844              $C$DW$701       .dwtag  DW_TAG_member
    3845                      .dwattr $C$DW$701, DW_AT_type(*$C$DW$T$69)
    3846                      .dwattr $C$DW$701, DW_AT_name("counter_traj")
    3847                      .dwattr $C$DW$701, DW_AT_TI_symbol_name("_counter_traj")
    3848                      .dwattr $C$DW$701, DW_AT_data_member_location[DW_OP_plus_uconst 0xef]
    3849                      .dwattr $C$DW$701, DW_AT_accessibility(DW_ACCESS_public)
    3850              $C$DW$702       .dwtag  DW_TAG_member
    3851                      .dwattr $C$DW$702, DW_AT_type(*$C$DW$T$33)
    3852                      .dwattr $C$DW$702, DW_AT_name("flag_enableCtrl")
    3853                      .dwattr $C$DW$702, DW_AT_TI_symbol_name("_flag_enableCtrl")
    3854                      .dwattr $C$DW$702, DW_AT_data_member_location[DW_OP_plus_uconst 0xf0]
    3855                      .dwattr $C$DW$702, DW_AT_accessibility(DW_ACCESS_public)
    3856              $C$DW$703       .dwtag  DW_TAG_member
    3857                      .dwattr $C$DW$703, DW_AT_type(*$C$DW$T$33)
    3858                      .dwattr $C$DW$703, DW_AT_name("flag_enableDcBusComp")
    3859                      .dwattr $C$DW$703, DW_AT_TI_symbol_name("_flag_enableDcBusComp")
    3860                      .dwattr $C$DW$703, DW_AT_data_member_location[DW_OP_plus_uconst 0xf1]
    3861                      .dwattr $C$DW$703, DW_AT_accessibility(DW_ACCESS_public)
    3862              $C$DW$704       .dwtag  DW_TAG_member
    3863                      .dwattr $C$DW$704, DW_AT_type(*$C$DW$T$33)
    3864                      .dwattr $C$DW$704, DW_AT_name("flag_enablePowerWarp")
    3865                      .dwattr $C$DW$704, DW_AT_TI_symbol_name("_flag_enablePowerWarp")
    3866                      .dwattr $C$DW$704, DW_AT_data_member_location[DW_OP_plus_uconst 0xf2]
    3867                      .dwattr $C$DW$704, DW_AT_accessibility(DW_ACCESS_public)
    3868              $C$DW$705       .dwtag  DW_TAG_member
    3869                      .dwattr $C$DW$705, DW_AT_type(*$C$DW$T$33)
    3870                      .dwattr $C$DW$705, DW_AT_name("flag_enableOffset")
    3871                      .dwattr $C$DW$705, DW_AT_TI_symbol_name("_flag_enableOffset")
    3872                      .dwattr $C$DW$705, DW_AT_data_member_location[DW_OP_plus_uconst 0xf3]
    3873                      .dwattr $C$DW$705, DW_AT_accessibility(DW_ACCESS_public)
    3874              $C$DW$706       .dwtag  DW_TAG_member
    3875                      .dwattr $C$DW$706, DW_AT_type(*$C$DW$T$33)
    3876                      .dwattr $C$DW$706, DW_AT_name("flag_enableSpeedCtrl")
    3877                      .dwattr $C$DW$706, DW_AT_TI_symbol_name("_flag_enableSpeedCtrl")
    3878                      .dwattr $C$DW$706, DW_AT_data_member_location[DW_OP_plus_uconst 0xf4]
    3879                      .dwattr $C$DW$706, DW_AT_accessibility(DW_ACCESS_public)
    3880              $C$DW$707       .dwtag  DW_TAG_member
    3881                      .dwattr $C$DW$707, DW_AT_type(*$C$DW$T$33)
    3882                      .dwattr $C$DW$707, DW_AT_name("flag_enableUserMotorParams")
    3883                      .dwattr $C$DW$707, DW_AT_TI_symbol_name("_flag_enableUserMotorParams")
    3884                      .dwattr $C$DW$707, DW_AT_data_member_location[DW_OP_plus_uconst 0xf5]
    3885                      .dwattr $C$DW$707, DW_AT_accessibility(DW_ACCESS_public)
    3886              $C$DW$708       .dwtag  DW_TAG_member
    3887                      .dwattr $C$DW$708, DW_AT_type(*$C$DW$T$33)
    3888                      .dwattr $C$DW$708, DW_AT_name("flag_enableCurrentCtrl")
    3889                      .dwattr $C$DW$708, DW_AT_TI_symbol_name("_flag_enableCurrentCtrl")
    3890                      .dwattr $C$DW$708, DW_AT_data_member_location[DW_OP_plus_uconst 0xf6]
    3891                      .dwattr $C$DW$708, DW_AT_accessibility(DW_ACCESS_public)
    3892              $C$DW$709       .dwtag  DW_TAG_member
TMS320C2000 Assembler PC v6.2.5 Tue Nov 21 22:57:45 2017

Tools Copyright (c) 1996-2014 Texas Instruments Incorporated
C:\Users\wmj\AppData\Local\Temp\1055210                              PAGE   75

    3893                      .dwattr $C$DW$709, DW_AT_type(*$C$DW$T$31)
    3894                      .dwattr $C$DW$709, DW_AT_name("spd_outMaxRatio_pu")
    3895                      .dwattr $C$DW$709, DW_AT_TI_symbol_name("_spd_outMaxRatio_pu")
    3896                      .dwattr $C$DW$709, DW_AT_data_member_location[DW_OP_plus_uconst 0xf8]
    3897                      .dwattr $C$DW$709, DW_AT_accessibility(DW_ACCESS_public)
    3898              $C$DW$710       .dwtag  DW_TAG_member
    3899                      .dwattr $C$DW$710, DW_AT_type(*$C$DW$T$31)
    3900                      .dwattr $C$DW$710, DW_AT_name("enc_Angle")
    3901                      .dwattr $C$DW$710, DW_AT_TI_symbol_name("_enc_Angle")
    3902                      .dwattr $C$DW$710, DW_AT_data_member_location[DW_OP_plus_uconst 0xfa]
    3903                      .dwattr $C$DW$710, DW_AT_accessibility(DW_ACCESS_public)
    3904              $C$DW$711       .dwtag  DW_TAG_member
    3905                      .dwattr $C$DW$711, DW_AT_type(*$C$DW$T$33)
    3906                      .dwattr $C$DW$711, DW_AT_name("flag_enableEncAngle")
    3907                      .dwattr $C$DW$711, DW_AT_TI_symbol_name("_flag_enableEncAngle")
    3908                      .dwattr $C$DW$711, DW_AT_data_member_location[DW_OP_plus_uconst 0xfc]
    3909                      .dwattr $C$DW$711, DW_AT_accessibility(DW_ACCESS_public)
    3910              $C$DW$712       .dwtag  DW_TAG_member
    3911                      .dwattr $C$DW$712, DW_AT_type(*$C$DW$T$72)
    3912                      .dwattr $C$DW$712, DW_AT_name("brakeHandle")
    3913                      .dwattr $C$DW$712, DW_AT_TI_symbol_name("_brakeHandle")
    3914                      .dwattr $C$DW$712, DW_AT_data_member_location[DW_OP_plus_uconst 0xfe]
    3915                      .dwattr $C$DW$712, DW_AT_accessibility(DW_ACCESS_public)
    3916              $C$DW$713       .dwtag  DW_TAG_member
    3917                      .dwattr $C$DW$713, DW_AT_type(*$C$DW$T$73)
    3918                      .dwattr $C$DW$713, DW_AT_name("brake")
    3919                      .dwattr $C$DW$713, DW_AT_TI_symbol_name("_brake")
    3920                      .dwattr $C$DW$713, DW_AT_data_member_location[DW_OP_plus_uconst 0x100]
    3921                      .dwattr $C$DW$713, DW_AT_accessibility(DW_ACCESS_public)
    3922                      .dwendtag $C$DW$T$74
    3923              
    3924              $C$DW$T$258     .dwtag  DW_TAG_typedef, DW_AT_name("CTRL_Obj")
    3925                      .dwattr $C$DW$T$258, DW_AT_type(*$C$DW$T$74)
    3926                      .dwattr $C$DW$T$258, DW_AT_language(DW_LANG_C)
    3927              $C$DW$T$259     .dwtag  DW_TAG_pointer_type
    3928                      .dwattr $C$DW$T$259, DW_AT_type(*$C$DW$T$258)
    3929                      .dwattr $C$DW$T$259, DW_AT_address_class(0x16)
    3930              $C$DW$T$210     .dwtag  DW_TAG_pointer_type
    3931                      .dwattr $C$DW$T$210, DW_AT_type(*$C$DW$T$74)
    3932                      .dwattr $C$DW$T$210, DW_AT_address_class(0x16)
    3933              $C$DW$T$211     .dwtag  DW_TAG_typedef, DW_AT_name("CTRL_Handle")
    3934                      .dwattr $C$DW$T$211, DW_AT_type(*$C$DW$T$210)
    3935                      .dwattr $C$DW$T$211, DW_AT_language(DW_LANG_C)
    3936              
    3937              $C$DW$T$77      .dwtag  DW_TAG_structure_type
    3938                      .dwattr $C$DW$T$77, DW_AT_name("_CTRL_Version_")
    3939                      .dwattr $C$DW$T$77, DW_AT_byte_size(0x04)
    3940              $C$DW$714       .dwtag  DW_TAG_member
    3941                      .dwattr $C$DW$714, DW_AT_type(*$C$DW$T$22)
    3942                      .dwattr $C$DW$714, DW_AT_name("rsvd")
    3943                      .dwattr $C$DW$714, DW_AT_TI_symbol_name("_rsvd")
    3944                      .dwattr $C$DW$714, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    3945                      .dwattr $C$DW$714, DW_AT_accessibility(DW_ACCESS_public)
    3946              $C$DW$715       .dwtag  DW_TAG_member
    3947                      .dwattr $C$DW$715, DW_AT_type(*$C$DW$T$76)
TMS320C2000 Assembler PC v6.2.5 Tue Nov 21 22:57:45 2017

Tools Copyright (c) 1996-2014 Texas Instruments Incorporated
C:\Users\wmj\AppData\Local\Temp\1055210                              PAGE   76

    3948                      .dwattr $C$DW$715, DW_AT_name("targetProc")
    3949                      .dwattr $C$DW$715, DW_AT_TI_symbol_name("_targetProc")
    3950                      .dwattr $C$DW$715, DW_AT_data_member_location[DW_OP_plus_uconst 0x1]
    3951                      .dwattr $C$DW$715, DW_AT_accessibility(DW_ACCESS_public)
    3952              $C$DW$716       .dwtag  DW_TAG_member
    3953                      .dwattr $C$DW$716, DW_AT_type(*$C$DW$T$22)
    3954                      .dwattr $C$DW$716, DW_AT_name("major")
    3955                      .dwattr $C$DW$716, DW_AT_TI_symbol_name("_major")
    3956                      .dwattr $C$DW$716, DW_AT_data_member_location[DW_OP_plus_uconst 0x2]
    3957                      .dwattr $C$DW$716, DW_AT_accessibility(DW_ACCESS_public)
    3958              $C$DW$717       .dwtag  DW_TAG_member
    3959                      .dwattr $C$DW$717, DW_AT_type(*$C$DW$T$22)
    3960                      .dwattr $C$DW$717, DW_AT_name("minor")
    3961                      .dwattr $C$DW$717, DW_AT_TI_symbol_name("_minor")
    3962                      .dwattr $C$DW$717, DW_AT_data_member_location[DW_OP_plus_uconst 0x3]
    3963                      .dwattr $C$DW$717, DW_AT_accessibility(DW_ACCESS_public)
    3964                      .dwendtag $C$DW$T$77
    3965              
    3966              $C$DW$T$40      .dwtag  DW_TAG_typedef, DW_AT_name("CTRL_Version")
    3967                      .dwattr $C$DW$T$40, DW_AT_type(*$C$DW$T$77)
    3968                      .dwattr $C$DW$T$40, DW_AT_language(DW_LANG_C)
    3969              $C$DW$T$266     .dwtag  DW_TAG_pointer_type
    3970                      .dwattr $C$DW$T$266, DW_AT_type(*$C$DW$T$40)
    3971                      .dwattr $C$DW$T$266, DW_AT_address_class(0x16)
    3972              
    3973              $C$DW$T$19      .dwtag  DW_TAG_structure_type
    3974                      .dwattr $C$DW$T$19, DW_AT_name("_EST_Obj_")
    3975                      .dwattr $C$DW$T$19, DW_AT_declaration
    3976                      .dwendtag $C$DW$T$19
    3977              
    3978              $C$DW$T$48      .dwtag  DW_TAG_pointer_type
    3979                      .dwattr $C$DW$T$48, DW_AT_type(*$C$DW$T$19)
    3980                      .dwattr $C$DW$T$48, DW_AT_address_class(0x16)
    3981              $C$DW$T$49      .dwtag  DW_TAG_typedef, DW_AT_name("EST_Handle")
    3982                      .dwattr $C$DW$T$49, DW_AT_type(*$C$DW$T$48)
    3983                      .dwattr $C$DW$T$49, DW_AT_language(DW_LANG_C)
    3984              
    3985              $C$DW$T$78      .dwtag  DW_TAG_structure_type
    3986                      .dwattr $C$DW$T$78, DW_AT_name("_FILTER_FO_")
    3987                      .dwattr $C$DW$T$78, DW_AT_byte_size(0x0a)
    3988              $C$DW$718       .dwtag  DW_TAG_member
    3989                      .dwattr $C$DW$718, DW_AT_type(*$C$DW$T$31)
    3990                      .dwattr $C$DW$718, DW_AT_name("a1")
    3991                      .dwattr $C$DW$718, DW_AT_TI_symbol_name("_a1")
    3992                      .dwattr $C$DW$718, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    3993                      .dwattr $C$DW$718, DW_AT_accessibility(DW_ACCESS_public)
    3994              $C$DW$719       .dwtag  DW_TAG_member
    3995                      .dwattr $C$DW$719, DW_AT_type(*$C$DW$T$31)
    3996                      .dwattr $C$DW$719, DW_AT_name("b0")
    3997                      .dwattr $C$DW$719, DW_AT_TI_symbol_name("_b0")
    3998                      .dwattr $C$DW$719, DW_AT_data_member_location[DW_OP_plus_uconst 0x2]
    3999                      .dwattr $C$DW$719, DW_AT_accessibility(DW_ACCESS_public)
    4000              $C$DW$720       .dwtag  DW_TAG_member
    4001                      .dwattr $C$DW$720, DW_AT_type(*$C$DW$T$31)
    4002                      .dwattr $C$DW$720, DW_AT_name("b1")
TMS320C2000 Assembler PC v6.2.5 Tue Nov 21 22:57:45 2017

Tools Copyright (c) 1996-2014 Texas Instruments Incorporated
C:\Users\wmj\AppData\Local\Temp\1055210                              PAGE   77

    4003                      .dwattr $C$DW$720, DW_AT_TI_symbol_name("_b1")
    4004                      .dwattr $C$DW$720, DW_AT_data_member_location[DW_OP_plus_uconst 0x4]
    4005                      .dwattr $C$DW$720, DW_AT_accessibility(DW_ACCESS_public)
    4006              $C$DW$721       .dwtag  DW_TAG_member
    4007                      .dwattr $C$DW$721, DW_AT_type(*$C$DW$T$31)
    4008                      .dwattr $C$DW$721, DW_AT_name("x1")
    4009                      .dwattr $C$DW$721, DW_AT_TI_symbol_name("_x1")
    4010                      .dwattr $C$DW$721, DW_AT_data_member_location[DW_OP_plus_uconst 0x6]
    4011                      .dwattr $C$DW$721, DW_AT_accessibility(DW_ACCESS_public)
    4012              $C$DW$722       .dwtag  DW_TAG_member
    4013                      .dwattr $C$DW$722, DW_AT_type(*$C$DW$T$31)
    4014                      .dwattr $C$DW$722, DW_AT_name("y1")
    4015                      .dwattr $C$DW$722, DW_AT_TI_symbol_name("_y1")
    4016                      .dwattr $C$DW$722, DW_AT_data_member_location[DW_OP_plus_uconst 0x8]
    4017                      .dwattr $C$DW$722, DW_AT_accessibility(DW_ACCESS_public)
    4018                      .dwendtag $C$DW$T$78
    4019              
    4020              $C$DW$T$191     .dwtag  DW_TAG_typedef, DW_AT_name("FILTER_FO_Obj")
    4021                      .dwattr $C$DW$T$191, DW_AT_type(*$C$DW$T$78)
    4022                      .dwattr $C$DW$T$191, DW_AT_language(DW_LANG_C)
    4023              
    4024              $C$DW$T$20      .dwtag  DW_TAG_structure_type
    4025                      .dwattr $C$DW$T$20, DW_AT_name("_FILTER_FO_Obj_")
    4026                      .dwattr $C$DW$T$20, DW_AT_declaration
    4027                      .dwendtag $C$DW$T$20
    4028              
    4029              $C$DW$T$192     .dwtag  DW_TAG_pointer_type
    4030                      .dwattr $C$DW$T$192, DW_AT_type(*$C$DW$T$20)
    4031                      .dwattr $C$DW$T$192, DW_AT_address_class(0x16)
    4032              $C$DW$T$193     .dwtag  DW_TAG_typedef, DW_AT_name("FILTER_FO_Handle")
    4033                      .dwattr $C$DW$T$193, DW_AT_type(*$C$DW$T$192)
    4034                      .dwattr $C$DW$T$193, DW_AT_language(DW_LANG_C)
    4035              
    4036              $C$DW$T$79      .dwtag  DW_TAG_structure_type
    4037                      .dwattr $C$DW$T$79, DW_AT_name("_FLASH_Obj_")
    4038                      .dwattr $C$DW$T$79, DW_AT_byte_size(0x08)
    4039              $C$DW$723       .dwtag  DW_TAG_member
    4040                      .dwattr $C$DW$723, DW_AT_type(*$C$DW$T$23)
    4041                      .dwattr $C$DW$723, DW_AT_name("FOPT")
    4042                      .dwattr $C$DW$723, DW_AT_TI_symbol_name("_FOPT")
    4043                      .dwattr $C$DW$723, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    4044                      .dwattr $C$DW$723, DW_AT_accessibility(DW_ACCESS_public)
    4045              $C$DW$724       .dwtag  DW_TAG_member
    4046                      .dwattr $C$DW$724, DW_AT_type(*$C$DW$T$23)
    4047                      .dwattr $C$DW$724, DW_AT_name("rsvd_1")
    4048                      .dwattr $C$DW$724, DW_AT_TI_symbol_name("_rsvd_1")
    4049                      .dwattr $C$DW$724, DW_AT_data_member_location[DW_OP_plus_uconst 0x1]
    4050                      .dwattr $C$DW$724, DW_AT_accessibility(DW_ACCESS_public)
    4051              $C$DW$725       .dwtag  DW_TAG_member
    4052                      .dwattr $C$DW$725, DW_AT_type(*$C$DW$T$23)
    4053                      .dwattr $C$DW$725, DW_AT_name("FPWR")
    4054                      .dwattr $C$DW$725, DW_AT_TI_symbol_name("_FPWR")
    4055                      .dwattr $C$DW$725, DW_AT_data_member_location[DW_OP_plus_uconst 0x2]
    4056                      .dwattr $C$DW$725, DW_AT_accessibility(DW_ACCESS_public)
    4057              $C$DW$726       .dwtag  DW_TAG_member
TMS320C2000 Assembler PC v6.2.5 Tue Nov 21 22:57:45 2017

Tools Copyright (c) 1996-2014 Texas Instruments Incorporated
C:\Users\wmj\AppData\Local\Temp\1055210                              PAGE   78

    4058                      .dwattr $C$DW$726, DW_AT_type(*$C$DW$T$23)
    4059                      .dwattr $C$DW$726, DW_AT_name("FSTATUS")
    4060                      .dwattr $C$DW$726, DW_AT_TI_symbol_name("_FSTATUS")
    4061                      .dwattr $C$DW$726, DW_AT_data_member_location[DW_OP_plus_uconst 0x3]
    4062                      .dwattr $C$DW$726, DW_AT_accessibility(DW_ACCESS_public)
    4063              $C$DW$727       .dwtag  DW_TAG_member
    4064                      .dwattr $C$DW$727, DW_AT_type(*$C$DW$T$23)
    4065                      .dwattr $C$DW$727, DW_AT_name("FSTDBYWAIT")
    4066                      .dwattr $C$DW$727, DW_AT_TI_symbol_name("_FSTDBYWAIT")
    4067                      .dwattr $C$DW$727, DW_AT_data_member_location[DW_OP_plus_uconst 0x4]
    4068                      .dwattr $C$DW$727, DW_AT_accessibility(DW_ACCESS_public)
    4069              $C$DW$728       .dwtag  DW_TAG_member
    4070                      .dwattr $C$DW$728, DW_AT_type(*$C$DW$T$23)
    4071                      .dwattr $C$DW$728, DW_AT_name("FACTIVEWAIT")
    4072                      .dwattr $C$DW$728, DW_AT_TI_symbol_name("_FACTIVEWAIT")
    4073                      .dwattr $C$DW$728, DW_AT_data_member_location[DW_OP_plus_uconst 0x5]
    4074                      .dwattr $C$DW$728, DW_AT_accessibility(DW_ACCESS_public)
    4075              $C$DW$729       .dwtag  DW_TAG_member
    4076                      .dwattr $C$DW$729, DW_AT_type(*$C$DW$T$23)
    4077                      .dwattr $C$DW$729, DW_AT_name("FBANKWAIT")
    4078                      .dwattr $C$DW$729, DW_AT_TI_symbol_name("_FBANKWAIT")
    4079                      .dwattr $C$DW$729, DW_AT_data_member_location[DW_OP_plus_uconst 0x6]
    4080                      .dwattr $C$DW$729, DW_AT_accessibility(DW_ACCESS_public)
    4081              $C$DW$730       .dwtag  DW_TAG_member
    4082                      .dwattr $C$DW$730, DW_AT_type(*$C$DW$T$23)
    4083                      .dwattr $C$DW$730, DW_AT_name("FOTPWAIT")
    4084                      .dwattr $C$DW$730, DW_AT_TI_symbol_name("_FOTPWAIT")
    4085                      .dwattr $C$DW$730, DW_AT_data_member_location[DW_OP_plus_uconst 0x7]
    4086                      .dwattr $C$DW$730, DW_AT_accessibility(DW_ACCESS_public)
    4087                      .dwendtag $C$DW$T$79
    4088              
    4089              $C$DW$T$124     .dwtag  DW_TAG_pointer_type
    4090                      .dwattr $C$DW$T$124, DW_AT_type(*$C$DW$T$79)
    4091                      .dwattr $C$DW$T$124, DW_AT_address_class(0x16)
    4092              $C$DW$T$125     .dwtag  DW_TAG_typedef, DW_AT_name("FLASH_Handle")
    4093                      .dwattr $C$DW$T$125, DW_AT_type(*$C$DW$T$124)
    4094                      .dwattr $C$DW$T$125, DW_AT_language(DW_LANG_C)
    4095              
    4096              $C$DW$T$99      .dwtag  DW_TAG_structure_type
    4097                      .dwattr $C$DW$T$99, DW_AT_name("_FSM_Obj_")
    4098                      .dwattr $C$DW$T$99, DW_AT_byte_size(0x26)
    4099              $C$DW$731       .dwtag  DW_TAG_member
    4100                      .dwattr $C$DW$731, DW_AT_type(*$C$DW$T$81)
    4101                      .dwattr $C$DW$731, DW_AT_name("motorHandle")
    4102                      .dwattr $C$DW$731, DW_AT_TI_symbol_name("_motorHandle")
    4103                      .dwattr $C$DW$731, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    4104                      .dwattr $C$DW$731, DW_AT_accessibility(DW_ACCESS_public)
    4105              $C$DW$732       .dwtag  DW_TAG_member
    4106                      .dwattr $C$DW$732, DW_AT_type(*$C$DW$T$83)
    4107                      .dwattr $C$DW$732, DW_AT_name("halHandle")
    4108                      .dwattr $C$DW$732, DW_AT_TI_symbol_name("_halHandle")
    4109                      .dwattr $C$DW$732, DW_AT_data_member_location[DW_OP_plus_uconst 0x2]
    4110                      .dwattr $C$DW$732, DW_AT_accessibility(DW_ACCESS_public)
    4111              $C$DW$733       .dwtag  DW_TAG_member
    4112                      .dwattr $C$DW$733, DW_AT_type(*$C$DW$T$85)
TMS320C2000 Assembler PC v6.2.5 Tue Nov 21 22:57:45 2017

Tools Copyright (c) 1996-2014 Texas Instruments Incorporated
C:\Users\wmj\AppData\Local\Temp\1055210                              PAGE   79

    4113                      .dwattr $C$DW$733, DW_AT_name("StBoxHandle")
    4114                      .dwattr $C$DW$733, DW_AT_TI_symbol_name("_StBoxHandle")
    4115                      .dwattr $C$DW$733, DW_AT_data_member_location[DW_OP_plus_uconst 0x4]
    4116                      .dwattr $C$DW$733, DW_AT_accessibility(DW_ACCESS_public)
    4117              $C$DW$734       .dwtag  DW_TAG_member
    4118                      .dwattr $C$DW$734, DW_AT_type(*$C$DW$T$87)
    4119                      .dwattr $C$DW$734, DW_AT_name("FSM_State")
    4120                      .dwattr $C$DW$734, DW_AT_TI_symbol_name("_FSM_State")
    4121                      .dwattr $C$DW$734, DW_AT_data_member_location[DW_OP_plus_uconst 0x6]
    4122                      .dwattr $C$DW$734, DW_AT_accessibility(DW_ACCESS_public)
    4123              $C$DW$735       .dwtag  DW_TAG_member
    4124                      .dwattr $C$DW$735, DW_AT_type(*$C$DW$T$87)
    4125                      .dwattr $C$DW$735, DW_AT_name("FSM_CurState")
    4126                      .dwattr $C$DW$735, DW_AT_TI_symbol_name("_FSM_CurState")
    4127                      .dwattr $C$DW$735, DW_AT_data_member_location[DW_OP_plus_uconst 0x7]
    4128                      .dwattr $C$DW$735, DW_AT_accessibility(DW_ACCESS_public)
    4129              $C$DW$736       .dwtag  DW_TAG_member
    4130                      .dwattr $C$DW$736, DW_AT_type(*$C$DW$T$89)
    4131                      .dwattr $C$DW$736, DW_AT_name("FSM_Trans")
    4132                      .dwattr $C$DW$736, DW_AT_TI_symbol_name("_FSM_Trans")
    4133                      .dwattr $C$DW$736, DW_AT_data_member_location[DW_OP_plus_uconst 0x8]
    4134                      .dwattr $C$DW$736, DW_AT_accessibility(DW_ACCESS_public)
    4135              $C$DW$737       .dwtag  DW_TAG_member
    4136                      .dwattr $C$DW$737, DW_AT_type(*$C$DW$T$91)
    4137                      .dwattr $C$DW$737, DW_AT_name("FSM_Event")
    4138                      .dwattr $C$DW$737, DW_AT_TI_symbol_name("_FSM_Event")
    4139                      .dwattr $C$DW$737, DW_AT_data_member_location[DW_OP_plus_uconst 0x9]
    4140                      .dwattr $C$DW$737, DW_AT_accessibility(DW_ACCESS_public)
    4141              $C$DW$738       .dwtag  DW_TAG_member
    4142                      .dwattr $C$DW$738, DW_AT_type(*$C$DW$T$93)
    4143                      .dwattr $C$DW$738, DW_AT_name("FSM_StMode")
    4144                      .dwattr $C$DW$738, DW_AT_TI_symbol_name("_FSM_StMode")
    4145                      .dwattr $C$DW$738, DW_AT_data_member_location[DW_OP_plus_uconst 0xa]
    4146                      .dwattr $C$DW$738, DW_AT_accessibility(DW_ACCESS_public)
    4147              $C$DW$739       .dwtag  DW_TAG_member
    4148                      .dwattr $C$DW$739, DW_AT_type(*$C$DW$T$22)
    4149                      .dwattr $C$DW$739, DW_AT_name("FSM_ErrFlg")
    4150                      .dwattr $C$DW$739, DW_AT_TI_symbol_name("_FSM_ErrFlg")
    4151                      .dwattr $C$DW$739, DW_AT_data_member_location[DW_OP_plus_uconst 0xb]
    4152                      .dwattr $C$DW$739, DW_AT_accessibility(DW_ACCESS_public)
    4153              $C$DW$740       .dwtag  DW_TAG_member
    4154                      .dwattr $C$DW$740, DW_AT_type(*$C$DW$T$22)
    4155                      .dwattr $C$DW$740, DW_AT_name("FSM_ErrMask")
    4156                      .dwattr $C$DW$740, DW_AT_TI_symbol_name("_FSM_ErrMask")
    4157                      .dwattr $C$DW$740, DW_AT_data_member_location[DW_OP_plus_uconst 0xc]
    4158                      .dwattr $C$DW$740, DW_AT_accessibility(DW_ACCESS_public)
    4159              $C$DW$741       .dwtag  DW_TAG_member
    4160                      .dwattr $C$DW$741, DW_AT_type(*$C$DW$T$22)
    4161                      .dwattr $C$DW$741, DW_AT_name("FSM_runTime")
    4162                      .dwattr $C$DW$741, DW_AT_TI_symbol_name("_FSM_runTime")
    4163                      .dwattr $C$DW$741, DW_AT_data_member_location[DW_OP_plus_uconst 0xd]
    4164                      .dwattr $C$DW$741, DW_AT_accessibility(DW_ACCESS_public)
    4165              $C$DW$742       .dwtag  DW_TAG_member
    4166                      .dwattr $C$DW$742, DW_AT_type(*$C$DW$T$22)
    4167                      .dwattr $C$DW$742, DW_AT_name("FSM_485Cmd")
TMS320C2000 Assembler PC v6.2.5 Tue Nov 21 22:57:45 2017

Tools Copyright (c) 1996-2014 Texas Instruments Incorporated
C:\Users\wmj\AppData\Local\Temp\1055210                              PAGE   80

    4168                      .dwattr $C$DW$742, DW_AT_TI_symbol_name("_FSM_485Cmd")
    4169                      .dwattr $C$DW$742, DW_AT_data_member_location[DW_OP_plus_uconst 0xe]
    4170                      .dwattr $C$DW$742, DW_AT_accessibility(DW_ACCESS_public)
    4171              $C$DW$743       .dwtag  DW_TAG_member
    4172                      .dwattr $C$DW$743, DW_AT_type(*$C$DW$T$87)
    4173                      .dwattr $C$DW$743, DW_AT_name("FSM_485EditState")
    4174                      .dwattr $C$DW$743, DW_AT_TI_symbol_name("_FSM_485EditState")
    4175                      .dwattr $C$DW$743, DW_AT_data_member_location[DW_OP_plus_uconst 0xf]
    4176                      .dwattr $C$DW$743, DW_AT_accessibility(DW_ACCESS_public)
    4177              $C$DW$744       .dwtag  DW_TAG_member
    4178                      .dwattr $C$DW$744, DW_AT_type(*$C$DW$T$95)
    4179                      .dwattr $C$DW$744, DW_AT_name("FSM_485EditOpt")
    4180                      .dwattr $C$DW$744, DW_AT_TI_symbol_name("_FSM_485EditOpt")
    4181                      .dwattr $C$DW$744, DW_AT_data_member_location[DW_OP_plus_uconst 0x10]
    4182                      .dwattr $C$DW$744, DW_AT_accessibility(DW_ACCESS_public)
    4183              $C$DW$745       .dwtag  DW_TAG_member
    4184                      .dwattr $C$DW$745, DW_AT_type(*$C$DW$T$22)
    4185                      .dwattr $C$DW$745, DW_AT_name("FSM_485RefSpeed")
    4186                      .dwattr $C$DW$745, DW_AT_TI_symbol_name("_FSM_485RefSpeed")
    4187                      .dwattr $C$DW$745, DW_AT_data_member_location[DW_OP_plus_uconst 0x11]
    4188                      .dwattr $C$DW$745, DW_AT_accessibility(DW_ACCESS_public)
    4189              $C$DW$746       .dwtag  DW_TAG_member
    4190                      .dwattr $C$DW$746, DW_AT_type(*$C$DW$T$31)
    4191                      .dwattr $C$DW$746, DW_AT_name("MaxTorque_Nm")
    4192                      .dwattr $C$DW$746, DW_AT_TI_symbol_name("_MaxTorque_Nm")
    4193                      .dwattr $C$DW$746, DW_AT_data_member_location[DW_OP_plus_uconst 0x12]
    4194                      .dwattr $C$DW$746, DW_AT_accessibility(DW_ACCESS_public)
    4195              $C$DW$747       .dwtag  DW_TAG_member
    4196                      .dwattr $C$DW$747, DW_AT_type(*$C$DW$T$97)
    4197                      .dwattr $C$DW$747, DW_AT_name("FSM_CheckCond")
    4198                      .dwattr $C$DW$747, DW_AT_TI_symbol_name("_FSM_CheckCond")
    4199                      .dwattr $C$DW$747, DW_AT_data_member_location[DW_OP_plus_uconst 0x14]
    4200                      .dwattr $C$DW$747, DW_AT_accessibility(DW_ACCESS_public)
    4201              $C$DW$748       .dwtag  DW_TAG_member
    4202                      .dwattr $C$DW$748, DW_AT_type(*$C$DW$T$22)
    4203                      .dwattr $C$DW$748, DW_AT_name("FSM_CondValue")
    4204                      .dwattr $C$DW$748, DW_AT_TI_symbol_name("_FSM_CondValue")
    4205                      .dwattr $C$DW$748, DW_AT_data_member_location[DW_OP_plus_uconst 0x15]
    4206                      .dwattr $C$DW$748, DW_AT_accessibility(DW_ACCESS_public)
    4207              $C$DW$749       .dwtag  DW_TAG_member
    4208                      .dwattr $C$DW$749, DW_AT_type(*$C$DW$T$98)
    4209                      .dwattr $C$DW$749, DW_AT_name("OldAbsPos")
    4210                      .dwattr $C$DW$749, DW_AT_TI_symbol_name("_OldAbsPos")
    4211                      .dwattr $C$DW$749, DW_AT_data_member_location[DW_OP_plus_uconst 0x16]
    4212                      .dwattr $C$DW$749, DW_AT_accessibility(DW_ACCESS_public)
    4213              $C$DW$750       .dwtag  DW_TAG_member
    4214                      .dwattr $C$DW$750, DW_AT_type(*$C$DW$T$98)
    4215                      .dwattr $C$DW$750, DW_AT_name("NewAbsPos")
    4216                      .dwattr $C$DW$750, DW_AT_TI_symbol_name("_NewAbsPos")
    4217                      .dwattr $C$DW$750, DW_AT_data_member_location[DW_OP_plus_uconst 0x1a]
    4218                      .dwattr $C$DW$750, DW_AT_accessibility(DW_ACCESS_public)
    4219              $C$DW$751       .dwtag  DW_TAG_member
