TMS320C2000 Assembler PC v6.2.5 Mon Sep 11 13:57:35 2017

Tools Copyright (c) 1996-2014 Texas Instruments Incorporated
C:\Users\wmj\AppData\Local\Temp\1579611                              PAGE    1

       1              ;***************************************************************
       2              ;* TMS320C2000 C/C++ Codegen                         PC v6.2.5 *
       3              ;* Date/Time created: Mon Sep 11 13:57:35 2017                 *
       4              ;***************************************************************
       5                      .compiler_opts --float_support=softlib --hll_source=on --mem_model:code=flat --mem_model:data=large -
       6        0002  FP      .set    XAR2
       7              
       8              $C$DW$CU        .dwtag  DW_TAG_compile_unit
       9                      .dwattr $C$DW$CU, DW_AT_name("D:/FOC_27/sw/drivers/drvic/S_curve.c")
      10                      .dwattr $C$DW$CU, DW_AT_producer("TMS320C2000 C/C++ Codegen PC v6.2.5 Copyright (c) 1996-2014 Texas I
      11                      .dwattr $C$DW$CU, DW_AT_TI_version(0x01)
      12                      .dwattr $C$DW$CU, DW_AT_comp_dir("D:\FOC_27\sw\solutions\instaspin_foc\boards\hvkit_rev1p1\f28x\f2802
      13              
      14              $C$DW$1 .dwtag  DW_TAG_subprogram, DW_AT_name("__IQmpy")
      15                      .dwattr $C$DW$1, DW_AT_TI_symbol_name("___IQmpy")
      16                      .dwattr $C$DW$1, DW_AT_type(*$C$DW$T$12)

    1145              $C$DW$71        .dwtag  DW_TAG_TI_branch
    1146                      .dwattr $C$DW$71, DW_AT_low_pc(0x00)
    1147                      .dwattr $C$DW$71, DW_AT_TI_return
    1148 000001cf 0006          LRETR     ; [CPU_] 
    1149                      ; return occurs ; [] 
    1150                      .dwattr $C$DW$66, DW_AT_TI_end_file("D:/FOC_27/sw/drivers/drvic/S_curve.c")
    1151                      .dwattr $C$DW$66, DW_AT_TI_end_line(0x18)
    1152                      .dwattr $C$DW$66, DW_AT_TI_end_column(0x01)
    1153                      .dwendentry
    1154                      .dwendtag $C$DW$66
    1155              
    1156              ;***************************************************************
    1157              ;* FLOATING-POINT CONSTANTS                                    *
    1158              ;***************************************************************
    1159 00000000               .sect   ".econst"
    1160                      .align  2
    1161 00000000 0000  $C$FL1: .xldouble       $strtod("0x1p+24")
         00000001 0000 
         00000002 0000 
         00000003 4170 
    1162              ;**************************************************************
    1163              ;* UNDEFINED EXTERNAL REFERENCES                              *
    1164              ;**************************************************************
    1165                      .global __IQ24div
    1166                      .global FD$$MPY
    1167                      .global FS$$TOFD
    1168                      .global UL$$TOFS
    1169                      .global FS$$MPY
    1170                      .global FD$$TOL
    1171                      .global L$$TOFS
    1172                      .global FS$$CMP
    1173              
    1174              ;***************************************************************
    1175              ;* TYPE INFORMATION                                            *
    1176              ;***************************************************************
    1177              
    1178              $C$DW$T$23      .dwtag  DW_TAG_enumeration_type
    1179                      .dwattr $C$DW$T$23, DW_AT_byte_size(0x01)
    1180              $C$DW$72        .dwtag  DW_TAG_enumerator, DW_AT_name("S_CURVE_IDLE"), DW_AT_const_value(0x00)
    1181              $C$DW$73        .dwtag  DW_TAG_enumerator, DW_AT_name("S_CURVE_Step1"), DW_AT_const_value(0x01)
    1182              $C$DW$74        .dwtag  DW_TAG_enumerator, DW_AT_name("S_CURVE_Step2"), DW_AT_const_value(0x02)
    1183              $C$DW$75        .dwtag  DW_TAG_enumerator, DW_AT_name("S_CURVE_Step3"), DW_AT_const_value(0x03)
    1184              $C$DW$76        .dwtag  DW_TAG_enumerator, DW_AT_name("S_CURVE_Step4"), DW_AT_const_value(0x04)
    1185              $C$DW$77        .dwtag  DW_TAG_enumerator, DW_AT_name("S_CURVE_Step5"), DW_AT_const_value(0x05)
    1186              $C$DW$78        .dwtag  DW_TAG_enumerator, DW_AT_name("S_CURVE_Step6"), DW_AT_const_value(0x06)
    1187              $C$DW$79        .dwtag  DW_TAG_enumerator, DW_AT_name("S_CURVE_Step7"), DW_AT_const_value(0x07)
TMS320C2000 Assembler PC v6.2.5 Mon Sep 11 13:57:35 2017

Tools Copyright (c) 1996-2014 Texas Instruments Incorporated
C:\Users\wmj\AppData\Local\Temp\1579611                              PAGE   24

    1188              $C$DW$80        .dwtag  DW_TAG_enumerator, DW_AT_name("S_CURVE_Step8"), DW_AT_const_value(0x08)
    1189                      .dwendtag $C$DW$T$23
    1190              
    1191              $C$DW$T$24      .dwtag  DW_TAG_typedef, DW_AT_name("S_CURVE_States_e")
    1192                      .dwattr $C$DW$T$24, DW_AT_type(*$C$DW$T$23)
    1193                      .dwattr $C$DW$T$24, DW_AT_language(DW_LANG_C)
    1194              
    1195              $C$DW$T$26      .dwtag  DW_TAG_enumeration_type
    1196                      .dwattr $C$DW$T$26, DW_AT_byte_size(0x01)
    1197              $C$DW$81        .dwtag  DW_TAG_enumerator, DW_AT_name("S_CURVE_Speed_Stage1"), DW_AT_const_value(0x00)
    1198              $C$DW$82        .dwtag  DW_TAG_enumerator, DW_AT_name("S_CURVE_Speed_Stage2"), DW_AT_const_value(0x01)
    1199              $C$DW$83        .dwtag  DW_TAG_enumerator, DW_AT_name("S_CURVE_Speed_Stage3"), DW_AT_const_value(0x02)
    1200              $C$DW$84        .dwtag  DW_TAG_enumerator, DW_AT_name("S_CURVE_Speed_Stage4"), DW_AT_const_value(0x03)
    1201              $C$DW$85        .dwtag  DW_TAG_enumerator, DW_AT_name("S_CURVE_Speed_Stage5"), DW_AT_const_value(0x04)
    1202              $C$DW$86        .dwtag  DW_TAG_enumerator, DW_AT_name("S_CURVE_Speed_Stage6"), DW_AT_const_value(0x05)
    1203              $C$DW$87        .dwtag  DW_TAG_enumerator, DW_AT_name("S_CURVE_Speed_Stage7"), DW_AT_const_value(0x06)
    1204                      .dwendtag $C$DW$T$26
    1205              
    1206              $C$DW$T$27      .dwtag  DW_TAG_typedef, DW_AT_name("S_CURVE_Stages_e")
    1207                      .dwattr $C$DW$T$27, DW_AT_type(*$C$DW$T$26)
    1208                      .dwattr $C$DW$T$27, DW_AT_language(DW_LANG_C)
    1209              $C$DW$88        .dwtag  DW_TAG_TI_far_type
    1210                      .dwattr $C$DW$88, DW_AT_type(*$C$DW$T$27)
    1211              $C$DW$T$28      .dwtag  DW_TAG_const_type
    1212                      .dwattr $C$DW$T$28, DW_AT_type(*$C$DW$88)
    1213              
    1214              $C$DW$T$25      .dwtag  DW_TAG_structure_type
    1215                      .dwattr $C$DW$T$25, DW_AT_name("_S_CURVE_Obj_")
    1216                      .dwattr $C$DW$T$25, DW_AT_byte_size(0x1a)
    1217              $C$DW$89        .dwtag  DW_TAG_member
    1218                      .dwattr $C$DW$89, DW_AT_type(*$C$DW$T$19)
    1219                      .dwattr $C$DW$89, DW_AT_name("max_accele")
    1220                      .dwattr $C$DW$89, DW_AT_TI_symbol_name("_max_accele")
    1221                      .dwattr $C$DW$89, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    1222                      .dwattr $C$DW$89, DW_AT_accessibility(DW_ACCESS_public)
    1223              $C$DW$90        .dwtag  DW_TAG_member
    1224                      .dwattr $C$DW$90, DW_AT_type(*$C$DW$T$19)
    1225                      .dwattr $C$DW$90, DW_AT_name("curve_jerk")
    1226                      .dwattr $C$DW$90, DW_AT_TI_symbol_name("_curve_jerk")
    1227                      .dwattr $C$DW$90, DW_AT_data_member_location[DW_OP_plus_uconst 0x2]
    1228                      .dwattr $C$DW$90, DW_AT_accessibility(DW_ACCESS_public)
    1229              $C$DW$91        .dwtag  DW_TAG_member
    1230                      .dwattr $C$DW$91, DW_AT_type(*$C$DW$T$19)
    1231                      .dwattr $C$DW$91, DW_AT_name("accDeltSpd")
    1232                      .dwattr $C$DW$91, DW_AT_TI_symbol_name("_accDeltSpd")
    1233                      .dwattr $C$DW$91, DW_AT_data_member_location[DW_OP_plus_uconst 0x4]
    1234                      .dwattr $C$DW$91, DW_AT_accessibility(DW_ACCESS_public)
    1235              $C$DW$92        .dwtag  DW_TAG_member
    1236                      .dwattr $C$DW$92, DW_AT_type(*$C$DW$T$19)
    1237                      .dwattr $C$DW$92, DW_AT_name("Vl_speed")
    1238                      .dwattr $C$DW$92, DW_AT_TI_symbol_name("_Vl_speed")
    1239                      .dwattr $C$DW$92, DW_AT_data_member_location[DW_OP_plus_uconst 0x6]
    1240                      .dwattr $C$DW$92, DW_AT_accessibility(DW_ACCESS_public)
    1241              $C$DW$93        .dwtag  DW_TAG_member
    1242                      .dwattr $C$DW$93, DW_AT_type(*$C$DW$T$19)
TMS320C2000 Assembler PC v6.2.5 Mon Sep 11 13:57:35 2017

Tools Copyright (c) 1996-2014 Texas Instruments Incorporated
C:\Users\wmj\AppData\Local\Temp\1579611                              PAGE   25

    1243                      .dwattr $C$DW$93, DW_AT_name("Vm_speed")
    1244                      .dwattr $C$DW$93, DW_AT_TI_symbol_name("_Vm_speed")
    1245                      .dwattr $C$DW$93, DW_AT_data_member_location[DW_OP_plus_uconst 0x8]
    1246                      .dwattr $C$DW$93, DW_AT_accessibility(DW_ACCESS_public)
    1247              $C$DW$94        .dwtag  DW_TAG_member
    1248                      .dwattr $C$DW$94, DW_AT_type(*$C$DW$T$19)
    1249                      .dwattr $C$DW$94, DW_AT_name("start_speed")
    1250                      .dwattr $C$DW$94, DW_AT_TI_symbol_name("_start_speed")
    1251                      .dwattr $C$DW$94, DW_AT_data_member_location[DW_OP_plus_uconst 0xa]
    1252                      .dwattr $C$DW$94, DW_AT_accessibility(DW_ACCESS_public)
    1253              $C$DW$95        .dwtag  DW_TAG_member
    1254                      .dwattr $C$DW$95, DW_AT_type(*$C$DW$T$19)
    1255                      .dwattr $C$DW$95, DW_AT_name("end_speed")
    1256                      .dwattr $C$DW$95, DW_AT_TI_symbol_name("_end_speed")
    1257                      .dwattr $C$DW$95, DW_AT_data_member_location[DW_OP_plus_uconst 0xc]
    1258                      .dwattr $C$DW$95, DW_AT_accessibility(DW_ACCESS_public)
    1259              $C$DW$96        .dwtag  DW_TAG_member
    1260                      .dwattr $C$DW$96, DW_AT_type(*$C$DW$T$19)
    1261                      .dwattr $C$DW$96, DW_AT_name("set_speed")
    1262                      .dwattr $C$DW$96, DW_AT_TI_symbol_name("_set_speed")
    1263                      .dwattr $C$DW$96, DW_AT_data_member_location[DW_OP_plus_uconst 0xe]
    1264                      .dwattr $C$DW$96, DW_AT_accessibility(DW_ACCESS_public)
    1265              $C$DW$97        .dwtag  DW_TAG_member
    1266                      .dwattr $C$DW$97, DW_AT_type(*$C$DW$T$19)
    1267                      .dwattr $C$DW$97, DW_AT_name("reduc_dist")
    1268                      .dwattr $C$DW$97, DW_AT_TI_symbol_name("_reduc_dist")
    1269                      .dwattr $C$DW$97, DW_AT_data_member_location[DW_OP_plus_uconst 0x10]
    1270                      .dwattr $C$DW$97, DW_AT_accessibility(DW_ACCESS_public)
    1271              $C$DW$98        .dwtag  DW_TAG_member
    1272                      .dwattr $C$DW$98, DW_AT_type(*$C$DW$T$20)
    1273                      .dwattr $C$DW$98, DW_AT_name("curvePeriod_sec")
    1274                      .dwattr $C$DW$98, DW_AT_TI_symbol_name("_curvePeriod_sec")
    1275                      .dwattr $C$DW$98, DW_AT_data_member_location[DW_OP_plus_uconst 0x12]
    1276                      .dwattr $C$DW$98, DW_AT_accessibility(DW_ACCESS_public)
    1277              $C$DW$99        .dwtag  DW_TAG_member
    1278                      .dwattr $C$DW$99, DW_AT_type(*$C$DW$T$21)
    1279                      .dwattr $C$DW$99, DW_AT_name("counter_speed")
    1280                      .dwattr $C$DW$99, DW_AT_TI_symbol_name("_counter_speed")
    1281                      .dwattr $C$DW$99, DW_AT_data_member_location[DW_OP_plus_uconst 0x14]
    1282                      .dwattr $C$DW$99, DW_AT_accessibility(DW_ACCESS_public)
    1283              $C$DW$100       .dwtag  DW_TAG_member
    1284                      .dwattr $C$DW$100, DW_AT_type(*$C$DW$T$22)
    1285                      .dwattr $C$DW$100, DW_AT_name("mov_dir")
    1286                      .dwattr $C$DW$100, DW_AT_TI_symbol_name("_mov_dir")
    1287                      .dwattr $C$DW$100, DW_AT_data_member_location[DW_OP_plus_uconst 0x16]
    1288                      .dwattr $C$DW$100, DW_AT_accessibility(DW_ACCESS_public)
    1289              $C$DW$101       .dwtag  DW_TAG_member
    1290                      .dwattr $C$DW$101, DW_AT_type(*$C$DW$T$22)
    1291                      .dwattr $C$DW$101, DW_AT_name("curveRun_flag")
    1292                      .dwattr $C$DW$101, DW_AT_TI_symbol_name("_curveRun_flag")
    1293                      .dwattr $C$DW$101, DW_AT_data_member_location[DW_OP_plus_uconst 0x17]
    1294                      .dwattr $C$DW$101, DW_AT_accessibility(DW_ACCESS_public)
    1295              $C$DW$102       .dwtag  DW_TAG_member
    1296                      .dwattr $C$DW$102, DW_AT_type(*$C$DW$T$24)
    1297                      .dwattr $C$DW$102, DW_AT_name("curve_state")
TMS320C2000 Assembler PC v6.2.5 Mon Sep 11 13:57:35 2017

Tools Copyright (c) 1996-2014 Texas Instruments Incorporated
C:\Users\wmj\AppData\Local\Temp\1579611                              PAGE   26

    1298                      .dwattr $C$DW$102, DW_AT_TI_symbol_name("_curve_state")
    1299                      .dwattr $C$DW$102, DW_AT_data_member_location[DW_OP_plus_uconst 0x18]
    1300                      .dwattr $C$DW$102, DW_AT_accessibility(DW_ACCESS_public)
    1301                      .dwendtag $C$DW$T$25
    1302              
    1303              $C$DW$T$29      .dwtag  DW_TAG_typedef, DW_AT_name("S_CURVE_Obj")
    1304                      .dwattr $C$DW$T$29, DW_AT_type(*$C$DW$T$25)
    1305                      .dwattr $C$DW$T$29, DW_AT_language(DW_LANG_C)
    1306              $C$DW$T$30      .dwtag  DW_TAG_pointer_type
    1307                      .dwattr $C$DW$T$30, DW_AT_type(*$C$DW$T$25)
    1308                      .dwattr $C$DW$T$30, DW_AT_address_class(0x16)
    1309              $C$DW$T$31      .dwtag  DW_TAG_typedef, DW_AT_name("S_CURVE_Handle")
    1310                      .dwattr $C$DW$T$31, DW_AT_type(*$C$DW$T$30)
    1311                      .dwattr $C$DW$T$31, DW_AT_language(DW_LANG_C)
    1312              $C$DW$103       .dwtag  DW_TAG_TI_far_type
    1313                      .dwattr $C$DW$103, DW_AT_type(*$C$DW$T$31)
    1314              $C$DW$T$32      .dwtag  DW_TAG_const_type
    1315                      .dwattr $C$DW$T$32, DW_AT_type(*$C$DW$103)
    1316              $C$DW$T$3       .dwtag  DW_TAG_pointer_type
    1317                      .dwattr $C$DW$T$3, DW_AT_address_class(0x16)
    1318              $C$DW$104       .dwtag  DW_TAG_TI_far_type
    1319                      .dwattr $C$DW$104, DW_AT_type(*$C$DW$T$3)
    1320              $C$DW$T$38      .dwtag  DW_TAG_const_type
    1321                      .dwattr $C$DW$T$38, DW_AT_type(*$C$DW$104)
    1322              $C$DW$T$4       .dwtag  DW_TAG_base_type
    1323                      .dwattr $C$DW$T$4, DW_AT_encoding(DW_ATE_boolean)
    1324                      .dwattr $C$DW$T$4, DW_AT_name("bool")
    1325                      .dwattr $C$DW$T$4, DW_AT_byte_size(0x01)
    1326              $C$DW$T$5       .dwtag  DW_TAG_base_type
    1327                      .dwattr $C$DW$T$5, DW_AT_encoding(DW_ATE_signed_char)
    1328                      .dwattr $C$DW$T$5, DW_AT_name("signed char")
    1329                      .dwattr $C$DW$T$5, DW_AT_byte_size(0x01)
    1330              $C$DW$T$6       .dwtag  DW_TAG_base_type
    1331                      .dwattr $C$DW$T$6, DW_AT_encoding(DW_ATE_unsigned_char)
    1332                      .dwattr $C$DW$T$6, DW_AT_name("unsigned char")
    1333                      .dwattr $C$DW$T$6, DW_AT_byte_size(0x01)
    1334              $C$DW$T$22      .dwtag  DW_TAG_typedef, DW_AT_name("_Bool")
    1335                      .dwattr $C$DW$T$22, DW_AT_type(*$C$DW$T$6)
    1336                      .dwattr $C$DW$T$22, DW_AT_language(DW_LANG_C)
    1337              $C$DW$T$7       .dwtag  DW_TAG_base_type
    1338                      .dwattr $C$DW$T$7, DW_AT_encoding(DW_ATE_signed_char)
    1339                      .dwattr $C$DW$T$7, DW_AT_name("wchar_t")
    1340                      .dwattr $C$DW$T$7, DW_AT_byte_size(0x01)
    1341              $C$DW$T$8       .dwtag  DW_TAG_base_type
    1342                      .dwattr $C$DW$T$8, DW_AT_encoding(DW_ATE_signed)
    1343                      .dwattr $C$DW$T$8, DW_AT_name("short")
    1344                      .dwattr $C$DW$T$8, DW_AT_byte_size(0x01)
    1345              $C$DW$T$9       .dwtag  DW_TAG_base_type
    1346                      .dwattr $C$DW$T$9, DW_AT_encoding(DW_ATE_unsigned)
    1347                      .dwattr $C$DW$T$9, DW_AT_name("unsigned short")
    1348                      .dwattr $C$DW$T$9, DW_AT_byte_size(0x01)
    1349              $C$DW$T$10      .dwtag  DW_TAG_base_type
    1350                      .dwattr $C$DW$T$10, DW_AT_encoding(DW_ATE_signed)
    1351                      .dwattr $C$DW$T$10, DW_AT_name("int")
    1352                      .dwattr $C$DW$T$10, DW_AT_byte_size(0x01)
TMS320C2000 Assembler PC v6.2.5 Mon Sep 11 13:57:35 2017

Tools Copyright (c) 1996-2014 Texas Instruments Incorporated
