TMS320C2000 Assembler PC v6.2.5 Sat Sep 16 14:55:52 2017

Tools Copyright (c) 1996-2014 Texas Instruments Incorporated
C:\Users\wmj\AppData\Local\Temp\1084411                              PAGE    1

       1              ;***************************************************************
       2              ;* TMS320C2000 C/C++ Codegen                         PC v6.2.5 *
       3              ;* Date/Time created: Sat Sep 16 14:55:52 2017                 *
       4              ;***************************************************************
       5                      .compiler_opts --float_support=softlib --hll_source=on --mem_model:code=flat --mem_model:data=large -
       6        0002  FP      .set    XAR2
       7              
       8              $C$DW$CU        .dwtag  DW_TAG_compile_unit
       9                      .dwattr $C$DW$CU, DW_AT_name("D:/BM1000/sw/drivers/sci/src/32b/f28x/f2802x/sci.c")
      10                      .dwattr $C$DW$CU, DW_AT_producer("TMS320C2000 C/C++ Codegen PC v6.2.5 Copyright (c) 1996-2014 Texas I
      11                      .dwattr $C$DW$CU, DW_AT_TI_version(0x01)
      12                      .dwattr $C$DW$CU, DW_AT_comp_dir("D:\BM1000\sw\solutions\instaspin_foc\boards\hvkit_rev1p1\f28x\f2802
      13              ;       C:\ti\ccsv6\tools\compiler\c2000_6.2.5\bin\opt2000.exe C:\\Users\\wmj\\AppData\\Local\\Temp\\108443 C

    3185              $C$DW$T$36      .dwtag  DW_TAG_typedef, DW_AT_name("SCI_Mode_e")
    3186                      .dwattr $C$DW$T$36, DW_AT_type(*$C$DW$T$35)
    3187                      .dwattr $C$DW$T$36, DW_AT_language(DW_LANG_C)
    3188              $C$DW$272       .dwtag  DW_TAG_TI_far_type
    3189                      .dwattr $C$DW$272, DW_AT_type(*$C$DW$T$36)
    3190              $C$DW$T$37      .dwtag  DW_TAG_const_type
    3191                      .dwattr $C$DW$T$37, DW_AT_type(*$C$DW$272)
    3192              
    3193              $C$DW$T$38      .dwtag  DW_TAG_enumeration_type
TMS320C2000 Assembler PC v6.2.5 Sat Sep 16 14:55:52 2017

Tools Copyright (c) 1996-2014 Texas Instruments Incorporated
C:\Users\wmj\AppData\Local\Temp\1084411                              PAGE   60

    3194                      .dwattr $C$DW$T$38, DW_AT_byte_size(0x01)
    3195              $C$DW$273       .dwtag  DW_TAG_enumerator, DW_AT_name("SCI_NumStopBits_One"), DW_AT_const_value(0x00)
    3196              $C$DW$274       .dwtag  DW_TAG_enumerator, DW_AT_name("SCI_NumStopBits_Two"), DW_AT_const_value(0x80)
    3197                      .dwendtag $C$DW$T$38
    3198              
    3199              $C$DW$T$39      .dwtag  DW_TAG_typedef, DW_AT_name("SCI_NumStopBits_e")
    3200                      .dwattr $C$DW$T$39, DW_AT_type(*$C$DW$T$38)
    3201                      .dwattr $C$DW$T$39, DW_AT_language(DW_LANG_C)
    3202              $C$DW$275       .dwtag  DW_TAG_TI_far_type
    3203                      .dwattr $C$DW$275, DW_AT_type(*$C$DW$T$39)
    3204              $C$DW$T$40      .dwtag  DW_TAG_const_type
    3205                      .dwattr $C$DW$T$40, DW_AT_type(*$C$DW$275)
    3206              
    3207              $C$DW$T$41      .dwtag  DW_TAG_enumeration_type
    3208                      .dwattr $C$DW$T$41, DW_AT_byte_size(0x01)
    3209              $C$DW$276       .dwtag  DW_TAG_enumerator, DW_AT_name("SCI_Priority_Immediate"), DW_AT_const_value(0x00)
    3210              $C$DW$277       .dwtag  DW_TAG_enumerator, DW_AT_name("SCI_Priority_FreeRun"), DW_AT_const_value(0x08)
    3211              $C$DW$278       .dwtag  DW_TAG_enumerator, DW_AT_name("SCI_Priority_AfterRxRxSeq"), DW_AT_const_value(0x10)
    3212                      .dwendtag $C$DW$T$41
    3213              
    3214              $C$DW$T$42      .dwtag  DW_TAG_typedef, DW_AT_name("SCI_Priority_e")
    3215                      .dwattr $C$DW$T$42, DW_AT_type(*$C$DW$T$41)
    3216                      .dwattr $C$DW$T$42, DW_AT_language(DW_LANG_C)
    3217              $C$DW$279       .dwtag  DW_TAG_TI_far_type
    3218                      .dwattr $C$DW$279, DW_AT_type(*$C$DW$T$42)
    3219              $C$DW$T$43      .dwtag  DW_TAG_const_type
    3220                      .dwattr $C$DW$T$43, DW_AT_type(*$C$DW$279)
    3221              
    3222              $C$DW$T$44      .dwtag  DW_TAG_enumeration_type
    3223                      .dwattr $C$DW$T$44, DW_AT_byte_size(0x01)
    3224              $C$DW$280       .dwtag  DW_TAG_enumerator, DW_AT_name("SCI_Parity_Odd"), DW_AT_const_value(0x00)
    3225              $C$DW$281       .dwtag  DW_TAG_enumerator, DW_AT_name("SCI_Parity_Even"), DW_AT_const_value(0x40)
    3226                      .dwendtag $C$DW$T$44
    3227              
    3228              $C$DW$T$45      .dwtag  DW_TAG_typedef, DW_AT_name("SCI_Parity_e")
    3229                      .dwattr $C$DW$T$45, DW_AT_type(*$C$DW$T$44)
    3230                      .dwattr $C$DW$T$45, DW_AT_language(DW_LANG_C)
    3231              $C$DW$282       .dwtag  DW_TAG_TI_far_type
    3232                      .dwattr $C$DW$282, DW_AT_type(*$C$DW$T$45)
    3233              $C$DW$T$46      .dwtag  DW_TAG_const_type
    3234                      .dwattr $C$DW$T$46, DW_AT_type(*$C$DW$282)
    3235              
    3236              $C$DW$T$47      .dwtag  DW_TAG_enumeration_type
    3237                      .dwattr $C$DW$T$47, DW_AT_byte_size(0x01)
    3238              $C$DW$283       .dwtag  DW_TAG_enumerator, DW_AT_name("SCI_FifoLevel_Empty"), DW_AT_const_value(0x00)
    3239              $C$DW$284       .dwtag  DW_TAG_enumerator, DW_AT_name("SCI_FifoLevel_1_Word"), DW_AT_const_value(0x01)
    3240              $C$DW$285       .dwtag  DW_TAG_enumerator, DW_AT_name("SCI_FifoLevel_2_Words"), DW_AT_const_value(0x02)
    3241              $C$DW$286       .dwtag  DW_TAG_enumerator, DW_AT_name("SCI_FifoLevel_3_Words"), DW_AT_const_value(0x03)
    3242              $C$DW$287       .dwtag  DW_TAG_enumerator, DW_AT_name("SCI_FifoLevel_4_Words"), DW_AT_const_value(0x04)
    3243                      .dwendtag $C$DW$T$47
    3244              
    3245              $C$DW$T$48      .dwtag  DW_TAG_typedef, DW_AT_name("SCI_FifoLevel_e")
    3246                      .dwattr $C$DW$T$48, DW_AT_type(*$C$DW$T$47)
    3247                      .dwattr $C$DW$T$48, DW_AT_language(DW_LANG_C)
    3248              $C$DW$288       .dwtag  DW_TAG_TI_far_type
TMS320C2000 Assembler PC v6.2.5 Sat Sep 16 14:55:52 2017

Tools Copyright (c) 1996-2014 Texas Instruments Incorporated
C:\Users\wmj\AppData\Local\Temp\1084411                              PAGE   61

    3249                      .dwattr $C$DW$288, DW_AT_type(*$C$DW$T$48)
    3250              $C$DW$T$49      .dwtag  DW_TAG_const_type
    3251                      .dwattr $C$DW$T$49, DW_AT_type(*$C$DW$288)
    3252              
    3253              $C$DW$T$22      .dwtag  DW_TAG_structure_type
    3254                      .dwattr $C$DW$T$22, DW_AT_name("_SCI_Obj_")
    3255                      .dwattr $C$DW$T$22, DW_AT_byte_size(0x10)
    3256              $C$DW$289       .dwtag  DW_TAG_member
    3257                      .dwattr $C$DW$289, DW_AT_type(*$C$DW$T$20)
    3258                      .dwattr $C$DW$289, DW_AT_name("SCICCR")
    3259                      .dwattr $C$DW$289, DW_AT_TI_symbol_name("_SCICCR")
    3260                      .dwattr $C$DW$289, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    3261                      .dwattr $C$DW$289, DW_AT_accessibility(DW_ACCESS_public)
    3262              $C$DW$290       .dwtag  DW_TAG_member
    3263                      .dwattr $C$DW$290, DW_AT_type(*$C$DW$T$20)
    3264                      .dwattr $C$DW$290, DW_AT_name("SCICTL1")
    3265                      .dwattr $C$DW$290, DW_AT_TI_symbol_name("_SCICTL1")
    3266                      .dwattr $C$DW$290, DW_AT_data_member_location[DW_OP_plus_uconst 0x1]
    3267                      .dwattr $C$DW$290, DW_AT_accessibility(DW_ACCESS_public)
    3268              $C$DW$291       .dwtag  DW_TAG_member
    3269                      .dwattr $C$DW$291, DW_AT_type(*$C$DW$T$20)
    3270                      .dwattr $C$DW$291, DW_AT_name("SCIHBAUD")
    3271                      .dwattr $C$DW$291, DW_AT_TI_symbol_name("_SCIHBAUD")
    3272                      .dwattr $C$DW$291, DW_AT_data_member_location[DW_OP_plus_uconst 0x2]
    3273                      .dwattr $C$DW$291, DW_AT_accessibility(DW_ACCESS_public)
    3274              $C$DW$292       .dwtag  DW_TAG_member
    3275                      .dwattr $C$DW$292, DW_AT_type(*$C$DW$T$20)
    3276                      .dwattr $C$DW$292, DW_AT_name("SCILBAUD")
    3277                      .dwattr $C$DW$292, DW_AT_TI_symbol_name("_SCILBAUD")
    3278                      .dwattr $C$DW$292, DW_AT_data_member_location[DW_OP_plus_uconst 0x3]
    3279                      .dwattr $C$DW$292, DW_AT_accessibility(DW_ACCESS_public)
    3280              $C$DW$293       .dwtag  DW_TAG_member
    3281                      .dwattr $C$DW$293, DW_AT_type(*$C$DW$T$20)
    3282                      .dwattr $C$DW$293, DW_AT_name("SCICTL2")
    3283                      .dwattr $C$DW$293, DW_AT_TI_symbol_name("_SCICTL2")
    3284                      .dwattr $C$DW$293, DW_AT_data_member_location[DW_OP_plus_uconst 0x4]
    3285                      .dwattr $C$DW$293, DW_AT_accessibility(DW_ACCESS_public)
    3286              $C$DW$294       .dwtag  DW_TAG_member
    3287                      .dwattr $C$DW$294, DW_AT_type(*$C$DW$T$20)
    3288                      .dwattr $C$DW$294, DW_AT_name("SCIRXST")
    3289                      .dwattr $C$DW$294, DW_AT_TI_symbol_name("_SCIRXST")
    3290                      .dwattr $C$DW$294, DW_AT_data_member_location[DW_OP_plus_uconst 0x5]
    3291                      .dwattr $C$DW$294, DW_AT_accessibility(DW_ACCESS_public)
    3292              $C$DW$295       .dwtag  DW_TAG_member
    3293                      .dwattr $C$DW$295, DW_AT_type(*$C$DW$T$20)
    3294                      .dwattr $C$DW$295, DW_AT_name("SCIRXEMU")
    3295                      .dwattr $C$DW$295, DW_AT_TI_symbol_name("_SCIRXEMU")
    3296                      .dwattr $C$DW$295, DW_AT_data_member_location[DW_OP_plus_uconst 0x6]
    3297                      .dwattr $C$DW$295, DW_AT_accessibility(DW_ACCESS_public)
    3298              $C$DW$296       .dwtag  DW_TAG_member
    3299                      .dwattr $C$DW$296, DW_AT_type(*$C$DW$T$20)
    3300                      .dwattr $C$DW$296, DW_AT_name("SCIRXBUF")
    3301                      .dwattr $C$DW$296, DW_AT_TI_symbol_name("_SCIRXBUF")
    3302                      .dwattr $C$DW$296, DW_AT_data_member_location[DW_OP_plus_uconst 0x7]
    3303                      .dwattr $C$DW$296, DW_AT_accessibility(DW_ACCESS_public)
TMS320C2000 Assembler PC v6.2.5 Sat Sep 16 14:55:52 2017

Tools Copyright (c) 1996-2014 Texas Instruments Incorporated
C:\Users\wmj\AppData\Local\Temp\1084411                              PAGE   62

    3304              $C$DW$297       .dwtag  DW_TAG_member
    3305                      .dwattr $C$DW$297, DW_AT_type(*$C$DW$T$20)
    3306                      .dwattr $C$DW$297, DW_AT_name("rsvd_1")
    3307                      .dwattr $C$DW$297, DW_AT_TI_symbol_name("_rsvd_1")
    3308                      .dwattr $C$DW$297, DW_AT_data_member_location[DW_OP_plus_uconst 0x8]
    3309                      .dwattr $C$DW$297, DW_AT_accessibility(DW_ACCESS_public)
    3310              $C$DW$298       .dwtag  DW_TAG_member
    3311                      .dwattr $C$DW$298, DW_AT_type(*$C$DW$T$20)
    3312                      .dwattr $C$DW$298, DW_AT_name("SCITXBUF")
    3313                      .dwattr $C$DW$298, DW_AT_TI_symbol_name("_SCITXBUF")
    3314                      .dwattr $C$DW$298, DW_AT_data_member_location[DW_OP_plus_uconst 0x9]
    3315                      .dwattr $C$DW$298, DW_AT_accessibility(DW_ACCESS_public)
    3316              $C$DW$299       .dwtag  DW_TAG_member
    3317                      .dwattr $C$DW$299, DW_AT_type(*$C$DW$T$20)
    3318                      .dwattr $C$DW$299, DW_AT_name("SCIFFTX")
    3319                      .dwattr $C$DW$299, DW_AT_TI_symbol_name("_SCIFFTX")
    3320                      .dwattr $C$DW$299, DW_AT_data_member_location[DW_OP_plus_uconst 0xa]
    3321                      .dwattr $C$DW$299, DW_AT_accessibility(DW_ACCESS_public)
    3322              $C$DW$300       .dwtag  DW_TAG_member
    3323                      .dwattr $C$DW$300, DW_AT_type(*$C$DW$T$20)
    3324                      .dwattr $C$DW$300, DW_AT_name("SCIFFRX")
    3325                      .dwattr $C$DW$300, DW_AT_TI_symbol_name("_SCIFFRX")
    3326                      .dwattr $C$DW$300, DW_AT_data_member_location[DW_OP_plus_uconst 0xb]
    3327                      .dwattr $C$DW$300, DW_AT_accessibility(DW_ACCESS_public)
    3328              $C$DW$301       .dwtag  DW_TAG_member
    3329                      .dwattr $C$DW$301, DW_AT_type(*$C$DW$T$20)
    3330                      .dwattr $C$DW$301, DW_AT_name("SCIFFCT")
    3331                      .dwattr $C$DW$301, DW_AT_TI_symbol_name("_SCIFFCT")
    3332                      .dwattr $C$DW$301, DW_AT_data_member_location[DW_OP_plus_uconst 0xc]
    3333                      .dwattr $C$DW$301, DW_AT_accessibility(DW_ACCESS_public)
    3334              $C$DW$302       .dwtag  DW_TAG_member
    3335                      .dwattr $C$DW$302, DW_AT_type(*$C$DW$T$21)
    3336                      .dwattr $C$DW$302, DW_AT_name("rsvd_2")
    3337                      .dwattr $C$DW$302, DW_AT_TI_symbol_name("_rsvd_2")
    3338                      .dwattr $C$DW$302, DW_AT_data_member_location[DW_OP_plus_uconst 0xd]
    3339                      .dwattr $C$DW$302, DW_AT_accessibility(DW_ACCESS_public)
    3340              $C$DW$303       .dwtag  DW_TAG_member
    3341                      .dwattr $C$DW$303, DW_AT_type(*$C$DW$T$20)
    3342                      .dwattr $C$DW$303, DW_AT_name("SCIPRI")
    3343                      .dwattr $C$DW$303, DW_AT_TI_symbol_name("_SCIPRI")
    3344                      .dwattr $C$DW$303, DW_AT_data_member_location[DW_OP_plus_uconst 0xf]
    3345                      .dwattr $C$DW$303, DW_AT_accessibility(DW_ACCESS_public)
    3346                      .dwendtag $C$DW$T$22
    3347              
    3348              $C$DW$T$50      .dwtag  DW_TAG_typedef, DW_AT_name("SCI_Obj")
    3349                      .dwattr $C$DW$T$50, DW_AT_type(*$C$DW$T$22)
    3350                      .dwattr $C$DW$T$50, DW_AT_language(DW_LANG_C)
    3351              $C$DW$T$25      .dwtag  DW_TAG_pointer_type
    3352                      .dwattr $C$DW$T$25, DW_AT_type(*$C$DW$T$22)
    3353                      .dwattr $C$DW$T$25, DW_AT_address_class(0x16)
    3354              $C$DW$T$26      .dwtag  DW_TAG_typedef, DW_AT_name("SCI_Handle")
    3355                      .dwattr $C$DW$T$26, DW_AT_type(*$C$DW$T$25)
    3356                      .dwattr $C$DW$T$26, DW_AT_language(DW_LANG_C)
    3357              $C$DW$304       .dwtag  DW_TAG_TI_far_type
    3358                      .dwattr $C$DW$304, DW_AT_type(*$C$DW$T$26)
TMS320C2000 Assembler PC v6.2.5 Sat Sep 16 14:55:52 2017

Tools Copyright (c) 1996-2014 Texas Instruments Incorporated
C:\Users\wmj\AppData\Local\Temp\1084411                              PAGE   63

    3359              $C$DW$T$51      .dwtag  DW_TAG_const_type
    3360                      .dwattr $C$DW$T$51, DW_AT_type(*$C$DW$304)
    3361              $C$DW$T$3       .dwtag  DW_TAG_pointer_type
    3362                      .dwattr $C$DW$T$3, DW_AT_address_class(0x16)
    3363              $C$DW$305       .dwtag  DW_TAG_TI_far_type
    3364                      .dwattr $C$DW$305, DW_AT_type(*$C$DW$T$3)
    3365              $C$DW$T$57      .dwtag  DW_TAG_const_type
    3366                      .dwattr $C$DW$T$57, DW_AT_type(*$C$DW$305)
    3367              $C$DW$T$4       .dwtag  DW_TAG_base_type
    3368                      .dwattr $C$DW$T$4, DW_AT_encoding(DW_ATE_boolean)
    3369                      .dwattr $C$DW$T$4, DW_AT_name("bool")
    3370                      .dwattr $C$DW$T$4, DW_AT_byte_size(0x01)
    3371              $C$DW$T$5       .dwtag  DW_TAG_base_type
    3372                      .dwattr $C$DW$T$5, DW_AT_encoding(DW_ATE_signed_char)
    3373                      .dwattr $C$DW$T$5, DW_AT_name("signed char")
    3374                      .dwattr $C$DW$T$5, DW_AT_byte_size(0x01)
    3375              $C$DW$T$6       .dwtag  DW_TAG_base_type
    3376                      .dwattr $C$DW$T$6, DW_AT_encoding(DW_ATE_unsigned_char)
    3377                      .dwattr $C$DW$T$6, DW_AT_name("unsigned char")
    3378                      .dwattr $C$DW$T$6, DW_AT_byte_size(0x01)
    3379              $C$DW$T$70      .dwtag  DW_TAG_typedef, DW_AT_name("_Bool")
    3380                      .dwattr $C$DW$T$70, DW_AT_type(*$C$DW$T$6)
    3381                      .dwattr $C$DW$T$70, DW_AT_language(DW_LANG_C)
    3382              $C$DW$T$7       .dwtag  DW_TAG_base_type
    3383                      .dwattr $C$DW$T$7, DW_AT_encoding(DW_ATE_signed_char)
    3384                      .dwattr $C$DW$T$7, DW_AT_name("wchar_t")
    3385                      .dwattr $C$DW$T$7, DW_AT_byte_size(0x01)
    3386              $C$DW$T$8       .dwtag  DW_TAG_base_type
    3387                      .dwattr $C$DW$T$8, DW_AT_encoding(DW_ATE_signed)
    3388                      .dwattr $C$DW$T$8, DW_AT_name("short")
    3389                      .dwattr $C$DW$T$8, DW_AT_byte_size(0x01)
    3390              $C$DW$T$9       .dwtag  DW_TAG_base_type
    3391                      .dwattr $C$DW$T$9, DW_AT_encoding(DW_ATE_unsigned)
    3392                      .dwattr $C$DW$T$9, DW_AT_name("unsigned short")
    3393                      .dwattr $C$DW$T$9, DW_AT_byte_size(0x01)
    3394              $C$DW$T$19      .dwtag  DW_TAG_typedef, DW_AT_name("uint16_t")
    3395                      .dwattr $C$DW$T$19, DW_AT_type(*$C$DW$T$9)
