TMS320C2000 Assembler PC v15.12.3 Wed Nov 22 00:56:30 2017

Tools Copyright (c) 1996-2015 Texas Instruments Incorporated
C:\Users\wmj\AppData\Local\Temp\0764810                              PAGE    1

       1              ;***************************************************************
       2              ;* TMS320C2000 C/C++ Codegen                   PC v15.12.3.LTS *
       3              ;* Date/Time created: Wed Nov 22 00:56:28 2017                 *
       4              ;***************************************************************
       5                      .compiler_opts --abi=coffabi --float_support=softlib --hll_source=on --mem_model:code=flat --mem_mode
       6        0002  FP      .set    XAR2
       7              
       8              $C$DW$CU        .dwtag  DW_TAG_compile_unit
       9                      .dwattr $C$DW$CU, DW_AT_name("C:/Users/wmj/Desktop/BM1000_v1.1/sw/modules/user/src/32b/user.c")
      10                      .dwattr $C$DW$CU, DW_AT_producer("TI TMS320C2000 C/C++ Codegen PC v15.12.3.LTS Copyright (c) 1996-201
      11                      .dwattr $C$DW$CU, DW_AT_TI_version(0x01)
      12                      .dwattr $C$DW$CU, DW_AT_comp_dir("C:\Users\wmj\Desktop\BM1000_v1.1\sw\solutions\instaspin_foc\boards\
      13              
      14              $C$DW$1 .dwtag  DW_TAG_subprogram
      15                      .dwattr $C$DW$1, DW_AT_name("EST_setLs_qFmt")

    7143              $C$DW$610       .dwtag  DW_TAG_enumerator
    7144                      .dwattr $C$DW$610, DW_AT_name("USER_ErrorCode_estFreq_Hz_High")
    7145                      .dwattr $C$DW$610, DW_AT_const_value(0x60)
    7146              
    7147              $C$DW$611       .dwtag  DW_TAG_enumerator
    7148                      .dwattr $C$DW$611, DW_AT_name("USER_ErrorCode_estFreq_Hz_Low")
    7149                      .dwattr $C$DW$611, DW_AT_const_value(0x61)
    7150              
    7151              $C$DW$612       .dwtag  DW_TAG_enumerator
    7152                      .dwattr $C$DW$612, DW_AT_name("USER_ErrorCode_RoverL_estFreq_Hz_High")
    7153                      .dwattr $C$DW$612, DW_AT_const_value(0x62)
    7154              
    7155              $C$DW$613       .dwtag  DW_TAG_enumerator
    7156                      .dwattr $C$DW$613, DW_AT_name("USER_ErrorCode_RoverL_estFreq_Hz_Low")
    7157                      .dwattr $C$DW$613, DW_AT_const_value(0x63)
    7158              
    7159              $C$DW$614       .dwtag  DW_TAG_enumerator
    7160                      .dwattr $C$DW$614, DW_AT_name("USER_ErrorCode_trajFreq_Hz_High")
    7161                      .dwattr $C$DW$614, DW_AT_const_value(0x64)
    7162              
    7163              $C$DW$615       .dwtag  DW_TAG_enumerator
    7164                      .dwattr $C$DW$615, DW_AT_name("USER_ErrorCode_trajFreq_Hz_Low")
    7165                      .dwattr $C$DW$615, DW_AT_const_value(0x65)
    7166              
    7167              $C$DW$616       .dwtag  DW_TAG_enumerator
    7168                      .dwattr $C$DW$616, DW_AT_name("USER_ErrorCode_ctrlPeriod_sec_High")
    7169                      .dwattr $C$DW$616, DW_AT_const_value(0x66)
    7170              
    7171              $C$DW$617       .dwtag  DW_TAG_enumerator
    7172                      .dwattr $C$DW$617, DW_AT_name("USER_ErrorCode_ctrlPeriod_sec_Low")
    7173                      .dwattr $C$DW$617, DW_AT_const_value(0x67)
    7174              
    7175              $C$DW$618       .dwtag  DW_TAG_enumerator
    7176                      .dwattr $C$DW$618, DW_AT_name("USER_ErrorCode_maxNegativeIdCurrent_a_High")
    7177                      .dwattr $C$DW$618, DW_AT_const_value(0x68)
    7178              
    7179              $C$DW$619       .dwtag  DW_TAG_enumerator
    7180                      .dwattr $C$DW$619, DW_AT_name("USER_ErrorCode_maxNegativeIdCurrent_a_Low")
    7181                      .dwattr $C$DW$619, DW_AT_const_value(0x69)
    7182              
    7183              $C$DW$620       .dwtag  DW_TAG_enumerator
    7184                      .dwattr $C$DW$620, DW_AT_name("USER_numErrorCodes")
TMS320C2000 Assembler PC v15.12.3 Wed Nov 22 00:56:30 2017

Tools Copyright (c) 1996-2015 Texas Instruments Incorporated
C:\Users\wmj\AppData\Local\Temp\0764810                              PAGE  144

    7185                      .dwattr $C$DW$620, DW_AT_const_value(0x6a)
    7186              
    7187                      .dwendtag $C$DW$T$78
    7188              
    7189              $C$DW$T$79      .dwtag  DW_TAG_typedef
    7190                      .dwattr $C$DW$T$79, DW_AT_name("USER_ErrorCode_e")
    7191                      .dwattr $C$DW$T$79, DW_AT_type(*$C$DW$T$78)
    7192                      .dwattr $C$DW$T$79, DW_AT_language(DW_LANG_C)
    7193              
    7194              $C$DW$621       .dwtag  DW_TAG_TI_far_type
    7195                      .dwattr $C$DW$621, DW_AT_type(*$C$DW$T$79)
    7196              
    7197              $C$DW$T$83      .dwtag  DW_TAG_const_type
    7198                      .dwattr $C$DW$T$83, DW_AT_type(*$C$DW$621)
    7199              
    7200              
    7201              $C$DW$T$88      .dwtag  DW_TAG_enumeration_type
    7202                      .dwattr $C$DW$T$88, DW_AT_byte_size(0x01)
    7203              $C$DW$622       .dwtag  DW_TAG_enumerator
    7204                      .dwattr $C$DW$622, DW_AT_name("CTRL_Type_PID_spd")
    7205                      .dwattr $C$DW$622, DW_AT_const_value(0x00)
    7206              
    7207              $C$DW$623       .dwtag  DW_TAG_enumerator
    7208                      .dwattr $C$DW$623, DW_AT_name("CTRL_Type_PID_Id")
    7209                      .dwattr $C$DW$623, DW_AT_const_value(0x01)
    7210              
    7211              $C$DW$624       .dwtag  DW_TAG_enumerator
    7212                      .dwattr $C$DW$624, DW_AT_name("CTRL_Type_PID_Iq")
    7213                      .dwattr $C$DW$624, DW_AT_const_value(0x02)
    7214              
    7215                      .dwendtag $C$DW$T$88
    7216              
    7217              $C$DW$T$89      .dwtag  DW_TAG_typedef
    7218                      .dwattr $C$DW$T$89, DW_AT_name("CTRL_Type_e")
    7219                      .dwattr $C$DW$T$89, DW_AT_type(*$C$DW$T$88)
    7220                      .dwattr $C$DW$T$89, DW_AT_language(DW_LANG_C)
    7221              
    7222              $C$DW$625       .dwtag  DW_TAG_TI_far_type
    7223                      .dwattr $C$DW$625, DW_AT_type(*$C$DW$T$89)
    7224              
    7225              $C$DW$T$90      .dwtag  DW_TAG_const_type
    7226                      .dwattr $C$DW$T$90, DW_AT_type(*$C$DW$625)
    7227              
    7228              
    7229              $C$DW$T$23      .dwtag  DW_TAG_structure_type
    7230                      .dwattr $C$DW$T$23, DW_AT_name("_BRAKE_Obj_")
    7231                      .dwattr $C$DW$T$23, DW_AT_byte_size(0x08)
    7232              $C$DW$626       .dwtag  DW_TAG_member
    7233                      .dwattr $C$DW$626, DW_AT_type(*$C$DW$T$20)
    7234                      .dwattr $C$DW$626, DW_AT_name("angle_pu")
    7235                      .dwattr $C$DW$626, DW_AT_TI_symbol_name("_angle_pu")
    7236                      .dwattr $C$DW$626, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    7237                      .dwattr $C$DW$626, DW_AT_accessibility(DW_ACCESS_public)
    7238              
    7239              $C$DW$627       .dwtag  DW_TAG_member
TMS320C2000 Assembler PC v15.12.3 Wed Nov 22 00:56:30 2017

Tools Copyright (c) 1996-2015 Texas Instruments Incorporated
C:\Users\wmj\AppData\Local\Temp\0764810                              PAGE  145

    7240                      .dwattr $C$DW$627, DW_AT_type(*$C$DW$T$21)
    7241                      .dwattr $C$DW$627, DW_AT_name("Idq_brake")
    7242                      .dwattr $C$DW$627, DW_AT_TI_symbol_name("_Idq_brake")
    7243                      .dwattr $C$DW$627, DW_AT_data_member_location[DW_OP_plus_uconst 0x2]
    7244                      .dwattr $C$DW$627, DW_AT_accessibility(DW_ACCESS_public)
    7245              
    7246              $C$DW$628       .dwtag  DW_TAG_member
    7247                      .dwattr $C$DW$628, DW_AT_type(*$C$DW$T$22)
    7248                      .dwattr $C$DW$628, DW_AT_name("brake_enable")
    7249                      .dwattr $C$DW$628, DW_AT_TI_symbol_name("_brake_enable")
    7250                      .dwattr $C$DW$628, DW_AT_data_member_location[DW_OP_plus_uconst 0x6]
    7251                      .dwattr $C$DW$628, DW_AT_accessibility(DW_ACCESS_public)
    7252              
    7253                      .dwendtag $C$DW$T$23
    7254              
    7255              $C$DW$T$60      .dwtag  DW_TAG_typedef
    7256                      .dwattr $C$DW$T$60, DW_AT_name("BRAKE_Obj")
    7257                      .dwattr $C$DW$T$60, DW_AT_type(*$C$DW$T$23)
    7258                      .dwattr $C$DW$T$60, DW_AT_language(DW_LANG_C)
    7259              
    7260              $C$DW$T$58      .dwtag  DW_TAG_pointer_type
    7261                      .dwattr $C$DW$T$58, DW_AT_type(*$C$DW$T$23)
    7262                      .dwattr $C$DW$T$58, DW_AT_address_class(0x20)
    7263              
    7264              $C$DW$T$59      .dwtag  DW_TAG_typedef
    7265                      .dwattr $C$DW$T$59, DW_AT_name("BRAKE_Handle")
    7266                      .dwattr $C$DW$T$59, DW_AT_type(*$C$DW$T$58)
    7267                      .dwattr $C$DW$T$59, DW_AT_language(DW_LANG_C)
    7268              
    7269              
    7270              $C$DW$T$26      .dwtag  DW_TAG_structure_type
    7271                      .dwattr $C$DW$T$26, DW_AT_name("_CLARKE_Obj_")
    7272                      .dwattr $C$DW$T$26, DW_AT_byte_size(0x06)
    7273              $C$DW$629       .dwtag  DW_TAG_member
    7274                      .dwattr $C$DW$629, DW_AT_type(*$C$DW$T$20)
    7275                      .dwattr $C$DW$629, DW_AT_name("alpha_sf")
    7276                      .dwattr $C$DW$629, DW_AT_TI_symbol_name("_alpha_sf")
    7277                      .dwattr $C$DW$629, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    7278                      .dwattr $C$DW$629, DW_AT_accessibility(DW_ACCESS_public)
    7279              
    7280              $C$DW$630       .dwtag  DW_TAG_member
    7281                      .dwattr $C$DW$630, DW_AT_type(*$C$DW$T$20)
    7282                      .dwattr $C$DW$630, DW_AT_name("beta_sf")
    7283                      .dwattr $C$DW$630, DW_AT_TI_symbol_name("_beta_sf")
    7284                      .dwattr $C$DW$630, DW_AT_data_member_location[DW_OP_plus_uconst 0x2]
    7285                      .dwattr $C$DW$630, DW_AT_accessibility(DW_ACCESS_public)
    7286              
    7287              $C$DW$631       .dwtag  DW_TAG_member
    7288                      .dwattr $C$DW$631, DW_AT_type(*$C$DW$T$25)
    7289                      .dwattr $C$DW$631, DW_AT_name("numSensors")
    7290                      .dwattr $C$DW$631, DW_AT_TI_symbol_name("_numSensors")
    7291                      .dwattr $C$DW$631, DW_AT_data_member_location[DW_OP_plus_uconst 0x4]
    7292                      .dwattr $C$DW$631, DW_AT_accessibility(DW_ACCESS_public)
    7293              
    7294                      .dwendtag $C$DW$T$26
TMS320C2000 Assembler PC v15.12.3 Wed Nov 22 00:56:30 2017

Tools Copyright (c) 1996-2015 Texas Instruments Incorporated
C:\Users\wmj\AppData\Local\Temp\0764810                              PAGE  146

    7295              
    7296              $C$DW$T$34      .dwtag  DW_TAG_typedef
    7297                      .dwattr $C$DW$T$34, DW_AT_name("CLARKE_Obj")
    7298                      .dwattr $C$DW$T$34, DW_AT_type(*$C$DW$T$26)
    7299                      .dwattr $C$DW$T$34, DW_AT_language(DW_LANG_C)
    7300              
    7301              $C$DW$T$32      .dwtag  DW_TAG_pointer_type
    7302                      .dwattr $C$DW$T$32, DW_AT_type(*$C$DW$T$26)
    7303                      .dwattr $C$DW$T$32, DW_AT_address_class(0x20)
    7304              
    7305              $C$DW$T$33      .dwtag  DW_TAG_typedef
    7306                      .dwattr $C$DW$T$33, DW_AT_name("CLARKE_Handle")
    7307                      .dwattr $C$DW$T$33, DW_AT_type(*$C$DW$T$32)
    7308                      .dwattr $C$DW$T$33, DW_AT_language(DW_LANG_C)
    7309              
    7310              
    7311              $C$DW$T$61      .dwtag  DW_TAG_structure_type
    7312                      .dwattr $C$DW$T$61, DW_AT_name("_CTRL_Obj_")
    7313                      .dwattr $C$DW$T$61, DW_AT_byte_size(0x108)
    7314              $C$DW$632       .dwtag  DW_TAG_member
    7315                      .dwattr $C$DW$632, DW_AT_type(*$C$DW$T$27)
    7316                      .dwattr $C$DW$632, DW_AT_name("version")
    7317                      .dwattr $C$DW$632, DW_AT_TI_symbol_name("_version")
    7318                      .dwattr $C$DW$632, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    7319                      .dwattr $C$DW$632, DW_AT_accessibility(DW_ACCESS_public)
    7320              
    7321              $C$DW$633       .dwtag  DW_TAG_member
    7322                      .dwattr $C$DW$633, DW_AT_type(*$C$DW$T$29)
    7323                      .dwattr $C$DW$633, DW_AT_name("state")
    7324                      .dwattr $C$DW$633, DW_AT_TI_symbol_name("_state")
    7325                      .dwattr $C$DW$633, DW_AT_data_member_location[DW_OP_plus_uconst 0x4]
    7326                      .dwattr $C$DW$633, DW_AT_accessibility(DW_ACCESS_public)
    7327              
    7328              $C$DW$634       .dwtag  DW_TAG_member
    7329                      .dwattr $C$DW$634, DW_AT_type(*$C$DW$T$29)
    7330                      .dwattr $C$DW$634, DW_AT_name("prevState")
    7331                      .dwattr $C$DW$634, DW_AT_TI_symbol_name("_prevState")
    7332                      .dwattr $C$DW$634, DW_AT_data_member_location[DW_OP_plus_uconst 0x5]
    7333                      .dwattr $C$DW$634, DW_AT_accessibility(DW_ACCESS_public)
    7334              
    7335              $C$DW$635       .dwtag  DW_TAG_member
    7336                      .dwattr $C$DW$635, DW_AT_type(*$C$DW$T$31)
    7337                      .dwattr $C$DW$635, DW_AT_name("errorCode")
    7338                      .dwattr $C$DW$635, DW_AT_TI_symbol_name("_errorCode")
    7339                      .dwattr $C$DW$635, DW_AT_data_member_location[DW_OP_plus_uconst 0x6]
    7340                      .dwattr $C$DW$635, DW_AT_accessibility(DW_ACCESS_public)
    7341              
    7342              $C$DW$636       .dwtag  DW_TAG_member
    7343                      .dwattr $C$DW$636, DW_AT_type(*$C$DW$T$33)
    7344                      .dwattr $C$DW$636, DW_AT_name("clarkeHandle_I")
    7345                      .dwattr $C$DW$636, DW_AT_TI_symbol_name("_clarkeHandle_I")
    7346                      .dwattr $C$DW$636, DW_AT_data_member_location[DW_OP_plus_uconst 0x8]
    7347                      .dwattr $C$DW$636, DW_AT_accessibility(DW_ACCESS_public)
    7348              
    7349              $C$DW$637       .dwtag  DW_TAG_member
TMS320C2000 Assembler PC v15.12.3 Wed Nov 22 00:56:30 2017

Tools Copyright (c) 1996-2015 Texas Instruments Incorporated
C:\Users\wmj\AppData\Local\Temp\0764810                              PAGE  147

    7350                      .dwattr $C$DW$637, DW_AT_type(*$C$DW$T$34)
    7351                      .dwattr $C$DW$637, DW_AT_name("clarke_I")
    7352                      .dwattr $C$DW$637, DW_AT_TI_symbol_name("_clarke_I")
    7353                      .dwattr $C$DW$637, DW_AT_data_member_location[DW_OP_plus_uconst 0xa]
    7354                      .dwattr $C$DW$637, DW_AT_accessibility(DW_ACCESS_public)
    7355              
    7356              $C$DW$638       .dwtag  DW_TAG_member
    7357                      .dwattr $C$DW$638, DW_AT_type(*$C$DW$T$33)
    7358                      .dwattr $C$DW$638, DW_AT_name("clarkeHandle_V")
    7359                      .dwattr $C$DW$638, DW_AT_TI_symbol_name("_clarkeHandle_V")
    7360                      .dwattr $C$DW$638, DW_AT_data_member_location[DW_OP_plus_uconst 0x10]
    7361                      .dwattr $C$DW$638, DW_AT_accessibility(DW_ACCESS_public)
    7362              
    7363              $C$DW$639       .dwtag  DW_TAG_member
    7364                      .dwattr $C$DW$639, DW_AT_type(*$C$DW$T$34)
    7365                      .dwattr $C$DW$639, DW_AT_name("clarke_V")
    7366                      .dwattr $C$DW$639, DW_AT_TI_symbol_name("_clarke_V")
    7367                      .dwattr $C$DW$639, DW_AT_data_member_location[DW_OP_plus_uconst 0x12]
    7368                      .dwattr $C$DW$639, DW_AT_accessibility(DW_ACCESS_public)
    7369              
    7370              $C$DW$640       .dwtag  DW_TAG_member
    7371                      .dwattr $C$DW$640, DW_AT_type(*$C$DW$T$36)
    7372                      .dwattr $C$DW$640, DW_AT_name("estHandle")
    7373                      .dwattr $C$DW$640, DW_AT_TI_symbol_name("_estHandle")
    7374                      .dwattr $C$DW$640, DW_AT_data_member_location[DW_OP_plus_uconst 0x18]
    7375                      .dwattr $C$DW$640, DW_AT_accessibility(DW_ACCESS_public)
    7376              
    7377              $C$DW$641       .dwtag  DW_TAG_member
    7378                      .dwattr $C$DW$641, DW_AT_type(*$C$DW$T$38)
    7379                      .dwattr $C$DW$641, DW_AT_name("parkHandle")
    7380                      .dwattr $C$DW$641, DW_AT_TI_symbol_name("_parkHandle")
    7381                      .dwattr $C$DW$641, DW_AT_data_member_location[DW_OP_plus_uconst 0x1a]
    7382                      .dwattr $C$DW$641, DW_AT_accessibility(DW_ACCESS_public)
    7383              
    7384              $C$DW$642       .dwtag  DW_TAG_member
    7385                      .dwattr $C$DW$642, DW_AT_type(*$C$DW$T$39)
    7386                      .dwattr $C$DW$642, DW_AT_name("park")
    7387                      .dwattr $C$DW$642, DW_AT_TI_symbol_name("_park")
    7388                      .dwattr $C$DW$642, DW_AT_data_member_location[DW_OP_plus_uconst 0x1c]
    7389                      .dwattr $C$DW$642, DW_AT_accessibility(DW_ACCESS_public)
    7390              
    7391              $C$DW$643       .dwtag  DW_TAG_member
    7392                      .dwattr $C$DW$643, DW_AT_type(*$C$DW$T$41)
    7393                      .dwattr $C$DW$643, DW_AT_name("pidHandle_Id")
    7394                      .dwattr $C$DW$643, DW_AT_TI_symbol_name("_pidHandle_Id")
    7395                      .dwattr $C$DW$643, DW_AT_data_member_location[DW_OP_plus_uconst 0x20]
    7396                      .dwattr $C$DW$643, DW_AT_accessibility(DW_ACCESS_public)
    7397              
    7398              $C$DW$644       .dwtag  DW_TAG_member
    7399                      .dwattr $C$DW$644, DW_AT_type(*$C$DW$T$42)
    7400                      .dwattr $C$DW$644, DW_AT_name("pid_Id")
    7401                      .dwattr $C$DW$644, DW_AT_TI_symbol_name("_pid_Id")
    7402                      .dwattr $C$DW$644, DW_AT_data_member_location[DW_OP_plus_uconst 0x22]
    7403                      .dwattr $C$DW$644, DW_AT_accessibility(DW_ACCESS_public)
    7404              
TMS320C2000 Assembler PC v15.12.3 Wed Nov 22 00:56:30 2017

Tools Copyright (c) 1996-2015 Texas Instruments Incorporated
C:\Users\wmj\AppData\Local\Temp\0764810                              PAGE  148

    7405              $C$DW$645       .dwtag  DW_TAG_member
    7406                      .dwattr $C$DW$645, DW_AT_type(*$C$DW$T$41)
    7407                      .dwattr $C$DW$645, DW_AT_name("pidHandle_Iq")
    7408                      .dwattr $C$DW$645, DW_AT_TI_symbol_name("_pidHandle_Iq")
    7409                      .dwattr $C$DW$645, DW_AT_data_member_location[DW_OP_plus_uconst 0x32]
    7410                      .dwattr $C$DW$645, DW_AT_accessibility(DW_ACCESS_public)
    7411              
    7412              $C$DW$646       .dwtag  DW_TAG_member
    7413                      .dwattr $C$DW$646, DW_AT_type(*$C$DW$T$42)
    7414                      .dwattr $C$DW$646, DW_AT_name("pid_Iq")
    7415                      .dwattr $C$DW$646, DW_AT_TI_symbol_name("_pid_Iq")
    7416                      .dwattr $C$DW$646, DW_AT_data_member_location[DW_OP_plus_uconst 0x34]
    7417                      .dwattr $C$DW$646, DW_AT_accessibility(DW_ACCESS_public)
    7418              
    7419              $C$DW$647       .dwtag  DW_TAG_member
    7420                      .dwattr $C$DW$647, DW_AT_type(*$C$DW$T$41)
    7421                      .dwattr $C$DW$647, DW_AT_name("pidHandle_spd")
    7422                      .dwattr $C$DW$647, DW_AT_TI_symbol_name("_pidHandle_spd")
    7423                      .dwattr $C$DW$647, DW_AT_data_member_location[DW_OP_plus_uconst 0x44]
    7424                      .dwattr $C$DW$647, DW_AT_accessibility(DW_ACCESS_public)
    7425              
    7426              $C$DW$648       .dwtag  DW_TAG_member
    7427                      .dwattr $C$DW$648, DW_AT_type(*$C$DW$T$42)
    7428                      .dwattr $C$DW$648, DW_AT_name("pid_spd")
    7429                      .dwattr $C$DW$648, DW_AT_TI_symbol_name("_pid_spd")
    7430                      .dwattr $C$DW$648, DW_AT_data_member_location[DW_OP_plus_uconst 0x46]
    7431                      .dwattr $C$DW$648, DW_AT_accessibility(DW_ACCESS_public)
    7432              
    7433              $C$DW$649       .dwtag  DW_TAG_member
    7434                      .dwattr $C$DW$649, DW_AT_type(*$C$DW$T$44)
    7435                      .dwattr $C$DW$649, DW_AT_name("iparkHandle")
    7436                      .dwattr $C$DW$649, DW_AT_TI_symbol_name("_iparkHandle")
    7437                      .dwattr $C$DW$649, DW_AT_data_member_location[DW_OP_plus_uconst 0x56]
    7438                      .dwattr $C$DW$649, DW_AT_accessibility(DW_ACCESS_public)
    7439              
    7440              $C$DW$650       .dwtag  DW_TAG_member
    7441                      .dwattr $C$DW$650, DW_AT_type(*$C$DW$T$45)
    7442                      .dwattr $C$DW$650, DW_AT_name("ipark")
    7443                      .dwattr $C$DW$650, DW_AT_TI_symbol_name("_ipark")
    7444                      .dwattr $C$DW$650, DW_AT_data_member_location[DW_OP_plus_uconst 0x58]
    7445                      .dwattr $C$DW$650, DW_AT_accessibility(DW_ACCESS_public)
    7446              
    7447              $C$DW$651       .dwtag  DW_TAG_member
    7448                      .dwattr $C$DW$651, DW_AT_type(*$C$DW$T$47)
    7449                      .dwattr $C$DW$651, DW_AT_name("svgenHandle")
    7450                      .dwattr $C$DW$651, DW_AT_TI_symbol_name("_svgenHandle")
    7451                      .dwattr $C$DW$651, DW_AT_data_member_location[DW_OP_plus_uconst 0x5c]
    7452                      .dwattr $C$DW$651, DW_AT_accessibility(DW_ACCESS_public)
    7453              
    7454              $C$DW$652       .dwtag  DW_TAG_member
    7455                      .dwattr $C$DW$652, DW_AT_type(*$C$DW$T$48)
    7456                      .dwattr $C$DW$652, DW_AT_name("svgen")
    7457                      .dwattr $C$DW$652, DW_AT_TI_symbol_name("_svgen")
    7458                      .dwattr $C$DW$652, DW_AT_data_member_location[DW_OP_plus_uconst 0x5e]
    7459                      .dwattr $C$DW$652, DW_AT_accessibility(DW_ACCESS_public)
TMS320C2000 Assembler PC v15.12.3 Wed Nov 22 00:56:30 2017

Tools Copyright (c) 1996-2015 Texas Instruments Incorporated
C:\Users\wmj\AppData\Local\Temp\0764810                              PAGE  149

    7460              
    7461              $C$DW$653       .dwtag  DW_TAG_member
    7462                      .dwattr $C$DW$653, DW_AT_type(*$C$DW$T$50)
    7463                      .dwattr $C$DW$653, DW_AT_name("trajHandle_Id")
    7464                      .dwattr $C$DW$653, DW_AT_TI_symbol_name("_trajHandle_Id")
    7465                      .dwattr $C$DW$653, DW_AT_data_member_location[DW_OP_plus_uconst 0x60]
    7466                      .dwattr $C$DW$653, DW_AT_accessibility(DW_ACCESS_public)
    7467              
    7468              $C$DW$654       .dwtag  DW_TAG_member
    7469                      .dwattr $C$DW$654, DW_AT_type(*$C$DW$T$51)
    7470                      .dwattr $C$DW$654, DW_AT_name("traj_Id")
    7471                      .dwattr $C$DW$654, DW_AT_TI_symbol_name("_traj_Id")
    7472                      .dwattr $C$DW$654, DW_AT_data_member_location[DW_OP_plus_uconst 0x62]
    7473                      .dwattr $C$DW$654, DW_AT_accessibility(DW_ACCESS_public)
    7474              
    7475              $C$DW$655       .dwtag  DW_TAG_member
    7476                      .dwattr $C$DW$655, DW_AT_type(*$C$DW$T$50)
    7477                      .dwattr $C$DW$655, DW_AT_name("trajHandle_spd")
    7478                      .dwattr $C$DW$655, DW_AT_TI_symbol_name("_trajHandle_spd")
    7479                      .dwattr $C$DW$655, DW_AT_data_member_location[DW_OP_plus_uconst 0x6c]
    7480                      .dwattr $C$DW$655, DW_AT_accessibility(DW_ACCESS_public)
    7481              
    7482              $C$DW$656       .dwtag  DW_TAG_member
    7483                      .dwattr $C$DW$656, DW_AT_type(*$C$DW$T$51)
    7484                      .dwattr $C$DW$656, DW_AT_name("traj_spd")
    7485                      .dwattr $C$DW$656, DW_AT_TI_symbol_name("_traj_spd")
    7486                      .dwattr $C$DW$656, DW_AT_data_member_location[DW_OP_plus_uconst 0x6e]
    7487                      .dwattr $C$DW$656, DW_AT_accessibility(DW_ACCESS_public)
    7488              
    7489              $C$DW$657       .dwtag  DW_TAG_member
    7490                      .dwattr $C$DW$657, DW_AT_type(*$C$DW$T$50)
    7491                      .dwattr $C$DW$657, DW_AT_name("trajHandle_spdMax")
    7492                      .dwattr $C$DW$657, DW_AT_TI_symbol_name("_trajHandle_spdMax")
    7493                      .dwattr $C$DW$657, DW_AT_data_member_location[DW_OP_plus_uconst 0x78]
    7494                      .dwattr $C$DW$657, DW_AT_accessibility(DW_ACCESS_public)
    7495              
    7496              $C$DW$658       .dwtag  DW_TAG_member
    7497                      .dwattr $C$DW$658, DW_AT_type(*$C$DW$T$51)
    7498                      .dwattr $C$DW$658, DW_AT_name("traj_spdMax")
    7499                      .dwattr $C$DW$658, DW_AT_TI_symbol_name("_traj_spdMax")
    7500                      .dwattr $C$DW$658, DW_AT_data_member_location[DW_OP_plus_uconst 0x7a]
    7501                      .dwattr $C$DW$658, DW_AT_accessibility(DW_ACCESS_public)
    7502              
    7503              $C$DW$659       .dwtag  DW_TAG_member
    7504                      .dwattr $C$DW$659, DW_AT_type(*$C$DW$T$52)
    7505                      .dwattr $C$DW$659, DW_AT_name("motorParams")
    7506                      .dwattr $C$DW$659, DW_AT_TI_symbol_name("_motorParams")
    7507                      .dwattr $C$DW$659, DW_AT_data_member_location[DW_OP_plus_uconst 0x84]
    7508                      .dwattr $C$DW$659, DW_AT_accessibility(DW_ACCESS_public)
    7509              
    7510              $C$DW$660       .dwtag  DW_TAG_member
    7511                      .dwattr $C$DW$660, DW_AT_type(*$C$DW$T$55)
    7512                      .dwattr $C$DW$660, DW_AT_name("waitTimes")
    7513                      .dwattr $C$DW$660, DW_AT_TI_symbol_name("_waitTimes")
    7514                      .dwattr $C$DW$660, DW_AT_data_member_location[DW_OP_plus_uconst 0x92]
TMS320C2000 Assembler PC v15.12.3 Wed Nov 22 00:56:30 2017

Tools Copyright (c) 1996-2015 Texas Instruments Incorporated
C:\Users\wmj\AppData\Local\Temp\0764810                              PAGE  150

    7515                      .dwattr $C$DW$660, DW_AT_accessibility(DW_ACCESS_public)
    7516              
    7517              $C$DW$661       .dwtag  DW_TAG_member
    7518                      .dwattr $C$DW$661, DW_AT_type(*$C$DW$T$54)
    7519                      .dwattr $C$DW$661, DW_AT_name("counter_state")
    7520                      .dwattr $C$DW$661, DW_AT_TI_symbol_name("_counter_state")
    7521                      .dwattr $C$DW$661, DW_AT_data_member_location[DW_OP_plus_uconst 0x9a]
    7522                      .dwattr $C$DW$661, DW_AT_accessibility(DW_ACCESS_public)
    7523              
    7524              $C$DW$662       .dwtag  DW_TAG_member
    7525                      .dwattr $C$DW$662, DW_AT_type(*$C$DW$T$56)
    7526                      .dwattr $C$DW$662, DW_AT_name("numIsrTicksPerCtrlTick")
    7527                      .dwattr $C$DW$662, DW_AT_TI_symbol_name("_numIsrTicksPerCtrlTick")
    7528                      .dwattr $C$DW$662, DW_AT_data_member_location[DW_OP_plus_uconst 0x9c]
    7529                      .dwattr $C$DW$662, DW_AT_accessibility(DW_ACCESS_public)
    7530              
    7531              $C$DW$663       .dwtag  DW_TAG_member
    7532                      .dwattr $C$DW$663, DW_AT_type(*$C$DW$T$56)
    7533                      .dwattr $C$DW$663, DW_AT_name("numCtrlTicksPerCurrentTick")
    7534                      .dwattr $C$DW$663, DW_AT_TI_symbol_name("_numCtrlTicksPerCurrentTick")
    7535                      .dwattr $C$DW$663, DW_AT_data_member_location[DW_OP_plus_uconst 0x9d]
    7536                      .dwattr $C$DW$663, DW_AT_accessibility(DW_ACCESS_public)
    7537              
    7538              $C$DW$664       .dwtag  DW_TAG_member
    7539                      .dwattr $C$DW$664, DW_AT_type(*$C$DW$T$56)
    7540                      .dwattr $C$DW$664, DW_AT_name("numCtrlTicksPerSpeedTick")
    7541                      .dwattr $C$DW$664, DW_AT_TI_symbol_name("_numCtrlTicksPerSpeedTick")
    7542                      .dwattr $C$DW$664, DW_AT_data_member_location[DW_OP_plus_uconst 0x9e]
    7543                      .dwattr $C$DW$664, DW_AT_accessibility(DW_ACCESS_public)
    7544              
    7545              $C$DW$665       .dwtag  DW_TAG_member
    7546                      .dwattr $C$DW$665, DW_AT_type(*$C$DW$T$56)
    7547                      .dwattr $C$DW$665, DW_AT_name("numCtrlTicksPerTrajTick")
    7548                      .dwattr $C$DW$665, DW_AT_TI_symbol_name("_numCtrlTicksPerTrajTick")
    7549                      .dwattr $C$DW$665, DW_AT_data_member_location[DW_OP_plus_uconst 0x9f]
    7550                      .dwattr $C$DW$665, DW_AT_accessibility(DW_ACCESS_public)
    7551              
    7552              $C$DW$666       .dwtag  DW_TAG_member
    7553                      .dwattr $C$DW$666, DW_AT_type(*$C$DW$T$54)
    7554                      .dwattr $C$DW$666, DW_AT_name("ctrlFreq_Hz")
    7555                      .dwattr $C$DW$666, DW_AT_TI_symbol_name("_ctrlFreq_Hz")
    7556                      .dwattr $C$DW$666, DW_AT_data_member_location[DW_OP_plus_uconst 0xa0]
    7557                      .dwattr $C$DW$666, DW_AT_accessibility(DW_ACCESS_public)
    7558              
    7559              $C$DW$667       .dwtag  DW_TAG_member
    7560                      .dwattr $C$DW$667, DW_AT_type(*$C$DW$T$54)
    7561                      .dwattr $C$DW$667, DW_AT_name("trajFreq_Hz")
    7562                      .dwattr $C$DW$667, DW_AT_TI_symbol_name("_trajFreq_Hz")
    7563                      .dwattr $C$DW$667, DW_AT_data_member_location[DW_OP_plus_uconst 0xa2]
    7564                      .dwattr $C$DW$667, DW_AT_accessibility(DW_ACCESS_public)
    7565              
    7566              $C$DW$668       .dwtag  DW_TAG_member
    7567                      .dwattr $C$DW$668, DW_AT_type(*$C$DW$T$20)
    7568                      .dwattr $C$DW$668, DW_AT_name("trajPeriod_sec")
    7569                      .dwattr $C$DW$668, DW_AT_TI_symbol_name("_trajPeriod_sec")
TMS320C2000 Assembler PC v15.12.3 Wed Nov 22 00:56:30 2017

Tools Copyright (c) 1996-2015 Texas Instruments Incorporated
C:\Users\wmj\AppData\Local\Temp\0764810                              PAGE  151

    7570                      .dwattr $C$DW$668, DW_AT_data_member_location[DW_OP_plus_uconst 0xa4]
    7571                      .dwattr $C$DW$668, DW_AT_accessibility(DW_ACCESS_public)
    7572              
    7573              $C$DW$669       .dwtag  DW_TAG_member
    7574                      .dwattr $C$DW$669, DW_AT_type(*$C$DW$T$57)
    7575                      .dwattr $C$DW$669, DW_AT_name("ctrlPeriod_sec")
    7576                      .dwattr $C$DW$669, DW_AT_TI_symbol_name("_ctrlPeriod_sec")
    7577                      .dwattr $C$DW$669, DW_AT_data_member_location[DW_OP_plus_uconst 0xa6]
    7578                      .dwattr $C$DW$669, DW_AT_accessibility(DW_ACCESS_public)
    7579              
    7580              $C$DW$670       .dwtag  DW_TAG_member
    7581                      .dwattr $C$DW$670, DW_AT_type(*$C$DW$T$20)
    7582                      .dwattr $C$DW$670, DW_AT_name("maxVsMag_pu")
    7583                      .dwattr $C$DW$670, DW_AT_TI_symbol_name("_maxVsMag_pu")
    7584                      .dwattr $C$DW$670, DW_AT_data_member_location[DW_OP_plus_uconst 0xa8]
    7585                      .dwattr $C$DW$670, DW_AT_accessibility(DW_ACCESS_public)
    7586              
    7587              $C$DW$671       .dwtag  DW_TAG_member
    7588                      .dwattr $C$DW$671, DW_AT_type(*$C$DW$T$21)
    7589                      .dwattr $C$DW$671, DW_AT_name("Iab_in")
    7590                      .dwattr $C$DW$671, DW_AT_TI_symbol_name("_Iab_in")
    7591                      .dwattr $C$DW$671, DW_AT_data_member_location[DW_OP_plus_uconst 0xaa]
    7592                      .dwattr $C$DW$671, DW_AT_accessibility(DW_ACCESS_public)
    7593              
    7594              $C$DW$672       .dwtag  DW_TAG_member
    7595                      .dwattr $C$DW$672, DW_AT_type(*$C$DW$T$21)
    7596                      .dwattr $C$DW$672, DW_AT_name("Iab_filt")
    7597                      .dwattr $C$DW$672, DW_AT_TI_symbol_name("_Iab_filt")
    7598                      .dwattr $C$DW$672, DW_AT_data_member_location[DW_OP_plus_uconst 0xae]
    7599                      .dwattr $C$DW$672, DW_AT_accessibility(DW_ACCESS_public)
    7600              
    7601              $C$DW$673       .dwtag  DW_TAG_member
    7602                      .dwattr $C$DW$673, DW_AT_type(*$C$DW$T$21)
    7603                      .dwattr $C$DW$673, DW_AT_name("Idq_in")
    7604                      .dwattr $C$DW$673, DW_AT_TI_symbol_name("_Idq_in")
    7605                      .dwattr $C$DW$673, DW_AT_data_member_location[DW_OP_plus_uconst 0xb2]
    7606                      .dwattr $C$DW$673, DW_AT_accessibility(DW_ACCESS_public)
    7607              
    7608              $C$DW$674       .dwtag  DW_TAG_member
    7609                      .dwattr $C$DW$674, DW_AT_type(*$C$DW$T$21)
    7610                      .dwattr $C$DW$674, DW_AT_name("Vab_in")
    7611                      .dwattr $C$DW$674, DW_AT_TI_symbol_name("_Vab_in")
    7612                      .dwattr $C$DW$674, DW_AT_data_member_location[DW_OP_plus_uconst 0xb6]
    7613                      .dwattr $C$DW$674, DW_AT_accessibility(DW_ACCESS_public)
    7614              
    7615              $C$DW$675       .dwtag  DW_TAG_member
    7616                      .dwattr $C$DW$675, DW_AT_type(*$C$DW$T$20)
    7617                      .dwattr $C$DW$675, DW_AT_name("spd_out")
    7618                      .dwattr $C$DW$675, DW_AT_TI_symbol_name("_spd_out")
    7619                      .dwattr $C$DW$675, DW_AT_data_member_location[DW_OP_plus_uconst 0xba]
    7620                      .dwattr $C$DW$675, DW_AT_accessibility(DW_ACCESS_public)
    7621              
    7622              $C$DW$676       .dwtag  DW_TAG_member
    7623                      .dwattr $C$DW$676, DW_AT_type(*$C$DW$T$21)
    7624                      .dwattr $C$DW$676, DW_AT_name("Vab_out")
TMS320C2000 Assembler PC v15.12.3 Wed Nov 22 00:56:30 2017

Tools Copyright (c) 1996-2015 Texas Instruments Incorporated
C:\Users\wmj\AppData\Local\Temp\0764810                              PAGE  152

    7625                      .dwattr $C$DW$676, DW_AT_TI_symbol_name("_Vab_out")
    7626                      .dwattr $C$DW$676, DW_AT_data_member_location[DW_OP_plus_uconst 0xbc]
    7627                      .dwattr $C$DW$676, DW_AT_accessibility(DW_ACCESS_public)
    7628              
    7629              $C$DW$677       .dwtag  DW_TAG_member
    7630                      .dwattr $C$DW$677, DW_AT_type(*$C$DW$T$21)
    7631                      .dwattr $C$DW$677, DW_AT_name("Vdq_out")
    7632                      .dwattr $C$DW$677, DW_AT_TI_symbol_name("_Vdq_out")
    7633                      .dwattr $C$DW$677, DW_AT_data_member_location[DW_OP_plus_uconst 0xc0]
    7634                      .dwattr $C$DW$677, DW_AT_accessibility(DW_ACCESS_public)
    7635              
    7636              $C$DW$678       .dwtag  DW_TAG_member
    7637                      .dwattr $C$DW$678, DW_AT_type(*$C$DW$T$57)
    7638                      .dwattr $C$DW$678, DW_AT_name("Rhf")
    7639                      .dwattr $C$DW$678, DW_AT_TI_symbol_name("_Rhf")
    7640                      .dwattr $C$DW$678, DW_AT_data_member_location[DW_OP_plus_uconst 0xc4]
    7641                      .dwattr $C$DW$678, DW_AT_accessibility(DW_ACCESS_public)
    7642              
    7643              $C$DW$679       .dwtag  DW_TAG_member
    7644                      .dwattr $C$DW$679, DW_AT_type(*$C$DW$T$57)
    7645                      .dwattr $C$DW$679, DW_AT_name("Lhf")
    7646                      .dwattr $C$DW$679, DW_AT_TI_symbol_name("_Lhf")
    7647                      .dwattr $C$DW$679, DW_AT_data_member_location[DW_OP_plus_uconst 0xc6]
    7648                      .dwattr $C$DW$679, DW_AT_accessibility(DW_ACCESS_public)
    7649              
    7650              $C$DW$680       .dwtag  DW_TAG_member
    7651                      .dwattr $C$DW$680, DW_AT_type(*$C$DW$T$57)
    7652                      .dwattr $C$DW$680, DW_AT_name("RoverL")
    7653                      .dwattr $C$DW$680, DW_AT_TI_symbol_name("_RoverL")
    7654                      .dwattr $C$DW$680, DW_AT_data_member_location[DW_OP_plus_uconst 0xc8]
    7655                      .dwattr $C$DW$680, DW_AT_accessibility(DW_ACCESS_public)
    7656              
    7657              $C$DW$681       .dwtag  DW_TAG_member
    7658                      .dwattr $C$DW$681, DW_AT_type(*$C$DW$T$20)
    7659                      .dwattr $C$DW$681, DW_AT_name("Kp_Id")
    7660                      .dwattr $C$DW$681, DW_AT_TI_symbol_name("_Kp_Id")
    7661                      .dwattr $C$DW$681, DW_AT_data_member_location[DW_OP_plus_uconst 0xca]
    7662                      .dwattr $C$DW$681, DW_AT_accessibility(DW_ACCESS_public)
    7663              
    7664              $C$DW$682       .dwtag  DW_TAG_member
    7665                      .dwattr $C$DW$682, DW_AT_type(*$C$DW$T$20)
    7666                      .dwattr $C$DW$682, DW_AT_name("Kp_Iq")
    7667                      .dwattr $C$DW$682, DW_AT_TI_symbol_name("_Kp_Iq")
    7668                      .dwattr $C$DW$682, DW_AT_data_member_location[DW_OP_plus_uconst 0xcc]
    7669                      .dwattr $C$DW$682, DW_AT_accessibility(DW_ACCESS_public)
    7670              
    7671              $C$DW$683       .dwtag  DW_TAG_member
    7672                      .dwattr $C$DW$683, DW_AT_type(*$C$DW$T$20)
    7673                      .dwattr $C$DW$683, DW_AT_name("Kp_spd")
    7674                      .dwattr $C$DW$683, DW_AT_TI_symbol_name("_Kp_spd")
    7675                      .dwattr $C$DW$683, DW_AT_data_member_location[DW_OP_plus_uconst 0xce]
    7676                      .dwattr $C$DW$683, DW_AT_accessibility(DW_ACCESS_public)
    7677              
    7678              $C$DW$684       .dwtag  DW_TAG_member
    7679                      .dwattr $C$DW$684, DW_AT_type(*$C$DW$T$20)
TMS320C2000 Assembler PC v15.12.3 Wed Nov 22 00:56:30 2017

Tools Copyright (c) 1996-2015 Texas Instruments Incorporated
C:\Users\wmj\AppData\Local\Temp\0764810                              PAGE  153

    7680                      .dwattr $C$DW$684, DW_AT_name("Ki_Id")
    7681                      .dwattr $C$DW$684, DW_AT_TI_symbol_name("_Ki_Id")
    7682                      .dwattr $C$DW$684, DW_AT_data_member_location[DW_OP_plus_uconst 0xd0]
    7683                      .dwattr $C$DW$684, DW_AT_accessibility(DW_ACCESS_public)
    7684              
    7685              $C$DW$685       .dwtag  DW_TAG_member
    7686                      .dwattr $C$DW$685, DW_AT_type(*$C$DW$T$20)
    7687                      .dwattr $C$DW$685, DW_AT_name("Ki_Iq")
    7688                      .dwattr $C$DW$685, DW_AT_TI_symbol_name("_Ki_Iq")
    7689                      .dwattr $C$DW$685, DW_AT_data_member_location[DW_OP_plus_uconst 0xd2]
    7690                      .dwattr $C$DW$685, DW_AT_accessibility(DW_ACCESS_public)
    7691              
    7692              $C$DW$686       .dwtag  DW_TAG_member
    7693                      .dwattr $C$DW$686, DW_AT_type(*$C$DW$T$20)
    7694                      .dwattr $C$DW$686, DW_AT_name("Ki_spd")
    7695                      .dwattr $C$DW$686, DW_AT_TI_symbol_name("_Ki_spd")
    7696                      .dwattr $C$DW$686, DW_AT_data_member_location[DW_OP_plus_uconst 0xd4]
    7697                      .dwattr $C$DW$686, DW_AT_accessibility(DW_ACCESS_public)
    7698              
    7699              $C$DW$687       .dwtag  DW_TAG_member
    7700                      .dwattr $C$DW$687, DW_AT_type(*$C$DW$T$20)
    7701                      .dwattr $C$DW$687, DW_AT_name("Kd_Id")
    7702                      .dwattr $C$DW$687, DW_AT_TI_symbol_name("_Kd_Id")
    7703                      .dwattr $C$DW$687, DW_AT_data_member_location[DW_OP_plus_uconst 0xd6]
    7704                      .dwattr $C$DW$687, DW_AT_accessibility(DW_ACCESS_public)
    7705              
    7706              $C$DW$688       .dwtag  DW_TAG_member
    7707                      .dwattr $C$DW$688, DW_AT_type(*$C$DW$T$20)
    7708                      .dwattr $C$DW$688, DW_AT_name("Kd_Iq")
    7709                      .dwattr $C$DW$688, DW_AT_TI_symbol_name("_Kd_Iq")
    7710                      .dwattr $C$DW$688, DW_AT_data_member_location[DW_OP_plus_uconst 0xd8]
    7711                      .dwattr $C$DW$688, DW_AT_accessibility(DW_ACCESS_public)
    7712              
    7713              $C$DW$689       .dwtag  DW_TAG_member
    7714                      .dwattr $C$DW$689, DW_AT_type(*$C$DW$T$20)
    7715                      .dwattr $C$DW$689, DW_AT_name("Kd_spd")
    7716                      .dwattr $C$DW$689, DW_AT_TI_symbol_name("_Kd_spd")
    7717                      .dwattr $C$DW$689, DW_AT_data_member_location[DW_OP_plus_uconst 0xda]
    7718                      .dwattr $C$DW$689, DW_AT_accessibility(DW_ACCESS_public)
    7719              
    7720              $C$DW$690       .dwtag  DW_TAG_member
    7721                      .dwattr $C$DW$690, DW_AT_type(*$C$DW$T$20)
    7722                      .dwattr $C$DW$690, DW_AT_name("Ui_Id")
    7723                      .dwattr $C$DW$690, DW_AT_TI_symbol_name("_Ui_Id")
    7724                      .dwattr $C$DW$690, DW_AT_data_member_location[DW_OP_plus_uconst 0xdc]
    7725                      .dwattr $C$DW$690, DW_AT_accessibility(DW_ACCESS_public)
    7726              
    7727              $C$DW$691       .dwtag  DW_TAG_member
    7728                      .dwattr $C$DW$691, DW_AT_type(*$C$DW$T$20)
    7729                      .dwattr $C$DW$691, DW_AT_name("Ui_Iq")
    7730                      .dwattr $C$DW$691, DW_AT_TI_symbol_name("_Ui_Iq")
    7731                      .dwattr $C$DW$691, DW_AT_data_member_location[DW_OP_plus_uconst 0xde]
    7732                      .dwattr $C$DW$691, DW_AT_accessibility(DW_ACCESS_public)
    7733              
    7734              $C$DW$692       .dwtag  DW_TAG_member
TMS320C2000 Assembler PC v15.12.3 Wed Nov 22 00:56:30 2017

Tools Copyright (c) 1996-2015 Texas Instruments Incorporated
C:\Users\wmj\AppData\Local\Temp\0764810                              PAGE  154

    7735                      .dwattr $C$DW$692, DW_AT_type(*$C$DW$T$20)
    7736                      .dwattr $C$DW$692, DW_AT_name("Ui_spd")
    7737                      .dwattr $C$DW$692, DW_AT_TI_symbol_name("_Ui_spd")
    7738                      .dwattr $C$DW$692, DW_AT_data_member_location[DW_OP_plus_uconst 0xe0]
    7739                      .dwattr $C$DW$692, DW_AT_accessibility(DW_ACCESS_public)
    7740              
    7741              $C$DW$693       .dwtag  DW_TAG_member
    7742                      .dwattr $C$DW$693, DW_AT_type(*$C$DW$T$21)
    7743                      .dwattr $C$DW$693, DW_AT_name("Idq_ref")
    7744                      .dwattr $C$DW$693, DW_AT_TI_symbol_name("_Idq_ref")
    7745                      .dwattr $C$DW$693, DW_AT_data_member_location[DW_OP_plus_uconst 0xe2]
    7746                      .dwattr $C$DW$693, DW_AT_accessibility(DW_ACCESS_public)
    7747              
    7748              $C$DW$694       .dwtag  DW_TAG_member
    7749                      .dwattr $C$DW$694, DW_AT_type(*$C$DW$T$20)
    7750                      .dwattr $C$DW$694, DW_AT_name("IdRated")
    7751                      .dwattr $C$DW$694, DW_AT_TI_symbol_name("_IdRated")
    7752                      .dwattr $C$DW$694, DW_AT_data_member_location[DW_OP_plus_uconst 0xe6]
    7753                      .dwattr $C$DW$694, DW_AT_accessibility(DW_ACCESS_public)
    7754              
    7755              $C$DW$695       .dwtag  DW_TAG_member
    7756                      .dwattr $C$DW$695, DW_AT_type(*$C$DW$T$20)
    7757                      .dwattr $C$DW$695, DW_AT_name("spd_ref")
    7758                      .dwattr $C$DW$695, DW_AT_TI_symbol_name("_spd_ref")
    7759                      .dwattr $C$DW$695, DW_AT_data_member_location[DW_OP_plus_uconst 0xe8]
    7760                      .dwattr $C$DW$695, DW_AT_accessibility(DW_ACCESS_public)
    7761              
    7762              $C$DW$696       .dwtag  DW_TAG_member
    7763                      .dwattr $C$DW$696, DW_AT_type(*$C$DW$T$20)
    7764                      .dwattr $C$DW$696, DW_AT_name("spd_max")
    7765                      .dwattr $C$DW$696, DW_AT_TI_symbol_name("_spd_max")
    7766                      .dwattr $C$DW$696, DW_AT_data_member_location[DW_OP_plus_uconst 0xea]
    7767                      .dwattr $C$DW$696, DW_AT_accessibility(DW_ACCESS_public)
    7768              
    7769              $C$DW$697       .dwtag  DW_TAG_member
    7770                      .dwattr $C$DW$697, DW_AT_type(*$C$DW$T$56)
    7771                      .dwattr $C$DW$697, DW_AT_name("counter_current")
    7772                      .dwattr $C$DW$697, DW_AT_TI_symbol_name("_counter_current")
    7773                      .dwattr $C$DW$697, DW_AT_data_member_location[DW_OP_plus_uconst 0xec]
    7774                      .dwattr $C$DW$697, DW_AT_accessibility(DW_ACCESS_public)
    7775              
    7776              $C$DW$698       .dwtag  DW_TAG_member
    7777                      .dwattr $C$DW$698, DW_AT_type(*$C$DW$T$56)
    7778                      .dwattr $C$DW$698, DW_AT_name("counter_isr")
    7779                      .dwattr $C$DW$698, DW_AT_TI_symbol_name("_counter_isr")
    7780                      .dwattr $C$DW$698, DW_AT_data_member_location[DW_OP_plus_uconst 0xed]
    7781                      .dwattr $C$DW$698, DW_AT_accessibility(DW_ACCESS_public)
    7782              
    7783              $C$DW$699       .dwtag  DW_TAG_member
    7784                      .dwattr $C$DW$699, DW_AT_type(*$C$DW$T$56)
    7785                      .dwattr $C$DW$699, DW_AT_name("counter_speed")
    7786                      .dwattr $C$DW$699, DW_AT_TI_symbol_name("_counter_speed")
    7787                      .dwattr $C$DW$699, DW_AT_data_member_location[DW_OP_plus_uconst 0xee]
    7788                      .dwattr $C$DW$699, DW_AT_accessibility(DW_ACCESS_public)
    7789              
TMS320C2000 Assembler PC v15.12.3 Wed Nov 22 00:56:30 2017

Tools Copyright (c) 1996-2015 Texas Instruments Incorporated
C:\Users\wmj\AppData\Local\Temp\0764810                              PAGE  155

    7790              $C$DW$700       .dwtag  DW_TAG_member
    7791                      .dwattr $C$DW$700, DW_AT_type(*$C$DW$T$56)
    7792                      .dwattr $C$DW$700, DW_AT_name("counter_traj")
    7793                      .dwattr $C$DW$700, DW_AT_TI_symbol_name("_counter_traj")
    7794                      .dwattr $C$DW$700, DW_AT_data_member_location[DW_OP_plus_uconst 0xef]
    7795                      .dwattr $C$DW$700, DW_AT_accessibility(DW_ACCESS_public)
    7796              
    7797              $C$DW$701       .dwtag  DW_TAG_member
    7798                      .dwattr $C$DW$701, DW_AT_type(*$C$DW$T$22)
    7799                      .dwattr $C$DW$701, DW_AT_name("flag_enableCtrl")
    7800                      .dwattr $C$DW$701, DW_AT_TI_symbol_name("_flag_enableCtrl")
    7801                      .dwattr $C$DW$701, DW_AT_data_member_location[DW_OP_plus_uconst 0xf0]
    7802                      .dwattr $C$DW$701, DW_AT_accessibility(DW_ACCESS_public)
    7803              
    7804              $C$DW$702       .dwtag  DW_TAG_member
    7805                      .dwattr $C$DW$702, DW_AT_type(*$C$DW$T$22)
    7806                      .dwattr $C$DW$702, DW_AT_name("flag_enableDcBusComp")
    7807                      .dwattr $C$DW$702, DW_AT_TI_symbol_name("_flag_enableDcBusComp")
    7808                      .dwattr $C$DW$702, DW_AT_data_member_location[DW_OP_plus_uconst 0xf1]
    7809                      .dwattr $C$DW$702, DW_AT_accessibility(DW_ACCESS_public)
    7810              
    7811              $C$DW$703       .dwtag  DW_TAG_member
    7812                      .dwattr $C$DW$703, DW_AT_type(*$C$DW$T$22)
    7813                      .dwattr $C$DW$703, DW_AT_name("flag_enablePowerWarp")
    7814                      .dwattr $C$DW$703, DW_AT_TI_symbol_name("_flag_enablePowerWarp")
    7815                      .dwattr $C$DW$703, DW_AT_data_member_location[DW_OP_plus_uconst 0xf2]
    7816                      .dwattr $C$DW$703, DW_AT_accessibility(DW_ACCESS_public)
    7817              
    7818              $C$DW$704       .dwtag  DW_TAG_member
    7819                      .dwattr $C$DW$704, DW_AT_type(*$C$DW$T$22)
    7820                      .dwattr $C$DW$704, DW_AT_name("flag_enableOffset")
    7821                      .dwattr $C$DW$704, DW_AT_TI_symbol_name("_flag_enableOffset")
    7822                      .dwattr $C$DW$704, DW_AT_data_member_location[DW_OP_plus_uconst 0xf3]
    7823                      .dwattr $C$DW$704, DW_AT_accessibility(DW_ACCESS_public)
    7824              
    7825              $C$DW$705       .dwtag  DW_TAG_member
    7826                      .dwattr $C$DW$705, DW_AT_type(*$C$DW$T$22)
    7827                      .dwattr $C$DW$705, DW_AT_name("flag_enableSpeedCtrl")
    7828                      .dwattr $C$DW$705, DW_AT_TI_symbol_name("_flag_enableSpeedCtrl")
    7829                      .dwattr $C$DW$705, DW_AT_data_member_location[DW_OP_plus_uconst 0xf4]
    7830                      .dwattr $C$DW$705, DW_AT_accessibility(DW_ACCESS_public)
    7831              
    7832              $C$DW$706       .dwtag  DW_TAG_member
    7833                      .dwattr $C$DW$706, DW_AT_type(*$C$DW$T$22)
    7834                      .dwattr $C$DW$706, DW_AT_name("flag_enableUserMotorParams")
    7835                      .dwattr $C$DW$706, DW_AT_TI_symbol_name("_flag_enableUserMotorParams")
    7836                      .dwattr $C$DW$706, DW_AT_data_member_location[DW_OP_plus_uconst 0xf5]
    7837                      .dwattr $C$DW$706, DW_AT_accessibility(DW_ACCESS_public)
    7838              
    7839              $C$DW$707       .dwtag  DW_TAG_member
    7840                      .dwattr $C$DW$707, DW_AT_type(*$C$DW$T$22)
    7841                      .dwattr $C$DW$707, DW_AT_name("flag_enableCurrentCtrl")
    7842                      .dwattr $C$DW$707, DW_AT_TI_symbol_name("_flag_enableCurrentCtrl")
    7843                      .dwattr $C$DW$707, DW_AT_data_member_location[DW_OP_plus_uconst 0xf6]
    7844                      .dwattr $C$DW$707, DW_AT_accessibility(DW_ACCESS_public)
TMS320C2000 Assembler PC v15.12.3 Wed Nov 22 00:56:30 2017

Tools Copyright (c) 1996-2015 Texas Instruments Incorporated
C:\Users\wmj\AppData\Local\Temp\0764810                              PAGE  156

    7845              
    7846              $C$DW$708       .dwtag  DW_TAG_member
    7847                      .dwattr $C$DW$708, DW_AT_type(*$C$DW$T$20)
    7848                      .dwattr $C$DW$708, DW_AT_name("spd_outMaxRatio_pu")
    7849                      .dwattr $C$DW$708, DW_AT_TI_symbol_name("_spd_outMaxRatio_pu")
    7850                      .dwattr $C$DW$708, DW_AT_data_member_location[DW_OP_plus_uconst 0xf8]
    7851                      .dwattr $C$DW$708, DW_AT_accessibility(DW_ACCESS_public)
    7852              
    7853              $C$DW$709       .dwtag  DW_TAG_member
    7854                      .dwattr $C$DW$709, DW_AT_type(*$C$DW$T$20)
    7855                      .dwattr $C$DW$709, DW_AT_name("enc_Angle")
    7856                      .dwattr $C$DW$709, DW_AT_TI_symbol_name("_enc_Angle")
    7857                      .dwattr $C$DW$709, DW_AT_data_member_location[DW_OP_plus_uconst 0xfa]
    7858                      .dwattr $C$DW$709, DW_AT_accessibility(DW_ACCESS_public)
    7859              
    7860              $C$DW$710       .dwtag  DW_TAG_member
    7861                      .dwattr $C$DW$710, DW_AT_type(*$C$DW$T$22)
    7862                      .dwattr $C$DW$710, DW_AT_name("flag_enableEncAngle")
    7863                      .dwattr $C$DW$710, DW_AT_TI_symbol_name("_flag_enableEncAngle")
    7864                      .dwattr $C$DW$710, DW_AT_data_member_location[DW_OP_plus_uconst 0xfc]
    7865                      .dwattr $C$DW$710, DW_AT_accessibility(DW_ACCESS_public)
    7866              
    7867              $C$DW$711       .dwtag  DW_TAG_member
    7868                      .dwattr $C$DW$711, DW_AT_type(*$C$DW$T$59)
    7869                      .dwattr $C$DW$711, DW_AT_name("brakeHandle")
    7870                      .dwattr $C$DW$711, DW_AT_TI_symbol_name("_brakeHandle")
    7871                      .dwattr $C$DW$711, DW_AT_data_member_location[DW_OP_plus_uconst 0xfe]
    7872                      .dwattr $C$DW$711, DW_AT_accessibility(DW_ACCESS_public)
    7873              
    7874              $C$DW$712       .dwtag  DW_TAG_member
    7875                      .dwattr $C$DW$712, DW_AT_type(*$C$DW$T$60)
    7876                      .dwattr $C$DW$712, DW_AT_name("brake")
    7877                      .dwattr $C$DW$712, DW_AT_TI_symbol_name("_brake")
    7878                      .dwattr $C$DW$712, DW_AT_data_member_location[DW_OP_plus_uconst 0x100]
    7879                      .dwattr $C$DW$712, DW_AT_accessibility(DW_ACCESS_public)
    7880              
    7881                      .dwendtag $C$DW$T$61
    7882              
    7883              $C$DW$T$91      .dwtag  DW_TAG_typedef
    7884                      .dwattr $C$DW$T$91, DW_AT_name("CTRL_Obj")
    7885                      .dwattr $C$DW$T$91, DW_AT_type(*$C$DW$T$61)
    7886                      .dwattr $C$DW$T$91, DW_AT_language(DW_LANG_C)
    7887              
    7888              $C$DW$T$92      .dwtag  DW_TAG_pointer_type
    7889                      .dwattr $C$DW$T$92, DW_AT_type(*$C$DW$T$61)
    7890                      .dwattr $C$DW$T$92, DW_AT_address_class(0x20)
    7891              
    7892              $C$DW$T$93      .dwtag  DW_TAG_typedef
    7893                      .dwattr $C$DW$T$93, DW_AT_name("CTRL_Handle")
    7894                      .dwattr $C$DW$T$93, DW_AT_type(*$C$DW$T$92)
    7895                      .dwattr $C$DW$T$93, DW_AT_language(DW_LANG_C)
    7896              
    7897              $C$DW$713       .dwtag  DW_TAG_TI_far_type
    7898                      .dwattr $C$DW$713, DW_AT_type(*$C$DW$T$93)
    7899              
TMS320C2000 Assembler PC v15.12.3 Wed Nov 22 00:56:30 2017

Tools Copyright (c) 1996-2015 Texas Instruments Incorporated
C:\Users\wmj\AppData\Local\Temp\0764810                              PAGE  157

    7900              $C$DW$T$94      .dwtag  DW_TAG_const_type
    7901                      .dwattr $C$DW$T$94, DW_AT_type(*$C$DW$713)
    7902              
    7903              
    7904              $C$DW$T$64      .dwtag  DW_TAG_structure_type
    7905                      .dwattr $C$DW$T$64, DW_AT_name("_CTRL_Version_")
    7906                      .dwattr $C$DW$T$64, DW_AT_byte_size(0x04)
    7907              $C$DW$714       .dwtag  DW_TAG_member
    7908                      .dwattr $C$DW$714, DW_AT_type(*$C$DW$T$24)
    7909                      .dwattr $C$DW$714, DW_AT_name("rsvd")
    7910                      .dwattr $C$DW$714, DW_AT_TI_symbol_name("_rsvd")
    7911                      .dwattr $C$DW$714, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    7912                      .dwattr $C$DW$714, DW_AT_accessibility(DW_ACCESS_public)
    7913              
    7914              $C$DW$715       .dwtag  DW_TAG_member
    7915                      .dwattr $C$DW$715, DW_AT_type(*$C$DW$T$63)
    7916                      .dwattr $C$DW$715, DW_AT_name("targetProc")
    7917                      .dwattr $C$DW$715, DW_AT_TI_symbol_name("_targetProc")
    7918                      .dwattr $C$DW$715, DW_AT_data_member_location[DW_OP_plus_uconst 0x1]
    7919                      .dwattr $C$DW$715, DW_AT_accessibility(DW_ACCESS_public)
    7920              
    7921              $C$DW$716       .dwtag  DW_TAG_member
    7922                      .dwattr $C$DW$716, DW_AT_type(*$C$DW$T$24)
    7923                      .dwattr $C$DW$716, DW_AT_name("major")
    7924                      .dwattr $C$DW$716, DW_AT_TI_symbol_name("_major")
    7925                      .dwattr $C$DW$716, DW_AT_data_member_location[DW_OP_plus_uconst 0x2]
    7926                      .dwattr $C$DW$716, DW_AT_accessibility(DW_ACCESS_public)
    7927              
    7928              $C$DW$717       .dwtag  DW_TAG_member
    7929                      .dwattr $C$DW$717, DW_AT_type(*$C$DW$T$24)
    7930                      .dwattr $C$DW$717, DW_AT_name("minor")
    7931                      .dwattr $C$DW$717, DW_AT_TI_symbol_name("_minor")
    7932                      .dwattr $C$DW$717, DW_AT_data_member_location[DW_OP_plus_uconst 0x3]
    7933                      .dwattr $C$DW$717, DW_AT_accessibility(DW_ACCESS_public)
    7934              
    7935                      .dwendtag $C$DW$T$64
    7936              
    7937              $C$DW$T$27      .dwtag  DW_TAG_typedef
    7938                      .dwattr $C$DW$T$27, DW_AT_name("CTRL_Version")
    7939                      .dwattr $C$DW$T$27, DW_AT_type(*$C$DW$T$64)
    7940                      .dwattr $C$DW$T$27, DW_AT_language(DW_LANG_C)
    7941              
    7942              
    7943              $C$DW$T$19      .dwtag  DW_TAG_structure_type
    7944                      .dwattr $C$DW$T$19, DW_AT_name("_EST_Obj_")
    7945                      .dwattr $C$DW$T$19, DW_AT_declaration
    7946                      .dwendtag $C$DW$T$19
    7947              
    7948              $C$DW$T$35      .dwtag  DW_TAG_pointer_type
    7949                      .dwattr $C$DW$T$35, DW_AT_type(*$C$DW$T$19)
    7950                      .dwattr $C$DW$T$35, DW_AT_address_class(0x20)
    7951              
    7952              $C$DW$T$36      .dwtag  DW_TAG_typedef
    7953                      .dwattr $C$DW$T$36, DW_AT_name("EST_Handle")
    7954                      .dwattr $C$DW$T$36, DW_AT_type(*$C$DW$T$35)
TMS320C2000 Assembler PC v15.12.3 Wed Nov 22 00:56:30 2017

Tools Copyright (c) 1996-2015 Texas Instruments Incorporated
C:\Users\wmj\AppData\Local\Temp\0764810                              PAGE  158

    7955                      .dwattr $C$DW$T$36, DW_AT_language(DW_LANG_C)
    7956              
    7957              
    7958              $C$DW$T$65      .dwtag  DW_TAG_structure_type
    7959                      .dwattr $C$DW$T$65, DW_AT_name("_IPARK_Obj_")
    7960                      .dwattr $C$DW$T$65, DW_AT_byte_size(0x04)
    7961              $C$DW$718       .dwtag  DW_TAG_member
    7962                      .dwattr $C$DW$718, DW_AT_type(*$C$DW$T$20)
    7963                      .dwattr $C$DW$718, DW_AT_name("sinTh")
    7964                      .dwattr $C$DW$718, DW_AT_TI_symbol_name("_sinTh")
    7965                      .dwattr $C$DW$718, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    7966                      .dwattr $C$DW$718, DW_AT_accessibility(DW_ACCESS_public)
    7967              
    7968              $C$DW$719       .dwtag  DW_TAG_member
    7969                      .dwattr $C$DW$719, DW_AT_type(*$C$DW$T$20)
    7970                      .dwattr $C$DW$719, DW_AT_name("cosTh")
    7971                      .dwattr $C$DW$719, DW_AT_TI_symbol_name("_cosTh")
    7972                      .dwattr $C$DW$719, DW_AT_data_member_location[DW_OP_plus_uconst 0x2]
    7973                      .dwattr $C$DW$719, DW_AT_accessibility(DW_ACCESS_public)
    7974              
    7975                      .dwendtag $C$DW$T$65
    7976              
    7977              $C$DW$T$45      .dwtag  DW_TAG_typedef
    7978                      .dwattr $C$DW$T$45, DW_AT_name("IPARK_Obj")
    7979                      .dwattr $C$DW$T$45, DW_AT_type(*$C$DW$T$65)
    7980                      .dwattr $C$DW$T$45, DW_AT_language(DW_LANG_C)
    7981              
    7982              $C$DW$T$43      .dwtag  DW_TAG_pointer_type
    7983                      .dwattr $C$DW$T$43, DW_AT_type(*$C$DW$T$65)
    7984                      .dwattr $C$DW$T$43, DW_AT_address_class(0x20)
    7985              
    7986              $C$DW$T$44      .dwtag  DW_TAG_typedef
    7987                      .dwattr $C$DW$T$44, DW_AT_name("IPARK_Handle")
    7988                      .dwattr $C$DW$T$44, DW_AT_type(*$C$DW$T$43)
    7989                      .dwattr $C$DW$T$44, DW_AT_language(DW_LANG_C)
    7990              
    7991              
    7992              $C$DW$T$67      .dwtag  DW_TAG_structure_type
    7993                      .dwattr $C$DW$T$67, DW_AT_name("_MATH_vec2_")
    7994                      .dwattr $C$DW$T$67, DW_AT_byte_size(0x04)
    7995              $C$DW$720       .dwtag  DW_TAG_member
    7996                      .dwattr $C$DW$720, DW_AT_type(*$C$DW$T$66)
    7997                      .dwattr $C$DW$720, DW_AT_name("value")
    7998                      .dwattr $C$DW$720, DW_AT_TI_symbol_name("_value")
    7999                      .dwattr $C$DW$720, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    8000                      .dwattr $C$DW$720, DW_AT_accessibility(DW_ACCESS_public)
    8001              
    8002                      .dwendtag $C$DW$T$67
    8003              
    8004              $C$DW$T$21      .dwtag  DW_TAG_typedef
    8005                      .dwattr $C$DW$T$21, DW_AT_name("MATH_vec2")
    8006                      .dwattr $C$DW$T$21, DW_AT_type(*$C$DW$T$67)
    8007                      .dwattr $C$DW$T$21, DW_AT_language(DW_LANG_C)
    8008              
    8009              
TMS320C2000 Assembler PC v15.12.3 Wed Nov 22 00:56:30 2017

Tools Copyright (c) 1996-2015 Texas Instruments Incorporated
C:\Users\wmj\AppData\Local\Temp\0764810                              PAGE  159

    8010              $C$DW$T$70      .dwtag  DW_TAG_structure_type
    8011                      .dwattr $C$DW$T$70, DW_AT_name("_MOTOR_Params_")
    8012                      .dwattr $C$DW$T$70, DW_AT_byte_size(0x0e)
    8013              $C$DW$721       .dwtag  DW_TAG_member
    8014                      .dwattr $C$DW$721, DW_AT_type(*$C$DW$T$69)
    8015                      .dwattr $C$DW$721, DW_AT_name("type")
    8016                      .dwattr $C$DW$721, DW_AT_TI_symbol_name("_type")
    8017                      .dwattr $C$DW$721, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    8018                      .dwattr $C$DW$721, DW_AT_accessibility(DW_ACCESS_public)
    8019              
    8020              $C$DW$722       .dwtag  DW_TAG_member
    8021                      .dwattr $C$DW$722, DW_AT_type(*$C$DW$T$56)
    8022                      .dwattr $C$DW$722, DW_AT_name("numPolePairs")
    8023                      .dwattr $C$DW$722, DW_AT_TI_symbol_name("_numPolePairs")
    8024                      .dwattr $C$DW$722, DW_AT_data_member_location[DW_OP_plus_uconst 0x1]
    8025                      .dwattr $C$DW$722, DW_AT_accessibility(DW_ACCESS_public)
    8026              
    8027              $C$DW$723       .dwtag  DW_TAG_member
    8028                      .dwattr $C$DW$723, DW_AT_type(*$C$DW$T$57)
    8029                      .dwattr $C$DW$723, DW_AT_name("Lr_H")
    8030                      .dwattr $C$DW$723, DW_AT_TI_symbol_name("_Lr_H")
    8031                      .dwattr $C$DW$723, DW_AT_data_member_location[DW_OP_plus_uconst 0x2]
    8032                      .dwattr $C$DW$723, DW_AT_accessibility(DW_ACCESS_public)
    8033              
    8034              $C$DW$724       .dwtag  DW_TAG_member
    8035                      .dwattr $C$DW$724, DW_AT_type(*$C$DW$T$57)
    8036                      .dwattr $C$DW$724, DW_AT_name("Ls_d_H")
    8037                      .dwattr $C$DW$724, DW_AT_TI_symbol_name("_Ls_d_H")
    8038                      .dwattr $C$DW$724, DW_AT_data_member_location[DW_OP_plus_uconst 0x4]
    8039                      .dwattr $C$DW$724, DW_AT_accessibility(DW_ACCESS_public)
    8040              
    8041              $C$DW$725       .dwtag  DW_TAG_member
    8042                      .dwattr $C$DW$725, DW_AT_type(*$C$DW$T$57)
    8043                      .dwattr $C$DW$725, DW_AT_name("Ls_q_H")
    8044                      .dwattr $C$DW$725, DW_AT_TI_symbol_name("_Ls_q_H")
    8045                      .dwattr $C$DW$725, DW_AT_data_member_location[DW_OP_plus_uconst 0x6]
    8046                      .dwattr $C$DW$725, DW_AT_accessibility(DW_ACCESS_public)
    8047              
    8048              $C$DW$726       .dwtag  DW_TAG_member
    8049                      .dwattr $C$DW$726, DW_AT_type(*$C$DW$T$57)
    8050                      .dwattr $C$DW$726, DW_AT_name("Rr_Ohm")
    8051                      .dwattr $C$DW$726, DW_AT_TI_symbol_name("_Rr_Ohm")
    8052                      .dwattr $C$DW$726, DW_AT_data_member_location[DW_OP_plus_uconst 0x8]
    8053                      .dwattr $C$DW$726, DW_AT_accessibility(DW_ACCESS_public)
    8054              
    8055              $C$DW$727       .dwtag  DW_TAG_member
    8056                      .dwattr $C$DW$727, DW_AT_type(*$C$DW$T$57)
    8057                      .dwattr $C$DW$727, DW_AT_name("Rs_Ohm")
    8058                      .dwattr $C$DW$727, DW_AT_TI_symbol_name("_Rs_Ohm")
    8059                      .dwattr $C$DW$727, DW_AT_data_member_location[DW_OP_plus_uconst 0xa]
    8060                      .dwattr $C$DW$727, DW_AT_accessibility(DW_ACCESS_public)
    8061              
    8062              $C$DW$728       .dwtag  DW_TAG_member
    8063                      .dwattr $C$DW$728, DW_AT_type(*$C$DW$T$57)
    8064                      .dwattr $C$DW$728, DW_AT_name("ratedFlux_VpHz")
TMS320C2000 Assembler PC v15.12.3 Wed Nov 22 00:56:30 2017

Tools Copyright (c) 1996-2015 Texas Instruments Incorporated
C:\Users\wmj\AppData\Local\Temp\0764810                              PAGE  160

    8065                      .dwattr $C$DW$728, DW_AT_TI_symbol_name("_ratedFlux_VpHz")
    8066                      .dwattr $C$DW$728, DW_AT_data_member_location[DW_OP_plus_uconst 0xc]
    8067                      .dwattr $C$DW$728, DW_AT_accessibility(DW_ACCESS_public)
    8068              
    8069                      .dwendtag $C$DW$T$70
    8070              
    8071              $C$DW$T$52      .dwtag  DW_TAG_typedef
    8072                      .dwattr $C$DW$T$52, DW_AT_name("MOTOR_Params")
    8073                      .dwattr $C$DW$T$52, DW_AT_type(*$C$DW$T$70)
    8074                      .dwattr $C$DW$T$52, DW_AT_language(DW_LANG_C)
    8075              
    8076              
    8077              $C$DW$T$71      .dwtag  DW_TAG_structure_type
    8078                      .dwattr $C$DW$T$71, DW_AT_name("_PARK_Obj_")
    8079                      .dwattr $C$DW$T$71, DW_AT_byte_size(0x04)
    8080              $C$DW$729       .dwtag  DW_TAG_member
    8081                      .dwattr $C$DW$729, DW_AT_type(*$C$DW$T$20)
    8082                      .dwattr $C$DW$729, DW_AT_name("sinTh")
    8083                      .dwattr $C$DW$729, DW_AT_TI_symbol_name("_sinTh")
    8084                      .dwattr $C$DW$729, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    8085                      .dwattr $C$DW$729, DW_AT_accessibility(DW_ACCESS_public)
    8086              
    8087              $C$DW$730       .dwtag  DW_TAG_member
    8088                      .dwattr $C$DW$730, DW_AT_type(*$C$DW$T$20)
    8089                      .dwattr $C$DW$730, DW_AT_name("cosTh")
    8090                      .dwattr $C$DW$730, DW_AT_TI_symbol_name("_cosTh")
    8091                      .dwattr $C$DW$730, DW_AT_data_member_location[DW_OP_plus_uconst 0x2]
    8092                      .dwattr $C$DW$730, DW_AT_accessibility(DW_ACCESS_public)
    8093              
    8094                      .dwendtag $C$DW$T$71
    8095              
    8096              $C$DW$T$39      .dwtag  DW_TAG_typedef
    8097                      .dwattr $C$DW$T$39, DW_AT_name("PARK_Obj")
    8098                      .dwattr $C$DW$T$39, DW_AT_type(*$C$DW$T$71)
    8099                      .dwattr $C$DW$T$39, DW_AT_language(DW_LANG_C)
    8100              
    8101              $C$DW$T$37      .dwtag  DW_TAG_pointer_type
    8102                      .dwattr $C$DW$T$37, DW_AT_type(*$C$DW$T$71)
    8103                      .dwattr $C$DW$T$37, DW_AT_address_class(0x20)
    8104              
    8105              $C$DW$T$38      .dwtag  DW_TAG_typedef
    8106                      .dwattr $C$DW$T$38, DW_AT_name("PARK_Handle")
    8107                      .dwattr $C$DW$T$38, DW_AT_type(*$C$DW$T$37)
    8108                      .dwattr $C$DW$T$38, DW_AT_language(DW_LANG_C)
    8109              
    8110              
    8111              $C$DW$T$72      .dwtag  DW_TAG_structure_type
    8112                      .dwattr $C$DW$T$72, DW_AT_name("_PID_Obj_")
    8113                      .dwattr $C$DW$T$72, DW_AT_byte_size(0x10)
    8114              $C$DW$731       .dwtag  DW_TAG_member
    8115                      .dwattr $C$DW$731, DW_AT_type(*$C$DW$T$20)
    8116                      .dwattr $C$DW$731, DW_AT_name("Kp")
    8117                      .dwattr $C$DW$731, DW_AT_TI_symbol_name("_Kp")
    8118                      .dwattr $C$DW$731, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    8119                      .dwattr $C$DW$731, DW_AT_accessibility(DW_ACCESS_public)
TMS320C2000 Assembler PC v15.12.3 Wed Nov 22 00:56:30 2017

Tools Copyright (c) 1996-2015 Texas Instruments Incorporated
C:\Users\wmj\AppData\Local\Temp\0764810                              PAGE  161

    8120              
    8121              $C$DW$732       .dwtag  DW_TAG_member
    8122                      .dwattr $C$DW$732, DW_AT_type(*$C$DW$T$20)
    8123                      .dwattr $C$DW$732, DW_AT_name("Ki")
    8124                      .dwattr $C$DW$732, DW_AT_TI_symbol_name("_Ki")
    8125                      .dwattr $C$DW$732, DW_AT_data_member_location[DW_OP_plus_uconst 0x2]
    8126                      .dwattr $C$DW$732, DW_AT_accessibility(DW_ACCESS_public)
    8127              
    8128              $C$DW$733       .dwtag  DW_TAG_member
    8129                      .dwattr $C$DW$733, DW_AT_type(*$C$DW$T$20)
    8130                      .dwattr $C$DW$733, DW_AT_name("Kd")
    8131                      .dwattr $C$DW$733, DW_AT_TI_symbol_name("_Kd")
    8132                      .dwattr $C$DW$733, DW_AT_data_member_location[DW_OP_plus_uconst 0x4]
    8133                      .dwattr $C$DW$733, DW_AT_accessibility(DW_ACCESS_public)
    8134              
    8135              $C$DW$734       .dwtag  DW_TAG_member
    8136                      .dwattr $C$DW$734, DW_AT_type(*$C$DW$T$20)
    8137                      .dwattr $C$DW$734, DW_AT_name("Ui")
    8138                      .dwattr $C$DW$734, DW_AT_TI_symbol_name("_Ui")
    8139                      .dwattr $C$DW$734, DW_AT_data_member_location[DW_OP_plus_uconst 0x6]
    8140                      .dwattr $C$DW$734, DW_AT_accessibility(DW_ACCESS_public)
    8141              
    8142              $C$DW$735       .dwtag  DW_TAG_member
    8143                      .dwattr $C$DW$735, DW_AT_type(*$C$DW$T$20)
    8144                      .dwattr $C$DW$735, DW_AT_name("refValue")
    8145                      .dwattr $C$DW$735, DW_AT_TI_symbol_name("_refValue")
    8146                      .dwattr $C$DW$735, DW_AT_data_member_location[DW_OP_plus_uconst 0x8]
    8147                      .dwattr $C$DW$735, DW_AT_accessibility(DW_ACCESS_public)
    8148              
    8149              $C$DW$736       .dwtag  DW_TAG_member
    8150                      .dwattr $C$DW$736, DW_AT_type(*$C$DW$T$20)
    8151                      .dwattr $C$DW$736, DW_AT_name("fbackValue")
    8152                      .dwattr $C$DW$736, DW_AT_TI_symbol_name("_fbackValue")
    8153                      .dwattr $C$DW$736, DW_AT_data_member_location[DW_OP_plus_uconst 0xa]
    8154                      .dwattr $C$DW$736, DW_AT_accessibility(DW_ACCESS_public)
    8155              
    8156              $C$DW$737       .dwtag  DW_TAG_member
    8157                      .dwattr $C$DW$737, DW_AT_type(*$C$DW$T$20)
    8158                      .dwattr $C$DW$737, DW_AT_name("outMin")
    8159                      .dwattr $C$DW$737, DW_AT_TI_symbol_name("_outMin")
    8160                      .dwattr $C$DW$737, DW_AT_data_member_location[DW_OP_plus_uconst 0xc]
    8161                      .dwattr $C$DW$737, DW_AT_accessibility(DW_ACCESS_public)
    8162              
    8163              $C$DW$738       .dwtag  DW_TAG_member
    8164                      .dwattr $C$DW$738, DW_AT_type(*$C$DW$T$20)
    8165                      .dwattr $C$DW$738, DW_AT_name("outMax")
    8166                      .dwattr $C$DW$738, DW_AT_TI_symbol_name("_outMax")
    8167                      .dwattr $C$DW$738, DW_AT_data_member_location[DW_OP_plus_uconst 0xe]
    8168                      .dwattr $C$DW$738, DW_AT_accessibility(DW_ACCESS_public)
    8169              
    8170                      .dwendtag $C$DW$T$72
    8171              
    8172              $C$DW$T$42      .dwtag  DW_TAG_typedef
    8173                      .dwattr $C$DW$T$42, DW_AT_name("PID_Obj")
    8174                      .dwattr $C$DW$T$42, DW_AT_type(*$C$DW$T$72)
TMS320C2000 Assembler PC v15.12.3 Wed Nov 22 00:56:30 2017

Tools Copyright (c) 1996-2015 Texas Instruments Incorporated
C:\Users\wmj\AppData\Local\Temp\0764810                              PAGE  162

    8175                      .dwattr $C$DW$T$42, DW_AT_language(DW_LANG_C)
    8176              
    8177              $C$DW$T$40      .dwtag  DW_TAG_pointer_type
    8178                      .dwattr $C$DW$T$40, DW_AT_type(*$C$DW$T$72)
    8179                      .dwattr $C$DW$T$40, DW_AT_address_class(0x20)
    8180              
    8181              $C$DW$T$41      .dwtag  DW_TAG_typedef
    8182                      .dwattr $C$DW$T$41, DW_AT_name("PID_Handle")
    8183                      .dwattr $C$DW$T$41, DW_AT_type(*$C$DW$T$40)
    8184                      .dwattr $C$DW$T$41, DW_AT_language(DW_LANG_C)
    8185              
    8186              
    8187              $C$DW$T$73      .dwtag  DW_TAG_structure_type
    8188                      .dwattr $C$DW$T$73, DW_AT_name("_SVGEN_Obj_")
    8189                      .dwattr $C$DW$T$73, DW_AT_byte_size(0x02)
    8190              $C$DW$739       .dwtag  DW_TAG_member
    8191                      .dwattr $C$DW$739, DW_AT_type(*$C$DW$T$20)
    8192                      .dwattr $C$DW$739, DW_AT_name("maxModulation")
    8193                      .dwattr $C$DW$739, DW_AT_TI_symbol_name("_maxModulation")
    8194                      .dwattr $C$DW$739, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    8195                      .dwattr $C$DW$739, DW_AT_accessibility(DW_ACCESS_public)
    8196              
    8197                      .dwendtag $C$DW$T$73
    8198              
    8199              $C$DW$T$48      .dwtag  DW_TAG_typedef
    8200                      .dwattr $C$DW$T$48, DW_AT_name("SVGEN_Obj")
    8201                      .dwattr $C$DW$T$48, DW_AT_type(*$C$DW$T$73)
    8202                      .dwattr $C$DW$T$48, DW_AT_language(DW_LANG_C)
    8203              
    8204              $C$DW$T$46      .dwtag  DW_TAG_pointer_type
    8205                      .dwattr $C$DW$T$46, DW_AT_type(*$C$DW$T$73)
    8206                      .dwattr $C$DW$T$46, DW_AT_address_class(0x20)
    8207              
    8208              $C$DW$T$47      .dwtag  DW_TAG_typedef
    8209                      .dwattr $C$DW$T$47, DW_AT_name("SVGEN_Handle")
    8210                      .dwattr $C$DW$T$47, DW_AT_type(*$C$DW$T$46)
    8211                      .dwattr $C$DW$T$47, DW_AT_language(DW_LANG_C)
    8212              
    8213              
    8214              $C$DW$T$74      .dwtag  DW_TAG_structure_type
    8215                      .dwattr $C$DW$T$74, DW_AT_name("_TRAJ_Obj_")
    8216                      .dwattr $C$DW$T$74, DW_AT_byte_size(0x0a)
    8217              $C$DW$740       .dwtag  DW_TAG_member
    8218                      .dwattr $C$DW$740, DW_AT_type(*$C$DW$T$20)
    8219                      .dwattr $C$DW$740, DW_AT_name("targetValue")
    8220                      .dwattr $C$DW$740, DW_AT_TI_symbol_name("_targetValue")
    8221                      .dwattr $C$DW$740, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    8222                      .dwattr $C$DW$740, DW_AT_accessibility(DW_ACCESS_public)
    8223              
    8224              $C$DW$741       .dwtag  DW_TAG_member
    8225                      .dwattr $C$DW$741, DW_AT_type(*$C$DW$T$20)
    8226                      .dwattr $C$DW$741, DW_AT_name("intValue")
    8227                      .dwattr $C$DW$741, DW_AT_TI_symbol_name("_intValue")
    8228                      .dwattr $C$DW$741, DW_AT_data_member_location[DW_OP_plus_uconst 0x2]
    8229                      .dwattr $C$DW$741, DW_AT_accessibility(DW_ACCESS_public)
TMS320C2000 Assembler PC v15.12.3 Wed Nov 22 00:56:30 2017

Tools Copyright (c) 1996-2015 Texas Instruments Incorporated
C:\Users\wmj\AppData\Local\Temp\0764810                              PAGE  163

    8230              
    8231              $C$DW$742       .dwtag  DW_TAG_member
    8232                      .dwattr $C$DW$742, DW_AT_type(*$C$DW$T$20)
    8233                      .dwattr $C$DW$742, DW_AT_name("minValue")
    8234                      .dwattr $C$DW$742, DW_AT_TI_symbol_name("_minValue")
    8235                      .dwattr $C$DW$742, DW_AT_data_member_location[DW_OP_plus_uconst 0x4]
    8236                      .dwattr $C$DW$742, DW_AT_accessibility(DW_ACCESS_public)
    8237              
    8238              $C$DW$743       .dwtag  DW_TAG_member
    8239                      .dwattr $C$DW$743, DW_AT_type(*$C$DW$T$20)
    8240                      .dwattr $C$DW$743, DW_AT_name("maxValue")
    8241                      .dwattr $C$DW$743, DW_AT_TI_symbol_name("_maxValue")
    8242                      .dwattr $C$DW$743, DW_AT_data_member_location[DW_OP_plus_uconst 0x6]
    8243                      .dwattr $C$DW$743, DW_AT_accessibility(DW_ACCESS_public)
    8244              
    8245              $C$DW$744       .dwtag  DW_TAG_member
    8246                      .dwattr $C$DW$744, DW_AT_type(*$C$DW$T$20)
    8247                      .dwattr $C$DW$744, DW_AT_name("maxDelta")
    8248                      .dwattr $C$DW$744, DW_AT_TI_symbol_name("_maxDelta")
    8249                      .dwattr $C$DW$744, DW_AT_data_member_location[DW_OP_plus_uconst 0x8]
    8250                      .dwattr $C$DW$744, DW_AT_accessibility(DW_ACCESS_public)
    8251              
    8252                      .dwendtag $C$DW$T$74
    8253              
    8254              $C$DW$T$51      .dwtag  DW_TAG_typedef
    8255                      .dwattr $C$DW$T$51, DW_AT_name("TRAJ_Obj")
    8256                      .dwattr $C$DW$T$51, DW_AT_type(*$C$DW$T$74)
    8257                      .dwattr $C$DW$T$51, DW_AT_language(DW_LANG_C)
    8258              
    8259              $C$DW$T$49      .dwtag  DW_TAG_pointer_type
    8260                      .dwattr $C$DW$T$49, DW_AT_type(*$C$DW$T$74)
    8261                      .dwattr $C$DW$T$49, DW_AT_address_class(0x20)
    8262              
    8263              $C$DW$T$50      .dwtag  DW_TAG_typedef
    8264                      .dwattr $C$DW$T$50, DW_AT_name("TRAJ_Handle")
    8265                      .dwattr $C$DW$T$50, DW_AT_type(*$C$DW$T$49)
    8266                      .dwattr $C$DW$T$50, DW_AT_language(DW_LANG_C)
    8267              
    8268              
    8269              $C$DW$T$80      .dwtag  DW_TAG_structure_type
    8270                      .dwattr $C$DW$T$80, DW_AT_name("_USER_Params_")
    8271                      .dwattr $C$DW$T$80, DW_AT_byte_size(0xac)
    8272              $C$DW$745       .dwtag  DW_TAG_member
    8273                      .dwattr $C$DW$745, DW_AT_type(*$C$DW$T$57)
    8274                      .dwattr $C$DW$745, DW_AT_name("iqFullScaleCurrent_A")
    8275                      .dwattr $C$DW$745, DW_AT_TI_symbol_name("_iqFullScaleCurrent_A")
    8276                      .dwattr $C$DW$745, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    8277                      .dwattr $C$DW$745, DW_AT_accessibility(DW_ACCESS_public)
    8278              
    8279              $C$DW$746       .dwtag  DW_TAG_member
    8280                      .dwattr $C$DW$746, DW_AT_type(*$C$DW$T$57)
    8281                      .dwattr $C$DW$746, DW_AT_name("iqFullScaleVoltage_V")
    8282                      .dwattr $C$DW$746, DW_AT_TI_symbol_name("_iqFullScaleVoltage_V")
    8283                      .dwattr $C$DW$746, DW_AT_data_member_location[DW_OP_plus_uconst 0x2]
    8284                      .dwattr $C$DW$746, DW_AT_accessibility(DW_ACCESS_public)
TMS320C2000 Assembler PC v15.12.3 Wed Nov 22 00:56:30 2017

Tools Copyright (c) 1996-2015 Texas Instruments Incorporated
C:\Users\wmj\AppData\Local\Temp\0764810                              PAGE  164

    8285              
    8286              $C$DW$747       .dwtag  DW_TAG_member
    8287                      .dwattr $C$DW$747, DW_AT_type(*$C$DW$T$57)
    8288                      .dwattr $C$DW$747, DW_AT_name("iqFullScaleFreq_Hz")
    8289                      .dwattr $C$DW$747, DW_AT_TI_symbol_name("_iqFullScaleFreq_Hz")
    8290                      .dwattr $C$DW$747, DW_AT_data_member_location[DW_OP_plus_uconst 0x4]
    8291                      .dwattr $C$DW$747, DW_AT_accessibility(DW_ACCESS_public)
    8292              
    8293              $C$DW$748       .dwtag  DW_TAG_member
    8294                      .dwattr $C$DW$748, DW_AT_type(*$C$DW$T$56)
    8295                      .dwattr $C$DW$748, DW_AT_name("numIsrTicksPerCtrlTick")
    8296                      .dwattr $C$DW$748, DW_AT_TI_symbol_name("_numIsrTicksPerCtrlTick")
    8297                      .dwattr $C$DW$748, DW_AT_data_member_location[DW_OP_plus_uconst 0x6]
    8298                      .dwattr $C$DW$748, DW_AT_accessibility(DW_ACCESS_public)
    8299              
    8300              $C$DW$749       .dwtag  DW_TAG_member
    8301                      .dwattr $C$DW$749, DW_AT_type(*$C$DW$T$56)
    8302                      .dwattr $C$DW$749, DW_AT_name("numCtrlTicksPerCurrentTick")
    8303                      .dwattr $C$DW$749, DW_AT_TI_symbol_name("_numCtrlTicksPerCurrentTick")
    8304                      .dwattr $C$DW$749, DW_AT_data_member_location[DW_OP_plus_uconst 0x7]
    8305                      .dwattr $C$DW$749, DW_AT_accessibility(DW_ACCESS_public)
    8306              
    8307              $C$DW$750       .dwtag  DW_TAG_member
    8308                      .dwattr $C$DW$750, DW_AT_type(*$C$DW$T$56)
    8309                      .dwattr $C$DW$750, DW_AT_name("numCtrlTicksPerEstTick")
    8310                      .dwattr $C$DW$750, DW_AT_TI_symbol_name("_numCtrlTicksPerEstTick")
    8311                      .dwattr $C$DW$750, DW_AT_data_member_location[DW_OP_plus_uconst 0x8]
    8312                      .dwattr $C$DW$750, DW_AT_accessibility(DW_ACCESS_public)
    8313              
    8314              $C$DW$751       .dwtag  DW_TAG_member
    8315                      .dwattr $C$DW$751, DW_AT_type(*$C$DW$T$56)
    8316                      .dwattr $C$DW$751, DW_AT_name("numCtrlTicksPerSpeedTick")
    8317                      .dwattr $C$DW$751, DW_AT_TI_symbol_name("_numCtrlTicksPerSpeedTick")
    8318                      .dwattr $C$DW$751, DW_AT_data_member_location[DW_OP_plus_uconst 0x9]
    8319                      .dwattr $C$DW$751, DW_AT_accessibility(DW_ACCESS_public)
    8320              
    8321              $C$DW$752       .dwtag  DW_TAG_member
    8322                      .dwattr $C$DW$752, DW_AT_type(*$C$DW$T$56)
    8323                      .dwattr $C$DW$752, DW_AT_name("numCtrlTicksPerTrajTick")
    8324                      .dwattr $C$DW$752, DW_AT_TI_symbol_name("_numCtrlTicksPerTrajTick")
    8325                      .dwattr $C$DW$752, DW_AT_data_member_location[DW_OP_plus_uconst 0xa]
    8326                      .dwattr $C$DW$752, DW_AT_accessibility(DW_ACCESS_public)
    8327              
    8328              $C$DW$753       .dwtag  DW_TAG_member
    8329                      .dwattr $C$DW$753, DW_AT_type(*$C$DW$T$25)
    8330                      .dwattr $C$DW$753, DW_AT_name("numCurrentSensors")
    8331                      .dwattr $C$DW$753, DW_AT_TI_symbol_name("_numCurrentSensors")
    8332                      .dwattr $C$DW$753, DW_AT_data_member_location[DW_OP_plus_uconst 0xb]
    8333                      .dwattr $C$DW$753, DW_AT_accessibility(DW_ACCESS_public)
    8334              
    8335              $C$DW$754       .dwtag  DW_TAG_member
    8336                      .dwattr $C$DW$754, DW_AT_type(*$C$DW$T$25)
    8337                      .dwattr $C$DW$754, DW_AT_name("numVoltageSensors")
    8338                      .dwattr $C$DW$754, DW_AT_TI_symbol_name("_numVoltageSensors")
    8339                      .dwattr $C$DW$754, DW_AT_data_member_location[DW_OP_plus_uconst 0xc]
TMS320C2000 Assembler PC v15.12.3 Wed Nov 22 00:56:30 2017

Tools Copyright (c) 1996-2015 Texas Instruments Incorporated
C:\Users\wmj\AppData\Local\Temp\0764810                              PAGE  165

    8340                      .dwattr $C$DW$754, DW_AT_accessibility(DW_ACCESS_public)
    8341              
    8342              $C$DW$755       .dwtag  DW_TAG_member
    8343                      .dwattr $C$DW$755, DW_AT_type(*$C$DW$T$57)
    8344                      .dwattr $C$DW$755, DW_AT_name("offsetPole_rps")
    8345                      .dwattr $C$DW$755, DW_AT_TI_symbol_name("_offsetPole_rps")
    8346                      .dwattr $C$DW$755, DW_AT_data_member_location[DW_OP_plus_uconst 0xe]
    8347                      .dwattr $C$DW$755, DW_AT_accessibility(DW_ACCESS_public)
    8348              
    8349              $C$DW$756       .dwtag  DW_TAG_member
    8350                      .dwattr $C$DW$756, DW_AT_type(*$C$DW$T$57)
    8351                      .dwattr $C$DW$756, DW_AT_name("fluxPole_rps")
    8352                      .dwattr $C$DW$756, DW_AT_TI_symbol_name("_fluxPole_rps")
    8353                      .dwattr $C$DW$756, DW_AT_data_member_location[DW_OP_plus_uconst 0x10]
    8354                      .dwattr $C$DW$756, DW_AT_accessibility(DW_ACCESS_public)
    8355              
    8356              $C$DW$757       .dwtag  DW_TAG_member
    8357                      .dwattr $C$DW$757, DW_AT_type(*$C$DW$T$57)
    8358                      .dwattr $C$DW$757, DW_AT_name("zeroSpeedLimit")
    8359                      .dwattr $C$DW$757, DW_AT_TI_symbol_name("_zeroSpeedLimit")
    8360                      .dwattr $C$DW$757, DW_AT_data_member_location[DW_OP_plus_uconst 0x12]
    8361                      .dwattr $C$DW$757, DW_AT_accessibility(DW_ACCESS_public)
    8362              
    8363              $C$DW$758       .dwtag  DW_TAG_member
    8364                      .dwattr $C$DW$758, DW_AT_type(*$C$DW$T$57)
    8365                      .dwattr $C$DW$758, DW_AT_name("forceAngleFreq_Hz")
    8366                      .dwattr $C$DW$758, DW_AT_TI_symbol_name("_forceAngleFreq_Hz")
    8367                      .dwattr $C$DW$758, DW_AT_data_member_location[DW_OP_plus_uconst 0x14]
    8368                      .dwattr $C$DW$758, DW_AT_accessibility(DW_ACCESS_public)
    8369              
    8370              $C$DW$759       .dwtag  DW_TAG_member
    8371                      .dwattr $C$DW$759, DW_AT_type(*$C$DW$T$57)
    8372                      .dwattr $C$DW$759, DW_AT_name("maxAccel_Hzps")
    8373                      .dwattr $C$DW$759, DW_AT_TI_symbol_name("_maxAccel_Hzps")
    8374                      .dwattr $C$DW$759, DW_AT_data_member_location[DW_OP_plus_uconst 0x16]
    8375                      .dwattr $C$DW$759, DW_AT_accessibility(DW_ACCESS_public)
    8376              
    8377              $C$DW$760       .dwtag  DW_TAG_member
    8378                      .dwattr $C$DW$760, DW_AT_type(*$C$DW$T$57)
    8379                      .dwattr $C$DW$760, DW_AT_name("maxAccel_est_Hzps")
    8380                      .dwattr $C$DW$760, DW_AT_TI_symbol_name("_maxAccel_est_Hzps")
    8381                      .dwattr $C$DW$760, DW_AT_data_member_location[DW_OP_plus_uconst 0x18]
    8382                      .dwattr $C$DW$760, DW_AT_accessibility(DW_ACCESS_public)
    8383              
    8384              $C$DW$761       .dwtag  DW_TAG_member
    8385                      .dwattr $C$DW$761, DW_AT_type(*$C$DW$T$57)
    8386                      .dwattr $C$DW$761, DW_AT_name("directionPole_rps")
    8387                      .dwattr $C$DW$761, DW_AT_TI_symbol_name("_directionPole_rps")
    8388                      .dwattr $C$DW$761, DW_AT_data_member_location[DW_OP_plus_uconst 0x1a]
    8389                      .dwattr $C$DW$761, DW_AT_accessibility(DW_ACCESS_public)
    8390              
    8391              $C$DW$762       .dwtag  DW_TAG_member
    8392                      .dwattr $C$DW$762, DW_AT_type(*$C$DW$T$57)
    8393                      .dwattr $C$DW$762, DW_AT_name("speedPole_rps")
    8394                      .dwattr $C$DW$762, DW_AT_TI_symbol_name("_speedPole_rps")
TMS320C2000 Assembler PC v15.12.3 Wed Nov 22 00:56:30 2017

Tools Copyright (c) 1996-2015 Texas Instruments Incorporated
C:\Users\wmj\AppData\Local\Temp\0764810                              PAGE  166

    8395                      .dwattr $C$DW$762, DW_AT_data_member_location[DW_OP_plus_uconst 0x1c]
    8396                      .dwattr $C$DW$762, DW_AT_accessibility(DW_ACCESS_public)
    8397              
    8398              $C$DW$763       .dwtag  DW_TAG_member
    8399                      .dwattr $C$DW$763, DW_AT_type(*$C$DW$T$57)
    8400                      .dwattr $C$DW$763, DW_AT_name("dcBusPole_rps")
    8401                      .dwattr $C$DW$763, DW_AT_TI_symbol_name("_dcBusPole_rps")
    8402                      .dwattr $C$DW$763, DW_AT_data_member_location[DW_OP_plus_uconst 0x1e]
    8403                      .dwattr $C$DW$763, DW_AT_accessibility(DW_ACCESS_public)
    8404              
    8405              $C$DW$764       .dwtag  DW_TAG_member
    8406                      .dwattr $C$DW$764, DW_AT_type(*$C$DW$T$57)
    8407                      .dwattr $C$DW$764, DW_AT_name("fluxFraction")
    8408                      .dwattr $C$DW$764, DW_AT_TI_symbol_name("_fluxFraction")
    8409                      .dwattr $C$DW$764, DW_AT_data_member_location[DW_OP_plus_uconst 0x20]
    8410                      .dwattr $C$DW$764, DW_AT_accessibility(DW_ACCESS_public)
    8411              
    8412              $C$DW$765       .dwtag  DW_TAG_member
    8413                      .dwattr $C$DW$765, DW_AT_type(*$C$DW$T$57)
    8414                      .dwattr $C$DW$765, DW_AT_name("indEst_speedMaxFraction")
    8415                      .dwattr $C$DW$765, DW_AT_TI_symbol_name("_indEst_speedMaxFraction")
    8416                      .dwattr $C$DW$765, DW_AT_data_member_location[DW_OP_plus_uconst 0x22]
    8417                      .dwattr $C$DW$765, DW_AT_accessibility(DW_ACCESS_public)
    8418              
    8419              $C$DW$766       .dwtag  DW_TAG_member
    8420                      .dwattr $C$DW$766, DW_AT_type(*$C$DW$T$57)
    8421                      .dwattr $C$DW$766, DW_AT_name("powerWarpGain")
    8422                      .dwattr $C$DW$766, DW_AT_TI_symbol_name("_powerWarpGain")
    8423                      .dwattr $C$DW$766, DW_AT_data_member_location[DW_OP_plus_uconst 0x24]
    8424                      .dwattr $C$DW$766, DW_AT_accessibility(DW_ACCESS_public)
    8425              
    8426              $C$DW$767       .dwtag  DW_TAG_member
    8427                      .dwattr $C$DW$767, DW_AT_type(*$C$DW$T$56)
    8428                      .dwattr $C$DW$767, DW_AT_name("systemFreq_MHz")
    8429                      .dwattr $C$DW$767, DW_AT_TI_symbol_name("_systemFreq_MHz")
    8430                      .dwattr $C$DW$767, DW_AT_data_member_location[DW_OP_plus_uconst 0x26]
    8431                      .dwattr $C$DW$767, DW_AT_accessibility(DW_ACCESS_public)
    8432              
    8433              $C$DW$768       .dwtag  DW_TAG_member
    8434                      .dwattr $C$DW$768, DW_AT_type(*$C$DW$T$57)
    8435                      .dwattr $C$DW$768, DW_AT_name("pwmPeriod_usec")
    8436                      .dwattr $C$DW$768, DW_AT_TI_symbol_name("_pwmPeriod_usec")
    8437                      .dwattr $C$DW$768, DW_AT_data_member_location[DW_OP_plus_uconst 0x28]
    8438                      .dwattr $C$DW$768, DW_AT_accessibility(DW_ACCESS_public)
    8439              
    8440              $C$DW$769       .dwtag  DW_TAG_member
    8441                      .dwattr $C$DW$769, DW_AT_type(*$C$DW$T$57)
    8442                      .dwattr $C$DW$769, DW_AT_name("voltage_sf")
    8443                      .dwattr $C$DW$769, DW_AT_TI_symbol_name("_voltage_sf")
    8444                      .dwattr $C$DW$769, DW_AT_data_member_location[DW_OP_plus_uconst 0x2a]
    8445                      .dwattr $C$DW$769, DW_AT_accessibility(DW_ACCESS_public)
    8446              
    8447              $C$DW$770       .dwtag  DW_TAG_member
    8448                      .dwattr $C$DW$770, DW_AT_type(*$C$DW$T$57)
    8449                      .dwattr $C$DW$770, DW_AT_name("current_sf")
TMS320C2000 Assembler PC v15.12.3 Wed Nov 22 00:56:30 2017

Tools Copyright (c) 1996-2015 Texas Instruments Incorporated
C:\Users\wmj\AppData\Local\Temp\0764810                              PAGE  167

    8450                      .dwattr $C$DW$770, DW_AT_TI_symbol_name("_current_sf")
    8451                      .dwattr $C$DW$770, DW_AT_data_member_location[DW_OP_plus_uconst 0x2c]
    8452                      .dwattr $C$DW$770, DW_AT_accessibility(DW_ACCESS_public)
    8453              
    8454              $C$DW$771       .dwtag  DW_TAG_member
    8455                      .dwattr $C$DW$771, DW_AT_type(*$C$DW$T$57)
    8456                      .dwattr $C$DW$771, DW_AT_name("voltageFilterPole_rps")
    8457                      .dwattr $C$DW$771, DW_AT_TI_symbol_name("_voltageFilterPole_rps")
    8458                      .dwattr $C$DW$771, DW_AT_data_member_location[DW_OP_plus_uconst 0x2e]
    8459                      .dwattr $C$DW$771, DW_AT_accessibility(DW_ACCESS_public)
    8460              
    8461              $C$DW$772       .dwtag  DW_TAG_member
    8462                      .dwattr $C$DW$772, DW_AT_type(*$C$DW$T$57)
    8463                      .dwattr $C$DW$772, DW_AT_name("maxVsMag_pu")
    8464                      .dwattr $C$DW$772, DW_AT_TI_symbol_name("_maxVsMag_pu")
    8465                      .dwattr $C$DW$772, DW_AT_data_member_location[DW_OP_plus_uconst 0x30]
    8466                      .dwattr $C$DW$772, DW_AT_accessibility(DW_ACCESS_public)
    8467              
    8468              $C$DW$773       .dwtag  DW_TAG_member
    8469                      .dwattr $C$DW$773, DW_AT_type(*$C$DW$T$57)
    8470                      .dwattr $C$DW$773, DW_AT_name("estKappa")
    8471                      .dwattr $C$DW$773, DW_AT_TI_symbol_name("_estKappa")
    8472                      .dwattr $C$DW$773, DW_AT_data_member_location[DW_OP_plus_uconst 0x32]
    8473                      .dwattr $C$DW$773, DW_AT_accessibility(DW_ACCESS_public)
    8474              
    8475              $C$DW$774       .dwtag  DW_TAG_member
    8476                      .dwattr $C$DW$774, DW_AT_type(*$C$DW$T$69)
    8477                      .dwattr $C$DW$774, DW_AT_name("motor_type")
    8478                      .dwattr $C$DW$774, DW_AT_TI_symbol_name("_motor_type")
    8479                      .dwattr $C$DW$774, DW_AT_data_member_location[DW_OP_plus_uconst 0x34]
    8480                      .dwattr $C$DW$774, DW_AT_accessibility(DW_ACCESS_public)
    8481              
