TMS320C2000 Assembler PC v6.2.5 Tue Nov 21 21:02:56 2017

Tools Copyright (c) 1996-2014 Texas Instruments Incorporated
C:\Users\wmj\AppData\Local\Temp\0903213                              PAGE    1

       1              ;***************************************************************
       2              ;* TMS320C2000 C/C++ Codegen                         PC v6.2.5 *
       3              ;* Date/Time created: Tue Nov 21 21:02:55 2017                 *
       4              ;***************************************************************
       5                      .compiler_opts --float_support=softlib --hll_source=on --mem_model:code=flat --mem_model:data=large -
       6        0002  FP      .set    XAR2
       7              
       8              $C$DW$CU        .dwtag  DW_TAG_compile_unit
       9                      .dwattr $C$DW$CU, DW_AT_name("D:/BM1000_v1.1/sw/modules/user/src/32b/user.c")
      10                      .dwattr $C$DW$CU, DW_AT_producer("TMS320C2000 C/C++ Codegen PC v6.2.5 Copyright (c) 1996-2014 Texas I
      11                      .dwattr $C$DW$CU, DW_AT_TI_version(0x01)
      12                      .dwattr $C$DW$CU, DW_AT_comp_dir("D:\BM1000_v1.1\sw\solutions\instaspin_foc\boards\hvkit_rev1p1\f28x\
      13              
      14              $C$DW$1 .dwtag  DW_TAG_subprogram, DW_AT_name("EST_setLs_qFmt")
      15                      .dwattr $C$DW$1, DW_AT_TI_symbol_name("_EST_setLs_qFmt")

    6399              $C$DW$612       .dwtag  DW_TAG_enumerator, DW_AT_name("USER_ErrorCode_maxCurrentSlope_High"), DW_AT_const_val
    6400              $C$DW$613       .dwtag  DW_TAG_enumerator, DW_AT_name("USER_ErrorCode_maxCurrentSlope_Low"), DW_AT_const_valu
    6401              $C$DW$614       .dwtag  DW_TAG_enumerator, DW_AT_name("USER_ErrorCode_maxCurrentSlope_powerWarp_High"), DW_AT
    6402              $C$DW$615       .dwtag  DW_TAG_enumerator, DW_AT_name("USER_ErrorCode_maxCurrentSlope_powerWarp_Low"), DW_AT_
    6403              $C$DW$616       .dwtag  DW_TAG_enumerator, DW_AT_name("USER_ErrorCode_IdRated_High"), DW_AT_const_value(0x54)
    6404              $C$DW$617       .dwtag  DW_TAG_enumerator, DW_AT_name("USER_ErrorCode_IdRated_Low"), DW_AT_const_value(0x55)
    6405              $C$DW$618       .dwtag  DW_TAG_enumerator, DW_AT_name("USER_ErrorCode_IdRatedFraction_indEst_High"), DW_AT_co
    6406              $C$DW$619       .dwtag  DW_TAG_enumerator, DW_AT_name("USER_ErrorCode_IdRatedFraction_indEst_Low"), DW_AT_con
    6407              $C$DW$620       .dwtag  DW_TAG_enumerator, DW_AT_name("USER_ErrorCode_IdRatedFraction_ratedFlux_High"), DW_AT
    6408              $C$DW$621       .dwtag  DW_TAG_enumerator, DW_AT_name("USER_ErrorCode_IdRatedFraction_ratedFlux_Low"), DW_AT_
    6409              $C$DW$622       .dwtag  DW_TAG_enumerator, DW_AT_name("USER_ErrorCode_IdRated_delta_High"), DW_AT_const_value
    6410              $C$DW$623       .dwtag  DW_TAG_enumerator, DW_AT_name("USER_ErrorCode_IdRated_delta_Low"), DW_AT_const_value(
    6411              $C$DW$624       .dwtag  DW_TAG_enumerator, DW_AT_name("USER_ErrorCode_fluxEstFreq_Hz_High"), DW_AT_const_valu
    6412              $C$DW$625       .dwtag  DW_TAG_enumerator, DW_AT_name("USER_ErrorCode_fluxEstFreq_Hz_Low"), DW_AT_const_value
    6413              $C$DW$626       .dwtag  DW_TAG_enumerator, DW_AT_name("USER_ErrorCode_ctrlFreq_Hz_High"), DW_AT_const_value(0
    6414              $C$DW$627       .dwtag  DW_TAG_enumerator, DW_AT_name("USER_ErrorCode_ctrlFreq_Hz_Low"), DW_AT_const_value(0x
    6415              $C$DW$628       .dwtag  DW_TAG_enumerator, DW_AT_name("USER_ErrorCode_estFreq_Hz_High"), DW_AT_const_value(0x
    6416              $C$DW$629       .dwtag  DW_TAG_enumerator, DW_AT_name("USER_ErrorCode_estFreq_Hz_Low"), DW_AT_const_value(0x6
    6417              $C$DW$630       .dwtag  DW_TAG_enumerator, DW_AT_name("USER_ErrorCode_RoverL_estFreq_Hz_High"), DW_AT_const_v
    6418              $C$DW$631       .dwtag  DW_TAG_enumerator, DW_AT_name("USER_ErrorCode_RoverL_estFreq_Hz_Low"), DW_AT_const_va
    6419              $C$DW$632       .dwtag  DW_TAG_enumerator, DW_AT_name("USER_ErrorCode_trajFreq_Hz_High"), DW_AT_const_value(0
    6420              $C$DW$633       .dwtag  DW_TAG_enumerator, DW_AT_name("USER_ErrorCode_trajFreq_Hz_Low"), DW_AT_const_value(0x
    6421              $C$DW$634       .dwtag  DW_TAG_enumerator, DW_AT_name("USER_ErrorCode_ctrlPeriod_sec_High"), DW_AT_const_valu
    6422              $C$DW$635       .dwtag  DW_TAG_enumerator, DW_AT_name("USER_ErrorCode_ctrlPeriod_sec_Low"), DW_AT_const_value
    6423              $C$DW$636       .dwtag  DW_TAG_enumerator, DW_AT_name("USER_ErrorCode_maxNegativeIdCurrent_a_High"), DW_AT_co
    6424              $C$DW$637       .dwtag  DW_TAG_enumerator, DW_AT_name("USER_ErrorCode_maxNegativeIdCurrent_a_Low"), DW_AT_con
    6425              $C$DW$638       .dwtag  DW_TAG_enumerator, DW_AT_name("USER_numErrorCodes"), DW_AT_const_value(0x6a)
    6426                      .dwendtag $C$DW$T$78
    6427              
    6428              $C$DW$T$79      .dwtag  DW_TAG_typedef, DW_AT_name("USER_ErrorCode_e")
    6429                      .dwattr $C$DW$T$79, DW_AT_type(*$C$DW$T$78)
    6430                      .dwattr $C$DW$T$79, DW_AT_language(DW_LANG_C)
    6431              $C$DW$639       .dwtag  DW_TAG_TI_far_type
    6432                      .dwattr $C$DW$639, DW_AT_type(*$C$DW$T$79)
    6433              $C$DW$T$83      .dwtag  DW_TAG_const_type
    6434                      .dwattr $C$DW$T$83, DW_AT_type(*$C$DW$639)
    6435              
    6436              $C$DW$T$88      .dwtag  DW_TAG_enumeration_type
    6437                      .dwattr $C$DW$T$88, DW_AT_byte_size(0x01)
    6438              $C$DW$640       .dwtag  DW_TAG_enumerator, DW_AT_name("CTRL_Type_PID_spd"), DW_AT_const_value(0x00)
    6439              $C$DW$641       .dwtag  DW_TAG_enumerator, DW_AT_name("CTRL_Type_PID_Id"), DW_AT_const_value(0x01)
    6440              $C$DW$642       .dwtag  DW_TAG_enumerator, DW_AT_name("CTRL_Type_PID_Iq"), DW_AT_const_value(0x02)
    6441                      .dwendtag $C$DW$T$88
    6442              
TMS320C2000 Assembler PC v6.2.5 Tue Nov 21 21:02:56 2017

Tools Copyright (c) 1996-2014 Texas Instruments Incorporated
C:\Users\wmj\AppData\Local\Temp\0903213                              PAGE  131

    6443              $C$DW$T$89      .dwtag  DW_TAG_typedef, DW_AT_name("CTRL_Type_e")
    6444                      .dwattr $C$DW$T$89, DW_AT_type(*$C$DW$T$88)
    6445                      .dwattr $C$DW$T$89, DW_AT_language(DW_LANG_C)
    6446              $C$DW$643       .dwtag  DW_TAG_TI_far_type
    6447                      .dwattr $C$DW$643, DW_AT_type(*$C$DW$T$89)
    6448              $C$DW$T$90      .dwtag  DW_TAG_const_type
    6449                      .dwattr $C$DW$T$90, DW_AT_type(*$C$DW$643)
    6450              
    6451              $C$DW$T$23      .dwtag  DW_TAG_structure_type
    6452                      .dwattr $C$DW$T$23, DW_AT_name("_BRAKE_Obj_")
    6453                      .dwattr $C$DW$T$23, DW_AT_byte_size(0x08)
    6454              $C$DW$644       .dwtag  DW_TAG_member
    6455                      .dwattr $C$DW$644, DW_AT_type(*$C$DW$T$20)
    6456                      .dwattr $C$DW$644, DW_AT_name("angle_pu")
    6457                      .dwattr $C$DW$644, DW_AT_TI_symbol_name("_angle_pu")
    6458                      .dwattr $C$DW$644, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    6459                      .dwattr $C$DW$644, DW_AT_accessibility(DW_ACCESS_public)
    6460              $C$DW$645       .dwtag  DW_TAG_member
    6461                      .dwattr $C$DW$645, DW_AT_type(*$C$DW$T$21)
    6462                      .dwattr $C$DW$645, DW_AT_name("Idq_brake")
    6463                      .dwattr $C$DW$645, DW_AT_TI_symbol_name("_Idq_brake")
    6464                      .dwattr $C$DW$645, DW_AT_data_member_location[DW_OP_plus_uconst 0x2]
    6465                      .dwattr $C$DW$645, DW_AT_accessibility(DW_ACCESS_public)
    6466              $C$DW$646       .dwtag  DW_TAG_member
    6467                      .dwattr $C$DW$646, DW_AT_type(*$C$DW$T$22)
    6468                      .dwattr $C$DW$646, DW_AT_name("brake_enable")
    6469                      .dwattr $C$DW$646, DW_AT_TI_symbol_name("_brake_enable")
    6470                      .dwattr $C$DW$646, DW_AT_data_member_location[DW_OP_plus_uconst 0x6]
    6471                      .dwattr $C$DW$646, DW_AT_accessibility(DW_ACCESS_public)
    6472                      .dwendtag $C$DW$T$23
    6473              
    6474              $C$DW$T$60      .dwtag  DW_TAG_typedef, DW_AT_name("BRAKE_Obj")
    6475                      .dwattr $C$DW$T$60, DW_AT_type(*$C$DW$T$23)
    6476                      .dwattr $C$DW$T$60, DW_AT_language(DW_LANG_C)
    6477              $C$DW$T$58      .dwtag  DW_TAG_pointer_type
    6478                      .dwattr $C$DW$T$58, DW_AT_type(*$C$DW$T$23)
    6479                      .dwattr $C$DW$T$58, DW_AT_address_class(0x16)
    6480              $C$DW$T$59      .dwtag  DW_TAG_typedef, DW_AT_name("BRAKE_Handle")
    6481                      .dwattr $C$DW$T$59, DW_AT_type(*$C$DW$T$58)
    6482                      .dwattr $C$DW$T$59, DW_AT_language(DW_LANG_C)
    6483              
    6484              $C$DW$T$26      .dwtag  DW_TAG_structure_type
    6485                      .dwattr $C$DW$T$26, DW_AT_name("_CLARKE_Obj_")
    6486                      .dwattr $C$DW$T$26, DW_AT_byte_size(0x06)
    6487              $C$DW$647       .dwtag  DW_TAG_member
    6488                      .dwattr $C$DW$647, DW_AT_type(*$C$DW$T$20)
    6489                      .dwattr $C$DW$647, DW_AT_name("alpha_sf")
    6490                      .dwattr $C$DW$647, DW_AT_TI_symbol_name("_alpha_sf")
    6491                      .dwattr $C$DW$647, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    6492                      .dwattr $C$DW$647, DW_AT_accessibility(DW_ACCESS_public)
    6493              $C$DW$648       .dwtag  DW_TAG_member
    6494                      .dwattr $C$DW$648, DW_AT_type(*$C$DW$T$20)
    6495                      .dwattr $C$DW$648, DW_AT_name("beta_sf")
    6496                      .dwattr $C$DW$648, DW_AT_TI_symbol_name("_beta_sf")
    6497                      .dwattr $C$DW$648, DW_AT_data_member_location[DW_OP_plus_uconst 0x2]
TMS320C2000 Assembler PC v6.2.5 Tue Nov 21 21:02:56 2017

Tools Copyright (c) 1996-2014 Texas Instruments Incorporated
C:\Users\wmj\AppData\Local\Temp\0903213                              PAGE  132

    6498                      .dwattr $C$DW$648, DW_AT_accessibility(DW_ACCESS_public)
    6499              $C$DW$649       .dwtag  DW_TAG_member
    6500                      .dwattr $C$DW$649, DW_AT_type(*$C$DW$T$25)
    6501                      .dwattr $C$DW$649, DW_AT_name("numSensors")
    6502                      .dwattr $C$DW$649, DW_AT_TI_symbol_name("_numSensors")
    6503                      .dwattr $C$DW$649, DW_AT_data_member_location[DW_OP_plus_uconst 0x4]
    6504                      .dwattr $C$DW$649, DW_AT_accessibility(DW_ACCESS_public)
    6505                      .dwendtag $C$DW$T$26
    6506              
    6507              $C$DW$T$34      .dwtag  DW_TAG_typedef, DW_AT_name("CLARKE_Obj")
    6508                      .dwattr $C$DW$T$34, DW_AT_type(*$C$DW$T$26)
    6509                      .dwattr $C$DW$T$34, DW_AT_language(DW_LANG_C)
    6510              $C$DW$T$32      .dwtag  DW_TAG_pointer_type
    6511                      .dwattr $C$DW$T$32, DW_AT_type(*$C$DW$T$26)
    6512                      .dwattr $C$DW$T$32, DW_AT_address_class(0x16)
    6513              $C$DW$T$33      .dwtag  DW_TAG_typedef, DW_AT_name("CLARKE_Handle")
    6514                      .dwattr $C$DW$T$33, DW_AT_type(*$C$DW$T$32)
    6515                      .dwattr $C$DW$T$33, DW_AT_language(DW_LANG_C)
    6516              
    6517              $C$DW$T$61      .dwtag  DW_TAG_structure_type
    6518                      .dwattr $C$DW$T$61, DW_AT_name("_CTRL_Obj_")
    6519                      .dwattr $C$DW$T$61, DW_AT_byte_size(0x108)
    6520              $C$DW$650       .dwtag  DW_TAG_member
    6521                      .dwattr $C$DW$650, DW_AT_type(*$C$DW$T$27)
    6522                      .dwattr $C$DW$650, DW_AT_name("version")
    6523                      .dwattr $C$DW$650, DW_AT_TI_symbol_name("_version")
    6524                      .dwattr $C$DW$650, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    6525                      .dwattr $C$DW$650, DW_AT_accessibility(DW_ACCESS_public)
    6526              $C$DW$651       .dwtag  DW_TAG_member
    6527                      .dwattr $C$DW$651, DW_AT_type(*$C$DW$T$29)
    6528                      .dwattr $C$DW$651, DW_AT_name("state")
    6529                      .dwattr $C$DW$651, DW_AT_TI_symbol_name("_state")
    6530                      .dwattr $C$DW$651, DW_AT_data_member_location[DW_OP_plus_uconst 0x4]
    6531                      .dwattr $C$DW$651, DW_AT_accessibility(DW_ACCESS_public)
    6532              $C$DW$652       .dwtag  DW_TAG_member
    6533                      .dwattr $C$DW$652, DW_AT_type(*$C$DW$T$29)
    6534                      .dwattr $C$DW$652, DW_AT_name("prevState")
    6535                      .dwattr $C$DW$652, DW_AT_TI_symbol_name("_prevState")
    6536                      .dwattr $C$DW$652, DW_AT_data_member_location[DW_OP_plus_uconst 0x5]
    6537                      .dwattr $C$DW$652, DW_AT_accessibility(DW_ACCESS_public)
    6538              $C$DW$653       .dwtag  DW_TAG_member
    6539                      .dwattr $C$DW$653, DW_AT_type(*$C$DW$T$31)
    6540                      .dwattr $C$DW$653, DW_AT_name("errorCode")
    6541                      .dwattr $C$DW$653, DW_AT_TI_symbol_name("_errorCode")
    6542                      .dwattr $C$DW$653, DW_AT_data_member_location[DW_OP_plus_uconst 0x6]
    6543                      .dwattr $C$DW$653, DW_AT_accessibility(DW_ACCESS_public)
    6544              $C$DW$654       .dwtag  DW_TAG_member
    6545                      .dwattr $C$DW$654, DW_AT_type(*$C$DW$T$33)
    6546                      .dwattr $C$DW$654, DW_AT_name("clarkeHandle_I")
    6547                      .dwattr $C$DW$654, DW_AT_TI_symbol_name("_clarkeHandle_I")
    6548                      .dwattr $C$DW$654, DW_AT_data_member_location[DW_OP_plus_uconst 0x8]
    6549                      .dwattr $C$DW$654, DW_AT_accessibility(DW_ACCESS_public)
    6550              $C$DW$655       .dwtag  DW_TAG_member
    6551                      .dwattr $C$DW$655, DW_AT_type(*$C$DW$T$34)
    6552                      .dwattr $C$DW$655, DW_AT_name("clarke_I")
TMS320C2000 Assembler PC v6.2.5 Tue Nov 21 21:02:56 2017

Tools Copyright (c) 1996-2014 Texas Instruments Incorporated
C:\Users\wmj\AppData\Local\Temp\0903213                              PAGE  133

    6553                      .dwattr $C$DW$655, DW_AT_TI_symbol_name("_clarke_I")
    6554                      .dwattr $C$DW$655, DW_AT_data_member_location[DW_OP_plus_uconst 0xa]
    6555                      .dwattr $C$DW$655, DW_AT_accessibility(DW_ACCESS_public)
    6556              $C$DW$656       .dwtag  DW_TAG_member
    6557                      .dwattr $C$DW$656, DW_AT_type(*$C$DW$T$33)
    6558                      .dwattr $C$DW$656, DW_AT_name("clarkeHandle_V")
    6559                      .dwattr $C$DW$656, DW_AT_TI_symbol_name("_clarkeHandle_V")
    6560                      .dwattr $C$DW$656, DW_AT_data_member_location[DW_OP_plus_uconst 0x10]
    6561                      .dwattr $C$DW$656, DW_AT_accessibility(DW_ACCESS_public)
    6562              $C$DW$657       .dwtag  DW_TAG_member
    6563                      .dwattr $C$DW$657, DW_AT_type(*$C$DW$T$34)
    6564                      .dwattr $C$DW$657, DW_AT_name("clarke_V")
    6565                      .dwattr $C$DW$657, DW_AT_TI_symbol_name("_clarke_V")
    6566                      .dwattr $C$DW$657, DW_AT_data_member_location[DW_OP_plus_uconst 0x12]
    6567                      .dwattr $C$DW$657, DW_AT_accessibility(DW_ACCESS_public)
    6568              $C$DW$658       .dwtag  DW_TAG_member
    6569                      .dwattr $C$DW$658, DW_AT_type(*$C$DW$T$36)
    6570                      .dwattr $C$DW$658, DW_AT_name("estHandle")
    6571                      .dwattr $C$DW$658, DW_AT_TI_symbol_name("_estHandle")
    6572                      .dwattr $C$DW$658, DW_AT_data_member_location[DW_OP_plus_uconst 0x18]
    6573                      .dwattr $C$DW$658, DW_AT_accessibility(DW_ACCESS_public)
    6574              $C$DW$659       .dwtag  DW_TAG_member
    6575                      .dwattr $C$DW$659, DW_AT_type(*$C$DW$T$38)
    6576                      .dwattr $C$DW$659, DW_AT_name("parkHandle")
    6577                      .dwattr $C$DW$659, DW_AT_TI_symbol_name("_parkHandle")
    6578                      .dwattr $C$DW$659, DW_AT_data_member_location[DW_OP_plus_uconst 0x1a]
    6579                      .dwattr $C$DW$659, DW_AT_accessibility(DW_ACCESS_public)
    6580              $C$DW$660       .dwtag  DW_TAG_member
    6581                      .dwattr $C$DW$660, DW_AT_type(*$C$DW$T$39)
    6582                      .dwattr $C$DW$660, DW_AT_name("park")
    6583                      .dwattr $C$DW$660, DW_AT_TI_symbol_name("_park")
    6584                      .dwattr $C$DW$660, DW_AT_data_member_location[DW_OP_plus_uconst 0x1c]
    6585                      .dwattr $C$DW$660, DW_AT_accessibility(DW_ACCESS_public)
    6586              $C$DW$661       .dwtag  DW_TAG_member
    6587                      .dwattr $C$DW$661, DW_AT_type(*$C$DW$T$41)
    6588                      .dwattr $C$DW$661, DW_AT_name("pidHandle_Id")
    6589                      .dwattr $C$DW$661, DW_AT_TI_symbol_name("_pidHandle_Id")
    6590                      .dwattr $C$DW$661, DW_AT_data_member_location[DW_OP_plus_uconst 0x20]
    6591                      .dwattr $C$DW$661, DW_AT_accessibility(DW_ACCESS_public)
    6592              $C$DW$662       .dwtag  DW_TAG_member
    6593                      .dwattr $C$DW$662, DW_AT_type(*$C$DW$T$42)
    6594                      .dwattr $C$DW$662, DW_AT_name("pid_Id")
    6595                      .dwattr $C$DW$662, DW_AT_TI_symbol_name("_pid_Id")
    6596                      .dwattr $C$DW$662, DW_AT_data_member_location[DW_OP_plus_uconst 0x22]
    6597                      .dwattr $C$DW$662, DW_AT_accessibility(DW_ACCESS_public)
    6598              $C$DW$663       .dwtag  DW_TAG_member
    6599                      .dwattr $C$DW$663, DW_AT_type(*$C$DW$T$41)
    6600                      .dwattr $C$DW$663, DW_AT_name("pidHandle_Iq")
    6601                      .dwattr $C$DW$663, DW_AT_TI_symbol_name("_pidHandle_Iq")
    6602                      .dwattr $C$DW$663, DW_AT_data_member_location[DW_OP_plus_uconst 0x32]
    6603                      .dwattr $C$DW$663, DW_AT_accessibility(DW_ACCESS_public)
    6604              $C$DW$664       .dwtag  DW_TAG_member
    6605                      .dwattr $C$DW$664, DW_AT_type(*$C$DW$T$42)
    6606                      .dwattr $C$DW$664, DW_AT_name("pid_Iq")
    6607                      .dwattr $C$DW$664, DW_AT_TI_symbol_name("_pid_Iq")
TMS320C2000 Assembler PC v6.2.5 Tue Nov 21 21:02:56 2017

Tools Copyright (c) 1996-2014 Texas Instruments Incorporated
C:\Users\wmj\AppData\Local\Temp\0903213                              PAGE  134

    6608                      .dwattr $C$DW$664, DW_AT_data_member_location[DW_OP_plus_uconst 0x34]
    6609                      .dwattr $C$DW$664, DW_AT_accessibility(DW_ACCESS_public)
    6610              $C$DW$665       .dwtag  DW_TAG_member
    6611                      .dwattr $C$DW$665, DW_AT_type(*$C$DW$T$41)
    6612                      .dwattr $C$DW$665, DW_AT_name("pidHandle_spd")
    6613                      .dwattr $C$DW$665, DW_AT_TI_symbol_name("_pidHandle_spd")
    6614                      .dwattr $C$DW$665, DW_AT_data_member_location[DW_OP_plus_uconst 0x44]
    6615                      .dwattr $C$DW$665, DW_AT_accessibility(DW_ACCESS_public)
    6616              $C$DW$666       .dwtag  DW_TAG_member
    6617                      .dwattr $C$DW$666, DW_AT_type(*$C$DW$T$42)
    6618                      .dwattr $C$DW$666, DW_AT_name("pid_spd")
    6619                      .dwattr $C$DW$666, DW_AT_TI_symbol_name("_pid_spd")
    6620                      .dwattr $C$DW$666, DW_AT_data_member_location[DW_OP_plus_uconst 0x46]
    6621                      .dwattr $C$DW$666, DW_AT_accessibility(DW_ACCESS_public)
    6622              $C$DW$667       .dwtag  DW_TAG_member
    6623                      .dwattr $C$DW$667, DW_AT_type(*$C$DW$T$44)
    6624                      .dwattr $C$DW$667, DW_AT_name("iparkHandle")
    6625                      .dwattr $C$DW$667, DW_AT_TI_symbol_name("_iparkHandle")
    6626                      .dwattr $C$DW$667, DW_AT_data_member_location[DW_OP_plus_uconst 0x56]
    6627                      .dwattr $C$DW$667, DW_AT_accessibility(DW_ACCESS_public)
    6628              $C$DW$668       .dwtag  DW_TAG_member
    6629                      .dwattr $C$DW$668, DW_AT_type(*$C$DW$T$45)
    6630                      .dwattr $C$DW$668, DW_AT_name("ipark")
    6631                      .dwattr $C$DW$668, DW_AT_TI_symbol_name("_ipark")
    6632                      .dwattr $C$DW$668, DW_AT_data_member_location[DW_OP_plus_uconst 0x58]
    6633                      .dwattr $C$DW$668, DW_AT_accessibility(DW_ACCESS_public)
    6634              $C$DW$669       .dwtag  DW_TAG_member
    6635                      .dwattr $C$DW$669, DW_AT_type(*$C$DW$T$47)
    6636                      .dwattr $C$DW$669, DW_AT_name("svgenHandle")
    6637                      .dwattr $C$DW$669, DW_AT_TI_symbol_name("_svgenHandle")
    6638                      .dwattr $C$DW$669, DW_AT_data_member_location[DW_OP_plus_uconst 0x5c]
    6639                      .dwattr $C$DW$669, DW_AT_accessibility(DW_ACCESS_public)
    6640              $C$DW$670       .dwtag  DW_TAG_member
    6641                      .dwattr $C$DW$670, DW_AT_type(*$C$DW$T$48)
    6642                      .dwattr $C$DW$670, DW_AT_name("svgen")
    6643                      .dwattr $C$DW$670, DW_AT_TI_symbol_name("_svgen")
    6644                      .dwattr $C$DW$670, DW_AT_data_member_location[DW_OP_plus_uconst 0x5e]
    6645                      .dwattr $C$DW$670, DW_AT_accessibility(DW_ACCESS_public)
    6646              $C$DW$671       .dwtag  DW_TAG_member
    6647                      .dwattr $C$DW$671, DW_AT_type(*$C$DW$T$50)
    6648                      .dwattr $C$DW$671, DW_AT_name("trajHandle_Id")
    6649                      .dwattr $C$DW$671, DW_AT_TI_symbol_name("_trajHandle_Id")
    6650                      .dwattr $C$DW$671, DW_AT_data_member_location[DW_OP_plus_uconst 0x60]
    6651                      .dwattr $C$DW$671, DW_AT_accessibility(DW_ACCESS_public)
    6652              $C$DW$672       .dwtag  DW_TAG_member
    6653                      .dwattr $C$DW$672, DW_AT_type(*$C$DW$T$51)
    6654                      .dwattr $C$DW$672, DW_AT_name("traj_Id")
    6655                      .dwattr $C$DW$672, DW_AT_TI_symbol_name("_traj_Id")
    6656                      .dwattr $C$DW$672, DW_AT_data_member_location[DW_OP_plus_uconst 0x62]
    6657                      .dwattr $C$DW$672, DW_AT_accessibility(DW_ACCESS_public)
    6658              $C$DW$673       .dwtag  DW_TAG_member
    6659                      .dwattr $C$DW$673, DW_AT_type(*$C$DW$T$50)
    6660                      .dwattr $C$DW$673, DW_AT_name("trajHandle_spd")
    6661                      .dwattr $C$DW$673, DW_AT_TI_symbol_name("_trajHandle_spd")
    6662                      .dwattr $C$DW$673, DW_AT_data_member_location[DW_OP_plus_uconst 0x6c]
TMS320C2000 Assembler PC v6.2.5 Tue Nov 21 21:02:56 2017

Tools Copyright (c) 1996-2014 Texas Instruments Incorporated
C:\Users\wmj\AppData\Local\Temp\0903213                              PAGE  135

    6663                      .dwattr $C$DW$673, DW_AT_accessibility(DW_ACCESS_public)
    6664              $C$DW$674       .dwtag  DW_TAG_member
    6665                      .dwattr $C$DW$674, DW_AT_type(*$C$DW$T$51)
    6666                      .dwattr $C$DW$674, DW_AT_name("traj_spd")
    6667                      .dwattr $C$DW$674, DW_AT_TI_symbol_name("_traj_spd")
    6668                      .dwattr $C$DW$674, DW_AT_data_member_location[DW_OP_plus_uconst 0x6e]
    6669                      .dwattr $C$DW$674, DW_AT_accessibility(DW_ACCESS_public)
    6670              $C$DW$675       .dwtag  DW_TAG_member
    6671                      .dwattr $C$DW$675, DW_AT_type(*$C$DW$T$50)
    6672                      .dwattr $C$DW$675, DW_AT_name("trajHandle_spdMax")
    6673                      .dwattr $C$DW$675, DW_AT_TI_symbol_name("_trajHandle_spdMax")
    6674                      .dwattr $C$DW$675, DW_AT_data_member_location[DW_OP_plus_uconst 0x78]
    6675                      .dwattr $C$DW$675, DW_AT_accessibility(DW_ACCESS_public)
    6676              $C$DW$676       .dwtag  DW_TAG_member
    6677                      .dwattr $C$DW$676, DW_AT_type(*$C$DW$T$51)
    6678                      .dwattr $C$DW$676, DW_AT_name("traj_spdMax")
    6679                      .dwattr $C$DW$676, DW_AT_TI_symbol_name("_traj_spdMax")
    6680                      .dwattr $C$DW$676, DW_AT_data_member_location[DW_OP_plus_uconst 0x7a]
    6681                      .dwattr $C$DW$676, DW_AT_accessibility(DW_ACCESS_public)
    6682              $C$DW$677       .dwtag  DW_TAG_member
    6683                      .dwattr $C$DW$677, DW_AT_type(*$C$DW$T$52)
    6684                      .dwattr $C$DW$677, DW_AT_name("motorParams")
    6685                      .dwattr $C$DW$677, DW_AT_TI_symbol_name("_motorParams")
    6686                      .dwattr $C$DW$677, DW_AT_data_member_location[DW_OP_plus_uconst 0x84]
    6687                      .dwattr $C$DW$677, DW_AT_accessibility(DW_ACCESS_public)
    6688              $C$DW$678       .dwtag  DW_TAG_member
    6689                      .dwattr $C$DW$678, DW_AT_type(*$C$DW$T$55)
    6690                      .dwattr $C$DW$678, DW_AT_name("waitTimes")
    6691                      .dwattr $C$DW$678, DW_AT_TI_symbol_name("_waitTimes")
    6692                      .dwattr $C$DW$678, DW_AT_data_member_location[DW_OP_plus_uconst 0x92]
    6693                      .dwattr $C$DW$678, DW_AT_accessibility(DW_ACCESS_public)
    6694              $C$DW$679       .dwtag  DW_TAG_member
    6695                      .dwattr $C$DW$679, DW_AT_type(*$C$DW$T$54)
    6696                      .dwattr $C$DW$679, DW_AT_name("counter_state")
    6697                      .dwattr $C$DW$679, DW_AT_TI_symbol_name("_counter_state")
    6698                      .dwattr $C$DW$679, DW_AT_data_member_location[DW_OP_plus_uconst 0x9a]
    6699                      .dwattr $C$DW$679, DW_AT_accessibility(DW_ACCESS_public)
    6700              $C$DW$680       .dwtag  DW_TAG_member
    6701                      .dwattr $C$DW$680, DW_AT_type(*$C$DW$T$56)
    6702                      .dwattr $C$DW$680, DW_AT_name("numIsrTicksPerCtrlTick")
    6703                      .dwattr $C$DW$680, DW_AT_TI_symbol_name("_numIsrTicksPerCtrlTick")
    6704                      .dwattr $C$DW$680, DW_AT_data_member_location[DW_OP_plus_uconst 0x9c]
    6705                      .dwattr $C$DW$680, DW_AT_accessibility(DW_ACCESS_public)
    6706              $C$DW$681       .dwtag  DW_TAG_member
    6707                      .dwattr $C$DW$681, DW_AT_type(*$C$DW$T$56)
    6708                      .dwattr $C$DW$681, DW_AT_name("numCtrlTicksPerCurrentTick")
    6709                      .dwattr $C$DW$681, DW_AT_TI_symbol_name("_numCtrlTicksPerCurrentTick")
    6710                      .dwattr $C$DW$681, DW_AT_data_member_location[DW_OP_plus_uconst 0x9d]
    6711                      .dwattr $C$DW$681, DW_AT_accessibility(DW_ACCESS_public)
    6712              $C$DW$682       .dwtag  DW_TAG_member
    6713                      .dwattr $C$DW$682, DW_AT_type(*$C$DW$T$56)
    6714                      .dwattr $C$DW$682, DW_AT_name("numCtrlTicksPerSpeedTick")
    6715                      .dwattr $C$DW$682, DW_AT_TI_symbol_name("_numCtrlTicksPerSpeedTick")
    6716                      .dwattr $C$DW$682, DW_AT_data_member_location[DW_OP_plus_uconst 0x9e]
    6717                      .dwattr $C$DW$682, DW_AT_accessibility(DW_ACCESS_public)
TMS320C2000 Assembler PC v6.2.5 Tue Nov 21 21:02:56 2017

Tools Copyright (c) 1996-2014 Texas Instruments Incorporated
C:\Users\wmj\AppData\Local\Temp\0903213                              PAGE  136

    6718              $C$DW$683       .dwtag  DW_TAG_member
    6719                      .dwattr $C$DW$683, DW_AT_type(*$C$DW$T$56)
    6720                      .dwattr $C$DW$683, DW_AT_name("numCtrlTicksPerTrajTick")
    6721                      .dwattr $C$DW$683, DW_AT_TI_symbol_name("_numCtrlTicksPerTrajTick")
    6722                      .dwattr $C$DW$683, DW_AT_data_member_location[DW_OP_plus_uconst 0x9f]
    6723                      .dwattr $C$DW$683, DW_AT_accessibility(DW_ACCESS_public)
    6724              $C$DW$684       .dwtag  DW_TAG_member
    6725                      .dwattr $C$DW$684, DW_AT_type(*$C$DW$T$54)
    6726                      .dwattr $C$DW$684, DW_AT_name("ctrlFreq_Hz")
    6727                      .dwattr $C$DW$684, DW_AT_TI_symbol_name("_ctrlFreq_Hz")
    6728                      .dwattr $C$DW$684, DW_AT_data_member_location[DW_OP_plus_uconst 0xa0]
    6729                      .dwattr $C$DW$684, DW_AT_accessibility(DW_ACCESS_public)
    6730              $C$DW$685       .dwtag  DW_TAG_member
    6731                      .dwattr $C$DW$685, DW_AT_type(*$C$DW$T$54)
    6732                      .dwattr $C$DW$685, DW_AT_name("trajFreq_Hz")
    6733                      .dwattr $C$DW$685, DW_AT_TI_symbol_name("_trajFreq_Hz")
    6734                      .dwattr $C$DW$685, DW_AT_data_member_location[DW_OP_plus_uconst 0xa2]
    6735                      .dwattr $C$DW$685, DW_AT_accessibility(DW_ACCESS_public)
    6736              $C$DW$686       .dwtag  DW_TAG_member
    6737                      .dwattr $C$DW$686, DW_AT_type(*$C$DW$T$20)
    6738                      .dwattr $C$DW$686, DW_AT_name("trajPeriod_sec")
    6739                      .dwattr $C$DW$686, DW_AT_TI_symbol_name("_trajPeriod_sec")
    6740                      .dwattr $C$DW$686, DW_AT_data_member_location[DW_OP_plus_uconst 0xa4]
    6741                      .dwattr $C$DW$686, DW_AT_accessibility(DW_ACCESS_public)
    6742              $C$DW$687       .dwtag  DW_TAG_member
    6743                      .dwattr $C$DW$687, DW_AT_type(*$C$DW$T$57)
    6744                      .dwattr $C$DW$687, DW_AT_name("ctrlPeriod_sec")
    6745                      .dwattr $C$DW$687, DW_AT_TI_symbol_name("_ctrlPeriod_sec")
    6746                      .dwattr $C$DW$687, DW_AT_data_member_location[DW_OP_plus_uconst 0xa6]
    6747                      .dwattr $C$DW$687, DW_AT_accessibility(DW_ACCESS_public)
    6748              $C$DW$688       .dwtag  DW_TAG_member
    6749                      .dwattr $C$DW$688, DW_AT_type(*$C$DW$T$20)
    6750                      .dwattr $C$DW$688, DW_AT_name("maxVsMag_pu")
    6751                      .dwattr $C$DW$688, DW_AT_TI_symbol_name("_maxVsMag_pu")
    6752                      .dwattr $C$DW$688, DW_AT_data_member_location[DW_OP_plus_uconst 0xa8]
    6753                      .dwattr $C$DW$688, DW_AT_accessibility(DW_ACCESS_public)
    6754              $C$DW$689       .dwtag  DW_TAG_member
    6755                      .dwattr $C$DW$689, DW_AT_type(*$C$DW$T$21)
    6756                      .dwattr $C$DW$689, DW_AT_name("Iab_in")
    6757                      .dwattr $C$DW$689, DW_AT_TI_symbol_name("_Iab_in")
    6758                      .dwattr $C$DW$689, DW_AT_data_member_location[DW_OP_plus_uconst 0xaa]
    6759                      .dwattr $C$DW$689, DW_AT_accessibility(DW_ACCESS_public)
    6760              $C$DW$690       .dwtag  DW_TAG_member
    6761                      .dwattr $C$DW$690, DW_AT_type(*$C$DW$T$21)
    6762                      .dwattr $C$DW$690, DW_AT_name("Iab_filt")
    6763                      .dwattr $C$DW$690, DW_AT_TI_symbol_name("_Iab_filt")
    6764                      .dwattr $C$DW$690, DW_AT_data_member_location[DW_OP_plus_uconst 0xae]
    6765                      .dwattr $C$DW$690, DW_AT_accessibility(DW_ACCESS_public)
    6766              $C$DW$691       .dwtag  DW_TAG_member
    6767                      .dwattr $C$DW$691, DW_AT_type(*$C$DW$T$21)
    6768                      .dwattr $C$DW$691, DW_AT_name("Idq_in")
    6769                      .dwattr $C$DW$691, DW_AT_TI_symbol_name("_Idq_in")
    6770                      .dwattr $C$DW$691, DW_AT_data_member_location[DW_OP_plus_uconst 0xb2]
    6771                      .dwattr $C$DW$691, DW_AT_accessibility(DW_ACCESS_public)
    6772              $C$DW$692       .dwtag  DW_TAG_member
TMS320C2000 Assembler PC v6.2.5 Tue Nov 21 21:02:56 2017

Tools Copyright (c) 1996-2014 Texas Instruments Incorporated
C:\Users\wmj\AppData\Local\Temp\0903213                              PAGE  137

    6773                      .dwattr $C$DW$692, DW_AT_type(*$C$DW$T$21)
    6774                      .dwattr $C$DW$692, DW_AT_name("Vab_in")
    6775                      .dwattr $C$DW$692, DW_AT_TI_symbol_name("_Vab_in")
    6776                      .dwattr $C$DW$692, DW_AT_data_member_location[DW_OP_plus_uconst 0xb6]
    6777                      .dwattr $C$DW$692, DW_AT_accessibility(DW_ACCESS_public)
    6778              $C$DW$693       .dwtag  DW_TAG_member
    6779                      .dwattr $C$DW$693, DW_AT_type(*$C$DW$T$20)
    6780                      .dwattr $C$DW$693, DW_AT_name("spd_out")
    6781                      .dwattr $C$DW$693, DW_AT_TI_symbol_name("_spd_out")
    6782                      .dwattr $C$DW$693, DW_AT_data_member_location[DW_OP_plus_uconst 0xba]
    6783                      .dwattr $C$DW$693, DW_AT_accessibility(DW_ACCESS_public)
    6784              $C$DW$694       .dwtag  DW_TAG_member
    6785                      .dwattr $C$DW$694, DW_AT_type(*$C$DW$T$21)
    6786                      .dwattr $C$DW$694, DW_AT_name("Vab_out")
    6787                      .dwattr $C$DW$694, DW_AT_TI_symbol_name("_Vab_out")
    6788                      .dwattr $C$DW$694, DW_AT_data_member_location[DW_OP_plus_uconst 0xbc]
    6789                      .dwattr $C$DW$694, DW_AT_accessibility(DW_ACCESS_public)
    6790              $C$DW$695       .dwtag  DW_TAG_member
    6791                      .dwattr $C$DW$695, DW_AT_type(*$C$DW$T$21)
    6792                      .dwattr $C$DW$695, DW_AT_name("Vdq_out")
    6793                      .dwattr $C$DW$695, DW_AT_TI_symbol_name("_Vdq_out")
    6794                      .dwattr $C$DW$695, DW_AT_data_member_location[DW_OP_plus_uconst 0xc0]
    6795                      .dwattr $C$DW$695, DW_AT_accessibility(DW_ACCESS_public)
    6796              $C$DW$696       .dwtag  DW_TAG_member
    6797                      .dwattr $C$DW$696, DW_AT_type(*$C$DW$T$57)
    6798                      .dwattr $C$DW$696, DW_AT_name("Rhf")
    6799                      .dwattr $C$DW$696, DW_AT_TI_symbol_name("_Rhf")
    6800                      .dwattr $C$DW$696, DW_AT_data_member_location[DW_OP_plus_uconst 0xc4]
    6801                      .dwattr $C$DW$696, DW_AT_accessibility(DW_ACCESS_public)
    6802              $C$DW$697       .dwtag  DW_TAG_member
    6803                      .dwattr $C$DW$697, DW_AT_type(*$C$DW$T$57)
    6804                      .dwattr $C$DW$697, DW_AT_name("Lhf")
    6805                      .dwattr $C$DW$697, DW_AT_TI_symbol_name("_Lhf")
    6806                      .dwattr $C$DW$697, DW_AT_data_member_location[DW_OP_plus_uconst 0xc6]
    6807                      .dwattr $C$DW$697, DW_AT_accessibility(DW_ACCESS_public)
    6808              $C$DW$698       .dwtag  DW_TAG_member
    6809                      .dwattr $C$DW$698, DW_AT_type(*$C$DW$T$57)
    6810                      .dwattr $C$DW$698, DW_AT_name("RoverL")
    6811                      .dwattr $C$DW$698, DW_AT_TI_symbol_name("_RoverL")
    6812                      .dwattr $C$DW$698, DW_AT_data_member_location[DW_OP_plus_uconst 0xc8]
    6813                      .dwattr $C$DW$698, DW_AT_accessibility(DW_ACCESS_public)
    6814              $C$DW$699       .dwtag  DW_TAG_member
    6815                      .dwattr $C$DW$699, DW_AT_type(*$C$DW$T$20)
    6816                      .dwattr $C$DW$699, DW_AT_name("Kp_Id")
    6817                      .dwattr $C$DW$699, DW_AT_TI_symbol_name("_Kp_Id")
    6818                      .dwattr $C$DW$699, DW_AT_data_member_location[DW_OP_plus_uconst 0xca]
    6819                      .dwattr $C$DW$699, DW_AT_accessibility(DW_ACCESS_public)
    6820              $C$DW$700       .dwtag  DW_TAG_member
    6821                      .dwattr $C$DW$700, DW_AT_type(*$C$DW$T$20)
    6822                      .dwattr $C$DW$700, DW_AT_name("Kp_Iq")
    6823                      .dwattr $C$DW$700, DW_AT_TI_symbol_name("_Kp_Iq")
    6824                      .dwattr $C$DW$700, DW_AT_data_member_location[DW_OP_plus_uconst 0xcc]
    6825                      .dwattr $C$DW$700, DW_AT_accessibility(DW_ACCESS_public)
    6826              $C$DW$701       .dwtag  DW_TAG_member
    6827                      .dwattr $C$DW$701, DW_AT_type(*$C$DW$T$20)
TMS320C2000 Assembler PC v6.2.5 Tue Nov 21 21:02:56 2017

Tools Copyright (c) 1996-2014 Texas Instruments Incorporated
C:\Users\wmj\AppData\Local\Temp\0903213                              PAGE  138

    6828                      .dwattr $C$DW$701, DW_AT_name("Kp_spd")
    6829                      .dwattr $C$DW$701, DW_AT_TI_symbol_name("_Kp_spd")
    6830                      .dwattr $C$DW$701, DW_AT_data_member_location[DW_OP_plus_uconst 0xce]
    6831                      .dwattr $C$DW$701, DW_AT_accessibility(DW_ACCESS_public)
    6832              $C$DW$702       .dwtag  DW_TAG_member
    6833                      .dwattr $C$DW$702, DW_AT_type(*$C$DW$T$20)
    6834                      .dwattr $C$DW$702, DW_AT_name("Ki_Id")
    6835                      .dwattr $C$DW$702, DW_AT_TI_symbol_name("_Ki_Id")
    6836                      .dwattr $C$DW$702, DW_AT_data_member_location[DW_OP_plus_uconst 0xd0]
    6837                      .dwattr $C$DW$702, DW_AT_accessibility(DW_ACCESS_public)
    6838              $C$DW$703       .dwtag  DW_TAG_member
    6839                      .dwattr $C$DW$703, DW_AT_type(*$C$DW$T$20)
    6840                      .dwattr $C$DW$703, DW_AT_name("Ki_Iq")
    6841                      .dwattr $C$DW$703, DW_AT_TI_symbol_name("_Ki_Iq")
    6842                      .dwattr $C$DW$703, DW_AT_data_member_location[DW_OP_plus_uconst 0xd2]
    6843                      .dwattr $C$DW$703, DW_AT_accessibility(DW_ACCESS_public)
    6844              $C$DW$704       .dwtag  DW_TAG_member
    6845                      .dwattr $C$DW$704, DW_AT_type(*$C$DW$T$20)
    6846                      .dwattr $C$DW$704, DW_AT_name("Ki_spd")
    6847                      .dwattr $C$DW$704, DW_AT_TI_symbol_name("_Ki_spd")
    6848                      .dwattr $C$DW$704, DW_AT_data_member_location[DW_OP_plus_uconst 0xd4]
    6849                      .dwattr $C$DW$704, DW_AT_accessibility(DW_ACCESS_public)
    6850              $C$DW$705       .dwtag  DW_TAG_member
    6851                      .dwattr $C$DW$705, DW_AT_type(*$C$DW$T$20)
    6852                      .dwattr $C$DW$705, DW_AT_name("Kd_Id")
    6853                      .dwattr $C$DW$705, DW_AT_TI_symbol_name("_Kd_Id")
    6854                      .dwattr $C$DW$705, DW_AT_data_member_location[DW_OP_plus_uconst 0xd6]
    6855                      .dwattr $C$DW$705, DW_AT_accessibility(DW_ACCESS_public)
    6856              $C$DW$706       .dwtag  DW_TAG_member
    6857                      .dwattr $C$DW$706, DW_AT_type(*$C$DW$T$20)
    6858                      .dwattr $C$DW$706, DW_AT_name("Kd_Iq")
    6859                      .dwattr $C$DW$706, DW_AT_TI_symbol_name("_Kd_Iq")
    6860                      .dwattr $C$DW$706, DW_AT_data_member_location[DW_OP_plus_uconst 0xd8]
    6861                      .dwattr $C$DW$706, DW_AT_accessibility(DW_ACCESS_public)
    6862              $C$DW$707       .dwtag  DW_TAG_member
    6863                      .dwattr $C$DW$707, DW_AT_type(*$C$DW$T$20)
    6864                      .dwattr $C$DW$707, DW_AT_name("Kd_spd")
    6865                      .dwattr $C$DW$707, DW_AT_TI_symbol_name("_Kd_spd")
    6866                      .dwattr $C$DW$707, DW_AT_data_member_location[DW_OP_plus_uconst 0xda]
    6867                      .dwattr $C$DW$707, DW_AT_accessibility(DW_ACCESS_public)
    6868              $C$DW$708       .dwtag  DW_TAG_member
    6869                      .dwattr $C$DW$708, DW_AT_type(*$C$DW$T$20)
    6870                      .dwattr $C$DW$708, DW_AT_name("Ui_Id")
    6871                      .dwattr $C$DW$708, DW_AT_TI_symbol_name("_Ui_Id")
    6872                      .dwattr $C$DW$708, DW_AT_data_member_location[DW_OP_plus_uconst 0xdc]
    6873                      .dwattr $C$DW$708, DW_AT_accessibility(DW_ACCESS_public)
    6874              $C$DW$709       .dwtag  DW_TAG_member
    6875                      .dwattr $C$DW$709, DW_AT_type(*$C$DW$T$20)
    6876                      .dwattr $C$DW$709, DW_AT_name("Ui_Iq")
    6877                      .dwattr $C$DW$709, DW_AT_TI_symbol_name("_Ui_Iq")
    6878                      .dwattr $C$DW$709, DW_AT_data_member_location[DW_OP_plus_uconst 0xde]
    6879                      .dwattr $C$DW$709, DW_AT_accessibility(DW_ACCESS_public)
    6880              $C$DW$710       .dwtag  DW_TAG_member
    6881                      .dwattr $C$DW$710, DW_AT_type(*$C$DW$T$20)
    6882                      .dwattr $C$DW$710, DW_AT_name("Ui_spd")
TMS320C2000 Assembler PC v6.2.5 Tue Nov 21 21:02:56 2017

Tools Copyright (c) 1996-2014 Texas Instruments Incorporated
C:\Users\wmj\AppData\Local\Temp\0903213                              PAGE  139

    6883                      .dwattr $C$DW$710, DW_AT_TI_symbol_name("_Ui_spd")
    6884                      .dwattr $C$DW$710, DW_AT_data_member_location[DW_OP_plus_uconst 0xe0]
    6885                      .dwattr $C$DW$710, DW_AT_accessibility(DW_ACCESS_public)
    6886              $C$DW$711       .dwtag  DW_TAG_member
    6887                      .dwattr $C$DW$711, DW_AT_type(*$C$DW$T$21)
    6888                      .dwattr $C$DW$711, DW_AT_name("Idq_ref")
    6889                      .dwattr $C$DW$711, DW_AT_TI_symbol_name("_Idq_ref")
    6890                      .dwattr $C$DW$711, DW_AT_data_member_location[DW_OP_plus_uconst 0xe2]
    6891                      .dwattr $C$DW$711, DW_AT_accessibility(DW_ACCESS_public)
    6892              $C$DW$712       .dwtag  DW_TAG_member
    6893                      .dwattr $C$DW$712, DW_AT_type(*$C$DW$T$20)
    6894                      .dwattr $C$DW$712, DW_AT_name("IdRated")
    6895                      .dwattr $C$DW$712, DW_AT_TI_symbol_name("_IdRated")
    6896                      .dwattr $C$DW$712, DW_AT_data_member_location[DW_OP_plus_uconst 0xe6]
    6897                      .dwattr $C$DW$712, DW_AT_accessibility(DW_ACCESS_public)
    6898              $C$DW$713       .dwtag  DW_TAG_member
    6899                      .dwattr $C$DW$713, DW_AT_type(*$C$DW$T$20)
    6900                      .dwattr $C$DW$713, DW_AT_name("spd_ref")
    6901                      .dwattr $C$DW$713, DW_AT_TI_symbol_name("_spd_ref")
    6902                      .dwattr $C$DW$713, DW_AT_data_member_location[DW_OP_plus_uconst 0xe8]
    6903                      .dwattr $C$DW$713, DW_AT_accessibility(DW_ACCESS_public)
    6904              $C$DW$714       .dwtag  DW_TAG_member
    6905                      .dwattr $C$DW$714, DW_AT_type(*$C$DW$T$20)
    6906                      .dwattr $C$DW$714, DW_AT_name("spd_max")
    6907                      .dwattr $C$DW$714, DW_AT_TI_symbol_name("_spd_max")
    6908                      .dwattr $C$DW$714, DW_AT_data_member_location[DW_OP_plus_uconst 0xea]
    6909                      .dwattr $C$DW$714, DW_AT_accessibility(DW_ACCESS_public)
    6910              $C$DW$715       .dwtag  DW_TAG_member
    6911                      .dwattr $C$DW$715, DW_AT_type(*$C$DW$T$56)
    6912                      .dwattr $C$DW$715, DW_AT_name("counter_current")
    6913                      .dwattr $C$DW$715, DW_AT_TI_symbol_name("_counter_current")
    6914                      .dwattr $C$DW$715, DW_AT_data_member_location[DW_OP_plus_uconst 0xec]
    6915                      .dwattr $C$DW$715, DW_AT_accessibility(DW_ACCESS_public)
    6916              $C$DW$716       .dwtag  DW_TAG_member
    6917                      .dwattr $C$DW$716, DW_AT_type(*$C$DW$T$56)
    6918                      .dwattr $C$DW$716, DW_AT_name("counter_isr")
    6919                      .dwattr $C$DW$716, DW_AT_TI_symbol_name("_counter_isr")
    6920                      .dwattr $C$DW$716, DW_AT_data_member_location[DW_OP_plus_uconst 0xed]
    6921                      .dwattr $C$DW$716, DW_AT_accessibility(DW_ACCESS_public)
    6922              $C$DW$717       .dwtag  DW_TAG_member
    6923                      .dwattr $C$DW$717, DW_AT_type(*$C$DW$T$56)
    6924                      .dwattr $C$DW$717, DW_AT_name("counter_speed")
    6925                      .dwattr $C$DW$717, DW_AT_TI_symbol_name("_counter_speed")
    6926                      .dwattr $C$DW$717, DW_AT_data_member_location[DW_OP_plus_uconst 0xee]
    6927                      .dwattr $C$DW$717, DW_AT_accessibility(DW_ACCESS_public)
    6928              $C$DW$718       .dwtag  DW_TAG_member
    6929                      .dwattr $C$DW$718, DW_AT_type(*$C$DW$T$56)
    6930                      .dwattr $C$DW$718, DW_AT_name("counter_traj")
    6931                      .dwattr $C$DW$718, DW_AT_TI_symbol_name("_counter_traj")
    6932                      .dwattr $C$DW$718, DW_AT_data_member_location[DW_OP_plus_uconst 0xef]
    6933                      .dwattr $C$DW$718, DW_AT_accessibility(DW_ACCESS_public)
    6934              $C$DW$719       .dwtag  DW_TAG_member
    6935                      .dwattr $C$DW$719, DW_AT_type(*$C$DW$T$22)
    6936                      .dwattr $C$DW$719, DW_AT_name("flag_enableCtrl")
    6937                      .dwattr $C$DW$719, DW_AT_TI_symbol_name("_flag_enableCtrl")
TMS320C2000 Assembler PC v6.2.5 Tue Nov 21 21:02:56 2017

Tools Copyright (c) 1996-2014 Texas Instruments Incorporated
C:\Users\wmj\AppData\Local\Temp\0903213                              PAGE  140

    6938                      .dwattr $C$DW$719, DW_AT_data_member_location[DW_OP_plus_uconst 0xf0]
    6939                      .dwattr $C$DW$719, DW_AT_accessibility(DW_ACCESS_public)
    6940              $C$DW$720       .dwtag  DW_TAG_member
    6941                      .dwattr $C$DW$720, DW_AT_type(*$C$DW$T$22)
    6942                      .dwattr $C$DW$720, DW_AT_name("flag_enableDcBusComp")
    6943                      .dwattr $C$DW$720, DW_AT_TI_symbol_name("_flag_enableDcBusComp")
    6944                      .dwattr $C$DW$720, DW_AT_data_member_location[DW_OP_plus_uconst 0xf1]
    6945                      .dwattr $C$DW$720, DW_AT_accessibility(DW_ACCESS_public)
    6946              $C$DW$721       .dwtag  DW_TAG_member
    6947                      .dwattr $C$DW$721, DW_AT_type(*$C$DW$T$22)
    6948                      .dwattr $C$DW$721, DW_AT_name("flag_enablePowerWarp")
    6949                      .dwattr $C$DW$721, DW_AT_TI_symbol_name("_flag_enablePowerWarp")
    6950                      .dwattr $C$DW$721, DW_AT_data_member_location[DW_OP_plus_uconst 0xf2]
    6951                      .dwattr $C$DW$721, DW_AT_accessibility(DW_ACCESS_public)
    6952              $C$DW$722       .dwtag  DW_TAG_member
    6953                      .dwattr $C$DW$722, DW_AT_type(*$C$DW$T$22)
    6954                      .dwattr $C$DW$722, DW_AT_name("flag_enableOffset")
    6955                      .dwattr $C$DW$722, DW_AT_TI_symbol_name("_flag_enableOffset")
    6956                      .dwattr $C$DW$722, DW_AT_data_member_location[DW_OP_plus_uconst 0xf3]
    6957                      .dwattr $C$DW$722, DW_AT_accessibility(DW_ACCESS_public)
    6958              $C$DW$723       .dwtag  DW_TAG_member
    6959                      .dwattr $C$DW$723, DW_AT_type(*$C$DW$T$22)
    6960                      .dwattr $C$DW$723, DW_AT_name("flag_enableSpeedCtrl")
    6961                      .dwattr $C$DW$723, DW_AT_TI_symbol_name("_flag_enableSpeedCtrl")
    6962                      .dwattr $C$DW$723, DW_AT_data_member_location[DW_OP_plus_uconst 0xf4]
    6963                      .dwattr $C$DW$723, DW_AT_accessibility(DW_ACCESS_public)
    6964              $C$DW$724       .dwtag  DW_TAG_member
    6965                      .dwattr $C$DW$724, DW_AT_type(*$C$DW$T$22)
    6966                      .dwattr $C$DW$724, DW_AT_name("flag_enableUserMotorParams")
    6967                      .dwattr $C$DW$724, DW_AT_TI_symbol_name("_flag_enableUserMotorParams")
    6968                      .dwattr $C$DW$724, DW_AT_data_member_location[DW_OP_plus_uconst 0xf5]
    6969                      .dwattr $C$DW$724, DW_AT_accessibility(DW_ACCESS_public)
    6970              $C$DW$725       .dwtag  DW_TAG_member
    6971                      .dwattr $C$DW$725, DW_AT_type(*$C$DW$T$22)
    6972                      .dwattr $C$DW$725, DW_AT_name("flag_enableCurrentCtrl")
    6973                      .dwattr $C$DW$725, DW_AT_TI_symbol_name("_flag_enableCurrentCtrl")
    6974                      .dwattr $C$DW$725, DW_AT_data_member_location[DW_OP_plus_uconst 0xf6]
    6975                      .dwattr $C$DW$725, DW_AT_accessibility(DW_ACCESS_public)
    6976              $C$DW$726       .dwtag  DW_TAG_member
    6977                      .dwattr $C$DW$726, DW_AT_type(*$C$DW$T$20)
    6978                      .dwattr $C$DW$726, DW_AT_name("spd_outMaxRatio_pu")
    6979                      .dwattr $C$DW$726, DW_AT_TI_symbol_name("_spd_outMaxRatio_pu")
    6980                      .dwattr $C$DW$726, DW_AT_data_member_location[DW_OP_plus_uconst 0xf8]
    6981                      .dwattr $C$DW$726, DW_AT_accessibility(DW_ACCESS_public)
    6982              $C$DW$727       .dwtag  DW_TAG_member
    6983                      .dwattr $C$DW$727, DW_AT_type(*$C$DW$T$20)
    6984                      .dwattr $C$DW$727, DW_AT_name("enc_Angle")
    6985                      .dwattr $C$DW$727, DW_AT_TI_symbol_name("_enc_Angle")
    6986                      .dwattr $C$DW$727, DW_AT_data_member_location[DW_OP_plus_uconst 0xfa]
    6987                      .dwattr $C$DW$727, DW_AT_accessibility(DW_ACCESS_public)
    6988              $C$DW$728       .dwtag  DW_TAG_member
    6989                      .dwattr $C$DW$728, DW_AT_type(*$C$DW$T$22)
    6990                      .dwattr $C$DW$728, DW_AT_name("flag_enableEncAngle")
    6991                      .dwattr $C$DW$728, DW_AT_TI_symbol_name("_flag_enableEncAngle")
    6992                      .dwattr $C$DW$728, DW_AT_data_member_location[DW_OP_plus_uconst 0xfc]
TMS320C2000 Assembler PC v6.2.5 Tue Nov 21 21:02:56 2017

Tools Copyright (c) 1996-2014 Texas Instruments Incorporated
C:\Users\wmj\AppData\Local\Temp\0903213                              PAGE  141

    6993                      .dwattr $C$DW$728, DW_AT_accessibility(DW_ACCESS_public)
    6994              $C$DW$729       .dwtag  DW_TAG_member
    6995                      .dwattr $C$DW$729, DW_AT_type(*$C$DW$T$59)
    6996                      .dwattr $C$DW$729, DW_AT_name("brakeHandle")
    6997                      .dwattr $C$DW$729, DW_AT_TI_symbol_name("_brakeHandle")
    6998                      .dwattr $C$DW$729, DW_AT_data_member_location[DW_OP_plus_uconst 0xfe]
    6999                      .dwattr $C$DW$729, DW_AT_accessibility(DW_ACCESS_public)
    7000              $C$DW$730       .dwtag  DW_TAG_member
    7001                      .dwattr $C$DW$730, DW_AT_type(*$C$DW$T$60)
    7002                      .dwattr $C$DW$730, DW_AT_name("brake")
    7003                      .dwattr $C$DW$730, DW_AT_TI_symbol_name("_brake")
    7004                      .dwattr $C$DW$730, DW_AT_data_member_location[DW_OP_plus_uconst 0x100]
    7005                      .dwattr $C$DW$730, DW_AT_accessibility(DW_ACCESS_public)
    7006                      .dwendtag $C$DW$T$61
    7007              
    7008              $C$DW$T$91      .dwtag  DW_TAG_typedef, DW_AT_name("CTRL_Obj")
    7009                      .dwattr $C$DW$T$91, DW_AT_type(*$C$DW$T$61)
    7010                      .dwattr $C$DW$T$91, DW_AT_language(DW_LANG_C)
    7011              $C$DW$T$92      .dwtag  DW_TAG_pointer_type
    7012                      .dwattr $C$DW$T$92, DW_AT_type(*$C$DW$T$61)
    7013                      .dwattr $C$DW$T$92, DW_AT_address_class(0x16)
    7014              $C$DW$T$93      .dwtag  DW_TAG_typedef, DW_AT_name("CTRL_Handle")
    7015                      .dwattr $C$DW$T$93, DW_AT_type(*$C$DW$T$92)
    7016                      .dwattr $C$DW$T$93, DW_AT_language(DW_LANG_C)
    7017              $C$DW$731       .dwtag  DW_TAG_TI_far_type
    7018                      .dwattr $C$DW$731, DW_AT_type(*$C$DW$T$93)
    7019              $C$DW$T$94      .dwtag  DW_TAG_const_type
    7020                      .dwattr $C$DW$T$94, DW_AT_type(*$C$DW$731)
    7021              
    7022              $C$DW$T$64      .dwtag  DW_TAG_structure_type
    7023                      .dwattr $C$DW$T$64, DW_AT_name("_CTRL_Version_")
    7024                      .dwattr $C$DW$T$64, DW_AT_byte_size(0x04)
    7025              $C$DW$732       .dwtag  DW_TAG_member
    7026                      .dwattr $C$DW$732, DW_AT_type(*$C$DW$T$24)
    7027                      .dwattr $C$DW$732, DW_AT_name("rsvd")
    7028                      .dwattr $C$DW$732, DW_AT_TI_symbol_name("_rsvd")
    7029                      .dwattr $C$DW$732, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    7030                      .dwattr $C$DW$732, DW_AT_accessibility(DW_ACCESS_public)
    7031              $C$DW$733       .dwtag  DW_TAG_member
    7032                      .dwattr $C$DW$733, DW_AT_type(*$C$DW$T$63)
    7033                      .dwattr $C$DW$733, DW_AT_name("targetProc")
    7034                      .dwattr $C$DW$733, DW_AT_TI_symbol_name("_targetProc")
    7035                      .dwattr $C$DW$733, DW_AT_data_member_location[DW_OP_plus_uconst 0x1]
    7036                      .dwattr $C$DW$733, DW_AT_accessibility(DW_ACCESS_public)
    7037              $C$DW$734       .dwtag  DW_TAG_member
    7038                      .dwattr $C$DW$734, DW_AT_type(*$C$DW$T$24)
    7039                      .dwattr $C$DW$734, DW_AT_name("major")
    7040                      .dwattr $C$DW$734, DW_AT_TI_symbol_name("_major")
    7041                      .dwattr $C$DW$734, DW_AT_data_member_location[DW_OP_plus_uconst 0x2]
    7042                      .dwattr $C$DW$734, DW_AT_accessibility(DW_ACCESS_public)
    7043              $C$DW$735       .dwtag  DW_TAG_member
    7044                      .dwattr $C$DW$735, DW_AT_type(*$C$DW$T$24)
    7045                      .dwattr $C$DW$735, DW_AT_name("minor")
    7046                      .dwattr $C$DW$735, DW_AT_TI_symbol_name("_minor")
    7047                      .dwattr $C$DW$735, DW_AT_data_member_location[DW_OP_plus_uconst 0x3]
TMS320C2000 Assembler PC v6.2.5 Tue Nov 21 21:02:56 2017

Tools Copyright (c) 1996-2014 Texas Instruments Incorporated
C:\Users\wmj\AppData\Local\Temp\0903213                              PAGE  142

    7048                      .dwattr $C$DW$735, DW_AT_accessibility(DW_ACCESS_public)
    7049                      .dwendtag $C$DW$T$64
    7050              
    7051              $C$DW$T$27      .dwtag  DW_TAG_typedef, DW_AT_name("CTRL_Version")
    7052                      .dwattr $C$DW$T$27, DW_AT_type(*$C$DW$T$64)
    7053                      .dwattr $C$DW$T$27, DW_AT_language(DW_LANG_C)
    7054              
    7055              $C$DW$T$19      .dwtag  DW_TAG_structure_type
    7056                      .dwattr $C$DW$T$19, DW_AT_name("_EST_Obj_")
    7057                      .dwattr $C$DW$T$19, DW_AT_declaration
    7058                      .dwendtag $C$DW$T$19
    7059              
    7060              $C$DW$T$35      .dwtag  DW_TAG_pointer_type
    7061                      .dwattr $C$DW$T$35, DW_AT_type(*$C$DW$T$19)
    7062                      .dwattr $C$DW$T$35, DW_AT_address_class(0x16)
    7063              $C$DW$T$36      .dwtag  DW_TAG_typedef, DW_AT_name("EST_Handle")
    7064                      .dwattr $C$DW$T$36, DW_AT_type(*$C$DW$T$35)
    7065                      .dwattr $C$DW$T$36, DW_AT_language(DW_LANG_C)
    7066              
    7067              $C$DW$T$65      .dwtag  DW_TAG_structure_type
    7068                      .dwattr $C$DW$T$65, DW_AT_name("_IPARK_Obj_")
    7069                      .dwattr $C$DW$T$65, DW_AT_byte_size(0x04)
    7070              $C$DW$736       .dwtag  DW_TAG_member
    7071                      .dwattr $C$DW$736, DW_AT_type(*$C$DW$T$20)
    7072                      .dwattr $C$DW$736, DW_AT_name("sinTh")
    7073                      .dwattr $C$DW$736, DW_AT_TI_symbol_name("_sinTh")
    7074                      .dwattr $C$DW$736, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    7075                      .dwattr $C$DW$736, DW_AT_accessibility(DW_ACCESS_public)
    7076              $C$DW$737       .dwtag  DW_TAG_member
    7077                      .dwattr $C$DW$737, DW_AT_type(*$C$DW$T$20)
    7078                      .dwattr $C$DW$737, DW_AT_name("cosTh")
    7079                      .dwattr $C$DW$737, DW_AT_TI_symbol_name("_cosTh")
    7080                      .dwattr $C$DW$737, DW_AT_data_member_location[DW_OP_plus_uconst 0x2]
    7081                      .dwattr $C$DW$737, DW_AT_accessibility(DW_ACCESS_public)
    7082                      .dwendtag $C$DW$T$65
    7083              
    7084              $C$DW$T$45      .dwtag  DW_TAG_typedef, DW_AT_name("IPARK_Obj")
    7085                      .dwattr $C$DW$T$45, DW_AT_type(*$C$DW$T$65)
    7086                      .dwattr $C$DW$T$45, DW_AT_language(DW_LANG_C)
    7087              $C$DW$T$43      .dwtag  DW_TAG_pointer_type
    7088                      .dwattr $C$DW$T$43, DW_AT_type(*$C$DW$T$65)
    7089                      .dwattr $C$DW$T$43, DW_AT_address_class(0x16)
    7090              $C$DW$T$44      .dwtag  DW_TAG_typedef, DW_AT_name("IPARK_Handle")
    7091                      .dwattr $C$DW$T$44, DW_AT_type(*$C$DW$T$43)
    7092                      .dwattr $C$DW$T$44, DW_AT_language(DW_LANG_C)
    7093              
    7094              $C$DW$T$67      .dwtag  DW_TAG_structure_type
    7095                      .dwattr $C$DW$T$67, DW_AT_name("_MATH_vec2_")
    7096                      .dwattr $C$DW$T$67, DW_AT_byte_size(0x04)
    7097              $C$DW$738       .dwtag  DW_TAG_member
    7098                      .dwattr $C$DW$738, DW_AT_type(*$C$DW$T$66)
    7099                      .dwattr $C$DW$738, DW_AT_name("value")
    7100                      .dwattr $C$DW$738, DW_AT_TI_symbol_name("_value")
    7101                      .dwattr $C$DW$738, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    7102                      .dwattr $C$DW$738, DW_AT_accessibility(DW_ACCESS_public)
TMS320C2000 Assembler PC v6.2.5 Tue Nov 21 21:02:56 2017

Tools Copyright (c) 1996-2014 Texas Instruments Incorporated
C:\Users\wmj\AppData\Local\Temp\0903213                              PAGE  143

    7103                      .dwendtag $C$DW$T$67
    7104              
    7105              $C$DW$T$21      .dwtag  DW_TAG_typedef, DW_AT_name("MATH_vec2")
    7106                      .dwattr $C$DW$T$21, DW_AT_type(*$C$DW$T$67)
    7107                      .dwattr $C$DW$T$21, DW_AT_language(DW_LANG_C)
    7108              
    7109              $C$DW$T$70      .dwtag  DW_TAG_structure_type
    7110                      .dwattr $C$DW$T$70, DW_AT_name("_MOTOR_Params_")
    7111                      .dwattr $C$DW$T$70, DW_AT_byte_size(0x0e)
    7112              $C$DW$739       .dwtag  DW_TAG_member
    7113                      .dwattr $C$DW$739, DW_AT_type(*$C$DW$T$69)
    7114                      .dwattr $C$DW$739, DW_AT_name("type")
    7115                      .dwattr $C$DW$739, DW_AT_TI_symbol_name("_type")
    7116                      .dwattr $C$DW$739, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    7117                      .dwattr $C$DW$739, DW_AT_accessibility(DW_ACCESS_public)
    7118              $C$DW$740       .dwtag  DW_TAG_member
    7119                      .dwattr $C$DW$740, DW_AT_type(*$C$DW$T$56)
    7120                      .dwattr $C$DW$740, DW_AT_name("numPolePairs")
    7121                      .dwattr $C$DW$740, DW_AT_TI_symbol_name("_numPolePairs")
    7122                      .dwattr $C$DW$740, DW_AT_data_member_location[DW_OP_plus_uconst 0x1]
    7123                      .dwattr $C$DW$740, DW_AT_accessibility(DW_ACCESS_public)
    7124              $C$DW$741       .dwtag  DW_TAG_member
    7125                      .dwattr $C$DW$741, DW_AT_type(*$C$DW$T$57)
    7126                      .dwattr $C$DW$741, DW_AT_name("Lr_H")
    7127                      .dwattr $C$DW$741, DW_AT_TI_symbol_name("_Lr_H")
    7128                      .dwattr $C$DW$741, DW_AT_data_member_location[DW_OP_plus_uconst 0x2]
    7129                      .dwattr $C$DW$741, DW_AT_accessibility(DW_ACCESS_public)
    7130              $C$DW$742       .dwtag  DW_TAG_member
    7131                      .dwattr $C$DW$742, DW_AT_type(*$C$DW$T$57)
    7132                      .dwattr $C$DW$742, DW_AT_name("Ls_d_H")
    7133                      .dwattr $C$DW$742, DW_AT_TI_symbol_name("_Ls_d_H")
    7134                      .dwattr $C$DW$742, DW_AT_data_member_location[DW_OP_plus_uconst 0x4]
    7135                      .dwattr $C$DW$742, DW_AT_accessibility(DW_ACCESS_public)
    7136              $C$DW$743       .dwtag  DW_TAG_member
    7137                      .dwattr $C$DW$743, DW_AT_type(*$C$DW$T$57)
    7138                      .dwattr $C$DW$743, DW_AT_name("Ls_q_H")
    7139                      .dwattr $C$DW$743, DW_AT_TI_symbol_name("_Ls_q_H")
    7140                      .dwattr $C$DW$743, DW_AT_data_member_location[DW_OP_plus_uconst 0x6]
    7141                      .dwattr $C$DW$743, DW_AT_accessibility(DW_ACCESS_public)
    7142              $C$DW$744       .dwtag  DW_TAG_member
    7143                      .dwattr $C$DW$744, DW_AT_type(*$C$DW$T$57)
    7144                      .dwattr $C$DW$744, DW_AT_name("Rr_Ohm")
    7145                      .dwattr $C$DW$744, DW_AT_TI_symbol_name("_Rr_Ohm")
    7146                      .dwattr $C$DW$744, DW_AT_data_member_location[DW_OP_plus_uconst 0x8]
    7147                      .dwattr $C$DW$744, DW_AT_accessibility(DW_ACCESS_public)
    7148              $C$DW$745       .dwtag  DW_TAG_member
    7149                      .dwattr $C$DW$745, DW_AT_type(*$C$DW$T$57)
    7150                      .dwattr $C$DW$745, DW_AT_name("Rs_Ohm")
    7151                      .dwattr $C$DW$745, DW_AT_TI_symbol_name("_Rs_Ohm")
    7152                      .dwattr $C$DW$745, DW_AT_data_member_location[DW_OP_plus_uconst 0xa]
    7153                      .dwattr $C$DW$745, DW_AT_accessibility(DW_ACCESS_public)
    7154              $C$DW$746       .dwtag  DW_TAG_member
    7155                      .dwattr $C$DW$746, DW_AT_type(*$C$DW$T$57)
    7156                      .dwattr $C$DW$746, DW_AT_name("ratedFlux_VpHz")
    7157                      .dwattr $C$DW$746, DW_AT_TI_symbol_name("_ratedFlux_VpHz")
TMS320C2000 Assembler PC v6.2.5 Tue Nov 21 21:02:56 2017

Tools Copyright (c) 1996-2014 Texas Instruments Incorporated
C:\Users\wmj\AppData\Local\Temp\0903213                              PAGE  144

    7158                      .dwattr $C$DW$746, DW_AT_data_member_location[DW_OP_plus_uconst 0xc]
    7159                      .dwattr $C$DW$746, DW_AT_accessibility(DW_ACCESS_public)
    7160                      .dwendtag $C$DW$T$70
    7161              
    7162              $C$DW$T$52      .dwtag  DW_TAG_typedef, DW_AT_name("MOTOR_Params")
    7163                      .dwattr $C$DW$T$52, DW_AT_type(*$C$DW$T$70)
    7164                      .dwattr $C$DW$T$52, DW_AT_language(DW_LANG_C)
    7165              
    7166              $C$DW$T$71      .dwtag  DW_TAG_structure_type
    7167                      .dwattr $C$DW$T$71, DW_AT_name("_PARK_Obj_")
    7168                      .dwattr $C$DW$T$71, DW_AT_byte_size(0x04)
    7169              $C$DW$747       .dwtag  DW_TAG_member
    7170                      .dwattr $C$DW$747, DW_AT_type(*$C$DW$T$20)
    7171                      .dwattr $C$DW$747, DW_AT_name("sinTh")
    7172                      .dwattr $C$DW$747, DW_AT_TI_symbol_name("_sinTh")
    7173                      .dwattr $C$DW$747, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    7174                      .dwattr $C$DW$747, DW_AT_accessibility(DW_ACCESS_public)
    7175              $C$DW$748       .dwtag  DW_TAG_member
    7176                      .dwattr $C$DW$748, DW_AT_type(*$C$DW$T$20)
    7177                      .dwattr $C$DW$748, DW_AT_name("cosTh")
    7178                      .dwattr $C$DW$748, DW_AT_TI_symbol_name("_cosTh")
    7179                      .dwattr $C$DW$748, DW_AT_data_member_location[DW_OP_plus_uconst 0x2]
    7180                      .dwattr $C$DW$748, DW_AT_accessibility(DW_ACCESS_public)
    7181                      .dwendtag $C$DW$T$71
    7182              
    7183              $C$DW$T$39      .dwtag  DW_TAG_typedef, DW_AT_name("PARK_Obj")
    7184                      .dwattr $C$DW$T$39, DW_AT_type(*$C$DW$T$71)
    7185                      .dwattr $C$DW$T$39, DW_AT_language(DW_LANG_C)
    7186              $C$DW$T$37      .dwtag  DW_TAG_pointer_type
    7187                      .dwattr $C$DW$T$37, DW_AT_type(*$C$DW$T$71)
    7188                      .dwattr $C$DW$T$37, DW_AT_address_class(0x16)
    7189              $C$DW$T$38      .dwtag  DW_TAG_typedef, DW_AT_name("PARK_Handle")
    7190                      .dwattr $C$DW$T$38, DW_AT_type(*$C$DW$T$37)
    7191                      .dwattr $C$DW$T$38, DW_AT_language(DW_LANG_C)
    7192              
    7193              $C$DW$T$72      .dwtag  DW_TAG_structure_type
    7194                      .dwattr $C$DW$T$72, DW_AT_name("_PID_Obj_")
    7195                      .dwattr $C$DW$T$72, DW_AT_byte_size(0x10)
    7196              $C$DW$749       .dwtag  DW_TAG_member
    7197                      .dwattr $C$DW$749, DW_AT_type(*$C$DW$T$20)
    7198                      .dwattr $C$DW$749, DW_AT_name("Kp")
    7199                      .dwattr $C$DW$749, DW_AT_TI_symbol_name("_Kp")
    7200                      .dwattr $C$DW$749, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    7201                      .dwattr $C$DW$749, DW_AT_accessibility(DW_ACCESS_public)
    7202              $C$DW$750       .dwtag  DW_TAG_member
    7203                      .dwattr $C$DW$750, DW_AT_type(*$C$DW$T$20)
    7204                      .dwattr $C$DW$750, DW_AT_name("Ki")
    7205                      .dwattr $C$DW$750, DW_AT_TI_symbol_name("_Ki")
    7206                      .dwattr $C$DW$750, DW_AT_data_member_location[DW_OP_plus_uconst 0x2]
    7207                      .dwattr $C$DW$750, DW_AT_accessibility(DW_ACCESS_public)
    7208              $C$DW$751       .dwtag  DW_TAG_member
    7209                      .dwattr $C$DW$751, DW_AT_type(*$C$DW$T$20)
    7210                      .dwattr $C$DW$751, DW_AT_name("Kd")
    7211                      .dwattr $C$DW$751, DW_AT_TI_symbol_name("_Kd")
    7212                      .dwattr $C$DW$751, DW_AT_data_member_location[DW_OP_plus_uconst 0x4]
TMS320C2000 Assembler PC v6.2.5 Tue Nov 21 21:02:56 2017

Tools Copyright (c) 1996-2014 Texas Instruments Incorporated
C:\Users\wmj\AppData\Local\Temp\0903213                              PAGE  145

    7213                      .dwattr $C$DW$751, DW_AT_accessibility(DW_ACCESS_public)
    7214              $C$DW$752       .dwtag  DW_TAG_member
    7215                      .dwattr $C$DW$752, DW_AT_type(*$C$DW$T$20)
    7216                      .dwattr $C$DW$752, DW_AT_name("Ui")
    7217                      .dwattr $C$DW$752, DW_AT_TI_symbol_name("_Ui")
    7218                      .dwattr $C$DW$752, DW_AT_data_member_location[DW_OP_plus_uconst 0x6]
    7219                      .dwattr $C$DW$752, DW_AT_accessibility(DW_ACCESS_public)
    7220              $C$DW$753       .dwtag  DW_TAG_member
    7221                      .dwattr $C$DW$753, DW_AT_type(*$C$DW$T$20)
    7222                      .dwattr $C$DW$753, DW_AT_name("refValue")
    7223                      .dwattr $C$DW$753, DW_AT_TI_symbol_name("_refValue")
    7224                      .dwattr $C$DW$753, DW_AT_data_member_location[DW_OP_plus_uconst 0x8]
    7225                      .dwattr $C$DW$753, DW_AT_accessibility(DW_ACCESS_public)
    7226              $C$DW$754       .dwtag  DW_TAG_member
    7227                      .dwattr $C$DW$754, DW_AT_type(*$C$DW$T$20)
    7228                      .dwattr $C$DW$754, DW_AT_name("fbackValue")
    7229                      .dwattr $C$DW$754, DW_AT_TI_symbol_name("_fbackValue")
    7230                      .dwattr $C$DW$754, DW_AT_data_member_location[DW_OP_plus_uconst 0xa]
    7231                      .dwattr $C$DW$754, DW_AT_accessibility(DW_ACCESS_public)
    7232              $C$DW$755       .dwtag  DW_TAG_member
    7233                      .dwattr $C$DW$755, DW_AT_type(*$C$DW$T$20)
    7234                      .dwattr $C$DW$755, DW_AT_name("outMin")
    7235                      .dwattr $C$DW$755, DW_AT_TI_symbol_name("_outMin")
    7236                      .dwattr $C$DW$755, DW_AT_data_member_location[DW_OP_plus_uconst 0xc]
    7237                      .dwattr $C$DW$755, DW_AT_accessibility(DW_ACCESS_public)
    7238              $C$DW$756       .dwtag  DW_TAG_member
    7239                      .dwattr $C$DW$756, DW_AT_type(*$C$DW$T$20)
    7240                      .dwattr $C$DW$756, DW_AT_name("outMax")
    7241                      .dwattr $C$DW$756, DW_AT_TI_symbol_name("_outMax")
    7242                      .dwattr $C$DW$756, DW_AT_data_member_location[DW_OP_plus_uconst 0xe]
    7243                      .dwattr $C$DW$756, DW_AT_accessibility(DW_ACCESS_public)
    7244                      .dwendtag $C$DW$T$72
    7245              
    7246              $C$DW$T$42      .dwtag  DW_TAG_typedef, DW_AT_name("PID_Obj")
    7247                      .dwattr $C$DW$T$42, DW_AT_type(*$C$DW$T$72)
    7248                      .dwattr $C$DW$T$42, DW_AT_language(DW_LANG_C)
    7249              $C$DW$T$40      .dwtag  DW_TAG_pointer_type
    7250                      .dwattr $C$DW$T$40, DW_AT_type(*$C$DW$T$72)
    7251                      .dwattr $C$DW$T$40, DW_AT_address_class(0x16)
    7252              $C$DW$T$41      .dwtag  DW_TAG_typedef, DW_AT_name("PID_Handle")
    7253                      .dwattr $C$DW$T$41, DW_AT_type(*$C$DW$T$40)
    7254                      .dwattr $C$DW$T$41, DW_AT_language(DW_LANG_C)
    7255              
    7256              $C$DW$T$73      .dwtag  DW_TAG_structure_type
    7257                      .dwattr $C$DW$T$73, DW_AT_name("_SVGEN_Obj_")
    7258                      .dwattr $C$DW$T$73, DW_AT_byte_size(0x02)
    7259              $C$DW$757       .dwtag  DW_TAG_member
    7260                      .dwattr $C$DW$757, DW_AT_type(*$C$DW$T$20)
    7261                      .dwattr $C$DW$757, DW_AT_name("maxModulation")
    7262                      .dwattr $C$DW$757, DW_AT_TI_symbol_name("_maxModulation")
    7263                      .dwattr $C$DW$757, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    7264                      .dwattr $C$DW$757, DW_AT_accessibility(DW_ACCESS_public)
    7265                      .dwendtag $C$DW$T$73
    7266              
    7267              $C$DW$T$48      .dwtag  DW_TAG_typedef, DW_AT_name("SVGEN_Obj")
TMS320C2000 Assembler PC v6.2.5 Tue Nov 21 21:02:56 2017

Tools Copyright (c) 1996-2014 Texas Instruments Incorporated
C:\Users\wmj\AppData\Local\Temp\0903213                              PAGE  146

    7268                      .dwattr $C$DW$T$48, DW_AT_type(*$C$DW$T$73)
    7269                      .dwattr $C$DW$T$48, DW_AT_language(DW_LANG_C)
    7270              $C$DW$T$46      .dwtag  DW_TAG_pointer_type
    7271                      .dwattr $C$DW$T$46, DW_AT_type(*$C$DW$T$73)
    7272                      .dwattr $C$DW$T$46, DW_AT_address_class(0x16)
    7273              $C$DW$T$47      .dwtag  DW_TAG_typedef, DW_AT_name("SVGEN_Handle")
    7274                      .dwattr $C$DW$T$47, DW_AT_type(*$C$DW$T$46)
    7275                      .dwattr $C$DW$T$47, DW_AT_language(DW_LANG_C)
    7276              
    7277              $C$DW$T$74      .dwtag  DW_TAG_structure_type
    7278                      .dwattr $C$DW$T$74, DW_AT_name("_TRAJ_Obj_")
    7279                      .dwattr $C$DW$T$74, DW_AT_byte_size(0x0a)
    7280              $C$DW$758       .dwtag  DW_TAG_member
    7281                      .dwattr $C$DW$758, DW_AT_type(*$C$DW$T$20)
    7282                      .dwattr $C$DW$758, DW_AT_name("targetValue")
    7283                      .dwattr $C$DW$758, DW_AT_TI_symbol_name("_targetValue")
    7284                      .dwattr $C$DW$758, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    7285                      .dwattr $C$DW$758, DW_AT_accessibility(DW_ACCESS_public)
    7286              $C$DW$759       .dwtag  DW_TAG_member
    7287                      .dwattr $C$DW$759, DW_AT_type(*$C$DW$T$20)
    7288                      .dwattr $C$DW$759, DW_AT_name("intValue")
    7289                      .dwattr $C$DW$759, DW_AT_TI_symbol_name("_intValue")
    7290                      .dwattr $C$DW$759, DW_AT_data_member_location[DW_OP_plus_uconst 0x2]
    7291                      .dwattr $C$DW$759, DW_AT_accessibility(DW_ACCESS_public)
    7292              $C$DW$760       .dwtag  DW_TAG_member
    7293                      .dwattr $C$DW$760, DW_AT_type(*$C$DW$T$20)
    7294                      .dwattr $C$DW$760, DW_AT_name("minValue")
    7295                      .dwattr $C$DW$760, DW_AT_TI_symbol_name("_minValue")
    7296                      .dwattr $C$DW$760, DW_AT_data_member_location[DW_OP_plus_uconst 0x4]
    7297                      .dwattr $C$DW$760, DW_AT_accessibility(DW_ACCESS_public)
    7298              $C$DW$761       .dwtag  DW_TAG_member
    7299                      .dwattr $C$DW$761, DW_AT_type(*$C$DW$T$20)
    7300                      .dwattr $C$DW$761, DW_AT_name("maxValue")
    7301                      .dwattr $C$DW$761, DW_AT_TI_symbol_name("_maxValue")
    7302                      .dwattr $C$DW$761, DW_AT_data_member_location[DW_OP_plus_uconst 0x6]
    7303                      .dwattr $C$DW$761, DW_AT_accessibility(DW_ACCESS_public)
    7304              $C$DW$762       .dwtag  DW_TAG_member
    7305                      .dwattr $C$DW$762, DW_AT_type(*$C$DW$T$20)
    7306                      .dwattr $C$DW$762, DW_AT_name("maxDelta")
    7307                      .dwattr $C$DW$762, DW_AT_TI_symbol_name("_maxDelta")
    7308                      .dwattr $C$DW$762, DW_AT_data_member_location[DW_OP_plus_uconst 0x8]
    7309                      .dwattr $C$DW$762, DW_AT_accessibility(DW_ACCESS_public)
    7310                      .dwendtag $C$DW$T$74
    7311              
    7312              $C$DW$T$51      .dwtag  DW_TAG_typedef, DW_AT_name("TRAJ_Obj")
    7313                      .dwattr $C$DW$T$51, DW_AT_type(*$C$DW$T$74)
    7314                      .dwattr $C$DW$T$51, DW_AT_language(DW_LANG_C)
    7315              $C$DW$T$49      .dwtag  DW_TAG_pointer_type
    7316                      .dwattr $C$DW$T$49, DW_AT_type(*$C$DW$T$74)
    7317                      .dwattr $C$DW$T$49, DW_AT_address_class(0x16)
    7318              $C$DW$T$50      .dwtag  DW_TAG_typedef, DW_AT_name("TRAJ_Handle")
    7319                      .dwattr $C$DW$T$50, DW_AT_type(*$C$DW$T$49)
    7320                      .dwattr $C$DW$T$50, DW_AT_language(DW_LANG_C)
    7321              
    7322              $C$DW$T$80      .dwtag  DW_TAG_structure_type
TMS320C2000 Assembler PC v6.2.5 Tue Nov 21 21:02:56 2017

Tools Copyright (c) 1996-2014 Texas Instruments Incorporated
C:\Users\wmj\AppData\Local\Temp\0903213                              PAGE  147

    7323                      .dwattr $C$DW$T$80, DW_AT_name("_USER_Params_")
    7324                      .dwattr $C$DW$T$80, DW_AT_byte_size(0xac)
    7325              $C$DW$763       .dwtag  DW_TAG_member
    7326                      .dwattr $C$DW$763, DW_AT_type(*$C$DW$T$57)
    7327                      .dwattr $C$DW$763, DW_AT_name("iqFullScaleCurrent_A")
    7328                      .dwattr $C$DW$763, DW_AT_TI_symbol_name("_iqFullScaleCurrent_A")
    7329                      .dwattr $C$DW$763, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    7330                      .dwattr $C$DW$763, DW_AT_accessibility(DW_ACCESS_public)
    7331              $C$DW$764       .dwtag  DW_TAG_member
    7332                      .dwattr $C$DW$764, DW_AT_type(*$C$DW$T$57)
    7333                      .dwattr $C$DW$764, DW_AT_name("iqFullScaleVoltage_V")
    7334                      .dwattr $C$DW$764, DW_AT_TI_symbol_name("_iqFullScaleVoltage_V")
    7335                      .dwattr $C$DW$764, DW_AT_data_member_location[DW_OP_plus_uconst 0x2]
    7336                      .dwattr $C$DW$764, DW_AT_accessibility(DW_ACCESS_public)
    7337              $C$DW$765       .dwtag  DW_TAG_member
    7338                      .dwattr $C$DW$765, DW_AT_type(*$C$DW$T$57)
    7339                      .dwattr $C$DW$765, DW_AT_name("iqFullScaleFreq_Hz")
    7340                      .dwattr $C$DW$765, DW_AT_TI_symbol_name("_iqFullScaleFreq_Hz")
    7341                      .dwattr $C$DW$765, DW_AT_data_member_location[DW_OP_plus_uconst 0x4]
    7342                      .dwattr $C$DW$765, DW_AT_accessibility(DW_ACCESS_public)
    7343              $C$DW$766       .dwtag  DW_TAG_member
    7344                      .dwattr $C$DW$766, DW_AT_type(*$C$DW$T$56)
    7345                      .dwattr $C$DW$766, DW_AT_name("numIsrTicksPerCtrlTick")
    7346                      .dwattr $C$DW$766, DW_AT_TI_symbol_name("_numIsrTicksPerCtrlTick")
    7347                      .dwattr $C$DW$766, DW_AT_data_member_location[DW_OP_plus_uconst 0x6]
    7348                      .dwattr $C$DW$766, DW_AT_accessibility(DW_ACCESS_public)
    7349              $C$DW$767       .dwtag  DW_TAG_member
    7350                      .dwattr $C$DW$767, DW_AT_type(*$C$DW$T$56)
    7351                      .dwattr $C$DW$767, DW_AT_name("numCtrlTicksPerCurrentTick")
    7352                      .dwattr $C$DW$767, DW_AT_TI_symbol_name("_numCtrlTicksPerCurrentTick")
    7353                      .dwattr $C$DW$767, DW_AT_data_member_location[DW_OP_plus_uconst 0x7]
    7354                      .dwattr $C$DW$767, DW_AT_accessibility(DW_ACCESS_public)
    7355              $C$DW$768       .dwtag  DW_TAG_member
    7356                      .dwattr $C$DW$768, DW_AT_type(*$C$DW$T$56)
    7357                      .dwattr $C$DW$768, DW_AT_name("numCtrlTicksPerEstTick")
    7358                      .dwattr $C$DW$768, DW_AT_TI_symbol_name("_numCtrlTicksPerEstTick")
    7359                      .dwattr $C$DW$768, DW_AT_data_member_location[DW_OP_plus_uconst 0x8]
    7360                      .dwattr $C$DW$768, DW_AT_accessibility(DW_ACCESS_public)
    7361              $C$DW$769       .dwtag  DW_TAG_member
    7362                      .dwattr $C$DW$769, DW_AT_type(*$C$DW$T$56)
    7363                      .dwattr $C$DW$769, DW_AT_name("numCtrlTicksPerSpeedTick")
    7364                      .dwattr $C$DW$769, DW_AT_TI_symbol_name("_numCtrlTicksPerSpeedTick")
    7365                      .dwattr $C$DW$769, DW_AT_data_member_location[DW_OP_plus_uconst 0x9]
    7366                      .dwattr $C$DW$769, DW_AT_accessibility(DW_ACCESS_public)
    7367              $C$DW$770       .dwtag  DW_TAG_member
    7368                      .dwattr $C$DW$770, DW_AT_type(*$C$DW$T$56)
    7369                      .dwattr $C$DW$770, DW_AT_name("numCtrlTicksPerTrajTick")
    7370                      .dwattr $C$DW$770, DW_AT_TI_symbol_name("_numCtrlTicksPerTrajTick")
    7371                      .dwattr $C$DW$770, DW_AT_data_member_location[DW_OP_plus_uconst 0xa]
    7372                      .dwattr $C$DW$770, DW_AT_accessibility(DW_ACCESS_public)
    7373              $C$DW$771       .dwtag  DW_TAG_member
    7374                      .dwattr $C$DW$771, DW_AT_type(*$C$DW$T$25)
    7375                      .dwattr $C$DW$771, DW_AT_name("numCurrentSensors")
    7376                      .dwattr $C$DW$771, DW_AT_TI_symbol_name("_numCurrentSensors")
    7377                      .dwattr $C$DW$771, DW_AT_data_member_location[DW_OP_plus_uconst 0xb]
TMS320C2000 Assembler PC v6.2.5 Tue Nov 21 21:02:56 2017

Tools Copyright (c) 1996-2014 Texas Instruments Incorporated
C:\Users\wmj\AppData\Local\Temp\0903213                              PAGE  148

    7378                      .dwattr $C$DW$771, DW_AT_accessibility(DW_ACCESS_public)
    7379              $C$DW$772       .dwtag  DW_TAG_member
    7380                      .dwattr $C$DW$772, DW_AT_type(*$C$DW$T$25)
    7381                      .dwattr $C$DW$772, DW_AT_name("numVoltageSensors")
    7382                      .dwattr $C$DW$772, DW_AT_TI_symbol_name("_numVoltageSensors")
    7383                      .dwattr $C$DW$772, DW_AT_data_member_location[DW_OP_plus_uconst 0xc]
    7384                      .dwattr $C$DW$772, DW_AT_accessibility(DW_ACCESS_public)
    7385              $C$DW$773       .dwtag  DW_TAG_member
    7386                      .dwattr $C$DW$773, DW_AT_type(*$C$DW$T$57)
    7387                      .dwattr $C$DW$773, DW_AT_name("offsetPole_rps")
    7388                      .dwattr $C$DW$773, DW_AT_TI_symbol_name("_offsetPole_rps")
    7389                      .dwattr $C$DW$773, DW_AT_data_member_location[DW_OP_plus_uconst 0xe]
    7390                      .dwattr $C$DW$773, DW_AT_accessibility(DW_ACCESS_public)
    7391              $C$DW$774       .dwtag  DW_TAG_member
    7392                      .dwattr $C$DW$774, DW_AT_type(*$C$DW$T$57)
    7393                      .dwattr $C$DW$774, DW_AT_name("fluxPole_rps")
    7394                      .dwattr $C$DW$774, DW_AT_TI_symbol_name("_fluxPole_rps")
    7395                      .dwattr $C$DW$774, DW_AT_data_member_location[DW_OP_plus_uconst 0x10]
    7396                      .dwattr $C$DW$774, DW_AT_accessibility(DW_ACCESS_public)
    7397              $C$DW$775       .dwtag  DW_TAG_member
    7398                      .dwattr $C$DW$775, DW_AT_type(*$C$DW$T$57)
    7399                      .dwattr $C$DW$775, DW_AT_name("zeroSpeedLimit")
    7400                      .dwattr $C$DW$775, DW_AT_TI_symbol_name("_zeroSpeedLimit")
    7401                      .dwattr $C$DW$775, DW_AT_data_member_location[DW_OP_plus_uconst 0x12]
    7402                      .dwattr $C$DW$775, DW_AT_accessibility(DW_ACCESS_public)
    7403              $C$DW$776       .dwtag  DW_TAG_member
    7404                      .dwattr $C$DW$776, DW_AT_type(*$C$DW$T$57)
    7405                      .dwattr $C$DW$776, DW_AT_name("forceAngleFreq_Hz")
    7406                      .dwattr $C$DW$776, DW_AT_TI_symbol_name("_forceAngleFreq_Hz")
    7407                      .dwattr $C$DW$776, DW_AT_data_member_location[DW_OP_plus_uconst 0x14]
    7408                      .dwattr $C$DW$776, DW_AT_accessibility(DW_ACCESS_public)
    7409              $C$DW$777       .dwtag  DW_TAG_member
    7410                      .dwattr $C$DW$777, DW_AT_type(*$C$DW$T$57)
    7411                      .dwattr $C$DW$777, DW_AT_name("maxAccel_Hzps")
    7412                      .dwattr $C$DW$777, DW_AT_TI_symbol_name("_maxAccel_Hzps")
    7413                      .dwattr $C$DW$777, DW_AT_data_member_location[DW_OP_plus_uconst 0x16]
    7414                      .dwattr $C$DW$777, DW_AT_accessibility(DW_ACCESS_public)
    7415              $C$DW$778       .dwtag  DW_TAG_member
    7416                      .dwattr $C$DW$778, DW_AT_type(*$C$DW$T$57)
    7417                      .dwattr $C$DW$778, DW_AT_name("maxAccel_est_Hzps")
    7418                      .dwattr $C$DW$778, DW_AT_TI_symbol_name("_maxAccel_est_Hzps")
    7419                      .dwattr $C$DW$778, DW_AT_data_member_location[DW_OP_plus_uconst 0x18]
    7420                      .dwattr $C$DW$778, DW_AT_accessibility(DW_ACCESS_public)
    7421              $C$DW$779       .dwtag  DW_TAG_member
    7422                      .dwattr $C$DW$779, DW_AT_type(*$C$DW$T$57)
    7423                      .dwattr $C$DW$779, DW_AT_name("directionPole_rps")
    7424                      .dwattr $C$DW$779, DW_AT_TI_symbol_name("_directionPole_rps")
    7425                      .dwattr $C$DW$779, DW_AT_data_member_location[DW_OP_plus_uconst 0x1a]
    7426                      .dwattr $C$DW$779, DW_AT_accessibility(DW_ACCESS_public)
    7427              $C$DW$780       .dwtag  DW_TAG_member
    7428                      .dwattr $C$DW$780, DW_AT_type(*$C$DW$T$57)
    7429                      .dwattr $C$DW$780, DW_AT_name("speedPole_rps")
    7430                      .dwattr $C$DW$780, DW_AT_TI_symbol_name("_speedPole_rps")
    7431                      .dwattr $C$DW$780, DW_AT_data_member_location[DW_OP_plus_uconst 0x1c]
    7432                      .dwattr $C$DW$780, DW_AT_accessibility(DW_ACCESS_public)
TMS320C2000 Assembler PC v6.2.5 Tue Nov 21 21:02:56 2017

Tools Copyright (c) 1996-2014 Texas Instruments Incorporated
C:\Users\wmj\AppData\Local\Temp\0903213                              PAGE  149

    7433              $C$DW$781       .dwtag  DW_TAG_member
    7434                      .dwattr $C$DW$781, DW_AT_type(*$C$DW$T$57)
    7435                      .dwattr $C$DW$781, DW_AT_name("dcBusPole_rps")
    7436                      .dwattr $C$DW$781, DW_AT_TI_symbol_name("_dcBusPole_rps")
    7437                      .dwattr $C$DW$781, DW_AT_data_member_location[DW_OP_plus_uconst 0x1e]
    7438                      .dwattr $C$DW$781, DW_AT_accessibility(DW_ACCESS_public)
    7439              $C$DW$782       .dwtag  DW_TAG_member
    7440                      .dwattr $C$DW$782, DW_AT_type(*$C$DW$T$57)
    7441                      .dwattr $C$DW$782, DW_AT_name("fluxFraction")
    7442                      .dwattr $C$DW$782, DW_AT_TI_symbol_name("_fluxFraction")
    7443                      .dwattr $C$DW$782, DW_AT_data_member_location[DW_OP_plus_uconst 0x20]
    7444                      .dwattr $C$DW$782, DW_AT_accessibility(DW_ACCESS_public)
    7445              $C$DW$783       .dwtag  DW_TAG_member
    7446                      .dwattr $C$DW$783, DW_AT_type(*$C$DW$T$57)
    7447                      .dwattr $C$DW$783, DW_AT_name("indEst_speedMaxFraction")
    7448                      .dwattr $C$DW$783, DW_AT_TI_symbol_name("_indEst_speedMaxFraction")
    7449                      .dwattr $C$DW$783, DW_AT_data_member_location[DW_OP_plus_uconst 0x22]
    7450                      .dwattr $C$DW$783, DW_AT_accessibility(DW_ACCESS_public)
    7451              $C$DW$784       .dwtag  DW_TAG_member
    7452                      .dwattr $C$DW$784, DW_AT_type(*$C$DW$T$57)
    7453                      .dwattr $C$DW$784, DW_AT_name("powerWarpGain")
    7454                      .dwattr $C$DW$784, DW_AT_TI_symbol_name("_powerWarpGain")
    7455                      .dwattr $C$DW$784, DW_AT_data_member_location[DW_OP_plus_uconst 0x24]
    7456                      .dwattr $C$DW$784, DW_AT_accessibility(DW_ACCESS_public)
    7457              $C$DW$785       .dwtag  DW_TAG_member
    7458                      .dwattr $C$DW$785, DW_AT_type(*$C$DW$T$56)
    7459                      .dwattr $C$DW$785, DW_AT_name("systemFreq_MHz")
    7460                      .dwattr $C$DW$785, DW_AT_TI_symbol_name("_systemFreq_MHz")
    7461                      .dwattr $C$DW$785, DW_AT_data_member_location[DW_OP_plus_uconst 0x26]
    7462                      .dwattr $C$DW$785, DW_AT_accessibility(DW_ACCESS_public)
    7463              $C$DW$786       .dwtag  DW_TAG_member
    7464                      .dwattr $C$DW$786, DW_AT_type(*$C$DW$T$57)
    7465                      .dwattr $C$DW$786, DW_AT_name("pwmPeriod_usec")
    7466                      .dwattr $C$DW$786, DW_AT_TI_symbol_name("_pwmPeriod_usec")
    7467                      .dwattr $C$DW$786, DW_AT_data_member_location[DW_OP_plus_uconst 0x28]
    7468                      .dwattr $C$DW$786, DW_AT_accessibility(DW_ACCESS_public)
    7469              $C$DW$787       .dwtag  DW_TAG_member
    7470                      .dwattr $C$DW$787, DW_AT_type(*$C$DW$T$57)
    7471                      .dwattr $C$DW$787, DW_AT_name("voltage_sf")
    7472                      .dwattr $C$DW$787, DW_AT_TI_symbol_name("_voltage_sf")
    7473                      .dwattr $C$DW$787, DW_AT_data_member_location[DW_OP_plus_uconst 0x2a]
    7474                      .dwattr $C$DW$787, DW_AT_accessibility(DW_ACCESS_public)
    7475              $C$DW$788       .dwtag  DW_TAG_member
    7476                      .dwattr $C$DW$788, DW_AT_type(*$C$DW$T$57)
    7477                      .dwattr $C$DW$788, DW_AT_name("current_sf")
    7478                      .dwattr $C$DW$788, DW_AT_TI_symbol_name("_current_sf")
    7479                      .dwattr $C$DW$788, DW_AT_data_member_location[DW_OP_plus_uconst 0x2c]
    7480                      .dwattr $C$DW$788, DW_AT_accessibility(DW_ACCESS_public)
    7481              $C$DW$789       .dwtag  DW_TAG_member
    7482                      .dwattr $C$DW$789, DW_AT_type(*$C$DW$T$57)
    7483                      .dwattr $C$DW$789, DW_AT_name("voltageFilterPole_rps")
    7484                      .dwattr $C$DW$789, DW_AT_TI_symbol_name("_voltageFilterPole_rps")
    7485                      .dwattr $C$DW$789, DW_AT_data_member_location[DW_OP_plus_uconst 0x2e]
    7486                      .dwattr $C$DW$789, DW_AT_accessibility(DW_ACCESS_public)
    7487              $C$DW$790       .dwtag  DW_TAG_member
TMS320C2000 Assembler PC v6.2.5 Tue Nov 21 21:02:56 2017

Tools Copyright (c) 1996-2014 Texas Instruments Incorporated
C:\Users\wmj\AppData\Local\Temp\0903213                              PAGE  150

    7488                      .dwattr $C$DW$790, DW_AT_type(*$C$DW$T$57)
    7489                      .dwattr $C$DW$790, DW_AT_name("maxVsMag_pu")
    7490                      .dwattr $C$DW$790, DW_AT_TI_symbol_name("_maxVsMag_pu")
    7491                      .dwattr $C$DW$790, DW_AT_data_member_location[DW_OP_plus_uconst 0x30]
    7492                      .dwattr $C$DW$790, DW_AT_accessibility(DW_ACCESS_public)
    7493              $C$DW$791       .dwtag  DW_TAG_member
    7494                      .dwattr $C$DW$791, DW_AT_type(*$C$DW$T$57)
    7495                      .dwattr $C$DW$791, DW_AT_name("estKappa")
    7496                      .dwattr $C$DW$791, DW_AT_TI_symbol_name("_estKappa")
    7497                      .dwattr $C$DW$791, DW_AT_data_member_location[DW_OP_plus_uconst 0x32]
    7498                      .dwattr $C$DW$791, DW_AT_accessibility(DW_ACCESS_public)
    7499              $C$DW$792       .dwtag  DW_TAG_member
    7500                      .dwattr $C$DW$792, DW_AT_type(*$C$DW$T$69)
    7501                      .dwattr $C$DW$792, DW_AT_name("motor_type")
    7502                      .dwattr $C$DW$792, DW_AT_TI_symbol_name("_motor_type")
    7503                      .dwattr $C$DW$792, DW_AT_data_member_location[DW_OP_plus_uconst 0x34]
    7504                      .dwattr $C$DW$792, DW_AT_accessibility(DW_ACCESS_public)
    7505              $C$DW$793       .dwtag  DW_TAG_member
    7506                      .dwattr $C$DW$793, DW_AT_type(*$C$DW$T$56)
    7507                      .dwattr $C$DW$793, DW_AT_name("motor_numPolePairs")
    7508                      .dwattr $C$DW$793, DW_AT_TI_symbol_name("_motor_numPolePairs")
    7509                      .dwattr $C$DW$793, DW_AT_data_member_location[DW_OP_plus_uconst 0x35]
    7510                      .dwattr $C$DW$793, DW_AT_accessibility(DW_ACCESS_public)
    7511              $C$DW$794       .dwtag  DW_TAG_member
    7512                      .dwattr $C$DW$794, DW_AT_type(*$C$DW$T$57)
    7513                      .dwattr $C$DW$794, DW_AT_name("motor_ratedFlux")
    7514                      .dwattr $C$DW$794, DW_AT_TI_symbol_name("_motor_ratedFlux")
    7515                      .dwattr $C$DW$794, DW_AT_data_member_location[DW_OP_plus_uconst 0x36]
    7516                      .dwattr $C$DW$794, DW_AT_accessibility(DW_ACCESS_public)
    7517              $C$DW$795       .dwtag  DW_TAG_member
    7518                      .dwattr $C$DW$795, DW_AT_type(*$C$DW$T$57)
    7519                      .dwattr $C$DW$795, DW_AT_name("motor_Rr")
    7520                      .dwattr $C$DW$795, DW_AT_TI_symbol_name("_motor_Rr")
    7521                      .dwattr $C$DW$795, DW_AT_data_member_location[DW_OP_plus_uconst 0x38]
    7522                      .dwattr $C$DW$795, DW_AT_accessibility(DW_ACCESS_public)
    7523              $C$DW$796       .dwtag  DW_TAG_member
    7524                      .dwattr $C$DW$796, DW_AT_type(*$C$DW$T$57)
    7525                      .dwattr $C$DW$796, DW_AT_name("motor_Rs")
    7526                      .dwattr $C$DW$796, DW_AT_TI_symbol_name("_motor_Rs")
    7527                      .dwattr $C$DW$796, DW_AT_data_member_location[DW_OP_plus_uconst 0x3a]
    7528                      .dwattr $C$DW$796, DW_AT_accessibility(DW_ACCESS_public)
    7529              $C$DW$797       .dwtag  DW_TAG_member
    7530                      .dwattr $C$DW$797, DW_AT_type(*$C$DW$T$57)
    7531                      .dwattr $C$DW$797, DW_AT_name("motor_Ls_d")
    7532                      .dwattr $C$DW$797, DW_AT_TI_symbol_name("_motor_Ls_d")
    7533                      .dwattr $C$DW$797, DW_AT_data_member_location[DW_OP_plus_uconst 0x3c]
    7534                      .dwattr $C$DW$797, DW_AT_accessibility(DW_ACCESS_public)
    7535              $C$DW$798       .dwtag  DW_TAG_member
    7536                      .dwattr $C$DW$798, DW_AT_type(*$C$DW$T$57)
    7537                      .dwattr $C$DW$798, DW_AT_name("motor_Ls_q")
    7538                      .dwattr $C$DW$798, DW_AT_TI_symbol_name("_motor_Ls_q")
    7539                      .dwattr $C$DW$798, DW_AT_data_member_location[DW_OP_plus_uconst 0x3e]
    7540                      .dwattr $C$DW$798, DW_AT_accessibility(DW_ACCESS_public)
    7541              $C$DW$799       .dwtag  DW_TAG_member
    7542                      .dwattr $C$DW$799, DW_AT_type(*$C$DW$T$57)
TMS320C2000 Assembler PC v6.2.5 Tue Nov 21 21:02:56 2017

Tools Copyright (c) 1996-2014 Texas Instruments Incorporated
C:\Users\wmj\AppData\Local\Temp\0903213                              PAGE  151

    7543                      .dwattr $C$DW$799, DW_AT_name("maxCurrent")
    7544                      .dwattr $C$DW$799, DW_AT_TI_symbol_name("_maxCurrent")
    7545                      .dwattr $C$DW$799, DW_AT_data_member_location[DW_OP_plus_uconst 0x40]
    7546                      .dwattr $C$DW$799, DW_AT_accessibility(DW_ACCESS_public)
    7547              $C$DW$800       .dwtag  DW_TAG_member
    7548                      .dwattr $C$DW$800, DW_AT_type(*$C$DW$T$57)
    7549                      .dwattr $C$DW$800, DW_AT_name("maxCurrent_resEst")
    7550                      .dwattr $C$DW$800, DW_AT_TI_symbol_name("_maxCurrent_resEst")
    7551                      .dwattr $C$DW$800, DW_AT_data_member_location[DW_OP_plus_uconst 0x42]
    7552                      .dwattr $C$DW$800, DW_AT_accessibility(DW_ACCESS_public)
    7553              $C$DW$801       .dwtag  DW_TAG_member
    7554                      .dwattr $C$DW$801, DW_AT_type(*$C$DW$T$57)
    7555                      .dwattr $C$DW$801, DW_AT_name("maxCurrent_indEst")
    7556                      .dwattr $C$DW$801, DW_AT_TI_symbol_name("_maxCurrent_indEst")
    7557                      .dwattr $C$DW$801, DW_AT_data_member_location[DW_OP_plus_uconst 0x44]
    7558                      .dwattr $C$DW$801, DW_AT_accessibility(DW_ACCESS_public)
    7559              $C$DW$802       .dwtag  DW_TAG_member
    7560                      .dwattr $C$DW$802, DW_AT_type(*$C$DW$T$57)
    7561                      .dwattr $C$DW$802, DW_AT_name("maxCurrentSlope")
    7562                      .dwattr $C$DW$802, DW_AT_TI_symbol_name("_maxCurrentSlope")
    7563                      .dwattr $C$DW$802, DW_AT_data_member_location[DW_OP_plus_uconst 0x46]
    7564                      .dwattr $C$DW$802, DW_AT_accessibility(DW_ACCESS_public)
    7565              $C$DW$803       .dwtag  DW_TAG_member
    7566                      .dwattr $C$DW$803, DW_AT_type(*$C$DW$T$57)
    7567                      .dwattr $C$DW$803, DW_AT_name("maxCurrentSlope_powerWarp")
    7568                      .dwattr $C$DW$803, DW_AT_TI_symbol_name("_maxCurrentSlope_powerWarp")
    7569                      .dwattr $C$DW$803, DW_AT_data_member_location[DW_OP_plus_uconst 0x48]
    7570                      .dwattr $C$DW$803, DW_AT_accessibility(DW_ACCESS_public)
    7571              $C$DW$804       .dwtag  DW_TAG_member
    7572                      .dwattr $C$DW$804, DW_AT_type(*$C$DW$T$57)
    7573                      .dwattr $C$DW$804, DW_AT_name("IdRated")
    7574                      .dwattr $C$DW$804, DW_AT_TI_symbol_name("_IdRated")
    7575                      .dwattr $C$DW$804, DW_AT_data_member_location[DW_OP_plus_uconst 0x4a]
