TMS320C2000 Assembler PC v6.2.5 Thu Nov 23 20:51:05 2017

Tools Copyright (c) 1996-2014 Texas Instruments Incorporated
C:\Users\wmj\AppData\Local\Temp\0880813                              PAGE    1

       1              ;***************************************************************
       2              ;* TMS320C2000 C/C++ Codegen                         PC v6.2.5 *
       3              ;* Date/Time created: Thu Nov 23 20:51:04 2017                 *
       4              ;***************************************************************
       5                      .compiler_opts --float_support=softlib --hll_source=on --mem_model:code=flat --mem_model:data=large -
       6        0002  FP      .set    XAR2
       7              
       8              $C$DW$CU        .dwtag  DW_TAG_compile_unit
       9                      .dwattr $C$DW$CU, DW_AT_name("D:/BM1000_v1.1/sw/modules/user/src/32b/user.c")
      10                      .dwattr $C$DW$CU, DW_AT_producer("TMS320C2000 C/C++ Codegen PC v6.2.5 Copyright (c) 1996-2014 Texas I
      11                      .dwattr $C$DW$CU, DW_AT_TI_version(0x01)
      12                      .dwattr $C$DW$CU, DW_AT_comp_dir("D:\BM1000_v1.1\sw\solutions\instaspin_foc\boards\hvkit_rev1p1\f28x\
      13                      .global _BOARD_Params
      14 00000000               .sect   ".econst:_BOARD_Params"
      15                      .clink
      16                      .align  2

    4665              $C$DW$398       .dwtag  DW_TAG_enumerator, DW_AT_name("USER_ErrorCode_motor_Ls_q_High"), DW_AT_const_value(0x
    4666              $C$DW$399       .dwtag  DW_TAG_enumerator, DW_AT_name("USER_ErrorCode_motor_Ls_q_Low"), DW_AT_const_value(0x4
    4667              $C$DW$400       .dwtag  DW_TAG_enumerator, DW_AT_name("USER_ErrorCode_maxCurrent_High"), DW_AT_const_value(0x
    4668              $C$DW$401       .dwtag  DW_TAG_enumerator, DW_AT_name("USER_ErrorCode_maxCurrent_Low"), DW_AT_const_value(0x4
    4669              $C$DW$402       .dwtag  DW_TAG_enumerator, DW_AT_name("USER_ErrorCode_maxCurrent_resEst_High"), DW_AT_const_v
    4670              $C$DW$403       .dwtag  DW_TAG_enumerator, DW_AT_name("USER_ErrorCode_maxCurrent_resEst_Low"), DW_AT_const_va
    4671              $C$DW$404       .dwtag  DW_TAG_enumerator, DW_AT_name("USER_ErrorCode_maxCurrent_indEst_High"), DW_AT_const_v
    4672              $C$DW$405       .dwtag  DW_TAG_enumerator, DW_AT_name("USER_ErrorCode_maxCurrent_indEst_Low"), DW_AT_const_va
    4673              $C$DW$406       .dwtag  DW_TAG_enumerator, DW_AT_name("USER_ErrorCode_maxCurrentSlope_High"), DW_AT_const_val
    4674              $C$DW$407       .dwtag  DW_TAG_enumerator, DW_AT_name("USER_ErrorCode_maxCurrentSlope_Low"), DW_AT_const_valu
    4675              $C$DW$408       .dwtag  DW_TAG_enumerator, DW_AT_name("USER_ErrorCode_maxCurrentSlope_powerWarp_High"), DW_AT
    4676              $C$DW$409       .dwtag  DW_TAG_enumerator, DW_AT_name("USER_ErrorCode_maxCurrentSlope_powerWarp_Low"), DW_AT_
    4677              $C$DW$410       .dwtag  DW_TAG_enumerator, DW_AT_name("USER_ErrorCode_IdRated_High"), DW_AT_const_value(0x54)
    4678              $C$DW$411       .dwtag  DW_TAG_enumerator, DW_AT_name("USER_ErrorCode_IdRated_Low"), DW_AT_const_value(0x55)
    4679              $C$DW$412       .dwtag  DW_TAG_enumerator, DW_AT_name("USER_ErrorCode_IdRatedFraction_indEst_High"), DW_AT_co
    4680              $C$DW$413       .dwtag  DW_TAG_enumerator, DW_AT_name("USER_ErrorCode_IdRatedFraction_indEst_Low"), DW_AT_con
    4681              $C$DW$414       .dwtag  DW_TAG_enumerator, DW_AT_name("USER_ErrorCode_IdRatedFraction_ratedFlux_High"), DW_AT
    4682              $C$DW$415       .dwtag  DW_TAG_enumerator, DW_AT_name("USER_ErrorCode_IdRatedFraction_ratedFlux_Low"), DW_AT_
    4683              $C$DW$416       .dwtag  DW_TAG_enumerator, DW_AT_name("USER_ErrorCode_IdRated_delta_High"), DW_AT_const_value
    4684              $C$DW$417       .dwtag  DW_TAG_enumerator, DW_AT_name("USER_ErrorCode_IdRated_delta_Low"), DW_AT_const_value(
TMS320C2000 Assembler PC v6.2.5 Thu Nov 23 20:51:05 2017

Tools Copyright (c) 1996-2014 Texas Instruments Incorporated
C:\Users\wmj\AppData\Local\Temp\0880813                              PAGE   97

    4685              $C$DW$418       .dwtag  DW_TAG_enumerator, DW_AT_name("USER_ErrorCode_fluxEstFreq_Hz_High"), DW_AT_const_valu
    4686              $C$DW$419       .dwtag  DW_TAG_enumerator, DW_AT_name("USER_ErrorCode_fluxEstFreq_Hz_Low"), DW_AT_const_value
    4687              $C$DW$420       .dwtag  DW_TAG_enumerator, DW_AT_name("USER_ErrorCode_ctrlFreq_Hz_High"), DW_AT_const_value(0
    4688              $C$DW$421       .dwtag  DW_TAG_enumerator, DW_AT_name("USER_ErrorCode_ctrlFreq_Hz_Low"), DW_AT_const_value(0x
    4689              $C$DW$422       .dwtag  DW_TAG_enumerator, DW_AT_name("USER_ErrorCode_estFreq_Hz_High"), DW_AT_const_value(0x
    4690              $C$DW$423       .dwtag  DW_TAG_enumerator, DW_AT_name("USER_ErrorCode_estFreq_Hz_Low"), DW_AT_const_value(0x6
    4691              $C$DW$424       .dwtag  DW_TAG_enumerator, DW_AT_name("USER_ErrorCode_RoverL_estFreq_Hz_High"), DW_AT_const_v
    4692              $C$DW$425       .dwtag  DW_TAG_enumerator, DW_AT_name("USER_ErrorCode_RoverL_estFreq_Hz_Low"), DW_AT_const_va
    4693              $C$DW$426       .dwtag  DW_TAG_enumerator, DW_AT_name("USER_ErrorCode_trajFreq_Hz_High"), DW_AT_const_value(0
    4694              $C$DW$427       .dwtag  DW_TAG_enumerator, DW_AT_name("USER_ErrorCode_trajFreq_Hz_Low"), DW_AT_const_value(0x
    4695              $C$DW$428       .dwtag  DW_TAG_enumerator, DW_AT_name("USER_ErrorCode_ctrlPeriod_sec_High"), DW_AT_const_valu
    4696              $C$DW$429       .dwtag  DW_TAG_enumerator, DW_AT_name("USER_ErrorCode_ctrlPeriod_sec_Low"), DW_AT_const_value
    4697              $C$DW$430       .dwtag  DW_TAG_enumerator, DW_AT_name("USER_ErrorCode_maxNegativeIdCurrent_a_High"), DW_AT_co
    4698              $C$DW$431       .dwtag  DW_TAG_enumerator, DW_AT_name("USER_ErrorCode_maxNegativeIdCurrent_a_Low"), DW_AT_con
    4699              $C$DW$432       .dwtag  DW_TAG_enumerator, DW_AT_name("USER_numErrorCodes"), DW_AT_const_value(0x6a)
    4700                      .dwendtag $C$DW$T$31
    4701              
    4702              $C$DW$T$32      .dwtag  DW_TAG_typedef, DW_AT_name("USER_ErrorCode_e")
    4703                      .dwattr $C$DW$T$32, DW_AT_type(*$C$DW$T$31)
    4704                      .dwattr $C$DW$T$32, DW_AT_language(DW_LANG_C)
    4705              $C$DW$433       .dwtag  DW_TAG_TI_far_type
    4706                      .dwattr $C$DW$433, DW_AT_type(*$C$DW$T$32)
    4707              $C$DW$T$36      .dwtag  DW_TAG_const_type
    4708                      .dwattr $C$DW$T$36, DW_AT_type(*$C$DW$433)
    4709              
    4710              $C$DW$T$33      .dwtag  DW_TAG_structure_type
    4711                      .dwattr $C$DW$T$33, DW_AT_name("_USER_Params_")
    4712                      .dwattr $C$DW$T$33, DW_AT_byte_size(0xac)
    4713              $C$DW$434       .dwtag  DW_TAG_member
    4714                      .dwattr $C$DW$434, DW_AT_type(*$C$DW$T$19)
    4715                      .dwattr $C$DW$434, DW_AT_name("iqFullScaleCurrent_A")
    4716                      .dwattr $C$DW$434, DW_AT_TI_symbol_name("_iqFullScaleCurrent_A")
    4717                      .dwattr $C$DW$434, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    4718                      .dwattr $C$DW$434, DW_AT_accessibility(DW_ACCESS_public)
    4719              $C$DW$435       .dwtag  DW_TAG_member
    4720                      .dwattr $C$DW$435, DW_AT_type(*$C$DW$T$19)
    4721                      .dwattr $C$DW$435, DW_AT_name("iqFullScaleVoltage_V")
    4722                      .dwattr $C$DW$435, DW_AT_TI_symbol_name("_iqFullScaleVoltage_V")
    4723                      .dwattr $C$DW$435, DW_AT_data_member_location[DW_OP_plus_uconst 0x2]
    4724                      .dwattr $C$DW$435, DW_AT_accessibility(DW_ACCESS_public)
    4725              $C$DW$436       .dwtag  DW_TAG_member
    4726                      .dwattr $C$DW$436, DW_AT_type(*$C$DW$T$19)
    4727                      .dwattr $C$DW$436, DW_AT_name("iqFullScaleFreq_Hz")
    4728                      .dwattr $C$DW$436, DW_AT_TI_symbol_name("_iqFullScaleFreq_Hz")
    4729                      .dwattr $C$DW$436, DW_AT_data_member_location[DW_OP_plus_uconst 0x4]
    4730                      .dwattr $C$DW$436, DW_AT_accessibility(DW_ACCESS_public)
    4731              $C$DW$437       .dwtag  DW_TAG_member
    4732                      .dwattr $C$DW$437, DW_AT_type(*$C$DW$T$21)
    4733                      .dwattr $C$DW$437, DW_AT_name("numIsrTicksPerCtrlTick")
    4734                      .dwattr $C$DW$437, DW_AT_TI_symbol_name("_numIsrTicksPerCtrlTick")
    4735                      .dwattr $C$DW$437, DW_AT_data_member_location[DW_OP_plus_uconst 0x6]
    4736                      .dwattr $C$DW$437, DW_AT_accessibility(DW_ACCESS_public)
    4737              $C$DW$438       .dwtag  DW_TAG_member
    4738                      .dwattr $C$DW$438, DW_AT_type(*$C$DW$T$21)
    4739                      .dwattr $C$DW$438, DW_AT_name("numCtrlTicksPerCurrentTick")
TMS320C2000 Assembler PC v6.2.5 Thu Nov 23 20:51:05 2017

Tools Copyright (c) 1996-2014 Texas Instruments Incorporated
C:\Users\wmj\AppData\Local\Temp\0880813                              PAGE   98

    4740                      .dwattr $C$DW$438, DW_AT_TI_symbol_name("_numCtrlTicksPerCurrentTick")
    4741                      .dwattr $C$DW$438, DW_AT_data_member_location[DW_OP_plus_uconst 0x7]
    4742                      .dwattr $C$DW$438, DW_AT_accessibility(DW_ACCESS_public)
    4743              $C$DW$439       .dwtag  DW_TAG_member
    4744                      .dwattr $C$DW$439, DW_AT_type(*$C$DW$T$21)
    4745                      .dwattr $C$DW$439, DW_AT_name("numCtrlTicksPerEstTick")
    4746                      .dwattr $C$DW$439, DW_AT_TI_symbol_name("_numCtrlTicksPerEstTick")
    4747                      .dwattr $C$DW$439, DW_AT_data_member_location[DW_OP_plus_uconst 0x8]
    4748                      .dwattr $C$DW$439, DW_AT_accessibility(DW_ACCESS_public)
    4749              $C$DW$440       .dwtag  DW_TAG_member
    4750                      .dwattr $C$DW$440, DW_AT_type(*$C$DW$T$21)
    4751                      .dwattr $C$DW$440, DW_AT_name("numCtrlTicksPerSpeedTick")
    4752                      .dwattr $C$DW$440, DW_AT_TI_symbol_name("_numCtrlTicksPerSpeedTick")
    4753                      .dwattr $C$DW$440, DW_AT_data_member_location[DW_OP_plus_uconst 0x9]
    4754                      .dwattr $C$DW$440, DW_AT_accessibility(DW_ACCESS_public)
    4755              $C$DW$441       .dwtag  DW_TAG_member
    4756                      .dwattr $C$DW$441, DW_AT_type(*$C$DW$T$21)
    4757                      .dwattr $C$DW$441, DW_AT_name("numCtrlTicksPerTrajTick")
    4758                      .dwattr $C$DW$441, DW_AT_TI_symbol_name("_numCtrlTicksPerTrajTick")
    4759                      .dwattr $C$DW$441, DW_AT_data_member_location[DW_OP_plus_uconst 0xa]
    4760                      .dwattr $C$DW$441, DW_AT_accessibility(DW_ACCESS_public)
    4761              $C$DW$442       .dwtag  DW_TAG_member
    4762                      .dwattr $C$DW$442, DW_AT_type(*$C$DW$T$22)
    4763                      .dwattr $C$DW$442, DW_AT_name("numCurrentSensors")
    4764                      .dwattr $C$DW$442, DW_AT_TI_symbol_name("_numCurrentSensors")
    4765                      .dwattr $C$DW$442, DW_AT_data_member_location[DW_OP_plus_uconst 0xb]
    4766                      .dwattr $C$DW$442, DW_AT_accessibility(DW_ACCESS_public)
    4767              $C$DW$443       .dwtag  DW_TAG_member
    4768                      .dwattr $C$DW$443, DW_AT_type(*$C$DW$T$22)
    4769                      .dwattr $C$DW$443, DW_AT_name("numVoltageSensors")
    4770                      .dwattr $C$DW$443, DW_AT_TI_symbol_name("_numVoltageSensors")
    4771                      .dwattr $C$DW$443, DW_AT_data_member_location[DW_OP_plus_uconst 0xc]
    4772                      .dwattr $C$DW$443, DW_AT_accessibility(DW_ACCESS_public)
    4773              $C$DW$444       .dwtag  DW_TAG_member
    4774                      .dwattr $C$DW$444, DW_AT_type(*$C$DW$T$19)
    4775                      .dwattr $C$DW$444, DW_AT_name("offsetPole_rps")
    4776                      .dwattr $C$DW$444, DW_AT_TI_symbol_name("_offsetPole_rps")
    4777                      .dwattr $C$DW$444, DW_AT_data_member_location[DW_OP_plus_uconst 0xe]
    4778                      .dwattr $C$DW$444, DW_AT_accessibility(DW_ACCESS_public)
    4779              $C$DW$445       .dwtag  DW_TAG_member
    4780                      .dwattr $C$DW$445, DW_AT_type(*$C$DW$T$19)
    4781                      .dwattr $C$DW$445, DW_AT_name("fluxPole_rps")
    4782                      .dwattr $C$DW$445, DW_AT_TI_symbol_name("_fluxPole_rps")
    4783                      .dwattr $C$DW$445, DW_AT_data_member_location[DW_OP_plus_uconst 0x10]
    4784                      .dwattr $C$DW$445, DW_AT_accessibility(DW_ACCESS_public)
    4785              $C$DW$446       .dwtag  DW_TAG_member
    4786                      .dwattr $C$DW$446, DW_AT_type(*$C$DW$T$19)
    4787                      .dwattr $C$DW$446, DW_AT_name("zeroSpeedLimit")
    4788                      .dwattr $C$DW$446, DW_AT_TI_symbol_name("_zeroSpeedLimit")
    4789                      .dwattr $C$DW$446, DW_AT_data_member_location[DW_OP_plus_uconst 0x12]
    4790                      .dwattr $C$DW$446, DW_AT_accessibility(DW_ACCESS_public)
    4791              $C$DW$447       .dwtag  DW_TAG_member
    4792                      .dwattr $C$DW$447, DW_AT_type(*$C$DW$T$19)
    4793                      .dwattr $C$DW$447, DW_AT_name("forceAngleFreq_Hz")
    4794                      .dwattr $C$DW$447, DW_AT_TI_symbol_name("_forceAngleFreq_Hz")
TMS320C2000 Assembler PC v6.2.5 Thu Nov 23 20:51:05 2017

Tools Copyright (c) 1996-2014 Texas Instruments Incorporated
C:\Users\wmj\AppData\Local\Temp\0880813                              PAGE   99

    4795                      .dwattr $C$DW$447, DW_AT_data_member_location[DW_OP_plus_uconst 0x14]
    4796                      .dwattr $C$DW$447, DW_AT_accessibility(DW_ACCESS_public)
    4797              $C$DW$448       .dwtag  DW_TAG_member
    4798                      .dwattr $C$DW$448, DW_AT_type(*$C$DW$T$19)
    4799                      .dwattr $C$DW$448, DW_AT_name("maxAccel_Hzps")
    4800                      .dwattr $C$DW$448, DW_AT_TI_symbol_name("_maxAccel_Hzps")
    4801                      .dwattr $C$DW$448, DW_AT_data_member_location[DW_OP_plus_uconst 0x16]
    4802                      .dwattr $C$DW$448, DW_AT_accessibility(DW_ACCESS_public)
    4803              $C$DW$449       .dwtag  DW_TAG_member
    4804                      .dwattr $C$DW$449, DW_AT_type(*$C$DW$T$19)
    4805                      .dwattr $C$DW$449, DW_AT_name("maxAccel_est_Hzps")
    4806                      .dwattr $C$DW$449, DW_AT_TI_symbol_name("_maxAccel_est_Hzps")
    4807                      .dwattr $C$DW$449, DW_AT_data_member_location[DW_OP_plus_uconst 0x18]
    4808                      .dwattr $C$DW$449, DW_AT_accessibility(DW_ACCESS_public)
    4809              $C$DW$450       .dwtag  DW_TAG_member
    4810                      .dwattr $C$DW$450, DW_AT_type(*$C$DW$T$19)
    4811                      .dwattr $C$DW$450, DW_AT_name("directionPole_rps")
    4812                      .dwattr $C$DW$450, DW_AT_TI_symbol_name("_directionPole_rps")
    4813                      .dwattr $C$DW$450, DW_AT_data_member_location[DW_OP_plus_uconst 0x1a]
    4814                      .dwattr $C$DW$450, DW_AT_accessibility(DW_ACCESS_public)
    4815              $C$DW$451       .dwtag  DW_TAG_member
    4816                      .dwattr $C$DW$451, DW_AT_type(*$C$DW$T$19)
    4817                      .dwattr $C$DW$451, DW_AT_name("speedPole_rps")
    4818                      .dwattr $C$DW$451, DW_AT_TI_symbol_name("_speedPole_rps")
    4819                      .dwattr $C$DW$451, DW_AT_data_member_location[DW_OP_plus_uconst 0x1c]
    4820                      .dwattr $C$DW$451, DW_AT_accessibility(DW_ACCESS_public)
    4821              $C$DW$452       .dwtag  DW_TAG_member
    4822                      .dwattr $C$DW$452, DW_AT_type(*$C$DW$T$19)
    4823                      .dwattr $C$DW$452, DW_AT_name("dcBusPole_rps")
    4824                      .dwattr $C$DW$452, DW_AT_TI_symbol_name("_dcBusPole_rps")
    4825                      .dwattr $C$DW$452, DW_AT_data_member_location[DW_OP_plus_uconst 0x1e]
    4826                      .dwattr $C$DW$452, DW_AT_accessibility(DW_ACCESS_public)
    4827              $C$DW$453       .dwtag  DW_TAG_member
    4828                      .dwattr $C$DW$453, DW_AT_type(*$C$DW$T$19)
    4829                      .dwattr $C$DW$453, DW_AT_name("fluxFraction")
    4830                      .dwattr $C$DW$453, DW_AT_TI_symbol_name("_fluxFraction")
    4831                      .dwattr $C$DW$453, DW_AT_data_member_location[DW_OP_plus_uconst 0x20]
    4832                      .dwattr $C$DW$453, DW_AT_accessibility(DW_ACCESS_public)
    4833              $C$DW$454       .dwtag  DW_TAG_member
    4834                      .dwattr $C$DW$454, DW_AT_type(*$C$DW$T$19)
    4835                      .dwattr $C$DW$454, DW_AT_name("indEst_speedMaxFraction")
    4836                      .dwattr $C$DW$454, DW_AT_TI_symbol_name("_indEst_speedMaxFraction")
    4837                      .dwattr $C$DW$454, DW_AT_data_member_location[DW_OP_plus_uconst 0x22]
    4838                      .dwattr $C$DW$454, DW_AT_accessibility(DW_ACCESS_public)
    4839              $C$DW$455       .dwtag  DW_TAG_member
    4840                      .dwattr $C$DW$455, DW_AT_type(*$C$DW$T$19)
    4841                      .dwattr $C$DW$455, DW_AT_name("powerWarpGain")
    4842                      .dwattr $C$DW$455, DW_AT_TI_symbol_name("_powerWarpGain")
    4843                      .dwattr $C$DW$455, DW_AT_data_member_location[DW_OP_plus_uconst 0x24]
    4844                      .dwattr $C$DW$455, DW_AT_accessibility(DW_ACCESS_public)
    4845              $C$DW$456       .dwtag  DW_TAG_member
    4846                      .dwattr $C$DW$456, DW_AT_type(*$C$DW$T$21)
    4847                      .dwattr $C$DW$456, DW_AT_name("systemFreq_MHz")
    4848                      .dwattr $C$DW$456, DW_AT_TI_symbol_name("_systemFreq_MHz")
    4849                      .dwattr $C$DW$456, DW_AT_data_member_location[DW_OP_plus_uconst 0x26]
TMS320C2000 Assembler PC v6.2.5 Thu Nov 23 20:51:05 2017

Tools Copyright (c) 1996-2014 Texas Instruments Incorporated
C:\Users\wmj\AppData\Local\Temp\0880813                              PAGE  100

    4850                      .dwattr $C$DW$456, DW_AT_accessibility(DW_ACCESS_public)
    4851              $C$DW$457       .dwtag  DW_TAG_member
    4852                      .dwattr $C$DW$457, DW_AT_type(*$C$DW$T$19)
    4853                      .dwattr $C$DW$457, DW_AT_name("pwmPeriod_usec")
    4854                      .dwattr $C$DW$457, DW_AT_TI_symbol_name("_pwmPeriod_usec")
    4855                      .dwattr $C$DW$457, DW_AT_data_member_location[DW_OP_plus_uconst 0x28]
    4856                      .dwattr $C$DW$457, DW_AT_accessibility(DW_ACCESS_public)
    4857              $C$DW$458       .dwtag  DW_TAG_member
    4858                      .dwattr $C$DW$458, DW_AT_type(*$C$DW$T$19)
    4859                      .dwattr $C$DW$458, DW_AT_name("voltage_sf")
    4860                      .dwattr $C$DW$458, DW_AT_TI_symbol_name("_voltage_sf")
    4861                      .dwattr $C$DW$458, DW_AT_data_member_location[DW_OP_plus_uconst 0x2a]
    4862                      .dwattr $C$DW$458, DW_AT_accessibility(DW_ACCESS_public)
    4863              $C$DW$459       .dwtag  DW_TAG_member
    4864                      .dwattr $C$DW$459, DW_AT_type(*$C$DW$T$19)
    4865                      .dwattr $C$DW$459, DW_AT_name("current_sf")
    4866                      .dwattr $C$DW$459, DW_AT_TI_symbol_name("_current_sf")
    4867                      .dwattr $C$DW$459, DW_AT_data_member_location[DW_OP_plus_uconst 0x2c]
    4868                      .dwattr $C$DW$459, DW_AT_accessibility(DW_ACCESS_public)
    4869              $C$DW$460       .dwtag  DW_TAG_member
    4870                      .dwattr $C$DW$460, DW_AT_type(*$C$DW$T$19)
    4871                      .dwattr $C$DW$460, DW_AT_name("voltageFilterPole_rps")
    4872                      .dwattr $C$DW$460, DW_AT_TI_symbol_name("_voltageFilterPole_rps")
    4873                      .dwattr $C$DW$460, DW_AT_data_member_location[DW_OP_plus_uconst 0x2e]
    4874                      .dwattr $C$DW$460, DW_AT_accessibility(DW_ACCESS_public)
    4875              $C$DW$461       .dwtag  DW_TAG_member
    4876                      .dwattr $C$DW$461, DW_AT_type(*$C$DW$T$19)
    4877                      .dwattr $C$DW$461, DW_AT_name("maxVsMag_pu")
    4878                      .dwattr $C$DW$461, DW_AT_TI_symbol_name("_maxVsMag_pu")
    4879                      .dwattr $C$DW$461, DW_AT_data_member_location[DW_OP_plus_uconst 0x30]
    4880                      .dwattr $C$DW$461, DW_AT_accessibility(DW_ACCESS_public)
    4881              $C$DW$462       .dwtag  DW_TAG_member
    4882                      .dwattr $C$DW$462, DW_AT_type(*$C$DW$T$19)
    4883                      .dwattr $C$DW$462, DW_AT_name("estKappa")
    4884                      .dwattr $C$DW$462, DW_AT_TI_symbol_name("_estKappa")
    4885                      .dwattr $C$DW$462, DW_AT_data_member_location[DW_OP_plus_uconst 0x32]
    4886                      .dwattr $C$DW$462, DW_AT_accessibility(DW_ACCESS_public)
    4887              $C$DW$463       .dwtag  DW_TAG_member
    4888                      .dwattr $C$DW$463, DW_AT_type(*$C$DW$T$24)
    4889                      .dwattr $C$DW$463, DW_AT_name("motor_type")
    4890                      .dwattr $C$DW$463, DW_AT_TI_symbol_name("_motor_type")
    4891                      .dwattr $C$DW$463, DW_AT_data_member_location[DW_OP_plus_uconst 0x34]
    4892                      .dwattr $C$DW$463, DW_AT_accessibility(DW_ACCESS_public)
    4893              $C$DW$464       .dwtag  DW_TAG_member
    4894                      .dwattr $C$DW$464, DW_AT_type(*$C$DW$T$21)
    4895                      .dwattr $C$DW$464, DW_AT_name("motor_numPolePairs")
    4896                      .dwattr $C$DW$464, DW_AT_TI_symbol_name("_motor_numPolePairs")
    4897                      .dwattr $C$DW$464, DW_AT_data_member_location[DW_OP_plus_uconst 0x35]
    4898                      .dwattr $C$DW$464, DW_AT_accessibility(DW_ACCESS_public)
    4899              $C$DW$465       .dwtag  DW_TAG_member
    4900                      .dwattr $C$DW$465, DW_AT_type(*$C$DW$T$19)
    4901                      .dwattr $C$DW$465, DW_AT_name("motor_ratedFlux")
    4902                      .dwattr $C$DW$465, DW_AT_TI_symbol_name("_motor_ratedFlux")
    4903                      .dwattr $C$DW$465, DW_AT_data_member_location[DW_OP_plus_uconst 0x36]
    4904                      .dwattr $C$DW$465, DW_AT_accessibility(DW_ACCESS_public)
TMS320C2000 Assembler PC v6.2.5 Thu Nov 23 20:51:05 2017

Tools Copyright (c) 1996-2014 Texas Instruments Incorporated
C:\Users\wmj\AppData\Local\Temp\0880813                              PAGE  101

    4905              $C$DW$466       .dwtag  DW_TAG_member
    4906                      .dwattr $C$DW$466, DW_AT_type(*$C$DW$T$19)
    4907                      .dwattr $C$DW$466, DW_AT_name("motor_Rr")
    4908                      .dwattr $C$DW$466, DW_AT_TI_symbol_name("_motor_Rr")
    4909                      .dwattr $C$DW$466, DW_AT_data_member_location[DW_OP_plus_uconst 0x38]
    4910                      .dwattr $C$DW$466, DW_AT_accessibility(DW_ACCESS_public)
    4911              $C$DW$467       .dwtag  DW_TAG_member
    4912                      .dwattr $C$DW$467, DW_AT_type(*$C$DW$T$19)
    4913                      .dwattr $C$DW$467, DW_AT_name("motor_Rs")
    4914                      .dwattr $C$DW$467, DW_AT_TI_symbol_name("_motor_Rs")
    4915                      .dwattr $C$DW$467, DW_AT_data_member_location[DW_OP_plus_uconst 0x3a]
    4916                      .dwattr $C$DW$467, DW_AT_accessibility(DW_ACCESS_public)
    4917              $C$DW$468       .dwtag  DW_TAG_member
    4918                      .dwattr $C$DW$468, DW_AT_type(*$C$DW$T$19)
    4919                      .dwattr $C$DW$468, DW_AT_name("motor_Ls_d")
    4920                      .dwattr $C$DW$468, DW_AT_TI_symbol_name("_motor_Ls_d")
    4921                      .dwattr $C$DW$468, DW_AT_data_member_location[DW_OP_plus_uconst 0x3c]
    4922                      .dwattr $C$DW$468, DW_AT_accessibility(DW_ACCESS_public)
    4923              $C$DW$469       .dwtag  DW_TAG_member
    4924                      .dwattr $C$DW$469, DW_AT_type(*$C$DW$T$19)
    4925                      .dwattr $C$DW$469, DW_AT_name("motor_Ls_q")
    4926                      .dwattr $C$DW$469, DW_AT_TI_symbol_name("_motor_Ls_q")
    4927                      .dwattr $C$DW$469, DW_AT_data_member_location[DW_OP_plus_uconst 0x3e]
    4928                      .dwattr $C$DW$469, DW_AT_accessibility(DW_ACCESS_public)
    4929              $C$DW$470       .dwtag  DW_TAG_member
    4930                      .dwattr $C$DW$470, DW_AT_type(*$C$DW$T$19)
    4931                      .dwattr $C$DW$470, DW_AT_name("maxCurrent")
    4932                      .dwattr $C$DW$470, DW_AT_TI_symbol_name("_maxCurrent")
    4933                      .dwattr $C$DW$470, DW_AT_data_member_location[DW_OP_plus_uconst 0x40]
    4934                      .dwattr $C$DW$470, DW_AT_accessibility(DW_ACCESS_public)
    4935              $C$DW$471       .dwtag  DW_TAG_member
    4936                      .dwattr $C$DW$471, DW_AT_type(*$C$DW$T$19)
    4937                      .dwattr $C$DW$471, DW_AT_name("maxCurrent_resEst")
    4938                      .dwattr $C$DW$471, DW_AT_TI_symbol_name("_maxCurrent_resEst")
    4939                      .dwattr $C$DW$471, DW_AT_data_member_location[DW_OP_plus_uconst 0x42]
    4940                      .dwattr $C$DW$471, DW_AT_accessibility(DW_ACCESS_public)
    4941              $C$DW$472       .dwtag  DW_TAG_member
    4942                      .dwattr $C$DW$472, DW_AT_type(*$C$DW$T$19)
    4943                      .dwattr $C$DW$472, DW_AT_name("maxCurrent_indEst")
    4944                      .dwattr $C$DW$472, DW_AT_TI_symbol_name("_maxCurrent_indEst")
    4945                      .dwattr $C$DW$472, DW_AT_data_member_location[DW_OP_plus_uconst 0x44]
    4946                      .dwattr $C$DW$472, DW_AT_accessibility(DW_ACCESS_public)
    4947              $C$DW$473       .dwtag  DW_TAG_member
    4948                      .dwattr $C$DW$473, DW_AT_type(*$C$DW$T$19)
    4949                      .dwattr $C$DW$473, DW_AT_name("maxCurrentSlope")
    4950                      .dwattr $C$DW$473, DW_AT_TI_symbol_name("_maxCurrentSlope")
    4951                      .dwattr $C$DW$473, DW_AT_data_member_location[DW_OP_plus_uconst 0x46]
    4952                      .dwattr $C$DW$473, DW_AT_accessibility(DW_ACCESS_public)
    4953              $C$DW$474       .dwtag  DW_TAG_member
    4954                      .dwattr $C$DW$474, DW_AT_type(*$C$DW$T$19)
    4955                      .dwattr $C$DW$474, DW_AT_name("maxCurrentSlope_powerWarp")
    4956                      .dwattr $C$DW$474, DW_AT_TI_symbol_name("_maxCurrentSlope_powerWarp")
    4957                      .dwattr $C$DW$474, DW_AT_data_member_location[DW_OP_plus_uconst 0x48]
    4958                      .dwattr $C$DW$474, DW_AT_accessibility(DW_ACCESS_public)
    4959              $C$DW$475       .dwtag  DW_TAG_member
TMS320C2000 Assembler PC v6.2.5 Thu Nov 23 20:51:05 2017

Tools Copyright (c) 1996-2014 Texas Instruments Incorporated
C:\Users\wmj\AppData\Local\Temp\0880813                              PAGE  102

    4960                      .dwattr $C$DW$475, DW_AT_type(*$C$DW$T$19)
    4961                      .dwattr $C$DW$475, DW_AT_name("IdRated")
    4962                      .dwattr $C$DW$475, DW_AT_TI_symbol_name("_IdRated")
    4963                      .dwattr $C$DW$475, DW_AT_data_member_location[DW_OP_plus_uconst 0x4a]
    4964                      .dwattr $C$DW$475, DW_AT_accessibility(DW_ACCESS_public)
    4965              $C$DW$476       .dwtag  DW_TAG_member
    4966                      .dwattr $C$DW$476, DW_AT_type(*$C$DW$T$19)
    4967                      .dwattr $C$DW$476, DW_AT_name("IdRatedFraction_indEst")
    4968                      .dwattr $C$DW$476, DW_AT_TI_symbol_name("_IdRatedFraction_indEst")
    4969                      .dwattr $C$DW$476, DW_AT_data_member_location[DW_OP_plus_uconst 0x4c]
    4970                      .dwattr $C$DW$476, DW_AT_accessibility(DW_ACCESS_public)
    4971              $C$DW$477       .dwtag  DW_TAG_member
    4972                      .dwattr $C$DW$477, DW_AT_type(*$C$DW$T$19)
    4973                      .dwattr $C$DW$477, DW_AT_name("IdRatedFraction_ratedFlux")
    4974                      .dwattr $C$DW$477, DW_AT_TI_symbol_name("_IdRatedFraction_ratedFlux")
    4975                      .dwattr $C$DW$477, DW_AT_data_member_location[DW_OP_plus_uconst 0x4e]
    4976                      .dwattr $C$DW$477, DW_AT_accessibility(DW_ACCESS_public)
    4977              $C$DW$478       .dwtag  DW_TAG_member
    4978                      .dwattr $C$DW$478, DW_AT_type(*$C$DW$T$19)
    4979                      .dwattr $C$DW$478, DW_AT_name("IdRated_delta")
    4980                      .dwattr $C$DW$478, DW_AT_TI_symbol_name("_IdRated_delta")
    4981                      .dwattr $C$DW$478, DW_AT_data_member_location[DW_OP_plus_uconst 0x50]
    4982                      .dwattr $C$DW$478, DW_AT_accessibility(DW_ACCESS_public)
    4983              $C$DW$479       .dwtag  DW_TAG_member
    4984                      .dwattr $C$DW$479, DW_AT_type(*$C$DW$T$19)
    4985                      .dwattr $C$DW$479, DW_AT_name("fluxEstFreq_Hz")
    4986                      .dwattr $C$DW$479, DW_AT_TI_symbol_name("_fluxEstFreq_Hz")
    4987                      .dwattr $C$DW$479, DW_AT_data_member_location[DW_OP_plus_uconst 0x52]
    4988                      .dwattr $C$DW$479, DW_AT_accessibility(DW_ACCESS_public)
    4989              $C$DW$480       .dwtag  DW_TAG_member
    4990                      .dwattr $C$DW$480, DW_AT_type(*$C$DW$T$27)
    4991                      .dwattr $C$DW$480, DW_AT_name("ctrlWaitTime")
    4992                      .dwattr $C$DW$480, DW_AT_TI_symbol_name("_ctrlWaitTime")
    4993                      .dwattr $C$DW$480, DW_AT_data_member_location[DW_OP_plus_uconst 0x54]
    4994                      .dwattr $C$DW$480, DW_AT_accessibility(DW_ACCESS_public)
    4995              $C$DW$481       .dwtag  DW_TAG_member
    4996                      .dwattr $C$DW$481, DW_AT_type(*$C$DW$T$28)
    4997                      .dwattr $C$DW$481, DW_AT_name("estWaitTime")
    4998                      .dwattr $C$DW$481, DW_AT_TI_symbol_name("_estWaitTime")
    4999                      .dwattr $C$DW$481, DW_AT_data_member_location[DW_OP_plus_uconst 0x5c]
    5000                      .dwattr $C$DW$481, DW_AT_accessibility(DW_ACCESS_public)
    5001              $C$DW$482       .dwtag  DW_TAG_member
    5002                      .dwattr $C$DW$482, DW_AT_type(*$C$DW$T$29)
    5003                      .dwattr $C$DW$482, DW_AT_name("FluxWaitTime")
    5004                      .dwattr $C$DW$482, DW_AT_TI_symbol_name("_FluxWaitTime")
    5005                      .dwattr $C$DW$482, DW_AT_data_member_location[DW_OP_plus_uconst 0x78]
    5006                      .dwattr $C$DW$482, DW_AT_accessibility(DW_ACCESS_public)
    5007              $C$DW$483       .dwtag  DW_TAG_member
    5008                      .dwattr $C$DW$483, DW_AT_type(*$C$DW$T$30)
    5009                      .dwattr $C$DW$483, DW_AT_name("LsWaitTime")
    5010                      .dwattr $C$DW$483, DW_AT_TI_symbol_name("_LsWaitTime")
    5011                      .dwattr $C$DW$483, DW_AT_data_member_location[DW_OP_plus_uconst 0x84]
    5012                      .dwattr $C$DW$483, DW_AT_accessibility(DW_ACCESS_public)
    5013              $C$DW$484       .dwtag  DW_TAG_member
    5014                      .dwattr $C$DW$484, DW_AT_type(*$C$DW$T$29)
TMS320C2000 Assembler PC v6.2.5 Thu Nov 23 20:51:05 2017

Tools Copyright (c) 1996-2014 Texas Instruments Incorporated
C:\Users\wmj\AppData\Local\Temp\0880813                              PAGE  103

    5015                      .dwattr $C$DW$484, DW_AT_name("RsWaitTime")
    5016                      .dwattr $C$DW$484, DW_AT_TI_symbol_name("_RsWaitTime")
    5017                      .dwattr $C$DW$484, DW_AT_data_member_location[DW_OP_plus_uconst 0x92]
    5018                      .dwattr $C$DW$484, DW_AT_accessibility(DW_ACCESS_public)
    5019              $C$DW$485       .dwtag  DW_TAG_member
    5020                      .dwattr $C$DW$485, DW_AT_type(*$C$DW$T$26)
    5021                      .dwattr $C$DW$485, DW_AT_name("ctrlFreq_Hz")
    5022                      .dwattr $C$DW$485, DW_AT_TI_symbol_name("_ctrlFreq_Hz")
    5023                      .dwattr $C$DW$485, DW_AT_data_member_location[DW_OP_plus_uconst 0x9e]
    5024                      .dwattr $C$DW$485, DW_AT_accessibility(DW_ACCESS_public)
    5025              $C$DW$486       .dwtag  DW_TAG_member
    5026                      .dwattr $C$DW$486, DW_AT_type(*$C$DW$T$26)
    5027                      .dwattr $C$DW$486, DW_AT_name("estFreq_Hz")
    5028                      .dwattr $C$DW$486, DW_AT_TI_symbol_name("_estFreq_Hz")
    5029                      .dwattr $C$DW$486, DW_AT_data_member_location[DW_OP_plus_uconst 0xa0]
    5030                      .dwattr $C$DW$486, DW_AT_accessibility(DW_ACCESS_public)
    5031              $C$DW$487       .dwtag  DW_TAG_member
    5032                      .dwattr $C$DW$487, DW_AT_type(*$C$DW$T$26)
    5033                      .dwattr $C$DW$487, DW_AT_name("RoverL_estFreq_Hz")
    5034                      .dwattr $C$DW$487, DW_AT_TI_symbol_name("_RoverL_estFreq_Hz")
    5035                      .dwattr $C$DW$487, DW_AT_data_member_location[DW_OP_plus_uconst 0xa2]
    5036                      .dwattr $C$DW$487, DW_AT_accessibility(DW_ACCESS_public)
    5037              $C$DW$488       .dwtag  DW_TAG_member
    5038                      .dwattr $C$DW$488, DW_AT_type(*$C$DW$T$26)
    5039                      .dwattr $C$DW$488, DW_AT_name("trajFreq_Hz")
    5040                      .dwattr $C$DW$488, DW_AT_TI_symbol_name("_trajFreq_Hz")
    5041                      .dwattr $C$DW$488, DW_AT_data_member_location[DW_OP_plus_uconst 0xa4]
    5042                      .dwattr $C$DW$488, DW_AT_accessibility(DW_ACCESS_public)
    5043              $C$DW$489       .dwtag  DW_TAG_member
    5044                      .dwattr $C$DW$489, DW_AT_type(*$C$DW$T$19)
    5045                      .dwattr $C$DW$489, DW_AT_name("ctrlPeriod_sec")
    5046                      .dwattr $C$DW$489, DW_AT_TI_symbol_name("_ctrlPeriod_sec")
    5047                      .dwattr $C$DW$489, DW_AT_data_member_location[DW_OP_plus_uconst 0xa6]
    5048                      .dwattr $C$DW$489, DW_AT_accessibility(DW_ACCESS_public)
    5049              $C$DW$490       .dwtag  DW_TAG_member
    5050                      .dwattr $C$DW$490, DW_AT_type(*$C$DW$T$19)
    5051                      .dwattr $C$DW$490, DW_AT_name("maxNegativeIdCurrent_a")
    5052                      .dwattr $C$DW$490, DW_AT_TI_symbol_name("_maxNegativeIdCurrent_a")
    5053                      .dwattr $C$DW$490, DW_AT_data_member_location[DW_OP_plus_uconst 0xa8]
    5054                      .dwattr $C$DW$490, DW_AT_accessibility(DW_ACCESS_public)
    5055              $C$DW$491       .dwtag  DW_TAG_member
    5056                      .dwattr $C$DW$491, DW_AT_type(*$C$DW$T$32)
    5057                      .dwattr $C$DW$491, DW_AT_name("errorCode")
    5058                      .dwattr $C$DW$491, DW_AT_TI_symbol_name("_errorCode")
    5059                      .dwattr $C$DW$491, DW_AT_data_member_location[DW_OP_plus_uconst 0xaa]
    5060                      .dwattr $C$DW$491, DW_AT_accessibility(DW_ACCESS_public)
    5061              $C$DW$492       .dwtag  DW_TAG_member
    5062                      .dwattr $C$DW$492, DW_AT_type(*$C$DW$T$22)
    5063                      .dwattr $C$DW$492, DW_AT_name("motor_ID")
    5064                      .dwattr $C$DW$492, DW_AT_TI_symbol_name("_motor_ID")
    5065                      .dwattr $C$DW$492, DW_AT_data_member_location[DW_OP_plus_uconst 0xab]
    5066                      .dwattr $C$DW$492, DW_AT_accessibility(DW_ACCESS_public)
    5067                      .dwendtag $C$DW$T$33
    5068              
    5069              $C$DW$T$37      .dwtag  DW_TAG_typedef, DW_AT_name("USER_Params")
TMS320C2000 Assembler PC v6.2.5 Thu Nov 23 20:51:05 2017

Tools Copyright (c) 1996-2014 Texas Instruments Incorporated
C:\Users\wmj\AppData\Local\Temp\0880813                              PAGE  104

    5070                      .dwattr $C$DW$T$37, DW_AT_type(*$C$DW$T$33)
    5071                      .dwattr $C$DW$T$37, DW_AT_language(DW_LANG_C)
    5072              $C$DW$T$38      .dwtag  DW_TAG_pointer_type
    5073                      .dwattr $C$DW$T$38, DW_AT_type(*$C$DW$T$37)
    5074                      .dwattr $C$DW$T$38, DW_AT_address_class(0x16)
    5075              $C$DW$493       .dwtag  DW_TAG_TI_far_type
    5076                      .dwattr $C$DW$493, DW_AT_type(*$C$DW$T$38)
    5077              $C$DW$T$41      .dwtag  DW_TAG_const_type
    5078                      .dwattr $C$DW$T$41, DW_AT_type(*$C$DW$493)
    5079              
    5080              $C$DW$T$34      .dwtag  DW_TAG_structure_type
    5081                      .dwattr $C$DW$T$34, DW_AT_name("_UserBoard_Params_")
    5082                      .dwattr $C$DW$T$34, DW_AT_byte_size(0x08)
    5083              $C$DW$494       .dwtag  DW_TAG_member
    5084                      .dwattr $C$DW$494, DW_AT_type(*$C$DW$T$19)
    5085                      .dwattr $C$DW$494, DW_AT_name("iqFullScaleCurrent_A")
    5086                      .dwattr $C$DW$494, DW_AT_TI_symbol_name("_iqFullScaleCurrent_A")
    5087                      .dwattr $C$DW$494, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    5088                      .dwattr $C$DW$494, DW_AT_accessibility(DW_ACCESS_public)
    5089              $C$DW$495       .dwtag  DW_TAG_member
    5090                      .dwattr $C$DW$495, DW_AT_type(*$C$DW$T$19)
    5091                      .dwattr $C$DW$495, DW_AT_name("iqFullScaleVoltage_V")
    5092                      .dwattr $C$DW$495, DW_AT_TI_symbol_name("_iqFullScaleVoltage_V")
    5093                      .dwattr $C$DW$495, DW_AT_data_member_location[DW_OP_plus_uconst 0x2]
    5094                      .dwattr $C$DW$495, DW_AT_accessibility(DW_ACCESS_public)
    5095              $C$DW$496       .dwtag  DW_TAG_member
    5096                      .dwattr $C$DW$496, DW_AT_type(*$C$DW$T$19)
    5097                      .dwattr $C$DW$496, DW_AT_name("adcFullScaleCurrent_A")
    5098                      .dwattr $C$DW$496, DW_AT_TI_symbol_name("_adcFullScaleCurrent_A")
    5099                      .dwattr $C$DW$496, DW_AT_data_member_location[DW_OP_plus_uconst 0x4]
    5100                      .dwattr $C$DW$496, DW_AT_accessibility(DW_ACCESS_public)
    5101              $C$DW$497       .dwtag  DW_TAG_member
    5102                      .dwattr $C$DW$497, DW_AT_type(*$C$DW$T$19)
    5103                      .dwattr $C$DW$497, DW_AT_name("adcFullScaleVoltage_V")
    5104                      .dwattr $C$DW$497, DW_AT_TI_symbol_name("_adcFullScaleVoltage_V")
    5105                      .dwattr $C$DW$497, DW_AT_data_member_location[DW_OP_plus_uconst 0x6]
    5106                      .dwattr $C$DW$497, DW_AT_accessibility(DW_ACCESS_public)
    5107                      .dwendtag $C$DW$T$34
    5108              
    5109              $C$DW$T$44      .dwtag  DW_TAG_typedef, DW_AT_name("UserBoard_Params")
    5110                      .dwattr $C$DW$T$44, DW_AT_type(*$C$DW$T$34)
    5111                      .dwattr $C$DW$T$44, DW_AT_language(DW_LANG_C)
    5112              $C$DW$498       .dwtag  DW_TAG_TI_far_type
    5113                      .dwattr $C$DW$498, DW_AT_type(*$C$DW$T$44)
    5114              $C$DW$T$45      .dwtag  DW_TAG_const_type
    5115                      .dwattr $C$DW$T$45, DW_AT_type(*$C$DW$498)
    5116              
    5117              $C$DW$T$46      .dwtag  DW_TAG_array_type
    5118                      .dwattr $C$DW$T$46, DW_AT_type(*$C$DW$T$45)
    5119                      .dwattr $C$DW$T$46, DW_AT_language(DW_LANG_C)
    5120                      .dwattr $C$DW$T$46, DW_AT_byte_size(0x38)
    5121              $C$DW$499       .dwtag  DW_TAG_subrange_type
    5122                      .dwattr $C$DW$499, DW_AT_upper_bound(0x06)
    5123                      .dwendtag $C$DW$T$46
    5124              
TMS320C2000 Assembler PC v6.2.5 Thu Nov 23 20:51:05 2017

Tools Copyright (c) 1996-2014 Texas Instruments Incorporated
C:\Users\wmj\AppData\Local\Temp\0880813                              PAGE  105

    5125              
    5126              $C$DW$T$35      .dwtag  DW_TAG_structure_type
    5127                      .dwattr $C$DW$T$35, DW_AT_name("_UserMotor_Params_")
    5128                      .dwattr $C$DW$T$35, DW_AT_byte_size(0x16)
    5129              $C$DW$500       .dwtag  DW_TAG_member
    5130                      .dwattr $C$DW$500, DW_AT_type(*$C$DW$T$24)
    5131                      .dwattr $C$DW$500, DW_AT_name("motor_type")
    5132                      .dwattr $C$DW$500, DW_AT_TI_symbol_name("_motor_type")
    5133                      .dwattr $C$DW$500, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    5134                      .dwattr $C$DW$500, DW_AT_accessibility(DW_ACCESS_public)
    5135              $C$DW$501       .dwtag  DW_TAG_member
    5136                      .dwattr $C$DW$501, DW_AT_type(*$C$DW$T$21)
    5137                      .dwattr $C$DW$501, DW_AT_name("motor_numPolePairs")
    5138                      .dwattr $C$DW$501, DW_AT_TI_symbol_name("_motor_numPolePairs")
    5139                      .dwattr $C$DW$501, DW_AT_data_member_location[DW_OP_plus_uconst 0x1]
    5140                      .dwattr $C$DW$501, DW_AT_accessibility(DW_ACCESS_public)
    5141              $C$DW$502       .dwtag  DW_TAG_member
    5142                      .dwattr $C$DW$502, DW_AT_type(*$C$DW$T$19)
    5143                      .dwattr $C$DW$502, DW_AT_name("motor_Rr")
    5144                      .dwattr $C$DW$502, DW_AT_TI_symbol_name("_motor_Rr")
    5145                      .dwattr $C$DW$502, DW_AT_data_member_location[DW_OP_plus_uconst 0x2]
    5146                      .dwattr $C$DW$502, DW_AT_accessibility(DW_ACCESS_public)
    5147              $C$DW$503       .dwtag  DW_TAG_member
    5148                      .dwattr $C$DW$503, DW_AT_type(*$C$DW$T$19)
    5149                      .dwattr $C$DW$503, DW_AT_name("motor_Rs")
    5150                      .dwattr $C$DW$503, DW_AT_TI_symbol_name("_motor_Rs")
    5151                      .dwattr $C$DW$503, DW_AT_data_member_location[DW_OP_plus_uconst 0x4]
    5152                      .dwattr $C$DW$503, DW_AT_accessibility(DW_ACCESS_public)
    5153              $C$DW$504       .dwtag  DW_TAG_member
    5154                      .dwattr $C$DW$504, DW_AT_type(*$C$DW$T$19)
    5155                      .dwattr $C$DW$504, DW_AT_name("motor_Ls_d")
    5156                      .dwattr $C$DW$504, DW_AT_TI_symbol_name("_motor_Ls_d")
    5157                      .dwattr $C$DW$504, DW_AT_data_member_location[DW_OP_plus_uconst 0x6]
    5158                      .dwattr $C$DW$504, DW_AT_accessibility(DW_ACCESS_public)
    5159              $C$DW$505       .dwtag  DW_TAG_member
    5160                      .dwattr $C$DW$505, DW_AT_type(*$C$DW$T$19)
    5161                      .dwattr $C$DW$505, DW_AT_name("motor_Ls_q")
    5162                      .dwattr $C$DW$505, DW_AT_TI_symbol_name("_motor_Ls_q")
    5163                      .dwattr $C$DW$505, DW_AT_data_member_location[DW_OP_plus_uconst 0x8]
    5164                      .dwattr $C$DW$505, DW_AT_accessibility(DW_ACCESS_public)
    5165              $C$DW$506       .dwtag  DW_TAG_member
    5166                      .dwattr $C$DW$506, DW_AT_type(*$C$DW$T$19)
    5167                      .dwattr $C$DW$506, DW_AT_name("motor_ratedFlux")
    5168                      .dwattr $C$DW$506, DW_AT_TI_symbol_name("_motor_ratedFlux")
    5169                      .dwattr $C$DW$506, DW_AT_data_member_location[DW_OP_plus_uconst 0xa]
    5170                      .dwattr $C$DW$506, DW_AT_accessibility(DW_ACCESS_public)
    5171              $C$DW$507       .dwtag  DW_TAG_member
    5172                      .dwattr $C$DW$507, DW_AT_type(*$C$DW$T$19)
    5173                      .dwattr $C$DW$507, DW_AT_name("IdRated")
    5174                      .dwattr $C$DW$507, DW_AT_TI_symbol_name("_IdRated")
    5175                      .dwattr $C$DW$507, DW_AT_data_member_location[DW_OP_plus_uconst 0xc]
    5176                      .dwattr $C$DW$507, DW_AT_accessibility(DW_ACCESS_public)
    5177              $C$DW$508       .dwtag  DW_TAG_member
    5178                      .dwattr $C$DW$508, DW_AT_type(*$C$DW$T$19)
    5179                      .dwattr $C$DW$508, DW_AT_name("maxCurrent_resEst")
TMS320C2000 Assembler PC v6.2.5 Thu Nov 23 20:51:05 2017

Tools Copyright (c) 1996-2014 Texas Instruments Incorporated
C:\Users\wmj\AppData\Local\Temp\0880813                              PAGE  106

    5180                      .dwattr $C$DW$508, DW_AT_TI_symbol_name("_maxCurrent_resEst")
    5181                      .dwattr $C$DW$508, DW_AT_data_member_location[DW_OP_plus_uconst 0xe]
    5182                      .dwattr $C$DW$508, DW_AT_accessibility(DW_ACCESS_public)
    5183              $C$DW$509       .dwtag  DW_TAG_member
    5184                      .dwattr $C$DW$509, DW_AT_type(*$C$DW$T$19)
    5185                      .dwattr $C$DW$509, DW_AT_name("maxCurrent_indEst")
    5186                      .dwattr $C$DW$509, DW_AT_TI_symbol_name("_maxCurrent_indEst")
    5187                      .dwattr $C$DW$509, DW_AT_data_member_location[DW_OP_plus_uconst 0x10]
    5188                      .dwattr $C$DW$509, DW_AT_accessibility(DW_ACCESS_public)
    5189              $C$DW$510       .dwtag  DW_TAG_member
    5190                      .dwattr $C$DW$510, DW_AT_type(*$C$DW$T$19)
    5191                      .dwattr $C$DW$510, DW_AT_name("maxCurrent")
    5192                      .dwattr $C$DW$510, DW_AT_TI_symbol_name("_maxCurrent")
    5193                      .dwattr $C$DW$510, DW_AT_data_member_location[DW_OP_plus_uconst 0x12]
    5194                      .dwattr $C$DW$510, DW_AT_accessibility(DW_ACCESS_public)
    5195              $C$DW$511       .dwtag  DW_TAG_member
    5196                      .dwattr $C$DW$511, DW_AT_type(*$C$DW$T$19)
    5197                      .dwattr $C$DW$511, DW_AT_name("fluxEstFreq_Hz")
    5198                      .dwattr $C$DW$511, DW_AT_TI_symbol_name("_fluxEstFreq_Hz")
    5199                      .dwattr $C$DW$511, DW_AT_data_member_location[DW_OP_plus_uconst 0x14]
    5200                      .dwattr $C$DW$511, DW_AT_accessibility(DW_ACCESS_public)
    5201                      .dwendtag $C$DW$T$35
    5202              
    5203              $C$DW$T$50      .dwtag  DW_TAG_typedef, DW_AT_name("UserMotor_Params")
    5204                      .dwattr $C$DW$T$50, DW_AT_type(*$C$DW$T$35)
    5205                      .dwattr $C$DW$T$50, DW_AT_language(DW_LANG_C)
    5206              $C$DW$512       .dwtag  DW_TAG_TI_far_type
    5207                      .dwattr $C$DW$512, DW_AT_type(*$C$DW$T$50)
    5208              $C$DW$T$51      .dwtag  DW_TAG_const_type
    5209                      .dwattr $C$DW$T$51, DW_AT_type(*$C$DW$512)
    5210              
    5211              $C$DW$T$52      .dwtag  DW_TAG_array_type
    5212                      .dwattr $C$DW$T$52, DW_AT_type(*$C$DW$T$51)
    5213                      .dwattr $C$DW$T$52, DW_AT_language(DW_LANG_C)
    5214                      .dwattr $C$DW$T$52, DW_AT_byte_size(0x9a)
    5215              $C$DW$513       .dwtag  DW_TAG_subrange_type
    5216                      .dwattr $C$DW$513, DW_AT_upper_bound(0x06)
    5217                      .dwendtag $C$DW$T$52
    5218              
    5219              $C$DW$T$4       .dwtag  DW_TAG_base_type
    5220                      .dwattr $C$DW$T$4, DW_AT_encoding(DW_ATE_boolean)
    5221                      .dwattr $C$DW$T$4, DW_AT_name("bool")
    5222                      .dwattr $C$DW$T$4, DW_AT_byte_size(0x01)
    5223              $C$DW$T$5       .dwtag  DW_TAG_base_type
    5224                      .dwattr $C$DW$T$5, DW_AT_encoding(DW_ATE_signed_char)
    5225                      .dwattr $C$DW$T$5, DW_AT_name("signed char")
    5226                      .dwattr $C$DW$T$5, DW_AT_byte_size(0x01)
    5227              $C$DW$T$6       .dwtag  DW_TAG_base_type
    5228                      .dwattr $C$DW$T$6, DW_AT_encoding(DW_ATE_unsigned_char)
    5229                      .dwattr $C$DW$T$6, DW_AT_name("unsigned char")
    5230                      .dwattr $C$DW$T$6, DW_AT_byte_size(0x01)
    5231              $C$DW$T$7       .dwtag  DW_TAG_base_type
    5232                      .dwattr $C$DW$T$7, DW_AT_encoding(DW_ATE_signed_char)
    5233                      .dwattr $C$DW$T$7, DW_AT_name("wchar_t")
    5234                      .dwattr $C$DW$T$7, DW_AT_byte_size(0x01)
TMS320C2000 Assembler PC v6.2.5 Thu Nov 23 20:51:05 2017

Tools Copyright (c) 1996-2014 Texas Instruments Incorporated
C:\Users\wmj\AppData\Local\Temp\0880813                              PAGE  107

    5235              $C$DW$T$8       .dwtag  DW_TAG_base_type
    5236                      .dwattr $C$DW$T$8, DW_AT_encoding(DW_ATE_signed)
    5237                      .dwattr $C$DW$T$8, DW_AT_name("short")
    5238                      .dwattr $C$DW$T$8, DW_AT_byte_size(0x01)
    5239              $C$DW$T$9       .dwtag  DW_TAG_base_type
    5240                      .dwattr $C$DW$T$9, DW_AT_encoding(DW_ATE_unsigned)
    5241                      .dwattr $C$DW$T$9, DW_AT_name("unsigned short")
    5242                      .dwattr $C$DW$T$9, DW_AT_byte_size(0x01)
    5243              $C$DW$T$20      .dwtag  DW_TAG_typedef, DW_AT_name("uint16_t")
    5244                      .dwattr $C$DW$T$20, DW_AT_type(*$C$DW$T$9)
    5245                      .dwattr $C$DW$T$20, DW_AT_language(DW_LANG_C)
    5246              $C$DW$T$21      .dwtag  DW_TAG_typedef, DW_AT_name("uint_least16_t")
    5247                      .dwattr $C$DW$T$21, DW_AT_type(*$C$DW$T$20)
    5248                      .dwattr $C$DW$T$21, DW_AT_language(DW_LANG_C)
    5249              $C$DW$T$22      .dwtag  DW_TAG_typedef, DW_AT_name("uint_least8_t")
    5250                      .dwattr $C$DW$T$22, DW_AT_type(*$C$DW$T$20)
    5251                      .dwattr $C$DW$T$22, DW_AT_language(DW_LANG_C)
