TMS320C2000 Assembler PC v6.2.5 Tue Jun 27 16:21:07 2017

Tools Copyright (c) 1996-2014 Texas Instruments Incorporated
C:\Users\wmj\AppData\Local\Temp\0694810                              PAGE    1

       1              ;***************************************************************
       2              ;* TMS320C2000 C/C++ Codegen                         PC v6.2.5 *
       3              ;* Date/Time created: Tue Jun 27 16:21:07 2017                 *
       4              ;***************************************************************
       5                      .compiler_opts --float_support=softlib --hll_source=on --mem_model:code=flat --mem_model:data=large -
       6        0002  FP      .set    XAR2
       7              
       8              $C$DW$CU        .dwtag  DW_TAG_compile_unit
       9                      .dwattr $C$DW$CU, DW_AT_name("C:/ti/motorware/motorware_1_01_00_18/sw/solutions/instaspin_foc/src/pro
      10                      .dwattr $C$DW$CU, DW_AT_producer("TMS320C2000 C/C++ Codegen PC v6.2.5 Copyright (c) 1996-2014 Texas I
      11                      .dwattr $C$DW$CU, DW_AT_TI_version(0x01)
      12                      .dwattr $C$DW$CU, DW_AT_comp_dir("C:\ti\motorware\motorware_1_01_00_18\sw\solutions\instaspin_foc\boa
      13              ;**************************************************************
      14              ;* CINIT RECORDS                                              *

    2973              $C$DW$413       .dwtag  DW_TAG_enumerator, DW_AT_name("ADC_ResultNumber_11"), DW_AT_const_value(0x0b)
    2974              $C$DW$414       .dwtag  DW_TAG_enumerator, DW_AT_name("ADC_ResultNumber_12"), DW_AT_const_value(0x0c)
    2975              $C$DW$415       .dwtag  DW_TAG_enumerator, DW_AT_name("ADC_ResultNumber_13"), DW_AT_const_value(0x0d)
    2976              $C$DW$416       .dwtag  DW_TAG_enumerator, DW_AT_name("ADC_ResultNumber_14"), DW_AT_const_value(0x0e)
    2977              $C$DW$417       .dwtag  DW_TAG_enumerator, DW_AT_name("ADC_ResultNumber_15"), DW_AT_const_value(0x0f)
    2978                      .dwendtag $C$DW$T$176
    2979              
    2980              $C$DW$T$177     .dwtag  DW_TAG_typedef, DW_AT_name("ADC_ResultNumber_e")
    2981                      .dwattr $C$DW$T$177, DW_AT_type(*$C$DW$T$176)
    2982                      .dwattr $C$DW$T$177, DW_AT_language(DW_LANG_C)
    2983              
    2984              $C$DW$T$179     .dwtag  DW_TAG_enumeration_type
    2985                      .dwattr $C$DW$T$179, DW_AT_byte_size(0x01)
    2986              $C$DW$418       .dwtag  DW_TAG_enumerator, DW_AT_name("PIE_GroupNumber_1"), DW_AT_const_value(0x00)
    2987              $C$DW$419       .dwtag  DW_TAG_enumerator, DW_AT_name("PIE_GroupNumber_2"), DW_AT_const_value(0x01)
    2988              $C$DW$420       .dwtag  DW_TAG_enumerator, DW_AT_name("PIE_GroupNumber_3"), DW_AT_const_value(0x02)
    2989              $C$DW$421       .dwtag  DW_TAG_enumerator, DW_AT_name("PIE_GroupNumber_4"), DW_AT_const_value(0x03)
    2990              $C$DW$422       .dwtag  DW_TAG_enumerator, DW_AT_name("PIE_GroupNumber_5"), DW_AT_const_value(0x04)
    2991              $C$DW$423       .dwtag  DW_TAG_enumerator, DW_AT_name("PIE_GroupNumber_6"), DW_AT_const_value(0x05)
    2992              $C$DW$424       .dwtag  DW_TAG_enumerator, DW_AT_name("PIE_GroupNumber_7"), DW_AT_const_value(0x06)
    2993              $C$DW$425       .dwtag  DW_TAG_enumerator, DW_AT_name("PIE_GroupNumber_8"), DW_AT_const_value(0x07)
    2994              $C$DW$426       .dwtag  DW_TAG_enumerator, DW_AT_name("PIE_GroupNumber_9"), DW_AT_const_value(0x08)
    2995              $C$DW$427       .dwtag  DW_TAG_enumerator, DW_AT_name("PIE_GroupNumber_10"), DW_AT_const_value(0x09)
    2996              $C$DW$428       .dwtag  DW_TAG_enumerator, DW_AT_name("PIE_GroupNumber_11"), DW_AT_const_value(0x0a)
    2997              $C$DW$429       .dwtag  DW_TAG_enumerator, DW_AT_name("PIE_GroupNumber_12"), DW_AT_const_value(0x0b)
    2998                      .dwendtag $C$DW$T$179
    2999              
    3000              $C$DW$T$180     .dwtag  DW_TAG_typedef, DW_AT_name("PIE_GroupNumber_e")
    3001                      .dwattr $C$DW$T$180, DW_AT_type(*$C$DW$T$179)
    3002                      .dwattr $C$DW$T$180, DW_AT_language(DW_LANG_C)
    3003              
    3004              $C$DW$T$182     .dwtag  DW_TAG_enumeration_type
    3005                      .dwattr $C$DW$T$182, DW_AT_byte_size(0x01)
    3006              $C$DW$430       .dwtag  DW_TAG_enumerator, DW_AT_name("CTRL_Type_PID_spd"), DW_AT_const_value(0x00)
    3007              $C$DW$431       .dwtag  DW_TAG_enumerator, DW_AT_name("CTRL_Type_PID_Id"), DW_AT_const_value(0x01)
    3008              $C$DW$432       .dwtag  DW_TAG_enumerator, DW_AT_name("CTRL_Type_PID_Iq"), DW_AT_const_value(0x02)
    3009                      .dwendtag $C$DW$T$182
    3010              
    3011              $C$DW$T$183     .dwtag  DW_TAG_typedef, DW_AT_name("CTRL_Type_e")
    3012                      .dwattr $C$DW$T$183, DW_AT_type(*$C$DW$T$182)
    3013                      .dwattr $C$DW$T$183, DW_AT_language(DW_LANG_C)
    3014              
    3015              $C$DW$T$185     .dwtag  DW_TAG_enumeration_type
TMS320C2000 Assembler PC v6.2.5 Tue Jun 27 16:21:07 2017

Tools Copyright (c) 1996-2014 Texas Instruments Incorporated
C:\Users\wmj\AppData\Local\Temp\0694810                              PAGE   61

    3016                      .dwattr $C$DW$T$185, DW_AT_byte_size(0x01)
    3017              $C$DW$433       .dwtag  DW_TAG_enumerator, DW_AT_name("HAL_SensorType_Current"), DW_AT_const_value(0x00)
    3018              $C$DW$434       .dwtag  DW_TAG_enumerator, DW_AT_name("HAL_SensorType_Voltage"), DW_AT_const_value(0x01)
    3019                      .dwendtag $C$DW$T$185
    3020              
    3021              $C$DW$T$186     .dwtag  DW_TAG_typedef, DW_AT_name("HAL_SensorType_e")
    3022                      .dwattr $C$DW$T$186, DW_AT_type(*$C$DW$T$185)
    3023                      .dwattr $C$DW$T$186, DW_AT_language(DW_LANG_C)
    3024              
    3025              $C$DW$T$19      .dwtag  DW_TAG_structure_type
    3026                      .dwattr $C$DW$T$19, DW_AT_name("I2C_Obj")
    3027                      .dwattr $C$DW$T$19, DW_AT_declaration
    3028                      .dwendtag $C$DW$T$19
    3029              
    3030              $C$DW$T$112     .dwtag  DW_TAG_pointer_type
    3031                      .dwattr $C$DW$T$112, DW_AT_type(*$C$DW$T$19)
    3032                      .dwattr $C$DW$T$112, DW_AT_address_class(0x16)
    3033              $C$DW$T$113     .dwtag  DW_TAG_typedef, DW_AT_name("I2C_Handle")
    3034                      .dwattr $C$DW$T$113, DW_AT_type(*$C$DW$T$112)
    3035                      .dwattr $C$DW$T$113, DW_AT_language(DW_LANG_C)
    3036              
    3037              $C$DW$T$31      .dwtag  DW_TAG_structure_type
    3038                      .dwattr $C$DW$T$31, DW_AT_name("_ADC_Obj_")
    3039                      .dwattr $C$DW$T$31, DW_AT_byte_size(0x6650)
    3040              $C$DW$435       .dwtag  DW_TAG_member
    3041                      .dwattr $C$DW$435, DW_AT_type(*$C$DW$T$25)
    3042                      .dwattr $C$DW$435, DW_AT_name("ADCRESULT")
    3043                      .dwattr $C$DW$435, DW_AT_TI_symbol_name("_ADCRESULT")
    3044                      .dwattr $C$DW$435, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    3045                      .dwattr $C$DW$435, DW_AT_accessibility(DW_ACCESS_public)
    3046              $C$DW$436       .dwtag  DW_TAG_member
    3047                      .dwattr $C$DW$436, DW_AT_type(*$C$DW$T$26)
    3048                      .dwattr $C$DW$436, DW_AT_name("resvd_1")
    3049                      .dwattr $C$DW$436, DW_AT_TI_symbol_name("_resvd_1")
    3050                      .dwattr $C$DW$436, DW_AT_data_member_location[DW_OP_plus_uconst 0x10]
    3051                      .dwattr $C$DW$436, DW_AT_accessibility(DW_ACCESS_public)
    3052              $C$DW$437       .dwtag  DW_TAG_member
    3053                      .dwattr $C$DW$437, DW_AT_type(*$C$DW$T$24)
    3054                      .dwattr $C$DW$437, DW_AT_name("ADCCTL1")
    3055                      .dwattr $C$DW$437, DW_AT_TI_symbol_name("_ADCCTL1")
    3056                      .dwattr $C$DW$437, DW_AT_data_member_location[DW_OP_plus_uconst 0x6600]
    3057                      .dwattr $C$DW$437, DW_AT_accessibility(DW_ACCESS_public)
    3058              $C$DW$438       .dwtag  DW_TAG_member
    3059                      .dwattr $C$DW$438, DW_AT_type(*$C$DW$T$24)
    3060                      .dwattr $C$DW$438, DW_AT_name("ADCCTL2")
    3061                      .dwattr $C$DW$438, DW_AT_TI_symbol_name("_ADCCTL2")
    3062                      .dwattr $C$DW$438, DW_AT_data_member_location[DW_OP_plus_uconst 0x6601]
    3063                      .dwattr $C$DW$438, DW_AT_accessibility(DW_ACCESS_public)
    3064              $C$DW$439       .dwtag  DW_TAG_member
    3065                      .dwattr $C$DW$439, DW_AT_type(*$C$DW$T$27)
    3066                      .dwattr $C$DW$439, DW_AT_name("rsvd_2")
    3067                      .dwattr $C$DW$439, DW_AT_TI_symbol_name("_rsvd_2")
    3068                      .dwattr $C$DW$439, DW_AT_data_member_location[DW_OP_plus_uconst 0x6602]
    3069                      .dwattr $C$DW$439, DW_AT_accessibility(DW_ACCESS_public)
    3070              $C$DW$440       .dwtag  DW_TAG_member
TMS320C2000 Assembler PC v6.2.5 Tue Jun 27 16:21:07 2017

Tools Copyright (c) 1996-2014 Texas Instruments Incorporated
C:\Users\wmj\AppData\Local\Temp\0694810                              PAGE   62

    3071                      .dwattr $C$DW$440, DW_AT_type(*$C$DW$T$24)
    3072                      .dwattr $C$DW$440, DW_AT_name("ADCINTFLG")
    3073                      .dwattr $C$DW$440, DW_AT_TI_symbol_name("_ADCINTFLG")
    3074                      .dwattr $C$DW$440, DW_AT_data_member_location[DW_OP_plus_uconst 0x6604]
    3075                      .dwattr $C$DW$440, DW_AT_accessibility(DW_ACCESS_public)
    3076              $C$DW$441       .dwtag  DW_TAG_member
    3077                      .dwattr $C$DW$441, DW_AT_type(*$C$DW$T$24)
    3078                      .dwattr $C$DW$441, DW_AT_name("ADCINTFLGCLR")
    3079                      .dwattr $C$DW$441, DW_AT_TI_symbol_name("_ADCINTFLGCLR")
    3080                      .dwattr $C$DW$441, DW_AT_data_member_location[DW_OP_plus_uconst 0x6605]
    3081                      .dwattr $C$DW$441, DW_AT_accessibility(DW_ACCESS_public)
    3082              $C$DW$442       .dwtag  DW_TAG_member
    3083                      .dwattr $C$DW$442, DW_AT_type(*$C$DW$T$24)
    3084                      .dwattr $C$DW$442, DW_AT_name("ADCINTOVF")
    3085                      .dwattr $C$DW$442, DW_AT_TI_symbol_name("_ADCINTOVF")
    3086                      .dwattr $C$DW$442, DW_AT_data_member_location[DW_OP_plus_uconst 0x6606]
    3087                      .dwattr $C$DW$442, DW_AT_accessibility(DW_ACCESS_public)
    3088              $C$DW$443       .dwtag  DW_TAG_member
    3089                      .dwattr $C$DW$443, DW_AT_type(*$C$DW$T$24)
    3090                      .dwattr $C$DW$443, DW_AT_name("ADCINTOVFCLR")
    3091                      .dwattr $C$DW$443, DW_AT_TI_symbol_name("_ADCINTOVFCLR")
    3092                      .dwattr $C$DW$443, DW_AT_data_member_location[DW_OP_plus_uconst 0x6607]
    3093                      .dwattr $C$DW$443, DW_AT_accessibility(DW_ACCESS_public)
    3094              $C$DW$444       .dwtag  DW_TAG_member
    3095                      .dwattr $C$DW$444, DW_AT_type(*$C$DW$T$28)
    3096                      .dwattr $C$DW$444, DW_AT_name("INTSELxNy")
    3097                      .dwattr $C$DW$444, DW_AT_TI_symbol_name("_INTSELxNy")
    3098                      .dwattr $C$DW$444, DW_AT_data_member_location[DW_OP_plus_uconst 0x6608]
    3099                      .dwattr $C$DW$444, DW_AT_accessibility(DW_ACCESS_public)
    3100              $C$DW$445       .dwtag  DW_TAG_member
    3101                      .dwattr $C$DW$445, DW_AT_type(*$C$DW$T$29)
    3102                      .dwattr $C$DW$445, DW_AT_name("rsvd_3")
    3103                      .dwattr $C$DW$445, DW_AT_TI_symbol_name("_rsvd_3")
    3104                      .dwattr $C$DW$445, DW_AT_data_member_location[DW_OP_plus_uconst 0x660d]
    3105                      .dwattr $C$DW$445, DW_AT_accessibility(DW_ACCESS_public)
    3106              $C$DW$446       .dwtag  DW_TAG_member
    3107                      .dwattr $C$DW$446, DW_AT_type(*$C$DW$T$24)
    3108                      .dwattr $C$DW$446, DW_AT_name("SOCPRICTRL")
    3109                      .dwattr $C$DW$446, DW_AT_TI_symbol_name("_SOCPRICTRL")
    3110                      .dwattr $C$DW$446, DW_AT_data_member_location[DW_OP_plus_uconst 0x6610]
    3111                      .dwattr $C$DW$446, DW_AT_accessibility(DW_ACCESS_public)
    3112              $C$DW$447       .dwtag  DW_TAG_member
    3113                      .dwattr $C$DW$447, DW_AT_type(*$C$DW$T$24)
    3114                      .dwattr $C$DW$447, DW_AT_name("rsvd_4")
    3115                      .dwattr $C$DW$447, DW_AT_TI_symbol_name("_rsvd_4")
    3116                      .dwattr $C$DW$447, DW_AT_data_member_location[DW_OP_plus_uconst 0x6611]
    3117                      .dwattr $C$DW$447, DW_AT_accessibility(DW_ACCESS_public)
    3118              $C$DW$448       .dwtag  DW_TAG_member
    3119                      .dwattr $C$DW$448, DW_AT_type(*$C$DW$T$24)
    3120                      .dwattr $C$DW$448, DW_AT_name("ADCSAMPLEMODE")
    3121                      .dwattr $C$DW$448, DW_AT_TI_symbol_name("_ADCSAMPLEMODE")
    3122                      .dwattr $C$DW$448, DW_AT_data_member_location[DW_OP_plus_uconst 0x6612]
    3123                      .dwattr $C$DW$448, DW_AT_accessibility(DW_ACCESS_public)
    3124              $C$DW$449       .dwtag  DW_TAG_member
    3125                      .dwattr $C$DW$449, DW_AT_type(*$C$DW$T$24)
TMS320C2000 Assembler PC v6.2.5 Tue Jun 27 16:21:07 2017

Tools Copyright (c) 1996-2014 Texas Instruments Incorporated
C:\Users\wmj\AppData\Local\Temp\0694810                              PAGE   63

    3126                      .dwattr $C$DW$449, DW_AT_name("rsvd_5")
    3127                      .dwattr $C$DW$449, DW_AT_TI_symbol_name("_rsvd_5")
    3128                      .dwattr $C$DW$449, DW_AT_data_member_location[DW_OP_plus_uconst 0x6613]
    3129                      .dwattr $C$DW$449, DW_AT_accessibility(DW_ACCESS_public)
    3130              $C$DW$450       .dwtag  DW_TAG_member
    3131                      .dwattr $C$DW$450, DW_AT_type(*$C$DW$T$24)
    3132                      .dwattr $C$DW$450, DW_AT_name("ADCINTSOCSEL1")
    3133                      .dwattr $C$DW$450, DW_AT_TI_symbol_name("_ADCINTSOCSEL1")
    3134                      .dwattr $C$DW$450, DW_AT_data_member_location[DW_OP_plus_uconst 0x6614]
    3135                      .dwattr $C$DW$450, DW_AT_accessibility(DW_ACCESS_public)
    3136              $C$DW$451       .dwtag  DW_TAG_member
    3137                      .dwattr $C$DW$451, DW_AT_type(*$C$DW$T$24)
    3138                      .dwattr $C$DW$451, DW_AT_name("ADCINTSOCSEL2")
    3139                      .dwattr $C$DW$451, DW_AT_TI_symbol_name("_ADCINTSOCSEL2")
    3140                      .dwattr $C$DW$451, DW_AT_data_member_location[DW_OP_plus_uconst 0x6615]
    3141                      .dwattr $C$DW$451, DW_AT_accessibility(DW_ACCESS_public)
    3142              $C$DW$452       .dwtag  DW_TAG_member
    3143                      .dwattr $C$DW$452, DW_AT_type(*$C$DW$T$27)
    3144                      .dwattr $C$DW$452, DW_AT_name("rsvd_6")
    3145                      .dwattr $C$DW$452, DW_AT_TI_symbol_name("_rsvd_6")
    3146                      .dwattr $C$DW$452, DW_AT_data_member_location[DW_OP_plus_uconst 0x6616]
    3147                      .dwattr $C$DW$452, DW_AT_accessibility(DW_ACCESS_public)
    3148              $C$DW$453       .dwtag  DW_TAG_member
    3149                      .dwattr $C$DW$453, DW_AT_type(*$C$DW$T$24)
    3150                      .dwattr $C$DW$453, DW_AT_name("ADCSOCFLG1")
    3151                      .dwattr $C$DW$453, DW_AT_TI_symbol_name("_ADCSOCFLG1")
    3152                      .dwattr $C$DW$453, DW_AT_data_member_location[DW_OP_plus_uconst 0x6618]
    3153                      .dwattr $C$DW$453, DW_AT_accessibility(DW_ACCESS_public)
    3154              $C$DW$454       .dwtag  DW_TAG_member
    3155                      .dwattr $C$DW$454, DW_AT_type(*$C$DW$T$24)
    3156                      .dwattr $C$DW$454, DW_AT_name("rsvd_7")
    3157                      .dwattr $C$DW$454, DW_AT_TI_symbol_name("_rsvd_7")
    3158                      .dwattr $C$DW$454, DW_AT_data_member_location[DW_OP_plus_uconst 0x6619]
    3159                      .dwattr $C$DW$454, DW_AT_accessibility(DW_ACCESS_public)
    3160              $C$DW$455       .dwtag  DW_TAG_member
    3161                      .dwattr $C$DW$455, DW_AT_type(*$C$DW$T$24)
    3162                      .dwattr $C$DW$455, DW_AT_name("ADCSOCFRC1")
    3163                      .dwattr $C$DW$455, DW_AT_TI_symbol_name("_ADCSOCFRC1")
    3164                      .dwattr $C$DW$455, DW_AT_data_member_location[DW_OP_plus_uconst 0x661a]
    3165                      .dwattr $C$DW$455, DW_AT_accessibility(DW_ACCESS_public)
    3166              $C$DW$456       .dwtag  DW_TAG_member
    3167                      .dwattr $C$DW$456, DW_AT_type(*$C$DW$T$24)
    3168                      .dwattr $C$DW$456, DW_AT_name("rsvd_8")
    3169                      .dwattr $C$DW$456, DW_AT_TI_symbol_name("_rsvd_8")
    3170                      .dwattr $C$DW$456, DW_AT_data_member_location[DW_OP_plus_uconst 0x661b]
    3171                      .dwattr $C$DW$456, DW_AT_accessibility(DW_ACCESS_public)
    3172              $C$DW$457       .dwtag  DW_TAG_member
    3173                      .dwattr $C$DW$457, DW_AT_type(*$C$DW$T$24)
    3174                      .dwattr $C$DW$457, DW_AT_name("ADCSOCOVF1")
    3175                      .dwattr $C$DW$457, DW_AT_TI_symbol_name("_ADCSOCOVF1")
    3176                      .dwattr $C$DW$457, DW_AT_data_member_location[DW_OP_plus_uconst 0x661c]
    3177                      .dwattr $C$DW$457, DW_AT_accessibility(DW_ACCESS_public)
    3178              $C$DW$458       .dwtag  DW_TAG_member
    3179                      .dwattr $C$DW$458, DW_AT_type(*$C$DW$T$24)
    3180                      .dwattr $C$DW$458, DW_AT_name("rsvd_9")
TMS320C2000 Assembler PC v6.2.5 Tue Jun 27 16:21:07 2017

Tools Copyright (c) 1996-2014 Texas Instruments Incorporated
C:\Users\wmj\AppData\Local\Temp\0694810                              PAGE   64

    3181                      .dwattr $C$DW$458, DW_AT_TI_symbol_name("_rsvd_9")
    3182                      .dwattr $C$DW$458, DW_AT_data_member_location[DW_OP_plus_uconst 0x661d]
    3183                      .dwattr $C$DW$458, DW_AT_accessibility(DW_ACCESS_public)
    3184              $C$DW$459       .dwtag  DW_TAG_member
    3185                      .dwattr $C$DW$459, DW_AT_type(*$C$DW$T$24)
    3186                      .dwattr $C$DW$459, DW_AT_name("ADCSOCOVFCLR1")
    3187                      .dwattr $C$DW$459, DW_AT_TI_symbol_name("_ADCSOCOVFCLR1")
    3188                      .dwattr $C$DW$459, DW_AT_data_member_location[DW_OP_plus_uconst 0x661e]
    3189                      .dwattr $C$DW$459, DW_AT_accessibility(DW_ACCESS_public)
    3190              $C$DW$460       .dwtag  DW_TAG_member
    3191                      .dwattr $C$DW$460, DW_AT_type(*$C$DW$T$24)
    3192                      .dwattr $C$DW$460, DW_AT_name("rsvd_10")
    3193                      .dwattr $C$DW$460, DW_AT_TI_symbol_name("_rsvd_10")
    3194                      .dwattr $C$DW$460, DW_AT_data_member_location[DW_OP_plus_uconst 0x661f]
    3195                      .dwattr $C$DW$460, DW_AT_accessibility(DW_ACCESS_public)
    3196              $C$DW$461       .dwtag  DW_TAG_member
    3197                      .dwattr $C$DW$461, DW_AT_type(*$C$DW$T$25)
    3198                      .dwattr $C$DW$461, DW_AT_name("ADCSOCxCTL")
    3199                      .dwattr $C$DW$461, DW_AT_TI_symbol_name("_ADCSOCxCTL")
    3200                      .dwattr $C$DW$461, DW_AT_data_member_location[DW_OP_plus_uconst 0x6620]
    3201                      .dwattr $C$DW$461, DW_AT_accessibility(DW_ACCESS_public)
    3202              $C$DW$462       .dwtag  DW_TAG_member
    3203                      .dwattr $C$DW$462, DW_AT_type(*$C$DW$T$25)
    3204                      .dwattr $C$DW$462, DW_AT_name("rsvd_11")
    3205                      .dwattr $C$DW$462, DW_AT_TI_symbol_name("_rsvd_11")
    3206                      .dwattr $C$DW$462, DW_AT_data_member_location[DW_OP_plus_uconst 0x6630]
    3207                      .dwattr $C$DW$462, DW_AT_accessibility(DW_ACCESS_public)
    3208              $C$DW$463       .dwtag  DW_TAG_member
    3209                      .dwattr $C$DW$463, DW_AT_type(*$C$DW$T$24)
    3210                      .dwattr $C$DW$463, DW_AT_name("ADCREFTRIM")
    3211                      .dwattr $C$DW$463, DW_AT_TI_symbol_name("_ADCREFTRIM")
    3212                      .dwattr $C$DW$463, DW_AT_data_member_location[DW_OP_plus_uconst 0x6640]
    3213                      .dwattr $C$DW$463, DW_AT_accessibility(DW_ACCESS_public)
    3214              $C$DW$464       .dwtag  DW_TAG_member
    3215                      .dwattr $C$DW$464, DW_AT_type(*$C$DW$T$24)
    3216                      .dwattr $C$DW$464, DW_AT_name("ADCOFFTRIM")
    3217                      .dwattr $C$DW$464, DW_AT_TI_symbol_name("_ADCOFFTRIM")
    3218                      .dwattr $C$DW$464, DW_AT_data_member_location[DW_OP_plus_uconst 0x6641]
    3219                      .dwattr $C$DW$464, DW_AT_accessibility(DW_ACCESS_public)
    3220              $C$DW$465       .dwtag  DW_TAG_member
    3221                      .dwattr $C$DW$465, DW_AT_type(*$C$DW$T$30)
    3222                      .dwattr $C$DW$465, DW_AT_name("resvd_12")
    3223                      .dwattr $C$DW$465, DW_AT_TI_symbol_name("_resvd_12")
    3224                      .dwattr $C$DW$465, DW_AT_data_member_location[DW_OP_plus_uconst 0x6642]
    3225                      .dwattr $C$DW$465, DW_AT_accessibility(DW_ACCESS_public)
    3226              $C$DW$466       .dwtag  DW_TAG_member
    3227                      .dwattr $C$DW$466, DW_AT_type(*$C$DW$T$24)
    3228                      .dwattr $C$DW$466, DW_AT_name("ADCREV")
    3229                      .dwattr $C$DW$466, DW_AT_TI_symbol_name("_ADCREV")
    3230                      .dwattr $C$DW$466, DW_AT_data_member_location[DW_OP_plus_uconst 0x664f]
    3231                      .dwattr $C$DW$466, DW_AT_accessibility(DW_ACCESS_public)
    3232                      .dwendtag $C$DW$T$31
    3233              
    3234              $C$DW$T$188     .dwtag  DW_TAG_typedef, DW_AT_name("ADC_Obj")
    3235                      .dwattr $C$DW$T$188, DW_AT_type(*$C$DW$T$31)
TMS320C2000 Assembler PC v6.2.5 Tue Jun 27 16:21:07 2017

Tools Copyright (c) 1996-2014 Texas Instruments Incorporated
C:\Users\wmj\AppData\Local\Temp\0694810                              PAGE   65

    3236                      .dwattr $C$DW$T$188, DW_AT_language(DW_LANG_C)
    3237              $C$DW$T$83      .dwtag  DW_TAG_pointer_type
    3238                      .dwattr $C$DW$T$83, DW_AT_type(*$C$DW$T$31)
    3239                      .dwattr $C$DW$T$83, DW_AT_address_class(0x16)
    3240              $C$DW$T$84      .dwtag  DW_TAG_typedef, DW_AT_name("ADC_Handle")
    3241                      .dwattr $C$DW$T$84, DW_AT_type(*$C$DW$T$83)
    3242                      .dwattr $C$DW$T$84, DW_AT_language(DW_LANG_C)
    3243              
    3244              $C$DW$T$34      .dwtag  DW_TAG_structure_type
    3245                      .dwattr $C$DW$T$34, DW_AT_name("_CLARKE_Obj_")
    3246                      .dwattr $C$DW$T$34, DW_AT_byte_size(0x06)
    3247              $C$DW$467       .dwtag  DW_TAG_member
    3248                      .dwattr $C$DW$467, DW_AT_type(*$C$DW$T$32)
    3249                      .dwattr $C$DW$467, DW_AT_name("alpha_sf")
    3250                      .dwattr $C$DW$467, DW_AT_TI_symbol_name("_alpha_sf")
    3251                      .dwattr $C$DW$467, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    3252                      .dwattr $C$DW$467, DW_AT_accessibility(DW_ACCESS_public)
    3253              $C$DW$468       .dwtag  DW_TAG_member
    3254                      .dwattr $C$DW$468, DW_AT_type(*$C$DW$T$32)
    3255                      .dwattr $C$DW$468, DW_AT_name("beta_sf")
    3256                      .dwattr $C$DW$468, DW_AT_TI_symbol_name("_beta_sf")
    3257                      .dwattr $C$DW$468, DW_AT_data_member_location[DW_OP_plus_uconst 0x2]
    3258                      .dwattr $C$DW$468, DW_AT_accessibility(DW_ACCESS_public)
    3259              $C$DW$469       .dwtag  DW_TAG_member
    3260                      .dwattr $C$DW$469, DW_AT_type(*$C$DW$T$33)
    3261                      .dwattr $C$DW$469, DW_AT_name("numSensors")
    3262                      .dwattr $C$DW$469, DW_AT_TI_symbol_name("_numSensors")
    3263                      .dwattr $C$DW$469, DW_AT_data_member_location[DW_OP_plus_uconst 0x4]
    3264                      .dwattr $C$DW$469, DW_AT_accessibility(DW_ACCESS_public)
    3265                      .dwendtag $C$DW$T$34
    3266              
    3267              $C$DW$T$45      .dwtag  DW_TAG_typedef, DW_AT_name("CLARKE_Obj")
    3268                      .dwattr $C$DW$T$45, DW_AT_type(*$C$DW$T$34)
    3269                      .dwattr $C$DW$T$45, DW_AT_language(DW_LANG_C)
    3270              $C$DW$T$43      .dwtag  DW_TAG_pointer_type
    3271                      .dwattr $C$DW$T$43, DW_AT_type(*$C$DW$T$34)
    3272                      .dwattr $C$DW$T$43, DW_AT_address_class(0x16)
    3273              $C$DW$T$44      .dwtag  DW_TAG_typedef, DW_AT_name("CLARKE_Handle")
    3274                      .dwattr $C$DW$T$44, DW_AT_type(*$C$DW$T$43)
    3275                      .dwattr $C$DW$T$44, DW_AT_language(DW_LANG_C)
    3276              
    3277              $C$DW$T$36      .dwtag  DW_TAG_structure_type
    3278                      .dwattr $C$DW$T$36, DW_AT_name("_CLK_Obj_")
    3279                      .dwattr $C$DW$T$36, DW_AT_byte_size(0x11)
    3280              $C$DW$470       .dwtag  DW_TAG_member
    3281                      .dwattr $C$DW$470, DW_AT_type(*$C$DW$T$24)
    3282                      .dwattr $C$DW$470, DW_AT_name("XCLK")
    3283                      .dwattr $C$DW$470, DW_AT_TI_symbol_name("_XCLK")
    3284                      .dwattr $C$DW$470, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    3285                      .dwattr $C$DW$470, DW_AT_accessibility(DW_ACCESS_public)
    3286              $C$DW$471       .dwtag  DW_TAG_member
    3287                      .dwattr $C$DW$471, DW_AT_type(*$C$DW$T$24)
    3288                      .dwattr $C$DW$471, DW_AT_name("rsvd_1")
    3289                      .dwattr $C$DW$471, DW_AT_TI_symbol_name("_rsvd_1")
    3290                      .dwattr $C$DW$471, DW_AT_data_member_location[DW_OP_plus_uconst 0x1]
TMS320C2000 Assembler PC v6.2.5 Tue Jun 27 16:21:07 2017

Tools Copyright (c) 1996-2014 Texas Instruments Incorporated
C:\Users\wmj\AppData\Local\Temp\0694810                              PAGE   66

    3291                      .dwattr $C$DW$471, DW_AT_accessibility(DW_ACCESS_public)
    3292              $C$DW$472       .dwtag  DW_TAG_member
    3293                      .dwattr $C$DW$472, DW_AT_type(*$C$DW$T$24)
    3294                      .dwattr $C$DW$472, DW_AT_name("CLKCTL")
    3295                      .dwattr $C$DW$472, DW_AT_TI_symbol_name("_CLKCTL")
    3296                      .dwattr $C$DW$472, DW_AT_data_member_location[DW_OP_plus_uconst 0x2]
    3297                      .dwattr $C$DW$472, DW_AT_accessibility(DW_ACCESS_public)
    3298              $C$DW$473       .dwtag  DW_TAG_member
    3299                      .dwattr $C$DW$473, DW_AT_type(*$C$DW$T$35)
    3300                      .dwattr $C$DW$473, DW_AT_name("rsvd_2")
    3301                      .dwattr $C$DW$473, DW_AT_TI_symbol_name("_rsvd_2")
    3302                      .dwattr $C$DW$473, DW_AT_data_member_location[DW_OP_plus_uconst 0x3]
    3303                      .dwattr $C$DW$473, DW_AT_accessibility(DW_ACCESS_public)
    3304              $C$DW$474       .dwtag  DW_TAG_member
    3305                      .dwattr $C$DW$474, DW_AT_type(*$C$DW$T$24)
    3306                      .dwattr $C$DW$474, DW_AT_name("LOSPCP")
    3307                      .dwattr $C$DW$474, DW_AT_TI_symbol_name("_LOSPCP")
    3308                      .dwattr $C$DW$474, DW_AT_data_member_location[DW_OP_plus_uconst 0xb]
    3309                      .dwattr $C$DW$474, DW_AT_accessibility(DW_ACCESS_public)
    3310              $C$DW$475       .dwtag  DW_TAG_member
    3311                      .dwattr $C$DW$475, DW_AT_type(*$C$DW$T$24)
    3312                      .dwattr $C$DW$475, DW_AT_name("PCLKCR0")
    3313                      .dwattr $C$DW$475, DW_AT_TI_symbol_name("_PCLKCR0")
    3314                      .dwattr $C$DW$475, DW_AT_data_member_location[DW_OP_plus_uconst 0xc]
    3315                      .dwattr $C$DW$475, DW_AT_accessibility(DW_ACCESS_public)
    3316              $C$DW$476       .dwtag  DW_TAG_member
    3317                      .dwattr $C$DW$476, DW_AT_type(*$C$DW$T$24)
    3318                      .dwattr $C$DW$476, DW_AT_name("PCLKCR1")
    3319                      .dwattr $C$DW$476, DW_AT_TI_symbol_name("_PCLKCR1")
    3320                      .dwattr $C$DW$476, DW_AT_data_member_location[DW_OP_plus_uconst 0xd]
    3321                      .dwattr $C$DW$476, DW_AT_accessibility(DW_ACCESS_public)
    3322              $C$DW$477       .dwtag  DW_TAG_member
    3323                      .dwattr $C$DW$477, DW_AT_type(*$C$DW$T$27)
    3324                      .dwattr $C$DW$477, DW_AT_name("rsvd_3")
    3325                      .dwattr $C$DW$477, DW_AT_TI_symbol_name("_rsvd_3")
    3326                      .dwattr $C$DW$477, DW_AT_data_member_location[DW_OP_plus_uconst 0xe]
    3327                      .dwattr $C$DW$477, DW_AT_accessibility(DW_ACCESS_public)
    3328              $C$DW$478       .dwtag  DW_TAG_member
    3329                      .dwattr $C$DW$478, DW_AT_type(*$C$DW$T$24)
    3330                      .dwattr $C$DW$478, DW_AT_name("PCLKCR3")
    3331                      .dwattr $C$DW$478, DW_AT_TI_symbol_name("_PCLKCR3")
    3332                      .dwattr $C$DW$478, DW_AT_data_member_location[DW_OP_plus_uconst 0x10]
    3333                      .dwattr $C$DW$478, DW_AT_accessibility(DW_ACCESS_public)
    3334                      .dwendtag $C$DW$T$36
    3335              
    3336              $C$DW$T$85      .dwtag  DW_TAG_pointer_type
    3337                      .dwattr $C$DW$T$85, DW_AT_type(*$C$DW$T$36)
    3338                      .dwattr $C$DW$T$85, DW_AT_address_class(0x16)
    3339              $C$DW$T$86      .dwtag  DW_TAG_typedef, DW_AT_name("CLK_Handle")
    3340                      .dwattr $C$DW$T$86, DW_AT_type(*$C$DW$T$85)
    3341                      .dwattr $C$DW$T$86, DW_AT_language(DW_LANG_C)
    3342              
    3343              $C$DW$T$37      .dwtag  DW_TAG_structure_type
    3344                      .dwattr $C$DW$T$37, DW_AT_name("_CPU_Obj_")
    3345                      .dwattr $C$DW$T$37, DW_AT_byte_size(0x01)
TMS320C2000 Assembler PC v6.2.5 Tue Jun 27 16:21:07 2017

Tools Copyright (c) 1996-2014 Texas Instruments Incorporated
C:\Users\wmj\AppData\Local\Temp\0694810                              PAGE   67

    3346              $C$DW$479       .dwtag  DW_TAG_member
    3347                      .dwattr $C$DW$479, DW_AT_type(*$C$DW$T$33)
    3348                      .dwattr $C$DW$479, DW_AT_name("tmp")
    3349                      .dwattr $C$DW$479, DW_AT_TI_symbol_name("_tmp")
    3350                      .dwattr $C$DW$479, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    3351                      .dwattr $C$DW$479, DW_AT_accessibility(DW_ACCESS_public)
    3352                      .dwendtag $C$DW$T$37
    3353              
    3354              $C$DW$T$87      .dwtag  DW_TAG_pointer_type
    3355                      .dwattr $C$DW$T$87, DW_AT_type(*$C$DW$T$37)
    3356                      .dwattr $C$DW$T$87, DW_AT_address_class(0x16)
    3357              $C$DW$T$88      .dwtag  DW_TAG_typedef, DW_AT_name("CPU_Handle")
    3358                      .dwattr $C$DW$T$88, DW_AT_type(*$C$DW$T$87)
    3359                      .dwattr $C$DW$T$88, DW_AT_language(DW_LANG_C)
    3360              
    3361              $C$DW$T$71      .dwtag  DW_TAG_structure_type
    3362                      .dwattr $C$DW$T$71, DW_AT_name("_CTRL_Obj_")
    3363                      .dwattr $C$DW$T$71, DW_AT_byte_size(0x108)
    3364              $C$DW$480       .dwtag  DW_TAG_member
    3365                      .dwattr $C$DW$480, DW_AT_type(*$C$DW$T$38)
    3366                      .dwattr $C$DW$480, DW_AT_name("version")
    3367                      .dwattr $C$DW$480, DW_AT_TI_symbol_name("_version")
    3368                      .dwattr $C$DW$480, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    3369                      .dwattr $C$DW$480, DW_AT_accessibility(DW_ACCESS_public)
    3370              $C$DW$481       .dwtag  DW_TAG_member
    3371                      .dwattr $C$DW$481, DW_AT_type(*$C$DW$T$40)
    3372                      .dwattr $C$DW$481, DW_AT_name("state")
    3373                      .dwattr $C$DW$481, DW_AT_TI_symbol_name("_state")
    3374                      .dwattr $C$DW$481, DW_AT_data_member_location[DW_OP_plus_uconst 0x4]
    3375                      .dwattr $C$DW$481, DW_AT_accessibility(DW_ACCESS_public)
    3376              $C$DW$482       .dwtag  DW_TAG_member
    3377                      .dwattr $C$DW$482, DW_AT_type(*$C$DW$T$40)
    3378                      .dwattr $C$DW$482, DW_AT_name("prevState")
    3379                      .dwattr $C$DW$482, DW_AT_TI_symbol_name("_prevState")
    3380                      .dwattr $C$DW$482, DW_AT_data_member_location[DW_OP_plus_uconst 0x5]
    3381                      .dwattr $C$DW$482, DW_AT_accessibility(DW_ACCESS_public)
    3382              $C$DW$483       .dwtag  DW_TAG_member
    3383                      .dwattr $C$DW$483, DW_AT_type(*$C$DW$T$42)
    3384                      .dwattr $C$DW$483, DW_AT_name("errorCode")
    3385                      .dwattr $C$DW$483, DW_AT_TI_symbol_name("_errorCode")
    3386                      .dwattr $C$DW$483, DW_AT_data_member_location[DW_OP_plus_uconst 0x6]
    3387                      .dwattr $C$DW$483, DW_AT_accessibility(DW_ACCESS_public)
    3388              $C$DW$484       .dwtag  DW_TAG_member
    3389                      .dwattr $C$DW$484, DW_AT_type(*$C$DW$T$44)
    3390                      .dwattr $C$DW$484, DW_AT_name("clarkeHandle_I")
    3391                      .dwattr $C$DW$484, DW_AT_TI_symbol_name("_clarkeHandle_I")
    3392                      .dwattr $C$DW$484, DW_AT_data_member_location[DW_OP_plus_uconst 0x8]
    3393                      .dwattr $C$DW$484, DW_AT_accessibility(DW_ACCESS_public)
    3394              $C$DW$485       .dwtag  DW_TAG_member
    3395                      .dwattr $C$DW$485, DW_AT_type(*$C$DW$T$45)
    3396                      .dwattr $C$DW$485, DW_AT_name("clarke_I")
    3397                      .dwattr $C$DW$485, DW_AT_TI_symbol_name("_clarke_I")
    3398                      .dwattr $C$DW$485, DW_AT_data_member_location[DW_OP_plus_uconst 0xa]
    3399                      .dwattr $C$DW$485, DW_AT_accessibility(DW_ACCESS_public)
    3400              $C$DW$486       .dwtag  DW_TAG_member
TMS320C2000 Assembler PC v6.2.5 Tue Jun 27 16:21:07 2017

Tools Copyright (c) 1996-2014 Texas Instruments Incorporated
C:\Users\wmj\AppData\Local\Temp\0694810                              PAGE   68

    3401                      .dwattr $C$DW$486, DW_AT_type(*$C$DW$T$44)
    3402                      .dwattr $C$DW$486, DW_AT_name("clarkeHandle_V")
    3403                      .dwattr $C$DW$486, DW_AT_TI_symbol_name("_clarkeHandle_V")
    3404                      .dwattr $C$DW$486, DW_AT_data_member_location[DW_OP_plus_uconst 0x10]
    3405                      .dwattr $C$DW$486, DW_AT_accessibility(DW_ACCESS_public)
    3406              $C$DW$487       .dwtag  DW_TAG_member
    3407                      .dwattr $C$DW$487, DW_AT_type(*$C$DW$T$45)
    3408                      .dwattr $C$DW$487, DW_AT_name("clarke_V")
    3409                      .dwattr $C$DW$487, DW_AT_TI_symbol_name("_clarke_V")
    3410                      .dwattr $C$DW$487, DW_AT_data_member_location[DW_OP_plus_uconst 0x12]
    3411                      .dwattr $C$DW$487, DW_AT_accessibility(DW_ACCESS_public)
    3412              $C$DW$488       .dwtag  DW_TAG_member
    3413                      .dwattr $C$DW$488, DW_AT_type(*$C$DW$T$47)
    3414                      .dwattr $C$DW$488, DW_AT_name("estHandle")
    3415                      .dwattr $C$DW$488, DW_AT_TI_symbol_name("_estHandle")
    3416                      .dwattr $C$DW$488, DW_AT_data_member_location[DW_OP_plus_uconst 0x18]
    3417                      .dwattr $C$DW$488, DW_AT_accessibility(DW_ACCESS_public)
    3418              $C$DW$489       .dwtag  DW_TAG_member
    3419                      .dwattr $C$DW$489, DW_AT_type(*$C$DW$T$49)
    3420                      .dwattr $C$DW$489, DW_AT_name("parkHandle")
    3421                      .dwattr $C$DW$489, DW_AT_TI_symbol_name("_parkHandle")
    3422                      .dwattr $C$DW$489, DW_AT_data_member_location[DW_OP_plus_uconst 0x1a]
    3423                      .dwattr $C$DW$489, DW_AT_accessibility(DW_ACCESS_public)
    3424              $C$DW$490       .dwtag  DW_TAG_member
    3425                      .dwattr $C$DW$490, DW_AT_type(*$C$DW$T$50)
    3426                      .dwattr $C$DW$490, DW_AT_name("park")
    3427                      .dwattr $C$DW$490, DW_AT_TI_symbol_name("_park")
    3428                      .dwattr $C$DW$490, DW_AT_data_member_location[DW_OP_plus_uconst 0x1c]
    3429                      .dwattr $C$DW$490, DW_AT_accessibility(DW_ACCESS_public)
    3430              $C$DW$491       .dwtag  DW_TAG_member
    3431                      .dwattr $C$DW$491, DW_AT_type(*$C$DW$T$52)
    3432                      .dwattr $C$DW$491, DW_AT_name("pidHandle_Id")
    3433                      .dwattr $C$DW$491, DW_AT_TI_symbol_name("_pidHandle_Id")
    3434                      .dwattr $C$DW$491, DW_AT_data_member_location[DW_OP_plus_uconst 0x20]
    3435                      .dwattr $C$DW$491, DW_AT_accessibility(DW_ACCESS_public)
    3436              $C$DW$492       .dwtag  DW_TAG_member
    3437                      .dwattr $C$DW$492, DW_AT_type(*$C$DW$T$53)
    3438                      .dwattr $C$DW$492, DW_AT_name("pid_Id")
    3439                      .dwattr $C$DW$492, DW_AT_TI_symbol_name("_pid_Id")
    3440                      .dwattr $C$DW$492, DW_AT_data_member_location[DW_OP_plus_uconst 0x22]
    3441                      .dwattr $C$DW$492, DW_AT_accessibility(DW_ACCESS_public)
    3442              $C$DW$493       .dwtag  DW_TAG_member
    3443                      .dwattr $C$DW$493, DW_AT_type(*$C$DW$T$52)
    3444                      .dwattr $C$DW$493, DW_AT_name("pidHandle_Iq")
    3445                      .dwattr $C$DW$493, DW_AT_TI_symbol_name("_pidHandle_Iq")
    3446                      .dwattr $C$DW$493, DW_AT_data_member_location[DW_OP_plus_uconst 0x32]
    3447                      .dwattr $C$DW$493, DW_AT_accessibility(DW_ACCESS_public)
    3448              $C$DW$494       .dwtag  DW_TAG_member
    3449                      .dwattr $C$DW$494, DW_AT_type(*$C$DW$T$53)
    3450                      .dwattr $C$DW$494, DW_AT_name("pid_Iq")
    3451                      .dwattr $C$DW$494, DW_AT_TI_symbol_name("_pid_Iq")
    3452                      .dwattr $C$DW$494, DW_AT_data_member_location[DW_OP_plus_uconst 0x34]
    3453                      .dwattr $C$DW$494, DW_AT_accessibility(DW_ACCESS_public)
    3454              $C$DW$495       .dwtag  DW_TAG_member
    3455                      .dwattr $C$DW$495, DW_AT_type(*$C$DW$T$52)
TMS320C2000 Assembler PC v6.2.5 Tue Jun 27 16:21:07 2017

Tools Copyright (c) 1996-2014 Texas Instruments Incorporated
C:\Users\wmj\AppData\Local\Temp\0694810                              PAGE   69

    3456                      .dwattr $C$DW$495, DW_AT_name("pidHandle_spd")
    3457                      .dwattr $C$DW$495, DW_AT_TI_symbol_name("_pidHandle_spd")
    3458                      .dwattr $C$DW$495, DW_AT_data_member_location[DW_OP_plus_uconst 0x44]
    3459                      .dwattr $C$DW$495, DW_AT_accessibility(DW_ACCESS_public)
    3460              $C$DW$496       .dwtag  DW_TAG_member
    3461                      .dwattr $C$DW$496, DW_AT_type(*$C$DW$T$53)
    3462                      .dwattr $C$DW$496, DW_AT_name("pid_spd")
    3463                      .dwattr $C$DW$496, DW_AT_TI_symbol_name("_pid_spd")
    3464                      .dwattr $C$DW$496, DW_AT_data_member_location[DW_OP_plus_uconst 0x46]
    3465                      .dwattr $C$DW$496, DW_AT_accessibility(DW_ACCESS_public)
    3466              $C$DW$497       .dwtag  DW_TAG_member
    3467                      .dwattr $C$DW$497, DW_AT_type(*$C$DW$T$55)
    3468                      .dwattr $C$DW$497, DW_AT_name("iparkHandle")
    3469                      .dwattr $C$DW$497, DW_AT_TI_symbol_name("_iparkHandle")
    3470                      .dwattr $C$DW$497, DW_AT_data_member_location[DW_OP_plus_uconst 0x56]
    3471                      .dwattr $C$DW$497, DW_AT_accessibility(DW_ACCESS_public)
    3472              $C$DW$498       .dwtag  DW_TAG_member
    3473                      .dwattr $C$DW$498, DW_AT_type(*$C$DW$T$56)
    3474                      .dwattr $C$DW$498, DW_AT_name("ipark")
    3475                      .dwattr $C$DW$498, DW_AT_TI_symbol_name("_ipark")
    3476                      .dwattr $C$DW$498, DW_AT_data_member_location[DW_OP_plus_uconst 0x58]
    3477                      .dwattr $C$DW$498, DW_AT_accessibility(DW_ACCESS_public)
    3478              $C$DW$499       .dwtag  DW_TAG_member
    3479                      .dwattr $C$DW$499, DW_AT_type(*$C$DW$T$58)
    3480                      .dwattr $C$DW$499, DW_AT_name("svgenHandle")
    3481                      .dwattr $C$DW$499, DW_AT_TI_symbol_name("_svgenHandle")
    3482                      .dwattr $C$DW$499, DW_AT_data_member_location[DW_OP_plus_uconst 0x5c]
    3483                      .dwattr $C$DW$499, DW_AT_accessibility(DW_ACCESS_public)
    3484              $C$DW$500       .dwtag  DW_TAG_member
    3485                      .dwattr $C$DW$500, DW_AT_type(*$C$DW$T$59)
    3486                      .dwattr $C$DW$500, DW_AT_name("svgen")
    3487                      .dwattr $C$DW$500, DW_AT_TI_symbol_name("_svgen")
    3488                      .dwattr $C$DW$500, DW_AT_data_member_location[DW_OP_plus_uconst 0x5e]
    3489                      .dwattr $C$DW$500, DW_AT_accessibility(DW_ACCESS_public)
    3490              $C$DW$501       .dwtag  DW_TAG_member
    3491                      .dwattr $C$DW$501, DW_AT_type(*$C$DW$T$61)
    3492                      .dwattr $C$DW$501, DW_AT_name("trajHandle_Id")
    3493                      .dwattr $C$DW$501, DW_AT_TI_symbol_name("_trajHandle_Id")
    3494                      .dwattr $C$DW$501, DW_AT_data_member_location[DW_OP_plus_uconst 0x60]
    3495                      .dwattr $C$DW$501, DW_AT_accessibility(DW_ACCESS_public)
    3496              $C$DW$502       .dwtag  DW_TAG_member
    3497                      .dwattr $C$DW$502, DW_AT_type(*$C$DW$T$62)
    3498                      .dwattr $C$DW$502, DW_AT_name("traj_Id")
    3499                      .dwattr $C$DW$502, DW_AT_TI_symbol_name("_traj_Id")
    3500                      .dwattr $C$DW$502, DW_AT_data_member_location[DW_OP_plus_uconst 0x62]
    3501                      .dwattr $C$DW$502, DW_AT_accessibility(DW_ACCESS_public)
    3502              $C$DW$503       .dwtag  DW_TAG_member
    3503                      .dwattr $C$DW$503, DW_AT_type(*$C$DW$T$61)
    3504                      .dwattr $C$DW$503, DW_AT_name("trajHandle_spd")
    3505                      .dwattr $C$DW$503, DW_AT_TI_symbol_name("_trajHandle_spd")
    3506                      .dwattr $C$DW$503, DW_AT_data_member_location[DW_OP_plus_uconst 0x6c]
    3507                      .dwattr $C$DW$503, DW_AT_accessibility(DW_ACCESS_public)
    3508              $C$DW$504       .dwtag  DW_TAG_member
    3509                      .dwattr $C$DW$504, DW_AT_type(*$C$DW$T$62)
    3510                      .dwattr $C$DW$504, DW_AT_name("traj_spd")
TMS320C2000 Assembler PC v6.2.5 Tue Jun 27 16:21:07 2017

Tools Copyright (c) 1996-2014 Texas Instruments Incorporated
C:\Users\wmj\AppData\Local\Temp\0694810                              PAGE   70

    3511                      .dwattr $C$DW$504, DW_AT_TI_symbol_name("_traj_spd")
    3512                      .dwattr $C$DW$504, DW_AT_data_member_location[DW_OP_plus_uconst 0x6e]
    3513                      .dwattr $C$DW$504, DW_AT_accessibility(DW_ACCESS_public)
    3514              $C$DW$505       .dwtag  DW_TAG_member
    3515                      .dwattr $C$DW$505, DW_AT_type(*$C$DW$T$61)
    3516                      .dwattr $C$DW$505, DW_AT_name("trajHandle_spdMax")
    3517                      .dwattr $C$DW$505, DW_AT_TI_symbol_name("_trajHandle_spdMax")
    3518                      .dwattr $C$DW$505, DW_AT_data_member_location[DW_OP_plus_uconst 0x78]
    3519                      .dwattr $C$DW$505, DW_AT_accessibility(DW_ACCESS_public)
    3520              $C$DW$506       .dwtag  DW_TAG_member
    3521                      .dwattr $C$DW$506, DW_AT_type(*$C$DW$T$62)
    3522                      .dwattr $C$DW$506, DW_AT_name("traj_spdMax")
    3523                      .dwattr $C$DW$506, DW_AT_TI_symbol_name("_traj_spdMax")
    3524                      .dwattr $C$DW$506, DW_AT_data_member_location[DW_OP_plus_uconst 0x7a]
    3525                      .dwattr $C$DW$506, DW_AT_accessibility(DW_ACCESS_public)
    3526              $C$DW$507       .dwtag  DW_TAG_member
    3527                      .dwattr $C$DW$507, DW_AT_type(*$C$DW$T$63)
    3528                      .dwattr $C$DW$507, DW_AT_name("motorParams")
    3529                      .dwattr $C$DW$507, DW_AT_TI_symbol_name("_motorParams")
    3530                      .dwattr $C$DW$507, DW_AT_data_member_location[DW_OP_plus_uconst 0x84]
    3531                      .dwattr $C$DW$507, DW_AT_accessibility(DW_ACCESS_public)
    3532              $C$DW$508       .dwtag  DW_TAG_member
    3533                      .dwattr $C$DW$508, DW_AT_type(*$C$DW$T$66)
    3534                      .dwattr $C$DW$508, DW_AT_name("waitTimes")
    3535                      .dwattr $C$DW$508, DW_AT_TI_symbol_name("_waitTimes")
    3536                      .dwattr $C$DW$508, DW_AT_data_member_location[DW_OP_plus_uconst 0x92]
    3537                      .dwattr $C$DW$508, DW_AT_accessibility(DW_ACCESS_public)
    3538              $C$DW$509       .dwtag  DW_TAG_member
    3539                      .dwattr $C$DW$509, DW_AT_type(*$C$DW$T$65)
    3540                      .dwattr $C$DW$509, DW_AT_name("counter_state")
    3541                      .dwattr $C$DW$509, DW_AT_TI_symbol_name("_counter_state")
    3542                      .dwattr $C$DW$509, DW_AT_data_member_location[DW_OP_plus_uconst 0x9a]
    3543                      .dwattr $C$DW$509, DW_AT_accessibility(DW_ACCESS_public)
    3544              $C$DW$510       .dwtag  DW_TAG_member
    3545                      .dwattr $C$DW$510, DW_AT_type(*$C$DW$T$67)
    3546                      .dwattr $C$DW$510, DW_AT_name("numIsrTicksPerCtrlTick")
    3547                      .dwattr $C$DW$510, DW_AT_TI_symbol_name("_numIsrTicksPerCtrlTick")
    3548                      .dwattr $C$DW$510, DW_AT_data_member_location[DW_OP_plus_uconst 0x9c]
    3549                      .dwattr $C$DW$510, DW_AT_accessibility(DW_ACCESS_public)
    3550              $C$DW$511       .dwtag  DW_TAG_member
    3551                      .dwattr $C$DW$511, DW_AT_type(*$C$DW$T$67)
    3552                      .dwattr $C$DW$511, DW_AT_name("numCtrlTicksPerCurrentTick")
    3553                      .dwattr $C$DW$511, DW_AT_TI_symbol_name("_numCtrlTicksPerCurrentTick")
    3554                      .dwattr $C$DW$511, DW_AT_data_member_location[DW_OP_plus_uconst 0x9d]
    3555                      .dwattr $C$DW$511, DW_AT_accessibility(DW_ACCESS_public)
    3556              $C$DW$512       .dwtag  DW_TAG_member
    3557                      .dwattr $C$DW$512, DW_AT_type(*$C$DW$T$67)
    3558                      .dwattr $C$DW$512, DW_AT_name("numCtrlTicksPerSpeedTick")
    3559                      .dwattr $C$DW$512, DW_AT_TI_symbol_name("_numCtrlTicksPerSpeedTick")
    3560                      .dwattr $C$DW$512, DW_AT_data_member_location[DW_OP_plus_uconst 0x9e]
    3561                      .dwattr $C$DW$512, DW_AT_accessibility(DW_ACCESS_public)
    3562              $C$DW$513       .dwtag  DW_TAG_member
    3563                      .dwattr $C$DW$513, DW_AT_type(*$C$DW$T$67)
    3564                      .dwattr $C$DW$513, DW_AT_name("numCtrlTicksPerTrajTick")
    3565                      .dwattr $C$DW$513, DW_AT_TI_symbol_name("_numCtrlTicksPerTrajTick")
TMS320C2000 Assembler PC v6.2.5 Tue Jun 27 16:21:07 2017

Tools Copyright (c) 1996-2014 Texas Instruments Incorporated
C:\Users\wmj\AppData\Local\Temp\0694810                              PAGE   71

    3566                      .dwattr $C$DW$513, DW_AT_data_member_location[DW_OP_plus_uconst 0x9f]
    3567                      .dwattr $C$DW$513, DW_AT_accessibility(DW_ACCESS_public)
    3568              $C$DW$514       .dwtag  DW_TAG_member
    3569                      .dwattr $C$DW$514, DW_AT_type(*$C$DW$T$65)
    3570                      .dwattr $C$DW$514, DW_AT_name("ctrlFreq_Hz")
    3571                      .dwattr $C$DW$514, DW_AT_TI_symbol_name("_ctrlFreq_Hz")
    3572                      .dwattr $C$DW$514, DW_AT_data_member_location[DW_OP_plus_uconst 0xa0]
    3573                      .dwattr $C$DW$514, DW_AT_accessibility(DW_ACCESS_public)
    3574              $C$DW$515       .dwtag  DW_TAG_member
    3575                      .dwattr $C$DW$515, DW_AT_type(*$C$DW$T$65)
    3576                      .dwattr $C$DW$515, DW_AT_name("trajFreq_Hz")
    3577                      .dwattr $C$DW$515, DW_AT_TI_symbol_name("_trajFreq_Hz")
    3578                      .dwattr $C$DW$515, DW_AT_data_member_location[DW_OP_plus_uconst 0xa2]
    3579                      .dwattr $C$DW$515, DW_AT_accessibility(DW_ACCESS_public)
    3580              $C$DW$516       .dwtag  DW_TAG_member
    3581                      .dwattr $C$DW$516, DW_AT_type(*$C$DW$T$32)
    3582                      .dwattr $C$DW$516, DW_AT_name("trajPeriod_sec")
    3583                      .dwattr $C$DW$516, DW_AT_TI_symbol_name("_trajPeriod_sec")
    3584                      .dwattr $C$DW$516, DW_AT_data_member_location[DW_OP_plus_uconst 0xa4]
    3585                      .dwattr $C$DW$516, DW_AT_accessibility(DW_ACCESS_public)
    3586              $C$DW$517       .dwtag  DW_TAG_member
    3587                      .dwattr $C$DW$517, DW_AT_type(*$C$DW$T$68)
    3588                      .dwattr $C$DW$517, DW_AT_name("ctrlPeriod_sec")
    3589                      .dwattr $C$DW$517, DW_AT_TI_symbol_name("_ctrlPeriod_sec")
    3590                      .dwattr $C$DW$517, DW_AT_data_member_location[DW_OP_plus_uconst 0xa6]
    3591                      .dwattr $C$DW$517, DW_AT_accessibility(DW_ACCESS_public)
    3592              $C$DW$518       .dwtag  DW_TAG_member
    3593                      .dwattr $C$DW$518, DW_AT_type(*$C$DW$T$32)
    3594                      .dwattr $C$DW$518, DW_AT_name("maxVsMag_pu")
    3595                      .dwattr $C$DW$518, DW_AT_TI_symbol_name("_maxVsMag_pu")
    3596                      .dwattr $C$DW$518, DW_AT_data_member_location[DW_OP_plus_uconst 0xa8]
    3597                      .dwattr $C$DW$518, DW_AT_accessibility(DW_ACCESS_public)
    3598              $C$DW$519       .dwtag  DW_TAG_member
    3599                      .dwattr $C$DW$519, DW_AT_type(*$C$DW$T$69)
    3600                      .dwattr $C$DW$519, DW_AT_name("Iab_in")
    3601                      .dwattr $C$DW$519, DW_AT_TI_symbol_name("_Iab_in")
    3602                      .dwattr $C$DW$519, DW_AT_data_member_location[DW_OP_plus_uconst 0xaa]
    3603                      .dwattr $C$DW$519, DW_AT_accessibility(DW_ACCESS_public)
    3604              $C$DW$520       .dwtag  DW_TAG_member
    3605                      .dwattr $C$DW$520, DW_AT_type(*$C$DW$T$69)
    3606                      .dwattr $C$DW$520, DW_AT_name("Iab_filt")
    3607                      .dwattr $C$DW$520, DW_AT_TI_symbol_name("_Iab_filt")
    3608                      .dwattr $C$DW$520, DW_AT_data_member_location[DW_OP_plus_uconst 0xae]
    3609                      .dwattr $C$DW$520, DW_AT_accessibility(DW_ACCESS_public)
    3610              $C$DW$521       .dwtag  DW_TAG_member
    3611                      .dwattr $C$DW$521, DW_AT_type(*$C$DW$T$69)
    3612                      .dwattr $C$DW$521, DW_AT_name("Idq_in")
    3613                      .dwattr $C$DW$521, DW_AT_TI_symbol_name("_Idq_in")
    3614                      .dwattr $C$DW$521, DW_AT_data_member_location[DW_OP_plus_uconst 0xb2]
    3615                      .dwattr $C$DW$521, DW_AT_accessibility(DW_ACCESS_public)
    3616              $C$DW$522       .dwtag  DW_TAG_member
    3617                      .dwattr $C$DW$522, DW_AT_type(*$C$DW$T$69)
    3618                      .dwattr $C$DW$522, DW_AT_name("Vab_in")
    3619                      .dwattr $C$DW$522, DW_AT_TI_symbol_name("_Vab_in")
    3620                      .dwattr $C$DW$522, DW_AT_data_member_location[DW_OP_plus_uconst 0xb6]
TMS320C2000 Assembler PC v6.2.5 Tue Jun 27 16:21:07 2017

Tools Copyright (c) 1996-2014 Texas Instruments Incorporated
C:\Users\wmj\AppData\Local\Temp\0694810                              PAGE   72

    3621                      .dwattr $C$DW$522, DW_AT_accessibility(DW_ACCESS_public)
    3622              $C$DW$523       .dwtag  DW_TAG_member
    3623                      .dwattr $C$DW$523, DW_AT_type(*$C$DW$T$32)
    3624                      .dwattr $C$DW$523, DW_AT_name("spd_out")
    3625                      .dwattr $C$DW$523, DW_AT_TI_symbol_name("_spd_out")
    3626                      .dwattr $C$DW$523, DW_AT_data_member_location[DW_OP_plus_uconst 0xba]
    3627                      .dwattr $C$DW$523, DW_AT_accessibility(DW_ACCESS_public)
    3628              $C$DW$524       .dwtag  DW_TAG_member
    3629                      .dwattr $C$DW$524, DW_AT_type(*$C$DW$T$69)
    3630                      .dwattr $C$DW$524, DW_AT_name("Vab_out")
    3631                      .dwattr $C$DW$524, DW_AT_TI_symbol_name("_Vab_out")
    3632                      .dwattr $C$DW$524, DW_AT_data_member_location[DW_OP_plus_uconst 0xbc]
    3633                      .dwattr $C$DW$524, DW_AT_accessibility(DW_ACCESS_public)
    3634              $C$DW$525       .dwtag  DW_TAG_member
    3635                      .dwattr $C$DW$525, DW_AT_type(*$C$DW$T$69)
    3636                      .dwattr $C$DW$525, DW_AT_name("Vdq_out")
    3637                      .dwattr $C$DW$525, DW_AT_TI_symbol_name("_Vdq_out")
    3638                      .dwattr $C$DW$525, DW_AT_data_member_location[DW_OP_plus_uconst 0xc0]
    3639                      .dwattr $C$DW$525, DW_AT_accessibility(DW_ACCESS_public)
    3640              $C$DW$526       .dwtag  DW_TAG_member
    3641                      .dwattr $C$DW$526, DW_AT_type(*$C$DW$T$68)
    3642                      .dwattr $C$DW$526, DW_AT_name("Rhf")
    3643                      .dwattr $C$DW$526, DW_AT_TI_symbol_name("_Rhf")
    3644                      .dwattr $C$DW$526, DW_AT_data_member_location[DW_OP_plus_uconst 0xc4]
    3645                      .dwattr $C$DW$526, DW_AT_accessibility(DW_ACCESS_public)
    3646              $C$DW$527       .dwtag  DW_TAG_member
    3647                      .dwattr $C$DW$527, DW_AT_type(*$C$DW$T$68)
    3648                      .dwattr $C$DW$527, DW_AT_name("Lhf")
    3649                      .dwattr $C$DW$527, DW_AT_TI_symbol_name("_Lhf")
    3650                      .dwattr $C$DW$527, DW_AT_data_member_location[DW_OP_plus_uconst 0xc6]
    3651                      .dwattr $C$DW$527, DW_AT_accessibility(DW_ACCESS_public)
    3652              $C$DW$528       .dwtag  DW_TAG_member
    3653                      .dwattr $C$DW$528, DW_AT_type(*$C$DW$T$68)
    3654                      .dwattr $C$DW$528, DW_AT_name("RoverL")
    3655                      .dwattr $C$DW$528, DW_AT_TI_symbol_name("_RoverL")
    3656                      .dwattr $C$DW$528, DW_AT_data_member_location[DW_OP_plus_uconst 0xc8]
    3657                      .dwattr $C$DW$528, DW_AT_accessibility(DW_ACCESS_public)
    3658              $C$DW$529       .dwtag  DW_TAG_member
    3659                      .dwattr $C$DW$529, DW_AT_type(*$C$DW$T$32)
    3660                      .dwattr $C$DW$529, DW_AT_name("Kp_Id")
    3661                      .dwattr $C$DW$529, DW_AT_TI_symbol_name("_Kp_Id")
    3662                      .dwattr $C$DW$529, DW_AT_data_member_location[DW_OP_plus_uconst 0xca]
    3663                      .dwattr $C$DW$529, DW_AT_accessibility(DW_ACCESS_public)
    3664              $C$DW$530       .dwtag  DW_TAG_member
    3665                      .dwattr $C$DW$530, DW_AT_type(*$C$DW$T$32)
    3666                      .dwattr $C$DW$530, DW_AT_name("Kp_Iq")
    3667                      .dwattr $C$DW$530, DW_AT_TI_symbol_name("_Kp_Iq")
    3668                      .dwattr $C$DW$530, DW_AT_data_member_location[DW_OP_plus_uconst 0xcc]
    3669                      .dwattr $C$DW$530, DW_AT_accessibility(DW_ACCESS_public)
    3670              $C$DW$531       .dwtag  DW_TAG_member
    3671                      .dwattr $C$DW$531, DW_AT_type(*$C$DW$T$32)
    3672                      .dwattr $C$DW$531, DW_AT_name("Kp_spd")
    3673                      .dwattr $C$DW$531, DW_AT_TI_symbol_name("_Kp_spd")
    3674                      .dwattr $C$DW$531, DW_AT_data_member_location[DW_OP_plus_uconst 0xce]
    3675                      .dwattr $C$DW$531, DW_AT_accessibility(DW_ACCESS_public)
TMS320C2000 Assembler PC v6.2.5 Tue Jun 27 16:21:07 2017

Tools Copyright (c) 1996-2014 Texas Instruments Incorporated
C:\Users\wmj\AppData\Local\Temp\0694810                              PAGE   73

    3676              $C$DW$532       .dwtag  DW_TAG_member
    3677                      .dwattr $C$DW$532, DW_AT_type(*$C$DW$T$32)
    3678                      .dwattr $C$DW$532, DW_AT_name("Ki_Id")
    3679                      .dwattr $C$DW$532, DW_AT_TI_symbol_name("_Ki_Id")
    3680                      .dwattr $C$DW$532, DW_AT_data_member_location[DW_OP_plus_uconst 0xd0]
    3681                      .dwattr $C$DW$532, DW_AT_accessibility(DW_ACCESS_public)
    3682              $C$DW$533       .dwtag  DW_TAG_member
    3683                      .dwattr $C$DW$533, DW_AT_type(*$C$DW$T$32)
    3684                      .dwattr $C$DW$533, DW_AT_name("Ki_Iq")
    3685                      .dwattr $C$DW$533, DW_AT_TI_symbol_name("_Ki_Iq")
    3686                      .dwattr $C$DW$533, DW_AT_data_member_location[DW_OP_plus_uconst 0xd2]
    3687                      .dwattr $C$DW$533, DW_AT_accessibility(DW_ACCESS_public)
    3688              $C$DW$534       .dwtag  DW_TAG_member
    3689                      .dwattr $C$DW$534, DW_AT_type(*$C$DW$T$32)
    3690                      .dwattr $C$DW$534, DW_AT_name("Ki_spd")
    3691                      .dwattr $C$DW$534, DW_AT_TI_symbol_name("_Ki_spd")
    3692                      .dwattr $C$DW$534, DW_AT_data_member_location[DW_OP_plus_uconst 0xd4]
    3693                      .dwattr $C$DW$534, DW_AT_accessibility(DW_ACCESS_public)
    3694              $C$DW$535       .dwtag  DW_TAG_member
    3695                      .dwattr $C$DW$535, DW_AT_type(*$C$DW$T$32)
    3696                      .dwattr $C$DW$535, DW_AT_name("Kd_Id")
    3697                      .dwattr $C$DW$535, DW_AT_TI_symbol_name("_Kd_Id")
    3698                      .dwattr $C$DW$535, DW_AT_data_member_location[DW_OP_plus_uconst 0xd6]
    3699                      .dwattr $C$DW$535, DW_AT_accessibility(DW_ACCESS_public)
    3700              $C$DW$536       .dwtag  DW_TAG_member
    3701                      .dwattr $C$DW$536, DW_AT_type(*$C$DW$T$32)
    3702                      .dwattr $C$DW$536, DW_AT_name("Kd_Iq")
    3703                      .dwattr $C$DW$536, DW_AT_TI_symbol_name("_Kd_Iq")
    3704                      .dwattr $C$DW$536, DW_AT_data_member_location[DW_OP_plus_uconst 0xd8]
    3705                      .dwattr $C$DW$536, DW_AT_accessibility(DW_ACCESS_public)
    3706              $C$DW$537       .dwtag  DW_TAG_member
    3707                      .dwattr $C$DW$537, DW_AT_type(*$C$DW$T$32)
    3708                      .dwattr $C$DW$537, DW_AT_name("Kd_spd")
    3709                      .dwattr $C$DW$537, DW_AT_TI_symbol_name("_Kd_spd")
    3710                      .dwattr $C$DW$537, DW_AT_data_member_location[DW_OP_plus_uconst 0xda]
    3711                      .dwattr $C$DW$537, DW_AT_accessibility(DW_ACCESS_public)
    3712              $C$DW$538       .dwtag  DW_TAG_member
    3713                      .dwattr $C$DW$538, DW_AT_type(*$C$DW$T$32)
    3714                      .dwattr $C$DW$538, DW_AT_name("Ui_Id")
    3715                      .dwattr $C$DW$538, DW_AT_TI_symbol_name("_Ui_Id")
    3716                      .dwattr $C$DW$538, DW_AT_data_member_location[DW_OP_plus_uconst 0xdc]
    3717                      .dwattr $C$DW$538, DW_AT_accessibility(DW_ACCESS_public)
    3718              $C$DW$539       .dwtag  DW_TAG_member
    3719                      .dwattr $C$DW$539, DW_AT_type(*$C$DW$T$32)
    3720                      .dwattr $C$DW$539, DW_AT_name("Ui_Iq")
    3721                      .dwattr $C$DW$539, DW_AT_TI_symbol_name("_Ui_Iq")
    3722                      .dwattr $C$DW$539, DW_AT_data_member_location[DW_OP_plus_uconst 0xde]
    3723                      .dwattr $C$DW$539, DW_AT_accessibility(DW_ACCESS_public)
    3724              $C$DW$540       .dwtag  DW_TAG_member
    3725                      .dwattr $C$DW$540, DW_AT_type(*$C$DW$T$32)
    3726                      .dwattr $C$DW$540, DW_AT_name("Ui_spd")
    3727                      .dwattr $C$DW$540, DW_AT_TI_symbol_name("_Ui_spd")
    3728                      .dwattr $C$DW$540, DW_AT_data_member_location[DW_OP_plus_uconst 0xe0]
    3729                      .dwattr $C$DW$540, DW_AT_accessibility(DW_ACCESS_public)
    3730              $C$DW$541       .dwtag  DW_TAG_member
TMS320C2000 Assembler PC v6.2.5 Tue Jun 27 16:21:07 2017

Tools Copyright (c) 1996-2014 Texas Instruments Incorporated
C:\Users\wmj\AppData\Local\Temp\0694810                              PAGE   74

    3731                      .dwattr $C$DW$541, DW_AT_type(*$C$DW$T$69)
    3732                      .dwattr $C$DW$541, DW_AT_name("Idq_ref")
    3733                      .dwattr $C$DW$541, DW_AT_TI_symbol_name("_Idq_ref")
    3734                      .dwattr $C$DW$541, DW_AT_data_member_location[DW_OP_plus_uconst 0xe2]
    3735                      .dwattr $C$DW$541, DW_AT_accessibility(DW_ACCESS_public)
    3736              $C$DW$542       .dwtag  DW_TAG_member
    3737                      .dwattr $C$DW$542, DW_AT_type(*$C$DW$T$32)
    3738                      .dwattr $C$DW$542, DW_AT_name("IdRated")
    3739                      .dwattr $C$DW$542, DW_AT_TI_symbol_name("_IdRated")
    3740                      .dwattr $C$DW$542, DW_AT_data_member_location[DW_OP_plus_uconst 0xe6]
    3741                      .dwattr $C$DW$542, DW_AT_accessibility(DW_ACCESS_public)
    3742              $C$DW$543       .dwtag  DW_TAG_member
    3743                      .dwattr $C$DW$543, DW_AT_type(*$C$DW$T$32)
    3744                      .dwattr $C$DW$543, DW_AT_name("spd_ref")
    3745                      .dwattr $C$DW$543, DW_AT_TI_symbol_name("_spd_ref")
    3746                      .dwattr $C$DW$543, DW_AT_data_member_location[DW_OP_plus_uconst 0xe8]
    3747                      .dwattr $C$DW$543, DW_AT_accessibility(DW_ACCESS_public)
    3748              $C$DW$544       .dwtag  DW_TAG_member
    3749                      .dwattr $C$DW$544, DW_AT_type(*$C$DW$T$32)
    3750                      .dwattr $C$DW$544, DW_AT_name("spd_max")
    3751                      .dwattr $C$DW$544, DW_AT_TI_symbol_name("_spd_max")
    3752                      .dwattr $C$DW$544, DW_AT_data_member_location[DW_OP_plus_uconst 0xea]
    3753                      .dwattr $C$DW$544, DW_AT_accessibility(DW_ACCESS_public)
    3754              $C$DW$545       .dwtag  DW_TAG_member
    3755                      .dwattr $C$DW$545, DW_AT_type(*$C$DW$T$67)
    3756                      .dwattr $C$DW$545, DW_AT_name("counter_current")
    3757                      .dwattr $C$DW$545, DW_AT_TI_symbol_name("_counter_current")
    3758                      .dwattr $C$DW$545, DW_AT_data_member_location[DW_OP_plus_uconst 0xec]
    3759                      .dwattr $C$DW$545, DW_AT_accessibility(DW_ACCESS_public)
    3760              $C$DW$546       .dwtag  DW_TAG_member
    3761                      .dwattr $C$DW$546, DW_AT_type(*$C$DW$T$67)
    3762                      .dwattr $C$DW$546, DW_AT_name("counter_isr")
    3763                      .dwattr $C$DW$546, DW_AT_TI_symbol_name("_counter_isr")
    3764                      .dwattr $C$DW$546, DW_AT_data_member_location[DW_OP_plus_uconst 0xed]
    3765                      .dwattr $C$DW$546, DW_AT_accessibility(DW_ACCESS_public)
    3766              $C$DW$547       .dwtag  DW_TAG_member
    3767                      .dwattr $C$DW$547, DW_AT_type(*$C$DW$T$67)
    3768                      .dwattr $C$DW$547, DW_AT_name("counter_speed")
    3769                      .dwattr $C$DW$547, DW_AT_TI_symbol_name("_counter_speed")
    3770                      .dwattr $C$DW$547, DW_AT_data_member_location[DW_OP_plus_uconst 0xee]
    3771                      .dwattr $C$DW$547, DW_AT_accessibility(DW_ACCESS_public)
    3772              $C$DW$548       .dwtag  DW_TAG_member
    3773                      .dwattr $C$DW$548, DW_AT_type(*$C$DW$T$67)
    3774                      .dwattr $C$DW$548, DW_AT_name("counter_traj")
    3775                      .dwattr $C$DW$548, DW_AT_TI_symbol_name("_counter_traj")
    3776                      .dwattr $C$DW$548, DW_AT_data_member_location[DW_OP_plus_uconst 0xef]
    3777                      .dwattr $C$DW$548, DW_AT_accessibility(DW_ACCESS_public)
    3778              $C$DW$549       .dwtag  DW_TAG_member
    3779                      .dwattr $C$DW$549, DW_AT_type(*$C$DW$T$70)
    3780                      .dwattr $C$DW$549, DW_AT_name("flag_enableCtrl")
    3781                      .dwattr $C$DW$549, DW_AT_TI_symbol_name("_flag_enableCtrl")
    3782                      .dwattr $C$DW$549, DW_AT_data_member_location[DW_OP_plus_uconst 0xf0]
    3783                      .dwattr $C$DW$549, DW_AT_accessibility(DW_ACCESS_public)
    3784              $C$DW$550       .dwtag  DW_TAG_member
    3785                      .dwattr $C$DW$550, DW_AT_type(*$C$DW$T$70)
TMS320C2000 Assembler PC v6.2.5 Tue Jun 27 16:21:07 2017

Tools Copyright (c) 1996-2014 Texas Instruments Incorporated
C:\Users\wmj\AppData\Local\Temp\0694810                              PAGE   75

    3786                      .dwattr $C$DW$550, DW_AT_name("flag_enableDcBusComp")
    3787                      .dwattr $C$DW$550, DW_AT_TI_symbol_name("_flag_enableDcBusComp")
    3788                      .dwattr $C$DW$550, DW_AT_data_member_location[DW_OP_plus_uconst 0xf1]
    3789                      .dwattr $C$DW$550, DW_AT_accessibility(DW_ACCESS_public)
    3790              $C$DW$551       .dwtag  DW_TAG_member
    3791                      .dwattr $C$DW$551, DW_AT_type(*$C$DW$T$70)
    3792                      .dwattr $C$DW$551, DW_AT_name("flag_enablePowerWarp")
    3793                      .dwattr $C$DW$551, DW_AT_TI_symbol_name("_flag_enablePowerWarp")
    3794                      .dwattr $C$DW$551, DW_AT_data_member_location[DW_OP_plus_uconst 0xf2]
    3795                      .dwattr $C$DW$551, DW_AT_accessibility(DW_ACCESS_public)
    3796              $C$DW$552       .dwtag  DW_TAG_member
    3797                      .dwattr $C$DW$552, DW_AT_type(*$C$DW$T$70)
    3798                      .dwattr $C$DW$552, DW_AT_name("flag_enableOffset")
    3799                      .dwattr $C$DW$552, DW_AT_TI_symbol_name("_flag_enableOffset")
    3800                      .dwattr $C$DW$552, DW_AT_data_member_location[DW_OP_plus_uconst 0xf3]
    3801                      .dwattr $C$DW$552, DW_AT_accessibility(DW_ACCESS_public)
    3802              $C$DW$553       .dwtag  DW_TAG_member
    3803                      .dwattr $C$DW$553, DW_AT_type(*$C$DW$T$70)
    3804                      .dwattr $C$DW$553, DW_AT_name("flag_enableSpeedCtrl")
    3805                      .dwattr $C$DW$553, DW_AT_TI_symbol_name("_flag_enableSpeedCtrl")
    3806                      .dwattr $C$DW$553, DW_AT_data_member_location[DW_OP_plus_uconst 0xf4]
    3807                      .dwattr $C$DW$553, DW_AT_accessibility(DW_ACCESS_public)
    3808              $C$DW$554       .dwtag  DW_TAG_member
    3809                      .dwattr $C$DW$554, DW_AT_type(*$C$DW$T$70)
    3810                      .dwattr $C$DW$554, DW_AT_name("flag_enableUserMotorParams")
    3811                      .dwattr $C$DW$554, DW_AT_TI_symbol_name("_flag_enableUserMotorParams")
    3812                      .dwattr $C$DW$554, DW_AT_data_member_location[DW_OP_plus_uconst 0xf5]
    3813                      .dwattr $C$DW$554, DW_AT_accessibility(DW_ACCESS_public)
    3814              $C$DW$555       .dwtag  DW_TAG_member
    3815                      .dwattr $C$DW$555, DW_AT_type(*$C$DW$T$69)
    3816                      .dwattr $C$DW$555, DW_AT_name("Idq_offset_pu")
    3817                      .dwattr $C$DW$555, DW_AT_TI_symbol_name("_Idq_offset_pu")
    3818                      .dwattr $C$DW$555, DW_AT_data_member_location[DW_OP_plus_uconst 0xf6]
    3819                      .dwattr $C$DW$555, DW_AT_accessibility(DW_ACCESS_public)
    3820              $C$DW$556       .dwtag  DW_TAG_member
    3821                      .dwattr $C$DW$556, DW_AT_type(*$C$DW$T$69)
    3822                      .dwattr $C$DW$556, DW_AT_name("Vdq_offset_pu")
    3823                      .dwattr $C$DW$556, DW_AT_TI_symbol_name("_Vdq_offset_pu")
    3824                      .dwattr $C$DW$556, DW_AT_data_member_location[DW_OP_plus_uconst 0xfa]
    3825                      .dwattr $C$DW$556, DW_AT_accessibility(DW_ACCESS_public)
    3826              $C$DW$557       .dwtag  DW_TAG_member
    3827                      .dwattr $C$DW$557, DW_AT_type(*$C$DW$T$32)
    3828                      .dwattr $C$DW$557, DW_AT_name("angle_pu")
    3829                      .dwattr $C$DW$557, DW_AT_TI_symbol_name("_angle_pu")
    3830                      .dwattr $C$DW$557, DW_AT_data_member_location[DW_OP_plus_uconst 0xfe]
    3831                      .dwattr $C$DW$557, DW_AT_accessibility(DW_ACCESS_public)
    3832              $C$DW$558       .dwtag  DW_TAG_member
    3833                      .dwattr $C$DW$558, DW_AT_type(*$C$DW$T$32)
    3834                      .dwattr $C$DW$558, DW_AT_name("speed_ref_pu")
    3835                      .dwattr $C$DW$558, DW_AT_TI_symbol_name("_speed_ref_pu")
    3836                      .dwattr $C$DW$558, DW_AT_data_member_location[DW_OP_plus_uconst 0x100]
    3837                      .dwattr $C$DW$558, DW_AT_accessibility(DW_ACCESS_public)
    3838              $C$DW$559       .dwtag  DW_TAG_member
    3839                      .dwattr $C$DW$559, DW_AT_type(*$C$DW$T$32)
    3840                      .dwattr $C$DW$559, DW_AT_name("speed_fb_pu")
TMS320C2000 Assembler PC v6.2.5 Tue Jun 27 16:21:07 2017

Tools Copyright (c) 1996-2014 Texas Instruments Incorporated
C:\Users\wmj\AppData\Local\Temp\0694810                              PAGE   76

    3841                      .dwattr $C$DW$559, DW_AT_TI_symbol_name("_speed_fb_pu")
    3842                      .dwattr $C$DW$559, DW_AT_data_member_location[DW_OP_plus_uconst 0x102]
    3843                      .dwattr $C$DW$559, DW_AT_accessibility(DW_ACCESS_public)
    3844              $C$DW$560       .dwtag  DW_TAG_member
    3845                      .dwattr $C$DW$560, DW_AT_type(*$C$DW$T$32)
    3846                      .dwattr $C$DW$560, DW_AT_name("speed_outMax_pu")
    3847                      .dwattr $C$DW$560, DW_AT_TI_symbol_name("_speed_outMax_pu")
    3848                      .dwattr $C$DW$560, DW_AT_data_member_location[DW_OP_plus_uconst 0x104]
    3849                      .dwattr $C$DW$560, DW_AT_accessibility(DW_ACCESS_public)
    3850              $C$DW$561       .dwtag  DW_TAG_member
    3851                      .dwattr $C$DW$561, DW_AT_type(*$C$DW$T$70)
    3852                      .dwattr $C$DW$561, DW_AT_name("flag_enableCurrentCtrl")
    3853                      .dwattr $C$DW$561, DW_AT_TI_symbol_name("_flag_enableCurrentCtrl")
    3854                      .dwattr $C$DW$561, DW_AT_data_member_location[DW_OP_plus_uconst 0x106]
    3855                      .dwattr $C$DW$561, DW_AT_accessibility(DW_ACCESS_public)
    3856                      .dwendtag $C$DW$T$71
    3857              
    3858              $C$DW$T$189     .dwtag  DW_TAG_typedef, DW_AT_name("CTRL_Obj")
    3859                      .dwattr $C$DW$T$189, DW_AT_type(*$C$DW$T$71)
    3860                      .dwattr $C$DW$T$189, DW_AT_language(DW_LANG_C)
    3861              $C$DW$T$190     .dwtag  DW_TAG_pointer_type
    3862                      .dwattr $C$DW$T$190, DW_AT_type(*$C$DW$T$189)
    3863                      .dwattr $C$DW$T$190, DW_AT_address_class(0x16)
    3864              $C$DW$T$162     .dwtag  DW_TAG_pointer_type
    3865                      .dwattr $C$DW$T$162, DW_AT_type(*$C$DW$T$71)
    3866                      .dwattr $C$DW$T$162, DW_AT_address_class(0x16)
    3867              $C$DW$T$163     .dwtag  DW_TAG_typedef, DW_AT_name("CTRL_Handle")
    3868                      .dwattr $C$DW$T$163, DW_AT_type(*$C$DW$T$162)
    3869                      .dwattr $C$DW$T$163, DW_AT_language(DW_LANG_C)
    3870              $C$DW$562       .dwtag  DW_TAG_TI_far_type
    3871                      .dwattr $C$DW$562, DW_AT_type(*$C$DW$T$163)
    3872              $C$DW$T$191     .dwtag  DW_TAG_const_type
    3873                      .dwattr $C$DW$T$191, DW_AT_type(*$C$DW$562)
    3874              
    3875              $C$DW$T$74      .dwtag  DW_TAG_structure_type
    3876                      .dwattr $C$DW$T$74, DW_AT_name("_CTRL_Version_")
    3877                      .dwattr $C$DW$T$74, DW_AT_byte_size(0x04)
    3878              $C$DW$563       .dwtag  DW_TAG_member
    3879                      .dwattr $C$DW$563, DW_AT_type(*$C$DW$T$23)
    3880                      .dwattr $C$DW$563, DW_AT_name("rsvd")
    3881                      .dwattr $C$DW$563, DW_AT_TI_symbol_name("_rsvd")
    3882                      .dwattr $C$DW$563, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    3883                      .dwattr $C$DW$563, DW_AT_accessibility(DW_ACCESS_public)
    3884              $C$DW$564       .dwtag  DW_TAG_member
    3885                      .dwattr $C$DW$564, DW_AT_type(*$C$DW$T$73)
    3886                      .dwattr $C$DW$564, DW_AT_name("targetProc")
    3887                      .dwattr $C$DW$564, DW_AT_TI_symbol_name("_targetProc")
    3888                      .dwattr $C$DW$564, DW_AT_data_member_location[DW_OP_plus_uconst 0x1]
    3889                      .dwattr $C$DW$564, DW_AT_accessibility(DW_ACCESS_public)
    3890              $C$DW$565       .dwtag  DW_TAG_member
    3891                      .dwattr $C$DW$565, DW_AT_type(*$C$DW$T$23)
    3892                      .dwattr $C$DW$565, DW_AT_name("major")
    3893                      .dwattr $C$DW$565, DW_AT_TI_symbol_name("_major")
    3894                      .dwattr $C$DW$565, DW_AT_data_member_location[DW_OP_plus_uconst 0x2]
    3895                      .dwattr $C$DW$565, DW_AT_accessibility(DW_ACCESS_public)
TMS320C2000 Assembler PC v6.2.5 Tue Jun 27 16:21:07 2017

Tools Copyright (c) 1996-2014 Texas Instruments Incorporated
C:\Users\wmj\AppData\Local\Temp\0694810                              PAGE   77

    3896              $C$DW$566       .dwtag  DW_TAG_member
    3897                      .dwattr $C$DW$566, DW_AT_type(*$C$DW$T$23)
    3898                      .dwattr $C$DW$566, DW_AT_name("minor")
    3899                      .dwattr $C$DW$566, DW_AT_TI_symbol_name("_minor")
    3900                      .dwattr $C$DW$566, DW_AT_data_member_location[DW_OP_plus_uconst 0x3]
    3901                      .dwattr $C$DW$566, DW_AT_accessibility(DW_ACCESS_public)
    3902                      .dwendtag $C$DW$T$74
    3903              
    3904              $C$DW$T$38      .dwtag  DW_TAG_typedef, DW_AT_name("CTRL_Version")
    3905                      .dwattr $C$DW$T$38, DW_AT_type(*$C$DW$T$74)
    3906                      .dwattr $C$DW$T$38, DW_AT_language(DW_LANG_C)
    3907              $C$DW$T$199     .dwtag  DW_TAG_pointer_type
    3908                      .dwattr $C$DW$T$199, DW_AT_type(*$C$DW$T$38)
    3909                      .dwattr $C$DW$T$199, DW_AT_address_class(0x16)
    3910              
    3911              $C$DW$T$20      .dwtag  DW_TAG_structure_type
    3912                      .dwattr $C$DW$T$20, DW_AT_name("_EST_Obj_")
    3913                      .dwattr $C$DW$T$20, DW_AT_declaration
    3914                      .dwendtag $C$DW$T$20
    3915              
    3916              $C$DW$T$46      .dwtag  DW_TAG_pointer_type
    3917                      .dwattr $C$DW$T$46, DW_AT_type(*$C$DW$T$20)
    3918                      .dwattr $C$DW$T$46, DW_AT_address_class(0x16)
    3919              $C$DW$T$47      .dwtag  DW_TAG_typedef, DW_AT_name("EST_Handle")
    3920                      .dwattr $C$DW$T$47, DW_AT_type(*$C$DW$T$46)
    3921                      .dwattr $C$DW$T$47, DW_AT_language(DW_LANG_C)
    3922              
    3923              $C$DW$T$75      .dwtag  DW_TAG_structure_type
    3924                      .dwattr $C$DW$T$75, DW_AT_name("_FILTER_FO_")
    3925                      .dwattr $C$DW$T$75, DW_AT_byte_size(0x0a)
    3926              $C$DW$567       .dwtag  DW_TAG_member
    3927                      .dwattr $C$DW$567, DW_AT_type(*$C$DW$T$32)
    3928                      .dwattr $C$DW$567, DW_AT_name("a1")
    3929                      .dwattr $C$DW$567, DW_AT_TI_symbol_name("_a1")
    3930                      .dwattr $C$DW$567, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    3931                      .dwattr $C$DW$567, DW_AT_accessibility(DW_ACCESS_public)
    3932              $C$DW$568       .dwtag  DW_TAG_member
    3933                      .dwattr $C$DW$568, DW_AT_type(*$C$DW$T$32)
    3934                      .dwattr $C$DW$568, DW_AT_name("b0")
    3935                      .dwattr $C$DW$568, DW_AT_TI_symbol_name("_b0")
    3936                      .dwattr $C$DW$568, DW_AT_data_member_location[DW_OP_plus_uconst 0x2]
    3937                      .dwattr $C$DW$568, DW_AT_accessibility(DW_ACCESS_public)
    3938              $C$DW$569       .dwtag  DW_TAG_member
    3939                      .dwattr $C$DW$569, DW_AT_type(*$C$DW$T$32)
    3940                      .dwattr $C$DW$569, DW_AT_name("b1")
    3941                      .dwattr $C$DW$569, DW_AT_TI_symbol_name("_b1")
    3942                      .dwattr $C$DW$569, DW_AT_data_member_location[DW_OP_plus_uconst 0x4]
    3943                      .dwattr $C$DW$569, DW_AT_accessibility(DW_ACCESS_public)
    3944              $C$DW$570       .dwtag  DW_TAG_member
    3945                      .dwattr $C$DW$570, DW_AT_type(*$C$DW$T$32)
    3946                      .dwattr $C$DW$570, DW_AT_name("x1")
    3947                      .dwattr $C$DW$570, DW_AT_TI_symbol_name("_x1")
    3948                      .dwattr $C$DW$570, DW_AT_data_member_location[DW_OP_plus_uconst 0x6]
    3949                      .dwattr $C$DW$570, DW_AT_accessibility(DW_ACCESS_public)
    3950              $C$DW$571       .dwtag  DW_TAG_member
TMS320C2000 Assembler PC v6.2.5 Tue Jun 27 16:21:07 2017

Tools Copyright (c) 1996-2014 Texas Instruments Incorporated
C:\Users\wmj\AppData\Local\Temp\0694810                              PAGE   78

    3951                      .dwattr $C$DW$571, DW_AT_type(*$C$DW$T$32)
    3952                      .dwattr $C$DW$571, DW_AT_name("y1")
    3953                      .dwattr $C$DW$571, DW_AT_TI_symbol_name("_y1")
    3954                      .dwattr $C$DW$571, DW_AT_data_member_location[DW_OP_plus_uconst 0x8]
    3955                      .dwattr $C$DW$571, DW_AT_accessibility(DW_ACCESS_public)
    3956                      .dwendtag $C$DW$T$75
    3957              
    3958              $C$DW$T$132     .dwtag  DW_TAG_typedef, DW_AT_name("FILTER_FO_Obj")
    3959                      .dwattr $C$DW$T$132, DW_AT_type(*$C$DW$T$75)
    3960                      .dwattr $C$DW$T$132, DW_AT_language(DW_LANG_C)
    3961              
    3962              $C$DW$T$21      .dwtag  DW_TAG_structure_type
    3963                      .dwattr $C$DW$T$21, DW_AT_name("_FILTER_FO_Obj_")
    3964                      .dwattr $C$DW$T$21, DW_AT_declaration
    3965                      .dwendtag $C$DW$T$21
    3966              
    3967              $C$DW$T$133     .dwtag  DW_TAG_pointer_type
    3968                      .dwattr $C$DW$T$133, DW_AT_type(*$C$DW$T$21)
    3969                      .dwattr $C$DW$T$133, DW_AT_address_class(0x16)
    3970              $C$DW$T$134     .dwtag  DW_TAG_typedef, DW_AT_name("FILTER_FO_Handle")
    3971                      .dwattr $C$DW$T$134, DW_AT_type(*$C$DW$T$133)
    3972                      .dwattr $C$DW$T$134, DW_AT_language(DW_LANG_C)
    3973              
    3974              $C$DW$T$76      .dwtag  DW_TAG_structure_type
    3975                      .dwattr $C$DW$T$76, DW_AT_name("_FLASH_Obj_")
    3976                      .dwattr $C$DW$T$76, DW_AT_byte_size(0x08)
    3977              $C$DW$572       .dwtag  DW_TAG_member
    3978                      .dwattr $C$DW$572, DW_AT_type(*$C$DW$T$24)
    3979                      .dwattr $C$DW$572, DW_AT_name("FOPT")
    3980                      .dwattr $C$DW$572, DW_AT_TI_symbol_name("_FOPT")
    3981                      .dwattr $C$DW$572, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    3982                      .dwattr $C$DW$572, DW_AT_accessibility(DW_ACCESS_public)
    3983              $C$DW$573       .dwtag  DW_TAG_member
    3984                      .dwattr $C$DW$573, DW_AT_type(*$C$DW$T$24)
    3985                      .dwattr $C$DW$573, DW_AT_name("rsvd_1")
    3986                      .dwattr $C$DW$573, DW_AT_TI_symbol_name("_rsvd_1")
    3987                      .dwattr $C$DW$573, DW_AT_data_member_location[DW_OP_plus_uconst 0x1]
    3988                      .dwattr $C$DW$573, DW_AT_accessibility(DW_ACCESS_public)
    3989              $C$DW$574       .dwtag  DW_TAG_member
    3990                      .dwattr $C$DW$574, DW_AT_type(*$C$DW$T$24)
    3991                      .dwattr $C$DW$574, DW_AT_name("FPWR")
    3992                      .dwattr $C$DW$574, DW_AT_TI_symbol_name("_FPWR")
    3993                      .dwattr $C$DW$574, DW_AT_data_member_location[DW_OP_plus_uconst 0x2]
    3994                      .dwattr $C$DW$574, DW_AT_accessibility(DW_ACCESS_public)
    3995              $C$DW$575       .dwtag  DW_TAG_member
    3996                      .dwattr $C$DW$575, DW_AT_type(*$C$DW$T$24)
    3997                      .dwattr $C$DW$575, DW_AT_name("FSTATUS")
    3998                      .dwattr $C$DW$575, DW_AT_TI_symbol_name("_FSTATUS")
    3999                      .dwattr $C$DW$575, DW_AT_data_member_location[DW_OP_plus_uconst 0x3]
    4000                      .dwattr $C$DW$575, DW_AT_accessibility(DW_ACCESS_public)
    4001              $C$DW$576       .dwtag  DW_TAG_member
    4002                      .dwattr $C$DW$576, DW_AT_type(*$C$DW$T$24)
    4003                      .dwattr $C$DW$576, DW_AT_name("FSTDBYWAIT")
    4004                      .dwattr $C$DW$576, DW_AT_TI_symbol_name("_FSTDBYWAIT")
    4005                      .dwattr $C$DW$576, DW_AT_data_member_location[DW_OP_plus_uconst 0x4]
TMS320C2000 Assembler PC v6.2.5 Tue Jun 27 16:21:07 2017

Tools Copyright (c) 1996-2014 Texas Instruments Incorporated
C:\Users\wmj\AppData\Local\Temp\0694810                              PAGE   79

    4006                      .dwattr $C$DW$576, DW_AT_accessibility(DW_ACCESS_public)
    4007              $C$DW$577       .dwtag  DW_TAG_member
    4008                      .dwattr $C$DW$577, DW_AT_type(*$C$DW$T$24)
    4009                      .dwattr $C$DW$577, DW_AT_name("FACTIVEWAIT")
    4010                      .dwattr $C$DW$577, DW_AT_TI_symbol_name("_FACTIVEWAIT")
    4011                      .dwattr $C$DW$577, DW_AT_data_member_location[DW_OP_plus_uconst 0x5]
    4012                      .dwattr $C$DW$577, DW_AT_accessibility(DW_ACCESS_public)
    4013              $C$DW$578       .dwtag  DW_TAG_member
    4014                      .dwattr $C$DW$578, DW_AT_type(*$C$DW$T$24)
    4015                      .dwattr $C$DW$578, DW_AT_name("FBANKWAIT")
    4016                      .dwattr $C$DW$578, DW_AT_TI_symbol_name("_FBANKWAIT")
    4017                      .dwattr $C$DW$578, DW_AT_data_member_location[DW_OP_plus_uconst 0x6]
    4018                      .dwattr $C$DW$578, DW_AT_accessibility(DW_ACCESS_public)
    4019              $C$DW$579       .dwtag  DW_TAG_member
    4020                      .dwattr $C$DW$579, DW_AT_type(*$C$DW$T$24)
    4021                      .dwattr $C$DW$579, DW_AT_name("FOTPWAIT")
    4022                      .dwattr $C$DW$579, DW_AT_TI_symbol_name("_FOTPWAIT")
    4023                      .dwattr $C$DW$579, DW_AT_data_member_location[DW_OP_plus_uconst 0x7]
    4024                      .dwattr $C$DW$579, DW_AT_accessibility(DW_ACCESS_public)
    4025                      .dwendtag $C$DW$T$76
    4026              
    4027              $C$DW$T$89      .dwtag  DW_TAG_pointer_type
    4028                      .dwattr $C$DW$T$89, DW_AT_type(*$C$DW$T$76)
    4029                      .dwattr $C$DW$T$89, DW_AT_address_class(0x16)
    4030              $C$DW$T$90      .dwtag  DW_TAG_typedef, DW_AT_name("FLASH_Handle")
    4031                      .dwattr $C$DW$T$90, DW_AT_type(*$C$DW$T$89)
    4032                      .dwattr $C$DW$T$90, DW_AT_language(DW_LANG_C)
    4033              
    4034              $C$DW$T$80      .dwtag  DW_TAG_structure_type
    4035                      .dwattr $C$DW$T$80, DW_AT_name("_GPIO_Obj_")
    4036                      .dwattr $C$DW$T$80, DW_AT_byte_size(0x6a)
    4037              $C$DW$580       .dwtag  DW_TAG_member
    4038                      .dwattr $C$DW$580, DW_AT_type(*$C$DW$T$77)
    4039                      .dwattr $C$DW$580, DW_AT_name("GPACTRL")
    4040                      .dwattr $C$DW$580, DW_AT_TI_symbol_name("_GPACTRL")
    4041                      .dwattr $C$DW$580, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    4042                      .dwattr $C$DW$580, DW_AT_accessibility(DW_ACCESS_public)
    4043              $C$DW$581       .dwtag  DW_TAG_member
    4044                      .dwattr $C$DW$581, DW_AT_type(*$C$DW$T$77)
    4045                      .dwattr $C$DW$581, DW_AT_name("GPAQSEL1")
    4046                      .dwattr $C$DW$581, DW_AT_TI_symbol_name("_GPAQSEL1")
    4047                      .dwattr $C$DW$581, DW_AT_data_member_location[DW_OP_plus_uconst 0x2]
    4048                      .dwattr $C$DW$581, DW_AT_accessibility(DW_ACCESS_public)
    4049              $C$DW$582       .dwtag  DW_TAG_member
    4050                      .dwattr $C$DW$582, DW_AT_type(*$C$DW$T$77)
    4051                      .dwattr $C$DW$582, DW_AT_name("GPAQSEL2")
    4052                      .dwattr $C$DW$582, DW_AT_TI_symbol_name("_GPAQSEL2")
    4053                      .dwattr $C$DW$582, DW_AT_data_member_location[DW_OP_plus_uconst 0x4]
    4054                      .dwattr $C$DW$582, DW_AT_accessibility(DW_ACCESS_public)
    4055              $C$DW$583       .dwtag  DW_TAG_member
    4056                      .dwattr $C$DW$583, DW_AT_type(*$C$DW$T$77)
    4057                      .dwattr $C$DW$583, DW_AT_name("GPAMUX1")
    4058                      .dwattr $C$DW$583, DW_AT_TI_symbol_name("_GPAMUX1")
    4059                      .dwattr $C$DW$583, DW_AT_data_member_location[DW_OP_plus_uconst 0x6]
    4060                      .dwattr $C$DW$583, DW_AT_accessibility(DW_ACCESS_public)
TMS320C2000 Assembler PC v6.2.5 Tue Jun 27 16:21:07 2017

Tools Copyright (c) 1996-2014 Texas Instruments Incorporated
C:\Users\wmj\AppData\Local\Temp\0694810                              PAGE   80

    4061              $C$DW$584       .dwtag  DW_TAG_member
    4062                      .dwattr $C$DW$584, DW_AT_type(*$C$DW$T$77)
    4063                      .dwattr $C$DW$584, DW_AT_name("GPAMUX2")
    4064                      .dwattr $C$DW$584, DW_AT_TI_symbol_name("_GPAMUX2")
    4065                      .dwattr $C$DW$584, DW_AT_data_member_location[DW_OP_plus_uconst 0x8]
    4066                      .dwattr $C$DW$584, DW_AT_accessibility(DW_ACCESS_public)
    4067              $C$DW$585       .dwtag  DW_TAG_member
    4068                      .dwattr $C$DW$585, DW_AT_type(*$C$DW$T$77)
    4069                      .dwattr $C$DW$585, DW_AT_name("GPADIR")
    4070                      .dwattr $C$DW$585, DW_AT_TI_symbol_name("_GPADIR")
    4071                      .dwattr $C$DW$585, DW_AT_data_member_location[DW_OP_plus_uconst 0xa]
    4072                      .dwattr $C$DW$585, DW_AT_accessibility(DW_ACCESS_public)
    4073              $C$DW$586       .dwtag  DW_TAG_member
    4074                      .dwattr $C$DW$586, DW_AT_type(*$C$DW$T$77)
    4075                      .dwattr $C$DW$586, DW_AT_name("GPAPUD")
    4076                      .dwattr $C$DW$586, DW_AT_TI_symbol_name("_GPAPUD")
    4077                      .dwattr $C$DW$586, DW_AT_data_member_location[DW_OP_plus_uconst 0xc]
    4078                      .dwattr $C$DW$586, DW_AT_accessibility(DW_ACCESS_public)
    4079              $C$DW$587       .dwtag  DW_TAG_member
    4080                      .dwattr $C$DW$587, DW_AT_type(*$C$DW$T$27)
    4081                      .dwattr $C$DW$587, DW_AT_name("rsvd_1")
    4082                      .dwattr $C$DW$587, DW_AT_TI_symbol_name("_rsvd_1")
    4083                      .dwattr $C$DW$587, DW_AT_data_member_location[DW_OP_plus_uconst 0xe]
    4084                      .dwattr $C$DW$587, DW_AT_accessibility(DW_ACCESS_public)
    4085              $C$DW$588       .dwtag  DW_TAG_member
    4086                      .dwattr $C$DW$588, DW_AT_type(*$C$DW$T$77)
    4087                      .dwattr $C$DW$588, DW_AT_name("GPBCTRL")
    4088                      .dwattr $C$DW$588, DW_AT_TI_symbol_name("_GPBCTRL")
    4089                      .dwattr $C$DW$588, DW_AT_data_member_location[DW_OP_plus_uconst 0x10]
    4090                      .dwattr $C$DW$588, DW_AT_accessibility(DW_ACCESS_public)
    4091              $C$DW$589       .dwtag  DW_TAG_member
    4092                      .dwattr $C$DW$589, DW_AT_type(*$C$DW$T$77)
    4093                      .dwattr $C$DW$589, DW_AT_name("GPBQSEL1")
    4094                      .dwattr $C$DW$589, DW_AT_TI_symbol_name("_GPBQSEL1")
    4095                      .dwattr $C$DW$589, DW_AT_data_member_location[DW_OP_plus_uconst 0x12]
    4096                      .dwattr $C$DW$589, DW_AT_accessibility(DW_ACCESS_public)
    4097              $C$DW$590       .dwtag  DW_TAG_member
    4098                      .dwattr $C$DW$590, DW_AT_type(*$C$DW$T$27)
    4099                      .dwattr $C$DW$590, DW_AT_name("rsvd_2")
    4100                      .dwattr $C$DW$590, DW_AT_TI_symbol_name("_rsvd_2")
    4101                      .dwattr $C$DW$590, DW_AT_data_member_location[DW_OP_plus_uconst 0x14]
    4102                      .dwattr $C$DW$590, DW_AT_accessibility(DW_ACCESS_public)
    4103              $C$DW$591       .dwtag  DW_TAG_member
    4104                      .dwattr $C$DW$591, DW_AT_type(*$C$DW$T$77)
    4105                      .dwattr $C$DW$591, DW_AT_name("GPBMUX1")
    4106                      .dwattr $C$DW$591, DW_AT_TI_symbol_name("_GPBMUX1")
    4107                      .dwattr $C$DW$591, DW_AT_data_member_location[DW_OP_plus_uconst 0x16]
    4108                      .dwattr $C$DW$591, DW_AT_accessibility(DW_ACCESS_public)
    4109              $C$DW$592       .dwtag  DW_TAG_member
    4110                      .dwattr $C$DW$592, DW_AT_type(*$C$DW$T$27)
    4111                      .dwattr $C$DW$592, DW_AT_name("rsvd_3")
    4112                      .dwattr $C$DW$592, DW_AT_TI_symbol_name("_rsvd_3")
    4113                      .dwattr $C$DW$592, DW_AT_data_member_location[DW_OP_plus_uconst 0x18]
    4114                      .dwattr $C$DW$592, DW_AT_accessibility(DW_ACCESS_public)
    4115              $C$DW$593       .dwtag  DW_TAG_member
TMS320C2000 Assembler PC v6.2.5 Tue Jun 27 16:21:07 2017

Tools Copyright (c) 1996-2014 Texas Instruments Incorporated
C:\Users\wmj\AppData\Local\Temp\0694810                              PAGE   81

    4116                      .dwattr $C$DW$593, DW_AT_type(*$C$DW$T$77)
    4117                      .dwattr $C$DW$593, DW_AT_name("GPBDIR")
    4118                      .dwattr $C$DW$593, DW_AT_TI_symbol_name("_GPBDIR")
    4119                      .dwattr $C$DW$593, DW_AT_data_member_location[DW_OP_plus_uconst 0x1a]
    4120                      .dwattr $C$DW$593, DW_AT_accessibility(DW_ACCESS_public)
    4121              $C$DW$594       .dwtag  DW_TAG_member
    4122                      .dwattr $C$DW$594, DW_AT_type(*$C$DW$T$77)
    4123                      .dwattr $C$DW$594, DW_AT_name("GPBPUD")
    4124                      .dwattr $C$DW$594, DW_AT_TI_symbol_name("_GPBPUD")
    4125                      .dwattr $C$DW$594, DW_AT_data_member_location[DW_OP_plus_uconst 0x1c]
    4126                      .dwattr $C$DW$594, DW_AT_accessibility(DW_ACCESS_public)
    4127              $C$DW$595       .dwtag  DW_TAG_member
    4128                      .dwattr $C$DW$595, DW_AT_type(*$C$DW$T$78)
    4129                      .dwattr $C$DW$595, DW_AT_name("rsvd_4")
    4130                      .dwattr $C$DW$595, DW_AT_TI_symbol_name("_rsvd_4")
    4131                      .dwattr $C$DW$595, DW_AT_data_member_location[DW_OP_plus_uconst 0x1e]
    4132                      .dwattr $C$DW$595, DW_AT_accessibility(DW_ACCESS_public)
    4133              $C$DW$596       .dwtag  DW_TAG_member
    4134                      .dwattr $C$DW$596, DW_AT_type(*$C$DW$T$77)
    4135                      .dwattr $C$DW$596, DW_AT_name("AIOMUX1")
    4136                      .dwattr $C$DW$596, DW_AT_TI_symbol_name("_AIOMUX1")
    4137                      .dwattr $C$DW$596, DW_AT_data_member_location[DW_OP_plus_uconst 0x36]
    4138                      .dwattr $C$DW$596, DW_AT_accessibility(DW_ACCESS_public)
    4139              $C$DW$597       .dwtag  DW_TAG_member
    4140                      .dwattr $C$DW$597, DW_AT_type(*$C$DW$T$27)
    4141                      .dwattr $C$DW$597, DW_AT_name("rsvd_5")
    4142                      .dwattr $C$DW$597, DW_AT_TI_symbol_name("_rsvd_5")
    4143                      .dwattr $C$DW$597, DW_AT_data_member_location[DW_OP_plus_uconst 0x38]
    4144                      .dwattr $C$DW$597, DW_AT_accessibility(DW_ACCESS_public)
    4145              $C$DW$598       .dwtag  DW_TAG_member
    4146                      .dwattr $C$DW$598, DW_AT_type(*$C$DW$T$77)
    4147                      .dwattr $C$DW$598, DW_AT_name("AIODIR")
    4148                      .dwattr $C$DW$598, DW_AT_TI_symbol_name("_AIODIR")
    4149                      .dwattr $C$DW$598, DW_AT_data_member_location[DW_OP_plus_uconst 0x3a]
    4150                      .dwattr $C$DW$598, DW_AT_accessibility(DW_ACCESS_public)
    4151              $C$DW$599       .dwtag  DW_TAG_member
    4152                      .dwattr $C$DW$599, DW_AT_type(*$C$DW$T$79)
    4153                      .dwattr $C$DW$599, DW_AT_name("rsvd_6")
    4154                      .dwattr $C$DW$599, DW_AT_TI_symbol_name("_rsvd_6")
    4155                      .dwattr $C$DW$599, DW_AT_data_member_location[DW_OP_plus_uconst 0x3c]
    4156                      .dwattr $C$DW$599, DW_AT_accessibility(DW_ACCESS_public)
    4157              $C$DW$600       .dwtag  DW_TAG_member
    4158                      .dwattr $C$DW$600, DW_AT_type(*$C$DW$T$77)
    4159                      .dwattr $C$DW$600, DW_AT_name("GPADAT")
    4160                      .dwattr $C$DW$600, DW_AT_TI_symbol_name("_GPADAT")
    4161                      .dwattr $C$DW$600, DW_AT_data_member_location[DW_OP_plus_uconst 0x40]
    4162                      .dwattr $C$DW$600, DW_AT_accessibility(DW_ACCESS_public)
    4163              $C$DW$601       .dwtag  DW_TAG_member
    4164                      .dwattr $C$DW$601, DW_AT_type(*$C$DW$T$77)
    4165                      .dwattr $C$DW$601, DW_AT_name("GPASET")
    4166                      .dwattr $C$DW$601, DW_AT_TI_symbol_name("_GPASET")
    4167                      .dwattr $C$DW$601, DW_AT_data_member_location[DW_OP_plus_uconst 0x42]
    4168                      .dwattr $C$DW$601, DW_AT_accessibility(DW_ACCESS_public)
    4169              $C$DW$602       .dwtag  DW_TAG_member
    4170                      .dwattr $C$DW$602, DW_AT_type(*$C$DW$T$77)
TMS320C2000 Assembler PC v6.2.5 Tue Jun 27 16:21:07 2017

Tools Copyright (c) 1996-2014 Texas Instruments Incorporated
C:\Users\wmj\AppData\Local\Temp\0694810                              PAGE   82

    4171                      .dwattr $C$DW$602, DW_AT_name("GPACLEAR")
    4172                      .dwattr $C$DW$602, DW_AT_TI_symbol_name("_GPACLEAR")
    4173                      .dwattr $C$DW$602, DW_AT_data_member_location[DW_OP_plus_uconst 0x44]
    4174                      .dwattr $C$DW$602, DW_AT_accessibility(DW_ACCESS_public)
    4175              $C$DW$603       .dwtag  DW_TAG_member
    4176                      .dwattr $C$DW$603, DW_AT_type(*$C$DW$T$77)
    4177                      .dwattr $C$DW$603, DW_AT_name("GPATOGGLE")
    4178                      .dwattr $C$DW$603, DW_AT_TI_symbol_name("_GPATOGGLE")
