TMS320C2000 Assembler PC v6.2.5 Tue Oct 10 18:48:26 2017

Tools Copyright (c) 1996-2014 Texas Instruments Incorporated
C:\Users\wmj\AppData\Local\Temp\0239610                              PAGE    1

       1              ;***************************************************************
       2              ;* TMS320C2000 C/C++ Codegen                         PC v6.2.5 *
       3              ;* Date/Time created: Tue Oct 10 18:48:25 2017                 *
       4              ;***************************************************************
       5                      .compiler_opts --float_support=softlib --hll_source=on --mem_model:code=flat --mem_model:data=large -
       6        0002  FP      .set    XAR2
       7              
       8              $C$DW$CU        .dwtag  DW_TAG_compile_unit
       9                      .dwattr $C$DW$CU, DW_AT_name("D:/BM1000/sw/modules/user/src/32b/user.c")
      10                      .dwattr $C$DW$CU, DW_AT_producer("TMS320C2000 C/C++ Codegen PC v6.2.5 Copyright (c) 1996-2014 Texas I
      11                      .dwattr $C$DW$CU, DW_AT_TI_version(0x01)
      12                      .dwattr $C$DW$CU, DW_AT_comp_dir("D:\BM1000\sw\solutions\instaspin_foc\boards\hvkit_rev1p1\f28x\f2802
      13              
      14              $C$DW$1 .dwtag  DW_TAG_subprogram, DW_AT_name("EST_setLs_qFmt")
      15                      .dwattr $C$DW$1, DW_AT_TI_symbol_name("_EST_setLs_qFmt")

    6507              $C$DW$620       .dwtag  DW_TAG_enumerator, DW_AT_name("USER_ErrorCode_maxCurrentSlope_High"), DW_AT_const_val
    6508              $C$DW$621       .dwtag  DW_TAG_enumerator, DW_AT_name("USER_ErrorCode_maxCurrentSlope_Low"), DW_AT_const_valu
    6509              $C$DW$622       .dwtag  DW_TAG_enumerator, DW_AT_name("USER_ErrorCode_maxCurrentSlope_powerWarp_High"), DW_AT
    6510              $C$DW$623       .dwtag  DW_TAG_enumerator, DW_AT_name("USER_ErrorCode_maxCurrentSlope_powerWarp_Low"), DW_AT_
    6511              $C$DW$624       .dwtag  DW_TAG_enumerator, DW_AT_name("USER_ErrorCode_IdRated_High"), DW_AT_const_value(0x54)
    6512              $C$DW$625       .dwtag  DW_TAG_enumerator, DW_AT_name("USER_ErrorCode_IdRated_Low"), DW_AT_const_value(0x55)
    6513              $C$DW$626       .dwtag  DW_TAG_enumerator, DW_AT_name("USER_ErrorCode_IdRatedFraction_indEst_High"), DW_AT_co
    6514              $C$DW$627       .dwtag  DW_TAG_enumerator, DW_AT_name("USER_ErrorCode_IdRatedFraction_indEst_Low"), DW_AT_con
    6515              $C$DW$628       .dwtag  DW_TAG_enumerator, DW_AT_name("USER_ErrorCode_IdRatedFraction_ratedFlux_High"), DW_AT
    6516              $C$DW$629       .dwtag  DW_TAG_enumerator, DW_AT_name("USER_ErrorCode_IdRatedFraction_ratedFlux_Low"), DW_AT_
    6517              $C$DW$630       .dwtag  DW_TAG_enumerator, DW_AT_name("USER_ErrorCode_IdRated_delta_High"), DW_AT_const_value
    6518              $C$DW$631       .dwtag  DW_TAG_enumerator, DW_AT_name("USER_ErrorCode_IdRated_delta_Low"), DW_AT_const_value(
    6519              $C$DW$632       .dwtag  DW_TAG_enumerator, DW_AT_name("USER_ErrorCode_fluxEstFreq_Hz_High"), DW_AT_const_valu
    6520              $C$DW$633       .dwtag  DW_TAG_enumerator, DW_AT_name("USER_ErrorCode_fluxEstFreq_Hz_Low"), DW_AT_const_value
    6521              $C$DW$634       .dwtag  DW_TAG_enumerator, DW_AT_name("USER_ErrorCode_ctrlFreq_Hz_High"), DW_AT_const_value(0
    6522              $C$DW$635       .dwtag  DW_TAG_enumerator, DW_AT_name("USER_ErrorCode_ctrlFreq_Hz_Low"), DW_AT_const_value(0x
    6523              $C$DW$636       .dwtag  DW_TAG_enumerator, DW_AT_name("USER_ErrorCode_estFreq_Hz_High"), DW_AT_const_value(0x
TMS320C2000 Assembler PC v6.2.5 Tue Oct 10 18:48:26 2017

Tools Copyright (c) 1996-2014 Texas Instruments Incorporated
C:\Users\wmj\AppData\Local\Temp\0239610                              PAGE  133

    6524              $C$DW$637       .dwtag  DW_TAG_enumerator, DW_AT_name("USER_ErrorCode_estFreq_Hz_Low"), DW_AT_const_value(0x6
    6525              $C$DW$638       .dwtag  DW_TAG_enumerator, DW_AT_name("USER_ErrorCode_RoverL_estFreq_Hz_High"), DW_AT_const_v
    6526              $C$DW$639       .dwtag  DW_TAG_enumerator, DW_AT_name("USER_ErrorCode_RoverL_estFreq_Hz_Low"), DW_AT_const_va
    6527              $C$DW$640       .dwtag  DW_TAG_enumerator, DW_AT_name("USER_ErrorCode_trajFreq_Hz_High"), DW_AT_const_value(0
    6528              $C$DW$641       .dwtag  DW_TAG_enumerator, DW_AT_name("USER_ErrorCode_trajFreq_Hz_Low"), DW_AT_const_value(0x
    6529              $C$DW$642       .dwtag  DW_TAG_enumerator, DW_AT_name("USER_ErrorCode_ctrlPeriod_sec_High"), DW_AT_const_valu
    6530              $C$DW$643       .dwtag  DW_TAG_enumerator, DW_AT_name("USER_ErrorCode_ctrlPeriod_sec_Low"), DW_AT_const_value
    6531              $C$DW$644       .dwtag  DW_TAG_enumerator, DW_AT_name("USER_ErrorCode_maxNegativeIdCurrent_a_High"), DW_AT_co
    6532              $C$DW$645       .dwtag  DW_TAG_enumerator, DW_AT_name("USER_ErrorCode_maxNegativeIdCurrent_a_Low"), DW_AT_con
    6533              $C$DW$646       .dwtag  DW_TAG_enumerator, DW_AT_name("USER_numErrorCodes"), DW_AT_const_value(0x6a)
    6534                      .dwendtag $C$DW$T$78
    6535              
    6536              $C$DW$T$79      .dwtag  DW_TAG_typedef, DW_AT_name("USER_ErrorCode_e")
    6537                      .dwattr $C$DW$T$79, DW_AT_type(*$C$DW$T$78)
    6538                      .dwattr $C$DW$T$79, DW_AT_language(DW_LANG_C)
    6539              $C$DW$647       .dwtag  DW_TAG_TI_far_type
    6540                      .dwattr $C$DW$647, DW_AT_type(*$C$DW$T$79)
    6541              $C$DW$T$83      .dwtag  DW_TAG_const_type
    6542                      .dwattr $C$DW$T$83, DW_AT_type(*$C$DW$647)
    6543              
    6544              $C$DW$T$88      .dwtag  DW_TAG_enumeration_type
    6545                      .dwattr $C$DW$T$88, DW_AT_byte_size(0x01)
    6546              $C$DW$648       .dwtag  DW_TAG_enumerator, DW_AT_name("CTRL_Type_PID_spd"), DW_AT_const_value(0x00)
    6547              $C$DW$649       .dwtag  DW_TAG_enumerator, DW_AT_name("CTRL_Type_PID_Id"), DW_AT_const_value(0x01)
    6548              $C$DW$650       .dwtag  DW_TAG_enumerator, DW_AT_name("CTRL_Type_PID_Iq"), DW_AT_const_value(0x02)
    6549                      .dwendtag $C$DW$T$88
    6550              
    6551              $C$DW$T$89      .dwtag  DW_TAG_typedef, DW_AT_name("CTRL_Type_e")
    6552                      .dwattr $C$DW$T$89, DW_AT_type(*$C$DW$T$88)
    6553                      .dwattr $C$DW$T$89, DW_AT_language(DW_LANG_C)
    6554              $C$DW$651       .dwtag  DW_TAG_TI_far_type
    6555                      .dwattr $C$DW$651, DW_AT_type(*$C$DW$T$89)
    6556              $C$DW$T$90      .dwtag  DW_TAG_const_type
    6557                      .dwattr $C$DW$T$90, DW_AT_type(*$C$DW$651)
    6558              
    6559              $C$DW$T$23      .dwtag  DW_TAG_structure_type
    6560                      .dwattr $C$DW$T$23, DW_AT_name("_BRAKE_Obj_")
    6561                      .dwattr $C$DW$T$23, DW_AT_byte_size(0x08)
    6562              $C$DW$652       .dwtag  DW_TAG_member
    6563                      .dwattr $C$DW$652, DW_AT_type(*$C$DW$T$20)
    6564                      .dwattr $C$DW$652, DW_AT_name("angle_pu")
    6565                      .dwattr $C$DW$652, DW_AT_TI_symbol_name("_angle_pu")
    6566                      .dwattr $C$DW$652, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    6567                      .dwattr $C$DW$652, DW_AT_accessibility(DW_ACCESS_public)
    6568              $C$DW$653       .dwtag  DW_TAG_member
    6569                      .dwattr $C$DW$653, DW_AT_type(*$C$DW$T$21)
    6570                      .dwattr $C$DW$653, DW_AT_name("Idq_brake")
    6571                      .dwattr $C$DW$653, DW_AT_TI_symbol_name("_Idq_brake")
    6572                      .dwattr $C$DW$653, DW_AT_data_member_location[DW_OP_plus_uconst 0x2]
    6573                      .dwattr $C$DW$653, DW_AT_accessibility(DW_ACCESS_public)
    6574              $C$DW$654       .dwtag  DW_TAG_member
    6575                      .dwattr $C$DW$654, DW_AT_type(*$C$DW$T$22)
    6576                      .dwattr $C$DW$654, DW_AT_name("brake_enable")
    6577                      .dwattr $C$DW$654, DW_AT_TI_symbol_name("_brake_enable")
    6578                      .dwattr $C$DW$654, DW_AT_data_member_location[DW_OP_plus_uconst 0x6]
TMS320C2000 Assembler PC v6.2.5 Tue Oct 10 18:48:26 2017

Tools Copyright (c) 1996-2014 Texas Instruments Incorporated
C:\Users\wmj\AppData\Local\Temp\0239610                              PAGE  134

    6579                      .dwattr $C$DW$654, DW_AT_accessibility(DW_ACCESS_public)
    6580                      .dwendtag $C$DW$T$23
    6581              
    6582              $C$DW$T$60      .dwtag  DW_TAG_typedef, DW_AT_name("BRAKE_Obj")
    6583                      .dwattr $C$DW$T$60, DW_AT_type(*$C$DW$T$23)
    6584                      .dwattr $C$DW$T$60, DW_AT_language(DW_LANG_C)
    6585              $C$DW$T$58      .dwtag  DW_TAG_pointer_type
    6586                      .dwattr $C$DW$T$58, DW_AT_type(*$C$DW$T$23)
    6587                      .dwattr $C$DW$T$58, DW_AT_address_class(0x16)
    6588              $C$DW$T$59      .dwtag  DW_TAG_typedef, DW_AT_name("BRAKE_Handle")
    6589                      .dwattr $C$DW$T$59, DW_AT_type(*$C$DW$T$58)
    6590                      .dwattr $C$DW$T$59, DW_AT_language(DW_LANG_C)
    6591              
    6592              $C$DW$T$26      .dwtag  DW_TAG_structure_type
    6593                      .dwattr $C$DW$T$26, DW_AT_name("_CLARKE_Obj_")
    6594                      .dwattr $C$DW$T$26, DW_AT_byte_size(0x06)
    6595              $C$DW$655       .dwtag  DW_TAG_member
    6596                      .dwattr $C$DW$655, DW_AT_type(*$C$DW$T$20)
    6597                      .dwattr $C$DW$655, DW_AT_name("alpha_sf")
    6598                      .dwattr $C$DW$655, DW_AT_TI_symbol_name("_alpha_sf")
    6599                      .dwattr $C$DW$655, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    6600                      .dwattr $C$DW$655, DW_AT_accessibility(DW_ACCESS_public)
    6601              $C$DW$656       .dwtag  DW_TAG_member
    6602                      .dwattr $C$DW$656, DW_AT_type(*$C$DW$T$20)
    6603                      .dwattr $C$DW$656, DW_AT_name("beta_sf")
    6604                      .dwattr $C$DW$656, DW_AT_TI_symbol_name("_beta_sf")
    6605                      .dwattr $C$DW$656, DW_AT_data_member_location[DW_OP_plus_uconst 0x2]
    6606                      .dwattr $C$DW$656, DW_AT_accessibility(DW_ACCESS_public)
    6607              $C$DW$657       .dwtag  DW_TAG_member
    6608                      .dwattr $C$DW$657, DW_AT_type(*$C$DW$T$25)
    6609                      .dwattr $C$DW$657, DW_AT_name("numSensors")
    6610                      .dwattr $C$DW$657, DW_AT_TI_symbol_name("_numSensors")
    6611                      .dwattr $C$DW$657, DW_AT_data_member_location[DW_OP_plus_uconst 0x4]
    6612                      .dwattr $C$DW$657, DW_AT_accessibility(DW_ACCESS_public)
    6613                      .dwendtag $C$DW$T$26
    6614              
    6615              $C$DW$T$34      .dwtag  DW_TAG_typedef, DW_AT_name("CLARKE_Obj")
    6616                      .dwattr $C$DW$T$34, DW_AT_type(*$C$DW$T$26)
    6617                      .dwattr $C$DW$T$34, DW_AT_language(DW_LANG_C)
    6618              $C$DW$T$32      .dwtag  DW_TAG_pointer_type
    6619                      .dwattr $C$DW$T$32, DW_AT_type(*$C$DW$T$26)
    6620                      .dwattr $C$DW$T$32, DW_AT_address_class(0x16)
    6621              $C$DW$T$33      .dwtag  DW_TAG_typedef, DW_AT_name("CLARKE_Handle")
    6622                      .dwattr $C$DW$T$33, DW_AT_type(*$C$DW$T$32)
    6623                      .dwattr $C$DW$T$33, DW_AT_language(DW_LANG_C)
    6624              
    6625              $C$DW$T$61      .dwtag  DW_TAG_structure_type
    6626                      .dwattr $C$DW$T$61, DW_AT_name("_CTRL_Obj_")
    6627                      .dwattr $C$DW$T$61, DW_AT_byte_size(0x112)
    6628              $C$DW$658       .dwtag  DW_TAG_member
    6629                      .dwattr $C$DW$658, DW_AT_type(*$C$DW$T$27)
    6630                      .dwattr $C$DW$658, DW_AT_name("version")
    6631                      .dwattr $C$DW$658, DW_AT_TI_symbol_name("_version")
    6632                      .dwattr $C$DW$658, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    6633                      .dwattr $C$DW$658, DW_AT_accessibility(DW_ACCESS_public)
TMS320C2000 Assembler PC v6.2.5 Tue Oct 10 18:48:26 2017

Tools Copyright (c) 1996-2014 Texas Instruments Incorporated
C:\Users\wmj\AppData\Local\Temp\0239610                              PAGE  135

    6634              $C$DW$659       .dwtag  DW_TAG_member
    6635                      .dwattr $C$DW$659, DW_AT_type(*$C$DW$T$29)
    6636                      .dwattr $C$DW$659, DW_AT_name("state")
    6637                      .dwattr $C$DW$659, DW_AT_TI_symbol_name("_state")
    6638                      .dwattr $C$DW$659, DW_AT_data_member_location[DW_OP_plus_uconst 0x4]
    6639                      .dwattr $C$DW$659, DW_AT_accessibility(DW_ACCESS_public)
    6640              $C$DW$660       .dwtag  DW_TAG_member
    6641                      .dwattr $C$DW$660, DW_AT_type(*$C$DW$T$29)
    6642                      .dwattr $C$DW$660, DW_AT_name("prevState")
    6643                      .dwattr $C$DW$660, DW_AT_TI_symbol_name("_prevState")
    6644                      .dwattr $C$DW$660, DW_AT_data_member_location[DW_OP_plus_uconst 0x5]
    6645                      .dwattr $C$DW$660, DW_AT_accessibility(DW_ACCESS_public)
    6646              $C$DW$661       .dwtag  DW_TAG_member
    6647                      .dwattr $C$DW$661, DW_AT_type(*$C$DW$T$31)
    6648                      .dwattr $C$DW$661, DW_AT_name("errorCode")
    6649                      .dwattr $C$DW$661, DW_AT_TI_symbol_name("_errorCode")
    6650                      .dwattr $C$DW$661, DW_AT_data_member_location[DW_OP_plus_uconst 0x6]
    6651                      .dwattr $C$DW$661, DW_AT_accessibility(DW_ACCESS_public)
    6652              $C$DW$662       .dwtag  DW_TAG_member
    6653                      .dwattr $C$DW$662, DW_AT_type(*$C$DW$T$33)
    6654                      .dwattr $C$DW$662, DW_AT_name("clarkeHandle_I")
    6655                      .dwattr $C$DW$662, DW_AT_TI_symbol_name("_clarkeHandle_I")
    6656                      .dwattr $C$DW$662, DW_AT_data_member_location[DW_OP_plus_uconst 0x8]
    6657                      .dwattr $C$DW$662, DW_AT_accessibility(DW_ACCESS_public)
    6658              $C$DW$663       .dwtag  DW_TAG_member
    6659                      .dwattr $C$DW$663, DW_AT_type(*$C$DW$T$34)
    6660                      .dwattr $C$DW$663, DW_AT_name("clarke_I")
    6661                      .dwattr $C$DW$663, DW_AT_TI_symbol_name("_clarke_I")
    6662                      .dwattr $C$DW$663, DW_AT_data_member_location[DW_OP_plus_uconst 0xa]
    6663                      .dwattr $C$DW$663, DW_AT_accessibility(DW_ACCESS_public)
    6664              $C$DW$664       .dwtag  DW_TAG_member
    6665                      .dwattr $C$DW$664, DW_AT_type(*$C$DW$T$33)
    6666                      .dwattr $C$DW$664, DW_AT_name("clarkeHandle_V")
    6667                      .dwattr $C$DW$664, DW_AT_TI_symbol_name("_clarkeHandle_V")
    6668                      .dwattr $C$DW$664, DW_AT_data_member_location[DW_OP_plus_uconst 0x10]
    6669                      .dwattr $C$DW$664, DW_AT_accessibility(DW_ACCESS_public)
    6670              $C$DW$665       .dwtag  DW_TAG_member
    6671                      .dwattr $C$DW$665, DW_AT_type(*$C$DW$T$34)
    6672                      .dwattr $C$DW$665, DW_AT_name("clarke_V")
    6673                      .dwattr $C$DW$665, DW_AT_TI_symbol_name("_clarke_V")
    6674                      .dwattr $C$DW$665, DW_AT_data_member_location[DW_OP_plus_uconst 0x12]
    6675                      .dwattr $C$DW$665, DW_AT_accessibility(DW_ACCESS_public)
    6676              $C$DW$666       .dwtag  DW_TAG_member
    6677                      .dwattr $C$DW$666, DW_AT_type(*$C$DW$T$36)
    6678                      .dwattr $C$DW$666, DW_AT_name("estHandle")
    6679                      .dwattr $C$DW$666, DW_AT_TI_symbol_name("_estHandle")
    6680                      .dwattr $C$DW$666, DW_AT_data_member_location[DW_OP_plus_uconst 0x18]
    6681                      .dwattr $C$DW$666, DW_AT_accessibility(DW_ACCESS_public)
    6682              $C$DW$667       .dwtag  DW_TAG_member
    6683                      .dwattr $C$DW$667, DW_AT_type(*$C$DW$T$38)
    6684                      .dwattr $C$DW$667, DW_AT_name("parkHandle")
    6685                      .dwattr $C$DW$667, DW_AT_TI_symbol_name("_parkHandle")
    6686                      .dwattr $C$DW$667, DW_AT_data_member_location[DW_OP_plus_uconst 0x1a]
    6687                      .dwattr $C$DW$667, DW_AT_accessibility(DW_ACCESS_public)
    6688              $C$DW$668       .dwtag  DW_TAG_member
TMS320C2000 Assembler PC v6.2.5 Tue Oct 10 18:48:26 2017

Tools Copyright (c) 1996-2014 Texas Instruments Incorporated
C:\Users\wmj\AppData\Local\Temp\0239610                              PAGE  136

    6689                      .dwattr $C$DW$668, DW_AT_type(*$C$DW$T$39)
    6690                      .dwattr $C$DW$668, DW_AT_name("park")
    6691                      .dwattr $C$DW$668, DW_AT_TI_symbol_name("_park")
    6692                      .dwattr $C$DW$668, DW_AT_data_member_location[DW_OP_plus_uconst 0x1c]
    6693                      .dwattr $C$DW$668, DW_AT_accessibility(DW_ACCESS_public)
    6694              $C$DW$669       .dwtag  DW_TAG_member
    6695                      .dwattr $C$DW$669, DW_AT_type(*$C$DW$T$41)
    6696                      .dwattr $C$DW$669, DW_AT_name("pidHandle_Id")
    6697                      .dwattr $C$DW$669, DW_AT_TI_symbol_name("_pidHandle_Id")
    6698                      .dwattr $C$DW$669, DW_AT_data_member_location[DW_OP_plus_uconst 0x20]
    6699                      .dwattr $C$DW$669, DW_AT_accessibility(DW_ACCESS_public)
    6700              $C$DW$670       .dwtag  DW_TAG_member
    6701                      .dwattr $C$DW$670, DW_AT_type(*$C$DW$T$42)
    6702                      .dwattr $C$DW$670, DW_AT_name("pid_Id")
    6703                      .dwattr $C$DW$670, DW_AT_TI_symbol_name("_pid_Id")
    6704                      .dwattr $C$DW$670, DW_AT_data_member_location[DW_OP_plus_uconst 0x22]
    6705                      .dwattr $C$DW$670, DW_AT_accessibility(DW_ACCESS_public)
    6706              $C$DW$671       .dwtag  DW_TAG_member
    6707                      .dwattr $C$DW$671, DW_AT_type(*$C$DW$T$41)
    6708                      .dwattr $C$DW$671, DW_AT_name("pidHandle_Iq")
    6709                      .dwattr $C$DW$671, DW_AT_TI_symbol_name("_pidHandle_Iq")
    6710                      .dwattr $C$DW$671, DW_AT_data_member_location[DW_OP_plus_uconst 0x32]
    6711                      .dwattr $C$DW$671, DW_AT_accessibility(DW_ACCESS_public)
    6712              $C$DW$672       .dwtag  DW_TAG_member
    6713                      .dwattr $C$DW$672, DW_AT_type(*$C$DW$T$42)
    6714                      .dwattr $C$DW$672, DW_AT_name("pid_Iq")
    6715                      .dwattr $C$DW$672, DW_AT_TI_symbol_name("_pid_Iq")
    6716                      .dwattr $C$DW$672, DW_AT_data_member_location[DW_OP_plus_uconst 0x34]
    6717                      .dwattr $C$DW$672, DW_AT_accessibility(DW_ACCESS_public)
    6718              $C$DW$673       .dwtag  DW_TAG_member
    6719                      .dwattr $C$DW$673, DW_AT_type(*$C$DW$T$41)
    6720                      .dwattr $C$DW$673, DW_AT_name("pidHandle_spd")
    6721                      .dwattr $C$DW$673, DW_AT_TI_symbol_name("_pidHandle_spd")
    6722                      .dwattr $C$DW$673, DW_AT_data_member_location[DW_OP_plus_uconst 0x44]
    6723                      .dwattr $C$DW$673, DW_AT_accessibility(DW_ACCESS_public)
    6724              $C$DW$674       .dwtag  DW_TAG_member
    6725                      .dwattr $C$DW$674, DW_AT_type(*$C$DW$T$42)
    6726                      .dwattr $C$DW$674, DW_AT_name("pid_spd")
    6727                      .dwattr $C$DW$674, DW_AT_TI_symbol_name("_pid_spd")
    6728                      .dwattr $C$DW$674, DW_AT_data_member_location[DW_OP_plus_uconst 0x46]
    6729                      .dwattr $C$DW$674, DW_AT_accessibility(DW_ACCESS_public)
    6730              $C$DW$675       .dwtag  DW_TAG_member
    6731                      .dwattr $C$DW$675, DW_AT_type(*$C$DW$T$44)
    6732                      .dwattr $C$DW$675, DW_AT_name("iparkHandle")
    6733                      .dwattr $C$DW$675, DW_AT_TI_symbol_name("_iparkHandle")
    6734                      .dwattr $C$DW$675, DW_AT_data_member_location[DW_OP_plus_uconst 0x56]
    6735                      .dwattr $C$DW$675, DW_AT_accessibility(DW_ACCESS_public)
    6736              $C$DW$676       .dwtag  DW_TAG_member
    6737                      .dwattr $C$DW$676, DW_AT_type(*$C$DW$T$45)
    6738                      .dwattr $C$DW$676, DW_AT_name("ipark")
    6739                      .dwattr $C$DW$676, DW_AT_TI_symbol_name("_ipark")
    6740                      .dwattr $C$DW$676, DW_AT_data_member_location[DW_OP_plus_uconst 0x58]
    6741                      .dwattr $C$DW$676, DW_AT_accessibility(DW_ACCESS_public)
    6742              $C$DW$677       .dwtag  DW_TAG_member
    6743                      .dwattr $C$DW$677, DW_AT_type(*$C$DW$T$47)
TMS320C2000 Assembler PC v6.2.5 Tue Oct 10 18:48:26 2017

Tools Copyright (c) 1996-2014 Texas Instruments Incorporated
C:\Users\wmj\AppData\Local\Temp\0239610                              PAGE  137

    6744                      .dwattr $C$DW$677, DW_AT_name("svgenHandle")
    6745                      .dwattr $C$DW$677, DW_AT_TI_symbol_name("_svgenHandle")
    6746                      .dwattr $C$DW$677, DW_AT_data_member_location[DW_OP_plus_uconst 0x5c]
    6747                      .dwattr $C$DW$677, DW_AT_accessibility(DW_ACCESS_public)
    6748              $C$DW$678       .dwtag  DW_TAG_member
    6749                      .dwattr $C$DW$678, DW_AT_type(*$C$DW$T$48)
    6750                      .dwattr $C$DW$678, DW_AT_name("svgen")
    6751                      .dwattr $C$DW$678, DW_AT_TI_symbol_name("_svgen")
    6752                      .dwattr $C$DW$678, DW_AT_data_member_location[DW_OP_plus_uconst 0x5e]
    6753                      .dwattr $C$DW$678, DW_AT_accessibility(DW_ACCESS_public)
    6754              $C$DW$679       .dwtag  DW_TAG_member
    6755                      .dwattr $C$DW$679, DW_AT_type(*$C$DW$T$50)
    6756                      .dwattr $C$DW$679, DW_AT_name("trajHandle_Id")
    6757                      .dwattr $C$DW$679, DW_AT_TI_symbol_name("_trajHandle_Id")
    6758                      .dwattr $C$DW$679, DW_AT_data_member_location[DW_OP_plus_uconst 0x60]
    6759                      .dwattr $C$DW$679, DW_AT_accessibility(DW_ACCESS_public)
    6760              $C$DW$680       .dwtag  DW_TAG_member
    6761                      .dwattr $C$DW$680, DW_AT_type(*$C$DW$T$51)
    6762                      .dwattr $C$DW$680, DW_AT_name("traj_Id")
    6763                      .dwattr $C$DW$680, DW_AT_TI_symbol_name("_traj_Id")
    6764                      .dwattr $C$DW$680, DW_AT_data_member_location[DW_OP_plus_uconst 0x62]
    6765                      .dwattr $C$DW$680, DW_AT_accessibility(DW_ACCESS_public)
    6766              $C$DW$681       .dwtag  DW_TAG_member
    6767                      .dwattr $C$DW$681, DW_AT_type(*$C$DW$T$50)
    6768                      .dwattr $C$DW$681, DW_AT_name("trajHandle_spd")
    6769                      .dwattr $C$DW$681, DW_AT_TI_symbol_name("_trajHandle_spd")
    6770                      .dwattr $C$DW$681, DW_AT_data_member_location[DW_OP_plus_uconst 0x6c]
    6771                      .dwattr $C$DW$681, DW_AT_accessibility(DW_ACCESS_public)
    6772              $C$DW$682       .dwtag  DW_TAG_member
    6773                      .dwattr $C$DW$682, DW_AT_type(*$C$DW$T$51)
    6774                      .dwattr $C$DW$682, DW_AT_name("traj_spd")
    6775                      .dwattr $C$DW$682, DW_AT_TI_symbol_name("_traj_spd")
    6776                      .dwattr $C$DW$682, DW_AT_data_member_location[DW_OP_plus_uconst 0x6e]
    6777                      .dwattr $C$DW$682, DW_AT_accessibility(DW_ACCESS_public)
    6778              $C$DW$683       .dwtag  DW_TAG_member
    6779                      .dwattr $C$DW$683, DW_AT_type(*$C$DW$T$50)
    6780                      .dwattr $C$DW$683, DW_AT_name("trajHandle_spdMax")
    6781                      .dwattr $C$DW$683, DW_AT_TI_symbol_name("_trajHandle_spdMax")
    6782                      .dwattr $C$DW$683, DW_AT_data_member_location[DW_OP_plus_uconst 0x78]
    6783                      .dwattr $C$DW$683, DW_AT_accessibility(DW_ACCESS_public)
    6784              $C$DW$684       .dwtag  DW_TAG_member
    6785                      .dwattr $C$DW$684, DW_AT_type(*$C$DW$T$51)
    6786                      .dwattr $C$DW$684, DW_AT_name("traj_spdMax")
    6787                      .dwattr $C$DW$684, DW_AT_TI_symbol_name("_traj_spdMax")
    6788                      .dwattr $C$DW$684, DW_AT_data_member_location[DW_OP_plus_uconst 0x7a]
    6789                      .dwattr $C$DW$684, DW_AT_accessibility(DW_ACCESS_public)
    6790              $C$DW$685       .dwtag  DW_TAG_member
    6791                      .dwattr $C$DW$685, DW_AT_type(*$C$DW$T$52)
    6792                      .dwattr $C$DW$685, DW_AT_name("motorParams")
    6793                      .dwattr $C$DW$685, DW_AT_TI_symbol_name("_motorParams")
    6794                      .dwattr $C$DW$685, DW_AT_data_member_location[DW_OP_plus_uconst 0x84]
    6795                      .dwattr $C$DW$685, DW_AT_accessibility(DW_ACCESS_public)
    6796              $C$DW$686       .dwtag  DW_TAG_member
    6797                      .dwattr $C$DW$686, DW_AT_type(*$C$DW$T$55)
    6798                      .dwattr $C$DW$686, DW_AT_name("waitTimes")
TMS320C2000 Assembler PC v6.2.5 Tue Oct 10 18:48:26 2017

Tools Copyright (c) 1996-2014 Texas Instruments Incorporated
C:\Users\wmj\AppData\Local\Temp\0239610                              PAGE  138

    6799                      .dwattr $C$DW$686, DW_AT_TI_symbol_name("_waitTimes")
    6800                      .dwattr $C$DW$686, DW_AT_data_member_location[DW_OP_plus_uconst 0x92]
    6801                      .dwattr $C$DW$686, DW_AT_accessibility(DW_ACCESS_public)
    6802              $C$DW$687       .dwtag  DW_TAG_member
    6803                      .dwattr $C$DW$687, DW_AT_type(*$C$DW$T$54)
    6804                      .dwattr $C$DW$687, DW_AT_name("counter_state")
    6805                      .dwattr $C$DW$687, DW_AT_TI_symbol_name("_counter_state")
    6806                      .dwattr $C$DW$687, DW_AT_data_member_location[DW_OP_plus_uconst 0x9a]
    6807                      .dwattr $C$DW$687, DW_AT_accessibility(DW_ACCESS_public)
    6808              $C$DW$688       .dwtag  DW_TAG_member
    6809                      .dwattr $C$DW$688, DW_AT_type(*$C$DW$T$56)
    6810                      .dwattr $C$DW$688, DW_AT_name("numIsrTicksPerCtrlTick")
    6811                      .dwattr $C$DW$688, DW_AT_TI_symbol_name("_numIsrTicksPerCtrlTick")
    6812                      .dwattr $C$DW$688, DW_AT_data_member_location[DW_OP_plus_uconst 0x9c]
    6813                      .dwattr $C$DW$688, DW_AT_accessibility(DW_ACCESS_public)
    6814              $C$DW$689       .dwtag  DW_TAG_member
    6815                      .dwattr $C$DW$689, DW_AT_type(*$C$DW$T$56)
    6816                      .dwattr $C$DW$689, DW_AT_name("numCtrlTicksPerCurrentTick")
    6817                      .dwattr $C$DW$689, DW_AT_TI_symbol_name("_numCtrlTicksPerCurrentTick")
    6818                      .dwattr $C$DW$689, DW_AT_data_member_location[DW_OP_plus_uconst 0x9d]
    6819                      .dwattr $C$DW$689, DW_AT_accessibility(DW_ACCESS_public)
    6820              $C$DW$690       .dwtag  DW_TAG_member
    6821                      .dwattr $C$DW$690, DW_AT_type(*$C$DW$T$56)
    6822                      .dwattr $C$DW$690, DW_AT_name("numCtrlTicksPerSpeedTick")
    6823                      .dwattr $C$DW$690, DW_AT_TI_symbol_name("_numCtrlTicksPerSpeedTick")
    6824                      .dwattr $C$DW$690, DW_AT_data_member_location[DW_OP_plus_uconst 0x9e]
    6825                      .dwattr $C$DW$690, DW_AT_accessibility(DW_ACCESS_public)
    6826              $C$DW$691       .dwtag  DW_TAG_member
    6827                      .dwattr $C$DW$691, DW_AT_type(*$C$DW$T$56)
    6828                      .dwattr $C$DW$691, DW_AT_name("numCtrlTicksPerTrajTick")
    6829                      .dwattr $C$DW$691, DW_AT_TI_symbol_name("_numCtrlTicksPerTrajTick")
    6830                      .dwattr $C$DW$691, DW_AT_data_member_location[DW_OP_plus_uconst 0x9f]
    6831                      .dwattr $C$DW$691, DW_AT_accessibility(DW_ACCESS_public)
    6832              $C$DW$692       .dwtag  DW_TAG_member
    6833                      .dwattr $C$DW$692, DW_AT_type(*$C$DW$T$54)
    6834                      .dwattr $C$DW$692, DW_AT_name("ctrlFreq_Hz")
    6835                      .dwattr $C$DW$692, DW_AT_TI_symbol_name("_ctrlFreq_Hz")
    6836                      .dwattr $C$DW$692, DW_AT_data_member_location[DW_OP_plus_uconst 0xa0]
    6837                      .dwattr $C$DW$692, DW_AT_accessibility(DW_ACCESS_public)
    6838              $C$DW$693       .dwtag  DW_TAG_member
    6839                      .dwattr $C$DW$693, DW_AT_type(*$C$DW$T$54)
    6840                      .dwattr $C$DW$693, DW_AT_name("trajFreq_Hz")
    6841                      .dwattr $C$DW$693, DW_AT_TI_symbol_name("_trajFreq_Hz")
    6842                      .dwattr $C$DW$693, DW_AT_data_member_location[DW_OP_plus_uconst 0xa2]
    6843                      .dwattr $C$DW$693, DW_AT_accessibility(DW_ACCESS_public)
    6844              $C$DW$694       .dwtag  DW_TAG_member
    6845                      .dwattr $C$DW$694, DW_AT_type(*$C$DW$T$20)
    6846                      .dwattr $C$DW$694, DW_AT_name("trajPeriod_sec")
    6847                      .dwattr $C$DW$694, DW_AT_TI_symbol_name("_trajPeriod_sec")
    6848                      .dwattr $C$DW$694, DW_AT_data_member_location[DW_OP_plus_uconst 0xa4]
    6849                      .dwattr $C$DW$694, DW_AT_accessibility(DW_ACCESS_public)
    6850              $C$DW$695       .dwtag  DW_TAG_member
    6851                      .dwattr $C$DW$695, DW_AT_type(*$C$DW$T$57)
    6852                      .dwattr $C$DW$695, DW_AT_name("ctrlPeriod_sec")
    6853                      .dwattr $C$DW$695, DW_AT_TI_symbol_name("_ctrlPeriod_sec")
TMS320C2000 Assembler PC v6.2.5 Tue Oct 10 18:48:26 2017

Tools Copyright (c) 1996-2014 Texas Instruments Incorporated
C:\Users\wmj\AppData\Local\Temp\0239610                              PAGE  139

    6854                      .dwattr $C$DW$695, DW_AT_data_member_location[DW_OP_plus_uconst 0xa6]
    6855                      .dwattr $C$DW$695, DW_AT_accessibility(DW_ACCESS_public)
    6856              $C$DW$696       .dwtag  DW_TAG_member
    6857                      .dwattr $C$DW$696, DW_AT_type(*$C$DW$T$20)
    6858                      .dwattr $C$DW$696, DW_AT_name("maxVsMag_pu")
    6859                      .dwattr $C$DW$696, DW_AT_TI_symbol_name("_maxVsMag_pu")
    6860                      .dwattr $C$DW$696, DW_AT_data_member_location[DW_OP_plus_uconst 0xa8]
    6861                      .dwattr $C$DW$696, DW_AT_accessibility(DW_ACCESS_public)
    6862              $C$DW$697       .dwtag  DW_TAG_member
    6863                      .dwattr $C$DW$697, DW_AT_type(*$C$DW$T$21)
    6864                      .dwattr $C$DW$697, DW_AT_name("Iab_in")
    6865                      .dwattr $C$DW$697, DW_AT_TI_symbol_name("_Iab_in")
    6866                      .dwattr $C$DW$697, DW_AT_data_member_location[DW_OP_plus_uconst 0xaa]
    6867                      .dwattr $C$DW$697, DW_AT_accessibility(DW_ACCESS_public)
    6868              $C$DW$698       .dwtag  DW_TAG_member
    6869                      .dwattr $C$DW$698, DW_AT_type(*$C$DW$T$21)
    6870                      .dwattr $C$DW$698, DW_AT_name("Iab_filt")
    6871                      .dwattr $C$DW$698, DW_AT_TI_symbol_name("_Iab_filt")
    6872                      .dwattr $C$DW$698, DW_AT_data_member_location[DW_OP_plus_uconst 0xae]
    6873                      .dwattr $C$DW$698, DW_AT_accessibility(DW_ACCESS_public)
    6874              $C$DW$699       .dwtag  DW_TAG_member
    6875                      .dwattr $C$DW$699, DW_AT_type(*$C$DW$T$21)
    6876                      .dwattr $C$DW$699, DW_AT_name("Idq_in")
    6877                      .dwattr $C$DW$699, DW_AT_TI_symbol_name("_Idq_in")
    6878                      .dwattr $C$DW$699, DW_AT_data_member_location[DW_OP_plus_uconst 0xb2]
    6879                      .dwattr $C$DW$699, DW_AT_accessibility(DW_ACCESS_public)
    6880              $C$DW$700       .dwtag  DW_TAG_member
    6881                      .dwattr $C$DW$700, DW_AT_type(*$C$DW$T$21)
    6882                      .dwattr $C$DW$700, DW_AT_name("Vab_in")
    6883                      .dwattr $C$DW$700, DW_AT_TI_symbol_name("_Vab_in")
    6884                      .dwattr $C$DW$700, DW_AT_data_member_location[DW_OP_plus_uconst 0xb6]
    6885                      .dwattr $C$DW$700, DW_AT_accessibility(DW_ACCESS_public)
    6886              $C$DW$701       .dwtag  DW_TAG_member
    6887                      .dwattr $C$DW$701, DW_AT_type(*$C$DW$T$20)
    6888                      .dwattr $C$DW$701, DW_AT_name("spd_out")
    6889                      .dwattr $C$DW$701, DW_AT_TI_symbol_name("_spd_out")
    6890                      .dwattr $C$DW$701, DW_AT_data_member_location[DW_OP_plus_uconst 0xba]
    6891                      .dwattr $C$DW$701, DW_AT_accessibility(DW_ACCESS_public)
    6892              $C$DW$702       .dwtag  DW_TAG_member
    6893                      .dwattr $C$DW$702, DW_AT_type(*$C$DW$T$21)
    6894                      .dwattr $C$DW$702, DW_AT_name("Vab_out")
    6895                      .dwattr $C$DW$702, DW_AT_TI_symbol_name("_Vab_out")
    6896                      .dwattr $C$DW$702, DW_AT_data_member_location[DW_OP_plus_uconst 0xbc]
    6897                      .dwattr $C$DW$702, DW_AT_accessibility(DW_ACCESS_public)
    6898              $C$DW$703       .dwtag  DW_TAG_member
    6899                      .dwattr $C$DW$703, DW_AT_type(*$C$DW$T$21)
    6900                      .dwattr $C$DW$703, DW_AT_name("Vdq_out")
    6901                      .dwattr $C$DW$703, DW_AT_TI_symbol_name("_Vdq_out")
    6902                      .dwattr $C$DW$703, DW_AT_data_member_location[DW_OP_plus_uconst 0xc0]
    6903                      .dwattr $C$DW$703, DW_AT_accessibility(DW_ACCESS_public)
    6904              $C$DW$704       .dwtag  DW_TAG_member
    6905                      .dwattr $C$DW$704, DW_AT_type(*$C$DW$T$57)
    6906                      .dwattr $C$DW$704, DW_AT_name("Rhf")
    6907                      .dwattr $C$DW$704, DW_AT_TI_symbol_name("_Rhf")
    6908                      .dwattr $C$DW$704, DW_AT_data_member_location[DW_OP_plus_uconst 0xc4]
TMS320C2000 Assembler PC v6.2.5 Tue Oct 10 18:48:26 2017

Tools Copyright (c) 1996-2014 Texas Instruments Incorporated
C:\Users\wmj\AppData\Local\Temp\0239610                              PAGE  140

    6909                      .dwattr $C$DW$704, DW_AT_accessibility(DW_ACCESS_public)
    6910              $C$DW$705       .dwtag  DW_TAG_member
    6911                      .dwattr $C$DW$705, DW_AT_type(*$C$DW$T$57)
    6912                      .dwattr $C$DW$705, DW_AT_name("Lhf")
    6913                      .dwattr $C$DW$705, DW_AT_TI_symbol_name("_Lhf")
    6914                      .dwattr $C$DW$705, DW_AT_data_member_location[DW_OP_plus_uconst 0xc6]
    6915                      .dwattr $C$DW$705, DW_AT_accessibility(DW_ACCESS_public)
    6916              $C$DW$706       .dwtag  DW_TAG_member
    6917                      .dwattr $C$DW$706, DW_AT_type(*$C$DW$T$57)
    6918                      .dwattr $C$DW$706, DW_AT_name("RoverL")
    6919                      .dwattr $C$DW$706, DW_AT_TI_symbol_name("_RoverL")
    6920                      .dwattr $C$DW$706, DW_AT_data_member_location[DW_OP_plus_uconst 0xc8]
    6921                      .dwattr $C$DW$706, DW_AT_accessibility(DW_ACCESS_public)
    6922              $C$DW$707       .dwtag  DW_TAG_member
    6923                      .dwattr $C$DW$707, DW_AT_type(*$C$DW$T$20)
    6924                      .dwattr $C$DW$707, DW_AT_name("Kp_Id")
    6925                      .dwattr $C$DW$707, DW_AT_TI_symbol_name("_Kp_Id")
    6926                      .dwattr $C$DW$707, DW_AT_data_member_location[DW_OP_plus_uconst 0xca]
    6927                      .dwattr $C$DW$707, DW_AT_accessibility(DW_ACCESS_public)
    6928              $C$DW$708       .dwtag  DW_TAG_member
    6929                      .dwattr $C$DW$708, DW_AT_type(*$C$DW$T$20)
    6930                      .dwattr $C$DW$708, DW_AT_name("Kp_Iq")
    6931                      .dwattr $C$DW$708, DW_AT_TI_symbol_name("_Kp_Iq")
    6932                      .dwattr $C$DW$708, DW_AT_data_member_location[DW_OP_plus_uconst 0xcc]
    6933                      .dwattr $C$DW$708, DW_AT_accessibility(DW_ACCESS_public)
    6934              $C$DW$709       .dwtag  DW_TAG_member
    6935                      .dwattr $C$DW$709, DW_AT_type(*$C$DW$T$20)
    6936                      .dwattr $C$DW$709, DW_AT_name("Kp_spd")
    6937                      .dwattr $C$DW$709, DW_AT_TI_symbol_name("_Kp_spd")
    6938                      .dwattr $C$DW$709, DW_AT_data_member_location[DW_OP_plus_uconst 0xce]
    6939                      .dwattr $C$DW$709, DW_AT_accessibility(DW_ACCESS_public)
    6940              $C$DW$710       .dwtag  DW_TAG_member
    6941                      .dwattr $C$DW$710, DW_AT_type(*$C$DW$T$20)
    6942                      .dwattr $C$DW$710, DW_AT_name("Ki_Id")
    6943                      .dwattr $C$DW$710, DW_AT_TI_symbol_name("_Ki_Id")
    6944                      .dwattr $C$DW$710, DW_AT_data_member_location[DW_OP_plus_uconst 0xd0]
    6945                      .dwattr $C$DW$710, DW_AT_accessibility(DW_ACCESS_public)
    6946              $C$DW$711       .dwtag  DW_TAG_member
    6947                      .dwattr $C$DW$711, DW_AT_type(*$C$DW$T$20)
    6948                      .dwattr $C$DW$711, DW_AT_name("Ki_Iq")
    6949                      .dwattr $C$DW$711, DW_AT_TI_symbol_name("_Ki_Iq")
    6950                      .dwattr $C$DW$711, DW_AT_data_member_location[DW_OP_plus_uconst 0xd2]
    6951                      .dwattr $C$DW$711, DW_AT_accessibility(DW_ACCESS_public)
    6952              $C$DW$712       .dwtag  DW_TAG_member
    6953                      .dwattr $C$DW$712, DW_AT_type(*$C$DW$T$20)
    6954                      .dwattr $C$DW$712, DW_AT_name("Ki_spd")
    6955                      .dwattr $C$DW$712, DW_AT_TI_symbol_name("_Ki_spd")
    6956                      .dwattr $C$DW$712, DW_AT_data_member_location[DW_OP_plus_uconst 0xd4]
    6957                      .dwattr $C$DW$712, DW_AT_accessibility(DW_ACCESS_public)
    6958              $C$DW$713       .dwtag  DW_TAG_member
    6959                      .dwattr $C$DW$713, DW_AT_type(*$C$DW$T$20)
    6960                      .dwattr $C$DW$713, DW_AT_name("Kd_Id")
    6961                      .dwattr $C$DW$713, DW_AT_TI_symbol_name("_Kd_Id")
    6962                      .dwattr $C$DW$713, DW_AT_data_member_location[DW_OP_plus_uconst 0xd6]
    6963                      .dwattr $C$DW$713, DW_AT_accessibility(DW_ACCESS_public)
TMS320C2000 Assembler PC v6.2.5 Tue Oct 10 18:48:26 2017

Tools Copyright (c) 1996-2014 Texas Instruments Incorporated
C:\Users\wmj\AppData\Local\Temp\0239610                              PAGE  141

    6964              $C$DW$714       .dwtag  DW_TAG_member
    6965                      .dwattr $C$DW$714, DW_AT_type(*$C$DW$T$20)
    6966                      .dwattr $C$DW$714, DW_AT_name("Kd_Iq")
    6967                      .dwattr $C$DW$714, DW_AT_TI_symbol_name("_Kd_Iq")
    6968                      .dwattr $C$DW$714, DW_AT_data_member_location[DW_OP_plus_uconst 0xd8]
    6969                      .dwattr $C$DW$714, DW_AT_accessibility(DW_ACCESS_public)
    6970              $C$DW$715       .dwtag  DW_TAG_member
    6971                      .dwattr $C$DW$715, DW_AT_type(*$C$DW$T$20)
    6972                      .dwattr $C$DW$715, DW_AT_name("Kd_spd")
    6973                      .dwattr $C$DW$715, DW_AT_TI_symbol_name("_Kd_spd")
    6974                      .dwattr $C$DW$715, DW_AT_data_member_location[DW_OP_plus_uconst 0xda]
    6975                      .dwattr $C$DW$715, DW_AT_accessibility(DW_ACCESS_public)
    6976              $C$DW$716       .dwtag  DW_TAG_member
    6977                      .dwattr $C$DW$716, DW_AT_type(*$C$DW$T$20)
    6978                      .dwattr $C$DW$716, DW_AT_name("Ui_Id")
    6979                      .dwattr $C$DW$716, DW_AT_TI_symbol_name("_Ui_Id")
    6980                      .dwattr $C$DW$716, DW_AT_data_member_location[DW_OP_plus_uconst 0xdc]
    6981                      .dwattr $C$DW$716, DW_AT_accessibility(DW_ACCESS_public)
    6982              $C$DW$717       .dwtag  DW_TAG_member
    6983                      .dwattr $C$DW$717, DW_AT_type(*$C$DW$T$20)
    6984                      .dwattr $C$DW$717, DW_AT_name("Ui_Iq")
    6985                      .dwattr $C$DW$717, DW_AT_TI_symbol_name("_Ui_Iq")
    6986                      .dwattr $C$DW$717, DW_AT_data_member_location[DW_OP_plus_uconst 0xde]
    6987                      .dwattr $C$DW$717, DW_AT_accessibility(DW_ACCESS_public)
    6988              $C$DW$718       .dwtag  DW_TAG_member
    6989                      .dwattr $C$DW$718, DW_AT_type(*$C$DW$T$20)
    6990                      .dwattr $C$DW$718, DW_AT_name("Ui_spd")
    6991                      .dwattr $C$DW$718, DW_AT_TI_symbol_name("_Ui_spd")
    6992                      .dwattr $C$DW$718, DW_AT_data_member_location[DW_OP_plus_uconst 0xe0]
    6993                      .dwattr $C$DW$718, DW_AT_accessibility(DW_ACCESS_public)
    6994              $C$DW$719       .dwtag  DW_TAG_member
    6995                      .dwattr $C$DW$719, DW_AT_type(*$C$DW$T$21)
    6996                      .dwattr $C$DW$719, DW_AT_name("Idq_ref")
    6997                      .dwattr $C$DW$719, DW_AT_TI_symbol_name("_Idq_ref")
    6998                      .dwattr $C$DW$719, DW_AT_data_member_location[DW_OP_plus_uconst 0xe2]
    6999                      .dwattr $C$DW$719, DW_AT_accessibility(DW_ACCESS_public)
    7000              $C$DW$720       .dwtag  DW_TAG_member
    7001                      .dwattr $C$DW$720, DW_AT_type(*$C$DW$T$20)
    7002                      .dwattr $C$DW$720, DW_AT_name("IdRated")
    7003                      .dwattr $C$DW$720, DW_AT_TI_symbol_name("_IdRated")
    7004                      .dwattr $C$DW$720, DW_AT_data_member_location[DW_OP_plus_uconst 0xe6]
    7005                      .dwattr $C$DW$720, DW_AT_accessibility(DW_ACCESS_public)
    7006              $C$DW$721       .dwtag  DW_TAG_member
    7007                      .dwattr $C$DW$721, DW_AT_type(*$C$DW$T$20)
    7008                      .dwattr $C$DW$721, DW_AT_name("spd_ref")
    7009                      .dwattr $C$DW$721, DW_AT_TI_symbol_name("_spd_ref")
    7010                      .dwattr $C$DW$721, DW_AT_data_member_location[DW_OP_plus_uconst 0xe8]
    7011                      .dwattr $C$DW$721, DW_AT_accessibility(DW_ACCESS_public)
    7012              $C$DW$722       .dwtag  DW_TAG_member
    7013                      .dwattr $C$DW$722, DW_AT_type(*$C$DW$T$20)
    7014                      .dwattr $C$DW$722, DW_AT_name("spd_max")
    7015                      .dwattr $C$DW$722, DW_AT_TI_symbol_name("_spd_max")
    7016                      .dwattr $C$DW$722, DW_AT_data_member_location[DW_OP_plus_uconst 0xea]
    7017                      .dwattr $C$DW$722, DW_AT_accessibility(DW_ACCESS_public)
    7018              $C$DW$723       .dwtag  DW_TAG_member
TMS320C2000 Assembler PC v6.2.5 Tue Oct 10 18:48:26 2017

Tools Copyright (c) 1996-2014 Texas Instruments Incorporated
C:\Users\wmj\AppData\Local\Temp\0239610                              PAGE  142

    7019                      .dwattr $C$DW$723, DW_AT_type(*$C$DW$T$56)
    7020                      .dwattr $C$DW$723, DW_AT_name("counter_current")
    7021                      .dwattr $C$DW$723, DW_AT_TI_symbol_name("_counter_current")
    7022                      .dwattr $C$DW$723, DW_AT_data_member_location[DW_OP_plus_uconst 0xec]
    7023                      .dwattr $C$DW$723, DW_AT_accessibility(DW_ACCESS_public)
    7024              $C$DW$724       .dwtag  DW_TAG_member
    7025                      .dwattr $C$DW$724, DW_AT_type(*$C$DW$T$56)
    7026                      .dwattr $C$DW$724, DW_AT_name("counter_isr")
    7027                      .dwattr $C$DW$724, DW_AT_TI_symbol_name("_counter_isr")
    7028                      .dwattr $C$DW$724, DW_AT_data_member_location[DW_OP_plus_uconst 0xed]
    7029                      .dwattr $C$DW$724, DW_AT_accessibility(DW_ACCESS_public)
    7030              $C$DW$725       .dwtag  DW_TAG_member
    7031                      .dwattr $C$DW$725, DW_AT_type(*$C$DW$T$56)
    7032                      .dwattr $C$DW$725, DW_AT_name("counter_speed")
    7033                      .dwattr $C$DW$725, DW_AT_TI_symbol_name("_counter_speed")
    7034                      .dwattr $C$DW$725, DW_AT_data_member_location[DW_OP_plus_uconst 0xee]
    7035                      .dwattr $C$DW$725, DW_AT_accessibility(DW_ACCESS_public)
    7036              $C$DW$726       .dwtag  DW_TAG_member
    7037                      .dwattr $C$DW$726, DW_AT_type(*$C$DW$T$56)
    7038                      .dwattr $C$DW$726, DW_AT_name("counter_traj")
    7039                      .dwattr $C$DW$726, DW_AT_TI_symbol_name("_counter_traj")
    7040                      .dwattr $C$DW$726, DW_AT_data_member_location[DW_OP_plus_uconst 0xef]
    7041                      .dwattr $C$DW$726, DW_AT_accessibility(DW_ACCESS_public)
    7042              $C$DW$727       .dwtag  DW_TAG_member
    7043                      .dwattr $C$DW$727, DW_AT_type(*$C$DW$T$22)
    7044                      .dwattr $C$DW$727, DW_AT_name("flag_enableCtrl")
    7045                      .dwattr $C$DW$727, DW_AT_TI_symbol_name("_flag_enableCtrl")
    7046                      .dwattr $C$DW$727, DW_AT_data_member_location[DW_OP_plus_uconst 0xf0]
    7047                      .dwattr $C$DW$727, DW_AT_accessibility(DW_ACCESS_public)
    7048              $C$DW$728       .dwtag  DW_TAG_member
    7049                      .dwattr $C$DW$728, DW_AT_type(*$C$DW$T$22)
    7050                      .dwattr $C$DW$728, DW_AT_name("flag_enableDcBusComp")
    7051                      .dwattr $C$DW$728, DW_AT_TI_symbol_name("_flag_enableDcBusComp")
    7052                      .dwattr $C$DW$728, DW_AT_data_member_location[DW_OP_plus_uconst 0xf1]
    7053                      .dwattr $C$DW$728, DW_AT_accessibility(DW_ACCESS_public)
    7054              $C$DW$729       .dwtag  DW_TAG_member
    7055                      .dwattr $C$DW$729, DW_AT_type(*$C$DW$T$22)
    7056                      .dwattr $C$DW$729, DW_AT_name("flag_enablePowerWarp")
    7057                      .dwattr $C$DW$729, DW_AT_TI_symbol_name("_flag_enablePowerWarp")
    7058                      .dwattr $C$DW$729, DW_AT_data_member_location[DW_OP_plus_uconst 0xf2]
    7059                      .dwattr $C$DW$729, DW_AT_accessibility(DW_ACCESS_public)
    7060              $C$DW$730       .dwtag  DW_TAG_member
    7061                      .dwattr $C$DW$730, DW_AT_type(*$C$DW$T$22)
    7062                      .dwattr $C$DW$730, DW_AT_name("flag_enableOffset")
    7063                      .dwattr $C$DW$730, DW_AT_TI_symbol_name("_flag_enableOffset")
    7064                      .dwattr $C$DW$730, DW_AT_data_member_location[DW_OP_plus_uconst 0xf3]
    7065                      .dwattr $C$DW$730, DW_AT_accessibility(DW_ACCESS_public)
    7066              $C$DW$731       .dwtag  DW_TAG_member
    7067                      .dwattr $C$DW$731, DW_AT_type(*$C$DW$T$22)
    7068                      .dwattr $C$DW$731, DW_AT_name("flag_enableSpeedCtrl")
    7069                      .dwattr $C$DW$731, DW_AT_TI_symbol_name("_flag_enableSpeedCtrl")
    7070                      .dwattr $C$DW$731, DW_AT_data_member_location[DW_OP_plus_uconst 0xf4]
    7071                      .dwattr $C$DW$731, DW_AT_accessibility(DW_ACCESS_public)
    7072              $C$DW$732       .dwtag  DW_TAG_member
    7073                      .dwattr $C$DW$732, DW_AT_type(*$C$DW$T$22)
TMS320C2000 Assembler PC v6.2.5 Tue Oct 10 18:48:26 2017

Tools Copyright (c) 1996-2014 Texas Instruments Incorporated
C:\Users\wmj\AppData\Local\Temp\0239610                              PAGE  143

    7074                      .dwattr $C$DW$732, DW_AT_name("flag_enableUserMotorParams")
    7075                      .dwattr $C$DW$732, DW_AT_TI_symbol_name("_flag_enableUserMotorParams")
    7076                      .dwattr $C$DW$732, DW_AT_data_member_location[DW_OP_plus_uconst 0xf5]
    7077                      .dwattr $C$DW$732, DW_AT_accessibility(DW_ACCESS_public)
    7078              $C$DW$733       .dwtag  DW_TAG_member
    7079                      .dwattr $C$DW$733, DW_AT_type(*$C$DW$T$21)
    7080                      .dwattr $C$DW$733, DW_AT_name("Idq_offset_pu")
    7081                      .dwattr $C$DW$733, DW_AT_TI_symbol_name("_Idq_offset_pu")
    7082                      .dwattr $C$DW$733, DW_AT_data_member_location[DW_OP_plus_uconst 0xf6]
    7083                      .dwattr $C$DW$733, DW_AT_accessibility(DW_ACCESS_public)
    7084              $C$DW$734       .dwtag  DW_TAG_member
    7085                      .dwattr $C$DW$734, DW_AT_type(*$C$DW$T$21)
    7086                      .dwattr $C$DW$734, DW_AT_name("Vdq_offset_pu")
    7087                      .dwattr $C$DW$734, DW_AT_TI_symbol_name("_Vdq_offset_pu")
    7088                      .dwattr $C$DW$734, DW_AT_data_member_location[DW_OP_plus_uconst 0xfa]
    7089                      .dwattr $C$DW$734, DW_AT_accessibility(DW_ACCESS_public)
    7090              $C$DW$735       .dwtag  DW_TAG_member
    7091                      .dwattr $C$DW$735, DW_AT_type(*$C$DW$T$20)
    7092                      .dwattr $C$DW$735, DW_AT_name("angle_pu")
    7093                      .dwattr $C$DW$735, DW_AT_TI_symbol_name("_angle_pu")
    7094                      .dwattr $C$DW$735, DW_AT_data_member_location[DW_OP_plus_uconst 0xfe]
    7095                      .dwattr $C$DW$735, DW_AT_accessibility(DW_ACCESS_public)
    7096              $C$DW$736       .dwtag  DW_TAG_member
    7097                      .dwattr $C$DW$736, DW_AT_type(*$C$DW$T$20)
    7098                      .dwattr $C$DW$736, DW_AT_name("speed_ref_pu")
    7099                      .dwattr $C$DW$736, DW_AT_TI_symbol_name("_speed_ref_pu")
    7100                      .dwattr $C$DW$736, DW_AT_data_member_location[DW_OP_plus_uconst 0x100]
    7101                      .dwattr $C$DW$736, DW_AT_accessibility(DW_ACCESS_public)
    7102              $C$DW$737       .dwtag  DW_TAG_member
    7103                      .dwattr $C$DW$737, DW_AT_type(*$C$DW$T$20)
    7104                      .dwattr $C$DW$737, DW_AT_name("speed_fb_pu")
    7105                      .dwattr $C$DW$737, DW_AT_TI_symbol_name("_speed_fb_pu")
    7106                      .dwattr $C$DW$737, DW_AT_data_member_location[DW_OP_plus_uconst 0x102]
    7107                      .dwattr $C$DW$737, DW_AT_accessibility(DW_ACCESS_public)
    7108              $C$DW$738       .dwtag  DW_TAG_member
    7109                      .dwattr $C$DW$738, DW_AT_type(*$C$DW$T$20)
    7110                      .dwattr $C$DW$738, DW_AT_name("speed_outMax_pu")
    7111                      .dwattr $C$DW$738, DW_AT_TI_symbol_name("_speed_outMax_pu")
    7112                      .dwattr $C$DW$738, DW_AT_data_member_location[DW_OP_plus_uconst 0x104]
    7113                      .dwattr $C$DW$738, DW_AT_accessibility(DW_ACCESS_public)
    7114              $C$DW$739       .dwtag  DW_TAG_member
    7115                      .dwattr $C$DW$739, DW_AT_type(*$C$DW$T$22)
    7116                      .dwattr $C$DW$739, DW_AT_name("flag_enableCurrentCtrl")
    7117                      .dwattr $C$DW$739, DW_AT_TI_symbol_name("_flag_enableCurrentCtrl")
    7118                      .dwattr $C$DW$739, DW_AT_data_member_location[DW_OP_plus_uconst 0x106]
    7119                      .dwattr $C$DW$739, DW_AT_accessibility(DW_ACCESS_public)
    7120              $C$DW$740       .dwtag  DW_TAG_member
    7121                      .dwattr $C$DW$740, DW_AT_type(*$C$DW$T$59)
    7122                      .dwattr $C$DW$740, DW_AT_name("brakeHandle")
    7123                      .dwattr $C$DW$740, DW_AT_TI_symbol_name("_brakeHandle")
    7124                      .dwattr $C$DW$740, DW_AT_data_member_location[DW_OP_plus_uconst 0x108]
    7125                      .dwattr $C$DW$740, DW_AT_accessibility(DW_ACCESS_public)
    7126              $C$DW$741       .dwtag  DW_TAG_member
    7127                      .dwattr $C$DW$741, DW_AT_type(*$C$DW$T$60)
    7128                      .dwattr $C$DW$741, DW_AT_name("brake")
TMS320C2000 Assembler PC v6.2.5 Tue Oct 10 18:48:26 2017

Tools Copyright (c) 1996-2014 Texas Instruments Incorporated
C:\Users\wmj\AppData\Local\Temp\0239610                              PAGE  144

    7129                      .dwattr $C$DW$741, DW_AT_TI_symbol_name("_brake")
    7130                      .dwattr $C$DW$741, DW_AT_data_member_location[DW_OP_plus_uconst 0x10a]
    7131                      .dwattr $C$DW$741, DW_AT_accessibility(DW_ACCESS_public)
    7132                      .dwendtag $C$DW$T$61
    7133              
    7134              $C$DW$T$91      .dwtag  DW_TAG_typedef, DW_AT_name("CTRL_Obj")
    7135                      .dwattr $C$DW$T$91, DW_AT_type(*$C$DW$T$61)
    7136                      .dwattr $C$DW$T$91, DW_AT_language(DW_LANG_C)
    7137              $C$DW$T$92      .dwtag  DW_TAG_pointer_type
    7138                      .dwattr $C$DW$T$92, DW_AT_type(*$C$DW$T$61)
    7139                      .dwattr $C$DW$T$92, DW_AT_address_class(0x16)
    7140              $C$DW$T$93      .dwtag  DW_TAG_typedef, DW_AT_name("CTRL_Handle")
    7141                      .dwattr $C$DW$T$93, DW_AT_type(*$C$DW$T$92)
    7142                      .dwattr $C$DW$T$93, DW_AT_language(DW_LANG_C)
    7143              $C$DW$742       .dwtag  DW_TAG_TI_far_type
    7144                      .dwattr $C$DW$742, DW_AT_type(*$C$DW$T$93)
    7145              $C$DW$T$94      .dwtag  DW_TAG_const_type
    7146                      .dwattr $C$DW$T$94, DW_AT_type(*$C$DW$742)
    7147              
    7148              $C$DW$T$64      .dwtag  DW_TAG_structure_type
    7149                      .dwattr $C$DW$T$64, DW_AT_name("_CTRL_Version_")
    7150                      .dwattr $C$DW$T$64, DW_AT_byte_size(0x04)
    7151              $C$DW$743       .dwtag  DW_TAG_member
    7152                      .dwattr $C$DW$743, DW_AT_type(*$C$DW$T$24)
    7153                      .dwattr $C$DW$743, DW_AT_name("rsvd")
    7154                      .dwattr $C$DW$743, DW_AT_TI_symbol_name("_rsvd")
    7155                      .dwattr $C$DW$743, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    7156                      .dwattr $C$DW$743, DW_AT_accessibility(DW_ACCESS_public)
    7157              $C$DW$744       .dwtag  DW_TAG_member
    7158                      .dwattr $C$DW$744, DW_AT_type(*$C$DW$T$63)
    7159                      .dwattr $C$DW$744, DW_AT_name("targetProc")
    7160                      .dwattr $C$DW$744, DW_AT_TI_symbol_name("_targetProc")
    7161                      .dwattr $C$DW$744, DW_AT_data_member_location[DW_OP_plus_uconst 0x1]
    7162                      .dwattr $C$DW$744, DW_AT_accessibility(DW_ACCESS_public)
    7163              $C$DW$745       .dwtag  DW_TAG_member
    7164                      .dwattr $C$DW$745, DW_AT_type(*$C$DW$T$24)
    7165                      .dwattr $C$DW$745, DW_AT_name("major")
    7166                      .dwattr $C$DW$745, DW_AT_TI_symbol_name("_major")
    7167                      .dwattr $C$DW$745, DW_AT_data_member_location[DW_OP_plus_uconst 0x2]
    7168                      .dwattr $C$DW$745, DW_AT_accessibility(DW_ACCESS_public)
    7169              $C$DW$746       .dwtag  DW_TAG_member
    7170                      .dwattr $C$DW$746, DW_AT_type(*$C$DW$T$24)
    7171                      .dwattr $C$DW$746, DW_AT_name("minor")
    7172                      .dwattr $C$DW$746, DW_AT_TI_symbol_name("_minor")
    7173                      .dwattr $C$DW$746, DW_AT_data_member_location[DW_OP_plus_uconst 0x3]
    7174                      .dwattr $C$DW$746, DW_AT_accessibility(DW_ACCESS_public)
    7175                      .dwendtag $C$DW$T$64
    7176              
    7177              $C$DW$T$27      .dwtag  DW_TAG_typedef, DW_AT_name("CTRL_Version")
    7178                      .dwattr $C$DW$T$27, DW_AT_type(*$C$DW$T$64)
    7179                      .dwattr $C$DW$T$27, DW_AT_language(DW_LANG_C)
    7180              
    7181              $C$DW$T$19      .dwtag  DW_TAG_structure_type
    7182                      .dwattr $C$DW$T$19, DW_AT_name("_EST_Obj_")
    7183                      .dwattr $C$DW$T$19, DW_AT_declaration
TMS320C2000 Assembler PC v6.2.5 Tue Oct 10 18:48:26 2017

Tools Copyright (c) 1996-2014 Texas Instruments Incorporated
C:\Users\wmj\AppData\Local\Temp\0239610                              PAGE  145

    7184                      .dwendtag $C$DW$T$19
    7185              
    7186              $C$DW$T$35      .dwtag  DW_TAG_pointer_type
    7187                      .dwattr $C$DW$T$35, DW_AT_type(*$C$DW$T$19)
    7188                      .dwattr $C$DW$T$35, DW_AT_address_class(0x16)
    7189              $C$DW$T$36      .dwtag  DW_TAG_typedef, DW_AT_name("EST_Handle")
    7190                      .dwattr $C$DW$T$36, DW_AT_type(*$C$DW$T$35)
    7191                      .dwattr $C$DW$T$36, DW_AT_language(DW_LANG_C)
    7192              
    7193              $C$DW$T$65      .dwtag  DW_TAG_structure_type
    7194                      .dwattr $C$DW$T$65, DW_AT_name("_IPARK_Obj_")
    7195                      .dwattr $C$DW$T$65, DW_AT_byte_size(0x04)
    7196              $C$DW$747       .dwtag  DW_TAG_member
    7197                      .dwattr $C$DW$747, DW_AT_type(*$C$DW$T$20)
    7198                      .dwattr $C$DW$747, DW_AT_name("sinTh")
    7199                      .dwattr $C$DW$747, DW_AT_TI_symbol_name("_sinTh")
    7200                      .dwattr $C$DW$747, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    7201                      .dwattr $C$DW$747, DW_AT_accessibility(DW_ACCESS_public)
    7202              $C$DW$748       .dwtag  DW_TAG_member
    7203                      .dwattr $C$DW$748, DW_AT_type(*$C$DW$T$20)
    7204                      .dwattr $C$DW$748, DW_AT_name("cosTh")
    7205                      .dwattr $C$DW$748, DW_AT_TI_symbol_name("_cosTh")
    7206                      .dwattr $C$DW$748, DW_AT_data_member_location[DW_OP_plus_uconst 0x2]
    7207                      .dwattr $C$DW$748, DW_AT_accessibility(DW_ACCESS_public)
    7208                      .dwendtag $C$DW$T$65
    7209              
    7210              $C$DW$T$45      .dwtag  DW_TAG_typedef, DW_AT_name("IPARK_Obj")
    7211                      .dwattr $C$DW$T$45, DW_AT_type(*$C$DW$T$65)
    7212                      .dwattr $C$DW$T$45, DW_AT_language(DW_LANG_C)
    7213              $C$DW$T$43      .dwtag  DW_TAG_pointer_type
    7214                      .dwattr $C$DW$T$43, DW_AT_type(*$C$DW$T$65)
    7215                      .dwattr $C$DW$T$43, DW_AT_address_class(0x16)
    7216              $C$DW$T$44      .dwtag  DW_TAG_typedef, DW_AT_name("IPARK_Handle")
    7217                      .dwattr $C$DW$T$44, DW_AT_type(*$C$DW$T$43)
    7218                      .dwattr $C$DW$T$44, DW_AT_language(DW_LANG_C)
    7219              
    7220              $C$DW$T$67      .dwtag  DW_TAG_structure_type
    7221                      .dwattr $C$DW$T$67, DW_AT_name("_MATH_vec2_")
    7222                      .dwattr $C$DW$T$67, DW_AT_byte_size(0x04)
    7223              $C$DW$749       .dwtag  DW_TAG_member
    7224                      .dwattr $C$DW$749, DW_AT_type(*$C$DW$T$66)
    7225                      .dwattr $C$DW$749, DW_AT_name("value")
    7226                      .dwattr $C$DW$749, DW_AT_TI_symbol_name("_value")
    7227                      .dwattr $C$DW$749, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    7228                      .dwattr $C$DW$749, DW_AT_accessibility(DW_ACCESS_public)
    7229                      .dwendtag $C$DW$T$67
    7230              
    7231              $C$DW$T$21      .dwtag  DW_TAG_typedef, DW_AT_name("MATH_vec2")
    7232                      .dwattr $C$DW$T$21, DW_AT_type(*$C$DW$T$67)
    7233                      .dwattr $C$DW$T$21, DW_AT_language(DW_LANG_C)
    7234              
    7235              $C$DW$T$70      .dwtag  DW_TAG_structure_type
    7236                      .dwattr $C$DW$T$70, DW_AT_name("_MOTOR_Params_")
    7237                      .dwattr $C$DW$T$70, DW_AT_byte_size(0x0e)
    7238              $C$DW$750       .dwtag  DW_TAG_member
TMS320C2000 Assembler PC v6.2.5 Tue Oct 10 18:48:26 2017

Tools Copyright (c) 1996-2014 Texas Instruments Incorporated
C:\Users\wmj\AppData\Local\Temp\0239610                              PAGE  146

    7239                      .dwattr $C$DW$750, DW_AT_type(*$C$DW$T$69)
    7240                      .dwattr $C$DW$750, DW_AT_name("type")
    7241                      .dwattr $C$DW$750, DW_AT_TI_symbol_name("_type")
    7242                      .dwattr $C$DW$750, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    7243                      .dwattr $C$DW$750, DW_AT_accessibility(DW_ACCESS_public)
    7244              $C$DW$751       .dwtag  DW_TAG_member
    7245                      .dwattr $C$DW$751, DW_AT_type(*$C$DW$T$56)
    7246                      .dwattr $C$DW$751, DW_AT_name("numPolePairs")
    7247                      .dwattr $C$DW$751, DW_AT_TI_symbol_name("_numPolePairs")
    7248                      .dwattr $C$DW$751, DW_AT_data_member_location[DW_OP_plus_uconst 0x1]
    7249                      .dwattr $C$DW$751, DW_AT_accessibility(DW_ACCESS_public)
    7250              $C$DW$752       .dwtag  DW_TAG_member
    7251                      .dwattr $C$DW$752, DW_AT_type(*$C$DW$T$57)
    7252                      .dwattr $C$DW$752, DW_AT_name("Lr_H")
    7253                      .dwattr $C$DW$752, DW_AT_TI_symbol_name("_Lr_H")
    7254                      .dwattr $C$DW$752, DW_AT_data_member_location[DW_OP_plus_uconst 0x2]
    7255                      .dwattr $C$DW$752, DW_AT_accessibility(DW_ACCESS_public)
    7256              $C$DW$753       .dwtag  DW_TAG_member
    7257                      .dwattr $C$DW$753, DW_AT_type(*$C$DW$T$57)
    7258                      .dwattr $C$DW$753, DW_AT_name("Ls_d_H")
    7259                      .dwattr $C$DW$753, DW_AT_TI_symbol_name("_Ls_d_H")
    7260                      .dwattr $C$DW$753, DW_AT_data_member_location[DW_OP_plus_uconst 0x4]
    7261                      .dwattr $C$DW$753, DW_AT_accessibility(DW_ACCESS_public)
    7262              $C$DW$754       .dwtag  DW_TAG_member
    7263                      .dwattr $C$DW$754, DW_AT_type(*$C$DW$T$57)
    7264                      .dwattr $C$DW$754, DW_AT_name("Ls_q_H")
    7265                      .dwattr $C$DW$754, DW_AT_TI_symbol_name("_Ls_q_H")
    7266                      .dwattr $C$DW$754, DW_AT_data_member_location[DW_OP_plus_uconst 0x6]
    7267                      .dwattr $C$DW$754, DW_AT_accessibility(DW_ACCESS_public)
    7268              $C$DW$755       .dwtag  DW_TAG_member
    7269                      .dwattr $C$DW$755, DW_AT_type(*$C$DW$T$57)
    7270                      .dwattr $C$DW$755, DW_AT_name("Rr_Ohm")
    7271                      .dwattr $C$DW$755, DW_AT_TI_symbol_name("_Rr_Ohm")
    7272                      .dwattr $C$DW$755, DW_AT_data_member_location[DW_OP_plus_uconst 0x8]
    7273                      .dwattr $C$DW$755, DW_AT_accessibility(DW_ACCESS_public)
    7274              $C$DW$756       .dwtag  DW_TAG_member
    7275                      .dwattr $C$DW$756, DW_AT_type(*$C$DW$T$57)
    7276                      .dwattr $C$DW$756, DW_AT_name("Rs_Ohm")
    7277                      .dwattr $C$DW$756, DW_AT_TI_symbol_name("_Rs_Ohm")
    7278                      .dwattr $C$DW$756, DW_AT_data_member_location[DW_OP_plus_uconst 0xa]
    7279                      .dwattr $C$DW$756, DW_AT_accessibility(DW_ACCESS_public)
    7280              $C$DW$757       .dwtag  DW_TAG_member
    7281                      .dwattr $C$DW$757, DW_AT_type(*$C$DW$T$57)
    7282                      .dwattr $C$DW$757, DW_AT_name("ratedFlux_VpHz")
    7283                      .dwattr $C$DW$757, DW_AT_TI_symbol_name("_ratedFlux_VpHz")
    7284                      .dwattr $C$DW$757, DW_AT_data_member_location[DW_OP_plus_uconst 0xc]
    7285                      .dwattr $C$DW$757, DW_AT_accessibility(DW_ACCESS_public)
    7286                      .dwendtag $C$DW$T$70
    7287              
    7288              $C$DW$T$52      .dwtag  DW_TAG_typedef, DW_AT_name("MOTOR_Params")
    7289                      .dwattr $C$DW$T$52, DW_AT_type(*$C$DW$T$70)
    7290                      .dwattr $C$DW$T$52, DW_AT_language(DW_LANG_C)
    7291              
    7292              $C$DW$T$71      .dwtag  DW_TAG_structure_type
    7293                      .dwattr $C$DW$T$71, DW_AT_name("_PARK_Obj_")
TMS320C2000 Assembler PC v6.2.5 Tue Oct 10 18:48:26 2017

Tools Copyright (c) 1996-2014 Texas Instruments Incorporated
C:\Users\wmj\AppData\Local\Temp\0239610                              PAGE  147

    7294                      .dwattr $C$DW$T$71, DW_AT_byte_size(0x04)
    7295              $C$DW$758       .dwtag  DW_TAG_member
    7296                      .dwattr $C$DW$758, DW_AT_type(*$C$DW$T$20)
    7297                      .dwattr $C$DW$758, DW_AT_name("sinTh")
    7298                      .dwattr $C$DW$758, DW_AT_TI_symbol_name("_sinTh")
    7299                      .dwattr $C$DW$758, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    7300                      .dwattr $C$DW$758, DW_AT_accessibility(DW_ACCESS_public)
    7301              $C$DW$759       .dwtag  DW_TAG_member
    7302                      .dwattr $C$DW$759, DW_AT_type(*$C$DW$T$20)
    7303                      .dwattr $C$DW$759, DW_AT_name("cosTh")
    7304                      .dwattr $C$DW$759, DW_AT_TI_symbol_name("_cosTh")
    7305                      .dwattr $C$DW$759, DW_AT_data_member_location[DW_OP_plus_uconst 0x2]
    7306                      .dwattr $C$DW$759, DW_AT_accessibility(DW_ACCESS_public)
    7307                      .dwendtag $C$DW$T$71
    7308              
    7309              $C$DW$T$39      .dwtag  DW_TAG_typedef, DW_AT_name("PARK_Obj")
    7310                      .dwattr $C$DW$T$39, DW_AT_type(*$C$DW$T$71)
    7311                      .dwattr $C$DW$T$39, DW_AT_language(DW_LANG_C)
    7312              $C$DW$T$37      .dwtag  DW_TAG_pointer_type
    7313                      .dwattr $C$DW$T$37, DW_AT_type(*$C$DW$T$71)
    7314                      .dwattr $C$DW$T$37, DW_AT_address_class(0x16)
    7315              $C$DW$T$38      .dwtag  DW_TAG_typedef, DW_AT_name("PARK_Handle")
    7316                      .dwattr $C$DW$T$38, DW_AT_type(*$C$DW$T$37)
    7317                      .dwattr $C$DW$T$38, DW_AT_language(DW_LANG_C)
    7318              
    7319              $C$DW$T$72      .dwtag  DW_TAG_structure_type
    7320                      .dwattr $C$DW$T$72, DW_AT_name("_PID_Obj_")
    7321                      .dwattr $C$DW$T$72, DW_AT_byte_size(0x10)
    7322              $C$DW$760       .dwtag  DW_TAG_member
    7323                      .dwattr $C$DW$760, DW_AT_type(*$C$DW$T$20)
    7324                      .dwattr $C$DW$760, DW_AT_name("Kp")
    7325                      .dwattr $C$DW$760, DW_AT_TI_symbol_name("_Kp")
    7326                      .dwattr $C$DW$760, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    7327                      .dwattr $C$DW$760, DW_AT_accessibility(DW_ACCESS_public)
    7328              $C$DW$761       .dwtag  DW_TAG_member
    7329                      .dwattr $C$DW$761, DW_AT_type(*$C$DW$T$20)
    7330                      .dwattr $C$DW$761, DW_AT_name("Ki")
    7331                      .dwattr $C$DW$761, DW_AT_TI_symbol_name("_Ki")
    7332                      .dwattr $C$DW$761, DW_AT_data_member_location[DW_OP_plus_uconst 0x2]
    7333                      .dwattr $C$DW$761, DW_AT_accessibility(DW_ACCESS_public)
    7334              $C$DW$762       .dwtag  DW_TAG_member
    7335                      .dwattr $C$DW$762, DW_AT_type(*$C$DW$T$20)
    7336                      .dwattr $C$DW$762, DW_AT_name("Kd")
    7337                      .dwattr $C$DW$762, DW_AT_TI_symbol_name("_Kd")
    7338                      .dwattr $C$DW$762, DW_AT_data_member_location[DW_OP_plus_uconst 0x4]
    7339                      .dwattr $C$DW$762, DW_AT_accessibility(DW_ACCESS_public)
    7340              $C$DW$763       .dwtag  DW_TAG_member
    7341                      .dwattr $C$DW$763, DW_AT_type(*$C$DW$T$20)
    7342                      .dwattr $C$DW$763, DW_AT_name("Ui")
    7343                      .dwattr $C$DW$763, DW_AT_TI_symbol_name("_Ui")
    7344                      .dwattr $C$DW$763, DW_AT_data_member_location[DW_OP_plus_uconst 0x6]
    7345                      .dwattr $C$DW$763, DW_AT_accessibility(DW_ACCESS_public)
    7346              $C$DW$764       .dwtag  DW_TAG_member
    7347                      .dwattr $C$DW$764, DW_AT_type(*$C$DW$T$20)
    7348                      .dwattr $C$DW$764, DW_AT_name("refValue")
TMS320C2000 Assembler PC v6.2.5 Tue Oct 10 18:48:26 2017

Tools Copyright (c) 1996-2014 Texas Instruments Incorporated
C:\Users\wmj\AppData\Local\Temp\0239610                              PAGE  148

    7349                      .dwattr $C$DW$764, DW_AT_TI_symbol_name("_refValue")
    7350                      .dwattr $C$DW$764, DW_AT_data_member_location[DW_OP_plus_uconst 0x8]
    7351                      .dwattr $C$DW$764, DW_AT_accessibility(DW_ACCESS_public)
    7352              $C$DW$765       .dwtag  DW_TAG_member
    7353                      .dwattr $C$DW$765, DW_AT_type(*$C$DW$T$20)
    7354                      .dwattr $C$DW$765, DW_AT_name("fbackValue")
    7355                      .dwattr $C$DW$765, DW_AT_TI_symbol_name("_fbackValue")
    7356                      .dwattr $C$DW$765, DW_AT_data_member_location[DW_OP_plus_uconst 0xa]
    7357                      .dwattr $C$DW$765, DW_AT_accessibility(DW_ACCESS_public)
    7358              $C$DW$766       .dwtag  DW_TAG_member
    7359                      .dwattr $C$DW$766, DW_AT_type(*$C$DW$T$20)
    7360                      .dwattr $C$DW$766, DW_AT_name("outMin")
    7361                      .dwattr $C$DW$766, DW_AT_TI_symbol_name("_outMin")
    7362                      .dwattr $C$DW$766, DW_AT_data_member_location[DW_OP_plus_uconst 0xc]
    7363                      .dwattr $C$DW$766, DW_AT_accessibility(DW_ACCESS_public)
    7364              $C$DW$767       .dwtag  DW_TAG_member
    7365                      .dwattr $C$DW$767, DW_AT_type(*$C$DW$T$20)
    7366                      .dwattr $C$DW$767, DW_AT_name("outMax")
    7367                      .dwattr $C$DW$767, DW_AT_TI_symbol_name("_outMax")
    7368                      .dwattr $C$DW$767, DW_AT_data_member_location[DW_OP_plus_uconst 0xe]
    7369                      .dwattr $C$DW$767, DW_AT_accessibility(DW_ACCESS_public)
    7370                      .dwendtag $C$DW$T$72
    7371              
    7372              $C$DW$T$42      .dwtag  DW_TAG_typedef, DW_AT_name("PID_Obj")
    7373                      .dwattr $C$DW$T$42, DW_AT_type(*$C$DW$T$72)
    7374                      .dwattr $C$DW$T$42, DW_AT_language(DW_LANG_C)
    7375              $C$DW$T$40      .dwtag  DW_TAG_pointer_type
    7376                      .dwattr $C$DW$T$40, DW_AT_type(*$C$DW$T$72)
    7377                      .dwattr $C$DW$T$40, DW_AT_address_class(0x16)
    7378              $C$DW$T$41      .dwtag  DW_TAG_typedef, DW_AT_name("PID_Handle")
    7379                      .dwattr $C$DW$T$41, DW_AT_type(*$C$DW$T$40)
    7380                      .dwattr $C$DW$T$41, DW_AT_language(DW_LANG_C)
    7381              
    7382              $C$DW$T$73      .dwtag  DW_TAG_structure_type
    7383                      .dwattr $C$DW$T$73, DW_AT_name("_SVGEN_Obj_")
    7384                      .dwattr $C$DW$T$73, DW_AT_byte_size(0x02)
    7385              $C$DW$768       .dwtag  DW_TAG_member
    7386                      .dwattr $C$DW$768, DW_AT_type(*$C$DW$T$20)
    7387                      .dwattr $C$DW$768, DW_AT_name("maxModulation")
    7388                      .dwattr $C$DW$768, DW_AT_TI_symbol_name("_maxModulation")
    7389                      .dwattr $C$DW$768, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    7390                      .dwattr $C$DW$768, DW_AT_accessibility(DW_ACCESS_public)
    7391                      .dwendtag $C$DW$T$73
    7392              
    7393              $C$DW$T$48      .dwtag  DW_TAG_typedef, DW_AT_name("SVGEN_Obj")
    7394                      .dwattr $C$DW$T$48, DW_AT_type(*$C$DW$T$73)
    7395                      .dwattr $C$DW$T$48, DW_AT_language(DW_LANG_C)
    7396              $C$DW$T$46      .dwtag  DW_TAG_pointer_type
    7397                      .dwattr $C$DW$T$46, DW_AT_type(*$C$DW$T$73)
    7398                      .dwattr $C$DW$T$46, DW_AT_address_class(0x16)
    7399              $C$DW$T$47      .dwtag  DW_TAG_typedef, DW_AT_name("SVGEN_Handle")
    7400                      .dwattr $C$DW$T$47, DW_AT_type(*$C$DW$T$46)
    7401                      .dwattr $C$DW$T$47, DW_AT_language(DW_LANG_C)
    7402              
    7403              $C$DW$T$74      .dwtag  DW_TAG_structure_type
TMS320C2000 Assembler PC v6.2.5 Tue Oct 10 18:48:26 2017

Tools Copyright (c) 1996-2014 Texas Instruments Incorporated
C:\Users\wmj\AppData\Local\Temp\0239610                              PAGE  149

    7404                      .dwattr $C$DW$T$74, DW_AT_name("_TRAJ_Obj_")
    7405                      .dwattr $C$DW$T$74, DW_AT_byte_size(0x0a)
    7406              $C$DW$769       .dwtag  DW_TAG_member
    7407                      .dwattr $C$DW$769, DW_AT_type(*$C$DW$T$20)
    7408                      .dwattr $C$DW$769, DW_AT_name("targetValue")
    7409                      .dwattr $C$DW$769, DW_AT_TI_symbol_name("_targetValue")
    7410                      .dwattr $C$DW$769, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    7411                      .dwattr $C$DW$769, DW_AT_accessibility(DW_ACCESS_public)
    7412              $C$DW$770       .dwtag  DW_TAG_member
    7413                      .dwattr $C$DW$770, DW_AT_type(*$C$DW$T$20)
    7414                      .dwattr $C$DW$770, DW_AT_name("intValue")
    7415                      .dwattr $C$DW$770, DW_AT_TI_symbol_name("_intValue")
    7416                      .dwattr $C$DW$770, DW_AT_data_member_location[DW_OP_plus_uconst 0x2]
    7417                      .dwattr $C$DW$770, DW_AT_accessibility(DW_ACCESS_public)
    7418              $C$DW$771       .dwtag  DW_TAG_member
    7419                      .dwattr $C$DW$771, DW_AT_type(*$C$DW$T$20)
    7420                      .dwattr $C$DW$771, DW_AT_name("minValue")
    7421                      .dwattr $C$DW$771, DW_AT_TI_symbol_name("_minValue")
    7422                      .dwattr $C$DW$771, DW_AT_data_member_location[DW_OP_plus_uconst 0x4]
    7423                      .dwattr $C$DW$771, DW_AT_accessibility(DW_ACCESS_public)
    7424              $C$DW$772       .dwtag  DW_TAG_member
    7425                      .dwattr $C$DW$772, DW_AT_type(*$C$DW$T$20)
    7426                      .dwattr $C$DW$772, DW_AT_name("maxValue")
    7427                      .dwattr $C$DW$772, DW_AT_TI_symbol_name("_maxValue")
    7428                      .dwattr $C$DW$772, DW_AT_data_member_location[DW_OP_plus_uconst 0x6]
    7429                      .dwattr $C$DW$772, DW_AT_accessibility(DW_ACCESS_public)
    7430              $C$DW$773       .dwtag  DW_TAG_member
    7431                      .dwattr $C$DW$773, DW_AT_type(*$C$DW$T$20)
    7432                      .dwattr $C$DW$773, DW_AT_name("maxDelta")
    7433                      .dwattr $C$DW$773, DW_AT_TI_symbol_name("_maxDelta")
    7434                      .dwattr $C$DW$773, DW_AT_data_member_location[DW_OP_plus_uconst 0x8]
    7435                      .dwattr $C$DW$773, DW_AT_accessibility(DW_ACCESS_public)
    7436                      .dwendtag $C$DW$T$74
    7437              
    7438              $C$DW$T$51      .dwtag  DW_TAG_typedef, DW_AT_name("TRAJ_Obj")
    7439                      .dwattr $C$DW$T$51, DW_AT_type(*$C$DW$T$74)
    7440                      .dwattr $C$DW$T$51, DW_AT_language(DW_LANG_C)
    7441              $C$DW$T$49      .dwtag  DW_TAG_pointer_type
    7442                      .dwattr $C$DW$T$49, DW_AT_type(*$C$DW$T$74)
    7443                      .dwattr $C$DW$T$49, DW_AT_address_class(0x16)
    7444              $C$DW$T$50      .dwtag  DW_TAG_typedef, DW_AT_name("TRAJ_Handle")
    7445                      .dwattr $C$DW$T$50, DW_AT_type(*$C$DW$T$49)
    7446                      .dwattr $C$DW$T$50, DW_AT_language(DW_LANG_C)
    7447              
    7448              $C$DW$T$80      .dwtag  DW_TAG_structure_type
    7449                      .dwattr $C$DW$T$80, DW_AT_name("_USER_Params_")
    7450                      .dwattr $C$DW$T$80, DW_AT_byte_size(0xac)
    7451              $C$DW$774       .dwtag  DW_TAG_member
    7452                      .dwattr $C$DW$774, DW_AT_type(*$C$DW$T$57)
    7453                      .dwattr $C$DW$774, DW_AT_name("iqFullScaleCurrent_A")
    7454                      .dwattr $C$DW$774, DW_AT_TI_symbol_name("_iqFullScaleCurrent_A")
    7455                      .dwattr $C$DW$774, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    7456                      .dwattr $C$DW$774, DW_AT_accessibility(DW_ACCESS_public)
    7457              $C$DW$775       .dwtag  DW_TAG_member
    7458                      .dwattr $C$DW$775, DW_AT_type(*$C$DW$T$57)
TMS320C2000 Assembler PC v6.2.5 Tue Oct 10 18:48:26 2017

Tools Copyright (c) 1996-2014 Texas Instruments Incorporated
C:\Users\wmj\AppData\Local\Temp\0239610                              PAGE  150

    7459                      .dwattr $C$DW$775, DW_AT_name("iqFullScaleVoltage_V")
    7460                      .dwattr $C$DW$775, DW_AT_TI_symbol_name("_iqFullScaleVoltage_V")
    7461                      .dwattr $C$DW$775, DW_AT_data_member_location[DW_OP_plus_uconst 0x2]
    7462                      .dwattr $C$DW$775, DW_AT_accessibility(DW_ACCESS_public)
    7463              $C$DW$776       .dwtag  DW_TAG_member
    7464                      .dwattr $C$DW$776, DW_AT_type(*$C$DW$T$57)
    7465                      .dwattr $C$DW$776, DW_AT_name("iqFullScaleFreq_Hz")
    7466                      .dwattr $C$DW$776, DW_AT_TI_symbol_name("_iqFullScaleFreq_Hz")
    7467                      .dwattr $C$DW$776, DW_AT_data_member_location[DW_OP_plus_uconst 0x4]
    7468                      .dwattr $C$DW$776, DW_AT_accessibility(DW_ACCESS_public)
    7469              $C$DW$777       .dwtag  DW_TAG_member
    7470                      .dwattr $C$DW$777, DW_AT_type(*$C$DW$T$56)
    7471                      .dwattr $C$DW$777, DW_AT_name("numIsrTicksPerCtrlTick")
    7472                      .dwattr $C$DW$777, DW_AT_TI_symbol_name("_numIsrTicksPerCtrlTick")
    7473                      .dwattr $C$DW$777, DW_AT_data_member_location[DW_OP_plus_uconst 0x6]
    7474                      .dwattr $C$DW$777, DW_AT_accessibility(DW_ACCESS_public)
    7475              $C$DW$778       .dwtag  DW_TAG_member
    7476                      .dwattr $C$DW$778, DW_AT_type(*$C$DW$T$56)
    7477                      .dwattr $C$DW$778, DW_AT_name("numCtrlTicksPerCurrentTick")
    7478                      .dwattr $C$DW$778, DW_AT_TI_symbol_name("_numCtrlTicksPerCurrentTick")
    7479                      .dwattr $C$DW$778, DW_AT_data_member_location[DW_OP_plus_uconst 0x7]
    7480                      .dwattr $C$DW$778, DW_AT_accessibility(DW_ACCESS_public)
    7481              $C$DW$779       .dwtag  DW_TAG_member
    7482                      .dwattr $C$DW$779, DW_AT_type(*$C$DW$T$56)
    7483                      .dwattr $C$DW$779, DW_AT_name("numCtrlTicksPerEstTick")
    7484                      .dwattr $C$DW$779, DW_AT_TI_symbol_name("_numCtrlTicksPerEstTick")
    7485                      .dwattr $C$DW$779, DW_AT_data_member_location[DW_OP_plus_uconst 0x8]
    7486                      .dwattr $C$DW$779, DW_AT_accessibility(DW_ACCESS_public)
    7487              $C$DW$780       .dwtag  DW_TAG_member
    7488                      .dwattr $C$DW$780, DW_AT_type(*$C$DW$T$56)
    7489                      .dwattr $C$DW$780, DW_AT_name("numCtrlTicksPerSpeedTick")
    7490                      .dwattr $C$DW$780, DW_AT_TI_symbol_name("_numCtrlTicksPerSpeedTick")
    7491                      .dwattr $C$DW$780, DW_AT_data_member_location[DW_OP_plus_uconst 0x9]
    7492                      .dwattr $C$DW$780, DW_AT_accessibility(DW_ACCESS_public)
    7493              $C$DW$781       .dwtag  DW_TAG_member
    7494                      .dwattr $C$DW$781, DW_AT_type(*$C$DW$T$56)
    7495                      .dwattr $C$DW$781, DW_AT_name("numCtrlTicksPerTrajTick")
    7496                      .dwattr $C$DW$781, DW_AT_TI_symbol_name("_numCtrlTicksPerTrajTick")
    7497                      .dwattr $C$DW$781, DW_AT_data_member_location[DW_OP_plus_uconst 0xa]
    7498                      .dwattr $C$DW$781, DW_AT_accessibility(DW_ACCESS_public)
    7499              $C$DW$782       .dwtag  DW_TAG_member
    7500                      .dwattr $C$DW$782, DW_AT_type(*$C$DW$T$25)
    7501                      .dwattr $C$DW$782, DW_AT_name("numCurrentSensors")
    7502                      .dwattr $C$DW$782, DW_AT_TI_symbol_name("_numCurrentSensors")
    7503                      .dwattr $C$DW$782, DW_AT_data_member_location[DW_OP_plus_uconst 0xb]
    7504                      .dwattr $C$DW$782, DW_AT_accessibility(DW_ACCESS_public)
    7505              $C$DW$783       .dwtag  DW_TAG_member
    7506                      .dwattr $C$DW$783, DW_AT_type(*$C$DW$T$25)
    7507                      .dwattr $C$DW$783, DW_AT_name("numVoltageSensors")
    7508                      .dwattr $C$DW$783, DW_AT_TI_symbol_name("_numVoltageSensors")
    7509                      .dwattr $C$DW$783, DW_AT_data_member_location[DW_OP_plus_uconst 0xc]
    7510                      .dwattr $C$DW$783, DW_AT_accessibility(DW_ACCESS_public)
    7511              $C$DW$784       .dwtag  DW_TAG_member
    7512                      .dwattr $C$DW$784, DW_AT_type(*$C$DW$T$57)
    7513                      .dwattr $C$DW$784, DW_AT_name("offsetPole_rps")
TMS320C2000 Assembler PC v6.2.5 Tue Oct 10 18:48:26 2017

Tools Copyright (c) 1996-2014 Texas Instruments Incorporated
C:\Users\wmj\AppData\Local\Temp\0239610                              PAGE  151

    7514                      .dwattr $C$DW$784, DW_AT_TI_symbol_name("_offsetPole_rps")
    7515                      .dwattr $C$DW$784, DW_AT_data_member_location[DW_OP_plus_uconst 0xe]
    7516                      .dwattr $C$DW$784, DW_AT_accessibility(DW_ACCESS_public)
    7517              $C$DW$785       .dwtag  DW_TAG_member
    7518                      .dwattr $C$DW$785, DW_AT_type(*$C$DW$T$57)
    7519                      .dwattr $C$DW$785, DW_AT_name("fluxPole_rps")
    7520                      .dwattr $C$DW$785, DW_AT_TI_symbol_name("_fluxPole_rps")
    7521                      .dwattr $C$DW$785, DW_AT_data_member_location[DW_OP_plus_uconst 0x10]
    7522                      .dwattr $C$DW$785, DW_AT_accessibility(DW_ACCESS_public)
    7523              $C$DW$786       .dwtag  DW_TAG_member
    7524                      .dwattr $C$DW$786, DW_AT_type(*$C$DW$T$57)
    7525                      .dwattr $C$DW$786, DW_AT_name("zeroSpeedLimit")
    7526                      .dwattr $C$DW$786, DW_AT_TI_symbol_name("_zeroSpeedLimit")
    7527                      .dwattr $C$DW$786, DW_AT_data_member_location[DW_OP_plus_uconst 0x12]
    7528                      .dwattr $C$DW$786, DW_AT_accessibility(DW_ACCESS_public)
    7529              $C$DW$787       .dwtag  DW_TAG_member
    7530                      .dwattr $C$DW$787, DW_AT_type(*$C$DW$T$57)
    7531                      .dwattr $C$DW$787, DW_AT_name("forceAngleFreq_Hz")
    7532                      .dwattr $C$DW$787, DW_AT_TI_symbol_name("_forceAngleFreq_Hz")
    7533                      .dwattr $C$DW$787, DW_AT_data_member_location[DW_OP_plus_uconst 0x14]
    7534                      .dwattr $C$DW$787, DW_AT_accessibility(DW_ACCESS_public)
    7535              $C$DW$788       .dwtag  DW_TAG_member
    7536                      .dwattr $C$DW$788, DW_AT_type(*$C$DW$T$57)
    7537                      .dwattr $C$DW$788, DW_AT_name("maxAccel_Hzps")
    7538                      .dwattr $C$DW$788, DW_AT_TI_symbol_name("_maxAccel_Hzps")
    7539                      .dwattr $C$DW$788, DW_AT_data_member_location[DW_OP_plus_uconst 0x16]
    7540                      .dwattr $C$DW$788, DW_AT_accessibility(DW_ACCESS_public)
    7541              $C$DW$789       .dwtag  DW_TAG_member
    7542                      .dwattr $C$DW$789, DW_AT_type(*$C$DW$T$57)
    7543                      .dwattr $C$DW$789, DW_AT_name("maxAccel_est_Hzps")
    7544                      .dwattr $C$DW$789, DW_AT_TI_symbol_name("_maxAccel_est_Hzps")
    7545                      .dwattr $C$DW$789, DW_AT_data_member_location[DW_OP_plus_uconst 0x18]
    7546                      .dwattr $C$DW$789, DW_AT_accessibility(DW_ACCESS_public)
    7547              $C$DW$790       .dwtag  DW_TAG_member
    7548                      .dwattr $C$DW$790, DW_AT_type(*$C$DW$T$57)
    7549                      .dwattr $C$DW$790, DW_AT_name("directionPole_rps")
    7550                      .dwattr $C$DW$790, DW_AT_TI_symbol_name("_directionPole_rps")
    7551                      .dwattr $C$DW$790, DW_AT_data_member_location[DW_OP_plus_uconst 0x1a]
    7552                      .dwattr $C$DW$790, DW_AT_accessibility(DW_ACCESS_public)
    7553              $C$DW$791       .dwtag  DW_TAG_member
    7554                      .dwattr $C$DW$791, DW_AT_type(*$C$DW$T$57)
    7555                      .dwattr $C$DW$791, DW_AT_name("speedPole_rps")
    7556                      .dwattr $C$DW$791, DW_AT_TI_symbol_name("_speedPole_rps")
    7557                      .dwattr $C$DW$791, DW_AT_data_member_location[DW_OP_plus_uconst 0x1c]
    7558                      .dwattr $C$DW$791, DW_AT_accessibility(DW_ACCESS_public)
    7559              $C$DW$792       .dwtag  DW_TAG_member
    7560                      .dwattr $C$DW$792, DW_AT_type(*$C$DW$T$57)
    7561                      .dwattr $C$DW$792, DW_AT_name("dcBusPole_rps")
    7562                      .dwattr $C$DW$792, DW_AT_TI_symbol_name("_dcBusPole_rps")
    7563                      .dwattr $C$DW$792, DW_AT_data_member_location[DW_OP_plus_uconst 0x1e]
    7564                      .dwattr $C$DW$792, DW_AT_accessibility(DW_ACCESS_public)
    7565              $C$DW$793       .dwtag  DW_TAG_member
    7566                      .dwattr $C$DW$793, DW_AT_type(*$C$DW$T$57)
    7567                      .dwattr $C$DW$793, DW_AT_name("fluxFraction")
    7568                      .dwattr $C$DW$793, DW_AT_TI_symbol_name("_fluxFraction")
TMS320C2000 Assembler PC v6.2.5 Tue Oct 10 18:48:26 2017

Tools Copyright (c) 1996-2014 Texas Instruments Incorporated
C:\Users\wmj\AppData\Local\Temp\0239610                              PAGE  152

    7569                      .dwattr $C$DW$793, DW_AT_data_member_location[DW_OP_plus_uconst 0x20]
    7570                      .dwattr $C$DW$793, DW_AT_accessibility(DW_ACCESS_public)
    7571              $C$DW$794       .dwtag  DW_TAG_member
    7572                      .dwattr $C$DW$794, DW_AT_type(*$C$DW$T$57)
    7573                      .dwattr $C$DW$794, DW_AT_name("indEst_speedMaxFraction")
    7574                      .dwattr $C$DW$794, DW_AT_TI_symbol_name("_indEst_speedMaxFraction")
    7575                      .dwattr $C$DW$794, DW_AT_data_member_location[DW_OP_plus_uconst 0x22]
    7576                      .dwattr $C$DW$794, DW_AT_accessibility(DW_ACCESS_public)
    7577              $C$DW$795       .dwtag  DW_TAG_member
    7578                      .dwattr $C$DW$795, DW_AT_type(*$C$DW$T$57)
    7579                      .dwattr $C$DW$795, DW_AT_name("powerWarpGain")
    7580                      .dwattr $C$DW$795, DW_AT_TI_symbol_name("_powerWarpGain")
    7581                      .dwattr $C$DW$795, DW_AT_data_member_location[DW_OP_plus_uconst 0x24]
    7582                      .dwattr $C$DW$795, DW_AT_accessibility(DW_ACCESS_public)
    7583              $C$DW$796       .dwtag  DW_TAG_member
    7584                      .dwattr $C$DW$796, DW_AT_type(*$C$DW$T$56)
    7585                      .dwattr $C$DW$796, DW_AT_name("systemFreq_MHz")
    7586                      .dwattr $C$DW$796, DW_AT_TI_symbol_name("_systemFreq_MHz")
    7587                      .dwattr $C$DW$796, DW_AT_data_member_location[DW_OP_plus_uconst 0x26]
    7588                      .dwattr $C$DW$796, DW_AT_accessibility(DW_ACCESS_public)
    7589              $C$DW$797       .dwtag  DW_TAG_member
    7590                      .dwattr $C$DW$797, DW_AT_type(*$C$DW$T$57)
    7591                      .dwattr $C$DW$797, DW_AT_name("pwmPeriod_usec")
    7592                      .dwattr $C$DW$797, DW_AT_TI_symbol_name("_pwmPeriod_usec")
    7593                      .dwattr $C$DW$797, DW_AT_data_member_location[DW_OP_plus_uconst 0x28]
    7594                      .dwattr $C$DW$797, DW_AT_accessibility(DW_ACCESS_public)
    7595              $C$DW$798       .dwtag  DW_TAG_member
    7596                      .dwattr $C$DW$798, DW_AT_type(*$C$DW$T$57)
    7597                      .dwattr $C$DW$798, DW_AT_name("voltage_sf")
    7598                      .dwattr $C$DW$798, DW_AT_TI_symbol_name("_voltage_sf")
    7599                      .dwattr $C$DW$798, DW_AT_data_member_location[DW_OP_plus_uconst 0x2a]
    7600                      .dwattr $C$DW$798, DW_AT_accessibility(DW_ACCESS_public)
    7601              $C$DW$799       .dwtag  DW_TAG_member
    7602                      .dwattr $C$DW$799, DW_AT_type(*$C$DW$T$57)
    7603                      .dwattr $C$DW$799, DW_AT_name("current_sf")
    7604                      .dwattr $C$DW$799, DW_AT_TI_symbol_name("_current_sf")
    7605                      .dwattr $C$DW$799, DW_AT_data_member_location[DW_OP_plus_uconst 0x2c]
    7606                      .dwattr $C$DW$799, DW_AT_accessibility(DW_ACCESS_public)
    7607              $C$DW$800       .dwtag  DW_TAG_member
    7608                      .dwattr $C$DW$800, DW_AT_type(*$C$DW$T$57)
    7609                      .dwattr $C$DW$800, DW_AT_name("voltageFilterPole_rps")
    7610                      .dwattr $C$DW$800, DW_AT_TI_symbol_name("_voltageFilterPole_rps")
    7611                      .dwattr $C$DW$800, DW_AT_data_member_location[DW_OP_plus_uconst 0x2e]
    7612                      .dwattr $C$DW$800, DW_AT_accessibility(DW_ACCESS_public)
    7613              $C$DW$801       .dwtag  DW_TAG_member
    7614                      .dwattr $C$DW$801, DW_AT_type(*$C$DW$T$57)
    7615                      .dwattr $C$DW$801, DW_AT_name("maxVsMag_pu")
    7616                      .dwattr $C$DW$801, DW_AT_TI_symbol_name("_maxVsMag_pu")
    7617                      .dwattr $C$DW$801, DW_AT_data_member_location[DW_OP_plus_uconst 0x30]
    7618                      .dwattr $C$DW$801, DW_AT_accessibility(DW_ACCESS_public)
    7619              $C$DW$802       .dwtag  DW_TAG_member
    7620                      .dwattr $C$DW$802, DW_AT_type(*$C$DW$T$57)
    7621                      .dwattr $C$DW$802, DW_AT_name("estKappa")
    7622                      .dwattr $C$DW$802, DW_AT_TI_symbol_name("_estKappa")
    7623                      .dwattr $C$DW$802, DW_AT_data_member_location[DW_OP_plus_uconst 0x32]
TMS320C2000 Assembler PC v6.2.5 Tue Oct 10 18:48:26 2017

Tools Copyright (c) 1996-2014 Texas Instruments Incorporated
C:\Users\wmj\AppData\Local\Temp\0239610                              PAGE  153

    7624                      .dwattr $C$DW$802, DW_AT_accessibility(DW_ACCESS_public)
    7625              $C$DW$803       .dwtag  DW_TAG_member
    7626                      .dwattr $C$DW$803, DW_AT_type(*$C$DW$T$69)
    7627                      .dwattr $C$DW$803, DW_AT_name("motor_type")
    7628                      .dwattr $C$DW$803, DW_AT_TI_symbol_name("_motor_type")
    7629                      .dwattr $C$DW$803, DW_AT_data_member_location[DW_OP_plus_uconst 0x34]
    7630                      .dwattr $C$DW$803, DW_AT_accessibility(DW_ACCESS_public)
    7631              $C$DW$804       .dwtag  DW_TAG_member
    7632                      .dwattr $C$DW$804, DW_AT_type(*$C$DW$T$56)
    7633                      .dwattr $C$DW$804, DW_AT_name("motor_numPolePairs")
    7634                      .dwattr $C$DW$804, DW_AT_TI_symbol_name("_motor_numPolePairs")
    7635                      .dwattr $C$DW$804, DW_AT_data_member_location[DW_OP_plus_uconst 0x35]
    7636                      .dwattr $C$DW$804, DW_AT_accessibility(DW_ACCESS_public)
    7637              $C$DW$805       .dwtag  DW_TAG_member
    7638                      .dwattr $C$DW$805, DW_AT_type(*$C$DW$T$57)
    7639                      .dwattr $C$DW$805, DW_AT_name("motor_ratedFlux")
    7640                      .dwattr $C$DW$805, DW_AT_TI_symbol_name("_motor_ratedFlux")
    7641                      .dwattr $C$DW$805, DW_AT_data_member_location[DW_OP_plus_uconst 0x36]
    7642                      .dwattr $C$DW$805, DW_AT_accessibility(DW_ACCESS_public)
    7643              $C$DW$806       .dwtag  DW_TAG_member
    7644                      .dwattr $C$DW$806, DW_AT_type(*$C$DW$T$57)
    7645                      .dwattr $C$DW$806, DW_AT_name("motor_Rr")
    7646                      .dwattr $C$DW$806, DW_AT_TI_symbol_name("_motor_Rr")
    7647                      .dwattr $C$DW$806, DW_AT_data_member_location[DW_OP_plus_uconst 0x38]
    7648                      .dwattr $C$DW$806, DW_AT_accessibility(DW_ACCESS_public)
    7649              $C$DW$807       .dwtag  DW_TAG_member
    7650                      .dwattr $C$DW$807, DW_AT_type(*$C$DW$T$57)
    7651                      .dwattr $C$DW$807, DW_AT_name("motor_Rs")
    7652                      .dwattr $C$DW$807, DW_AT_TI_symbol_name("_motor_Rs")
    7653                      .dwattr $C$DW$807, DW_AT_data_member_location[DW_OP_plus_uconst 0x3a]
    7654                      .dwattr $C$DW$807, DW_AT_accessibility(DW_ACCESS_public)
    7655              $C$DW$808       .dwtag  DW_TAG_member
    7656                      .dwattr $C$DW$808, DW_AT_type(*$C$DW$T$57)
    7657                      .dwattr $C$DW$808, DW_AT_name("motor_Ls_d")
    7658                      .dwattr $C$DW$808, DW_AT_TI_symbol_name("_motor_Ls_d")
    7659                      .dwattr $C$DW$808, DW_AT_data_member_location[DW_OP_plus_uconst 0x3c]
    7660                      .dwattr $C$DW$808, DW_AT_accessibility(DW_ACCESS_public)
    7661              $C$DW$809       .dwtag  DW_TAG_member
    7662                      .dwattr $C$DW$809, DW_AT_type(*$C$DW$T$57)
    7663                      .dwattr $C$DW$809, DW_AT_name("motor_Ls_q")
    7664                      .dwattr $C$DW$809, DW_AT_TI_symbol_name("_motor_Ls_q")
    7665                      .dwattr $C$DW$809, DW_AT_data_member_location[DW_OP_plus_uconst 0x3e]
    7666                      .dwattr $C$DW$809, DW_AT_accessibility(DW_ACCESS_public)
    7667              $C$DW$810       .dwtag  DW_TAG_member
    7668                      .dwattr $C$DW$810, DW_AT_type(*$C$DW$T$57)
    7669                      .dwattr $C$DW$810, DW_AT_name("maxCurrent")
    7670                      .dwattr $C$DW$810, DW_AT_TI_symbol_name("_maxCurrent")
    7671                      .dwattr $C$DW$810, DW_AT_data_member_location[DW_OP_plus_uconst 0x40]
    7672                      .dwattr $C$DW$810, DW_AT_accessibility(DW_ACCESS_public)
    7673              $C$DW$811       .dwtag  DW_TAG_member
    7674                      .dwattr $C$DW$811, DW_AT_type(*$C$DW$T$57)
    7675                      .dwattr $C$DW$811, DW_AT_name("maxCurrent_resEst")
    7676                      .dwattr $C$DW$811, DW_AT_TI_symbol_name("_maxCurrent_resEst")
    7677                      .dwattr $C$DW$811, DW_AT_data_member_location[DW_OP_plus_uconst 0x42]
    7678                      .dwattr $C$DW$811, DW_AT_accessibility(DW_ACCESS_public)
TMS320C2000 Assembler PC v6.2.5 Tue Oct 10 18:48:26 2017

Tools Copyright (c) 1996-2014 Texas Instruments Incorporated
C:\Users\wmj\AppData\Local\Temp\0239610                              PAGE  154

    7679              $C$DW$812       .dwtag  DW_TAG_member
    7680                      .dwattr $C$DW$812, DW_AT_type(*$C$DW$T$57)
    7681                      .dwattr $C$DW$812, DW_AT_name("maxCurrent_indEst")
    7682                      .dwattr $C$DW$812, DW_AT_TI_symbol_name("_maxCurrent_indEst")
    7683                      .dwattr $C$DW$812, DW_AT_data_member_location[DW_OP_plus_uconst 0x44]
    7684                      .dwattr $C$DW$812, DW_AT_accessibility(DW_ACCESS_public)
    7685              $C$DW$813       .dwtag  DW_TAG_member
    7686                      .dwattr $C$DW$813, DW_AT_type(*$C$DW$T$57)
    7687                      .dwattr $C$DW$813, DW_AT_name("maxCurrentSlope")
    7688                      .dwattr $C$DW$813, DW_AT_TI_symbol_name("_maxCurrentSlope")
    7689                      .dwattr $C$DW$813, DW_AT_data_member_location[DW_OP_plus_uconst 0x46]
    7690                      .dwattr $C$DW$813, DW_AT_accessibility(DW_ACCESS_public)
    7691              $C$DW$814       .dwtag  DW_TAG_member
    7692                      .dwattr $C$DW$814, DW_AT_type(*$C$DW$T$57)
    7693                      .dwattr $C$DW$814, DW_AT_name("maxCurrentSlope_powerWarp")
    7694                      .dwattr $C$DW$814, DW_AT_TI_symbol_name("_maxCurrentSlope_powerWarp")
    7695                      .dwattr $C$DW$814, DW_AT_data_member_location[DW_OP_plus_uconst 0x48]
    7696                      .dwattr $C$DW$814, DW_AT_accessibility(DW_ACCESS_public)
    7697              $C$DW$815       .dwtag  DW_TAG_member
